
    车型ID：691b

    模拟：协议模拟-->691b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:754 02 10 01 00 00 00 00 00       $~  ANS000:75C 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:754 02 3E 00 00 00 00 00 00       $!  ANS000:75C 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:754 03 19 02 09 00 00 00 00       $#  ANS000:75C 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:754 04 14 FF FF FF 00 00 00       $$  ANS000:75C 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:754 03 22 F1 87 00 00 00 00       $%  ANS000:75C 03 22 F1 87 00 00 00 00
  $%  REQ001:754 03 22 F1 89 00 00 00 00       $%  ANS001:75C 03 22 F1 89 00 00 00 00
  $%  REQ002:754 03 22 F1 90 00 00 00 00       $%  ANS002:75C 03 22 F1 90 00 00 00 00
  $%  REQ003:754 03 22 F1 91 00 00 00 00       $%  ANS003:75C 03 22 F1 91 00 00 00 00
  $%  REQ004:754 03 22 F1 93 00 00 00 00       $%  ANS004:75C 03 22 F1 93 00 00 00 00
  $%  REQ005:754 03 22 F1 95 00 00 00 00       $%  ANS005:75C 03 22 F1 95 00 00 00 00
  $%  REQ006:754 03 22 F1 98 00 00 00 00       $%  ANS006:75C 03 22 F1 98 00 00 00 00
  $%  REQ007:754 03 22 F1 99 00 00 00 00       $%  ANS007:75C 03 22 F1 99 00 00 00 00
  $%  REQ008:754 03 22 F1 9D 00 00 00 00       $%  ANS008:75C 03 22 F1 9D 00 00 00 00
  $%  REQ009:754 03 22 F1 A1 00 00 00 00       $%  ANS009:75C 03 22 F1 A1 00 00 00 00

  $%  000:零件号:                     $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  001:ECU软件版本号:              $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:VIN:                        $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  003:ECU硬件版本号:              $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  004:供应商ECU硬件版本号:        $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:供应商ECU软件版本号:        $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:测试仪序列号:               $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  007:编程日期:                   $%    $%  ANS007.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  008:ECU安装日期:                $%    $%  ANS008.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  009:系统配置:                   $%    $%  ANS009.BYTE004  $%  Y=HEX(X1,X2);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:754 03 22 3C E0 00 00 00 00       $  ANS000:75C 03 22 3C E0 00 00 00 00
  $  REQ001:754 03 22 3C E2 00 00 00 00       $  ANS001:75C 03 22 3C E2 00 00 00 00
  $  REQ002:754 03 22 3C E3 00 00 00 00       $  ANS002:75C 03 22 3C E3 00 00 00 00
  $  REQ003:754 03 22 3C E4 00 00 00 00       $  ANS003:75C 03 22 3C E4 00 00 00 00
  $  REQ004:754 03 22 3C E5 00 00 00 00       $  ANS004:75C 03 22 3C E5 00 00 00 00
  $  REQ005:754 03 22 3C E6 00 00 00 00       $  ANS005:75C 03 22 3C E6 00 00 00 00
  $  REQ006:754 03 22 3C E7 00 00 00 00       $  ANS006:75C 03 22 3C E7 00 00 00 00
  $  REQ007:754 03 22 3C E9 00 00 00 00       $  ANS007:75C 03 22 3C E9 00 00 00 00
  $  REQ008:754 03 22 3C EA 00 00 00 00       $  ANS008:75C 03 22 3C EA 00 00 00 00
  $  REQ009:754 03 22 3C EB 00 00 00 00       $  ANS009:75C 03 22 3C EB 00 00 00 00
  $  REQ010:754 03 22 3C EC 00 00 00 00       $  ANS010:75C 03 22 3C EC 00 00 00 00
  $  REQ011:754 03 22 3C ED 00 00 00 00       $  ANS011:75C 03 22 3C ED 00 00 00 00
  $  REQ012:754 03 22 3C EE 00 00 00 00       $  ANS012:75C 03 22 3C EE 00 00 00 00
  $  REQ013:754 03 22 3C EF 00 00 00 00       $  ANS013:75C 03 22 3C EF 00 00 00 00
  $  REQ014:754 03 22 3C F0 00 00 00 00       $  ANS014:75C 03 22 3C F0 00 00 00 00
  $  REQ015:754 03 22 3C F1 00 00 00 00       $  ANS015:75C 03 22 3C F1 00 00 00 00
  $  REQ016:754 03 22 3C F3 00 00 00 00       $  ANS016:75C 03 22 3C F3 00 00 00 00
  $  REQ017:754 03 22 3C F4 00 00 00 00       $  ANS017:75C 03 22 3C F4 00 00 00 00
  $  REQ018:754 03 22 3C FD 00 00 00 00       $  ANS018:75C 03 22 3C FD 00 00 00 00
  $  REQ019:754 03 22 3C FE 00 00 00 00       $  ANS019:75C 03 22 3C FE 00 00 00 00
  $  REQ020:754 03 22 3C FF 00 00 00 00       $  ANS020:75C 03 22 3C FF 00 00 00 00

  $  000.驾驶室车门开关状态                               $    $                 $    $  ANS000.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  001.驾驶室后视镜转向灯状态                           $    $                 $    $  ANS001.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  002.驾驶室后视镜折叠状态                             $    $                 $    $  ANS002.BYTE004  $  if(X1==0) y=@011f;else if(X1==1) y=@0120;else y=@0004;
  $  003.驾驶室后视镜调节状态                             $    $                 $    $  ANS003.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@02fc;else if(X1==2) y=@02fd;else y=@0004;
  $  004.驾驶室后视镜加热状态                             $    $                 $    $  ANS004.BYTE004  $  if(X1==0) y=@02fb;else if(X1==1) y=@01f4;else y=@0004;
  $  005.驾驶室车门锁状态                                 $    $                 $    $  ANS005.BYTE004  $  if(X1==0) y=@0030;else if(X1==1) y=@004b;else y=@0004;
  $  006.车门灯迎宾灯状态                                 $    $                 $    $  ANS006.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  007.驾驶室车窗开关状态                               $    $                 $    $  ANS007.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0308;else if(X1==2) y=@0309;else if(X1==3) y=@030a;else if(X1==4) y=@030b;else y=@0004;
  $  008.驾驶侧右车窗开关状态                             $    $                 $    $  ANS008.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0308;else if(X1==2) y=@0309;else if(X1==3) y=@030a;else if(X1==4) y=@030b;else y=@0004;
  $  009.驾驶侧左后车窗开关状态                           $    $                 $    $  ANS009.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0308;else if(X1==2) y=@0309;else if(X1==3) y=@030a;else if(X1==4) y=@030b;else y=@0004;
  $  010.驾驶侧右后车窗开关状态                           $    $                 $    $  ANS010.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0308;else if(X1==2) y=@0309;else if(X1==3) y=@030a;else if(X1==4) y=@030b;else y=@0004;
  $  011.后车窗禁止功能状态                               $    $                 $    $  ANS011.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  012.后视镜功能开关状态                               $    $                 $    $  ANS012.BYTE004  $  if(X1==0) y=@00af;else if(X1==1) y=@0305;else if(X1==2) y=@0306;else if(X1==3) y=@01f4;else if(X1==4) y=@0120;else if(X1==7) y=@0307;else y=@0004;
  $  013.后视镜调节开关状态                               $    $                 $    $  ANS013.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0308;else if(X1==2) y=@0309;else if(X1==3) y=@0121;else if(X1==4) y=@0122;else y=@0004;
  $  014.机械钥匙输入开关状态                             $    $                 $    $  ANS014.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@004b;else if(X1==2) y=@0030;else y=@0004;
  $  015.后视镜自动折叠功能状态                           $    $                 $    $  ANS015.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  016.中控锁指示灯输出状态                             $    $                 $    $  ANS016.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  017.后视镜记忆位置数                                 $    $                 $    $  ANS017.BYTE004  $  if(X1==0) y=@0107;else if(X1==1) y=@0095;else if(X1==2) y=@0096;else if(X1==3) y=@0097;else y=@0004;
  $  018.APA(自动泊车辅助系统)报文反馈位置1               $    $  Hall Pulse     $    $  ANS018.BYTE004  $  Y=(X1*256+X2)*1;
  $  019.APA(自动泊车辅助系统)报文反馈发动机速度1         $    $  rad/s          $    $  ANS018.BYTE004  $  Y=(X3*256+X4)*0.25;
  $  020.APA(自动泊车辅助系统)报文反馈历史速度1           $    $  rad/s          $    $  ANS018.BYTE004  $  Y=(X5*256+X6)*0.25;
  $  021.APA(自动泊车辅助系统)报文反馈夹力1               $    $  N              $    $  ANS018.BYTE004  $  Y=X7*1;
  $  022.APA(自动泊车辅助系统)报文反馈电压1               $    $  V              $    $  ANS018.BYTE004  $  Y=X8*1;
  $  023.APA(自动泊车辅助系统)报文反馈位置2               $    $  Hall Pulse     $    $  ANS019.BYTE004  $  Y=(X1*256+X2)*1;
  $  024.APA(自动泊车辅助系统)报文反馈发动机速度2         $    $  rad/s          $    $  ANS019.BYTE004  $  Y=(X3*256+X4)*0.25;
  $  025.APA(自动泊车辅助系统)报文反馈轮廓速度基础2       $    $  rad/s          $    $  ANS019.BYTE004  $  Y=X5*0.25;
  $  026.APA(自动泊车辅助系统)报文反馈差速2               $    $  rad/s          $    $  ANS019.BYTE004  $  Y=X6*0.25;
  $  027.APA(自动泊车辅助系统)报文反馈轮廓差别错误2       $    $  N              $    $  ANS019.BYTE004  $  Y=X7*1;
  $  028.APA(自动泊车辅助系统)报文反馈位置3               $    $  Hall Pulse     $    $  ANS020.BYTE004  $  Y=(X1*256+X2)*1;
  $  029.APA(自动泊车辅助系统)报文反馈发动机速度3         $    $  rad/s          $    $  ANS020.BYTE004  $  Y=(X3*256+X4)*0.25;
  $  030.APA(自动泊车辅助系统)报文反馈加速力3             $    $  N              $    $  ANS020.BYTE004  $  Y=X5*1;
  $  031.APA(自动泊车辅助系统)报文反馈防夹3               $    $  N              $    $  ANS020.BYTE004  $  Y=X6*1;
  $  032.APA(自动泊车辅助系统)报文反馈敏感速度3           $    $  rad/s          $    $  ANS020.BYTE004  $  Y=X7*1;
  $  033.APA(自动泊车辅助系统)报文反馈环境温度3           $    $  degC           $    $  ANS020.BYTE004  $  Y=X8*1-40;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:754 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
