
    车型ID：6924

    模拟：协议模拟-->6924

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:722 02 10 01 00 00 00 00 00       $~  ANS000:72A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:722 02 3E 00 00 00 00 00 00       $!  ANS000:72A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:722 03 19 02 09 00 00 00 00       $#  ANS000:72A 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:722 04 14 FF FF FF 00 00 00       $$  ANS000:72A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:722 03 22 F1 00 00 00 00 00       $%  ANS000:72A 03 22 F1 00 00 00 00 00
  $%  REQ001:722 03 22 F1 80 00 00 00 00       $%  ANS001:72A 03 22 F1 80 00 00 00 00
  $%  REQ002:722 03 22 F1 81 00 00 00 00       $%  ANS002:72A 03 22 F1 81 00 00 00 00
  $%  REQ003:722 03 22 F1 83 00 00 00 00       $%  ANS003:72A 03 22 F1 83 00 00 00 00
  $%  REQ004:722 03 22 F1 87 00 00 00 00       $%  ANS004:72A 03 22 F1 87 00 00 00 00
  $%  REQ005:722 03 22 F1 89 00 00 00 00       $%  ANS005:72A 03 22 F1 89 00 00 00 00
  $%  REQ006:722 03 22 F1 8C 00 00 00 00       $%  ANS006:72A 03 22 F1 8C 00 00 00 00
  $%  REQ007:722 03 22 F1 90 00 00 00 00       $%  ANS007:72A 03 22 F1 90 00 00 00 00
  $%  REQ008:722 03 22 F1 91 00 00 00 00       $%  ANS008:72A 03 22 F1 91 00 00 00 00
  $%  REQ009:722 03 22 F1 92 00 00 00 00       $%  ANS009:72A 03 22 F1 92 00 00 00 00
  $%  REQ010:722 03 22 F1 93 00 00 00 00       $%  ANS010:72A 03 22 F1 93 00 00 00 00
  $%  REQ011:722 03 22 F1 94 00 00 00 00       $%  ANS011:72A 03 22 F1 94 00 00 00 00
  $%  REQ012:722 03 22 F1 95 00 00 00 00       $%  ANS012:72A 03 22 F1 95 00 00 00 00
  $%  REQ013:722 03 22 F1 98 00 00 00 00       $%  ANS013:72A 03 22 F1 98 00 00 00 00
  $%  REQ014:722 03 22 F1 99 00 00 00 00       $%  ANS014:72A 03 22 F1 99 00 00 00 00
  $%  REQ015:722 03 22 F1 9C 00 00 00 00       $%  ANS015:72A 03 22 F1 9C 00 00 00 00
  $%  REQ016:722 03 22 F1 9D 00 00 00 00       $%  ANS016:72A 03 22 F1 9D 00 00 00 00
  $%  REQ017:722 03 22 F1 A1 00 00 00 00       $%  ANS017:72A 03 22 F1 A1 00 00 00 00
  $%  REQ018:722 03 22 F1 A4 00 00 00 00       $%  ANS018:72A 03 22 F1 A4 00 00 00 00
  $%  REQ019:722 03 22 F1 A5 00 00 00 00       $%  ANS019:72A 03 22 F1 A5 00 00 00 00
  $%  REQ020:722 03 22 F1 A6 00 00 00 00       $%  ANS020:72A 03 22 F1 A6 00 00 00 00

  $%  000:模式配置:                       $%    $%  ANS000.BYTE004  $%  Y=HEX(X1);
  $%  001:ECU启动软件版本号:              $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:ECU应用软件版本号:              $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  003:供应商ECU启动软件版本号:        $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  004:OEM零件号:                      $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:ECU软件版本号:                  $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  006:ECU序列号:                      $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  007:VIN:                            $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  008:ECU硬件版本号:                  $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  009:供应商硬件编号:                 $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:供应商硬件版本号:               $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:供应商软件版本号:               $%    $%  ANS011.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  012:供应商软件版本编号:             $%    $%  ANS012.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  013:测试仪序列号:                   $%    $%  ANS013.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  014:编程日期:                       $%    $%  ANS014.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  015:标定软件版本号:                 $%    $%  ANS015.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  016:ECU安装日期:                    $%    $%  ANS016.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  017:系统配置1:                      $%    $%  ANS017.BYTE004  $%  Y=HEX(X1,X2);
  $%  018:供应商ECU标定软件版本号:        $%    $%  ANS018.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  019:车辆规格编号:                   $%    $%  ANS019.BYTE004  $%  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18);
  $%  020:生产线车辆生产日期:             $%    $%  ANS020.BYTE004  $%  Y=HEX(X1,X2,X3,X4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:722 03 22 2A 00 00 00 00 00       $  ANS000:72A 03 22 2A 00 00 00 00 00
  $  REQ001:722 03 22 2A 01 00 00 00 00       $  ANS001:72A 03 22 2A 01 00 00 00 00
  $  REQ002:722 03 22 2A 02 00 00 00 00       $  ANS002:72A 03 22 2A 02 00 00 00 00
  $  REQ003:722 03 22 2A 03 00 00 00 00       $  ANS003:72A 03 22 2A 03 00 00 00 00
  $  REQ004:722 03 22 2A 04 00 00 00 00       $  ANS004:72A 03 22 2A 04 00 00 00 00
  $  REQ005:722 03 22 2A 05 00 00 00 00       $  ANS005:72A 03 22 2A 05 00 00 00 00
  $  REQ006:722 03 22 2A 06 00 00 00 00       $  ANS006:72A 03 22 2A 06 00 00 00 00
  $  REQ007:722 03 22 2A 07 00 00 00 00       $  ANS007:72A 03 22 2A 07 00 00 00 00
  $  REQ008:722 03 22 2A 08 00 00 00 00       $  ANS008:72A 03 22 2A 08 00 00 00 00
  $  REQ009:722 03 22 2A 09 00 00 00 00       $  ANS009:72A 03 22 2A 09 00 00 00 00
  $  REQ010:722 03 22 2A 0A 00 00 00 00       $  ANS010:72A 03 22 2A 0A 00 00 00 00
  $  REQ011:722 03 22 2A 0B 00 00 00 00       $  ANS011:72A 03 22 2A 0B 00 00 00 00
  $  REQ012:722 03 22 2A 0C 00 00 00 00       $  ANS012:72A 03 22 2A 0C 00 00 00 00
  $  REQ013:722 03 22 2A 0D 00 00 00 00       $  ANS013:72A 03 22 2A 0D 00 00 00 00
  $  REQ014:722 03 22 2A 0E 00 00 00 00       $  ANS014:72A 03 22 2A 0E 00 00 00 00
  $  REQ015:722 03 22 2A 0F 00 00 00 00       $  ANS015:72A 03 22 2A 0F 00 00 00 00
  $  REQ016:722 03 22 2A 10 00 00 00 00       $  ANS016:72A 03 22 2A 10 00 00 00 00
  $  REQ017:722 03 22 2A 11 00 00 00 00       $  ANS017:72A 03 22 2A 11 00 00 00 00
  $  REQ018:722 03 22 2A 12 00 00 00 00       $  ANS018:72A 03 22 2A 12 00 00 00 00
  $  REQ019:722 03 22 2A 13 00 00 00 00       $  ANS019:72A 03 22 2A 13 00 00 00 00
  $  REQ020:722 03 22 2A 14 00 00 00 00       $  ANS020:72A 03 22 2A 14 00 00 00 00
  $  REQ021:722 03 22 2A 15 00 00 00 00       $  ANS021:72A 03 22 2A 15 00 00 00 00
  $  REQ022:722 03 22 2A 16 00 00 00 00       $  ANS022:72A 03 22 2A 16 00 00 00 00
  $  REQ023:722 03 22 2A 18 00 00 00 00       $  ANS023:72A 03 22 2A 18 00 00 00 00
  $  REQ024:722 03 22 2A 19 00 00 00 00       $  ANS024:72A 03 22 2A 19 00 00 00 00
  $  REQ025:722 03 22 2A 1A 00 00 00 00       $  ANS025:72A 03 22 2A 1A 00 00 00 00
  $  REQ026:722 03 22 2A 1B 00 00 00 00       $  ANS026:72A 03 22 2A 1B 00 00 00 00
  $  REQ027:722 03 22 2A 1C 00 00 00 00       $  ANS027:72A 03 22 2A 1C 00 00 00 00
  $  REQ028:722 03 22 2A 1D 00 00 00 00       $  ANS028:72A 03 22 2A 1D 00 00 00 00
  $  REQ029:722 03 22 2A 1E 00 00 00 00       $  ANS029:72A 03 22 2A 1E 00 00 00 00
  $  REQ030:722 03 22 2A 1F 00 00 00 00       $  ANS030:72A 03 22 2A 1F 00 00 00 00
  $  REQ031:722 03 22 2A 20 00 00 00 00       $  ANS031:72A 03 22 2A 20 00 00 00 00
  $  REQ032:722 03 22 2A 21 00 00 00 00       $  ANS032:72A 03 22 2A 21 00 00 00 00
  $  REQ033:722 03 22 2A 22 00 00 00 00       $  ANS033:72A 03 22 2A 22 00 00 00 00
  $  REQ034:722 03 22 2A 23 00 00 00 00       $  ANS034:72A 03 22 2A 23 00 00 00 00
  $  REQ035:722 03 22 2A 24 00 00 00 00       $  ANS035:72A 03 22 2A 24 00 00 00 00
  $  REQ036:722 03 22 2A 25 00 00 00 00       $  ANS036:72A 03 22 2A 25 00 00 00 00
  $  REQ037:722 03 22 2A 26 00 00 00 00       $  ANS037:72A 03 22 2A 26 00 00 00 00
  $  REQ038:722 03 22 2A 27 00 00 00 00       $  ANS038:72A 03 22 2A 27 00 00 00 00
  $  REQ039:722 03 22 2A 28 00 00 00 00       $  ANS039:72A 03 22 2A 28 00 00 00 00
  $  REQ040:722 03 22 2A 29 00 00 00 00       $  ANS040:72A 03 22 2A 29 00 00 00 00
  $  REQ041:722 03 22 2A 2A 00 00 00 00       $  ANS041:72A 03 22 2A 2A 00 00 00 00
  $  REQ042:722 03 22 2A 2B 00 00 00 00       $  ANS042:72A 03 22 2A 2B 00 00 00 00
  $  REQ043:722 03 22 2A 2C 00 00 00 00       $  ANS043:72A 03 22 2A 2C 00 00 00 00
  $  REQ044:722 03 22 2A 2D 00 00 00 00       $  ANS044:72A 03 22 2A 2D 00 00 00 00
  $  REQ045:722 03 22 2A 2E 00 00 00 00       $  ANS045:72A 03 22 2A 2E 00 00 00 00
  $  REQ046:722 03 22 2A 2F 00 00 00 00       $  ANS046:72A 03 22 2A 2F 00 00 00 00
  $  REQ047:722 03 22 2A 30 00 00 00 00       $  ANS047:72A 03 22 2A 30 00 00 00 00
  $  REQ048:722 03 22 2A 31 00 00 00 00       $  ANS048:72A 03 22 2A 31 00 00 00 00
  $  REQ049:722 03 22 2A 33 00 00 00 00       $  ANS049:72A 03 22 2A 33 00 00 00 00
  $  REQ050:722 03 22 2A 34 00 00 00 00       $  ANS050:72A 03 22 2A 34 00 00 00 00
  $  REQ051:722 03 22 2A 35 00 00 00 00       $  ANS051:72A 03 22 2A 35 00 00 00 00
  $  REQ052:722 03 22 2A 36 00 00 00 00       $  ANS052:72A 03 22 2A 36 00 00 00 00
  $  REQ053:722 03 22 2A 37 00 00 00 00       $  ANS053:72A 03 22 2A 37 00 00 00 00
  $  REQ054:722 03 22 2A 38 00 00 00 00       $  ANS054:72A 03 22 2A 38 00 00 00 00
  $  REQ055:722 03 22 2A 3A 00 00 00 00       $  ANS055:72A 03 22 2A 3A 00 00 00 00
  $  REQ056:722 03 22 2A 3B 00 00 00 00       $  ANS056:72A 03 22 2A 3B 00 00 00 00
  $  REQ057:722 03 22 2A 3C 00 00 00 00       $  ANS057:72A 03 22 2A 3C 00 00 00 00
  $  REQ058:722 03 22 2A 3D 00 00 00 00       $  ANS058:72A 03 22 2A 3D 00 00 00 00
  $  REQ059:722 03 22 2A 3E 00 00 00 00       $  ANS059:72A 03 22 2A 3E 00 00 00 00
  $  REQ060:722 03 22 2A 3F 00 00 00 00       $  ANS060:72A 03 22 2A 3F 00 00 00 00
  $  REQ061:722 03 22 2A 41 00 00 00 00       $  ANS061:72A 03 22 2A 41 00 00 00 00
  $  REQ062:722 03 22 2A 42 00 00 00 00       $  ANS062:72A 03 22 2A 42 00 00 00 00
  $  REQ063:722 03 22 2A 50 00 00 00 00       $  ANS063:72A 03 22 2A 50 00 00 00 00
  $  REQ064:722 03 22 2A 51 00 00 00 00       $  ANS064:72A 03 22 2A 51 00 00 00 00
  $  REQ065:722 03 22 2A 52 00 00 00 00       $  ANS065:72A 03 22 2A 52 00 00 00 00
  $  REQ066:722 03 22 2A 53 00 00 00 00       $  ANS066:72A 03 22 2A 53 00 00 00 00

  $  000.摄像头距左车轮距离                                                                 $    $  m         $    $  ANS000.BYTE004  $  if((X1*256+X2)<=500&&(X1*256+X2)>=20) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  001.摄像头距右车轮距离                                                                 $    $  m         $    $  ANS000.BYTE006  $  if((X1*256+X2)<=500&&(X1*256+X2)>=20) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  002.摄像头距目标板距离                                                                 $    $  m         $    $  ANS000.BYTE008  $  if((X1*256+X2)<=10000) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  003.摄像头安装高度                                                                     $    $  m         $    $  ANS000.BYTE010  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  004.左目标板中心距地面高度                                                             $    $  m         $    $  ANS000.BYTE012  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  005.右目标板中心距地面高度                                                             $    $  m         $    $  ANS000.BYTE014  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  006.左目标板中轴线距车辆中轴线距离                                                     $    $  m         $    $  ANS000.BYTE016  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else Y=@0004;
  $  007.右目标板中轴线距车辆中轴线距离                                                     $    $  m         $    $  ANS000.BYTE018  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else Y=@0004;
  $  008.目标板方格尺寸                                                                     $    $  rad       $    $  ANS000.BYTE020  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  009.黑白格排列方式                                                                     $    $  rad       $    $  ANS000.BYTE022  $  if(X1==1) y=@012c;else if(X1==3) y=@0324;else y=@0004;
  $  010.摄像头焦距                                                                         $    $            $    $  ANS000.BYTE023  $  if(((X1&65535)<=1000)&&((X1&65535)>=100)) Y=(X1&65535)*1;else Y=@0004;
  $  011.左下角四分之一左边的颜色                                                           $    $            $    $  ANS000.BYTE025  $  if(X1==0) y=@0322;else if(X1==1) y=@0323;else y=@0004;
  $  012.左下角四分之一右边的颜色                                                           $    $            $    $  ANS000.BYTE026  $  if(X1==0) y=@0322;else if(X1==1) y=@0323;else y=@0004;
  $  013.目标板数量                                                                         $    $            $    $  ANS000.BYTE027  $  if(X1==1) y=@012a;else if(X1==2) y=@012b;else y=@0004;
  $  014.最大俯仰方向标定值                                                                 $    $  rad       $    $  ANS000.BYTE028  $  if(X1<=62) Y=X1*1;else Y=@0004;
  $  015.最大横摆方向标定值                                                                 $    $  Pixel     $    $  ANS000.BYTE029  $  if(X1<=47) Y=X1*1;else Y=@0004;
  $  016.最小俯仰方向标定值                                                                 $    $  Pixel     $    $  ANS000.BYTE030  $  if(X1<=40) Y=X1*1-40;else Y=@0004;
  $  017.最小横摆方向标定值                                                                 $    $  Pixel     $    $  ANS000.BYTE031  $  if(X1<=47) Y=X1*1-47;else Y=@0004;
  $  018.最大侧倾角                                                                         $    $  rad       $    $  ANS000.BYTE032  $  if(X1<=55) Y=X1*0.001;else Y=@0004;
  $  019.底部有效图像坐标值                                                                 $    $  Pixel     $    $  ANS000.BYTE033  $  if(X1<=120) Y=X1*1-120;else Y=@0004;
  $  020.顶部有效图像坐标值                                                                 $    $  Pixel     $    $  ANS000.BYTE034  $  if(X1<=120) Y=X1*1;else Y=@0004;
  $  021.摄像头到车辆前端的距离                                                             $    $  m         $    $  ANS000.BYTE035  $  Y=X1*0.01;
  $  022.摄像头到车辆中轴线的距离                                                           $    $  m         $    $  ANS000.BYTE036  $  Y=X1*0.01-1.28;
  $  023.图像处理器温度                                                                     $    $  degC      $    $  ANS001.BYTE004  $  if((X1*256+X2)<=155) Y=(X1*256+X2)*1-40;else Y=@0004;
  $  024.标定年                                                                             $    $            $    $  ANS002.BYTE004  $  Y=X1*1+2000;
  $  025.标定月                                                                             $    $            $    $  ANS002.BYTE005  $  if(X1<=12) Y=X1*1;else Y=@0004;
  $  026.标定日                                                                             $    $            $    $  ANS002.BYTE006  $  if(X1<=31) Y=X1*1;else Y=@0004;
  $  027.标定时                                                                             $    $            $    $  ANS002.BYTE007  $  if(X1<=23) Y=X1*1;else Y=@0004;
  $  028.标定分                                                                             $    $            $    $  ANS002.BYTE008  $  if(X1<=59) Y=X1*1;else Y=@0004;
  $  029.标定秒                                                                             $    $            $    $  ANS002.BYTE009  $  if(X1<=59) Y=X1*1;else Y=@0004;
  $  030.里程读取                                                                           $    $  km        $    $  ANS002.BYTE010  $  Y=X1*16777216+X2*65536+X3*256+X4;
  $  031.雾斑(相机阻塞原因)                                                                 $    $            $    $  ANS003.BYTE004  $  if(((X2>>0)&1)) Y=@0039;else Y=@012e;
  $  032.挡风玻璃结冰                                                                       $    $            $    $  ANS003.BYTE004  $  if(((X2>>1)&1)) Y=@0039;else Y=@012e;
  $  033.完全阻塞                                                                           $    $            $    $  ANS003.BYTE004  $  if(((X2>>2)&1)) Y=@0039;else Y=@012e;
  $  034.部分阻塞                                                                           $    $            $    $  ANS003.BYTE004  $  if(((X2>>3)&1)) Y=@0039;else Y=@012e;
  $  035.玷污点                                                                             $    $            $    $  ANS003.BYTE004  $  if(((X2>>4)&1)) Y=@0039;else Y=@012e;
  $  036.低光照                                                                             $    $            $    $  ANS003.BYTE004  $  if(((X2>>5)&1)) Y=@0039;else Y=@012e;
  $  037.模糊图像                                                                           $    $            $    $  ANS003.BYTE004  $  if(((X2>>6)&1)) Y=@0039;else Y=@012e;
  $  038.道路喷雾                                                                           $    $            $    $  ANS003.BYTE004  $  if(((X2>>7)&1)) Y=@0039;else Y=@012e;
  $  039.太阳光线                                                                           $    $            $    $  ANS003.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  040.自眩光                                                                             $    $            $    $  ANS003.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  041.未校准(标定失败原因)                                                               $    $            $    $  ANS004.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  042.应用程序致命错误-超出校准范围                                                      $    $            $    $  ANS004.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  043.自动修复超出范围                                                                   $    $            $    $  ANS004.BYTE004  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  044.IFC(智能前视控制模块) 5V过压(IFC内部故障原因)                                      $    $            $    $  ANS005.BYTE011  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  045.IFC(智能前视控制模块) 5V低压                                                       $    $            $    $  ANS005.BYTE011  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  046.IFC(智能前视控制模块) 3.3V过压                                                     $    $            $    $  ANS005.BYTE011  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  047.IFC(智能前视控制模块) 3.3V低压                                                     $    $            $    $  ANS005.BYTE011  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  048.IFC(智能前视控制模块) 1.8V过压                                                     $    $            $    $  ANS005.BYTE011  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  049.IFC(智能前视控制模块) 1.8V低压                                                     $    $            $    $  ANS005.BYTE011  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  050.IFC(智能前视控制模块) 1.2V过压                                                     $    $            $    $  ANS005.BYTE011  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  051.IFC(智能前视控制模块) 1.2V低压                                                     $    $            $    $  ANS005.BYTE011  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  052.IFC(智能前视控制模块) 2.8V过压                                                     $    $            $    $  ANS005.BYTE010  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  053.IFC(智能前视控制模块) 2.8V低压                                                     $    $            $    $  ANS005.BYTE010  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  054.MCU(驱动电机控制单元) PLL失败                                                      $    $            $    $  ANS005.BYTE010  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  055.MCU(驱动电机控制单元)异常恢复                                                      $    $            $    $  ANS005.BYTE010  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  056.MCU(驱动电机控制单元)闪存校验和错误                                                $    $            $    $  ANS005.BYTE010  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  057.MCU(驱动电机控制单元) RAM(随机存储器)测试失败                                      $    $            $    $  ANS005.BYTE010  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  058.MCU(驱动电机控制单元) EEPROM(电可擦除只读存储器)测试失败                           $    $            $    $  ANS005.BYTE010  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  059.无图像处理单元SPI通信                                                              $    $            $    $  ANS005.BYTE010  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  060.EyeQ存储更新                                                                       $    $            $    $  ANS005.BYTE009  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  061.EyeQ启动失败                                                                       $    $            $    $  ANS005.BYTE009  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  062.致命错误                                                                           $    $            $    $  ANS005.BYTE009  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  063.诊断连续输入信号错误                                                               $    $            $    $  ANS005.BYTE009  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  064.图像缺失                                                                           $    $            $    $  ANS005.BYTE009  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  065.DDR CRC错误                                                                        $    $            $    $  ANS005.BYTE009  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  066.AEB复核错误                                                                        $    $            $    $  ANS005.BYTE009  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  067.内部CRC错误                                                                        $    $            $    $  ANS005.BYTE009  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  068.内部信号损坏                                                                       $    $            $    $  ANS005.BYTE008  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  069.挑战响应错误                                                                       $    $            $    $  ANS005.BYTE008  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  070.旧自我数据                                                                         $    $            $    $  ANS005.BYTE008  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  071.内部图像保护错误                                                                   $    $            $    $  ANS005.BYTE008  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  072.不良标定                                                                           $    $            $    $  ANS005.BYTE008  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  073.图像索引无效                                                                       $    $            $    $  ANS005.BYTE008  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  074.MCU(驱动电机控制单元) RFC错误                                                      $    $            $    $  ANS005.BYTE008  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  075.MCU(驱动电机控制单元) CRC错误                                                      $    $            $    $  ANS005.BYTE008  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  076.挑战响应重复                                                                       $    $            $    $  ANS005.BYTE007  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  077.EyeQ CRC错误                                                                       $    $            $    $  ANS005.BYTE007  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  078.EyeQ RFC错误                                                                       $    $            $    $  ANS005.BYTE007  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  079.EyeQ ASIL错误6                                                                     $    $            $    $  ANS005.BYTE007  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  080.EyeQ ASIL错误7                                                                     $    $            $    $  ANS005.BYTE007  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  081.EyeQ ASIL错误8                                                                     $    $            $    $  ANS005.BYTE007  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  082.EyeQ ASIL错误9                                                                     $    $            $    $  ANS005.BYTE007  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  083.EyeQ ASIL错误25                                                                    $    $            $    $  ANS005.BYTE007  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  084.供应商可追溯性字段                                                                 $    $            $    $  ANS006.BYTE004  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $  085.电池电压                                                                           $    $  V         $    $  ANS007.BYTE004  $  Y=X1*0.1;
  $  086.里程读取                                                                           $    $  km        $    $  ANS008.BYTE004  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;
  $  087.车速                                                                               $    $  km/h      $    $  ANS009.BYTE004  $  Y=(X1*256+X2)*0.01;
  $  088.发动机速度                                                                         $    $  rpm       $    $  ANS010.BYTE004  $  if((X1*256+X2)<=65535) Y=((X1*256+X2)*1)/4;else Y=@0004;
  $  089.发动机状态                                                                         $    $            $    $  ANS011.BYTE004  $  if(X1==0) y=@0004;else if(X1==1) y=@0325;else y=@0004;
  $  090.EyeQ主状态                                                                         $    $            $    $  ANS012.BYTE013  $  if(X1==0) y=@0152;else if(X1==1) y=@0153;else if(X1==2) y=@0154;else if(X1==3) y=@0155;else if(X1==34) y=@0156;else if(X1==130) y=@0157;else if(X1==133) y=@0158;else if(X1==146) y=@0159;else if(X1==172) y=@015a;else if(X1==173) y=@015b;else y=@0004;
  $  091.HCU15                                                                              $    $            $    $  ANS013.BYTE004  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  092.HCU4                                                                               $    $            $    $  ANS013.BYTE004  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  093.EOL标定完成(EOL标定状态)                                                           $    $            $    $  ANS014.BYTE004  $  if(((X1>>0)&1)) Y=@014d;else Y=@014e;
  $  094.服务点标定完成                                                                     $    $            $    $  ANS014.BYTE004  $  if(((X1>>1)&1)) Y=@014d;else Y=@014e;
  $  095.SPTAC完成                                                                          $    $            $    $  ANS014.BYTE004  $  if(((X1>>2)&1)) Y=@014d;else Y=@014e;
  $  096.EOL校准错误常见原因                                                                $    $            $    $  ANS014.BYTE005  $  if(X1==0x0) y=@0131;else if(X1==0x1) y=@0132;else if(X1==0x2) y=@0133;else if(X1==0x3) y=@0134;else if(X1==0x4) y=@032e;else if(X1==0x5) y=@0136;else if(X1==0x6) y=@0137;else if(X1==0x7) y=@0138;else if(X1==0x8) y=@0139;else if(X1==0x9) y=@013a;else if(X1==0xA) y=@013b;else if(X1==0xB) y=@013c;else if(X1==0xC) y=@013d;else if(X1==0xD) y=@032f;else if(X1==0xE) y=@013f;else if(X1==0xF) y=@0140;else if(X1==0x10) y=@0141;else if(X1==0x11) y=@0142;else if(X1==0x12) y=@0143;else if(X1==0x13) y=@0144;else if(X1==0x14) y=@0145;else if(X1==0x15) y=@0146;else if(X1==0x18) y=@0147;else if(X1==0x21) y=@0148;else if(X1==0x60) y=@014b;else if(X1==0x61) y=@014c;else y=@0004;
  $  097.摄像机校准偏航值                                                                   $    $            $    $  ANS014.BYTE006  $  if((X1*256+X2)<=376) Y=(X1*256+X2)*1-188;else Y=@0004;
  $  098.摄像机标定水平值                                                                   $    $            $    $  ANS014.BYTE008  $  if((X1*256+X2)<=408) Y=(X1*256+X2)*1-160;else Y=@0004;
  $  099.摄像机标定的滚转角                                                                 $    $            $    $  ANS014.BYTE010  $  if((X1*256+X2)<=110) Y=(X1*256+X2)*0.001-0.055;else Y=@0004;
  $  100.相机自动调整偏航值                                                                 $    $            $    $  ANS014.BYTE012  $  if(X1<=80) Y=X1*1-40;else Y=@0004;
  $  101.相机自动调整地平线值                                                               $    $            $    $  ANS014.BYTE013  $  if(X1<=80) Y=X1*1-40;else Y=@0004;
  $  102.SPC状态                                                                            $    $            $    $  ANS015.BYTE004  $  if(X1==0) y=@016f;else if(X1==1) y=@0326;else if(X1==2) y=@0171;else if(X1==3) y=@0327;else if(X1==4) y=@0328;else if(X1==5) y=@0329;else if(X1==6) y=@032a;else if(X1==7) y=@032b;else if(X1==8) y=@032c;else if(X1==9) y=@032d;else y=@0004;
  $  103.SPC进程                                                                            $    $  %         $    $  ANS015.BYTE005  $  if(X1<=100) Y=X1*1;else Y=@0004;
  $  104.摄像头距目标板距离                                                                 $    $  m         $    $  ANS016.BYTE004  $  if((X1*256+X2)<=10000) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  105.左目标板中心距地面高度                                                             $    $  m         $    $  ANS016.BYTE006  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  106.右目标板中心距地面高度                                                             $    $  m         $    $  ANS016.BYTE008  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  107.左目标板中轴线距车辆中轴线距离                                                     $    $  m         $    $  ANS016.BYTE010  $  if((X1*256+X2)<=1000) Y=((X1*256+X2)*0.01)-5;else Y=@0004;
  $  108.右目标板中轴线距车辆中轴线距离                                                     $    $  m         $    $  ANS016.BYTE012  $  if((X1*256+X2)<=1000) Y=((X1*256+X2)*0.01)-5;else Y=@0004;
  $  109.目标板方格尺寸                                                                     $    $  rad       $    $  ANS016.BYTE014  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  110.左下角四分之一左边的颜色                                                           $    $  Pixel     $    $  ANS016.BYTE016  $  if(X1==0) y=@0322;else if(X1==1) y=@0323;else y=@0004;
  $  111.右下角四分之一左边的颜色                                                           $    $  Pixel     $    $  ANS016.BYTE017  $  if(X1==0) y=@0322;else if(X1==1) y=@0323;else y=@0004;
  $  112.ECU(电子控制器)生产日期                                                            $    $            $    $  ANS017.BYTE004  $  Y=HEX(X1,X2,X3);
  $  113.ECU(电子控制器)序列号                                                              $    $            $    $  ANS018.BYTE004  $  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  114.EyeQ过温(IFC EQ BT内部故障原因)                                                    $    $            $    $  ANS019.BYTE005  $  if(((X1>>0)&1)) Y=@0004;else Y=@0325;
  $  115.BIST失败                                                                           $    $            $    $  ANS019.BYTE005  $  if(((X1>>1)&1)) Y=@0004;else Y=@0325;
  $  116.PLL初始化失败                                                                      $    $            $    $  ANS019.BYTE005  $  if(((X1>>2)&1)) Y=@0004;else Y=@0325;
  $  117.Parity检查失败                                                                     $    $            $    $  ANS019.BYTE005  $  if(((X1>>3)&1)) Y=@0004;else Y=@0325;
  $  118.闪存CRC启动失败                                                                    $    $            $    $  ANS019.BYTE005  $  if(((X1>>4)&1)) Y=@0004;else Y=@0325;
  $  119.DDR初始化失败                                                                      $    $            $    $  ANS019.BYTE005  $  if(((X1>>5)&1)) Y=@0004;else Y=@0325;
  $  120.DDR过温                                                                            $    $            $    $  ANS019.BYTE005  $  if(((X1>>6)&1)) Y=@0004;else Y=@0325;
  $  121.DDR测试失败                                                                        $    $            $    $  ANS019.BYTE005  $  if(((X1>>7)&1)) Y=@0004;else Y=@0325;
  $  122.闪存CRC应用程序故障                                                                $    $            $    $  ANS019.BYTE004  $  if(((X1>>0)&1)) Y=@0004;else Y=@0325;
  $  123.闪存CRC FFS故障                                                                    $    $            $    $  ANS019.BYTE004  $  if(((X1>>1)&1)) Y=@0004;else Y=@0325;
  $  124.IFC(智能前视控制模块) EQ APP(油门踏板位置)内部故障原因                             $    $            $    $  ANS019.BYTE006  $  if((X1*256+X2)==0)Y=@003e;else if((X1*256+X2)==10)Y=@033b;else if((X1*256+X2)==11)Y=@033c;else if((X1*256+X2)==20)Y=@033d;else Y=@033e;
  $  125.IFC(智能前视控制模块) EQ主状态信号原因                                             $    $            $    $  ANS019.BYTE012  $  if(X1==0) y=@0330;else if(X1==1) y=@0331;else if(X1==2) y=@0332;else if(X1==3) y=@0333;else if(X1==0x22) y=@0334;else if(X1==0xAC) y=@0335;else if(X1==0x82) y=@0336;else if(X1==0x85) y=@0337;else if(X1==0x92) y=@0338;else if(X1==0xAA) y=@0339;else y=@033a;
  $  126.MCU(驱动电机控制单元)应用程序版本与图像处理单元不兼容(IFC软件不匹配故障原因)       $    $            $    $  ANS020.BYTE004  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  127.图像处理单元ETC(电子节气门)文件与MCU(驱动电机控制单元)校准文件不兼容               $    $            $    $  ANS020.BYTE004  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  128.MCU(驱动电机控制单元)应用程序版本与校准数据不兼容                                  $    $            $    $  ANS020.BYTE004  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  129.ECU(电子控制器)软件与车辆平台不兼容                                                $    $            $    $  ANS020.BYTE004  $  if(((X1>>3)&1)) Y=@0015;else Y=@0014;
  $  130.EOL校准最小偏航                                                                    $    $            $    $  ANS021.BYTE004  $  if(X1<=47) Y=X1*1-47;else Y=@0004;
  $  131.EOL校准最大偏航                                                                    $    $            $    $  ANS021.BYTE005  $  if(X1<=47) Y=X1*1;else Y=@0004;
  $  132.EOL校准最小水平                                                                    $    $            $    $  ANS021.BYTE006  $  if(X1<=40) Y=X1*1-40;else Y=@0004;
  $  133.EOL校准最大范围                                                                    $    $            $    $  ANS021.BYTE007  $  if(X1<=62) Y=X1*1;else Y=@0004;
  $  134.EOL校准最大滚动角                                                                  $    $  rad       $    $  ANS021.BYTE008  $  if(X1<=55) Y=X1*0.001;else Y=@0004;
  $  135.从相机到前保险杠的距离                                                             $    $  m         $    $  ANS021.BYTE009  $  Y=X1*0.01;
  $  136.从摄像机到汽车中心的距离(横向距离)                                                 $    $  m         $    $  ANS021.BYTE010  $  Y=X1*0.01-1.28;
  $  137.ABS1                                                                               $    $            $    $  ANS022.BYTE004  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  138.YRS1                                                                               $    $            $    $  ANS022.BYTE004  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  139.YRS2                                                                               $    $            $    $  ANS022.BYTE004  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  140.禁用代码0_7                                                                        $    $            $    $  ANS023.BYTE004  $  Y=HEX(X1);
  $  141.禁用代码8_15                                                                       $    $            $    $  ANS023.BYTE004  $  Y=HEX(X1);
  $  142.ACC禁用代码                                                                        $    $            $    $  ANS024.BYTE004  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $  143.AEB禁用代码                                                                        $    $            $    $  ANS025.BYTE005  $  if(((X1>>0)&1)) Y=@0004;else Y=@0325;
  $  144.偏航角信号无效                                                                     $    $            $    $  ANS025.BYTE006  $  if(((X1>>0)&1)) Y=@0004;else Y=@0325;
  $  145.YRS(偏航率传感器)节点错误                                                          $    $            $    $  ANS025.BYTE006  $  if(((X1>>1)&1)) Y=@0004;else Y=@0325;
  $  146.AEB禁用代码24_31                                                                   $    $            $    $  ANS025.BYTE007  $  Y=HEX(X1);
  $  147.IHC禁用代码0_7                                                                     $    $            $    $  ANS026.BYTE004  $  Y=HEX(X1);
  $  148.IHC禁用代码8_15                                                                    $    $            $    $  ANS026.BYTE005  $  Y=HEX(X1);
  $  149.TSR禁用代码0_7                                                                     $    $            $    $  ANS027.BYTE004  $  Y=HEX(X1);
  $  150.TSR禁用代码8_15                                                                    $    $            $    $  ANS027.BYTE005  $  Y=HEX(X1);
  $  151.SAS(转角传感器)状态错误                                                            $    $            $    $  ANS028.BYTE005  $  if(((X1>>0)&1)) Y=@0004;else Y=@0325;
  $  152.LKA禁用代码                                                                        $    $            $    $  ANS029.BYTE004  $  Y=HEX(X1);
  $  153.SACC禁用代码                                                                       $    $            $    $  ANS030.BYTE004  $  Y=HEX(X1);
  $  154.AEB事件快照0                                                                       $    $            $    $  ANS031.BYTE004  $  Y=HEX(X1);
  $  155.AEB事件快照1                                                                       $    $            $    $  ANS032.BYTE004  $  Y=HEX(X1);
  $  156.AEB事件快照2                                                                       $    $            $    $  ANS033.BYTE004  $  Y=HEX(X1);
  $  157.AEB事件快照3                                                                       $    $            $    $  ANS034.BYTE004  $  Y=HEX(X1);
  $  158.AEB事件快照4                                                                       $    $            $    $  ANS035.BYTE004  $  Y=HEX(X1);
  $  159.LDW(车道偏离预警系统)未准备好激活的原因                                            $    $            $    $  ANS036.BYTE004  $  Y=HEX(X1);
  $  160.LDW(车道偏离预警系统)退出活动状态的原因                                            $    $            $    $  ANS037.BYTE004  $  Y=HEX(X1);
  $  161.FCW未准备好激活的原因                                                              $    $            $    $  ANS038.BYTE004  $  Y=HEX(X1);
  $  162.FCW退出活动状态的原因                                                              $    $            $    $  ANS039.BYTE004  $  Y=HEX(X1);
  $  163.IHC未准备好激活的原因                                                              $    $            $    $  ANS040.BYTE004  $  Y=HEX(X1);
  $  164.IHC退出活动状态的原因                                                              $    $            $    $  ANS041.BYTE004  $  Y=HEX(X1);
  $  165.ACC未准备好激活的原因0                                                             $    $            $    $  ANS042.BYTE004  $  Y=HEX(X1);
  $  166.ACC未准备好激活的原因1                                                             $    $            $    $  ANS043.BYTE004  $  Y=HEX(X1);
  $  167.ACC未准备好激活的原因2                                                             $    $            $    $  ANS044.BYTE004  $  Y=HEX(X1);
  $  168.ACC未准备好激活的原因3                                                             $    $            $    $  ANS045.BYTE004  $  Y=HEX(X1);
  $  169.ACC未准备好激活的原因4                                                             $    $            $    $  ANS046.BYTE004  $  Y=HEX(X1);
  $  170.ACC退出激活状态的原因0                                                             $    $            $    $  ANS047.BYTE004  $  Y=HEX(X1);
  $  171.ACC退出激活状态的原因1                                                             $    $            $    $  ANS048.BYTE004  $  Y=HEX(X1);
  $  172.ACC退出激活状态的原因2                                                             $    $            $    $  ANS049.BYTE004  $  Y=HEX(X1);
  $  173.ACC退出激活状态的原因3                                                             $    $            $    $  ANS050.BYTE004  $  Y=HEX(X1);
  $  174.AEB未准备好激活的原因0                                                             $    $            $    $  ANS051.BYTE004  $  Y=HEX(X1);
  $  175.AEB未准备好激活的原因1                                                             $    $            $    $  ANS052.BYTE004  $  Y=HEX(X1);
  $  176.AEB未准备好激活的原因2                                                             $    $            $    $  ANS053.BYTE004  $  Y=HEX(X1);
  $  177.AEB未准备好激活的原因3                                                             $    $            $    $  ANS054.BYTE004  $  Y=HEX(X1);
  $  178.AEB退出活动状态的原因0                                                             $    $            $    $  ANS055.BYTE004  $  Y=HEX(X1);
  $  179.AEB退出活动状态的原因1                                                             $    $            $    $  ANS056.BYTE004  $  Y=HEX(X1);
  $  180.AEB退出活动状态的原因2                                                             $    $            $    $  ANS057.BYTE004  $  Y=HEX(X1);
  $  181.AEB退出活动状态的原因3                                                             $    $            $    $  ANS058.BYTE004  $  Y=HEX(X1);
  $  182.AEB退出活动状态的原因4                                                             $    $            $    $  ANS059.BYTE004  $  Y=HEX(X1);
  $  183.ACC未准备好激活的最新原因                                                          $    $            $    $  ANS060.BYTE004  $  Y=HEX(X1);
  $  184.AEB未准备好激活的最新原因                                                          $    $            $    $  ANS061.BYTE004  $  Y=HEX(X1);
  $  185.AEB退出活动状态的最新原因                                                          $    $            $    $  ANS062.BYTE004  $  Y=HEX(X1);
  $  186.TSR未准备好激活的原因                                                              $    $            $    $  ANS063.BYTE004  $  Y=HEX(X1);
  $  187.TSR退出活动状态的原因                                                              $    $            $    $  ANS064.BYTE004  $  Y=HEX(X1);
  $  188.DSM(座椅记忆模块)未准备好激活的原因                                                $    $            $    $  ANS065.BYTE004  $  Y=HEX(X1);
  $  189.DSM(座椅记忆模块)退出活动状态的原因                                                $    $            $    $  ANS066.BYTE004  $  Y=HEX(X1);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:722 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
