
    车型ID：6a17

    模拟：协议模拟-->6a17

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:751 02 10 01 00 00 00 00 00       $~  ANS000:759 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:751 02 3E 00 00 00 00 00 00       $!  ANS000:759 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:751 03 19 02 09 00 00 00 00       $#  ANS000:759 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:751 04 14 FF FF FF 00 00 00       $$  ANS000:759 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:751 03 22 F1 87 00 00 00 00       $%  ANS000:759 03 22 F1 87 00 00 00 00
  $%  REQ001:751 03 22 F1 89 00 00 00 00       $%  ANS001:759 03 22 F1 89 00 00 00 00
  $%  REQ002:751 03 22 F1 90 00 00 00 00       $%  ANS002:759 03 22 F1 90 00 00 00 00
  $%  REQ003:751 03 22 F1 91 00 00 00 00       $%  ANS003:759 03 22 F1 91 00 00 00 00
  $%  REQ004:751 03 22 F1 93 00 00 00 00       $%  ANS004:759 03 22 F1 93 00 00 00 00
  $%  REQ005:751 03 22 F1 95 00 00 00 00       $%  ANS005:759 03 22 F1 95 00 00 00 00
  $%  REQ006:751 03 22 F1 98 00 00 00 00       $%  ANS006:759 03 22 F1 98 00 00 00 00
  $%  REQ007:751 03 22 F1 99 00 00 00 00       $%  ANS007:759 03 22 F1 99 00 00 00 00
  $%  REQ008:751 03 22 F1 9D 00 00 00 00       $%  ANS008:759 03 22 F1 9D 00 00 00 00
  $%  REQ009:751 03 22 F1 A1 00 00 00 00       $%  ANS009:759 03 22 F1 A1 00 00 00 00

  $%  000:OEM（原厂设备）部件编号:            $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  001:ECU软件版本编号:                    $%    $%  ANS001.BYTE004  $%  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:VIN（车辆识别码）:                  $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  003:ECU硬件版本编号:                    $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  004:供应商ECU硬件版本号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:供应商ECU软件版本号:                $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:维修车间码和/或诊断仪序列号:        $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  007:编程日期:                           $%    $%  ANS007.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  008:ECU安装日期:                        $%    $%  ANS008.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  009:系统配置:                           $%    $%  ANS009.BYTE004  $%  Y=HEX(X1);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:751 03 22 01 00 00 00 00 00       $  ANS000:759 03 22 01 00 00 00 00 00
  $  REQ001:751 03 22 01 01 00 00 00 00       $  ANS001:759 03 22 01 01 00 00 00 00
  $  REQ002:751 03 22 3C 00 00 00 00 00       $  ANS002:759 03 22 3C 00 00 00 00 00
  $  REQ003:751 03 22 3C 0F 00 00 00 00       $  ANS003:759 03 22 3C 0F 00 00 00 00
  $  REQ004:751 03 22 3C 10 00 00 00 00       $  ANS004:759 03 22 3C 10 00 00 00 00
  $  REQ005:751 03 22 3C 01 00 00 00 00       $  ANS005:759 03 22 3C 01 00 00 00 00
  $  REQ006:751 03 22 3C 03 00 00 00 00       $  ANS006:759 03 22 3C 03 00 00 00 00
  $  REQ007:751 03 22 3C 05 00 00 00 00       $  ANS007:759 03 22 3C 05 00 00 00 00
  $  REQ008:751 03 22 3C 0A 00 00 00 00       $  ANS008:759 03 22 3C 0A 00 00 00 00
  $  REQ009:751 03 22 3C 0C 00 00 00 00       $  ANS009:759 03 22 3C 0C 00 00 00 00
  $  REQ010:751 03 22 3C 0E 00 00 00 00       $  ANS010:759 03 22 3C 0E 00 00 00 00
  $  REQ011:751 03 22 3C 12 00 00 00 00       $  ANS011:759 03 22 3C 12 00 00 00 00
  $  REQ012:751 03 22 3C 13 00 00 00 00       $  ANS012:759 03 22 3C 13 00 00 00 00
  $  REQ013:751 03 22 3C 14 00 00 00 00       $  ANS013:759 03 22 3C 14 00 00 00 00
  $  REQ014:751 03 22 3C 15 00 00 00 00       $  ANS014:759 03 22 3C 15 00 00 00 00
  $  REQ015:751 03 22 3C 16 00 00 00 00       $  ANS015:759 03 22 3C 16 00 00 00 00
  $  REQ016:751 03 22 3C 17 00 00 00 00       $  ANS016:759 03 22 3C 17 00 00 00 00
  $  REQ017:751 03 22 3C 18 00 00 00 00       $  ANS017:759 03 22 3C 18 00 00 00 00

  $  000.车速                                                    $    $  km/h     $    $  ANS000.BYTE004  $  if((X1*256+X2)<=32766) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  001.总里程                                                  $    $  km       $    $  ANS001.BYTE004  $  if((X1*16777216+X2*65536+X3*256+X4)<=33554430) Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;else Y=@0004;
  $  002.IG开关状态                                              $    $           $    $  ANS002.BYTE004  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  003.制动开关状态                                            $    $           $    $  ANS002.BYTE004  $  if(((X1>>1)&1)) Y=@0016;else Y=@0005;
  $  004.外部门把手开关状态                                      $    $           $    $  ANS002.BYTE004  $  if(((X1>>2)&1)) Y=@0016;else Y=@0005;
  $  005.内部门开关状态                                          $    $           $    $  ANS002.BYTE004  $  if(((X1>>3)&1)) Y=@0016;else Y=@0005;
  $  006.司机侧开关                                              $    $           $    $  ANS002.BYTE004  $  if(((X1>>4)&1)) Y=@0016;else Y=@0005;
  $  007.脚踢传感器状态                                          $    $           $    $  ANS002.BYTE004  $  if(((X1>>5)&1)) Y=@0016;else Y=@0005;
  $  008.左侧转向灯故障状态                                      $    $           $    $  ANS002.BYTE004  $  if(((X1>>6)&1)) Y=@0016;else Y=@0005;
  $  009.右侧转向灯故障状态                                      $    $           $    $  ANS002.BYTE004  $  if(((X1>>7)&1)) Y=@0016;else Y=@0005;
  $  010.Ajar开关状态                                            $    $           $    $  ANS002.BYTE005  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  011.吸合收紧开关状态                                        $    $           $    $  ANS002.BYTE005  $  if(((X1>>1)&1)) Y=@0016;else Y=@0005;
  $  012.右侧灯具电源电压值                                      $    $  V        $    $  ANS003.BYTE004  $  Y=X1*1;
  $  013.左侧灯具电源电压值                                      $    $  V        $    $  ANS003.BYTE005  $  Y=X1*1;
  $  014.转向灯具电源电压值                                      $    $  V        $    $  ANS003.BYTE006  $  Y=X1*1;
  $  015.电机驱动电源电压值                                      $    $  V        $    $  ANS003.BYTE007  $  Y=X1*1;
  $  016.系统逻辑电源电压值                                      $    $  V        $    $  ANS003.BYTE008  $  Y=X1*1;
  $  017.左杆防夹条采集AD值                                      $    $           $    $  ANS004.BYTE004  $  if((X1*256+X2)<=1023) Y=(X1*256+X2)*1;else Y=@0004;
  $  018.右杆防夹条采集AD值                                      $    $           $    $  ANS004.BYTE006  $  if((X1*256+X2)<=1023) Y=(X1*256+X2)*1;else Y=@0004;
  $  019.左侧霍尔A电压状态                                       $    $           $    $  ANS004.BYTE008  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  020.左侧霍尔B电压状态                                       $    $           $    $  ANS004.BYTE008  $  if(((X1>>1)&1)) Y=@0016;else Y=@0005;
  $  021.右侧霍尔A电压状态                                       $    $           $    $  ANS004.BYTE008  $  if(((X1>>2)&1)) Y=@0016;else Y=@0005;
  $  022.右侧霍尔B电压状态                                       $    $           $    $  ANS004.BYTE008  $  if(((X1>>3)&1)) Y=@0016;else Y=@0005;
  $  023.温度值                                                  $    $  degC     $    $  ANS004.BYTE009  $  if(X1<=160) Y=X1*1-40;else Y=@0004;
  $  024.制动灯动态                                              $    $           $    $  ANS005.BYTE004  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  025.左侧制动灯状态                                          $    $           $    $  ANS005.BYTE004  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  026.右制动灯状态                                            $    $           $    $  ANS005.BYTE004  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  027.高制动灯状态                                            $    $           $    $  ANS005.BYTE004  $  if(((X1>>3)&1)) Y=@0015;else Y=@0014;
  $  028.左倒车灯状态                                            $    $           $    $  ANS005.BYTE004  $  if(((X1>>4)&1)) Y=@0015;else Y=@0014;
  $  029.右倒车灯状态                                            $    $           $    $  ANS005.BYTE004  $  if(((X1>>5)&1)) Y=@0015;else Y=@0014;
  $  030.左后位置灯状态                                          $    $           $    $  ANS005.BYTE004  $  if(((X1>>6)&1)) Y=@0015;else Y=@0014;
  $  031.右后位置灯状态                                          $    $           $    $  ANS005.BYTE004  $  if(((X1>>7)&1)) Y=@0015;else Y=@0014;
  $  032.左后转向灯状态                                          $    $           $    $  ANS005.BYTE005  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  033.右后转向灯状态                                          $    $           $    $  ANS005.BYTE005  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  034.左后转向灯动态状态                                      $    $           $    $  ANS005.BYTE005  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  035.右后方转向灯动态信号状态                                $    $           $    $  ANS005.BYTE005  $  if(((X1>>3)&1)) Y=@0015;else Y=@0014;
  $  036.牌照灯状态                                              $    $           $    $  ANS005.BYTE005  $  if(((X1>>4)&1)) Y=@0015;else Y=@0014;
  $  037.后雾灯状态                                              $    $           $    $  ANS005.BYTE005  $  if(((X1>>5)&1)) Y=@0015;else Y=@0014;
  $  038.行李箱灯和背光LED状态                                   $    $           $    $  ANS005.BYTE005  $  if(((X1>>6)&1)) Y=@0015;else Y=@0014;
  $  039.左侧主轴电机转速                                        $    $           $    $  ANS006.BYTE004  $  Y=((X1*256+X2)&32767)*1;
  $  040.左侧主轴电机旋转方向                                    $    $           $    $  ANS006.BYTE005  $  if(((X1>>7)&1)) Y=@0014;else Y=@0015;
  $  041.左侧主轴电机位置                                        $    $           $    $  ANS006.BYTE006  $  if((X1*256+X2)<=32767) Y=(X1*256+X2)*1;else Y=@0004;
  $  042.收紧电机电流                                            $    $  A        $    $  ANS007.BYTE004  $  if((X1*256+X2)<=1024) Y=(X1*256+X2)*1;else Y=@0004;
  $  043.尾门/行李箱盖释放电机电流                               $    $  A        $    $  ANS007.BYTE006  $  if((X1*256+X2)<=1024) Y=(X1*256+X2)*1;else Y=@0004;
  $  044.油箱盖工作状态                                          $    $           $    $  ANS008.BYTE004  $  if((X1&0x07)==0) y=@0005;else if((X1&0x07)==1) y=@0033;else if((X1&0x07)==2) y=@0030;else if((X1&0x07)==3) y=@0034;else if((X1&0x07)==4) y=@002f;else if((X1&0x07)==5) y=@0032;else y=@0004;
  $  045.油箱盖锁电机运转方向                                    $    $           $    $  ANS008.BYTE004  $  if(((X1>>3)&1)) Y=@002f;else Y=@0030;
  $  046.油箱盖锁电机电流                                        $    $  A        $    $  ANS008.BYTE005  $  if(X1<=1024) Y=X1*1;else Y=@0004;
  $  047.后雨刮工作状态                                          $    $           $    $  ANS009.BYTE004  $  if((X1&0x07)==0) y=@0005;else if((X1&0x07)==1) y=@0014;else if((X1&0x07)==2) y=@002e;else if((X1&0x07)==3) y=@0031;else if((X1&0x07)==4) y=@0032;else y=@0004;
  $  048.后雨刮器电机电流                                        $    $  A        $    $  ANS009.BYTE005  $  if((X1*256+X2)<=65535) Y=(X1*256+X2)*1;else Y=@0004;
  $  049.后雨刮回位开关状态                                      $    $           $    $  ANS009.BYTE007  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  050.后窗加热状态                                            $    $           $    $  ANS010.BYTE004  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  051.闩锁位置状态                                            $    $           $    $  ANS011.BYTE004  $  if((X1&0x07)==0) y=@002a;else if((X1&0x07)==1) y=@0015;else if((X1&0x07)==2) y=@002b;else if((X1&0x07)==3) y=@0024;else y=@0004;
  $  052.锁控制状态                                              $    $           $    $  ANS011.BYTE004  $  if(((X1/0x08)&0x07)==0) y=@0025;else if(((X1/0x08)&0x07)==1) y=@0026;else if(((X1/0x08)&0x07)==2) y=@0027;else if(((X1/0x08)&0x07)==3) y=@0028;else if(((X1/0x08)&0x07)==4) y=@0029;else y=@0004;
  $  053.锁吸合状态                                              $    $           $    $  ANS011.BYTE004  $  if(((X1/0x40)&0x03)==0) y=@0025;else if(((X1/0x40)&0x03)==1) y=@002c;else if(((X1/0x40)&0x03)==2) y=@002d;else if(((X1/0x40)&0x03)==3) y=@002e;else y=@0004;
  $  054.主缸压力                                                $    $           $    $  ANS012.BYTE004  $  if((X1*256+X2)<=2000) Y=((X1*256+X2)*1)/10;else Y=@0004;
  $  055.档位信号                                                $    $           $    $  ANS012.BYTE006  $  if((X1&0x0f)==0) y=@0018;else if((X1&0x0f)==1) y=@0019;else if((X1&0x0f)==2) y=@001a;else if((X1&0x0f)==3) y=@001b;else if((X1&0x0f)==4) y=@001c;else if((X1&0x0f)==5) y=@001d;else if((X1&0x0f)==6) y=@001e;else if((X1&0x0f)==7) y=@001f;else if((X1&0x0f)==8) y=@0020;else if((X1&0x0f)==14) y=@0021;else y=@0004;
  $  056.电源模式                                                $    $           $    $  ANS012.BYTE006  $  if(((X1/0x10)&0x0f)==0) y=@0014;else if(((X1/0x10)&0x0f)==4) y=@0017;else y=@0004;
  $  057.制动踏板                                                $    $           $    $  ANS012.BYTE007  $  if((X1&0x03)==0) y=@0005;else if((X1&0x03)==1) y=@0016;else if((X1&0x03)==3) y=@0024;else y=@0004;
  $  058.干预紧急制动                                            $    $           $    $  ANS012.BYTE007  $  if(((X1>>2)&1)) Y=@0022;else Y=@0023;
  $  059.制动灯控制                                              $    $           $    $  ANS012.BYTE007  $  if(((X1>>3)&1)) Y=@0049;else Y=@004a;
  $  060.高位制动灯指令                                          $    $           $    $  ANS012.BYTE007  $  if(((X1>>4)&1)) Y=@0015;else Y=@0014;
  $  061.制动灯流水信号命令                                      $    $           $    $  ANS012.BYTE007  $  if(((X1>>5)&1)) Y=@0015;else Y=@0014;
  $  062.左转灯命令                                              $    $           $    $  ANS012.BYTE007  $  if(((X1>>6)&1)) Y=@0015;else Y=@0014;
  $  063.右转灯命令                                              $    $           $    $  ANS012.BYTE007  $  if(((X1>>7)&1)) Y=@0015;else Y=@0014;
  $  064.左转向流水信号命令                                      $    $           $    $  ANS012.BYTE008  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  065.右转向流水信号命令                                      $    $           $    $  ANS012.BYTE008  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  066.后置灯命令                                              $    $           $    $  ANS012.BYTE008  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  067.后雾灯命令                                              $    $           $    $  ANS012.BYTE008  $  if(((X1>>3)&1)) Y=@0015;else Y=@0014;
  $  068.后雨刮控制命令                                          $    $           $    $  ANS012.BYTE008  $  if(((X1/0x10)&0x07)==0) y=@0005;else if(((X1/0x10)&0x07)==1) y=@0014;else if(((X1/0x10)&0x07)==2) y=@002e;else if(((X1/0x10)&0x07)==3) y=@0047;else if(((X1/0x10)&0x07)==4) y=@0048;else y=@0004;
  $  069.加油盖控制命令                                          $    $           $    $  ANS012.BYTE009  $  if((X1&0x03)==0) y=@0005;else if((X1&0x03)==1) y=@002f;else if((X1&0x03)==2) y=@0030;else y=@0004;
  $  070.充电盖控制命令                                          $    $           $    $  ANS012.BYTE009  $  if(((X1/0x04)&0x03)==0) y=@0005;else if(((X1/0x04)&0x03)==1) y=@002f;else if(((X1/0x04)&0x03)==2) y=@0030;else y=@0004;
  $  071.尾门控制命令                                            $    $           $    $  ANS012.BYTE009  $  if(((X1/0x10)&0x03)==0) y=@0005;else if(((X1/0x10)&0x03)==1) y=@0014;else if(((X1/0x10)&0x03)==2) y=@0015;else if(((X1/0x10)&0x03)==3) y=@002e;else y=@0004;
  $  072.PLG(电动后背门模块)机械全开位置                         $    $           $    $  ANS013.BYTE004  $  if((X1*256+X2)<=1500) Y=(X1*256+X2)*1;else Y=@0004;
  $  073.用户设置打开位置                                        $    $           $    $  ANS013.BYTE006  $  if((X1*256+X2)<=1500) Y=(X1*256+X2)*1;else Y=@0004;
  $  074.后尾门动作触发_门操作状态                               $    $           $    $  ANS014.BYTE004  $  if((X1&0x0f)==0) y=@003f;else if((X1&0x0f)==1) y=@0040;else if((X1&0x0f)==2) y=@0041;else if((X1&0x0f)==3) y=@0042;else if((X1&0x0f)==4) y=@0043;else if((X1&0x0f)==5) y=@0044;else if((X1&0x0f)==6) y=@0045;else if((X1&0x0f)==7) y=@0046;else y=@0004;
  $  075.后尾门动作触发_电压状态                                 $    $           $    $  ANS014.BYTE004  $  if(((X1>>4)&1)) Y=@003d;else Y=@003e;
  $  076.后尾门动作触发_CAN状态                                  $    $           $    $  ANS014.BYTE004  $  if(((X1>>5)&1)) Y=@0039;else Y=@003a;
  $  077.后尾门动作触发_停车现状                                 $    $           $    $  ANS014.BYTE004  $  if(((X1>>6)&1)) Y=@0037;else Y=@0038;
  $  078.后尾门动作触发_配置状态                                 $    $           $    $  ANS014.BYTE004  $  if(((X1>>7)&1)) Y=@003b;else Y=@003c;
  $  079.后尾门动作触发_行李箱内部开关请求                       $    $           $    $  ANS014.BYTE005  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  080.后尾门动作触发_行李箱外部开关请求                       $    $           $    $  ANS014.BYTE005  $  if(((X1>>1)&1)) Y=@0016;else Y=@0005;
  $  081.后尾门动作触发_锁状态                                   $    $           $    $  ANS014.BYTE005  $  if(((X1/0x04)&0x03)==0) y=@002a;else if(((X1/0x04)&0x03)==1) y=@0015;else if(((X1/0x04)&0x03)==2) y=@002b;else if(((X1/0x04)&0x03)==3) y=@0024;else y=@0004;
  $  082.后尾门动作触发_障碍物主要检测状态                       $    $           $    $  ANS014.BYTE005  $  if(((X1/0x10)&0x03)==0) y=@0014;else if(((X1/0x10)&0x03)==1) y=@0035;else if(((X1/0x10)&0x03)==2) y=@0036;else y=@0004;
  $  083.后尾门动作触发_门运动次数                               $    $           $    $  ANS014.BYTE006  $  if((X1*256+X2)<=65535) Y=(X1*256+X2)*1;else Y=@0004;
  $  084.后尾门动作触发_左杆位置                                 $    $           $    $  ANS014.BYTE008  $  if((X1*256+X2)<=1400) Y=(X1*256+X2)*1;else Y=@0004;
  $  085.后尾门停止触发状态_门操作状态                           $    $           $    $  ANS015.BYTE004  $  if((X1&0x0f)==0) y=@003f;else if((X1&0x0f)==1) y=@0040;else if((X1&0x0f)==2) y=@0041;else if((X1&0x0f)==3) y=@0042;else if((X1&0x0f)==4) y=@0043;else if((X1&0x0f)==5) y=@0044;else if((X1&0x0f)==6) y=@0045;else if((X1&0x0f)==7) y=@0046;else y=@0004;
  $  086.后尾门停止触发状态_电压状态                             $    $           $    $  ANS015.BYTE004  $  if(((X1>>4)&1)) Y=@003d;else Y=@003e;
  $  087.后尾门停止触发状态_CAN状态                              $    $           $    $  ANS015.BYTE004  $  if(((X1>>5)&1)) Y=@0039;else Y=@003a;
  $  088.后尾门停止触发状态_停车现状                             $    $           $    $  ANS015.BYTE004  $  if(((X1>>6)&1)) Y=@0037;else Y=@0038;
  $  089.后尾门停止触发状态_配置状态                             $    $           $    $  ANS015.BYTE004  $  if(((X1>>7)&1)) Y=@003b;else Y=@003c;
  $  090.后尾门停止触发状态_行李箱内部开关请求                   $    $           $    $  ANS015.BYTE005  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  091.后尾门停止触发状态_行李箱外部开关请求                   $    $           $    $  ANS015.BYTE005  $  if(((X1>>1)&1)) Y=@0016;else Y=@0005;
  $  092.后尾门停止触发状态_锁状态                               $    $           $    $  ANS015.BYTE005  $  if(((X1/0x04)&0x03)==0) y=@002a;else if(((X1/0x04)&0x03)==1) y=@0015;else if(((X1/0x04)&0x03)==2) y=@002b;else if(((X1/0x04)&0x03)==3) y=@0024;else y=@0004;
  $  093.后尾门停止触发状态_障碍物主要检测状态                   $    $           $    $  ANS015.BYTE005  $  if(((X1/0x10)&0x03)==0) y=@0014;else if(((X1/0x10)&0x03)==1) y=@0035;else if(((X1/0x10)&0x03)==2) y=@0036;else y=@0004;
  $  094.后尾门停止触发状态_门运动次数                           $    $           $    $  ANS015.BYTE006  $  if((X1*256+X2)<=65535) Y=(X1*256+X2)*1;else Y=@0004;
  $  095.后尾门停止触发状态_左杆位置                             $    $           $    $  ANS015.BYTE008  $  if((X1*256+X2)<=1400) Y=(X1*256+X2)*1;else Y=@0004;
  $  096.防夹触发时记录标志量状态_门操作状态                     $    $           $    $  ANS016.BYTE004  $  if((X1&0x0f)==0) y=@003f;else if((X1&0x0f)==1) y=@0040;else if((X1&0x0f)==2) y=@0041;else if((X1&0x0f)==3) y=@0042;else if((X1&0x0f)==4) y=@0043;else if((X1&0x0f)==5) y=@0044;else if((X1&0x0f)==6) y=@0045;else if((X1&0x0f)==7) y=@0046;else y=@0004;
  $  097.防夹触发时记录标志量状态_电压状态                       $    $           $    $  ANS016.BYTE004  $  if(((X1>>4)&1)) Y=@003d;else Y=@003e;
  $  098.防夹触发时记录标志量状态_CAN状态                        $    $           $    $  ANS016.BYTE004  $  if(((X1>>5)&1)) Y=@0039;else Y=@003a;
  $  099.防夹触发时记录标志量状态_停车现状                       $    $           $    $  ANS016.BYTE004  $  if(((X1>>6)&1)) Y=@0037;else Y=@0038;
  $  100.防夹触发时记录标志量状态_配置状态                       $    $           $    $  ANS016.BYTE004  $  if(((X1>>7)&1)) Y=@003b;else Y=@003c;
  $  101.防夹触发时记录标志量状态_行李箱内部开关请求             $    $           $    $  ANS016.BYTE005  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  102.防夹触发时记录标志量状态_行李箱外部开关请求             $    $           $    $  ANS016.BYTE005  $  if(((X1>>1)&1)) Y=@0016;else Y=@0005;
  $  103.防夹触发时记录标志量状态_锁状态                         $    $           $    $  ANS016.BYTE005  $  if(((X1/0x04)&0x03)==0) y=@002a;else if(((X1/0x04)&0x03)==1) y=@0015;else if(((X1/0x04)&0x03)==2) y=@002b;else if(((X1/0x04)&0x03)==3) y=@0024;else y=@0004;
  $  104.防夹触发时记录标志量状态_障碍物主要检测状态             $    $           $    $  ANS016.BYTE005  $  if(((X1/0x10)&0x03)==0) y=@0014;else if(((X1/0x10)&0x03)==1) y=@0035;else if(((X1/0x10)&0x03)==2) y=@0036;else y=@0004;
  $  105.防夹触发时记录标志量状态_门运动次数                     $    $           $    $  ANS016.BYTE006  $  if((X1*256+X2)<=65535) Y=(X1*256+X2)*1;else Y=@0004;
  $  106.防夹触发时记录标志量状态_左杆位置                       $    $           $    $  ANS016.BYTE008  $  if((X1*256+X2)<=1400) Y=(X1*256+X2)*1;else Y=@0004;
  $  107.未响应动作时记录相关标志量状态_门操作状态               $    $           $    $  ANS017.BYTE004  $  if((X1&0x0f)==0) y=@003f;else if((X1&0x0f)==1) y=@0040;else if((X1&0x0f)==2) y=@0041;else if((X1&0x0f)==3) y=@0042;else if((X1&0x0f)==4) y=@0043;else if((X1&0x0f)==5) y=@0044;else if((X1&0x0f)==6) y=@0045;else if((X1&0x0f)==7) y=@0046;else y=@0004;
  $  108.未响应动作时记录相关标志量状态_电压状态                 $    $           $    $  ANS017.BYTE004  $  if(((X1>>4)&1)) Y=@003d;else Y=@003e;
  $  109.未响应动作时记录相关标志量状态_CAN状态                  $    $           $    $  ANS017.BYTE004  $  if(((X1>>5)&1)) Y=@0039;else Y=@003a;
  $  110.未响应动作时记录相关标志量状态_停车现状                 $    $           $    $  ANS017.BYTE004  $  if(((X1>>6)&1)) Y=@0037;else Y=@0038;
  $  111.未响应动作时记录相关标志量状态_配置状态                 $    $           $    $  ANS017.BYTE004  $  if(((X1>>7)&1)) Y=@003b;else Y=@003c;
  $  112.未响应动作时记录相关标志量状态_行李箱内部开关请求       $    $           $    $  ANS017.BYTE005  $  if(((X1>>0)&1)) Y=@0016;else Y=@0005;
  $  113.未响应动作时记录相关标志量状态_行李箱外部开关请求       $    $           $    $  ANS017.BYTE005  $  if(((X1>>1)&1)) Y=@0016;else Y=@0005;
  $  114.未响应动作时记录相关标志量状态_锁状态                   $    $           $    $  ANS017.BYTE005  $  if(((X1/0x04)&0x03)==0) y=@002a;else if(((X1/0x04)&0x03)==1) y=@0015;else if(((X1/0x04)&0x03)==2) y=@002b;else if(((X1/0x04)&0x03)==3) y=@0024;else y=@0004;
  $  115.未响应动作时记录相关标志量状态_障碍物主要检测状态       $    $           $    $  ANS017.BYTE005  $  if(((X1/0x10)&0x03)==0) y=@0014;else if(((X1/0x10)&0x03)==1) y=@0035;else if(((X1/0x10)&0x03)==2) y=@0036;else y=@0004;
  $  116.未响应动作时记录相关标志量状态_门运动次数               $    $           $    $  ANS017.BYTE006  $  if((X1*256+X2)<=65535) Y=(X1*256+X2)*1;else Y=@0004;
  $  117.未响应动作时记录相关标志量状态_左杆位置                 $    $           $    $  ANS017.BYTE008  $  if((X1*256+X2)<=1400) Y=(X1*256+X2)*1;else Y=@0004;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:751 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
