
    车型ID：6a22

    模拟：协议模拟-->6a22

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:722 02 10 01 00 00 00 00 00       $~  ANS000:72A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:722 02 3E 00 00 00 00 00 00       $!  ANS000:72A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:722 03 19 02 09 00 00 00 00       $#  ANS000:72A 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:722 04 14 FF FF FF 00 00 00       $$  ANS000:72A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:722 03 22 F1 00 00 00 00 00       $%  ANS000:72A 03 22 F1 00 00 00 00 00
  $%  REQ001:722 03 22 F1 80 00 00 00 00       $%  ANS001:72A 03 22 F1 80 00 00 00 00
  $%  REQ002:722 03 22 F1 81 00 00 00 00       $%  ANS002:72A 03 22 F1 81 00 00 00 00
  $%  REQ003:722 03 22 F1 83 00 00 00 00       $%  ANS003:72A 03 22 F1 83 00 00 00 00
  $%  REQ004:722 03 22 F1 87 00 00 00 00       $%  ANS004:72A 03 22 F1 87 00 00 00 00
  $%  REQ005:722 03 22 F1 89 00 00 00 00       $%  ANS005:72A 03 22 F1 89 00 00 00 00
  $%  REQ006:722 03 22 F1 90 00 00 00 00       $%  ANS006:72A 03 22 F1 90 00 00 00 00
  $%  REQ007:722 03 22 F1 91 00 00 00 00       $%  ANS007:72A 03 22 F1 91 00 00 00 00
  $%  REQ008:722 03 22 F1 93 00 00 00 00       $%  ANS008:72A 03 22 F1 93 00 00 00 00
  $%  REQ009:722 03 22 F1 95 00 00 00 00       $%  ANS009:72A 03 22 F1 95 00 00 00 00
  $%  REQ010:722 03 22 F1 98 00 00 00 00       $%  ANS010:72A 03 22 F1 98 00 00 00 00
  $%  REQ011:722 03 22 F1 99 00 00 00 00       $%  ANS011:72A 03 22 F1 99 00 00 00 00
  $%  REQ012:722 03 22 F1 9C 00 00 00 00       $%  ANS012:72A 03 22 F1 9C 00 00 00 00
  $%  REQ013:722 03 22 F1 9D 00 00 00 00       $%  ANS013:72A 03 22 F1 9D 00 00 00 00
  $%  REQ014:722 03 22 F1 A1 00 00 00 00       $%  ANS014:72A 03 22 F1 A1 00 00 00 00
  $%  REQ015:722 03 22 F1 A4 00 00 00 00       $%  ANS015:72A 03 22 F1 A4 00 00 00 00
  $%  REQ016:722 03 22 2A 11 00 00 00 00       $%  ANS016:72A 03 22 2A 11 00 00 00 00
  $%  REQ017:722 03 22 2A 12 00 00 00 00       $%  ANS017:72A 03 22 2A 12 00 00 00 00

  $%  000:模式配置:                           $%    $%  ANS000.BYTE004  $%  Y=HEX(X1);
  $%  001:ECU引导软件版本号:                  $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:ECU应用软件版本号:                  $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  003:供应商ECU引导软件版本号:            $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  004:OEM（原厂设备）部件编号:            $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:ECU软件版本编号:                    $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  006:VIN（车辆识别码）:                  $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  007:ECU硬件版本编号:                    $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  008:供应商ECU硬件版本号:                $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:供应商ECU软件版本号:                $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:维修车间码和/或诊断仪序列号:        $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:编程日期:                           $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  012:标定软件版本编号:                   $%    $%  ANS012.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  013:ECU安装日期:                        $%    $%  ANS013.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  014:系统配置1:                          $%    $%  ANS014.BYTE004  $%  Y=HEX(X1,X2);
  $%  015:供应商ECU校准软件版本号:            $%    $%  ANS015.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  016:ECU制造日期:                        $%    $%  ANS016.BYTE004  $%  Y=HEX(X1,X2,X3);
  $%  017:ECU序列号:                          $%    $%  ANS017.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:722 03 22 2A 00 00 00 00 00       $  ANS000:72A 03 22 2A 00 00 00 00 00
  $  REQ001:722 03 22 2A 01 00 00 00 00       $  ANS001:72A 03 22 2A 01 00 00 00 00
  $  REQ002:722 03 22 2A 02 00 00 00 00       $  ANS002:72A 03 22 2A 02 00 00 00 00
  $  REQ003:722 03 22 2A 03 00 00 00 00       $  ANS003:72A 03 22 2A 03 00 00 00 00
  $  REQ004:722 03 22 2A 04 00 00 00 00       $  ANS004:72A 03 22 2A 04 00 00 00 00
  $  REQ005:722 03 22 2A 05 00 00 00 00       $  ANS005:72A 03 22 2A 05 00 00 00 00
  $  REQ006:722 03 22 2A 06 00 00 00 00       $  ANS006:72A 03 22 2A 06 00 00 00 00
  $  REQ007:722 03 22 2A 07 00 00 00 00       $  ANS007:72A 03 22 2A 07 00 00 00 00
  $  REQ008:722 03 22 2A 08 00 00 00 00       $  ANS008:72A 03 22 2A 08 00 00 00 00
  $  REQ009:722 03 22 2A 09 00 00 00 00       $  ANS009:72A 03 22 2A 09 00 00 00 00
  $  REQ010:722 03 22 2A 0A 00 00 00 00       $  ANS010:72A 03 22 2A 0A 00 00 00 00
  $  REQ011:722 03 22 2A 0B 00 00 00 00       $  ANS011:72A 03 22 2A 0B 00 00 00 00
  $  REQ012:722 03 22 2A 0C 00 00 00 00       $  ANS012:72A 03 22 2A 0C 00 00 00 00
  $  REQ013:722 03 22 2A 0E 00 00 00 00       $  ANS013:72A 03 22 2A 0E 00 00 00 00
  $  REQ014:722 03 22 2A 0F 00 00 00 00       $  ANS014:72A 03 22 2A 0F 00 00 00 00
  $  REQ015:722 03 22 2A 10 00 00 00 00       $  ANS015:72A 03 22 2A 10 00 00 00 00
  $  REQ016:722 03 22 2A 13 00 00 00 00       $  ANS016:72A 03 22 2A 13 00 00 00 00
  $  REQ017:722 03 22 2A 14 00 00 00 00       $  ANS017:72A 03 22 2A 14 00 00 00 00
  $  REQ018:722 03 22 2A 15 00 00 00 00       $  ANS018:72A 03 22 2A 15 00 00 00 00
  $  REQ019:722 03 22 2A 90 00 00 00 00       $  ANS019:72A 03 22 2A 90 00 00 00 00
  $  REQ020:722 03 22 2A 91 00 00 00 00       $  ANS020:72A 03 22 2A 91 00 00 00 00
  $  REQ021:722 03 22 2A 92 00 00 00 00       $  ANS021:72A 03 22 2A 92 00 00 00 00
  $  REQ022:722 03 22 2A 93 00 00 00 00       $  ANS022:72A 03 22 2A 93 00 00 00 00
  $  REQ023:722 03 22 2A 94 00 00 00 00       $  ANS023:72A 03 22 2A 94 00 00 00 00

  $  000.摄像头距左车轮距离                               $    $  m         $    $  ANS000.BYTE004  $  if((X1*256+X2)<=500&&(X1*256+X2)>=20) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  001.摄像头距右车轮距离                               $    $  m         $    $  ANS000.BYTE006  $  if((X1*256+X2)<=500&&(X1*256+X2)>=20) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  002.摄像头距目标板距离                               $    $  m         $    $  ANS000.BYTE008  $  if((X1*256+X2)<=10000) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  003.摄像头安装高度                                   $    $  m         $    $  ANS000.BYTE010  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  004.目标板中心距地面高度                             $    $  m         $    $  ANS000.BYTE012  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  005.目标板中心距地面高度                             $    $  m         $    $  ANS000.BYTE014  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  006.左目标板中轴线距车辆中轴线距离                   $    $  m         $    $  ANS000.BYTE016  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else Y=@0004;
  $  007.右目标板中轴线距车辆中轴线距离                   $    $  m         $    $  ANS000.BYTE018  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else Y=@0004;
  $  008.目标板方格尺寸                                   $    $  m         $    $  ANS000.BYTE020  $  if((X1*256+X2)<=255) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  009.黑白格排列方式                                   $    $  Pixel     $    $  ANS000.BYTE022  $  if(X1==1) y=@012c;else if(X1==3) y=@012d;else y=@0004;
  $  010.摄像头焦距                                       $    $  Pixel     $    $  ANS000.BYTE023  $  if((X1*256+X2)<=1000&&(X1*256+X2)>=100) Y=(X1*256+X2)*1;else Y=@0004;
  $  011.左下角四分之一左边的颜色                         $    $  Pixel     $    $  ANS000.BYTE025  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  012.左下角四分之一右边的颜色                         $    $  Pixel     $    $  ANS000.BYTE026  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  013.目标板数量                                       $    $  Pixel     $    $  ANS000.BYTE027  $  if(X1==1) y=@012a;else if(X1==2) y=@012b;else y=@0004;
  $  014.最大俯仰方向标定值                               $    $  rad       $    $  ANS000.BYTE028  $  if(X1<=62) Y=X1*1;else Y=@0004;
  $  015.最大横摆方向标定值                               $    $  Pixel     $    $  ANS000.BYTE029  $  if(X1<=47) Y=X1*1;else Y=@0004;
  $  016.最小俯仰方向标定值                               $    $  Pixel     $    $  ANS000.BYTE030  $  if(X1<=40) Y=X1*1-40;else Y=@0004;
  $  017.最小横摆方向标定值                               $    $  Pixel     $    $  ANS000.BYTE031  $  if(X1<=47) Y=X1*1-47;else Y=@0004;
  $  018.最大侧倾角                                       $    $  rad       $    $  ANS000.BYTE032  $  if(X1<=55) Y=X1*0.001;else Y=@0004;
  $  019.底部有效图像坐标值                               $    $  Pixel     $    $  ANS000.BYTE033  $  if(X1<=120) Y=X1*1-120;else Y=@0004;
  $  020.顶部有效图像坐标值                               $    $  Pixel     $    $  ANS000.BYTE034  $  if(X1<=120) Y=X1*1;else Y=@0004;
  $  021.摄像头到车辆前端的距离                           $    $  m         $    $  ANS000.BYTE035  $  Y=X1*0.01;
  $  022.摄像头到车辆中轴线的距离                         $    $  m         $    $  ANS000.BYTE036  $  Y=X1*0.01-1.28;
  $  023.图像处理单元温度                                 $    $  degC      $    $  ANS001.BYTE004  $  if((X1*256+X2)<=155) Y=(X1*256+X2)*1-40;else Y=@0004;
  $  024.校准年份                                         $    $            $    $  ANS002.BYTE004  $  Y=X1*1+2000;
  $  025.校准月份                                         $    $            $    $  ANS002.BYTE005  $  if(X1<=12&&X1>=1) Y=X1*1;else Y=@0004;
  $  026.校准日                                           $    $            $    $  ANS002.BYTE006  $  if(X1<=31&&X1>=1) Y=X1*1;else Y=@0004;
  $  027.校准小时                                         $    $            $    $  ANS002.BYTE007  $  if(X1<=23) Y=X1*1;else Y=@0004;
  $  028.校准分钟                                         $    $            $    $  ANS002.BYTE008  $  if(X1<=59) Y=X1*1;else Y=@0004;
  $  029.校准秒                                           $    $            $    $  ANS002.BYTE009  $  if(X1<=59) Y=X1*1;else Y=@0004;
  $  030.里程表读数                                       $    $  km        $    $  ANS002.BYTE010  $  if((X1*16777216+X2*65536+X3*256+X4)<=33554431) Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;else Y=@0004;
  $  031.雾斑                                             $    $            $    $  ANS003.BYTE005  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  032.挡风玻璃结冰                                     $    $            $    $  ANS003.BYTE005  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  033.完全堵塞                                         $    $            $    $  ANS003.BYTE005  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  034.部分堵塞                                         $    $            $    $  ANS003.BYTE005  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  035.玷污点                                           $    $            $    $  ANS003.BYTE005  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  036.光线缺失                                         $    $            $    $  ANS003.BYTE005  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  037.模糊图像                                         $    $            $    $  ANS003.BYTE005  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  038.道路喷雾                                         $    $            $    $  ANS003.BYTE005  $  if(((X1>>7)&1)) Y=@012f;else Y=@0130;
  $  039.太阳光线                                         $    $            $    $  ANS003.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  040.自眩光                                           $    $            $    $  ANS003.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  041.未校准的                                         $    $            $    $  ANS004.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  042.应用程序致命错误-超出校准范围                    $    $            $    $  ANS004.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  043.自动调整超出范围                                 $    $            $    $  ANS004.BYTE004  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  044.IFC(智能前视控制模块) 5V过电压                   $    $            $    $  ANS005.BYTE011  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  045.IFC(智能前视控制模块) 5伏欠压                    $    $            $    $  ANS005.BYTE011  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  046.IFC(智能前视控制模块) 3.3V过电压                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  047.IFC(智能前视控制模块) 3.3V欠压                   $    $            $    $  ANS005.BYTE011  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  048.IFC(智能前视控制模块) 1.8V过电压                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  049.IFC(智能前视控制模块) 1.8V欠压                   $    $            $    $  ANS005.BYTE011  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  050.IFC(智能前视控制模块) 1.2V过电压                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  051.IFC(智能前视控制模块) 1.2V欠压                   $    $            $    $  ANS005.BYTE011  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  052.IFC(智能前视控制模块) 2.8V过电压                 $    $            $    $  ANS005.BYTE010  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  053.IFC(智能前视控制模块) 2.8V欠压                   $    $            $    $  ANS005.BYTE010  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  054.单片机PLL失败                                    $    $            $    $  ANS005.BYTE010  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  055.单片机异常复位                                   $    $            $    $  ANS005.BYTE010  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  056.MCU(驱动电机控制单元)闪存校验和错误              $    $            $    $  ANS005.BYTE010  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  057.单片机RAM(随机存储器)测试失败                    $    $            $    $  ANS005.BYTE010  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  058.单片机EEPROM(电可擦除只读存储器)测试失败         $    $            $    $  ANS005.BYTE010  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  059.无图像处理单元SPI通信                            $    $            $    $  ANS005.BYTE010  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  060.EyeQ核心转储                                     $    $            $    $  ANS005.BYTE009  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  061.EyeQ启动失败                                     $    $            $    $  ANS005.BYTE009  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  062.致命错误                                         $    $            $    $  ANS005.BYTE009  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  063.诊断连续输入信号错误                             $    $            $    $  ANS005.BYTE009  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  064.图像缺失                                         $    $            $    $  ANS005.BYTE009  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  065.DDR CRC误差                                      $    $            $    $  ANS005.BYTE009  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  066.AEB复核错误                                      $    $            $    $  ANS005.BYTE009  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  067.内部CRC错误                                      $    $            $    $  ANS005.BYTE009  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  068.内部信号损坏                                     $    $            $    $  ANS005.BYTE008  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  069.挑战响应错误                                     $    $            $    $  ANS005.BYTE008  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  070.旧自我数据                                       $    $            $    $  ANS005.BYTE008  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  071.内部图像保护错误                                 $    $            $    $  ANS005.BYTE008  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  072.不良校准                                         $    $            $    $  ANS005.BYTE008  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  073.图像索引无效                                     $    $            $    $  ANS005.BYTE008  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  074.单片机RFC误差                                    $    $            $    $  ANS005.BYTE008  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  075.单片机CRC误差                                    $    $            $    $  ANS005.BYTE008  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  076.挑战响应重复                                     $    $            $    $  ANS005.BYTE007  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  077.EyeQ CRC误差                                     $    $            $    $  ANS005.BYTE007  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  078.EyeQ RFC误差                                     $    $            $    $  ANS005.BYTE007  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  079.Eyeq ASIL错误6                                   $    $            $    $  ANS005.BYTE007  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  080.Eyeq ASIL错误7                                   $    $            $    $  ANS005.BYTE007  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  081.Eyeq ASIL错误8                                   $    $            $    $  ANS005.BYTE007  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  082.Eyeq ASIL错误9                                   $    $            $    $  ANS005.BYTE007  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  083.Eyeq ASIL错误25                                  $    $            $    $  ANS005.BYTE007  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  084.供应商可追溯性字段                               $    $            $    $  ANS006.BYTE004  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $  085.电瓶电压                                         $    $  V         $    $  ANS007.BYTE004  $  Y=X1*0.1;
  $  086.里程读数                                         $    $  km        $    $  ANS008.BYTE004  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;
  $  087.车速                                             $    $  km/h      $    $  ANS009.BYTE004  $  Y=(X1*256+X2)*0.01;
  $  088.发动机转速                                       $    $  rpm       $    $  ANS010.BYTE004  $  if((X1*256+X2)<=65535) Y=((X1*256+X2)*1)/4;else Y=@0004;
  $  089.发动机状态                                       $    $            $    $  ANS011.BYTE004  $  if(X1==0) y=@0013;else if(X1==1) y=@0151;else y=@0004;
  $  090.Eyeq电源状态                                     $    $            $    $  ANS012.BYTE004  $  if(X1==0) y=@015c;else if(X1==1) y=@015d;else if(X1==2) y=@015e;else if(X1==3) y=@015f;else if(X1==4) y=@0160;else if(X1==5) y=@0161;else y=@0004;
  $  091.1.2V电压故障                                     $    $            $    $  ANS012.BYTE008  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  092.1.8V电压故障                                     $    $            $    $  ANS012.BYTE008  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  093.3.3V电压故障                                     $    $            $    $  ANS012.BYTE008  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  094.SPI失去通信                                      $    $            $    $  ANS012.BYTE008  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  095.引导测试错误                                     $    $            $    $  ANS012.BYTE008  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  096.堆芯转储                                         $    $            $    $  ANS012.BYTE008  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  097.诊断连续输入信号错误                             $    $            $    $  ANS012.BYTE008  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  098.致命错误                                         $    $            $    $  ANS012.BYTE008  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  099.旧自我数据                                       $    $            $    $  ANS012.BYTE007  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  100.图像缺失                                         $    $            $    $  ANS012.BYTE007  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  101.DDR CRC误差                                      $    $            $    $  ANS012.BYTE007  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  102.AEB双重检查错误                                  $    $            $    $  ANS012.BYTE007  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  103.内部CRC错误                                      $    $            $    $  ANS012.BYTE007  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  104.内部信号损坏                                     $    $            $    $  ANS012.BYTE007  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  105.挑战响应错误                                     $    $            $    $  ANS012.BYTE007  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  106.Eyeq故障印刷电路板温度                           $    $            $    $  ANS012.BYTE010  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  107.Eyeq故障eq bt温度                                $    $            $    $  ANS012.BYTE010  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  108.Eyeq故障eq-app温度                               $    $            $    $  ANS012.BYTE010  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  109.Eyeq故障12V                                      $    $            $    $  ANS012.BYTE010  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  110.Eyeq失效EOL试验                                  $    $            $    $  ANS012.BYTE010  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  111.Eyeq失败5V                                       $    $            $    $  ANS012.BYTE012  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  112.Eyeq故障闪光                                     $    $            $    $  ANS012.BYTE012  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  113.Eyeq故障异常复位                                 $    $            $    $  ANS012.BYTE012  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  114.Eyeq故障电可擦可编程只读存储器                   $    $            $    $  ANS012.BYTE012  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  115.主要状态                                         $    $            $    $  ANS012.BYTE013  $  if(X1==0) y=@0152;else if(X1==1) y=@0153;else if(X1==2) y=@0154;else if(X1==3) y=@0155;else if(X1==34) y=@0156;else if(X1==130) y=@0157;else if(X1==133) y=@0158;else if(X1==146) y=@0159;else if(X1==172) y=@015a;else if(X1==170) y=@015b;else y=@0004;
  $  116.过电压                                           $    $            $    $  ANS012.BYTE018  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  117.低电压                                           $    $            $    $  ANS012.BYTE018  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  118.总线关闭                                         $    $            $    $  ANS012.BYTE018  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  119.FVCM内部故障                                     $    $            $    $  ANS012.BYTE018  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  120.超温                                             $    $            $    $  ANS012.BYTE018  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  121.软件不匹配                                       $    $            $    $  ANS012.BYTE018  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  122.未校准的                                         $    $            $    $  ANS012.BYTE018  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  123.Eyeq_服务结果                                    $    $            $    $  ANS012.BYTE019  $  if(X1==0) y=@014f;else if(X1==1) y=@002c;else if(X1==2) y=@0150;else if(X1==3) y=@0039;else y=@0004;
  $  124.Eyeq 处理中                                      $    $            $    $  ANS012.BYTE020  $  Y=HEX(X1,X2,X3,X4);
  $  125.EOL校准完成                                      $    $            $    $  ANS013.BYTE004  $  if(((X1>>0)&1)) Y=@014d;else Y=@014e;
  $  126.服务点校准完成                                   $    $            $    $  ANS013.BYTE004  $  if(((X1>>1)&1)) Y=@014d;else Y=@014e;
  $  127.SPTAC完成                                        $    $            $    $  ANS013.BYTE004  $  if(((X1>>2)&1)) Y=@014d;else Y=@014e;
  $  128.错误原因                                         $    $            $    $  ANS013.BYTE005  $  if(X1==0x00) y=@0131;else if(X1==0x01) y=@0132;else if(X1==0x02) y=@0133;else if(X1==0x03) y=@0134;else if(X1==0x04) y=@0135;else if(X1==0x05) y=@0136;else if(X1==0x06) y=@0137;else if(X1==0x07) y=@0138;else if(X1==0x08) y=@0139;else if(X1==0x09) y=@013a;else if(X1==0x0A) y=@013b;else if(X1==0x0B) y=@013c;else if(X1==0x0C) y=@013d;else if(X1==0x0D) y=@013e;else if(X1==0x0E) y=@013f;else if(X1==0x0F) y=@0140;else if(X1==0x10) y=@0141;else if(X1==0x11) y=@0142;else if(X1==0x12) y=@0143;else if(X1==0x13) y=@0144;else if(X1==0x14) y=@0145;else if(X1==0x15) y=@0146;else if(X1==0x18) y=@0147;else if(X1==0x21) y=@0148;else if(X1==0x4B) y=@0149;else if(X1==0x4C) y=@014a;else if(X1==0x60) y=@014b;else if(X1==0x61) y=@014c;else y=@0004;
  $  129.偏航满                                           $    $            $    $  ANS013.BYTE006  $  if((X1*256+X2)<=376) Y=(X1*256+X2)*1-188;else Y=@0004;
  $  130.水平的                                           $    $            $    $  ANS013.BYTE008  $  if((X1*256+X2)<=408) Y=(X1*256+X2)*1-160;else Y=@0004;
  $  131.滚转角                                           $    $            $    $  ANS013.BYTE010  $  if((X1*256+X2)<=110) Y=(X1*256+X2)*0.001-0.055;else Y=@0004;
  $  132.自体纤维                                         $    $            $    $  ANS013.BYTE012  $  if(X1<=80) Y=X1*1-40;else Y=@0004;
  $  133.自动地平仪                                       $    $            $    $  ANS013.BYTE013  $  if(X1<=80) Y=X1*1-40;else Y=@0004;
  $  134.SPC状态                                          $    $            $    $  ANS014.BYTE004  $  if(X1==0) y=@016f;else if(X1==1) y=@0170;else if(X1==2) y=@0171;else if(X1==3) y=@0172;else if(X1==4) y=@0173;else if(X1==5) y=@0174;else if(X1==6) y=@0175;else if(X1==7) y=@0176;else if(X1==8) y=@0177;else if(X1==9) y=@0178;else y=@0004;
  $  135.SPC进程                                          $    $  %         $    $  ANS014.BYTE005  $  if(X1<=100) Y=X1*1;else Y=@0004;
  $  136.相机信息TAC2 Z                                   $    $  m         $    $  ANS015.BYTE004  $  if((X1*256+X2)<=10000) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  137.目标信息TAC2左侧高度                             $    $  m         $    $  ANS015.BYTE006  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  138.目标信息TAC2高度右侧                             $    $  m         $    $  ANS015.BYTE008  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else Y=@0004;
  $  139.目标信息左侧距离                                 $    $  m         $    $  ANS015.BYTE010  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else Y=@0004;
  $  140.目标信息横向距离右侧                             $    $  m         $    $  ANS015.BYTE012  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else Y=@0004;
  $  141.Tac2方形化                                       $    $  m         $    $  ANS015.BYTE014  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.001;else Y=@0004;
  $  142.目标信息左下角方块右                             $    $  Pixel     $    $  ANS015.BYTE016  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  143.目标信息左下角方块左                             $    $  Pixel     $    $  ANS015.BYTE017  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  144.Eyeq温度过高                                     $    $            $    $  ANS016.BYTE005  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  145.BIST失败                                         $    $            $    $  ANS016.BYTE005  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  146.PLL初始化失败                                    $    $            $    $  ANS016.BYTE005  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  147.奇偶校验失败                                     $    $            $    $  ANS016.BYTE005  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  148.启动失败的闪存CRC                                $    $            $    $  ANS016.BYTE005  $  if(((X1>>4)&1)) Y=@0039;else Y=@012e;
  $  149.DDR初始化失败                                    $    $            $    $  ANS016.BYTE005  $  if(((X1>>5)&1)) Y=@0039;else Y=@012e;
  $  150.DDR温度过高                                      $    $            $    $  ANS016.BYTE005  $  if(((X1>>6)&1)) Y=@0039;else Y=@012e;
  $  151.DDR测试失败                                      $    $            $    $  ANS016.BYTE005  $  if(((X1>>7)&1)) Y=@0039;else Y=@012e;
  $  152.应用程序的闪存CRC失败                            $    $            $    $  ANS016.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  153.应用程序CRC格式化失败                            $    $            $    $  ANS016.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  154.IFC(智能前视控制模块)内部公式应用程序            $    $            $    $  ANS016.BYTE006  $  if(x==0)  y=@0162;else if(x==10) y=@0163; else if(x==11) y=@0164; else if(x==20) y=@0165; else if(x==21) y=@0166; else if(x==50) y=@0167; else if(x==51) y=@0168; else if(x==52) y=@0169; else if(x==70) y=@016a; else if(x==80) y=@016b; else if(x==81) y=@016c; else if(x==90) y=@016d;else if(x==91) y=@016e;else y=@0004;
  $  155.IFC(智能前视控制模块)内部均衡状态                $    $            $    $  ANS016.BYTE012  $  if(X1==0) y=@0152;else if(X1==1) y=@0153;else if(X1==2) y=@0154;else if(X1==3) y=@0155;else if(X1==34) y=@0156;else if(X1==130) y=@0157;else if(X1==133) y=@0158;else if(X1==146) y=@0159;else if(X1==172) y=@015a;else if(X1==170) y=@015b;else y=@0004;
  $  156.单片机应用版本与图像处理单元（MEST）不兼容       $    $            $    $  ANS017.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  157.图像处理单元等文件与单片机校准文件不兼容         $    $            $    $  ANS017.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  158.单片机应用版本与校准数据不兼容                   $    $            $    $  ANS017.BYTE004  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  159.ECU(电子控制器)软件与车辆平台不兼容              $    $            $    $  ANS017.BYTE004  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  160.EOL校准最小偏航                                  $    $  Pixel     $    $  ANS018.BYTE004  $  if(X1<=47) Y=X1*1-47;else Y=@0004;
  $  161.EOL校准最大偏航                                  $    $  Pixel     $    $  ANS018.BYTE005  $  if(X1<=94&&X1>=47) Y=X1*1-47;else Y=@0004;
  $  162.EOL校准最小水平                                  $    $  Pixel     $    $  ANS018.BYTE006  $  if(X1<=40) Y=X1*1-40;else Y=@0004;
  $  163.EOL校准最大范围                                  $    $  Pixel     $    $  ANS018.BYTE007  $  if(X1<=102&&X1>=40) Y=X1*1-40;else Y=@0004;
  $  164.EOL校准最大滚动角                                $    $  rad       $    $  ANS018.BYTE008  $  if(X1<=55) Y=X1*0.001;else Y=@0004;
  $  165.从相机到前保险杠的距离                           $    $  m         $    $  ANS018.BYTE009  $  Y=X1*0.01;
  $  166.从摄像机到汽车中心的距离（横向距离）             $    $  m         $    $  ANS018.BYTE010  $  Y=X1*0.01-1.28;
  $  167.ABS(防抱死刹车系统)1                             $    $            $    $  ANS019.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  168.ABS(防抱死刹车系统)2                             $    $            $    $  ANS019.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  169.ESP(电控稳定系统)2                               $    $            $    $  ANS019.BYTE004  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  170.ESP(电控稳定系统)3                               $    $            $    $  ANS019.BYTE004  $  if(((X1>>3)&1)) Y=@0039;else Y=@012e;
  $  171.BCM(车身控制系统)1Y1                             $    $            $    $  ANS020.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  172.CSCY1                                            $    $            $    $  ANS020.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  173.EMS(发动机管理系统)1                             $    $            $    $  ANS021.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  174.EMS(发动机管理系统)2                             $    $            $    $  ANS021.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  175.EMS(发动机管理系统)3                             $    $            $    $  ANS021.BYTE004  $  if(((X1>>2)&1)) Y=@0039;else Y=@012e;
  $  176.EPS(电动助力转向系统)1                           $    $            $    $  ANS022.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  177.SAS(转角传感器)1                                 $    $            $    $  ANS022.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;
  $  178.HU1                                              $    $            $    $  ANS023.BYTE004  $  if(((X1>>0)&1)) Y=@0039;else Y=@012e;
  $  179.IC(仪表)1                                        $    $            $    $  ANS023.BYTE004  $  if(((X1>>1)&1)) Y=@0039;else Y=@012e;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:722 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
