
    车型ID：6b11

    模拟：协议模拟-->6b11

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:728 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 00 00 00 00 00 00       $!  ANS000:728 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 0D 00 00 00 00       $#  ANS000:728 03 19 02 0D 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:728 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 00 00 00 00 00       $%  ANS000:728 03 22 F1 00 00 00 00 00
  $%  REQ001:720 03 22 F1 83 00 00 00 00       $%  ANS001:728 03 22 F1 83 00 00 00 00
  $%  REQ002:720 03 22 F1 86 00 00 00 00       $%  ANS002:728 03 22 F1 86 00 00 00 00
  $%  REQ003:720 03 22 F1 87 00 00 00 00       $%  ANS003:728 03 22 F1 87 00 00 00 00
  $%  REQ004:720 03 22 F1 89 00 00 00 00       $%  ANS004:728 03 22 F1 89 00 00 00 00
  $%  REQ005:720 03 22 F1 8C 00 00 00 00       $%  ANS005:728 03 22 F1 8C 00 00 00 00
  $%  REQ006:720 03 22 F1 90 00 00 00 00       $%  ANS006:728 03 22 F1 90 00 00 00 00
  $%  REQ007:720 03 22 F1 91 00 00 00 00       $%  ANS007:728 03 22 F1 91 00 00 00 00
  $%  REQ008:720 03 22 F1 93 00 00 00 00       $%  ANS008:728 03 22 F1 93 00 00 00 00
  $%  REQ009:720 03 22 F1 95 00 00 00 00       $%  ANS009:728 03 22 F1 95 00 00 00 00
  $%  REQ010:720 03 22 F1 98 00 00 00 00       $%  ANS010:728 03 22 F1 98 00 00 00 00
  $%  REQ011:720 03 22 F1 99 00 00 00 00       $%  ANS011:728 03 22 F1 99 00 00 00 00
  $%  REQ012:720 03 22 F1 9D 00 00 00 00       $%  ANS012:728 03 22 F1 9D 00 00 00 00
  $%  REQ013:720 03 22 F1 A1 00 00 00 00       $%  ANS013:728 03 22 F1 A1 00 00 00 00
  $%  REQ014:720 03 22 29 0E 00 00 00 00       $%  ANS014:728 03 22 29 0E 00 00 00 00
  $%  REQ015:720 03 22 29 0F 00 00 00 00       $%  ANS015:728 03 22 29 0F 00 00 00 00
  $%  REQ016:720 03 22 29 10 00 00 00 00       $%  ANS016:728 03 22 29 10 00 00 00 00
  $%  REQ017:720 03 22 29 11 00 00 00 00       $%  ANS017:728 03 22 29 11 00 00 00 00
  $%  REQ018:720 03 22 29 12 00 00 00 00       $%  ANS018:728 03 22 29 12 00 00 00 00
  $%  REQ019:720 03 22 29 13 00 00 00 00       $%  ANS019:728 03 22 29 13 00 00 00 00
  $%  REQ020:720 03 22 F1 97 00 00 00 00       $%  ANS020:728 03 22 F1 97 00 00 00 00

  $%  000:模式配置:                       $%    $%  ANS000.BYTE004  $%  if(X1==0x01) Y=@0011;else if(X1==0x03) Y=@0456;else y=@0004;
  $%  001:供应商ECU启动软件版本号:        $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  002:当前诊断模式:                   $%    $%  ANS002.BYTE004  $%  if(X1==1) y=@00c1;else if(X1==3) y=@00c2;else y=@0004;
  $%  003:OEM（原厂设备）零件号:          $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  004:ECU软件版本编号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  005:ECU序列号:                      $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  006:VIN（车辆识别码）:              $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  007:ECU硬件版本编号:                $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  008:硬件版本编号:                   $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:软件版本编号:                   $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:诊断仪序列号:                   $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:编程日期:                       $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  012:ECU安装日期:                    $%    $%  ANS012.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  013:系统配置1:                      $%    $%  ANS013.BYTE004  $%  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  014:客户组件ID:                     $%    $%  ANS014.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  015:大陆零件号:                     $%    $%  ANS015.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  016:ACU通信版本:                    $%    $%  ANS016.BYTE004  $%  Y=ASCII(X1,X2);
  $%  017:ACU网络管理版本:                $%    $%  ANS017.BYTE004  $%  Y=ASCII(X1,X2);
  $%  018:ACU诊断协议版本:                $%    $%  ANS018.BYTE004  $%  Y=ASCII(X1,X2);
  $%  019:ACU通信协议版本:                $%    $%  ANS019.BYTE004  $%  Y=ASCII(X1,X2);
  $%  020:ACU系统名:                      $%    $%  ANS020.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:720 03 22 29 01 00 00 00 00       $  ANS000:728 03 22 29 01 00 00 00 00
  $  REQ001:720 03 22 29 02 00 00 00 00       $  ANS001:728 03 22 29 02 00 00 00 00

  $  000.功能名称1                                    $    $          $    $  ANS000.BYTE004  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  001.电阻值1                                      $    $  ohm     $    $  ANS000.BYTE005  $  y=x*0.256;
  $  002.功能名称2                                    $    $          $    $  ANS000.BYTE006  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  003.电阻值2                                      $    $  ohm     $    $  ANS000.BYTE007  $  y=x*0.256;
  $  004.功能名称3                                    $    $          $    $  ANS000.BYTE008  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  005.电阻值3                                      $    $  ohm     $    $  ANS000.BYTE009  $  y=x*0.256;
  $  006.功能名称4                                    $    $          $    $  ANS000.BYTE010  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  007.电阻值4                                      $    $  ohm     $    $  ANS000.BYTE011  $  y=x*0.256;
  $  008.功能名称5                                    $    $          $    $  ANS000.BYTE012  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  009.电阻值5                                      $    $  ohm     $    $  ANS000.BYTE013  $  y=x*0.256;
  $  010.功能名称6                                    $    $          $    $  ANS000.BYTE014  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  011.电阻值6                                      $    $  ohm     $    $  ANS000.BYTE015  $  y=x*0.256;
  $  012.功能名称7                                    $    $          $    $  ANS000.BYTE016  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  013.电阻值7                                      $    $  ohm     $    $  ANS000.BYTE017  $  y=x*0.256;
  $  014.功能名称8                                    $    $          $    $  ANS000.BYTE018  $  if(x1==0x00) y=@005a;else if(x1==0x01) y=@005b;else if(x1==0x02) y=@005c;else if(x1==0x03) y=@005d;else if(x1==0x0D) y=@005e;else if(x1==0x0E) y=@005f;else if(x1==0x0F) y=@0060;else if(x1==0x10) y=@0061;else if(x1==0x11) y=@0062;else if(x1==0x12) y=@0063;else if(x1==0x13) y=@0062;else if(x1==0x14) y=@0063;else if(x1==0x15) y=@0064;else if(x1==0x16) y=@0065;else y=@0004;
  $  015.电阻值8                                      $    $  ohm     $    $  ANS000.BYTE019  $  y=x*0.256;
  $  016.前排副驾驶安全带锁扣开关状态_未系/已系       $    $          $    $  ANS001.BYTE004  $  if(((x1>>0)&1)) y=@0066;else y=@0067;
  $  017.前排副驾驶安全带锁扣开关状态                 $    $          $    $  ANS001.BYTE004  $  if(((x1>>1)&0x03)==0) y=@0071;else if(((x1>>1)&0x03)==1) y=@003e;else if(((x1>>1)&0x03)==2) y=@003b;else y=@0004;
  $  018.前排驾驶安全带锁扣开关状态_未系/已系         $    $          $    $  ANS001.BYTE004  $  if(((x1>>4)&1)) y=@0066;else y=@0067;
  $  019.前排驾驶安全带锁扣开关状态                   $    $          $    $  ANS001.BYTE004  $  if(((x1>>5)&0x03)==0) y=@0071;else if(((x1>>5)&0x03)==1) y=@003e;else if(((x1>>5)&0x03)==2) y=@003b;else y=@0004;
  $  020.前排乘员检测开关状态_空/已坐                 $    $          $    $  ANS001.BYTE005  $  if(((x1>>0)&1)) y=@0072;else y=@0073;
  $  021.前排乘员检测开关状态                         $    $          $    $  ANS001.BYTE005  $  if(((x1>>1)&1)) y=@006d;else y=@003b;
  $  022.前排副驾驶前气囊禁用开关状态_禁用/可用       $    $          $    $  ANS001.BYTE006  $  if(((x1>>0)&1)) y=@006b;else y=@006c;
  $  023.前排副驾驶前气囊禁用开关状态                 $    $          $    $  ANS001.BYTE006  $  if(((x1>>1)&0x03)==0) y=@0071;else if(((x1>>1)&0x03)==1) y=@003e;else if(((x1>>1)&0x03)==2) y=@003b;else y=@0004;
  $  024.后排左侧安全带锁扣开关状态_未系/已系         $    $          $    $  ANS001.BYTE007  $  if(((x1>>0)&1)) y=@0066;else y=@0067;
  $  025.后排左侧安全带锁扣开关                       $    $          $    $  ANS001.BYTE007  $  if(((x1>>1)&0x03)==0) y=@0071;else if(((x1>>1)&0x03)==1) y=@003e;else if(((x1>>1)&0x03)==2) y=@003b;else y=@0004;
  $  026.后排左侧乘员检测开关状态_空/已坐             $    $          $    $  ANS001.BYTE007  $  if(((x1>>4)&1)) y=@006f;else y=@0070;
  $  027.后排左侧乘员检测开关状态                     $    $          $    $  ANS001.BYTE007  $  if(((x1>>5)&1)) y=@006e;else y=@003b;
  $  028.后排中间安全带锁扣开关状态_未系/已系         $    $          $    $  ANS001.BYTE008  $  if(((x1>>0)&1)) y=@0066;else y=@0067;
  $  029.后排中间安全带锁扣开关状态                   $    $          $    $  ANS001.BYTE008  $  if(((x1>>1)&0x03)==0) y=@0071;else if(((x1>>1)&0x03)==1) y=@003e;else if(((x1>>1)&0x03)==2) y=@003b;else y=@0004;
  $  030.后排中间乘员检测开关状态_空/已坐             $    $          $    $  ANS001.BYTE008  $  if(((x1>>4)&1)) y=@006f;else y=@0070;
  $  031.后排中间乘员检测开关状态                     $    $          $    $  ANS001.BYTE008  $  if(((x1>>5)&1)) y=@006e;else y=@003b;
  $  032.后排右侧安全带锁扣开关状态_未系/已系         $    $          $    $  ANS001.BYTE009  $  if(((x1>>0)&1)) y=@0066;else y=@0067;
  $  033.后排右侧安全带锁扣开关状态                   $    $          $    $  ANS001.BYTE009  $  if(((x1>>1)&0x03)==0) y=@0071;else if(((x1>>1)&0x03)==1) y=@003e;else if(((x1>>1)&0x03)==2) y=@003b;else y=@0004;
  $  034.后排右侧乘员检测开关状态_空/已坐             $    $          $    $  ANS001.BYTE009  $  if(((x1>>4)&1)) y=@006f;else y=@0070;
  $  035.后排右侧乘员检测开关状态                     $    $          $    $  ANS001.BYTE009  $  if(((x1>>5)&1)) y=@006e;else y=@003b;
  $  036.电源电压                                     $    $  V       $    $  ANS001.BYTE010  $  Y=X1*0.256;
  $  037.电容电压                                     $    $  V       $    $  ANS001.BYTE011  $  Y=X1*0.256;
  $  038.上电次数                                     $    $          $    $  ANS001.BYTE012  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
