
    车型ID：6b12

    模拟：协议模拟-->6b12

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:740 02 10 01 00 00 00 00 00       $~  ANS000:748 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:740 02 3E 00 00 00 00 00 00       $!  ANS000:748 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:740 03 19 02 09 00 00 00 00       $#  ANS000:748 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:740 04 14 FF FF FF 00 00 00       $$  ANS000:748 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:740 03 22 F1 86 00 00 00 00       $%  ANS000:748 03 22 F1 86 00 00 00 00
  $%  REQ001:740 03 22 F1 87 00 00 00 00       $%  ANS001:748 03 22 F1 87 00 00 00 00
  $%  REQ002:740 03 22 F1 89 00 00 00 00       $%  ANS002:748 03 22 F1 89 00 00 00 00
  $%  REQ003:740 03 22 F1 90 00 00 00 00       $%  ANS003:748 03 22 F1 90 00 00 00 00
  $%  REQ004:740 03 22 F1 91 00 00 00 00       $%  ANS004:748 03 22 F1 91 00 00 00 00
  $%  REQ005:740 03 22 F1 92 00 00 00 00       $%  ANS005:748 03 22 F1 92 00 00 00 00
  $%  REQ006:740 03 22 F1 93 00 00 00 00       $%  ANS006:748 03 22 F1 93 00 00 00 00
  $%  REQ007:740 03 22 F1 94 00 00 00 00       $%  ANS007:748 03 22 F1 94 00 00 00 00
  $%  REQ008:740 03 22 F1 95 00 00 00 00       $%  ANS008:748 03 22 F1 95 00 00 00 00
  $%  REQ009:740 03 22 F1 98 00 00 00 00       $%  ANS009:748 03 22 F1 98 00 00 00 00
  $%  REQ010:740 03 22 F1 99 00 00 00 00       $%  ANS010:748 03 22 F1 99 00 00 00 00
  $%  REQ011:740 03 22 F1 9D 00 00 00 00       $%  ANS011:748 03 22 F1 9D 00 00 00 00
  $%  REQ012:740 03 22 F1 A1 00 00 00 00       $%  ANS012:748 03 22 F1 A1 00 00 00 00

  $%  000:主动诊断会话:                 $%    $%  ANS000.BYTE004  $%  if(X1==1) y=@00c1;else if(X1==2) Y=@0194;else if(X1==3) y=@00c2;else y=@0004;
  $%  001:OEM（原厂设备）零件号:        $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  002:ECU软件版本编号:              $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  003:VIN（车辆识别码）:            $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  004:ECU硬件版本编号:              $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  005:硬件号:                       $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:硬件版本编号:                 $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  007:软件号:                       $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  008:软件版本编号:                 $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:诊断仪序列号:                 $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:编程日期:                     $%    $%  ANS010.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  011:ECU安装日期:                  $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  012:配置信息:                     $%    $%  ANS012.BYTE004  $%  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:740 03 22 4F 00 00 00 00 00       $  ANS000:748 03 22 4F 00 00 00 00 00
  $  REQ001:740 03 22 4F 01 00 00 00 00       $  ANS001:748 03 22 4F 01 00 00 00 00
  $  REQ002:740 03 22 4F 02 00 00 00 00       $  ANS002:748 03 22 4F 02 00 00 00 00
  $  REQ003:740 03 22 4F 03 00 00 00 00       $  ANS003:748 03 22 4F 03 00 00 00 00
  $  REQ004:740 03 22 4F 04 00 00 00 00       $  ANS004:748 03 22 4F 04 00 00 00 00
  $  REQ005:740 03 22 4F 05 00 00 00 00       $  ANS005:748 03 22 4F 05 00 00 00 00
  $  REQ006:740 03 22 4F 06 00 00 00 00       $  ANS006:748 03 22 4F 06 00 00 00 00
  $  REQ007:740 03 22 4F 07 00 00 00 00       $  ANS007:748 03 22 4F 07 00 00 00 00
  $  REQ008:740 03 22 4F 08 00 00 00 00       $  ANS008:748 03 22 4F 08 00 00 00 00
  $  REQ009:740 03 22 4F 09 00 00 00 00       $  ANS009:748 03 22 4F 09 00 00 00 00
  $  REQ010:740 03 22 4F 0A 00 00 00 00       $  ANS010:748 03 22 4F 0A 00 00 00 00
  $  REQ011:740 03 22 4F 0B 00 00 00 00       $  ANS011:748 03 22 4F 0B 00 00 00 00
  $  REQ012:740 03 22 4F 0C 00 00 00 00       $  ANS012:748 03 22 4F 0C 00 00 00 00
  $  REQ013:740 03 22 4F 0D 00 00 00 00       $  ANS013:748 03 22 4F 0D 00 00 00 00
  $  REQ014:740 03 22 4F 0E 00 00 00 00       $  ANS014:748 03 22 4F 0E 00 00 00 00
  $  REQ015:740 03 22 4F 0F 00 00 00 00       $  ANS015:748 03 22 4F 0F 00 00 00 00
  $  REQ016:740 03 22 4F 10 00 00 00 00       $  ANS016:748 03 22 4F 10 00 00 00 00
  $  REQ017:740 03 22 4F 11 00 00 00 00       $  ANS017:748 03 22 4F 11 00 00 00 00
  $  REQ018:740 03 22 4F 12 00 00 00 00       $  ANS018:748 03 22 4F 12 00 00 00 00
  $  REQ019:740 03 22 4F 13 00 00 00 00       $  ANS019:748 03 22 4F 13 00 00 00 00

  $  000.车内温度                                                      $    $  degC        $    $  ANS000.BYTE004  $  Y=(X1*1-26)/4;
  $  001.外部温度                                                      $    $  degC        $    $  ANS000.BYTE005  $  Y=X1*0.35-23.3;
  $  002.蒸发器温度                                                    $    $  degC        $    $  ANS000.BYTE006  $  Y=X1*0.35-29.7;
  $  003.水温                                                          $    $  degC        $    $  ANS000.BYTE007  $  Y=X1*0.35+1.3;
  $  004.车内温度A/D（模/数）原值                                      $    $  bit         $    $  ANS001.BYTE004  $  Y=X1*1;
  $  005.外部温度A/D（模/数）原值                                      $    $  bit         $    $  ANS001.BYTE005  $  Y=X1*1;
  $  006.蒸发器温度A/D（模/数）原值                                    $    $  bit         $    $  ANS001.BYTE006  $  Y=X1*1;
  $  007.阳光负荷（驾驶员）                                            $    $  w/m^2       $    $  ANS002.BYTE004  $  Y=X1*7.8;
  $  008.阳光负荷（乘客）                                              $    $  w/m^2       $    $  ANS002.BYTE005  $  Y=X1*7.8;
  $  009.压力                                                          $    $  MPaG        $    $  ANS002.BYTE006  $  Y=X1*0.0146-0.4532;
  $  010.点火电压                                                      $    $  V           $    $  ANS002.BYTE007  $  Y=X1*0.1+3;
  $  011.阳光负荷（驾驶员）A/D（模/数）原值                            $    $  bit         $    $  ANS003.BYTE004  $  Y=X1*1;
  $  012.阳光负荷（乘客）A/D（模/数）原值                              $    $  bit         $    $  ANS003.BYTE005  $  Y=X1*1;
  $  013.乘客A/D（模/数）原值                                          $    $  bit         $    $  ANS003.BYTE006  $  Y=X1*1;
  $  014.点火电压A/D（模/数）原值                                      $    $  bit         $    $  ANS003.BYTE007  $  Y=X1*1;
  $  015.ADS(湿度)                                                     $    $  %           $    $  ANS004.BYTE004  $  Y=X1*1;
  $  016.PM2.5                                                         $    $  μg/m^3     $    $  ANS004.BYTE005  $  Y=X1*256+X2;
  $  017.PM2.5原始值                                                   $    $  μg/m^3     $    $  ANS005.BYTE004  $  Y=X1*256+X2;
  $  018.PM2.5传感器风机输入                                           $    $  Hz          $    $  ANS005.BYTE006  $  Y=X1*256+X2;
  $  019.发动机冷却液温度                                              $    $  degC        $    $  ANS006.BYTE004  $  if(X1<=254) Y=X1*0.75-48;else y=@0004;
  $  020.空调权限-用于加速的空调切断请求                               $    $              $    $  ANS006.BYTE005  $  if(((X1>>0)&1)) Y=@042b; else Y=@042c;
  $  021.车速（原值）                                                  $    $  km/h        $    $  ANS007.BYTE004  $  if((X1*256+X2)<=32765) Y=(X1*256+X2)*0.01; else Y=@0004;
  $  022.发动机转速（原值）                                            $    $  rpm         $    $  ANS007.BYTE006  $  if((X1*256+X2)<=65534) Y=(X1*256+X2)*0.25;else Y=@0004;
  $  023.车速（已过滤值）                                              $    $  km/h        $    $  ANS008.BYTE004  $  if((X1*256+X2)<=255) Y=(X1*256+X2);else Y=@0004;
  $  024.发动机转速（已过滤值）                                        $    $  rpm         $    $  ANS008.BYTE006  $  if((X1*256+X2)<=65024) Y=(X1*256+X2)*0.1953125;else Y=@0004;
  $  025.混合（驾驶员）风门目标位置                                    $    $  pulse       $    $  ANS009.BYTE004  $  Y=X1*1+100;
  $  026.混合（乘客）风门目标位置                                      $    $  pulse       $    $  ANS009.BYTE005  $  Y=X1*1+100;
  $  027.混合（后部）风门目标位置                                      $    $  pulse       $    $  ANS009.BYTE006  $  Y=X1*1+100;
  $  028.空气旁路风门目标位置                                          $    $  pulse       $    $  ANS009.BYTE007  $  Y=X1*1+100;
  $  029.模式风门目标位置                                              $    $  pulse       $    $  ANS010.BYTE004  $  Y=X1*1+100;
  $  030.进风门目标位置                                                $    $  pulse       $    $  ANS010.BYTE005  $  Y=X1*1+100;
  $  031.混合（驾驶员）风门当前位置                                    $    $  pulse       $    $  ANS011.BYTE004  $  Y=X1*1+100;
  $  032.混合（乘客）风门当前位置                                      $    $  pulse       $    $  ANS011.BYTE005  $  Y=X1*1+100;
  $  033.混合（后部）风门当前位置                                      $    $  pulse       $    $  ANS011.BYTE006  $  Y=X1*1+100;
  $  034.空气旁路风门当前位置                                          $    $  pulse       $    $  ANS011.BYTE007  $  Y=X1*1+100;
  $  035.模式风门当前位置                                              $    $  pulse       $    $  ANS012.BYTE004  $  Y=X1*1+100;
  $  036.进风门当前位置                                                $    $  pulse       $    $  ANS012.BYTE005  $  Y=X1*1+100;
  $  037.点火开关                                                      $    $              $    $  ANS013.BYTE004  $  if(((X1>>0)&1)) Y=@040e;else Y=@0014;
  $  038.等离子组输入                                                  $    $              $    $  ANS013.BYTE004  $  if(((X1>>1)&1)) Y=@040e;else Y=@0014;
  $  039.空气量传感器输入                                              $    $              $    $  ANS013.BYTE004  $  if(((X1>>2)&1)) Y=@040e;else Y=@0014;
  $  040.输入开关状态(前面板)_自动开关                                 $    $              $    $  ANS014.BYTE004  $  if(((X1>>0)&1)) Y=@040e;else Y=@0014;
  $  041.输入开关状态(前面板)_关闭开关                                 $    $              $    $  ANS014.BYTE004  $  if(((X1>>1)&1)) Y=@040e;else Y=@0014;
  $  042.输入开关状态(前面板)_摆动开关                                 $    $              $    $  ANS014.BYTE004  $  if(((X1>>2)&1)) Y=@040e;else Y=@0014;
  $  043.输入开关状态(前面板)_新鲜空气/再循环空气开关                  $    $              $    $  ANS014.BYTE004  $  if(((X1>>3)&1)) Y=@040e;else Y=@0014;
  $  044.输入开关状态(前面板)_温度开关(驾驶员)                         $    $              $    $  ANS014.BYTE004  $  if(((X1/0x10)&0x03)==0) y=@00ab;else if(((X1/0x10)&0x03)==1) y=@0429;else if(((X1/0x10)&0x03)==2) y=@042a;else if(((X1/0x10)&0x03)==3) y=@0004;
  $  045.输入开关状态(前面板)_温度开关(乘客)                           $    $              $    $  ANS014.BYTE004  $  if(((X1/0x40)&0x03)==0) y=@00ab;else if(((X1/0x40)&0x03)==1) y=@0429;else if(((X1/0x40)&0x03)==2) y=@042a;else if(((X1/0x40)&0x03)==3) y=@0004;
  $  046.输入开关状态(前面板)_前鼓风机开关                             $    $              $    $  ANS014.BYTE005  $  if(X1<=62) Y=X1-31;else y=@0004;
  $  047.输入开关状态(前面板)_前除霜开关                               $    $              $    $  ANS014.BYTE006  $  if(((X1>>0)&1)) Y=@040e;else Y=@0014;
  $  048.输入开关状态(前面板)_等离子组开关                             $    $              $    $  ANS014.BYTE006  $  if(((X1>>1)&1)) Y=@040e;else Y=@0014;
  $  049.输入开关状态(触摸屏)_自动开关                                 $    $              $    $  ANS015.BYTE004  $  if(((X1>>0)&1)) Y=@040e;else Y=@0014;
  $  050.输入开关状态(触摸屏)_关闭开关                                 $    $              $    $  ANS015.BYTE004  $  if(((X1>>1)&1)) Y=@040e;else Y=@0014;
  $  051.输入开关状态(触摸屏)_风扇开关                                 $    $              $    $  ANS015.BYTE004  $  if(((X1/0x04)&0x07)==0) y=@0014;else if(((X1/0x04)&0x07)==1) y=@0299;else if(((X1/0x04)&0x07)==2) y=@029a;else if(((X1/0x04)&0x07)==3) y=@029b;else if(((X1/0x04)&0x07)==4) y=@029c;else if(((X1/0x04)&0x07)==5) y=@02ae;else if(((X1/0x04)&0x07)==6) y=@02af;else if(((X1/0x04)&0x07)==7) y=@02b0;
  $  052.输入开关状态(触摸屏)_模式开关                                 $    $              $    $  ANS015.BYTE004  $  if(((X1/0x20)&0x07)==0) y=@0014;else if(((X1/0x20)&0x07)==1) y=@0431;else if(((X1/0x20)&0x07)==4) y=@02cd;else y=@0004;
  $  053.输入开关状态(触摸屏)_空调开关                                 $    $              $    $  ANS015.BYTE005  $  if(((X1>>0)&1)) Y=@040e;else Y=@0014;
  $  054.输入开关状态(触摸屏)_单个开关                                 $    $              $    $  ANS015.BYTE005  $  if(((X1>>1)&1)) Y=@040e;else Y=@0014;
  $  055.输入开关状态(触摸屏)_除霜开关                                 $    $              $    $  ANS015.BYTE005  $  if(((X1>>2)&1)) Y=@040e;else Y=@0014;
  $  056.输入开关状态(触摸屏)_自然通风开关                             $    $              $    $  ANS015.BYTE005  $  if(((X1>>3)&1)) Y=@040e;else Y=@0014;
  $  057.输入开关状态(后面板)_自动开关                                 $    $              $    $  ANS016.BYTE004  $  if(((X1>>0)&1)) Y=@040e;else Y=@0014;
  $  058.输入开关状态(后面板)_关闭开关                                 $    $              $    $  ANS016.BYTE004  $  if(((X1>>1)&1)) Y=@040e;else Y=@0014;
  $  059.输入开关状态(后面板)_鼓风机开关                               $    $              $    $  ANS016.BYTE004  $  if(X1<=248) Y=((X1&0xfc)/4)-31;else y=@0004;
  $  060.输入开关状态(后面板)_温度开关（后）                           $    $              $    $  ANS016.BYTE005  $  if(X1<=62) Y=X1-31;else y=@0004;
  $  061.鼓风机级别                                                    $    $  Level       $    $  ANS017.BYTE004  $  if(X1<=31) Y=X1;else y=@0004;
  $  062.风扇模式（外部 关闭，自动，低，高）                           $    $              $    $  ANS018.BYTE004  $  if(X1==0) y=@00ad;else if(X1==1) y=@0014;else if(X1==2) y=@0434;else if(X1==3) y=@0435;else if(X1==4) y=@0436;else if(X1==5) y=@0437;else if(X1==6) y=@0438;else if(X1==7) y=@0439;else if(X1==8) y=@043a;else if(X1==9) y=@043b;else if(X1==10) y=@043c;else if(X1==11) y=@043d;else if(X1==12) y=@043e;else if(X1==13) y=@043f;else if(X1==14) y=@0440;else if(X1==15) y=@0441;else y=@0004;
  $  063.排气模式（外部 自动，手动面对，手动排气， ...手动除霜）       $    $              $    $  ANS018.BYTE005  $  if(X1==0) y=@00ad;else if(X1==1) y=@0431;else if(X1==2) y=@0432;else if(X1==3) y=@0433;else if(X1==4) y=@02cd;else if(X1==5) y=@00a7;else y=@0004;
  $  064.进气模式（外部 自动，手动新鲜空气，手动再循环）               $    $              $    $  ANS018.BYTE006  $  if(X1==0) y=@00ad;else if(X1==1) y=@042f;else if(X1==2) y=@0430;else y=@0004;
  $  065.压缩机模式（外部 自动，手动打开，手动关闭)                    $    $              $    $  ANS018.BYTE007  $  if(X1==0) y=@00ad;else if(X1==1) y=@042d;else if(X1==2) y=@042e;else y=@0004;
  $  066.鼓风机马达输出级                                              $    $  Level       $    $  ANS019.BYTE004  $  Y=X1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:740 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
