
    车型ID：6b18

    模拟：协议模拟-->6b18

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7A3 02 10 01 00 00 00 00 00       $~  ANS000:7AB 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7A3 02 3E 00 00 00 00 00 00       $!  ANS000:7AB 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7A3 03 19 02 09 00 00 00 00       $#  ANS000:7AB 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7A3 04 14 FF FF FF 00 00 00       $$  ANS000:7AB 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7A3 03 22 F1 83 00 00 00 00       $%  ANS000:7AB 03 22 F1 83 00 00 00 00
  $%  REQ001:7A3 03 22 F1 87 00 00 00 00       $%  ANS001:7AB 03 22 F1 87 00 00 00 00
  $%  REQ002:7A3 03 22 F1 89 00 00 00 00       $%  ANS002:7AB 03 22 F1 89 00 00 00 00
  $%  REQ003:7A3 03 22 F1 90 00 00 00 00       $%  ANS003:7AB 03 22 F1 90 00 00 00 00
  $%  REQ004:7A3 03 22 F1 91 00 00 00 00       $%  ANS004:7AB 03 22 F1 91 00 00 00 00
  $%  REQ005:7A3 03 22 F1 92 00 00 00 00       $%  ANS005:7AB 03 22 F1 92 00 00 00 00
  $%  REQ006:7A3 03 22 F1 93 00 00 00 00       $%  ANS006:7AB 03 22 F1 93 00 00 00 00
  $%  REQ007:7A3 03 22 F1 94 00 00 00 00       $%  ANS007:7AB 03 22 F1 94 00 00 00 00
  $%  REQ008:7A3 03 22 F1 95 00 00 00 00       $%  ANS008:7AB 03 22 F1 95 00 00 00 00
  $%  REQ009:7A3 03 22 F1 98 00 00 00 00       $%  ANS009:7AB 03 22 F1 98 00 00 00 00
  $%  REQ010:7A3 03 22 F1 99 00 00 00 00       $%  ANS010:7AB 03 22 F1 99 00 00 00 00
  $%  REQ011:7A3 03 22 F1 9D 00 00 00 00       $%  ANS011:7AB 03 22 F1 9D 00 00 00 00
  $%  REQ012:7A3 03 22 F1 A1 00 00 00 00       $%  ANS012:7AB 03 22 F1 A1 00 00 00 00
  $%  REQ013:7A3 03 22 F1 A4 00 00 00 00       $%  ANS013:7AB 03 22 F1 A4 00 00 00 00

  $%  000:供应商ECU启动软件版本号:        $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  001:OEM（原厂设备）零件号:          $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  002:ECU软件版本编号:                $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  003:VIN（车辆识别码）:              $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  004:ECU硬件版本编号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  005:硬件号:                         $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:硬件版本编号:                   $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  007:软件号:                         $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  008:软件版本编号:                   $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:诊断仪序列号:                   $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:编程日期:                       $%    $%  ANS010.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  011:ECU安装日期:                    $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  012:系统配置1:                      $%    $%  ANS012.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  013:供应商ECU标定软件版本号:        $%    $%  ANS013.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7A3 03 22 18 00 00 00 00 00       $  ANS000:7AB 03 22 18 00 00 00 00 00
  $  REQ001:7A3 03 22 18 01 00 00 00 00       $  ANS001:7AB 03 22 18 01 00 00 00 00

  $  000.电瓶电压                                    $    $  V         $    $  ANS000.BYTE004  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  001.点火电压                                    $    $  V         $    $  ANS000.BYTE006  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  002.车速                                        $    $  km/h      $    $  ANS000.BYTE008  $  if((X1*256+X2)<=32765) Y=(X1*256+X2)*0.01;else y=@0004;
  $  003.车辆状态                                    $    $            $    $  ANS000.BYTE010  $  if(X1==0) y=@0316;else if(X1==1) y=@0493;else if(X1==2) y=@0494;else if(X1==3) y=@0370;else if(X1==4) y=@00e8;else if(X1==5) y=@0495;else if(X1==10) y=@0496;else y=@0004;
  $  004.调平模式                                    $    $            $    $  ANS000.BYTE011  $  if(X1==0) y=@0487;else if(X1==1) y=@0131;else if(X1==2) y=@0488;else if(X1==3) y=@0489;else if(X1==4) y=@048a;else if(X1==5) y=@003e;else if(X1==6) y=@048b;else if(X1==7) y=@048c;else y=@0004;
  $  005.驾驶模式                                    $    $            $    $  ANS000.BYTE012  $  if(X1==0) y=@00e3;else if(X1==1) y=@00de;else if(X1==2) y=@00df;else if(X1==3) y=@0087;else if(X1==4) y=@0485;else if(X1==5) y=@00e1;else if(X1==6) y=@0486;else if(X1==7) y=@0004;else y=@0004;
  $  006.故障安全模式调平                            $    $            $    $  ANS000.BYTE013  $  if(X1==0) y=@048d;else if(X1==1) y=@048e;else if(X1==2) y=@048f;else if(X1==3) y=@0490;else if(X1==4) y=@0492;else y=@0004;
  $  007.故障安全模式抑制                            $    $            $    $  ANS000.BYTE014  $  if(X1==0) y=@048d;else if(X1==1) y=@048e;else if(X1==2) y=@048f;else if(X1==3) y=@0490;else if(X1==4) y=@0491;else y=@0004;
  $  008.与正常高度的偏差-左前                       $    $  mm        $    $  ANS000.BYTE015  $  if(X1<=253) Y=X1-127;else y=@0004;
  $  009.与正常高度的偏差-右前                       $    $  mm        $    $  ANS000.BYTE016  $  if(X1<=253) Y=X1-127;else y=@0004;
  $  010.与正常高度的偏差-左后                       $    $  mm        $    $  ANS000.BYTE017  $  if(X1<=253) Y=X1-127;else y=@0004;
  $  011.与正常高度的偏差-右后                       $    $  mm        $    $  ANS000.BYTE018  $  if(X1<=253) Y=X1-127;else y=@0004;
  $  012.发动机转速                                  $    $  rpm       $    $  ANS000.BYTE019  $  if((X1*256+X2)<=65534) Y=(X1*256+X2)*0.25;else y=@0004;
  $  013.ECU(电子控制器) 模式                        $    $            $    $  ANS000.BYTE021  $  if(X1==0) y=@04ac;else if(X1==1) y=@04ad;else if(X1==2) y=@04ae;else if(X1==3) y=@006a;else if(X1==4) y=@04af;else y=@0004;
  $  014.发动机状态                                  $    $            $    $  ANS000.BYTE022  $  if(X1==0) y=@04a9;else if(X1==1) y=@04aa;else if(X1==2) y=@04ab;else y=@0004;
  $  015.CSD(关键静止检测)/CDD(关键驱动检测)         $    $            $    $  ANS000.BYTE023  $  if(X1==0) y=@04a1;else if(X1==1) y=@04a2;else if(X1==2) y=@04a3;else y=@0004;
  $  016.压缩机过热信号                              $    $            $    $  ANS000.BYTE024  $  if(X1==0) y=@049f;else if(X1==1) y=@04a0;else y=@0004;
  $  017.阀过热信号                                  $    $            $    $  ANS000.BYTE025  $  if(X1==0) y=@049f;else if(X1==1) y=@04a0;else y=@0004;
  $  018.举升器信号                                  $    $            $    $  ANS000.BYTE026  $  if(X1==0) y=@04a4;else if(X1==1) y=@04a5;else if(X1==2) y=@04a6;else if(X1==3) y=@04a7;else if(X1==4) y=@04a8;else y=@0004;
  $  019.总里程                                      $    $  km        $    $  ANS000.BYTE027  $  if((X1*16777216+X2*65536+X3*256+X4)<=33554430) Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;else y=@0004;
  $  020.CDC模式                                     $    $            $    $  ANS001.BYTE004  $  if(X1==0) y=@006a;else if(X1==1) y=@00df;else if(X1==2) y=@0087;else y=@0004;
  $  021.左前阻尼电流                                $    $  mA        $    $  ANS001.BYTE005  $  if(X1<=254) Y=X1*10;else y=@0004;
  $  022.右前阻尼电流                                $    $  mA        $    $  ANS001.BYTE006  $  if(X1<=254) Y=X1*10;else y=@0004;
  $  023.左后阻尼电流                                $    $  mA        $    $  ANS001.BYTE007  $  if(X1<=254) Y=X1*10;else y=@0004;
  $  024.右后阻尼电流                                $    $  mA        $    $  ANS001.BYTE008  $  if(X1<=254) Y=X1*10;else y=@0004;
  $  025.左前高度传感器电源电压                      $    $  V         $    $  ANS001.BYTE009  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  026.右前高度传感器电源电压                      $    $  V         $    $  ANS001.BYTE011  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  027.左后高度传感器电源电压                      $    $  V         $    $  ANS001.BYTE013  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  028.右后高度传感器电源电压                      $    $  V         $    $  ANS001.BYTE015  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  029.压力传感器电源电压                          $    $  V         $    $  ANS001.BYTE017  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  030.温度传感器电源电压                          $    $  V         $    $  ANS001.BYTE019  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  031.车身加速度传感器电源电压                    $    $  V         $    $  ANS001.BYTE021  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  032.左前车身加速传感器电压                      $    $  V         $    $  ANS001.BYTE023  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  033.右前车身加速传感器电压                      $    $  V         $    $  ANS001.BYTE025  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  034.后车身加速传感器电压                        $    $  V         $    $  ANS001.BYTE027  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  035.CAN-EMS(发动机管理系统)指示的驱动扭矩       $    $  Nm        $    $  ANS001.BYTE029  $  if((X1*256+X2)<=1023) Y=X1*256+X2;else y=@0004;
  $  036.CAN-转向角左侧(+)右侧(-)                    $    $  deg       $    $  ANS001.BYTE031  $  if((X1*256+X2)<=0x599) Y=X1*256+X2; else if((X1*256+X2)>=0xfa67) Y=(X1*256+X2)-0x10000;else y=@0004;
  $  037.CAN-转向角速度                              $    $  deg/s     $    $  ANS001.BYTE033  $  if((X1*256+X2)<=0x599) Y=X1*256+X2; else if((X1*256+X2)>=0xfa67) Y=(X1*256+X2)-0x10000;else y=@0004;
  $  038.CAN-ABS(防抱死刹车系统)干预                 $    $            $    $  ANS001.BYTE035  $  if(X1==0) y=@0497;else if(X1==1) y=@0022;else y=@0004;
  $  039.CAN-ESP(电控稳定系统)干预                   $    $            $    $  ANS001.BYTE036  $  if(X1==0) y=@0497;else if(X1==1) y=@0022;else y=@0004;
  $  040.CAN-主缸压力                                $    $  bar       $    $  ANS001.BYTE037  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.2;else y=@0004;
  $  041.CAN-换挡杆信息                              $    $            $    $  ANS001.BYTE039  $  if(X1==0) y=@03f9;else if(X1==1) y=@03fa;else if(X1==2) y=@03fb;else if(X1==3) y=@03fc;else if(X1==4) y=@01e1;else if(X1==5) y=@049d;else if(X1==7) y=@0089;else if(X1==8) y=@049e;else y=@0004;
  $  042.HMI(人机接口模块)调平开关                   $    $            $    $  ANS001.BYTE040  $  if(X1==0) y=@00ab;else if(X1==1) y=@0498;else if(X1==2) y=@0499;else if(X1==3) y=@049a;else if(X1==4) y=@049b;else if(X1==5) y=@049c;else y=@0004;
  $  043.CAN–远程钥匙                               $    $            $    $  ANS001.BYTE041  $  if(X1==0) y=@0005;else if(X1==1) y=@01fa;else y=@0004;
  $  044.CAN-横向加速                                $    $  m/s^2     $    $  ANS001.BYTE042  $  if((X1*256+X2)<=0x7D0) Y=(X1*256+X2)*0.01; else if((X1*256+X2)>=0xF830) Y=((X1*256+X2)-0x10000)*0.01;else y=@0004;
  $  045.CAN-纵向加速                                $    $  m/s^2     $    $  ANS001.BYTE044  $  if((X1*256+X2)<=0x7D0) Y=(X1*256+X2)*0.01; else if((X1*256+X2)>=0xF830) Y=((X1*256+X2)-0x10000)*0.01;else y=@0004;
  $  046.调平激活                                    $    $            $    $  ANS001.BYTE046  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  047.执行器指令，压缩机继电器                    $    $            $    $  ANS001.BYTE047  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  048.执行器指令，废气阀                          $    $            $    $  ANS001.BYTE048  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  049.执行器指令，蓄压器阀                        $    $            $    $  ANS001.BYTE049  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  050.执行器指令，左前空气弹簧阀                  $    $            $    $  ANS001.BYTE050  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  051.执行器指令，右前空气弹簧阀                  $    $            $    $  ANS001.BYTE051  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  052.执行器指令，左后空气弹簧阀                  $    $            $    $  ANS001.BYTE052  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  053.执行器指令，右后空气弹簧阀                  $    $            $    $  ANS001.BYTE053  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  054.压力传感器输出                              $    $  bar       $    $  ANS001.BYTE054  $  if((X1*256+X2)<=2048) Y=(X1*256+X2)*0.01;else y=@0004;
  $  055.温度传感器输出                              $    $  deg       $    $  ANS001.BYTE056  $  if((X1*256+X2)<=0x97) Y=(X1*256+X2); else if((X1*256+X2)>=0xFFD7) Y=(X1*256+X2)-0x10000;else y=@0004;
  $  056.左前高度传感器标定偏差                      $    $  mm        $    $  ANS001.BYTE058  $  Y=X1*1-127;
  $  057.右前高度传感器标定偏差                      $    $  mm        $    $  ANS001.BYTE059  $  Y=X1*1-127;
  $  058.左后高度传感器标定偏差                      $    $  mm        $    $  ANS001.BYTE060  $  Y=X1*1-127;
  $  059.右后高度传感器标定偏差                      $    $  mm        $    $  ANS001.BYTE061  $  Y=X1*1-127;
  $  060.程序控制服务功能ID                          $    $            $    $  ANS001.BYTE062  $  Y=HEX(X1,X2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7A3 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
