
    车型ID：6b1e

    模拟：协议模拟-->6b1e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:754 02 10 01 00 00 00 00 00       $~  ANS000:75C 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:754 02 3E 00 00 00 00 00 00       $!  ANS000:75C 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:754 03 19 02 09 00 00 00 00       $#  ANS000:75C 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:754 04 14 FF FF FF 00 00 00       $$  ANS000:75C 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:754 03 22 F1 87 00 00 00 00       $%  ANS000:75C 03 22 F1 87 00 00 00 00
  $%  REQ001:754 03 22 F1 89 00 00 00 00       $%  ANS001:75C 03 22 F1 89 00 00 00 00
  $%  REQ002:754 03 22 F1 90 00 00 00 00       $%  ANS002:75C 03 22 F1 90 00 00 00 00
  $%  REQ003:754 03 22 F1 91 00 00 00 00       $%  ANS003:75C 03 22 F1 91 00 00 00 00
  $%  REQ004:754 03 22 F1 93 00 00 00 00       $%  ANS004:75C 03 22 F1 93 00 00 00 00
  $%  REQ005:754 03 22 F1 95 00 00 00 00       $%  ANS005:75C 03 22 F1 95 00 00 00 00
  $%  REQ006:754 03 22 F1 98 00 00 00 00       $%  ANS006:75C 03 22 F1 98 00 00 00 00
  $%  REQ007:754 03 22 F1 99 00 00 00 00       $%  ANS007:75C 03 22 F1 99 00 00 00 00
  $%  REQ008:754 03 22 F1 9D 00 00 00 00       $%  ANS008:75C 03 22 F1 9D 00 00 00 00
  $%  REQ009:754 03 22 F1 A1 00 00 00 00       $%  ANS009:75C 03 22 F1 A1 00 00 00 00

  $%  000:零件号:                             $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  001:ECU软件版本编号:                    $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:VIN（车辆识别码）:                  $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  003:ECU硬件版本编号:                    $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  004:供应商ECU硬件版本号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:供应商ECU软件版本号:                $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:维修车间码和/或测试仪序列号:        $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  007:编程日期:                           $%    $%  ANS007.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  008:ECU安装日期:                        $%    $%  ANS008.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  009:配置信息:                           $%    $%  ANS009.BYTE004  $%  Y=HEX(X1,X2);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:754 03 22 3C E0 00 00 00 00       $  ANS000:75C 03 22 3C E0 00 00 00 00
  $  REQ001:754 03 22 3C E1 00 00 00 00       $  ANS001:75C 03 22 3C E1 00 00 00 00
  $  REQ002:754 03 22 3C E2 00 00 00 00       $  ANS002:75C 03 22 3C E2 00 00 00 00
  $  REQ003:754 03 22 3C E3 00 00 00 00       $  ANS003:75C 03 22 3C E3 00 00 00 00
  $  REQ004:754 03 22 3C E4 00 00 00 00       $  ANS004:75C 03 22 3C E4 00 00 00 00
  $  REQ005:754 03 22 3C E5 00 00 00 00       $  ANS005:75C 03 22 3C E5 00 00 00 00
  $  REQ006:754 03 22 3C E6 00 00 00 00       $  ANS006:75C 03 22 3C E6 00 00 00 00
  $  REQ007:754 03 22 3C E7 00 00 00 00       $  ANS007:75C 03 22 3C E7 00 00 00 00
  $  REQ008:754 03 22 3C E8 00 00 00 00       $  ANS008:75C 03 22 3C E8 00 00 00 00
  $  REQ009:754 03 22 3C E9 00 00 00 00       $  ANS009:75C 03 22 3C E9 00 00 00 00
  $  REQ010:754 03 22 3C EA 00 00 00 00       $  ANS010:75C 03 22 3C EA 00 00 00 00
  $  REQ011:754 03 22 3C EB 00 00 00 00       $  ANS011:75C 03 22 3C EB 00 00 00 00
  $  REQ012:754 03 22 3C EC 00 00 00 00       $  ANS012:75C 03 22 3C EC 00 00 00 00
  $  REQ013:754 03 22 3C ED 00 00 00 00       $  ANS013:75C 03 22 3C ED 00 00 00 00
  $  REQ014:754 03 22 3C EE 00 00 00 00       $  ANS014:75C 03 22 3C EE 00 00 00 00
  $  REQ015:754 03 22 3C EF 00 00 00 00       $  ANS015:75C 03 22 3C EF 00 00 00 00
  $  REQ016:754 03 22 3C F0 00 00 00 00       $  ANS016:75C 03 22 3C F0 00 00 00 00
  $  REQ017:754 03 22 3C F1 00 00 00 00       $  ANS017:75C 03 22 3C F1 00 00 00 00
  $  REQ018:754 03 22 3C F3 00 00 00 00       $  ANS018:75C 03 22 3C F3 00 00 00 00
  $  REQ019:754 03 22 3C F4 00 00 00 00       $  ANS019:75C 03 22 3C F4 00 00 00 00
  $  REQ020:754 03 22 3C FD 00 00 00 00       $  ANS020:75C 03 22 3C FD 00 00 00 00
  $  REQ021:754 03 22 3C FE 00 00 00 00       $  ANS021:75C 03 22 3C FE 00 00 00 00
  $  REQ022:754 03 22 3C FF 00 00 00 00       $  ANS022:75C 03 22 3C FF 00 00 00 00

  $  000.驾驶员车门打开-关闭状态                                                    $    $                 $    $  ANS000.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  001.驾驶员车窗状态                                                             $    $                 $    $  ANS001.BYTE004  $  if(X1==0) y=@02fe;else if(X1==1) y=@02ff;else if(X1==2) y=@0300;else if(X1==3) y=@0301;else if(X1==4) y=@0302;else if(X1==5) y=@0303;else if(X1==6) y=@0304;else if(X1==7) y=@0004;else y=@0004;
  $  002.驾驶员后视镜转向灯状态                                                     $    $                 $    $  ANS002.BYTE004  $  if(X1==0) y=@0457;else if(X1==1) y=@02bb;else y=@0004;
  $  003.驾驶员后视镜折叠状态                                                       $    $                 $    $  ANS003.BYTE004  $  if(X1==0) y=@011f;else if(X1==1) y=@0120;else y=@0004;
  $  004.驾驶员后视镜调整状态                                                       $    $                 $    $  ANS004.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@02fc;else if(X1==2) y=@02fd;else y=@0004;
  $  005.驾驶员后视镜加热状态                                                       $    $                 $    $  ANS005.BYTE004  $  if(X1==0) y=@01f3;else if(X1==1) y=@01f4;else y=@0004;
  $  006.驾驶员车门锁状态                                                           $    $                 $    $  ANS006.BYTE004  $  if(X1==0) y=@0030;else if(X1==1) y=@004b;else y=@0004;
  $  007.驾驶员车门灯&驾驶员迎宾灯输出状态                                          $    $                 $    $  ANS007.BYTE004  $  if(X1==0) y=@0457;else if(X1==1) y=@02bb;else y=@0004;
  $  008.中控锁开关状态                                                             $    $                 $    $  ANS008.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@004b;else if(X1==2) y=@0030;else y=@0004;
  $  009.驾驶员车窗开关状态                                                         $    $                 $    $  ANS009.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0192;else if(X1==2) y=@0193;else if(X1==3) y=@0459;else if(X1==4) y=@045a;else y=@0004;
  $  010.副驾驶车窗开关状态                                                         $    $                 $    $  ANS010.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0192;else if(X1==2) y=@0193;else if(X1==3) y=@0459;else if(X1==4) y=@045a;else y=@0004;
  $  011.左后车窗开关状态                                                           $    $                 $    $  ANS011.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0192;else if(X1==2) y=@0193;else if(X1==3) y=@0459;else if(X1==4) y=@045a;else y=@0004;
  $  012.右后车窗开关状态                                                           $    $                 $    $  ANS012.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0192;else if(X1==2) y=@0193;else if(X1==3) y=@0459;else if(X1==4) y=@045a;else y=@0004;
  $  013.后车窗禁止功能状态                                                         $    $                 $    $  ANS013.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  014.后视镜功能开关状态                                                         $    $                 $    $  ANS014.BYTE004  $  if(X1==0) y=@00af;else if(X1==1) y=@045b;else if(X1==2) y=@045c;else if(X1==3) y=@01f4;else if(X1==4) y=@0120;else y=@0004;
  $  015.后视镜调节开关状态                                                         $    $                 $    $  ANS015.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0308;else if(X1==2) y=@0309;else if(X1==3) y=@0121;else if(X1==4) y=@0122;else y=@0004;
  $  016.机械钥匙输入开关状态                                                       $    $                 $    $  ANS016.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0458;else if(X1==2) y=@0030;else y=@0004;
  $  017.后视镜自动折叠功能状态                                                     $    $                 $    $  ANS017.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  018.中控锁指示灯驱动输出状态                                                   $    $                 $    $  ANS018.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  019.存储的记忆位置个数                                                         $    $                 $    $  ANS019.BYTE004  $  if(X1==0) Y=@0107;else if(X1==1) Y=@0095;else if(X1==2) Y=@0096;else if(X1==3) Y=@0097;else y=@0004;
  $  020.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息1_位置                 $    $  Hall Pulse     $    $  ANS020.BYTE004  $  Y=(X1*256+X2)*1;
  $  021.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息1_马达转速             $    $  rad/s          $    $  ANS020.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  022.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息1_历史速度             $    $  rad/s          $    $  ANS020.BYTE008  $  Y=((X1*256+X2)*1)/4;
  $  023.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息1_加紧力               $    $  N              $    $  ANS020.BYTE010  $  Y=X1*1;
  $  024.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息1_电压                 $    $  V              $    $  ANS020.BYTE011  $  Y=X1*1;
  $  025.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息2_位置                 $    $  Hall Pulse     $    $  ANS021.BYTE004  $  Y=(X1*256+X2)*1;
  $  026.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息2_马达转速             $    $  rad/s          $    $  ANS021.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  027.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息2_位置_速度_基础       $    $  rad/s          $    $  ANS021.BYTE008  $  Y=X1*0.25;
  $  028.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息2_差速                 $    $  rad/s          $    $  ANS021.BYTE009  $  Y=X1*0.25;
  $  029.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息2_位置_差别_故障       $    $  N              $    $  ANS021.BYTE010  $  Y=X1*1;
  $  030.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息3_位置                 $    $  Hall Pulse     $    $  ANS022.BYTE004  $  Y=(X1*256+X2)*1;
  $  031.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息3_马达转速             $    $  rad/s          $    $  ANS022.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  032.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息3_加速力               $    $  N              $    $  ANS022.BYTE008  $  Y=X1*1;
  $  033.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息3_防夹_Thd             $    $  N              $    $  ANS022.BYTE009  $  Y=X1*1;
  $  034.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息3_敏感速度             $    $  N              $    $  ANS022.BYTE010  $  Y=X1*1;
  $  035.DDCU(驾驶员门控制单元) APA(自动泊车辅助系统)反馈讯息3_环境温度             $    $  degC           $    $  ANS022.BYTE011  $  Y=X1-40;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:754 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
