
    车型ID：6b1f

    模拟：协议模拟-->6b1f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7A6 02 10 01 00 00 00 00 00       $~  ANS000:7AE 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7A6 02 3E 00 00 00 00 00 00       $!  ANS000:7AE 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7A6 03 19 02 09 00 00 00 00       $#  ANS000:7AE 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7A6 04 14 FF FF FF 00 00 00       $$  ANS000:7AE 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7A6 03 22 F1 87 00 00 00 00       $%  ANS000:7AE 03 22 F1 87 00 00 00 00
  $%  REQ001:7A6 03 22 F1 89 00 00 00 00       $%  ANS001:7AE 03 22 F1 89 00 00 00 00
  $%  REQ002:7A6 03 22 F1 8C 00 00 00 00       $%  ANS002:7AE 03 22 F1 8C 00 00 00 00
  $%  REQ003:7A6 03 22 F1 90 00 00 00 00       $%  ANS003:7AE 03 22 F1 90 00 00 00 00
  $%  REQ004:7A6 03 22 F1 91 00 00 00 00       $%  ANS004:7AE 03 22 F1 91 00 00 00 00
  $%  REQ005:7A6 03 22 F1 92 00 00 00 00       $%  ANS005:7AE 03 22 F1 92 00 00 00 00
  $%  REQ006:7A6 03 22 F1 93 00 00 00 00       $%  ANS006:7AE 03 22 F1 93 00 00 00 00
  $%  REQ007:7A6 03 22 F1 94 00 00 00 00       $%  ANS007:7AE 03 22 F1 94 00 00 00 00
  $%  REQ008:7A6 03 22 F1 95 00 00 00 00       $%  ANS008:7AE 03 22 F1 95 00 00 00 00
  $%  REQ009:7A6 03 22 F1 98 00 00 00 00       $%  ANS009:7AE 03 22 F1 98 00 00 00 00
  $%  REQ010:7A6 03 22 F1 9C 00 00 00 00       $%  ANS010:7AE 03 22 F1 9C 00 00 00 00
  $%  REQ011:7A6 03 22 F1 9D 00 00 00 00       $%  ANS011:7AE 03 22 F1 9D 00 00 00 00
  $%  REQ012:7A6 03 22 F1 A1 00 00 00 00       $%  ANS012:7AE 03 22 F1 A1 00 00 00 00
  $%  REQ013:7A6 03 22 F1 A4 00 00 00 00       $%  ANS013:7AE 03 22 F1 A4 00 00 00 00

  $%  000:OEM（原厂设备）零件号:          $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  001:ECU软件版本编号:                $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:ECU序列号:                      $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  003:VIN（车辆识别码）:              $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  004:ECU硬件版本编号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  005:硬件号:                         $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:硬件版本编号:                   $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  007:软件号:                         $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  008:软件版本编号:                   $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:诊断仪序列号:                   $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:标定软件版本号:                 $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25);
  $%  011:ECU安装日期:                    $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  012:系统配置1:                      $%    $%  ANS012.BYTE004  $%  Y=HEX(X1,X2,X3);
  $%  013:供应商ECU标定软件版本号:        $%    $%  ANS013.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7A6 03 22 19 80 00 00 00 00       $  ANS000:7AE 03 22 19 80 00 00 00 00
  $  REQ001:7A6 03 22 01 00 00 00 00 00       $  ANS001:7AE 03 22 01 00 00 00 00 00
  $  REQ002:7A6 03 22 01 01 00 00 00 00       $  ANS002:7AE 03 22 01 01 00 00 00 00
  $  REQ003:7A6 03 22 19 82 00 00 00 00       $  ANS003:7AE 03 22 19 82 00 00 00 00
  $  REQ004:7A6 03 22 19 83 00 00 00 00       $  ANS004:7AE 03 22 19 83 00 00 00 00
  $  REQ005:7A6 03 22 19 84 00 00 00 00       $  ANS005:7AE 03 22 19 84 00 00 00 00
  $  REQ006:7A6 03 22 19 85 00 00 00 00       $  ANS006:7AE 03 22 19 85 00 00 00 00
  $  REQ007:7A6 03 22 19 86 00 00 00 00       $  ANS007:7AE 03 22 19 86 00 00 00 00
  $  REQ008:7A6 03 22 19 87 00 00 00 00       $  ANS008:7AE 03 22 19 87 00 00 00 00
  $  REQ009:7A6 03 22 19 88 00 00 00 00       $  ANS009:7AE 03 22 19 88 00 00 00 00
  $  REQ010:7A6 03 22 19 89 00 00 00 00       $  ANS010:7AE 03 22 19 89 00 00 00 00
  $  REQ011:7A6 03 22 19 8A 00 00 00 00       $  ANS011:7AE 03 22 19 8A 00 00 00 00
  $  REQ012:7A6 03 22 19 8B 00 00 00 00       $  ANS012:7AE 03 22 19 8B 00 00 00 00
  $  REQ013:7A6 03 22 19 8C 00 00 00 00       $  ANS013:7AE 03 22 19 8C 00 00 00 00
  $  REQ014:7A6 03 22 19 8D 00 00 00 00       $  ANS014:7AE 03 22 19 8D 00 00 00 00
  $  REQ015:7A6 03 22 19 8E 00 00 00 00       $  ANS015:7AE 03 22 19 8E 00 00 00 00
  $  REQ016:7A6 03 22 19 8F 00 00 00 00       $  ANS016:7AE 03 22 19 8F 00 00 00 00
  $  REQ017:7A6 03 22 19 90 00 00 00 00       $  ANS017:7AE 03 22 19 90 00 00 00 00
  $  REQ018:7A6 03 22 19 91 00 00 00 00       $  ANS018:7AE 03 22 19 91 00 00 00 00
  $  REQ019:7A6 03 22 19 92 00 00 00 00       $  ANS019:7AE 03 22 19 92 00 00 00 00
  $  REQ020:7A6 03 22 19 93 00 00 00 00       $  ANS020:7AE 03 22 19 93 00 00 00 00
  $  REQ021:7A6 03 22 19 94 00 00 00 00       $  ANS021:7AE 03 22 19 94 00 00 00 00
  $  REQ022:7A6 03 22 19 95 00 00 00 00       $  ANS022:7AE 03 22 19 95 00 00 00 00
  $  REQ023:7A6 03 22 19 96 00 00 00 00       $  ANS023:7AE 03 22 19 96 00 00 00 00
  $  REQ024:7A6 03 22 19 97 00 00 00 00       $  ANS024:7AE 03 22 19 97 00 00 00 00
  $  REQ025:7A6 03 22 19 98 00 00 00 00       $  ANS025:7AE 03 22 19 98 00 00 00 00
  $  REQ026:7A6 03 22 19 99 00 00 00 00       $  ANS026:7AE 03 22 19 99 00 00 00 00
  $  REQ027:7A6 03 22 19 9A 00 00 00 00       $  ANS027:7AE 03 22 19 9A 00 00 00 00
  $  REQ028:7A6 03 22 19 9B 00 00 00 00       $  ANS028:7AE 03 22 19 9B 00 00 00 00
  $  REQ029:7A6 03 22 19 9C 00 00 00 00       $  ANS029:7AE 03 22 19 9C 00 00 00 00
  $  REQ030:7A6 03 22 19 9D 00 00 00 00       $  ANS030:7AE 03 22 19 9D 00 00 00 00
  $  REQ031:7A6 03 22 19 9E 00 00 00 00       $  ANS031:7AE 03 22 19 9E 00 00 00 00
  $  REQ032:7A6 03 22 19 9F 00 00 00 00       $  ANS032:7AE 03 22 19 9F 00 00 00 00
  $  REQ033:7A6 03 22 19 A0 00 00 00 00       $  ANS033:7AE 03 22 19 A0 00 00 00 00
  $  REQ034:7A6 03 22 19 A1 00 00 00 00       $  ANS034:7AE 03 22 19 A1 00 00 00 00
  $  REQ035:7A6 03 22 19 A2 00 00 00 00       $  ANS035:7AE 03 22 19 A2 00 00 00 00
  $  REQ036:7A6 03 22 19 A3 00 00 00 00       $  ANS036:7AE 03 22 19 A3 00 00 00 00
  $  REQ037:7A6 03 22 19 A4 00 00 00 00       $  ANS037:7AE 03 22 19 A4 00 00 00 00
  $  REQ038:7A6 03 22 19 A5 00 00 00 00       $  ANS038:7AE 03 22 19 A5 00 00 00 00
  $  REQ039:7A6 03 22 19 A6 00 00 00 00       $  ANS039:7AE 03 22 19 A6 00 00 00 00
  $  REQ040:7A6 03 22 19 A7 00 00 00 00       $  ANS040:7AE 03 22 19 A7 00 00 00 00
  $  REQ041:7A6 03 22 19 A8 00 00 00 00       $  ANS041:7AE 03 22 19 A8 00 00 00 00
  $  REQ042:7A6 03 22 19 A9 00 00 00 00       $  ANS042:7AE 03 22 19 A9 00 00 00 00
  $  REQ043:7A6 03 22 19 AA 00 00 00 00       $  ANS043:7AE 03 22 19 AA 00 00 00 00
  $  REQ044:7A6 03 22 19 AB 00 00 00 00       $  ANS044:7AE 03 22 19 AB 00 00 00 00
  $  REQ045:7A6 03 22 19 AC 00 00 00 00       $  ANS045:7AE 03 22 19 AC 00 00 00 00
  $  REQ046:7A6 03 22 19 AD 00 00 00 00       $  ANS046:7AE 03 22 19 AD 00 00 00 00
  $  REQ047:7A6 03 22 19 AE 00 00 00 00       $  ANS047:7AE 03 22 19 AE 00 00 00 00
  $  REQ048:7A6 03 22 19 AF 00 00 00 00       $  ANS048:7AE 03 22 19 AF 00 00 00 00
  $  REQ049:7A6 03 22 19 B0 00 00 00 00       $  ANS049:7AE 03 22 19 B0 00 00 00 00
  $  REQ050:7A6 03 22 19 B1 00 00 00 00       $  ANS050:7AE 03 22 19 B1 00 00 00 00
  $  REQ051:7A6 03 22 19 B2 00 00 00 00       $  ANS051:7AE 03 22 19 B2 00 00 00 00
  $  REQ052:7A6 03 22 19 B3 00 00 00 00       $  ANS052:7AE 03 22 19 B3 00 00 00 00
  $  REQ053:7A6 03 22 19 B4 00 00 00 00       $  ANS053:7AE 03 22 19 B4 00 00 00 00
  $  REQ054:7A6 03 22 19 B5 00 00 00 00       $  ANS054:7AE 03 22 19 B5 00 00 00 00
  $  REQ055:7A6 03 22 19 B6 00 00 00 00       $  ANS055:7AE 03 22 19 B6 00 00 00 00
  $  REQ056:7A6 03 22 19 B7 00 00 00 00       $  ANS056:7AE 03 22 19 B7 00 00 00 00
  $  REQ057:7A6 03 22 19 B8 00 00 00 00       $  ANS057:7AE 03 22 19 B8 00 00 00 00
  $  REQ058:7A6 03 22 19 B9 00 00 00 00       $  ANS058:7AE 03 22 19 B9 00 00 00 00
  $  REQ059:7A6 03 22 19 BA 00 00 00 00       $  ANS059:7AE 03 22 19 BA 00 00 00 00
  $  REQ060:7A6 03 22 19 BB 00 00 00 00       $  ANS060:7AE 03 22 19 BB 00 00 00 00
  $  REQ061:7A6 03 22 19 BC 00 00 00 00       $  ANS061:7AE 03 22 19 BC 00 00 00 00
  $  REQ062:7A6 03 22 19 BD 00 00 00 00       $  ANS062:7AE 03 22 19 BD 00 00 00 00
  $  REQ063:7A6 03 22 19 BE 00 00 00 00       $  ANS063:7AE 03 22 19 BE 00 00 00 00
  $  REQ064:7A6 03 22 19 BF 00 00 00 00       $  ANS064:7AE 03 22 19 BF 00 00 00 00
  $  REQ065:7A6 03 22 19 C1 00 00 00 00       $  ANS065:7AE 03 22 19 C1 00 00 00 00

  $  000.电瓶电压                                                                               $    $  V        $    $  ANS000.BYTE004  $  if((X1*256+X2)<=61440) Y=((X1*256+X2)*1)/4096;else y=@0004;
  $  001.车速                                                                                   $    $  km/h     $    $  ANS001.BYTE004  $  if((X1*256+X2)<=32765) Y=(X1*256+X2)*0.01;else y=@0004;
  $  002.行驶里程                                                                               $    $  km       $    $  ANS002.BYTE004  $  if((X1*16777216+X2*65536+X3*256+X4)<=33554430) Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;else y=@0004;
  $  003.点火开关状态                                                                           $    $           $    $  ANS003.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  004.整车驾驶模式                                                                           $    $           $    $  ANS004.BYTE004  $  if(X1==0) y=@045d;else if(X1==1) y=@00de;else if(X1==2) y=@00df;else if(X1==3) y=@0087;else if(X1==4) y=@00e0;else if(X1==5) y=@00e1;else if(X1==6) y=@045e;else if(X1==7) y=@00eb;else if(X1==8) y=@00e2;else y=@0004;
  $  005.DMS(驾驶模式开关)系统故障状态                                                          $    $           $    $  ANS005.BYTE004  $  if(X1==0) y=@00f5;else if(X1==1) y=@0071;else y=@0004;
  $  006.DMS驾驶模式正在切换过程中                                                              $    $           $    $  ANS006.BYTE004  $  if(X1==0) y=@00f3;else if(X1==1) y=@00f4;else y=@0004;
  $  007.发动机当前驾驶模式                                                                     $    $           $    $  ANS007.BYTE004  $  if(X1==0) y=@00f8;else if(X1==1) y=@00f9;else if(X1==2) y=@00fa;else if(X1==3) y=@00fb;else if(X1==6) y=@00e2;else y=@0004;
  $  008.发动机目标驾驶模式                                                                     $    $           $    $  ANS008.BYTE004  $  if(X1==0) y=@00f8;else if(X1==1) y=@00f9;else if(X1==2) y=@00fa;else if(X1==3) y=@00fb;else if(X1==6) y=@00e2;else y=@0004;
  $  009.发动机模式切换使能信号                                                                 $    $           $    $  ANS009.BYTE004  $  if(X1==0) y=@00f6;else if(X1==1) y=@0469;else y=@0004;
  $  010.变速器当前驾驶模式                                                                     $    $           $    $  ANS010.BYTE004  $  if(X1==0) y=@0088;else if(X1==1) y=@00ec;else if(X1==2) y=@00ed;else if(X1==3) y=@00ee;else if(X1==4) y=@00e9;else if(X1==5) y=@00e1;else if(X1==6) y=@00ef;else if(X1==7) y=@00f0;else if(X1==8) y=@00eb;else if(X1==9) y=@0087;else if(X1==10) y=@0461;else if(X1==11) y=@00f1;else if(X1==12) y=@00f2;else if(X1==13) y=@00de;else if(X1==14) y=@00df;else if(X1==15) y=@00e2;else y=@0004;
  $  011.变速器目标驾驶模式                                                                     $    $           $    $  ANS011.BYTE004  $  if(X1==0) y=@00df;else if(X1==1) y=@00de;else if(X1==2) y=@0087;else if(X1==3) y=@00e9;else if(X1==4) y=@00e1;else if(X1==5) y=@0461;else if(X1==6) y=@00eb;else if(X1==7) y=@00e2;else y=@0004;
  $  012.变速器模式切换使能信号                                                                 $    $           $    $  ANS012.BYTE004  $  if(X1==0) y=@00f6;else if(X1==1) y=@0469;else y=@0004;
  $  013.EPS(电动助力转向系统) 当前驾驶模式                                                     $    $           $    $  ANS013.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@0087;else if(X1==2) y=@00df;else if(X1==3) y=@00e2;else y=@0004;
  $  014.EPS(电动助力转向系统) 目标驾驶模式                                                     $    $           $    $  ANS014.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@0087;else if(X1==2) Y=@000d;else if(X1==3) y=@00e2;else y=@0004;
  $  015.EPS(电动助力转向系统) 模式切换使能信号                                                 $    $           $    $  ANS015.BYTE004  $  if(X1==0) y=@00f6;else if(X1==1) y=@0469;else y=@0004;
  $  016.ESP(电控稳定系统) 当前驾驶模式                                                         $    $           $    $  ANS016.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@00de;else if(X1==2) y=@00e0;else if(X1==3) y=@00e1;else if(X1==4) y=@0461;else if(X1==5) y=@00eb;else if(X1==6) y=@0087;else if(X1==7) y=@00e2;else y=@0004;
  $  017.ESP(电控稳定系统) 目标驾驶模式                                                         $    $           $    $  ANS017.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@00de;else if(X1==2) y=@00e0;else if(X1==3) y=@00e1;else if(X1==4) y=@0461;else if(X1==5) y=@00eb;else if(X1==6) y=@0087;else if(X1==7) y=@00e2;else y=@0004;
  $  018.ESP(电控稳定系统) 模式切换使能信号                                                     $    $           $    $  ANS018.BYTE004  $  if(X1==0) y=@00f6;else if(X1==1) y=@0469;else y=@0004;
  $  019.TOD(智能四驱系统) 当前驾驶模式                                                         $    $           $    $  ANS019.BYTE004  $  if(X1==0) y=@045f;else if(X1==1) y=@0460;else if(X1==2) y=@00e3;else if(X1==3) y=@00e2;else y=@0004;
  $  020.TOD(智能四驱系统) 目标驾驶模式                                                         $    $           $    $  ANS020.BYTE004  $  if(X1==0) y=@045f;else if(X1==1) y=@000d;else if(X1==2) y=@0466;else if(X1==3) y=@0467;else if(X1==4) y=@0468;else if(X1==5) y=@000d;else if(X1==6) y=@00e3;else if(X1==7) y=@0004;else y=@0004;
  $  021.TOD(智能四驱系统) 模式切换使能信号                                                     $    $           $    $  ANS021.BYTE004  $  if(X1==0) y=@00f6;else if(X1==1) y=@0469;else y=@0004;
  $  022.Air suspension当前驾驶模式                                                             $    $           $    $  ANS022.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@0087;else if(X1==2) y=@0462;else if(X1==3) y=@0463;else if(X1==4) y=@0464;else if(X1==5) y=@0465;else if(X1==6) y=@00e1;else if(X1==7) y=@00e2;else y=@0004;
  $  023.CDC 当前驾驶模式                                                                       $    $           $    $  ANS023.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@00df;else if(X1==2) y=@0087;else if(X1==3) y=@00e2;else y=@0004;
  $  024.Air suspension/CDC 目标驾驶模式                                                        $    $           $    $  ANS024.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@00de;else if(X1==2) y=@00df;else if(X1==3) y=@0087;else if(X1==4) y=@00e9;else if(X1==5) y=@00e1;else if(X1==7) y=@00e2;else y=@0004;
  $  025.空气悬架上升开关                                                                       $    $           $    $  ANS025.BYTE004  $  if(X1==0) y=@00ab;else if(X1==1) y=@00ac;else y=@0004;
  $  026.空气悬架下降开关                                                                       $    $           $    $  ANS026.BYTE004  $  if(X1==0) y=@00ab;else if(X1==1) y=@00ac;else y=@0004;
  $  027.左前轮悬架高度                                                                         $    $  mm       $    $  ANS027.BYTE004  $  Y=X1*1-127;
  $  028.右前轮悬架高度                                                                         $    $  mm       $    $  ANS028.BYTE004  $  Y=X1*1-127;
  $  029.左后轮悬架高度                                                                         $    $  mm       $    $  ANS029.BYTE004  $  Y=X1*1-127;
  $  030.右后轮悬架高度                                                                         $    $  mm       $    $  ANS030.BYTE004  $  Y=X1*1-127;
  $  031.前悬架高度                                                                             $    $  mm       $    $  ANS031.BYTE004  $  Y=X1*1-126;
  $  032.后悬架高度                                                                             $    $  mm       $    $  ANS032.BYTE004  $  Y=X1*1-126;
  $  033.主继电器驱动状态                                                                       $    $           $    $  ANS033.BYTE004  $  if(X1==0) y=@00e7;else if(X1==1) y=@00e8;else y=@0004;
  $  034.低端驱动1 占空比（高有效）                                                             $    $  %        $    $  ANS034.BYTE004  $  if((X1*256+X2)<=25642) Y=(X1*256+X2)*0.0039;else y=@0004;
  $  035.低端驱动2 占空比（高有效）                                                             $    $  %        $    $  ANS035.BYTE004  $  if((X1*256+X2)<=25642) Y=(X1*256+X2)*0.0039;else y=@0004;
  $  036.低端驱动3 占空比（高有效）                                                             $    $  %        $    $  ANS036.BYTE004  $  if((X1*256+X2)<=25642) Y=(X1*256+X2)*0.0039;else y=@0004;
  $  037.低端驱动4 占空比（高有效）                                                             $    $  %        $    $  ANS037.BYTE004  $  if((X1*256+X2)<=25642) Y=(X1*256+X2)*0.0039;else y=@0004;
  $  038.开关量1信号输入                                                                        $    $           $    $  ANS038.BYTE004  $  if(X1==0) y=@02a7;else if(X1==1) y=@02f2;else y=@0004;
  $  039.开关量2信号输入                                                                        $    $           $    $  ANS039.BYTE004  $  if(X1==0) y=@02a7;else if(X1==1) y=@02f2;else y=@0004;
  $  040.开关量3信号输入                                                                        $    $           $    $  ANS040.BYTE004  $  if(X1==0) y=@02a7;else if(X1==1) y=@02f2;else y=@0004;
  $  041.开关量4信号输入                                                                        $    $           $    $  ANS041.BYTE004  $  if(X1==0) y=@02a7;else if(X1==1) y=@02f2;else y=@0004;
  $  042.驾驶员OVERRIDE标志位                                                                   $    $           $    $  ANS042.BYTE004  $  if(X1==0) y=@0005;else if(X1==1) y=@0016;else y=@0004;
  $  043.AVH功能开关                                                                            $    $           $    $  ANS043.BYTE004  $  if(X1==0) y=@0005;else if(X1==1) y=@0016;else y=@0004;
  $  044.AVH状态                                                                                $    $           $    $  ANS044.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@046a;else if(X1==2) y=@0016;else if(X1==3) y=@0071;else y=@0004;
  $  045.HDC功能开关                                                                            $    $           $    $  ANS045.BYTE004  $  if(X1==0) y=@00ab;else if(X1==1) y=@00ac;else y=@0004;
  $  046.HDC状态                                                                                $    $           $    $  ANS046.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@046a;else if(X1==2) y=@0016;else if(X1==3) y=@0071;else y=@0004;
  $  047.自动模式行驶里程                                                                       $    $  km       $    $  ANS047.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  048.舒适模式行驶里程                                                                       $    $  km       $    $  ANS048.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  049.经济模式行驶里程                                                                       $    $  km       $    $  ANS049.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  050.运动模式行驶里程                                                                       $    $  km       $    $  ANS050.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  051.全路况模式行驶里程                                                                     $    $  km       $    $  ANS051.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  052.越野模式行驶里程                                                                       $    $  km       $    $  ANS052.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  053.自定义模式行驶里程                                                                     $    $  km       $    $  ANS053.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  054.电动车模式里程                                                                         $    $  km       $    $  ANS054.BYTE004  $  if((X1*65536+X2*256+X3)<=1000000) Y=(X1*65536+X2*256+X3)*1;else y=@0004;
  $  055.纵向坡度                                                                               $    $           $    $  ANS055.BYTE004  $  if((X1*256+X2)<=400) Y=(X1*256+X2)*0.5-100;else y=@0004;
  $  056.纵向坡度可信度                                                                         $    $           $    $  ANS056.BYTE004  $  if(X1==0) y=@0005;else if(X1==1) y=@0016;else y=@0004;
  $  057.侧向坡度                                                                               $    $           $    $  ANS057.BYTE004  $  if((X1*256+X2)<=400) Y=(X1*256+X2)*0.5-100;else y=@0004;
  $  058.侧向坡度可信度                                                                         $    $           $    $  ANS058.BYTE004  $  if(X1==0) y=@0005;else if(X1==1) y=@0016;else y=@0004;
  $  059.驾驶员自定义模式-设置EMS(发动机管理系统)&TCU(自动变速箱控制器)&ESP(电控稳定系统)       $    $           $    $  ANS059.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@00de;else if(X1==2) y=@0087;else if(X1==3) y=@00e0;else if(X1==4) y=@00e1;else if(X1==5) y=@00eb;else y=@0004;
  $  060.驾驶员自定义模式-设置EPS(电动助力转向系统)                                             $    $           $    $  ANS060.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@0087;else if(X1==2) y=@00df;else y=@0004;
  $  061.驾驶员自定义模式-设置空气悬架控制器                                                    $    $           $    $  ANS061.BYTE004  $  if(X1==0) y=@00e3;else if(X1==1) y=@00de;else if(X1==2) y=@00df;else if(X1==3) y=@00e0;else if(X1==4) y=@00e1;else if(X1==5) y=@00eb;else y=@0004;
  $  062.驾驶员自定义模式-设置TOD(智能四驱系统)                                                 $    $           $    $  ANS062.BYTE004  $  if(X1==0) y=@045f;else if(X1==1) y=@0460;else if(X1==2) y=@00e3;else y=@0004;
  $  063.驾驶模式控制开关旋钮                                                                   $    $           $    $  ANS063.BYTE004  $  if(X1<=62) Y=X1-31;else y=@0004;
  $  064.组合仪表背光亮度                                                                       $    $  %        $    $  ANS064.BYTE004  $  if(X1<=100) Y=X1;else y=@0004;
  $  065.智能路况识别模式监测到的当前模式                                                       $    $           $    $  ANS065.BYTE004  $  if(X1==0) y=@0456;else if(X1==1) y=@00de;else if(X1==2) y=@00df;else if(X1==3) y=@0087;else if(X1==4) y=@00e0;else if(X1==5) y=@00e1;else if(X1==6) y=@045e;else if(X1==7) y=@00eb;else if(X1==8) y=@00e2;else y=@0004;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7A6 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
