
    车型ID：6b27

    模拟：协议模拟-->6b27

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:722 02 10 01 00 00 00 00 00       $~  ANS000:72A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:722 02 3E 00 00 00 00 00 00       $!  ANS000:72A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:722 03 19 02 09 00 00 00 00       $#  ANS000:72A 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:722 04 14 FF FF FF 00 00 00       $$  ANS000:72A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:722 03 22 F1 80 00 00 00 00       $%  ANS000:72A 03 22 F1 80 00 00 00 00
  $%  REQ001:722 03 22 F1 81 00 00 00 00       $%  ANS001:72A 03 22 F1 81 00 00 00 00
  $%  REQ002:722 03 22 F1 83 00 00 00 00       $%  ANS002:72A 03 22 F1 83 00 00 00 00
  $%  REQ003:722 03 22 F1 87 00 00 00 00       $%  ANS003:72A 03 22 F1 87 00 00 00 00
  $%  REQ004:722 03 22 F1 89 00 00 00 00       $%  ANS004:72A 03 22 F1 89 00 00 00 00
  $%  REQ005:722 03 22 F1 8C 00 00 00 00       $%  ANS005:72A 03 22 F1 8C 00 00 00 00
  $%  REQ006:722 03 22 F1 90 00 00 00 00       $%  ANS006:72A 03 22 F1 90 00 00 00 00
  $%  REQ007:722 03 22 F1 91 00 00 00 00       $%  ANS007:72A 03 22 F1 91 00 00 00 00
  $%  REQ008:722 03 22 F1 93 00 00 00 00       $%  ANS008:72A 03 22 F1 93 00 00 00 00
  $%  REQ009:722 03 22 F1 95 00 00 00 00       $%  ANS009:72A 03 22 F1 95 00 00 00 00
  $%  REQ010:722 03 22 F1 98 00 00 00 00       $%  ANS010:72A 03 22 F1 98 00 00 00 00
  $%  REQ011:722 03 22 F1 99 00 00 00 00       $%  ANS011:72A 03 22 F1 99 00 00 00 00
  $%  REQ012:722 03 22 F1 9C 00 00 00 00       $%  ANS012:72A 03 22 F1 9C 00 00 00 00
  $%  REQ013:722 03 22 F1 9D 00 00 00 00       $%  ANS013:72A 03 22 F1 9D 00 00 00 00
  $%  REQ014:722 03 22 F1 A1 00 00 00 00       $%  ANS014:72A 03 22 F1 A1 00 00 00 00

  $%  000:ECU启动软件版本号:              $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  001:ECU应用软件版本号:              $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:供应商ECU启动软件版本号:        $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  003:OEM（原厂设备）零件号:          $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  004:ECU软件版本编号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  005:ECU序列号:                      $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  006:VIN（车辆识别码）:              $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  007:ECU硬件版本编号:                $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  008:硬件版本编号:                   $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:软件版本编号:                   $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:诊断仪序列号:                   $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:编程日期:                       $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  012:标定软件版本号:                 $%    $%  ANS012.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  013:ECU安装日期:                    $%    $%  ANS013.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  014:系统配置1:                      $%    $%  ANS014.BYTE004  $%  Y=HEX(X1,X2);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:722 03 22 2A 00 00 00 00 00       $  ANS000:72A 03 22 2A 00 00 00 00 00
  $  REQ001:722 03 22 2A 01 00 00 00 00       $  ANS001:72A 03 22 2A 01 00 00 00 00
  $  REQ002:722 03 22 2A 02 00 00 00 00       $  ANS002:72A 03 22 2A 02 00 00 00 00
  $  REQ003:722 03 22 2A 03 00 00 00 00       $  ANS003:72A 03 22 2A 03 00 00 00 00
  $  REQ004:722 03 22 2A 04 00 00 00 00       $  ANS004:72A 03 22 2A 04 00 00 00 00
  $  REQ005:722 03 22 2A 05 00 00 00 00       $  ANS005:72A 03 22 2A 05 00 00 00 00
  $  REQ006:722 03 22 2A 06 00 00 00 00       $  ANS006:72A 03 22 2A 06 00 00 00 00
  $  REQ007:722 03 22 2A 07 00 00 00 00       $  ANS007:72A 03 22 2A 07 00 00 00 00
  $  REQ008:722 03 22 2A 08 00 00 00 00       $  ANS008:72A 03 22 2A 08 00 00 00 00
  $  REQ009:722 03 22 2A 09 00 00 00 00       $  ANS009:72A 03 22 2A 09 00 00 00 00
  $  REQ010:722 03 22 2A 0A 00 00 00 00       $  ANS010:72A 03 22 2A 0A 00 00 00 00
  $  REQ011:722 03 22 2A 0B 00 00 00 00       $  ANS011:72A 03 22 2A 0B 00 00 00 00
  $  REQ012:722 03 22 2A 0C 00 00 00 00       $  ANS012:72A 03 22 2A 0C 00 00 00 00
  $  REQ013:722 03 22 2A 0D 00 00 00 00       $  ANS013:72A 03 22 2A 0D 00 00 00 00
  $  REQ014:722 03 22 2A 0E 00 00 00 00       $  ANS014:72A 03 22 2A 0E 00 00 00 00
  $  REQ015:722 03 22 2A 0F 00 00 00 00       $  ANS015:72A 03 22 2A 0F 00 00 00 00
  $  REQ016:722 03 22 2A 10 00 00 00 00       $  ANS016:72A 03 22 2A 10 00 00 00 00
  $  REQ017:722 03 22 2A 11 00 00 00 00       $  ANS017:72A 03 22 2A 11 00 00 00 00
  $  REQ018:722 03 22 2A 12 00 00 00 00       $  ANS018:72A 03 22 2A 12 00 00 00 00
  $  REQ019:722 03 22 2A 13 00 00 00 00       $  ANS019:72A 03 22 2A 13 00 00 00 00
  $  REQ020:722 03 22 2A 14 00 00 00 00       $  ANS020:72A 03 22 2A 14 00 00 00 00
  $  REQ021:722 03 22 2A 15 00 00 00 00       $  ANS021:72A 03 22 2A 15 00 00 00 00
  $  REQ022:722 03 22 2A 16 00 00 00 00       $  ANS022:72A 03 22 2A 16 00 00 00 00

  $  000.摄像头距左车轮距离                                                                                $    $  m         $    $  ANS000.BYTE004  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else y=@0004;
  $  001.摄像头距右车轮距离                                                                                $    $  m         $    $  ANS000.BYTE006  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else y=@0004;
  $  002.摄像头距目标板距离                                                                                $    $  m         $    $  ANS000.BYTE008  $  if((X1*256+X2)<=10000) Y=(X1*256+X2)*0.001;else y=@0004;
  $  003.摄像头安装高度                                                                                    $    $  m         $    $  ANS000.BYTE010  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01;else y=@0004;
  $  004.目标板中心距地面高度_左侧                                                                         $    $  m         $    $  ANS000.BYTE012  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else y=@0004;
  $  005.目标板中心距地面高度_右侧                                                                         $    $  m         $    $  ANS000.BYTE014  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else y=@0004;
  $  006.左目标板中轴线距车辆中轴线距离                                                                    $    $  m         $    $  ANS000.BYTE016  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else y=@0004;
  $  007.右目标板中轴线距车辆中轴线距离                                                                    $    $  m         $    $  ANS000.BYTE018  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else y=@0004;
  $  008.目标板方格尺寸                                                                                    $    $  m         $    $  ANS000.BYTE020  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.001;else y=@0004;
  $  009.黑白格排列方式                                                                                    $    $  Pixel     $    $  ANS000.BYTE022  $  if(X1==1) y=@012c;else if(X1==3) y=@0324;else y=@0004;
  $  010.摄像头焦距                                                                                        $    $  Pixel     $    $  ANS000.BYTE023  $  if((X1*256+X2)<=1000) Y=(X1*256+X2);else y=@0004;
  $  011.目标板左下角方块颜色_右侧                                                                         $    $  Pixel     $    $  ANS000.BYTE025  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  012.目标板左下角方块颜色_左侧                                                                         $    $  Pixel     $    $  ANS000.BYTE026  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  013.目标板数量                                                                                        $    $  Pixel     $    $  ANS000.BYTE027  $  if(X1==1) Y=@0095;else if(X1==2) Y=@0096;else y=@0004;
  $  014.最大俯仰方向标定值                                                                                $    $  rad       $    $  ANS000.BYTE028  $  if(X1<=62) Y=X1*1;else y=@0004;
  $  015.最大横摆方向标定值                                                                                $    $  rad       $    $  ANS000.BYTE029  $  if(X1<=47) Y=X1*1;else y=@0004;
  $  016.最小俯仰方向标定值                                                                                $    $  rad       $    $  ANS000.BYTE030  $  if(X1<=40) Y=X1*1-40;else y=@0004;
  $  017.最小横摆方向标定值                                                                                $    $  rad       $    $  ANS000.BYTE031  $  if(X1<=47) Y=X1*1-47;else y=@0004;
  $  018.最大侧倾角                                                                                        $    $  rad       $    $  ANS000.BYTE032  $  if(X1<=55) Y=X1*0.001;else y=@0004;
  $  019.底部有效图像坐标值                                                                                $    $  Pixel     $    $  ANS000.BYTE033  $  if(X1<=120) Y=X1-120;else y=@0004;
  $  020.顶部有效图像坐标值                                                                                $    $  Pixel     $    $  ANS000.BYTE034  $  if(X1<=120) Y=X1*1;else y=@0004;
  $  021.摄像头到车辆前端的距离                                                                            $    $  m         $    $  ANS000.BYTE035  $  Y=X1*0.01;
  $  022.摄像头到车辆中轴线的距离                                                                          $    $  m         $    $  ANS000.BYTE036  $  Y=X1*0.01-1.28;
  $  023.图像处理器温度                                                                                    $    $  degC      $    $  ANS001.BYTE004  $  if((X1*256+X2)<=155) Y=(X1*256+X2)*1-40;else y=@0004;
  $  024.标定时间_年                                                                                       $    $            $    $  ANS002.BYTE004  $  Y=X1*1+2000;
  $  025.标定时间_月                                                                                       $    $            $    $  ANS002.BYTE005  $  if(X1<=12) Y=X1*1;else y=@0004;
  $  026.标定时间_日                                                                                       $    $            $    $  ANS002.BYTE006  $  if(X1<=31) Y=X1*1;else y=@0004;
  $  027.标定时间_时                                                                                       $    $            $    $  ANS002.BYTE007  $  if(X1<=23) Y=X1*1;else y=@0004;
  $  028.标定时间_分                                                                                       $    $            $    $  ANS002.BYTE008  $  if(X1<=59) Y=X1*1;else y=@0004;
  $  029.标定时间_秒                                                                                       $    $            $    $  ANS002.BYTE009  $  if(X1<=59) Y=X1*1;else y=@0004;
  $  030.标定_里程                                                                                         $    $  km        $    $  ANS002.BYTE010  $  Y=(X1*16777216+X2*65536+X3*256+X4)*1;
  $  031.摄像头视野遮挡原因_雾斑                                                                           $    $            $    $  ANS003.BYTE005  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  032.摄像头视野遮挡原因_挡风玻璃结冰                                                                   $    $            $    $  ANS003.BYTE005  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  033.摄像头视野遮挡原因_完全堵塞                                                                       $    $            $    $  ANS003.BYTE005  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  034.摄像头视野遮挡原因_部分堵塞                                                                       $    $            $    $  ANS003.BYTE005  $  if(((X1>>3)&1)) Y=@044c;else Y=@0115;
  $  035.摄像头视野遮挡原因_抹点                                                                           $    $            $    $  ANS003.BYTE005  $  if(((X1>>4)&1)) Y=@044c;else Y=@0115;
  $  036.摄像头视野遮挡原因_斜阳                                                                           $    $            $    $  ANS003.BYTE005  $  if(((X1>>5)&1)) Y=@044c;else Y=@0115;
  $  037.摄像头视野遮挡原因_模糊图像                                                                       $    $            $    $  ANS003.BYTE005  $  if(((X1>>6)&1)) Y=@044c;else Y=@0115;
  $  038.摄像头视野遮挡原因_道路喷洒                                                                       $    $            $    $  ANS003.BYTE005  $  if(((X1>>7)&1)) Y=@044c;else Y=@0115;
  $  039.摄像头视野遮挡原因_太阳光线                                                                       $    $            $    $  ANS003.BYTE004  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  040.摄像头视野遮挡原因_自眩光                                                                         $    $            $    $  ANS003.BYTE004  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  041.标定失败原因_未标定                                                                               $    $            $    $  ANS004.BYTE004  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  042.标定失败原因_应用致命错误                                                                         $    $            $    $  ANS004.BYTE004  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  043.标定失败原因_自动修复超出范围                                                                     $    $            $    $  ANS004.BYTE004  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  044.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 5V 过压                                   $    $            $    $  ANS005.BYTE011  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  045.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 5V 欠压                                   $    $            $    $  ANS005.BYTE011  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  046.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 3.3V 过压                                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  047.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 3.3V 欠压                                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>3)&1)) Y=@044c;else Y=@0115;
  $  048.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 1.8V 过压                                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>4)&1)) Y=@044c;else Y=@0115;
  $  049.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 1.8V 欠压                                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>5)&1)) Y=@044c;else Y=@0115;
  $  050.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 1.2V 过压                                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>6)&1)) Y=@044c;else Y=@0115;
  $  051.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 1.2V 欠压                                 $    $            $    $  ANS005.BYTE011  $  if(((X1>>7)&1)) Y=@044c;else Y=@0115;
  $  052.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 2.8V 过压                                 $    $            $    $  ANS005.BYTE010  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  053.IFC(智能前视控制模块)内部故障原因_IFC(智能前视控制模块) 2.8V 欠压                                 $    $            $    $  ANS005.BYTE010  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  054.IFC(智能前视控制模块)内部故障原因_MCU(驱动电机控制单元) PLL 失败                                  $    $            $    $  ANS005.BYTE010  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  055.IFC(智能前视控制模块)内部故障原因_MCU(驱动电机控制单元)异常复位                                   $    $            $    $  ANS005.BYTE010  $  if(((X1>>3)&1)) Y=@044c;else Y=@0115;
  $  056.IFC(智能前视控制模块)内部故障原因_MCU(驱动电机控制单元)闪存校验和故障                             $    $            $    $  ANS005.BYTE010  $  if(((X1>>4)&1)) Y=@044c;else Y=@0115;
  $  057.IFC(智能前视控制模块)内部故障原因_MCU(驱动电机控制单元) RAM（随机存储器）测试失败                 $    $            $    $  ANS005.BYTE010  $  if(((X1>>5)&1)) Y=@044c;else Y=@0115;
  $  058.IFC(智能前视控制模块)内部故障原因_MCU(驱动电机控制单元) EEPROM （电可擦只读存储器）测试失败       $    $            $    $  ANS005.BYTE010  $  if(((X1>>6)&1)) Y=@044c;else Y=@0115;
  $  059.IFC(智能前视控制模块)内部故障原因_无图像处理单元SPI通讯                                           $    $            $    $  ANS005.BYTE010  $  if(((X1>>7)&1)) Y=@044c;else Y=@0115;
  $  060.IFC(智能前视控制模块)内部故障原因_EyeQ核心转储                                                    $    $            $    $  ANS005.BYTE009  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  061.IFC(智能前视控制模块)内部故障原因_EyeQ启动失败                                                    $    $            $    $  ANS005.BYTE009  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  062.IFC(智能前视控制模块)内部故障原因_致命故障                                                        $    $            $    $  ANS005.BYTE009  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  063.IFC(智能前视控制模块)内部故障原因_诊断-连续输入信号故障                                           $    $            $    $  ANS005.BYTE009  $  if(((X1>>3)&1)) Y=@044c;else Y=@0115;
  $  064.IFC(智能前视控制模块)内部故障原因_图像丢失                                                        $    $            $    $  ANS005.BYTE009  $  if(((X1>>4)&1)) Y=@044c;else Y=@0115;
  $  065.IFC(智能前视控制模块)内部故障原因_DDR CRC 故障                                                    $    $            $    $  ANS005.BYTE009  $  if(((X1>>5)&1)) Y=@044c;else Y=@0115;
  $  066.IFC(智能前视控制模块)内部故障原因_AEB双检查故障                                                   $    $            $    $  ANS005.BYTE009  $  if(((X1>>6)&1)) Y=@044c;else Y=@0115;
  $  067.IFC(智能前视控制模块)内部故障原因_内部CRC故障                                                     $    $            $    $  ANS005.BYTE009  $  if(((X1>>7)&1)) Y=@044c;else Y=@0115;
  $  068.IFC(智能前视控制模块)内部故障原因_内部信号损坏                                                    $    $            $    $  ANS005.BYTE008  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  069.IFC(智能前视控制模块)内部故障原因_询问响应故障                                                    $    $            $    $  ANS005.BYTE008  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  070.IFC(智能前视控制模块)内部故障原因_旧ego数据                                                       $    $            $    $  ANS005.BYTE008  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  071.IFC(智能前视控制模块)内部故障原因_内部图像保护故障                                                $    $            $    $  ANS005.BYTE008  $  if(((X1>>3)&1)) Y=@044c;else Y=@0115;
  $  072.IFC(智能前视控制模块)内部故障原因_校准不良                                                        $    $            $    $  ANS005.BYTE008  $  if(((X1>>4)&1)) Y=@044c;else Y=@0115;
  $  073.IFC(智能前视控制模块)内部故障原因_图像索引无效                                                    $    $            $    $  ANS005.BYTE008  $  if(((X1>>5)&1)) Y=@044c;else Y=@0115;
  $  074.IFC(智能前视控制模块)内部故障原因_MCU(驱动电机控制单元) RFC 故障                                  $    $            $    $  ANS005.BYTE008  $  if(((X1>>6)&1)) Y=@044c;else Y=@0115;
  $  075.IFC(智能前视控制模块)内部故障原因_MCU(驱动电机控制单元) CRC 故障                                  $    $            $    $  ANS005.BYTE008  $  if(((X1>>7)&1)) Y=@044c;else Y=@0115;
  $  076.IFC(智能前视控制模块)内部故障原因_询问响应重复                                                    $    $            $    $  ANS005.BYTE007  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  077.IFC(智能前视控制模块)内部故障原因_EyeQ CRC 故障                                                   $    $            $    $  ANS005.BYTE007  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  078.IFC(智能前视控制模块)内部故障原因_EyeQ RFC 故障                                                   $    $            $    $  ANS005.BYTE007  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  079.芯片跟踪号                                                                                        $    $            $    $  ANS006.BYTE004  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $  080.电瓶电压                                                                                          $    $  V         $    $  ANS007.BYTE004  $  Y=X1*0.1;
  $  081.里程读数                                                                                          $    $  km        $    $  ANS008.BYTE004  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;
  $  082.车速                                                                                              $    $  km/h      $    $  ANS009.BYTE004  $  Y=(X1*256+X2)*0.01;
  $  083.发动机转速                                                                                        $    $  rpm       $    $  ANS010.BYTE004  $  if((X1*256+X2)<=65535) Y=(X1*256+X2)*0.25;
  $  084.发动机转速有效标志位                                                                              $    $            $    $  ANS011.BYTE004  $  if(X1==0) y=@0013;else if(X1==1) y=@03ec;else y=@0004;
  $  085.图像处理单元运行状态                                                                              $    $            $    $  ANS012.BYTE004  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  086.区分EMS(发动机管理系统)报文丢失快照                                                               $    $            $    $  ANS013.BYTE004  $  strcat:if(((X1>>0)&1)) Y=@04de;if(((X1>>1)&1)) Y=@04df;if((x1&0x03)==0) Y=@0107;
  $  087.EOL（下线测试）标定状态                                                                           $    $            $    $  ANS014.BYTE004  $  if(((X1>>0)&1)) Y=@0003;else Y=@0002;
  $  088.服务点标定状态                                                                                    $    $            $    $  ANS014.BYTE004  $  if(((X1>>1)&1)) Y=@0003;else Y=@0002;
  $  089.标靶自动标定错误原因                                                                              $    $            $    $  ANS014.BYTE005  $  if(X1==0) Y=@0131;else if(X1==0x01) Y=@0132;else if(X1==0x02) Y=@04ca;else if(X1==0x03) Y=@04cb;else if(X1==0x04) Y=@04cc;else if(X1==0x05) Y=@0136;else if(X1==0x06) Y=@04cd;else if(X1==0x07) Y=@04ce;else if(X1==0x08) Y=@04cf;else if(X1==0x09) Y=@04d0;else if(X1==0x0A) Y=@04d1;else if(X1==0x0B) Y=@013c;else if(X1==0x0C) Y=@013d;else if(X1==0x0D) Y=@04d2;else if(X1==0x0E) Y=@04d3;else if(X1==0x0F) Y=@04d4;else if(X1==0x10) Y=@04d5;else if(X1==0x11) Y=@04d6;else if(X1==0x12) Y=@04d7;else if(X1==0x13) Y=@04d8;else if(X1==0x14) Y=@04d9;else if(X1==0x15) Y=@04da;else if(X1==0x18) Y=@0147;else if(X1==0x21) Y=@04db;else if(X1==0x60) Y=@04dc;else if(X1==0x61) Y=@04dd;else Y=@0107;
  $  090.摄像头已标定的偏航值                                                                              $    $            $    $  ANS014.BYTE006  $  Y=(X1*256+X2)*1-188;
  $  091.摄像头已标定的水平值                                                                              $    $            $    $  ANS014.BYTE008  $  Y=(X1*256+X2)-160;
  $  092.摄像头已标定的横摆角                                                                              $    $            $    $  ANS014.BYTE010  $  Y=(X1*256+X2)*0.055-0.001;
  $  093.摄像头自动修正偏航值                                                                              $    $            $    $  ANS014.BYTE012  $  Y=X1-40;
  $  094.摄像头自动修正水平值                                                                              $    $            $    $  ANS014.BYTE013  $  Y=X1-40;
  $  095.SPC_状态                                                                                          $    $            $    $  ANS015.BYTE004  $  if(X1==0) y=@0131;else if(X1==1) y=@04c1;else if(X1==2) y=@04c2;else if(X1==3) y=@04c3;else if(X1==4) y=@04c4;else if(X1==5) y=@04c5;else if(X1==6) y=@04c6;else if(X1==7) y=@04c7;else if(X1==8) y=@04c8;else if(X1==9) y=@04c9;else y=@0131;
  $  096.SPC_进度                                                                                          $    $  %         $    $  ANS015.BYTE005  $  if(X1<=100) Y=X1*1;else y=@0004;
  $  097.摄像头信息_tac2_Z                                                                                 $    $  m         $    $  ANS016.BYTE004  $  if((X1*256+X2)<=10000) Y=(X1*256+X2)*0.001;else y=@0004;
  $  098.目标信息_tac2_高度_左侧                                                                           $    $  m         $    $  ANS016.BYTE006  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else y=@0004;
  $  099.目标信息_tac2_高度_右侧                                                                           $    $  m         $    $  ANS016.BYTE008  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.01;else y=@0004;
  $  100.目标信息_横向_距离_左侧                                                                           $    $  m         $    $  ANS016.BYTE010  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else y=@0004;
  $  101.目标信息_横向_距离_右侧                                                                           $    $  m         $    $  ANS016.BYTE012  $  if((X1*256+X2)<=1000) Y=(X1*256+X2)*0.01-5;else y=@0004;
  $  102.tac2_方块大小                                                                                     $    $  m         $    $  ANS016.BYTE014  $  if((X1*256+X2)<=500) Y=(X1*256+X2)*0.001;else y=@0004;
  $  103.目标信息_左下直角_右侧                                                                            $    $            $    $  ANS016.BYTE016  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  104.目标信息_左下直角_左侧                                                                            $    $            $    $  ANS016.BYTE017  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  105.ECU(电子控制器)制造日期                                                                           $    $            $    $  ANS017.BYTE004  $  Y=HEX(X1,X2,X3);
  $  106.ECU(电子控制器)序列号                                                                             $    $            $    $  ANS018.BYTE004  $  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  107.图像处理单元故障原因                                                                              $    $            $    $  ANS019.BYTE004  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9);
  $  108.MCU(驱动电机控制单元)应用版本不兼容图像处理单元(MEST)                                             $    $            $    $  ANS020.BYTE004  $  if(((X1>>0)&1)) Y=@044c;else Y=@0115;
  $  109.图像处理单元等文件不兼容MCU(驱动电机控制单元)标定文件                                             $    $            $    $  ANS020.BYTE004  $  if(((X1>>1)&1)) Y=@044c;else Y=@0115;
  $  110.MCU(驱动电机控制单元)应用版本不兼容标定数据                                                       $    $            $    $  ANS020.BYTE004  $  if(((X1>>2)&1)) Y=@044c;else Y=@0115;
  $  111.ECU(电子控制器)软件不兼容车辆平台                                                                 $    $            $    $  ANS020.BYTE004  $  if(((X1>>3)&1)) Y=@044c;else Y=@0115;
  $  112.EOL标定最小偏航角                                                                                 $    $            $    $  ANS021.BYTE004  $  if(X1<=47) Y=X1*1-47;else y=@0004;
  $  113.EOL标定最大偏航角                                                                                 $    $            $    $  ANS021.BYTE005  $  if(X1<=94) Y=X1*1-47;else y=@0004;
  $  114.EOL标定最小水平角                                                                                 $    $            $    $  ANS021.BYTE006  $  if(X1<=40) Y=X1*1-40;else y=@0004;
  $  115.EOL标定最大水平角                                                                                 $    $            $    $  ANS021.BYTE007  $  if(X1<=102) Y=X1*1-40;else y=@0004;
  $  116.EOL标定最大侧倾角                                                                                 $    $  rad       $    $  ANS021.BYTE008  $  if(X1<=110) Y=X1*0.0011-0.055;else y=@0004;
  $  117.摄像头距离前缓冲器的距离.                                                                         $    $  m         $    $  ANS021.BYTE009  $  Y=X1*0.01;
  $  118.摄像头距离汽车中间的距离（横向距离）                                                              $    $  m         $    $  ANS021.BYTE010  $  Y=X1*0.01-1.28;
  $  119.区分ESP(APB)报文丢失快照                                                                          $    $            $    $  ANS022.BYTE004  $  strcat:if(((X1>>0)&1)) y=@04e0;if(((X1>>1)&1)) y=@04e1;if(((X1>>2)&1)) y=@04e2;if((x1&0x07)==0) y=@000d;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:722 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
