
    车型ID：6b2a

    模拟：协议模拟-->6b2a

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:755 02 10 01 00 00 00 00 00       $~  ANS000:75D 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:755 02 3E 00 00 00 00 00 00       $!  ANS000:75D 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:755 03 19 02 09 00 00 00 00       $#  ANS000:75D 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:755 04 14 FF FF FF 00 00 00       $$  ANS000:75D 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:755 03 22 F1 87 00 00 00 00       $%  ANS000:75D 03 22 F1 87 00 00 00 00
  $%  REQ001:755 03 22 F1 89 00 00 00 00       $%  ANS001:75D 03 22 F1 89 00 00 00 00
  $%  REQ002:755 03 22 F1 90 00 00 00 00       $%  ANS002:75D 03 22 F1 90 00 00 00 00
  $%  REQ003:755 03 22 F1 91 00 00 00 00       $%  ANS003:75D 03 22 F1 91 00 00 00 00
  $%  REQ004:755 03 22 F1 93 00 00 00 00       $%  ANS004:75D 03 22 F1 93 00 00 00 00
  $%  REQ005:755 03 22 F1 95 00 00 00 00       $%  ANS005:75D 03 22 F1 95 00 00 00 00
  $%  REQ006:755 03 22 F1 98 00 00 00 00       $%  ANS006:75D 03 22 F1 98 00 00 00 00
  $%  REQ007:755 03 22 F1 99 00 00 00 00       $%  ANS007:75D 03 22 F1 99 00 00 00 00
  $%  REQ008:755 03 22 F1 9D 00 00 00 00       $%  ANS008:75D 03 22 F1 9D 00 00 00 00
  $%  REQ009:755 03 22 F1 A1 00 00 00 00       $%  ANS009:75D 03 22 F1 A1 00 00 00 00

  $%  000:零件号:                             $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  001:ECU软件版本编号:                    $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:VIN（车辆识别码）:                  $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  003:ECU硬件版本编号:                    $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  004:供应商ECU硬件版本号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:供应商ECU软件版本号:                $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:维修车间码和/或测试仪序列号:        $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  007:编程日期:                           $%    $%  ANS007.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  008:ECU安装日期:                        $%    $%  ANS008.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  009:配置信息:                           $%    $%  ANS009.BYTE004  $%  Y=HEX(X1,X2);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:755 03 22 3D 00 00 00 00 00       $  ANS000:75D 03 22 3D 00 00 00 00 00
  $  REQ001:755 03 22 3D 01 00 00 00 00       $  ANS001:75D 03 22 3D 01 00 00 00 00
  $  REQ002:755 03 22 3D 02 00 00 00 00       $  ANS002:75D 03 22 3D 02 00 00 00 00
  $  REQ003:755 03 22 3D 03 00 00 00 00       $  ANS003:75D 03 22 3D 03 00 00 00 00
  $  REQ004:755 03 22 3D 04 00 00 00 00       $  ANS004:75D 03 22 3D 04 00 00 00 00
  $  REQ005:755 03 22 3D 05 00 00 00 00       $  ANS005:75D 03 22 3D 05 00 00 00 00
  $  REQ006:755 03 22 3D 06 00 00 00 00       $  ANS006:75D 03 22 3D 06 00 00 00 00
  $  REQ007:755 03 22 3D 07 00 00 00 00       $  ANS007:75D 03 22 3D 07 00 00 00 00
  $  REQ008:755 03 22 3D 08 00 00 00 00       $  ANS008:75D 03 22 3D 08 00 00 00 00
  $  REQ009:755 03 22 3D 09 00 00 00 00       $  ANS009:75D 03 22 3D 09 00 00 00 00
  $  REQ010:755 03 22 3D 0B 00 00 00 00       $  ANS010:75D 03 22 3D 0B 00 00 00 00
  $  REQ011:755 03 22 3D 1D 00 00 00 00       $  ANS011:75D 03 22 3D 1D 00 00 00 00
  $  REQ012:755 03 22 3D 1E 00 00 00 00       $  ANS012:75D 03 22 3D 1E 00 00 00 00
  $  REQ013:755 03 22 3D 1F 00 00 00 00       $  ANS013:75D 03 22 3D 1F 00 00 00 00

  $  000.乘客车门打开-关闭状态                                                     $    $                 $    $  ANS000.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  001.乘客车窗状态                                                              $    $                 $    $  ANS001.BYTE004  $  if(X1==0) y=@02fe;else if(X1==1) y=@02ff;else if(X1==2) y=@0300;else if(X1==3) y=@0301;else if(X1==4) y=@0302;else if(X1==5) y=@0303;else if(X1==6) y=@0304;else if(X1==7) y=@0004;else y=@0004;
  $  002.乘客后视镜转向灯状态                                                      $    $                 $    $  ANS002.BYTE004  $  if(X1==0) y=@0457;else if(X1==1) y=@02bb;else y=@0004;
  $  003.乘客后视镜折叠状态                                                        $    $                 $    $  ANS003.BYTE004  $  if(X1==0) y=@011f;else if(X1==1) y=@0120;else y=@0004;
  $  004.乘客后视镜调节状态                                                        $    $                 $    $  ANS004.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@02fc;else if(X1==2) y=@02fd;else y=@0004;
  $  005.乘客后视镜加热状态                                                        $    $                 $    $  ANS005.BYTE004  $  if(X1==0) y=@01f3;else if(X1==1) y=@01f4;else y=@0004;
  $  006.乘客车门锁止状态                                                          $    $                 $    $  ANS006.BYTE004  $  if(X1==0) y=@0030;else if(X1==1) y=@004b;else y=@0004;
  $  007.乘客车门灯&乘客迎宾灯输出状态                                             $    $                 $    $  ANS007.BYTE004  $  if(X1==0) y=@0457;else if(X1==1) y=@02bb;else y=@0004;
  $  008.乘客车窗本地开关状态                                                      $    $                 $    $  ANS008.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0192;else if(X1==2) y=@0193;else if(X1==3) y=@0459;else if(X1==4) y=@045a;else y=@0004;
  $  009.倒车时右后视镜镜片下降”功能状态                                          $    $                 $    $  ANS009.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0094;else y=@0004;
  $  010.存储的记忆位置个数                                                        $    $                 $    $  ANS010.BYTE004  $  if(X1==0) Y=@0107;else if(X1==1) Y=@0095;else if(X1==2) Y=@0096;else if(X1==3) Y=@0097;else y=@0004;
  $  011.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息1_位置                 $    $  Hall Pulse     $    $  ANS011.BYTE004  $  Y=(X1*256+X2)*1;
  $  012.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息1_马达转速             $    $  rad/s          $    $  ANS011.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  013.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息1_历史速度             $    $  rad/s          $    $  ANS011.BYTE008  $  Y=((X1*256+X2)*1)/4;
  $  014.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息1_加紧力               $    $  N              $    $  ANS011.BYTE010  $  Y=X1*1;
  $  015.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息1_电压                 $    $  V              $    $  ANS011.BYTE011  $  Y=X1*1;
  $  016.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息2_位置                 $    $  Hall Pulse     $    $  ANS012.BYTE004  $  Y=(X1*256+X2)*1;
  $  017.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息2_马达转速             $    $  rad/s          $    $  ANS012.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  018.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息2_位置_速度_基础       $    $  rad/s          $    $  ANS012.BYTE008  $  Y=X1*0.25;
  $  019.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息2_差速                 $    $  rad/s          $    $  ANS012.BYTE009  $  Y=X1*0.25;
  $  020.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息2_位置_差别_故障       $    $  N              $    $  ANS012.BYTE010  $  Y=X1*1;
  $  021.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息3_位置                 $    $  Hall Pulse     $    $  ANS013.BYTE004  $  Y=(X1*256+X2)*1;
  $  022.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息3_马达转速             $    $  rad/s          $    $  ANS013.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  023.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息3_加速力               $    $  N              $    $  ANS013.BYTE008  $  Y=X1*1;
  $  024.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息3_防夹_Thd             $    $  N              $    $  ANS013.BYTE009  $  Y=X1*1;
  $  025.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息3_敏感速度             $    $  N              $    $  ANS013.BYTE010  $  Y=X1*1;
  $  026.PDCU(乘客门控制单元) APA(自动泊车辅助系统) 反馈讯息3_环境温度             $    $  degC           $    $  ANS013.BYTE011  $  Y=X1-40;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:755 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
