
    车型ID：6b2d

    模拟：协议模拟-->6b2d

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:756 02 10 01 00 00 00 00 00       $~  ANS000:75E 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:756 02 3E 00 00 00 00 00 00       $!  ANS000:75E 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:756 03 19 02 09 00 00 00 00       $#  ANS000:75E 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:756 04 14 FF FF FF 00 00 00       $$  ANS000:75E 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:756 03 22 F1 87 00 00 00 00       $%  ANS000:75E 03 22 F1 87 00 00 00 00
  $%  REQ001:756 03 22 F1 89 00 00 00 00       $%  ANS001:75E 03 22 F1 89 00 00 00 00
  $%  REQ002:756 03 22 F1 90 00 00 00 00       $%  ANS002:75E 03 22 F1 90 00 00 00 00
  $%  REQ003:756 03 22 F1 91 00 00 00 00       $%  ANS003:75E 03 22 F1 91 00 00 00 00
  $%  REQ004:756 03 22 F1 93 00 00 00 00       $%  ANS004:75E 03 22 F1 93 00 00 00 00
  $%  REQ005:756 03 22 F1 95 00 00 00 00       $%  ANS005:75E 03 22 F1 95 00 00 00 00
  $%  REQ006:756 03 22 F1 98 00 00 00 00       $%  ANS006:75E 03 22 F1 98 00 00 00 00
  $%  REQ007:756 03 22 F1 99 00 00 00 00       $%  ANS007:75E 03 22 F1 99 00 00 00 00
  $%  REQ008:756 03 22 F1 9D 00 00 00 00       $%  ANS008:75E 03 22 F1 9D 00 00 00 00
  $%  REQ009:756 03 22 F1 A1 00 00 00 00       $%  ANS009:75E 03 22 F1 A1 00 00 00 00

  $%  000:零件号:                             $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  001:ECU软件版本编号:                    $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:VIN（车辆识别码）:                  $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  003:ECU硬件版本编号:                    $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  004:供应商ECU硬件版本号:                $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:供应商ECU软件版本号:                $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:维修车间码和/或测试仪序列号:        $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  007:编程日期:                           $%    $%  ANS007.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  008:ECU安装日期:                        $%    $%  ANS008.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  009:配置信息:                           $%    $%  ANS009.BYTE004  $%  Y=HEX(X1,X2);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:756 03 22 3D 24 00 00 00 00       $  ANS000:75E 03 22 3D 24 00 00 00 00
  $  REQ001:756 03 22 3D 22 00 00 00 00       $  ANS001:75E 03 22 3D 22 00 00 00 00
  $  REQ002:756 03 22 3D 21 00 00 00 00       $  ANS002:75E 03 22 3D 21 00 00 00 00
  $  REQ003:756 03 22 3D 20 00 00 00 00       $  ANS003:75E 03 22 3D 20 00 00 00 00
  $  REQ004:756 03 22 3D 23 00 00 00 00       $  ANS004:75E 03 22 3D 23 00 00 00 00
  $  REQ005:756 03 22 3D 3D 00 00 00 00       $  ANS005:75E 03 22 3D 3D 00 00 00 00
  $  REQ006:756 03 22 3D 3E 00 00 00 00       $  ANS006:75E 03 22 3D 3E 00 00 00 00
  $  REQ007:756 03 22 3D 3F 00 00 00 00       $  ANS007:75E 03 22 3D 3F 00 00 00 00

  $  000.左后车门车窗升降装置开关                                                   $    $                 $    $  ANS000.BYTE004  $  if(X1==0) y=@010e;else if(X1==1) y=@0192;else if(X1==2) y=@0193;else if(X1==3) y=@0459;else if(X1==4) y=@045a;else y=@0004;
  $  001.左后车门锁止状态                                                           $    $                 $    $  ANS001.BYTE004  $  if(X1==0) y=@0030;else if(X1==1) y=@004b;else y=@0004;
  $  002.左后车窗状态                                                               $    $                 $    $  ANS002.BYTE004  $  if(X1==0) y=@02fe;else if(X1==1) y=@02ff;else if(X1==2) y=@0300;else if(X1==3) y=@0301;else if(X1==4) y=@0302;else if(X1==5) y=@0303;else if(X1==6) y=@0304;else if(X1==7) y=@0004;else y=@0004;
  $  003.左后车门打开-关闭状态                                                      $    $                 $    $  ANS003.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;
  $  004.左后车门灯                                                                 $    $                 $    $  ANS004.BYTE004  $  if(X1==0) y=@0457;else if(X1==1) y=@02bb;else y=@0004;
  $  005.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息1_位置                 $    $  Hall Pulse     $    $  ANS005.BYTE004  $  Y=(X1*256+X2)*1;
  $  006.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息1_马达转速             $    $  rad/s          $    $  ANS005.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  007.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息1_历史速度             $    $  rad/s          $    $  ANS005.BYTE008  $  Y=((X1*256+X2)*1)/4;
  $  008.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息1_加紧力               $    $  N              $    $  ANS005.BYTE010  $  Y=X1*1;
  $  009.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息1_电压                 $    $  V              $    $  ANS005.BYTE011  $  Y=X1*1;
  $  010.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息2_位置                 $    $  Hall Pulse     $    $  ANS006.BYTE004  $  Y=(X1*256+X2)*1;
  $  011.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息2_马达转速             $    $  rad/s          $    $  ANS006.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  012.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息2_位置_速度_基础       $    $  rad/s          $    $  ANS006.BYTE008  $  Y=X1*0.25;
  $  013.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息2_差速                 $    $  rad/s          $    $  ANS006.BYTE009  $  Y=X1*0.25;
  $  014.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息2_位置_差别_故障       $    $  N              $    $  ANS006.BYTE010  $  Y=X1*1;
  $  015.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息3_位置                 $    $  Hall Pulse     $    $  ANS007.BYTE004  $  Y=(X1*256+X2)*1;
  $  016.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息3_马达转速             $    $  rad/s          $    $  ANS007.BYTE006  $  Y=((X1*256+X2)*1)/4;
  $  017.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息3_加速力               $    $  N              $    $  ANS007.BYTE008  $  Y=X1*1;
  $  018.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息3_防夹_Thd             $    $  N              $    $  ANS007.BYTE009  $  Y=X1*1;
  $  019.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息3_敏感速度             $    $  N              $    $  ANS007.BYTE010  $  Y=X1*1;
  $  020.RLDCU(左后门控制单元) APA(自动泊车辅助系统) 反馈讯息3_环境温度             $    $  degC           $    $  ANS007.BYTE011  $  Y=X1-40;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:756 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
