
    车型ID：9f62

    模拟：协议模拟-->9f62

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~250K$~181F28F3,180228D0,180328D0,180628D0,1800B4D0,1800D0F3,1804D0F3,181B28F3,181C28F3,C00D0EF,C03D0EF,C04D0EF,1800D028

进入命令:

  $~  REQ000:0       $~  ANS000:181F28F3

空闲命令:


退出命令:



;******************************************************************************************************************************************************

读数据流: 

  $)  00.整车控制器发送信息1
  $  00.整车控制器发送信息1
  $  REQ000:0       $  ANS000:181F28F3

  $  000.整车控制器life       $    $             $    $  ANS000.BYTE0-4  $  y=x;
  $  001.整车工作状态         $    $             $    $  ANS000.BYTE0-3  $  if((x&0x07)==0x00) y=@0074;else if((x&0x07)==0x01) y=@0075;else y=@0076;
  $  002.蓄电池状态           $    $             $    $  ANS000.BYTE0-3  $  if((x&0x20)==0x00) y=@00e8;else y=@00e9;
  $  003.限功率状态           $    $             $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@00e6;else y=@00e7;
  $  004.DC/DC状态            $    $             $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@00e5;else y=@002d;
  $  005.加速踏板开度         $    $  %          $    $  ANS000.BYTE0-2  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  006.制动踏板开度         $    $  %          $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  007.控制转矩             $    $  牛米       $    $  ANS000.BYTE000  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-20000)*0.1;
  $  008.电机温度             $    $  摄氏度     $    $  ANS000.BYTE002  $  y=x-40;
  $  009.水泵                 $    $             $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0015;else y=@0014;
  $  010.低速风扇             $    $             $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0015;else y=@0014;
  $  011.高速风扇             $    $             $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0015;else y=@0014;
  $  012.真空泵               $    $             $    $  ANS000.BYTE003  $  if((x&0x08)==0x00) y=@0015;else y=@0014;
  $  013.空调                 $    $             $    $  ANS000.BYTE003  $  if((x&0x10)==0x00) y=@0015;else y=@0014;
  $  014.手刹                 $    $             $    $  ANS000.BYTE003  $  if((x&0x20)==0x00) y=@00ec;else y=@00ed;
  $  015.脚刹                 $    $             $    $  ANS000.BYTE003  $  if((x&0x40)==0x00) y=@00ea;else y=@00eb;

  $)  01.整车控制器发送信息2
  $  01.整车控制器发送信息2
  $  REQ000:0       $  ANS000:181F28F3

  $  000.整车控制器life       $    $             $    $  ANS000.BYTE0-4  $  y=x;
  $  001.档位信号             $    $             $    $  ANS000.BYTE0-3  $  if((x&0x03)==0x00) y=@009f;else if((x&0x03)==0x01) y=@0057;else if((x&0x03)==0x02) y=@009e;else y=@0056;
  $  002.充电状态             $    $             $    $  ANS000.BYTE0-2  $  if((x&0x03)==0x00) y=@00cd;else if((x&0x03)==0x01) y=@00ef;else if((x&0x03)==0x02) y=@00f0;else y=@00f1;
  $  003.车辆模式             $    $             $    $  ANS000.BYTE0-2  $  if((x&0x1C)==0x00) y=@0070;else if((x&0x1C)==0x04) y=@0071;else if((x&0x1C)==0x08) y=@0072;else if((x&0x1C)==0x0C) y=@0073;else y=@0003;
  $  004.仪表停机指令         $    $             $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0003;else y=@002e;
  $  005.挂档失败             $    $             $    $  ANS000.BYTE000  $  if((x&0x20)==0x00) y=@0017;else y=@012c;
  $  006.电机控制器温度       $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  007.真空度               $    $  巴         $    $  ANS000.BYTE002  $  y=x*0.01;
  $  008.SOC(荷电状态)        $    $  %          $    $  ANS000.BYTE003  $  y=x*0.4;

  $)  02.整车控制器发送信息3
  $  02.整车控制器发送信息3
  $  REQ000:0       $  ANS000:181F28F3

  $  000.VCU唤醒源                  $    $                $    $  ANS000.BYTE0-4  $  if((x&0x0f)==0x00) y=@007a;else if((x&0x0f)==0x01) y=@007b;else if((x&0x0f)==0x02) y=@007c;else if((x&0x0f)==0x03) y=@007d;else if((x&0x0f)==0x04) y=@007e;else if((x&0x0f)==0x05) y=@007f;else y=@0003;
  $  001.剩余里程                   $    $  千米          $    $  ANS000.BYTE0-3  $  y=(x1*256+x2);
  $  002.车速                       $    $  千米/小时     $    $  ANS000.BYTE0-1  $  y=x;
  $  003.整车控制器硬件版本号       $    $                $    $  ANS000.BYTE002  $  y=x;
  $  004.整车控制器软件版本号       $    $                $    $  ANS000.BYTE003  $  y=x;

  $)  03.整车控制器发送信息4
  $  03.整车控制器发送信息4
  $  REQ000:0       $  ANS000:181F28F3

  $  000.整车控制器life                          $    $       $    $  ANS000.BYTE0-4  $  y=x;
  $  001.整车故障等级                            $    $       $    $  ANS000.BYTE0-4  $  if((x&0x03)==0x00) y=@0035;else if((x&0x03)==0x01) y=@0077;else if((x&0x03)==0x02) y=@0078;else y=@0079;
  $  002.电机控制器故障等级                      $    $       $    $  ANS000.BYTE0-4  $  if((x&0x0c)==0x00) y=@0035;else if((x&0x0c)==0x04) y=@0077;else if((x&0x0c)==0x08) y=@0078;else y=@0079;
  $  003.电池管理系统故障等级                    $    $       $    $  ANS000.BYTE0-4  $  if((x&0x30)==0x00) y=@0035;else if((x&0x30)==0x10) y=@0077;else if((x&0x30)==0x20) y=@0078;else y=@0079;
  $  004.整车控制器故障等级                      $    $       $    $  ANS000.BYTE0-4  $  if((x&0xC0)==0x00) y=@0035;else if((x&0xC0)==0x40) y=@0077;else if((x&0xC0)==0x80) y=@0078;else y=@0079;
  $  005.DCDC故障等级                            $    $       $    $  ANS000.BYTE0-4  $  if((x&0x03)==0x00) y=@0035;else if((x&0x03)==0x01) y=@011f;else if((x&0x03)==0x02) y=@0120;else y=@0121;
  $  006.充电机故障等级                          $    $       $    $  ANS000.BYTE0-4  $  if((x&0x0c)==0x00) y=@0035;else if((x&0x0c)==0x04) y=@011f;else if((x&0x0c)==0x08) y=@0120;else y=@0121;
  $  007.助力转向泵故障等级                      $    $       $    $  ANS000.BYTE0-4  $  if((x&0x30)==0x00) y=@0035;else if((x&0x30)==0x10) y=@011f;else if((x&0x30)==0x20) y=@0120;else y=@0121;
  $  008.空调故障等级                            $    $       $    $  ANS000.BYTE0-4  $  if((x&0xc0)==0x00) y=@0035;else if((x&0xc0)==0x40) y=@011f;else if((x&0xc0)==0x80) y=@0120;else y=@0121;
  $  009.加速踏板性能故障                        $    $       $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  010.加速踏板对电源短接                      $    $       $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  011.加速踏板对地短接                        $    $       $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  012.加速踏板开路                            $    $       $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  013.制动踏板性能故障                        $    $       $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  014.制动踏板对电源短接                      $    $       $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  015.制动踏板对地短接                        $    $       $    $  ANS000.BYTE0-1  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  016.制动踏板开路                            $    $       $    $  ANS000.BYTE0-1  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  017.动力电池单体电压过低                    $    $       $    $  ANS000.BYTE000  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  018.电机控制器过温                          $    $       $    $  ANS000.BYTE000  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  019.真空泵故障                              $    $       $    $  ANS000.BYTE000  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  020.蓄电池电压过低(10.9V-11.9V)             $    $       $    $  ANS000.BYTE000  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  021.电机控制器掉线                          $    $       $    $  ANS000.BYTE000  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  022.电池管理系统掉线                        $    $       $    $  ANS000.BYTE000  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  023.SOC较低故障(5%-10%)                     $    $       $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  024.SOC过低故障(小于5%)                     $    $       $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  025.ABS故障                                 $    $       $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  026.EPS故障                                 $    $       $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  027.水泵故障                                $    $       $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  028.蓄电池电压严重过低(小于等于10.8V)       $    $       $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  029.充电机掉线                              $    $       $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  030.助力转向控制器掉线                      $    $       $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  031.DCDC掉线                                $    $       $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  032.SOC报警故障(10%-20%)                    $    $       $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  033.严重超载故障                            $    $       $    $  ANS000.BYTE002  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  034.EBD工作                                 $    $       $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  035.停机指令                                $    $       $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0003;else y=@002e;
  $  036.高压互锁故障                            $    $       $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  037.PAAS工作                                $    $       $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0017;else y=@0053;

  $)  04.动力电池组管理系统发送信息1
  $  04.动力电池组管理系统发送信息1
  $  REQ000:0       $  ANS000:181F28F3

  $  000.动力电池组管理系统life           $    $        $    $  ANS000.BYTE0-4  $  y=x;
  $  001.电池组充放电总电流               $    $  A     $    $  ANS000.BYTE0-3  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-10000)*0.1;
  $  002.电池组总电压                     $    $  V     $    $  ANS000.BYTE0-1  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)*0.1;
  $  003.动力电池组状态                   $    $        $    $  ANS000.BYTE001  $  if((x&0x03)==0x00) y=@014f;else if((x&0x03)==0x01) y=@0150;else if((x&0x03)==0x02) y=@0151;else y=@0003;
  $  004.外接充电允许                     $    $        $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0099;else y=@0144;
  $  005.电池故障等级                     $    $        $    $  ANS000.BYTE001  $  if((x&0x18)==0x00) y=@0035;else if((x&0x18)==0x08) y=@00dc;else if((x&0x18)==0x10) y=@00e3;else y=@00de;
  $  006.绝缘等级                         $    $        $    $  ANS000.BYTE001  $  if((x&0x60)==0x00) y=@0035;else if((x&0x60)==0x20) y=@00dc;else if((x&0x60)==0x40) y=@00e3;else y=@00de;
  $  007.请求允许吸合高压主负接触器       $    $        $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@013f;else y=@0140;
  $  008.SOC(荷电状态)                    $    $  %     $    $  ANS000.BYTE002  $  y=x*0.4;
  $  009.电池组允许使用最低SOC            $    $  %     $    $  ANS000.BYTE003  $  y=x*0.4;

  $)  05.动力电池组管理系统发送信息2
  $  05.动力电池组管理系统发送信息2
  $  REQ000:0       $  ANS000:181F28F3

  $  000.剩余能量             $    $  kwh      $    $  ANS000.BYTE0-4  $  y=(x1*256+x2)*0.1;
  $  001.绝缘电阻             $    $  千欧     $    $  ANS000.BYTE0-2  $  y=(x1*256+x2);
  $  002.电池均衡状态         $    $           $    $  ANS000.BYTE000  $  if((x&0x01)==0x00) y=@0137;else y=@0138;
  $  003.停机状态             $    $           $    $  ANS000.BYTE000  $  if((x&0x02)==0x00) y=@0135;else y=@0136;
  $  004.慢充充电状态         $    $           $    $  ANS000.BYTE000  $  if((x&0x0c)==0x00) y=@00cd;else if((x&0x0c)==0x04) y=@00ce;else if((x&0x0c)==0x08) y=@0085;else y=@00cf;
  $  005.快充充电状态         $    $           $    $  ANS000.BYTE000  $  if((x&0x30)==0x00) y=@00cd;else if((x&0x30)==0x10) y=@00ce;else if((x&0x30)==0x20) y=@0085;else y=@00cf;
  $  006.加热继电器状态       $    $           $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@00d5;else y=@013b;
  $  007.动力电池切断         $    $           $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@0139;else y=@013a;
  $  008.BMS硬件版本号        $    $           $    $  ANS000.BYTE002  $  y=x;
  $  009.BMS软件版本号        $    $           $    $  ANS000.BYTE003  $  y=x;

  $)  06.动力电池组管理系统发送信息3
  $  06.动力电池组管理系统发送信息3
  $  REQ000:0       $  ANS000:181F28F3

  $  000.电池电压均衡故障                 $    $         $    $  ANS000.BYTE0-4  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  001.温度过高故障                     $    $         $    $  ANS000.BYTE0-4  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  002.预充失败                         $    $         $    $  ANS000.BYTE0-4  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  003.切断主负                         $    $         $    $  ANS000.BYTE0-4  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  004.总电流超限                       $    $         $    $  ANS000.BYTE0-4  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  005.平均电压超限                     $    $         $    $  ANS000.BYTE0-4  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  006.单体电池过压                     $    $         $    $  ANS000.BYTE0-4  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  007.单体电池欠压                     $    $         $    $  ANS000.BYTE0-4  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  008.容量低报警                       $    $         $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  009.下位机无响应报警(内部通讯)       $    $         $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  010.绝缘故障                         $    $         $    $  ANS000.BYTE0-3  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  011.电池温度均衡故障                 $    $         $    $  ANS000.BYTE0-3  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  012.SOC跳变故障                      $    $         $    $  ANS000.BYTE0-3  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  013.充电储能系统不匹配故障           $    $         $    $  ANS000.BYTE0-3  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  014.过充报警故障                     $    $         $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  015.SOC过高故障                      $    $         $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  016.实际容量                         $    $  Ah     $    $  ANS000.BYTE000  $  y=x;
  $  017.总电压过压                       $    $         $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  018.总电压欠压                       $    $         $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  019.电池单体一致性差报警             $    $         $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  020.MSD高压互锁故障                  $    $         $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  021.直流输出口高压互锁故障           $    $         $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  022.VCU通讯故障                      $    $         $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  023.充电机通讯故障                   $    $         $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  024.温度过低故障                     $    $         $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  025.充电电流过大故障                 $    $         $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  026.放电电流过大故障                 $    $         $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  027.回馈电流过大故障                 $    $         $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  028.高压主负接触器粘连故障           $    $         $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  029.高压预充接触器粘连故障           $    $         $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  030.高压主正接触器粘连故障           $    $         $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  031.电池包加热继电器粘连故障         $    $         $    $  ANS000.BYTE003  $  if((x&0x08)==0x00) y=@0017;else y=@0053;

  $)  07.动力电池组管理系统发送信息4
  $  07.动力电池组管理系统发送信息4
  $  REQ000:0       $  ANS000:181F28F3

  $  000.最高单体电压       $    $  V          $    $  ANS000.BYTE0-4  $  y=(x1*256+x2)*0.001;
  $  001.最低单体电压       $    $  V          $    $  ANS000.BYTE0-2  $  y=(x1*256+x2)*0.001;
  $  002.最高温度           $    $  摄氏度     $    $  ANS000.BYTE000  $  y=x-40;
  $  003.最低温度           $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;

  $)  08.电机控制器发送信息1
  $  08.电机控制器发送信息1
  $  REQ000:0       $  ANS000:181F28F3

  $  000.预充电状态                   $    $             $    $  ANS000.BYTE0-4  $  if((x&0x01)==0x00) y=@0030;else y=@002f;
  $  001.工作模式                     $    $             $    $  ANS000.BYTE0-4  $  if((x&0x02)==0x00) y=@017a;else y=@017b;
  $  002.正转/反转                    $    $             $    $  ANS000.BYTE0-4  $  if((x&0x04)==0x00) y=@0178;else y=@0179;
  $  003.其他/空转                    $    $             $    $  ANS000.BYTE0-4  $  if((x&0x08)==0x00) y=@0076;else y=@0177;
  $  004.允许关断主接触器             $    $             $    $  ANS000.BYTE0-4  $  if((x&0x10)==0x00) y=@0175;else y=@0176;
  $  005.电机控制器弱电自检完成       $    $             $    $  ANS000.BYTE0-4  $  if((x&0x20)==0x00) y=@0030;else y=@002f;
  $  006.故障状态                     $    $             $    $  ANS000.BYTE0-4  $  if((x&0xC0)==0x00) y=@0035;else if((x&0xC0)==0x40) y=@0077;else if((x&0xC0)==0x80) y=@0078;else y=@0079;
  $  007.MCU的LIFE值                  $    $             $    $  ANS000.BYTE0-3  $  y=x;
  $  008.电机当前转速                 $    $  转/分      $    $  ANS000.BYTE0-2  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2);
  $  009.电机温度                     $    $  摄氏度     $    $  ANS000.BYTE000  $  y=x-40;
  $  010.电机控制器温度               $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  011.电机当前转矩                 $    $  牛米       $    $  ANS000.BYTE002  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-20000)*0.1;

  $)  09.电机控制器发送信息2
  $  09.电机控制器发送信息2
  $  REQ000:0       $  ANS000:181F28F3

  $  000.IGBT保护                     $    $       $    $  ANS000.BYTE0-4  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  001.驱动电源欠压保护             $    $       $    $  ANS000.BYTE0-4  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  002.上下桥直通保护               $    $       $    $  ANS000.BYTE0-4  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  003.IGBT过温保护                 $    $       $    $  ANS000.BYTE0-4  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  004.母线电流过流保护             $    $       $    $  ANS000.BYTE0-4  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  005.相电流过流保护               $    $       $    $  ANS000.BYTE0-4  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  006.控制电压欠压保护             $    $       $    $  ANS000.BYTE0-4  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  007.控制电压防反接保护           $    $       $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  008.控制器电压防过压保护         $    $       $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  009.dq电流过流保护               $    $       $    $  ANS000.BYTE0-3  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  010.母线电压欠压保护             $    $       $    $  ANS000.BYTE0-3  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  011.母线电压过压保护             $    $       $    $  ANS000.BYTE0-3  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  012.过扭矩保护                   $    $       $    $  ANS000.BYTE0-3  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  013.过载保护                     $    $       $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  014.堵转保护                     $    $       $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  015.驱动板过温保护               $    $       $    $  ANS000.BYTE0-2  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  016.电机超速保护                 $    $       $    $  ANS000.BYTE0-2  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  017.CAN通讯故障保护              $    $       $    $  ANS000.BYTE0-2  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  018.整车回路内阻故障             $    $       $    $  ANS000.BYTE0-2  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  019.缺相保护                     $    $       $    $  ANS000.BYTE0-2  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  020.旋变保护                     $    $       $    $  ANS000.BYTE0-2  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  021.硬件关断信号保护             $    $       $    $  ANS000.BYTE0-2  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  022.放电故障                     $    $       $    $  ANS000.BYTE0-2  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  023.霍尔电流故障                 $    $       $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  024.驱动上桥故障                 $    $       $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  025.驱动下桥故障                 $    $       $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  026.KL30电源电压过低             $    $       $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  027.电流检测故障                 $    $       $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  028.主动放电故障                 $    $       $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  029.相间短路故障                 $    $       $    $  ANS000.BYTE0-1  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  030.母线快速欠压故障             $    $       $    $  ANS000.BYTE0-1  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  031.硬件过压故障                 $    $       $    $  ANS000.BYTE000  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  032.驱动芯片初始化失败故障       $    $       $    $  ANS000.BYTE000  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  033.IGBT结温检测故障1            $    $       $    $  ANS000.BYTE000  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  034.IGBT结温检测故障2            $    $       $    $  ANS000.BYTE000  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  035.EEROM故障                    $    $       $    $  ANS000.BYTE000  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  036.电机控制器过热报警           $    $       $    $  ANS000.BYTE000  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  037.电机控制器过热故障           $    $       $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  038.电机过热报警                 $    $       $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  039.电机过热故障                 $    $       $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  040.电机温度传感器掉线故障       $    $       $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  041.操作顺序保护报警             $    $       $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  042.高速停机保护报警             $    $       $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  043.高速误挂挡保护报警           $    $       $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  044.大扭矩停机保护报警           $    $       $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  045.速度偏差过大故障             $    $       $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  046.母线欠压报警                 $    $       $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  047.母线过压报警                 $    $       $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0170;

  $)  10.电机控制器发送信息3
  $  10.电机控制器发送信息3
  $  REQ000:0       $  ANS000:181F28F3

  $  000.电机直流电流               $    $  A        $    $  ANS000.BYTE0-4  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-10000)*0.1;
  $  001.电机功率                   $    $  千瓦     $    $  ANS000.BYTE0-2  $  y=(x1*256+x2)*0.01;
  $  002.电机控制器硬件版本号       $    $           $    $  ANS000.BYTE002  $  y=x;
  $  003.电机控制器软件版本号       $    $           $    $  ANS000.BYTE003  $  y=x;

  $)  11.数字化仪表发送信息1
  $  11.数字化仪表发送信息1
  $  REQ000:0       $  ANS000:181F28F3

  $  000.数字化仪表LIFE       $    $           $    $  ANS000.BYTE0-4  $  y=x;
  $  001.累计里程             $    $  千米     $    $  ANS000.BYTE0-1  $  if((x1*256*256*256+x2*256*256+x3*256+x4) == 0xFFFFFFFF) y=@0018;else if((x1*256*256*256+x2*256*256+x3*256+x4) == 0xFFFFFFFE) y=@0003;else y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.1;

;******************************************************************************************************************************************************

