
    车型ID：9f68

    模拟：协议模拟-->9f68

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~250K$~18FA0727,CF10327,CFF32F3,18FA0627,18FA0527,CFA0427,18FA0027,18FA0127,18FA0327,18FA0427,18FA0227

进入命令:

  $~  REQ000:0       $~  ANS000:18FA0727

空闲命令:


退出命令:



;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:010220002400001c7d02938       $%  ANS000:18FA072710220002400001c7d02938
  $%  REQ001:01022000240000167d02138       $%  ANS001:18FA07271022000240000167d02138

  $%  000:VIN:             $%    $%  ANS000.BYTE001  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:VCU版本号:       $%    $%  ANS001.BYTE004  $%  y=(x1+x2*256+x3*256*256+x4*256*256*256);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.整车控制器的整车状态信息1
  $  00.整车控制器的整车状态信息1
  $  REQ000:010220002400001c7d00138       $  ANS000:18FA072710220002400001c7d00138

  $  000.车速       $    $  km/h     $    $  ANS000.BYTE001  $  y=(x1+x2*256)*1.0/256;

  $)  01.整车控制器的整车状态信息2
  $  01.整车控制器的整车状态信息2
  $  REQ000:010220002400001c7d00938       $  ANS000:18FA072710220002400001c7d00938

  $  000.剩余可行里程                        $    $  km     $    $  ANS000.BYTE001  $  y=(x1+x2*256)*1.0/128;
  $  001.本次已行里程                        $    $  km     $    $  ANS000.BYTE003  $  y=(x1+x2*256)/8;
  $  002.整车运行模式-充电                   $    $         $    $  ANS000.BYTE005  $  if((x&0x01)==0x01) y=@0064;else y=@0065;
  $  003.整车运行模式-前进                   $    $         $    $  ANS000.BYTE005  $  if((x&0x04)==0x04) y=@0064;else y=@0065;
  $  004.整车运行模式-倒车                   $    $         $    $  ANS000.BYTE005  $  if((x&0x08)==0x08) y=@0064;else y=@0065;
  $  005.整车运行模式-空挡                   $    $         $    $  ANS000.BYTE005  $  if((x&0x10)==0x10) y=@0064;else y=@0065;
  $  006.整车运行模式-驻车                   $    $         $    $  ANS000.BYTE005  $  if((x&0x20)==0x20) y=@0064;else y=@0065;
  $  007.100km 平均电耗                      $    $         $    $  ANS000.BYTE006  $  y=x*1.0/10;
  $  008.整车控制器准备就绪                  $    $         $    $  ANS000.BYTE007  $  if((x&0x01)==0x01) y=@0054;else y=@0055;
  $  009.辅助电池电压低（DC‐DC 故障）       $    $         $    $  ANS000.BYTE007  $  if((x&0x02)==0x02) y=@002c;else y=@0035;
  $  010.动力电池故障                        $    $         $    $  ANS000.BYTE007  $  if((x&0x04)==0x04) y=@002c;else y=@0035;
  $  011.动力蓄电池切断                      $    $         $    $  ANS000.BYTE007  $  if((x&0x08)==0x08) y=@0066;else y=@0067;
  $  012.绝缘故障                            $    $         $    $  ANS000.BYTE007  $  if((x&0x10)==0x10) y=@002c;else y=@0035;
  $  013.EPS故障                             $    $         $    $  ANS000.BYTE007  $  if((x&0x20)==0x20) y=@002c;else y=@0035;
  $  014.真空泵故障                          $    $         $    $  ANS000.BYTE007  $  if((x&0x40)==0x40) y=@002c;else y=@0035;
  $  015.整车系统故障                        $    $         $    $  ANS000.BYTE007  $  if((x&0x80)==0x80) y=@002c;else y=@0035;

  $)  02.整车控制器的整车状态信息4
  $  02.整车控制器的整车状态信息4
  $  REQ000:010220002400001c7d01938       $  ANS000:18FA072710220002400001c7d01938

  $  000.档位信息               $    $        $    $  ANS000.BYTE001  $  if(x==0x00) y=@0056;else if(x==0x01) y=@0057;else if(x==0x02) y=@0058;else if(x==0x03) y=@0059;else if(x==0x04) y=@005a;else y=@0006;
  $  001.手刹                   $    $        $    $  ANS000.BYTE002  $  if((x&0x01)==0x01) y=@0054;else y=@0055;
  $  002.脚刹                   $    $        $    $  ANS000.BYTE002  $  if((x&0x02)==0x02) y=@0054;else y=@0055;
  $  003.散热器风扇             $    $        $    $  ANS000.BYTE002  $  if((x&0x04)==0x04) y=@0054;else y=@0055;
  $  004.冷却风扇               $    $        $    $  ANS000.BYTE002  $  if((x&0x08)==0x08) y=@0054;else y=@0055;
  $  005.空调状态               $    $        $    $  ANS000.BYTE002  $  if((x&0x10)==0x10) y=@0054;else y=@0055;
  $  006.暖风状态               $    $        $    $  ANS000.BYTE002  $  if((x&0x20)==0x20) y=@0054;else y=@0055;
  $  007.预充电接触器状态       $    $        $    $  ANS000.BYTE002  $  if((x&0x40)==0x40) y=@0054;else y=@0055;
  $  008.主接触器状态           $    $        $    $  ANS000.BYTE002  $  if((x&0x80)==0x80) y=@0054;else y=@0055;
  $  009.DC‐DC 状态            $    $        $    $  ANS000.BYTE003  $  if((x&0x01)==0x01) y=@0054;else y=@0055;
  $  010.ABS 状态               $    $        $    $  ANS000.BYTE003  $  if((x&0x02)==0x02) y=@0054;else y=@0055;
  $  011.ABS故障                $    $        $    $  ANS000.BYTE003  $  if((x&0x03)==0x03) y=@002c;else y=@0035;
  $  012.加速踏板信号           $    $  %     $    $  ANS000.BYTE004  $  y=x*0.4;
  $  013.制动踏板信号           $    $  %     $    $  ANS000.BYTE005  $  y=x*0.4;
  $  014.碰撞状态               $    $        $    $  ANS000.BYTE006  $  if((x&0x01)==0x01) y=@005d;else y=@0045;
  $  015.行驶模式               $    $        $    $  ANS000.BYTE006  $  if((x&0x02)==0x02) y=@005b;else y=@005c;
  $  016.限功率标志             $    $        $    $  ANS000.BYTE006  $  if((x&0x04)==0x04) y=@0063;else y=@0017;
  $  017.远程锁车               $    $        $    $  ANS000.BYTE006  $  if((x&0x08)==0x08) y=@0062;else y=@0017;
  $  018.整车故障码             $    $        $    $  ANS000.BYTE007  $  y=x;
  $  019.上下电逻辑值           $    $        $    $  ANS000.BYTE008  $  y=x;

  $)  03.整车控制器的整车状态信息5
  $  03.整车控制器的整车状态信息5
  $  REQ000:010220002400001c7d02138       $  ANS000:18FA072710220002400001c7d02138

  $  000.最高报警等级           $    $       $    $  ANS000.BYTE001  $  y=x;
  $  001.通用报警标志           $    $       $    $  ANS000.BYTE002  $  y=(x1*256+x2);
  $  002.动力电池故障总数       $    $       $    $  ANS000.BYTE004  $  y=x;
  $  003.驱动电机故障总数       $    $       $    $  ANS000.BYTE005  $  y=x;
  $  004.其他故障总数           $    $       $    $  ANS000.BYTE006  $  y=x;

  $)  04.整车控制器的整车状态信息3
  $  04.整车控制器的整车状态信息3
  $  REQ000:010220002400001c7d01138       $  ANS000:18FA072710220002400001c7d01138

  $  000.锁车指令         $    $       $    $  ANS000.BYTE001  $  if((x&0x01)==0x01) y=@0060;else y=@0061;
  $  001.锁车版本         $    $       $    $  ANS000.BYTE001  $  if((x&0x02)==0x02) y=@005e;else y=@005f;
  $  002.终端设备号       $    $       $    $  ANS000.BYTE004  $  y=(x1+x2*256+x3*256*256+x4*256*256*256);
  $  003.Life             $    $       $    $  ANS000.BYTE008  $  y=x;

;******************************************************************************************************************************************************

