
    车型ID：9f6c

    模拟：协议模拟-->9f6c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~250K$~18FF50E5,18FF51E5

进入命令:

  $~  REQ000:0       $~  ANS000:18FF50E5

空闲命令:


退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:0       $#  ANS000:18FF50E5


  码库:

  $*$*DTC/ffffffff_1BYTE


;******************************************************************************************************************************************************

读数据流: 

  $)  00.车载充电机OBC的状态信息1
  $  00.车载充电机OBC的状态信息1
  $  REQ000:010220002400001c7fa8728       $  ANS000:18FF50E510220002400001c7fa8728

  $  000.启动状态                     $    $             $    $  ANS000.BYTE001  $  if((x&0x01)==0x01) y=@0019;else y=@001a;
  $  001.充电机输出过流保护           $    $             $    $  ANS000.BYTE001  $  if((x&0x02)==0x02) y=@0018;else y=@0017;
  $  002.充电机输出过压保护           $    $             $    $  ANS000.BYTE001  $  if((x&0x04)==0x04) y=@0016;else y=@0017;
  $  003.充电机输出欠压保护           $    $             $    $  ANS000.BYTE001  $  if((x&0x08)==0x08) y=@001b;else y=@0017;
  $  004.输入欠压异常                 $    $             $    $  ANS000.BYTE001  $  if((x&0x10)==0x10) y=@0018;else y=@0017;
  $  005.输入过压异常                 $    $             $    $  ANS000.BYTE001  $  if((x&0x20)==0x20) y=@0018;else y=@0017;
  $  006.充电机过温保护               $    $             $    $  ANS000.BYTE001  $  if((x&0x40)==0x40) y=@0018;else y=@0017;
  $  007.充电座热敏电阻过温故障       $    $             $    $  ANS000.BYTE001  $  if((x&0x80)==0x80) y=@0018;else y=@0017;
  $  008.12V输出唤醒信号状态          $    $             $    $  ANS000.BYTE002  $  if((x&0x01)==0x01) y=@001e;else y=@001f;
  $  009.S2开关状态                   $    $             $    $  ANS000.BYTE002  $  if((x&0x02)==0x02) y=@001e;else y=@001f;
  $  010.充电机型号标志位             $    $             $    $  ANS000.BYTE002  $  if((x&0x04)==0x04) y=@001c;else y=@001d;
  $  011.电子锁状态                   $    $             $    $  ANS000.BYTE002  $  if((x&0x08)==0x08) y=@002a;else y=@002b;
  $  012.电子锁故障                   $    $             $    $  ANS000.BYTE002  $  if((x&0x10)==0x10) y=@0018;else y=@0017;
  $  013.BMS通讯故障                  $    $             $    $  ANS000.BYTE002  $  if((x&0x20)==0x20) y=@0028;else y=@0029;
  $  014.充电机硬件故障               $    $             $    $  ANS000.BYTE002  $  if((x&0x40)==0x40) y=@0018;else y=@0017;
  $  015.充电机功率                   $    $             $    $  ANS000.BYTE002  $  if((x&0x80)==0x80) y=@0026;else y=@0027;
  $  016.充电机充电状态               $    $             $    $  ANS000.BYTE003  $  if(x==0x00) y=@0020;else if(x==0x01) y=@0021;else if(x==0x02) y=@0022;else if(x==0x03) y=@0023;else if(x==0x04) y=@0024;else if(x==0x05) y=@0025;else if(x==0x06) y=@0013;else if(x==0x07) y=@0013;else y=@0006;
  $  017.输出电流                     $    $             $    $  ANS000.BYTE004  $  if(x==0x00) y=@000d;else if(x==0x01) y=@000e;else if(x==0x02) y=@000f;else if(x==0x03) y=@0010;else if(x==0x04) y=@0011;else if(x==0x05) y=@0012;else if(x==0x06) y=@0013;else if(x==0x07) y=@0013;else y=@0006;
  $  018.充电机CP外部能量状态         $    $  %          $    $  ANS000.BYTE005  $  y=x;
  $  019.当前最大输出功率             $    $  瓦         $    $  ANS000.BYTE006  $  y=x;
  $  020.充电机温度                   $    $  摄氏度     $    $  ANS000.BYTE007  $  y=x-40;
  $  021.充电座热敏电阻温度           $    $  摄氏度     $    $  ANS000.BYTE007  $  y=x-40;

  $)  01.车载充电机OBC的状态信息2
  $  01.车载充电机OBC的状态信息2
  $  REQ000:010220002400001c7fa8f28       $  ANS000:18FF50E510220002400001c7fa8f28

  $  000.输出电压       $    $  V      $    $  ANS000.BYTE001  $  y=(x1*256+x2);
  $  001.输出电流       $    $  安     $    $  ANS000.BYTE003  $  y=(x1*256+x2)-65535;
  $  002.输入电压       $    $  V      $    $  ANS000.BYTE005  $  y=(x1*256+x2);

;******************************************************************************************************************************************************

