
    车型ID：9f75

    模拟：协议模拟-->9f75

;******************************************************************************************************************************************************

    通讯线: $~02$~10$~500k$~1800F3E5,1801F3E5,1802F3E5,19017B75,1800E5F3

进入命令:

  $~  REQ000:0       $~  ANS000:1800F3E5

空闲命令:


退出命令:



;******************************************************************************************************************************************************

读数据流: 

  $)  00.OBC_1
  $  00.OBC_1
  $  REQ000:0       $  ANS000:1800F3E5

  $  000.充电机life           $    $        $    $  ANS000.BYTE0-4  $  y=x;
  $  001.充电机输出电压       $    $  V     $    $  ANS000.BYTE0-2  $  if((x1*256+x2)==0xFFFF) y=@0128;else y=(x1*256+x2)*0.1;
  $  002.充电机输出电流       $    $  A     $    $  ANS000.BYTE000  $  if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-5000)*0.1;
  $  003.硬件故障             $    $        $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@011c;
  $  004.充电机温度           $    $        $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0152;
  $  005.输入电压             $    $        $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@00e1;else y=@011a;
  $  006.启动状态             $    $        $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0155;else y=@0156;
  $  007.通信状态             $    $        $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@010f;else y=@0154;
  $  008.故障等级             $    $        $    $  ANS000.BYTE0-4  $  if((x&0x30)==0x00) y=@0035;else if((x&0x30)==0x10) y=@0141;else if((x&0x30)==0x20) y=@0153;else y=@0143;
  $  009.慢充连接状态         $    $        $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@012f;else y=@0130;

  $)  01.OBC_2
  $  01.OBC_2
  $  REQ000:0       $  ANS000:1800F3E5

  $  000.慢充机输入电压有效值       $    $  V          $    $  ANS000.BYTE0-3  $  y=(x1*256+x2)*0.1;
  $  001.AC输入电流有效值           $    $  A          $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-5000)*0.1;
  $  002.充电机输出限定电流         $    $  A          $    $  ANS000.BYTE000  $  y=x*0.1;
  $  003.OBC温度                    $    $  摄氏度     $    $  ANS000.BYTE001  $  if(x==0xFF) y=@0128;else y=x-40;
  $  004.充电机硬件版本号           $    $             $    $  ANS000.BYTE002  $  y=x;
  $  005.充电机软件版本号           $    $             $    $  ANS000.BYTE003  $  y=x;

  $)  02.OBC_3
  $  02.OBC_3
  $  REQ000:0       $  ANS000:1800F3E5

  $  000.电池电压有效值       $    $       $    $  ANS000.BYTE0-3  $  y=(x1*256+x2)*0.1;
  $  001.PFC电压有效值        $    $       $    $  ANS000.BYTE0-1  $  y=(x1*256+x2)*0.1;
  $  002.OBC系统状态          $    $       $    $  ANS000.BYTE000  $  if((x&0x07)==0x00) y=@0159;else if((x&0x07)==0x01) y=@015a;else if((x&0x07)==0x02) y=@015b;else if((x&0x07)==0x03) y=@015c;else if((x&0x07)==0x04) y=@015d;else if((x&0x07)==0x05) y=@015e;else if((x&0x07)==0x06) y=@015f;else y=@0160;
  $  003.充电口温度过温       $    $       $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  004.内部温度过温         $    $       $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  005.输出过流             $    $       $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  006.通信超时             $    $       $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  007.输入欠压             $    $       $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  008.输入过压             $    $       $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  009.PFC过压              $    $       $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  010.PFC欠压              $    $       $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  011.输出欠压             $    $       $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  012.输出过压             $    $       $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  013.电磁锁故障           $    $       $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@0017;else y=@0053;

  $)  03.OBC_4
  $  03.OBC_4
  $  REQ000:0       $  ANS000:1800F3E5

  $  000.充电桩输出限定电流有效值       $    $        $    $  ANS000.BYTE0-3  $  y=(x1*256+x2)*0.1;
  $  001.CP占空比                       $    $  %     $    $  ANS000.BYTE0-2  $  y=x;
  $  002.CC状态                         $    $        $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  003.CP状态                         $    $        $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  004.电磁锁状态                     $    $        $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0157;else y=@0158;
  $  005.S2状态                         $    $        $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@00d5;else y=@00d6;
  $  006.BMS唤醒状态                    $    $        $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0167;else y=@0168;
  $  007.低压12V状态                    $    $        $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0167;else y=@0168;
  $  008.CC电阻值                       $    $        $    $  ANS000.BYTE000  $  if((x&0x07)==0x00) y=@0161;else if((x&0x07)==0x01) y=@000e;else if((x&0x07)==0x02) y=@0162;else if((x&0x07)==0x03) y=@0163;else if((x&0x07)==0x04) y=@0164;else if((x&0x07)==0x05) y=@0165;else if((x&0x07)==0x06) y=@0166;else y=@0006;
  $  009.控制板温度                     $    $        $    $  ANS000.BYTE001  $  y=x-40;
  $  010.充电口温度1                    $    $        $    $  ANS000.BYTE002  $  y=x-40;
  $  011.充电口温度2                    $    $        $    $  ANS000.BYTE003  $  y=x-40;

  $)  04.BMS(电池管理系统)_19
  $  04.BMS(电池管理系统)_19
  $  REQ000:0       $  ANS000:1800F3E5

  $  000.电池管理系统life       $    $       $    $  ANS000.BYTE0-4  $  y=x;
  $  001.最大允许充电电压       $    $       $    $  ANS000.BYTE0-2  $  y=(x1*256+x2)*0.1;
  $  002.最大允许充电电流       $    $       $    $  ANS000.BYTE000  $  y=((x1*256+x2)-5000)*0.1;
  $  003.使能控制位             $    $       $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@013d;else y=@00d3;
  $  004.充电/加热模式位        $    $       $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0114;else y=@0092;
  $  005.充电完成标志位         $    $       $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@013e;else y=@0087;

;******************************************************************************************************************************************************

