
    车型ID：9f78

    模拟：协议模拟-->9f78

;******************************************************************************************************************************************************

    通讯线: $~02$~10$~500k

进入命令:

  $~  REQ000:0       $~  ANS000:

空闲命令:


退出命令:



;******************************************************************************************************************************************************

读数据流: 

  $)  00.GW1
  $  00.GW1
  $  REQ000:0       $  ANS000:

  $  000.车速                   $    $       $    $  ANS000.BYTE0-3  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=(x1*256+x2)*0.1;
  $  001.车速有效性             $    $       $    $  ANS000.BYTE0-2  $  if((x&0x01)==0x00) y=@0109;else y=@0003;
  $  002.EPB故障                $    $       $    $  ANS000.BYTE0-2  $  if((x&0x02)==0x00) y=@0035;else y=@002c;
  $  003.EPB驻车状态            $    $       $    $  ANS000.BYTE0-2  $  if((x&0x0c)==0x00) y=@0104;else if((x&0x0c)==0x04) y=@0103;else if((x&0x0c)==0x08) y=@0108;else y=@0042;
  $  004.EPB执行机构状态        $    $       $    $  ANS000.BYTE0-2  $  if((x&0x70)==0x00) y=@0102;else if((x&0x70)==0x10) y=@0103;else if((x&0x70)==0x20) y=@0104;else if((x&0x70)==0x30) y=@0105;else if((x&0x70)==0x40) y=@0106;else if((x&0x70)==0x50) y=@0107;else y=@0042;
  $  005.动态驻车状态           $    $       $    $  ANS000.BYTE0-2  $  if((x&0x80)==0x00) y=@010a;else y=@010b;
  $  006.主驾车门状态           $    $       $    $  ANS000.BYTE0-1  $  if((x&0x03)==0x00) y=@00af;else if((x&0x03)==0x01) y=@0015;else if((x&0x03)==0x02) y=@00f7;else y=@0003;
  $  007.副驾车门状态           $    $       $    $  ANS000.BYTE0-1  $  if((x&0x0c)==0x00) y=@00af;else if((x&0x0c)==0x04) y=@0015;else if((x&0x0c)==0x08) y=@00f7;else y=@0003;
  $  008.左后车门状态           $    $       $    $  ANS000.BYTE0-1  $  if((x&0x30)==0x00) y=@00af;else if((x&0x30)==0x10) y=@0015;else if((x&0x30)==0x20) y=@00f7;else y=@0003;
  $  009.右后车门状态           $    $       $    $  ANS000.BYTE0-1  $  if((x&0xc0)==0x00) y=@00af;else if((x&0xc0)==0x40) y=@0015;else if((x&0xc0)==0x80) y=@00f7;else y=@0003;
  $  010.行李箱门状态           $    $       $    $  ANS000.BYTE000  $  if((x&0x03)==0x00) y=@00af;else if((x&0x03)==0x01) y=@0015;else if((x&0x03)==0x02) y=@00f7;else y=@0003;
  $  011.左转向灯               $    $       $    $  ANS000.BYTE000  $  if((x&0x0c)==0x00) y=@00af;else if((x&0x0c)==0x04) y=@0015;else if((x&0x0c)==0x08) y=@00f7;else y=@0003;
  $  012.右转向灯               $    $       $    $  ANS000.BYTE000  $  if((x&0x30)==0x00) y=@00af;else if((x&0x30)==0x10) y=@0015;else if((x&0x30)==0x20) y=@00f7;else y=@0003;
  $  013.主驾安全带指示灯       $    $       $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@00f5;else y=@00f6;
  $  014.副驾安全带指示灯       $    $       $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@00f5;else y=@00f6;
  $  015.近光灯                 $    $       $    $  ANS000.BYTE001  $  if((x&0x03)==0x00) y=@00b1;else if((x&0x03)==0x01) y=@00b0;else if((x&0x03)==0x02) y=@00f4;else y=@0003;
  $  016.远光灯                 $    $       $    $  ANS000.BYTE001  $  if((x&0x0c)==0x00) y=@00b1;else if((x&0x0c)==0x04) y=@00b0;else if((x&0x0c)==0x08) y=@00f4;else y=@0003;
  $  017.碰撞信号               $    $       $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@00f9;else y=@00fa;
  $  018.位置灯                 $    $       $    $  ANS000.BYTE001  $  if((x&0x60)==0x00) y=@00b1;else if((x&0x60)==0x20) y=@00b0;else if((x&0x60)==0x40) y=@00f4;else y=@0003;
  $  019.ABS工作状态            $    $       $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@00f8;else y=@002d;
  $  020.前雾灯                 $    $       $    $  ANS000.BYTE001  $  if((x&0x03)==0x00) y=@00b1;else if((x&0x03)==0x01) y=@00b0;else if((x&0x03)==0x02) y=@00f4;else y=@0003;
  $  021.后雾灯                 $    $       $    $  ANS000.BYTE001  $  if((x&0x0c)==0x00) y=@00b1;else if((x&0x0c)==0x04) y=@00b0;else if((x&0x0c)==0x08) y=@00f4;else y=@0003;

  $)  01.GW2
  $  01.GW2
  $  REQ000:0       $  ANS000:

  $  000.网关life               $    $           $    $  ANS000.BYTE0-4  $  y=x;
  $  001.电机慢降扭标志位       $    $           $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@00ba;else y=@00fb;
  $  002.电机快降扭标志位       $    $           $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@00ba;else y=@00fb;
  $  003.电机升扭标志位         $    $           $    $  ANS000.BYTE0-3  $  if((x&0x04)==0x00) y=@00ba;else y=@00fb;
  $  004.ESC故障                $    $           $    $  ANS000.BYTE0-3  $  if((x&0x08)==0x00) y=@0035;else y=@002c;
  $  005.TCS故障                $    $           $    $  ANS000.BYTE0-3  $  if((x&0x10)==0x00) y=@0035;else y=@002c;
  $  006.ABS故障                $    $           $    $  ANS000.BYTE0-3  $  if((x&0x20)==0x00) y=@0035;else y=@002c;
  $  007.EBD故障                $    $           $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@0035;else y=@002c;
  $  008.EPS故障                $    $           $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@0035;else y=@002c;
  $  009.慢降扭目标值           $    $  牛米     $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-20000)*0.1;
  $  010.快降扭目标值           $    $  牛米     $    $  ANS000.BYTE001  $  y=((x1*256+x2)-20000)*0.1;
  $  011.升扭目标值             $    $  牛米     $    $  ANS000.BYTE003  $  y=((x1*256+x2)-20000)*0.1;

  $)  02.VCU_1
  $  02.VCU_1
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life       $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  001.整车工作状态         $    $             $    $  ANS000.BYTE0-3  $  if((x&0x07)==0x00) y=@0074;else if((x&0x07)==0x01) y=@0075;else if((x&0x07)==0x07) y=@0003;else y=@0006;
  $  002.蓄电池状态           $    $             $    $  ANS000.BYTE0-3  $  if((x&0x20)==0x00) y=@00e8;else y=@00e9;
  $  003.限功率状态           $    $             $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@00e6;else y=@00e7;
  $  004.DCDC状态             $    $             $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@00e5;else y=@002d;
  $  005.加速踏板开度         $    $  %          $    $  ANS000.BYTE0-2  $  if(x==0xFE) y=@0018;else y=x;
  $  006.制动踏板开度         $    $  %          $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else y=x;
  $  007.控制转矩             $    $  牛米       $    $  ANS000.BYTE001  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-20000)*0.1;
  $  008.电机温度             $    $  摄氏度     $    $  ANS000.BYTE002  $  if(x==0xFF) y=@0128;else y=x-40;
  $  009.水泵                 $    $             $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0015;else y=@0014;
  $  010.低速风扇             $    $             $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0015;else y=@0014;
  $  011.高速风扇             $    $             $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0015;else y=@0014;
  $  012.真空泵               $    $             $    $  ANS000.BYTE003  $  if((x&0x08)==0x00) y=@0015;else y=@0014;
  $  013.空调                 $    $             $    $  ANS000.BYTE003  $  if((x&0x10)==0x00) y=@0015;else y=@0014;
  $  014.手刹                 $    $             $    $  ANS000.BYTE003  $  if((x&0x20)==0x00) y=@00ec;else y=@00ed;
  $  015.脚刹                 $    $             $    $  ANS000.BYTE003  $  if((x&0x40)==0x00) y=@00ea;else y=@00eb;
  $  016.运动/经济模式        $    $             $    $  ANS000.BYTE003  $  if((x&0x80)==0x00) y=@00f2;else y=@00f3;

  $)  03.VCU_2
  $  03.VCU_2
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life       $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  001.档位信号             $    $             $    $  ANS000.BYTE0-3  $  if((x&0x03)==0x00) y=@009f;else if((x&0x03)==0x01) y=@0057;else if((x&0x03)==0x02) y=@009e;else y=@0056;
  $  002.充电状态             $    $             $    $  ANS000.BYTE0-2  $  if((x&0x03)==0x00) y=@00cd;else if((x&0x03)==0x01) y=@00ef;else if((x&0x03)==0x02) y=@00f0;else y=@00f1;
  $  003.车辆模式             $    $             $    $  ANS000.BYTE0-2  $  if((x&0x0e)==0x00) y=@0070;else if((x&0x0e)==0x02) y=@0071;else if((x&0x0e)==0x04) y=@0072;else if((x&0x0e)==0x06) y=@0073;else if((x&0x0e)==0x08) y=@00ee;else y=@0003;
  $  004.仪表停机指令         $    $             $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0003;else y=@002e;
  $  005.挂档失败             $    $             $    $  ANS000.BYTE000  $  if((x&0x20)==0x00) y=@0017;else y=@012c;
  $  006.电机控制器温度       $    $  摄氏度     $    $  ANS000.BYTE001  $  if(x==0xFF) y=@0128;else y=x-40;
  $  007.真空度               $    $  巴         $    $  ANS000.BYTE002  $  if(x==0xFF) y=@0128;else y=x*0.01;
  $  008.SOC(荷电状态)        $    $  %          $    $  ANS000.BYTE003  $  y=x*0.4;

  $)  04.VCU_3
  $  04.VCU_3
  $  REQ000:0       $  ANS000:

  $  000.VCU唤醒源                  $    $           $    $  ANS000.BYTE0-1  $  if((x&0x07)==0x00) y=@007a;else if((x&0x07)==0x01) y=@007b;else if((x&0x07)==0x02) y=@007c;else if((x&0x07)==0x03) y=@007d;else if((x&0x07)==0x04) y=@007e;else if((x&0x07)==0x05) y=@007f;else y=@0003;
  $  001.剩余里程                   $    $  千米     $    $  ANS000.BYTE0-2  $  y=(x1*256+x2);
  $  002.整车控制器硬件版本号       $    $           $    $  ANS000.BYTE002  $  y=x;

  $)  05.VCU_4
  $  05.VCU_4
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life               $    $       $    $  ANS000.BYTE0-1  $  y=x;
  $  001.快充连接状态                 $    $       $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@012a;else y=@012b;
  $  002.慢充连接状态                 $    $       $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@012f;else y=@0130;
  $  003.允许吸合总负接触器           $    $       $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@012d;else y=@012e;
  $  004.停机指令                     $    $       $    $  ANS000.BYTE002  $  if((x&0x08)==0x00) y=@0003;else y=@002e;
  $  005.高压主正接触器驱动指令       $    $       $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@001f;else y=@001e;
  $  006.高压预充接触器驱动指令       $    $       $    $  ANS000.BYTE002  $  if((x&0x20)==0x00) y=@001f;else y=@001e;
  $  007.快充继电器驱动状态           $    $       $    $  ANS000.BYTE002  $  if((x&0x40)==0x00) y=@001f;else y=@001e;
  $  008.快充继电器粘连故障           $    $       $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0035;else y=@0053;

  $)  06.VCU_5
  $  06.VCU_5
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life         $    $       $    $  ANS000.BYTE0-1  $  y=x;
  $  001.DCDC启停控制命令       $    $       $    $  ANS000.BYTE0-3  $  if((x&0x03)==0x00) y=@0042;else if((x&0x03)==0x01) y=@00b4;else if((x&0x03)==0x02) y=@00ba;else y=@0042;
  $  002.DCDC保护确认命令       $    $       $    $  ANS000.BYTE0-3  $  if((x&0x0c)==0x00) y=@0042;else if((x&0x0c)==0x04) y=@0134;else if((x&0x0c)==0x08) y=@0042;else y=@0042;

  $)  07.VCU_6
  $  07.VCU_6
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life                            $    $       $    $  ANS000.BYTE0-1  $  y=x;
  $  001.整车故障等级                              $    $       $    $  ANS000.BYTE0-3  $  if((x&0x03)==0x00) y=@0035;else if((x&0x03)==0x01) y=@0131;else if((x&0x03)==0x02) y=@0132;else y=@0133;
  $  002.电机控制器故障等级                        $    $       $    $  ANS000.BYTE0-3  $  if((x&0x0c)==0x00) y=@0035;else if((x&0x0c)==0x04) y=@0131;else if((x&0x0c)==0x08) y=@0132;else y=@0133;
  $  003.电池管理系统故障等级                      $    $       $    $  ANS000.BYTE0-3  $  if((x&0x30)==0x00) y=@0035;else if((x&0x30)==0x10) y=@0131;else if((x&0x30)==0x20) y=@0132;else y=@0133;
  $  004.整车控制器故障等级                        $    $       $    $  ANS000.BYTE0-3  $  if((x&0xc0)==0x00) y=@0035;else if((x&0xc0)==0x40) y=@0131;else if((x&0xc0)==0x80) y=@0132;else y=@0133;
  $  005.DCDC故障等级                              $    $       $    $  ANS000.BYTE0-2  $  if((x&0x03)==0x00) y=@0035;else if((x&0x03)==0x01) y=@011f;else if((x&0x03)==0x02) y=@0120;else y=@0121;
  $  006.充电机故障等级                            $    $       $    $  ANS000.BYTE0-2  $  if((x&0x0c)==0x00) y=@0035;else if((x&0x0c)==0x04) y=@011f;else if((x&0x0c)==0x08) y=@0120;else y=@0121;
  $  007.助力转向泵故障等级                        $    $       $    $  ANS000.BYTE0-2  $  if((x&0x30)==0x00) y=@0035;else if((x&0x30)==0x10) y=@011f;else if((x&0x30)==0x20) y=@0120;else y=@0121;
  $  008.空调故障等级                              $    $       $    $  ANS000.BYTE0-2  $  if((x&0xc0)==0x00) y=@0035;else if((x&0xc0)==0x40) y=@011f;else if((x&0xc0)==0x80) y=@0120;else y=@0121;
  $  009.加速踏板性能故障                          $    $       $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  010.加速踏板对电源短接                        $    $       $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  011.加速踏板对地短接                          $    $       $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  012.加速踏板开路                              $    $       $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  013.制动踏板性能故障                          $    $       $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  014.制动踏板对电源短接                        $    $       $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  015.制动踏板对地短接                          $    $       $    $  ANS000.BYTE0-1  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  016.制动踏板开路                              $    $       $    $  ANS000.BYTE0-1  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  017.动力电池单体电压过低                      $    $       $    $  ANS000.BYTE000  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  018.电机控制器过温                            $    $       $    $  ANS000.BYTE000  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  019.真空泵故障                                $    $       $    $  ANS000.BYTE000  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  020.蓄电池电压过低                            $    $       $    $  ANS000.BYTE000  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  021.电机控制器掉电                            $    $       $    $  ANS000.BYTE000  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  022.电池管理系统掉线                          $    $       $    $  ANS000.BYTE000  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  023.SOC较低故障(5%-10%)                       $    $       $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  024.SOC过低故障(小于5%)                       $    $       $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  025.ABS故障                                   $    $       $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  026.SRS故障（气囊故障）                       $    $       $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  027.水泵故障                                  $    $       $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  028.蓄电池电压严重过低（小于等于10.8V）       $    $       $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  029.充电机掉线                                $    $       $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  030.助力转向控制器掉线                        $    $       $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  031.空调控制器掉线                            $    $       $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  032.DCDC掉线                                  $    $       $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  033.SOC故障报警（10%-20%）                    $    $       $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  034.TBOX掉线                                  $    $       $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  035.TBOX SIM卡失效                            $    $       $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  036.严重超载故障                              $    $       $    $  ANS000.BYTE002  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  037.EBD故障                                   $    $       $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  038.胎压故障                                  $    $       $    $  ANS000.BYTE002  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  039.PEPS故障                                  $    $       $    $  ANS000.BYTE002  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  040.EPB故障                                   $    $       $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  041.停机指令                                  $    $       $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  042.高压互锁                                  $    $       $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  043.PAAS故障                                  $    $       $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  044.P档控制器故障                             $    $       $    $  ANS000.BYTE003  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  045.ESC故障                                   $    $       $    $  ANS000.BYTE003  $  if((x&0x10)==0x00) y=@0003;else y=@002e;

  $)  08.VCU_7
  $  08.VCU_7
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life            $    $       $    $  ANS000.BYTE0-1  $  y=x;
  $  001.急停开关状态              $    $       $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@0180;else y=@0181;
  $  002.BMS将切断主负接触器       $    $       $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@017e;else y=@017f;
  $  003.驱动命令                  $    $       $    $  ANS000.BYTE0-3  $  if((x&0x0c)==0x00) y=@0003;else if((x&0x0c)==0x04) y=@0184;else if((x&0x0c)==0x08) y=@0185;else y=@0003;
  $  004.运行控制命令              $    $       $    $  ANS000.BYTE0-3  $  if((x&0x30)==0x00) y=@00ba;else if((x&0x30)==0x10) y=@0182;else if((x&0x30)==0x20) y=@0183;else y=@0177;
  $  005.模式控制指令              $    $       $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@017a;else y=@017b;
  $  006.关闭/启动命令             $    $       $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@0015;else y=@0014;
  $  007.电动机限制转速命令        $    $       $    $  ANS000.BYTE0-1  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-20000);
  $  008.电机转矩命令              $    $       $    $  ANS000.BYTE001  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-20000)*0.1;
  $  009.车辆状态                  $    $       $    $  ANS000.BYTE002  $  if(x==0x10) y=@00c5;else if(x==0x20) y=@00c6;else if(x==0x30) y=@00c7;else if(x==0x50) y=@011d;else if(x==0x60) y=@011e;else y=@00ca;
  $  010.电容放电                  $    $       $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0186;else y=@0150;
  $  011.预充电继电器状态          $    $       $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@001f;else y=@001e;
  $  012.主接触器状态              $    $       $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@001f;else y=@001e;

  $)  09.VCU_8
  $  09.VCU_8
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life       $    $            $    $  ANS000.BYTE0-1  $  y=x;
  $  001.电池组总电压         $    $  V         $    $  ANS000.BYTE0-2  $  y=(x1*256+x2)*0.1;
  $  002.手刹信号             $    $            $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@00ec;else y=@00ed;
  $  003.脚刹信号             $    $            $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@00ea;else y=@00eb;
  $  004.档位状态             $    $            $    $  ANS000.BYTE0-1  $  if((x&0x0c)==0x00) y=@009f;else if((x&0x0c)==0x04) y=@0057;else if((x&0x0c)==0x08) y=@009e;else y=@0056;
  $  005.停机指令             $    $            $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0003;else y=@002e;
  $  006.加速踏板信号         $    $            $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0173;else y=@0174;
  $  007.蠕行模式             $    $            $    $  ANS000.BYTE0-1  $  if((x&0x40)==0x00) y=@0171;else y=@0172;
  $  008.蠕行目标转速         $    $  转/分     $    $  ANS000.BYTE001  $  y=(x1*256+x2);

  $)  10.VCU_9
  $  10.VCU_9
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life       $    $       $    $  ANS000.BYTE0-1  $  y=x;
  $  001.报文命令有效性       $    $       $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@0003;else y=@0109;
  $  002.工作使能命令         $    $       $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@017c;else y=@017d;
  $  003.停机指令             $    $       $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@0003;else y=@002e;

  $)  11.TBOX_1
  $  11.TBOX_1
  $  REQ000:0       $  ANS000:

  $  000.空调控制器life值                                    $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  001.空调压缩机转速反馈                                  $    $             $    $  ANS000.BYTE0-2  $  y=(x1*256+x2);
  $  002.空调反馈电压                                        $    $             $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.1;
  $  003.空调控制器life值                                    $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  004.内部电压故障                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  005.内部功率管故障                                      $    $             $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  006.过压故障                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  007.欠压故障                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  008.过流保护                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  009.压缩机电机堵转                                      $    $             $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  010.EAS零部件号                                         $    $             $    $  ANS000.BYTE001  $  y=(x1*256+x2);
  $  011.EAS硬件版本号                                       $    $             $    $  ANS000.BYTE002  $  y=x;
  $  012.EAS软件版本号                                       $    $             $    $  ANS000.BYTE003  $  y=x;
  $  013.PAAS的life                                          $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  014.PAAS自检状态                                        $    $             $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@0044;else y=@004c;
  $  015.PAAS工作状态                                        $    $             $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@00f8;else y=@0052;
  $  016.PAAS故障标志                                        $    $             $    $  ANS000.BYTE0-3  $  if((x&0x04)==0x00) y=@0035;else y=@002c;
  $  017.软件故障                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x01)==0x00) y=@0035;else y=@002c;
  $  018.控制器故障                                          $    $             $    $  ANS000.BYTE0-2  $  if((x&0x02)==0x00) y=@0035;else y=@002c;
  $  019.扬声器硬件故障                                      $    $             $    $  ANS000.BYTE0-2  $  if((x&0x04)==0x00) y=@0035;else y=@002c;
  $  020.VCU通信超时故障                                     $    $             $    $  ANS000.BYTE0-2  $  if((x&0x08)==0x00) y=@0035;else y=@002c;
  $  021.软件版本号高字节(代表车型)                          $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  022.软件版本号低字节(代表软件程序升级状态)              $    $             $    $  ANS000.BYTE000  $  y=x;
  $  023.硬件版本号高字节(代表车型)                          $    $             $    $  ANS000.BYTE001  $  y=x;
  $  024.硬件版本号低字节(代表软件程序升级状态)              $    $             $    $  ANS000.BYTE002  $  y=x;
  $  025.动力电池组管理系统life                              $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  026.电池组充放电总电流                                  $    $             $    $  ANS000.BYTE0-2  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-10000)*0.1;
  $  027.电池组总电压                                        $    $             $    $  ANS000.BYTE000  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=(x1*256+x2)*0.1;
  $  028.动力电池组状态                                      $    $             $    $  ANS000.BYTE001  $  if((x&0x03)==0x00) y=@014f;else if((x&0x03)==0x01) y=@0150;else if((x&0x03)==0x02) y=@0151;else y=@0003;
  $  029.外接充电允许                                        $    $             $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0099;else y=@0144;
  $  030.电池故障等级                                        $    $             $    $  ANS000.BYTE001  $  if((x&0x18)==0x00) y=@0035;else if((x&0x18)==0x08) y=@0141;else if((x&0x18)==0x10) y=@0142;else y=@0143;
  $  031.电池组当前最大允许充电功率                          $    $             $    $  ANS000.BYTE0-3  $  y=((x1*256+x2)-32000)*0.01;
  $  032.电池组当前最大允许放电功率                          $    $             $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-32000)*0.01;
  $  033.电池组当前最大允许充电电流                          $    $             $    $  ANS000.BYTE001  $  y=((x1*256+x2)-5000)*0.1;
  $  034.电池组当前最大允许放电电流                          $    $             $    $  ANS000.BYTE003  $  y=((x1*256+x2)-5000)*0.1;
  $  035.电池组当前最大允许充电电压                          $    $             $    $  ANS000.BYTE0-3  $  y=(x1*256+x2)*0.1;
  $  036.电池组平均温度                                      $    $             $    $  ANS000.BYTE0-2  $  y=x-40;
  $  037.电池组允许最高温度                                  $    $             $    $  ANS000.BYTE0-1  $  y=x-40;
  $  038.电池组允许最低温度                                  $    $             $    $  ANS000.BYTE000  $  y=x-40;
  $  039.电池组最高温度                                      $    $             $    $  ANS000.BYTE001  $  y=x-40;
  $  040.母线外电压                                          $    $             $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.1;
  $  041.最高单体电压                                        $    $  V          $    $  ANS000.BYTE0-3  $  if((x1*256+x2)==0xFFFE) y=@0018;else y=(x1*256+x2)*0.001;
  $  042.最低单体电压                                        $    $  V          $    $  ANS000.BYTE0-1  $  if((x1*256+x2)==0xFFFE) y=@0018;else y=(x1*256+x2)*0.001;
  $  043.单体最高温度                                        $    $  摄氏度     $    $  ANS000.BYTE000  $  y=x-40;
  $  044.单体最低温度                                        $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  045.高压主负接触器状态                                  $    $             $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0147;else y=@0148;
  $  046.高压主正接触器状态                                  $    $             $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0145;else y=@0146;
  $  047.动力电池类型                                        $    $             $    $  ANS000.BYTE002  $  if((x&0x0C)==0x00) y=@014c;else if((x&0x0C)==0x04) y=@014d;else if((x&0x0C)==0x08) y=@014e;else y=@0076;
  $  048.慢充电子锁状态                                      $    $             $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@014a;else y=@014b;
  $  049.高压预充接触器状态                                  $    $             $    $  ANS000.BYTE002  $  if((x&0x20)==0x00) y=@00d0;else y=@0149;
  $  050.预充电状态                                          $    $             $    $  ANS000.BYTE002  $  if((x&0x40)==0x00) y=@0030;else y=@0082;
  $  051.BMS弱电自检完成                                     $    $             $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0030;else y=@002f;
  $  052.SOH值                                               $    $  %          $    $  ANS000.BYTE003  $  y=x;
  $  053.剩余能量                                            $    $  kwh        $    $  ANS000.BYTE0-3  $  y=(x1*256+x2)*0.1;
  $  054.绝缘电阻                                            $    $  千欧       $    $  ANS000.BYTE0-1  $  y=(x1*256+x2);
  $  055.电池均衡状态                                        $    $             $    $  ANS000.BYTE000  $  if((x&0x01)==0x00) y=@0137;else y=@0138;
  $  056.停机状态                                            $    $             $    $  ANS000.BYTE000  $  if((x&0x02)==0x00) y=@0135;else y=@0136;
  $  057.慢充充电状态                                        $    $             $    $  ANS000.BYTE000  $  if((x&0x0C)==0x00) y=@00cd;else if((x&0x0C)==0x04) y=@00ce;else if((x&0x0C)==0x08) y=@0085;else y=@013c;
  $  058.快充充电状态                                        $    $             $    $  ANS000.BYTE000  $  if((x&0x30)==0x00) y=@00cd;else if((x&0x30)==0x10) y=@00ce;else if((x&0x30)==0x20) y=@0085;else y=@013c;
  $  059.加热继电器状态                                      $    $             $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@00d5;else y=@013b;
  $  060.动力电池切断                                        $    $             $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@0139;else y=@013a;
  $  061.BMS硬件版本号                                       $    $             $    $  ANS000.BYTE002  $  y=x;
  $  062.BMS软件版本号                                       $    $             $    $  ANS000.BYTE003  $  y=x;
  $  063.充电机输出电压                                      $    $             $    $  ANS000.BYTE0-3  $  y=(x1*256+x2);
  $  064.充电机输出电流                                      $    $             $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-5000)*0.1;
  $  065.当次累计充电时间                                    $    $             $    $  ANS000.BYTE001  $  y=(x1*256+x2);
  $  066.当次已充电能量                                      $    $             $    $  ANS000.BYTE003  $  y=(x1*256+x2);
  $  067.可充电储能子系统个数                                $    $             $    $  ANS000.BYTE0-1  $  if(x==0xFF) y=@0128;else y=x;
  $  068.可充电储能系统编码长度(“0”表示不上传该编码)       $    $             $    $  ANS000.BYTE0-3  $  y=x;
  $  069.最高电压电池子系统号                                $    $             $    $  ANS000.BYTE0-2  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  070.最高电压电池单体代号                                $    $             $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  071.最低电压电池子系统号                                $    $             $    $  ANS000.BYTE000  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  072.最低电压电池单体代号                                $    $             $    $  ANS000.BYTE001  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  073.最高温度子系统号                                    $    $             $    $  ANS000.BYTE002  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  074.最高温度探针单体代号                                $    $             $    $  ANS000.BYTE003  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  075.最低温度子系统号                                    $    $             $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  076.最低温度探针子系统代号                              $    $             $    $  ANS000.BYTE0-3  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  077.可充电储能装置故障总数N1                            $    $             $    $  ANS000.BYTE0-2  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  078.可充电储能子系统号                                  $    $             $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0128;else y=x;
  $  079.可充电储能温度探针个数                              $    $             $    $  ANS000.BYTE001  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=(x1*256+x2);
  $  080.电池单体总数                                        $    $             $    $  ANS000.BYTE003  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=(x1*256+x2);
  $  081.仪表life                                            $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  082.累计里程                                            $    $  KM         $    $  ANS000.BYTE002  $  if((x1*256*256*256+x2*256*256+x3*256+x4) == 0xFFFFFFFF) y=@0128;else if((x1*256*256*256+x2*256*256+x3*256+x4) == 0xFFFFFFFE) y=@0018;else y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.1;
  $  083.DCDC的life                                          $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  084.低压端实时电压                                      $    $  V          $    $  ANS000.BYTE0-3  $  y=x*0.1;
  $  085.低压端实时电流                                      $    $             $    $  ANS000.BYTE0-1  $  y=(x1*256+x2)*0.1;
  $  086.变压器温度                                          $    $             $    $  ANS000.BYTE000  $  y=x-40;
  $  087.高压端实时电压                                      $    $             $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.1;
  $  088.DSP结温                                             $    $             $    $  ANS000.BYTE003  $  y=x-40;
  $  089.DCDC的life                                          $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  090.工作状态                                            $    $             $    $  ANS000.BYTE0-3  $  if((x&0x07)==0x00) y=@0042;else if((x&0x07)==0x01) y=@0124;else if((x&0x07)==0x02) y=@0021;else if((x&0x07)==0x03) y=@00b4;else if((x&0x07)==0x04) y=@0125;else if((x&0x07)==0x05) y=@0126;else if((x&0x07)==0x06) y=@0127;else y=@0006;
  $  091.DCDC故障等级                                        $    $             $    $  ANS000.BYTE0-3  $  if((x&0x30)==0x00) y=@0035;else if((x&0x30)==0x10) y=@0131;else if((x&0x30)==0x20) y=@0132;else y=@0133;
  $  092.DCDC水冷系统启动指令                                $    $             $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@0122;else y=@0123;
  $  093.高压过压                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x01)==0x00) y=@0017;else y=@0041;
  $  094.高压欠压                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x02)==0x00) y=@0017;else y=@0041;
  $  095.低压过压                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x04)==0x00) y=@0017;else y=@0041;
  $  096.输出短路                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x08)==0x00) y=@0017;else y=@0041;
  $  097.过温                                                $    $             $    $  ANS000.BYTE0-2  $  if((x&0x10)==0x00) y=@0017;else y=@0041;
  $  098.低压欠压                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x20)==0x00) y=@0017;else y=@0041;
  $  099.停机失败                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x40)==0x00) y=@0017;else y=@0041;
  $  100.低压端电流传感器故障                                $    $             $    $  ANS000.BYTE0-2  $  if((x&0x80)==0x00) y=@0017;else y=@0041;
  $  101.温度传感器故障                                      $    $             $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0041;
  $  102.DCDC工作指令报文丢失                                $    $             $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0041;
  $  103.互锁故障                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0017;else y=@0041;
  $  104.允许失败                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0017;else y=@0041;
  $  105.DCDC限功率                                          $    $             $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@00e6;else y=@00e7;
  $  106.停机状态                                            $    $             $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0135;else y=@0136;
  $  107.DCDC硬件版本号                                      $    $             $    $  ANS000.BYTE002  $  y=x;
  $  108.DCDC软件版本号                                      $    $             $    $  ANS000.BYTE003  $  y=x;
  $  109.预充电状态                                          $    $             $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0030;else y=@002f;
  $  110.工作模式                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@017a;else y=@017b;
  $  111.正转/反转                                           $    $             $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0178;else y=@0179;
  $  112.其他/空转                                           $    $             $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0076;else y=@0177;
  $  113.允许关断主接触器                                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0175;else y=@0176;
  $  114.电机控制器弱电自检完成                              $    $             $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0030;else y=@002f;
  $  115.故障状态                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0xc0)==0x00) y=@0035;else if((x&0xc0)==0x40) y=@0131;else if((x&0xc0)==0x80) y=@0132;else y=@0133;
  $  116.MCU的life                                           $    $             $    $  ANS000.BYTE0-3  $  y=x;
  $  117.电机当前转速                                        $    $  r/min      $    $  ANS000.BYTE0-1  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-20000);
  $  118.电机温度                                            $    $  摄氏度     $    $  ANS000.BYTE000  $  y=x-40;
  $  119.电机控制器温度                                      $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  120.电机当前转矩                                        $    $  牛米       $    $  ANS000.BYTE003  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-20000)*0.1;
  $  121.电机的最大驱动功率                                  $    $             $    $  ANS000.BYTE0-3  $  y=((x1*256+x2)-32000)*0.01;
  $  122.电机的最大制动功率                                  $    $             $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-32000)*0.01;
  $  123.电机的最大驱动转矩                                  $    $             $    $  ANS000.BYTE001  $  y=((x1*256+x2)-30000)*0.1;
  $  124.电机的最大制动转矩                                  $    $             $    $  ANS000.BYTE003  $  y=((x1*256+x2)-30000)*0.1;
  $  125.电机直流电压                                        $    $  V          $    $  ANS000.BYTE0-3  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=(x1*256+x2)*0.1;
  $  126.电机相电流                                          $    $  A          $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-5000)*0.1;
  $  127.电机相电压                                          $    $  V          $    $  ANS000.BYTE001  $  y=(x1*256+x2);
  $  128.电机控制器类型                                      $    $             $    $  ANS000.BYTE002  $  if((x&0x01)==0x01) y=@0129;else y=@0006;
  $  129.停机状态                                            $    $             $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@0135;else y=@0136;
  $  130.驻坡状态                                            $    $             $    $  ANS000.BYTE002  $  if((x&0x20)==0x00) y=@016e;else y=@016f;
  $  131.电容放电状态                                        $    $             $    $  ANS000.BYTE002  $  if((x&0xc0)==0x00) y=@0042;else if((x&0xc0)==0x40) y=@016b;else if((x&0xc0)==0x80) y=@016c;else y=@016d;
  $  132.驱动电机状态                                        $    $             $    $  ANS000.BYTE003  $  if((x&0x03)==0x00) y=@0169;else if((x&0x03)==0x01) y=@016a;else if((x&0x03)==0x02) y=@0015;else y=@003e;
  $  133.IGBT保护                                            $    $             $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  134.驱动电源欠压保护                                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  135.电机力矩错误                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  136.IGBT过温保护                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  137.母线电流过流保护                                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  138.相电流过流保护                                      $    $             $    $  ANS000.BYTE0-1  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  139.控制电压欠压保护                                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  140.电机堵转故障                                        $    $             $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  141.控制器电压防过压保护                                $    $             $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  142.A相交流传感器合理性错误                             $    $             $    $  ANS000.BYTE0-3  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  143.母线电压欠压保护                                    $    $             $    $  ANS000.BYTE0-3  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  144.母线电压过压保护                                    $    $             $    $  ANS000.BYTE0-3  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  145.电机温度传感器合理性错误                            $    $             $    $  ANS000.BYTE0-3  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  146.过载保护                                            $    $             $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  147.堵转保护                                            $    $             $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  148.IGBT温度传感器合理性错误                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  149.CAN通讯故障保护                                     $    $             $    $  ANS000.BYTE0-2  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  150.系统故障                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  151.缺相保护                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  152.旋变保护                                            $    $             $    $  ANS000.BYTE0-2  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  153.硬件关断信号保护                                    $    $             $    $  ANS000.BYTE0-2  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  154.高压互锁故障                                        $    $             $    $  ANS000.BYTE0-2  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  155.C相交流传感器合理性故障                             $    $             $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  156.驱动上桥故障                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  157.驱动下桥故障                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  158.KL30电源电压过低                                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  159.电流检测故障                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  160.主动放电故障                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  161.相间短路故障                                        $    $             $    $  ANS000.BYTE0-1  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  162.母线快速欠压故障                                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  163.硬件过压故障                                        $    $             $    $  ANS000.BYTE000  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  164.驱动芯片初始化失败故障                              $    $             $    $  ANS000.BYTE000  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  165.IGBT结温检测故障1                                   $    $             $    $  ANS000.BYTE000  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  166.IGBT结温检测故障2                                   $    $             $    $  ANS000.BYTE000  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  167.EEROM故障                                           $    $             $    $  ANS000.BYTE000  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  168.电机控制器过热报警                                  $    $             $    $  ANS000.BYTE000  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  169.电机控制器过热故障                                  $    $             $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  170.电机过热报警                                        $    $             $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  171.电机过热故障                                        $    $             $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  172.电机温度传感器掉线故障                              $    $             $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  173.相电流警告                                          $    $             $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  174.高速停机保护报警                                    $    $             $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  175.高速误挂档保护报警                                  $    $             $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  176.大扭矩停机保护报警                                  $    $             $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  177.速度偏差过大故障                                    $    $             $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  178.母线欠压报警                                        $    $             $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  179.母线过压报警                                        $    $             $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  180.电机直流电流                                        $    $             $    $  ANS000.BYTE0-3  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0128;else y=((x1*256+x2)-10000)*0.1;
  $  181.电机功率                                            $    $             $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-32000)*0.01;
  $  182.电机控制器硬件版本号                                $    $             $    $  ANS000.BYTE002  $  y=x;
  $  183.电机控制器软件版本号                                $    $             $    $  ANS000.BYTE003  $  y=x;
  $  184.驱动电机个数                                        $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  185.驱动电机序号                                        $    $             $    $  ANS000.BYTE0-3  $  y=x;
  $  186.电机控制器输入电压                                  $    $             $    $  ANS000.BYTE0-1  $  y=(x1*256+x2)*0.1;
  $  187.电机控制器直流母线电流                              $    $             $    $  ANS000.BYTE001  $  y=((x1*256+x2)-10000)*0.1;
  $  188.驱动电机故障总数N2                                  $    $             $    $  ANS000.BYTE002  $  y=x;
  $  189.TBOX的life                                          $    $             $    $  ANS000.BYTE0-1  $  y=x;
  $  190.安全气囊故障指示灯                                  $    $             $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@00b1;else y=@00b0;

;******************************************************************************************************************************************************

