
    车型ID：9f79

    模拟：协议模拟-->9f79

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~250K

进入命令:

  $~  REQ000:0       $~  ANS000:

空闲命令:


退出命令:



;******************************************************************************************************************************************************

读数据流: 

  $)  00.整车控制器发送信息1
  $  00.整车控制器发送信息1
  $  REQ000:0       $  ANS000:

  $  000.整车控制器life               $    $       $    $  ANS000.BYTE0-4  $  y=x;
  $  001.快充连接状态                 $    $       $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@012a;else y=@012b;
  $  002.慢充连接状态                 $    $       $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@012f;else y=@0130;
  $  003.允许吸合总负接触器           $    $       $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@012d;else y=@012e;
  $  004.停机指令                     $    $       $    $  ANS000.BYTE002  $  if((x&0x08)==0x00) y=@0003;else y=@002e;
  $  005.高压主正接触器驱动指令       $    $       $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@001f;else y=@001e;
  $  006.高压预充接触器驱动指令       $    $       $    $  ANS000.BYTE002  $  if((x&0x20)==0x00) y=@001f;else y=@001e;
  $  007.快充继电器驱动状态           $    $       $    $  ANS000.BYTE002  $  if((x&0x40)==0x00) y=@00d5;else y=@00d6;
  $  008.快充继电器粘连故障           $    $       $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0035;else y=@0053;

  $)  01.充电机发送信息1
  $  01.充电机发送信息1
  $  REQ000:0       $  ANS000:

  $  000.充电机life           $    $        $    $  ANS000.BYTE0-4  $  y=x;
  $  001.充电机输出电压       $    $  V     $    $  ANS000.BYTE0-3  $  y=(x1*256+x2)*0.1;
  $  002.充电机输出电流       $    $  A     $    $  ANS000.BYTE0-1  $  y=((x1*256+x2)-5000)*0.1;
  $  003.硬件故障             $    $        $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@011c;
  $  004.充电机温度           $    $        $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0152;
  $  005.输入电压             $    $        $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@00e1;else y=@00e2;
  $  006.启动状态             $    $        $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@00df;else y=@00e0;
  $  007.通信状态             $    $        $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@010f;else y=@0154;
  $  008.故障等级             $    $        $    $  ANS000.BYTE001  $  if((x&0x60)==0x00) y=@0035;else if((x&0x60)==0x20) y=@00dc;else if((x&0x60)==0x40) y=@00dd;else y=@00de;
  $  009.慢充连接状态         $    $        $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@012f;else y=@0130;

  $)  02.充电机发送信息2
  $  02.充电机发送信息2
  $  REQ000:0       $  ANS000:

  $  000.慢充机输入电压有效值       $    $  V          $    $  ANS000.BYTE0-4  $  y=(x1*256+x2)*0.1;
  $  001.AC输入电流有效值           $    $  A          $    $  ANS000.BYTE0-2  $  y=((x1*256+x2)-5000)*0.1;
  $  002.充电机输出限定电流         $    $  A          $    $  ANS000.BYTE000  $  y=x*0.1;
  $  003.OBC温度                    $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  004.充电机硬件版本号           $    $             $    $  ANS000.BYTE002  $  y=x;
  $  005.充电机软件版本号           $    $             $    $  ANS000.BYTE003  $  y=x;

  $)  03.充电机发送信息3
  $  03.充电机发送信息3
  $  REQ000:0       $  ANS000:

  $  000.电池电压有效值       $    $  V     $    $  ANS000.BYTE0-4  $  y=(x1*256+x2)*0.1;
  $  001.PFC电压有效值        $    $  V     $    $  ANS000.BYTE0-2  $  y=(x1*256+x2)*0.1;
  $  002.OBC系统状态          $    $        $    $  ANS000.BYTE000  $  if((x&0x07)==0x00) y=@0020;else if((x&0x07)==0x01) y=@0021;else if((x&0x07)==0x02) y=@00d7;else if((x&0x07)==0x03) y=@00d8;else if((x&0x07)==0x04) y=@0087;else if((x&0x07)==0x05) y=@00d9;else if((x&0x07)==0x06) y=@00da;else if((x&0x07)==0x07) y=@00db;else y=@0006;
  $  003.充电口温度过温       $    $        $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  004.内部温度过温         $    $        $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  005.输出过流             $    $        $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  006.通信超时             $    $        $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  007.输入欠压             $    $        $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  008.输入过压             $    $        $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  009.PFC过压              $    $        $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  010.PFC欠压              $    $        $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  011.输出欠压             $    $        $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  012.输出过压             $    $        $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  013.电磁锁故障           $    $        $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@0017;else y=@0053;

  $)  04.充电机发送信息4
  $  04.充电机发送信息4
  $  REQ000:0       $  ANS000:

  $  000.充电桩输出限定电流有效值       $    $  A          $    $  ANS000.BYTE0-4  $  y=(x1*256+x2)*0.1;
  $  001.CP占空比                       $    $  %          $    $  ANS000.BYTE0-2  $  y=x;
  $  002.CC状态                         $    $             $    $  ANS000.BYTE0-1  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  003.CP状态                         $    $             $    $  ANS000.BYTE0-1  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  004.电磁锁状态                     $    $             $    $  ANS000.BYTE0-1  $  if((x&0x04)==0x00) y=@0157;else y=@0158;
  $  005.S2状态                         $    $             $    $  ANS000.BYTE0-1  $  if((x&0x08)==0x00) y=@00d5;else y=@00d6;
  $  006.BMS唤醒状态                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x10)==0x00) y=@0167;else y=@0168;
  $  007.低压12V状态                    $    $             $    $  ANS000.BYTE0-1  $  if((x&0x20)==0x00) y=@0167;else y=@0168;
  $  008.CC电阻值                       $    $             $    $  ANS000.BYTE000  $  if((x&0x07)==0x00) y=@0161;else if((x&0x07)==0x01) y=@000e;else if((x&0x07)==0x02) y=@0162;else if((x&0x07)==0x03) y=@0163;else if((x&0x07)==0x04) y=@0164;else if((x&0x07)==0x05) y=@0165;else if((x&0x07)==0x06) y=@0166;else y=@0006;
  $  009.控制板温度                     $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  010.充电口温度1                    $    $  摄氏度     $    $  ANS000.BYTE002  $  y=x-40;
  $  011.充电口温度2                    $    $  摄氏度     $    $  ANS000.BYTE003  $  y=x-40;

  $)  05.动力电池组管理系统发送信息1
  $  05.动力电池组管理系统发送信息1
  $  REQ000:0       $  ANS000:

  $  000.动力电池组管理系统life           $    $        $    $  ANS000.BYTE0-4  $  y=x;
  $  001.电池组充放电总电流               $    $  A     $    $  ANS000.BYTE0-3  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-1000)*0.1;
  $  002.电池组高电压                     $    $  V     $    $  ANS000.BYTE0-1  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-1000)*0.1;
  $  003.动力电池组状态                   $    $        $    $  ANS000.BYTE001  $  if((x&0x03)==0x00) y=@014f;else if((x&0x03)==0x01) y=@0150;else if((x&0x03)==0x02) y=@0151;else y=@0003;
  $  004.外接充电允许                     $    $        $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0099;else y=@00e4;
  $  005.电池故障等级                     $    $        $    $  ANS000.BYTE001  $  if((x&0x18)==0x00) y=@0035;else if((x&0x18)==0x08) y=@00dc;else if((x&0x18)==0x10) y=@00e3;else y=@00de;
  $  006.绝缘等级                         $    $        $    $  ANS000.BYTE001  $  if((x&0x60)==0x00) y=@0035;else if((x&0x60)==0x20) y=@00dc;else if((x&0x60)==0x40) y=@00e3;else y=@00de;
  $  007.请求允许吸合高压主负接触器       $    $        $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@013f;else y=@0140;
  $  008.SOC(荷电状态)                    $    $  %     $    $  ANS000.BYTE002  $  y=x*0.4;
  $  009.电池组允许使用最低SOC            $    $  %     $    $  ANS000.BYTE003  $  y=x*0.4;

  $)  06.动力电池组管理系统发送信息2
  $  06.动力电池组管理系统发送信息2
  $  REQ000:0       $  ANS000:

  $  000.电池组当前最大允许充电功率       $    $  KW     $    $  ANS000.BYTE0-4  $  y=((x1*256+x2)-32000)*0.01;
  $  001.电池组当前最大允许放电功率       $    $  KW     $    $  ANS000.BYTE0-2  $  y=((x1*256+x2)-32000)*0.01;
  $  002.电池组当前最大允许充电电流       $    $  A      $    $  ANS000.BYTE000  $  y=((x1*256+x2)-5000)*0.1;
  $  003.电池组当前最大允许放电电流       $    $  A      $    $  ANS000.BYTE002  $  y=((x1*256+x2)-5000)*0.1;

  $)  07.动力电池组管理系统发送信息3
  $  07.动力电池组管理系统发送信息3
  $  REQ000:0       $  ANS000:

  $  000.电池组当前最大允许充电电压       $    $  V          $    $  ANS000.BYTE0-4  $  y=(x1*256+x2)*0.1;
  $  001.电池组平均温度                   $    $  摄氏度     $    $  ANS000.BYTE0-2  $  y=x-40;
  $  002.电池组允许最高温度               $    $  摄氏度     $    $  ANS000.BYTE0-1  $  y=x-40;
  $  003.电池组允许最低温度               $    $  摄氏度     $    $  ANS000.BYTE000  $  y=x-40;
  $  004.电池组最高温度                   $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  005.母线外电压                       $    $  V          $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.1;

  $)  08.动力电池组管理系统发送信息4
  $  08.动力电池组管理系统发送信息4
  $  REQ000:0       $  ANS000:

  $  000.最高单体电压             $    $  V          $    $  ANS000.BYTE0-4  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)*0.001;
  $  001.最低单体电压             $    $  V          $    $  ANS000.BYTE0-2  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)*0.001;
  $  002.单体最高温度             $    $  摄氏度     $    $  ANS000.BYTE000  $  y=x-40;
  $  003.单体最低温度             $    $  摄氏度     $    $  ANS000.BYTE001  $  y=x-40;
  $  004.高压主负接触器状态       $    $             $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0147;else y=@0148;
  $  005.高压主正接触器状态       $    $             $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0145;else y=@0146;
  $  006.动力电池类型             $    $             $    $  ANS000.BYTE002  $  if((x&0x0C)==0x00) y=@014c;else if((x&0x0C)==0x04) y=@014d;else if((x&0x0C)==0x08) y=@014e;else y=@0076;
  $  007.慢充电子锁状态           $    $             $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@014a;else y=@014b;
  $  008.高压预充接触器状态       $    $             $    $  ANS000.BYTE002  $  if((x&0x20)==0x00) y=@00d0;else y=@00d1;
  $  009.预充电状态               $    $             $    $  ANS000.BYTE002  $  if((x&0x40)==0x00) y=@0030;else y=@0082;
  $  010.BMS弱电自检完成          $    $             $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0030;else y=@002f;
  $  011.SOH值                    $    $  %          $    $  ANS000.BYTE003  $  y=x;

  $)  09.动力电池组管理系统发送信息5
  $  09.动力电池组管理系统发送信息5
  $  REQ000:0       $  ANS000:

  $  000.剩余能量             $    $  kwh      $    $  ANS000.BYTE0-4  $  y=(x1*256+x2);
  $  001.绝缘电阻             $    $  千欧     $    $  ANS000.BYTE0-2  $  y=(x1*256+x2);
  $  002.电池均衡状态         $    $           $    $  ANS000.BYTE000  $  if((x&0x01)==0x00) y=@0137;else y=@0138;
  $  003.停机状态             $    $           $    $  ANS000.BYTE000  $  if((x&0x02)==0x00) y=@0135;else y=@0136;
  $  004.慢充充电状态         $    $           $    $  ANS000.BYTE000  $  if((x&0x0c)==0x00) y=@00cd;else if((x&0x0c)==0x04) y=@00ce;else if((x&0x0c)==0x08) y=@0085;else y=@00cf;
  $  005.快充充电状态         $    $           $    $  ANS000.BYTE000  $  if((x&0x30)==0x00) y=@00cd;else if((x&0x30)==0x10) y=@00ce;else if((x&0x30)==0x20) y=@0085;else y=@00cf;
  $  006.加热继电器状态       $    $           $    $  ANS000.BYTE000  $  if((x&0x40)==0x00) y=@00d5;else y=@013b;
  $  007.动力电池切断         $    $           $    $  ANS000.BYTE000  $  if((x&0x80)==0x00) y=@0139;else y=@013a;
  $  008.BMS硬件版本号        $    $           $    $  ANS000.BYTE002  $  y=x;
  $  009.BMS软件版本号        $    $           $    $  ANS000.BYTE003  $  y=x;

  $)  10.动力电池组管理系统发送信息6
  $  10.动力电池组管理系统发送信息6
  $  REQ000:0       $  ANS000:

  $  000.充电机输出电压         $    $  V       $    $  ANS000.BYTE0-4  $  y=(x1*256+x2)*0.1;
  $  001.充电机输出电流         $    $  A       $    $  ANS000.BYTE0-2  $  y=((x1*256+x2)-5000)*0.1;
  $  002.当次累计充电时间       $    $  分      $    $  ANS000.BYTE000  $  y=(x1*256+x2);
  $  003.当次已充电能量         $    $  kwh     $    $  ANS000.BYTE002  $  y=(x1*256+x2);

  $)  11.动力电池组管理系统发送信息16
  $  11.动力电池组管理系统发送信息16
  $  REQ000:0       $  ANS000:

  $  000.可充电储能子系统个数             $    $             $    $  ANS000.BYTE0-4  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  001.可充电储能系统编码长度           $    $  m          $    $  ANS000.BYTE0-3  $  if(x==0x00) y=@00d4;else y=x;
  $  002.最高电压电池子系统号             $    $             $    $  ANS000.BYTE0-2  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  003.最高电压电池单体代号             $    $             $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  004.最低电压电池子系统号             $    $             $    $  ANS000.BYTE000  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  005.最低电压电池单体代号             $    $             $    $  ANS000.BYTE001  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  006.最高温度子系统号                 $    $             $    $  ANS000.BYTE002  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  007.最高温度探针单体代号             $    $             $    $  ANS000.BYTE003  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  008.最低温度子系统号                 $    $             $    $  ANS000.BYTE0-4  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  009.最低温度探针子系统代号           $    $             $    $  ANS000.BYTE0-3  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  010.可充电储能装置故障总数N1         $    $             $    $  ANS000.BYTE0-2  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  011.可充电储能子系统号               $    $             $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;
  $  012.可充电储能温度探针个数           $    $             $    $  ANS000.BYTE000  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2);
  $  013.单体电池总数                     $    $             $    $  ANS000.BYTE002  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2);
  $  014.电池管理系统life                 $    $             $    $  ANS000.BYTE0-4  $  y=x;
  $  015.最大允许充电电压                 $    $             $    $  ANS000.BYTE0-3  $  y=(x1*256+x2);
  $  016.最大允许充电电流                 $    $             $    $  ANS000.BYTE0-1  $  y=(x1*256+x2);
  $  017.使能控制位                       $    $             $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@00d2;else y=@00d3;
  $  018.充电/加热模式位                  $    $             $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0114;else y=@0092;
  $  019.充电完成标志位                   $    $             $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@013e;else y=@0087;
  $  020.电池单体N编号                    $    $             $    $  ANS000.BYTE0-4  $  y=x;
  $  021.电池单体N电压                    $    $  V          $    $  ANS000.BYTE0-3  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)*0.001;
  $  022.电池单体N+1电压                  $    $  V          $    $  ANS000.BYTE0-1  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)*0.001;
  $  023.电池单体N+2电压                  $    $  V          $    $  ANS000.BYTE001  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)*0.001;
  $  024.电池温度探针N编号                $    $             $    $  ANS000.BYTE0-4  $  y=x;
  $  025.电池温度探针N+1温度              $    $  摄氏度     $    $  ANS000.BYTE0-3  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x-40;
  $  026.电池温度探针N+2温度              $    $  摄氏度     $    $  ANS000.BYTE0-2  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x-40;
  $  027.电池温度探针N+3温度              $    $  摄氏度     $    $  ANS000.BYTE0-1  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x-40;
  $  028.电池温度探针N+4温度              $    $  摄氏度     $    $  ANS000.BYTE000  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x-40;
  $  029.电池温度探针N+5温度              $    $  摄氏度     $    $  ANS000.BYTE001  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x-40;
  $  030.电池温度探针N+6温度              $    $  摄氏度     $    $  ANS000.BYTE002  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x-40;
  $  031.电池温度探针N+7温度              $    $  摄氏度     $    $  ANS000.BYTE003  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x-40;
  $  032.电池电压均衡故障                 $    $             $    $  ANS000.BYTE0-4  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  033.温度过高故障                     $    $             $    $  ANS000.BYTE0-4  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  034.预充失败                         $    $             $    $  ANS000.BYTE0-4  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  035.切断主负                         $    $             $    $  ANS000.BYTE0-4  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  036.总电流超限                       $    $             $    $  ANS000.BYTE0-4  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  037.平均电压超限                     $    $             $    $  ANS000.BYTE0-4  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  038.单体电池过压                     $    $             $    $  ANS000.BYTE0-4  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  039.单体电池欠压                     $    $             $    $  ANS000.BYTE0-4  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  040.容量低报警                       $    $             $    $  ANS000.BYTE0-3  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  041.下位机无响应报警(内部通讯)       $    $             $    $  ANS000.BYTE0-3  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  042.绝缘故障                         $    $             $    $  ANS000.BYTE0-3  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  043.电池温度均衡故障                 $    $             $    $  ANS000.BYTE0-3  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  044.SOC跳变故障                      $    $             $    $  ANS000.BYTE0-3  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  045.充电储能系统不匹配故障           $    $             $    $  ANS000.BYTE0-3  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  046.过充报警故障                     $    $             $    $  ANS000.BYTE0-3  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  047.SOC过高故障                      $    $             $    $  ANS000.BYTE0-3  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  048.实际容量                         $    $  Ah         $    $  ANS000.BYTE0-1  $  y=x;
  $  049.总电压过压                       $    $             $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  050.总电压欠压                       $    $             $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  051.电池单体一致性差报警             $    $             $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  052.MSD高压互锁故障                  $    $             $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  053.直流输出口高压互锁故障           $    $             $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0017;else y=@0053;
  $  054.VCU通讯故障                      $    $             $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0053;
  $  055.充电机通讯故障                   $    $             $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0053;
  $  056.温度过低故障                     $    $             $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0053;
  $  057.充电电流过大故障                 $    $             $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  058.放电电流过大故障                 $    $             $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  059.回馈电流过大故障                 $    $             $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  060.高压主负接触器粘连故障           $    $             $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0017;else y=@0053;
  $  061.高压预充接触器粘连故障           $    $             $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0017;else y=@0053;
  $  062.高压主正接触器粘连故障           $    $             $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0017;else y=@0053;
  $  063.电池包加热继电器粘连故障         $    $             $    $  ANS000.BYTE003  $  if((x&0x08)==0x00) y=@0017;else y=@0053;
  $  064.电池系统厂商编码1                $    $             $    $  ANS000.BYTE0-4  $  ASCII(X1);
  $  065.电池系统厂商编码2                $    $             $    $  ANS000.BYTE0-3  $  ASCII(X1);
  $  066.电池系统厂商编码3                $    $             $    $  ANS000.BYTE0-2  $  ASCII(X1);
  $  067.电池系统厂商编码4                $    $             $    $  ANS000.BYTE0-1  $  ASCII(X1);
  $  068.电池系统厂商编码5                $    $             $    $  ANS000.BYTE000  $  ASCII(X1);
  $  069.电池系统厂商编码6                $    $             $    $  ANS000.BYTE001  $  ASCII(X1);
  $  070.电池系统厂商编码7                $    $             $    $  ANS000.BYTE002  $  ASCII(X1);
  $  071.电池系统厂商编码8                $    $             $    $  ANS000.BYTE003  $  ASCII(X1);
  $  072.电池系统厂商编码09               $    $             $    $  ANS000.BYTE0-4  $  ASCII(X1);
  $  073.电池系统厂商编码10               $    $             $    $  ANS000.BYTE0-3  $  ASCII(X1);
  $  074.电池系统厂商编码11               $    $             $    $  ANS000.BYTE0-2  $  ASCII(X1);
  $  075.电池系统厂商编码12               $    $             $    $  ANS000.BYTE0-1  $  ASCII(X1);
  $  076.电池系统厂商编码13               $    $             $    $  ANS000.BYTE000  $  ASCII(X1);
  $  077.电池系统厂商编码14               $    $             $    $  ANS000.BYTE001  $  ASCII(X1);
  $  078.电池系统厂商编码15               $    $             $    $  ANS000.BYTE002  $  ASCII(X1);
  $  079.电池系统厂商编码16               $    $             $    $  ANS000.BYTE003  $  ASCII(X1);
  $  080.电池系统厂商编码17               $    $             $    $  ANS000.BYTE0-4  $  ASCII(X1);
  $  081.电池系统厂商编码18               $    $             $    $  ANS000.BYTE0-3  $  ASCII(X1);
  $  082.电池系统厂商编码19               $    $             $    $  ANS000.BYTE0-2  $  ASCII(X1);
  $  083.电池系统厂商编码20               $    $             $    $  ANS000.BYTE0-1  $  ASCII(X1);
  $  084.电池系统厂商编码21               $    $             $    $  ANS000.BYTE000  $  ASCII(X1);
  $  085.电池系统厂商编码22               $    $             $    $  ANS000.BYTE001  $  ASCII(X1);
  $  086.电池系统厂商编码23               $    $             $    $  ANS000.BYTE002  $  ASCII(X1);
  $  087.电池系统厂商编码24               $    $             $    $  ANS000.BYTE003  $  ASCII(X1);

;******************************************************************************************************************************************************

