
    车型ID：9f7a

    模拟：协议模拟-->9f7a

;******************************************************************************************************************************************************

    通讯线: $~02$~10$~250K$~18008FD0,1800D08F,1801D08F

进入命令:

  $~  REQ000:0       $~  ANS000:18008FD0

空闲命令:


退出命令:



;******************************************************************************************************************************************************

读数据流: 

  $)  00.整车控制器发送信息1
  $  00.整车控制器发送信息1
  $  REQ000:010220002400001c0047e80       $  ANS000:18008FD010220002400001c0047e80

  $  000.整车控制器life         $    $       $    $  ANS000.BYTE004  $  y=x;
  $  001.DCDC启停控制命令       $    $       $    $  ANS000.BYTE002  $  if((x&0x04)==0x01) y=@00b4;else if((x&0x04)==0x02) y=@00ba;else y=@0042;
  $  002.DCDC保护确认命令       $    $       $    $  ANS000.BYTE002  $  if((x&0x0c)==0x04) y=@0134;else y=@0042;
  $  003.停机指令               $    $       $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@0003;else y=@002e;

  $)  01.DCDC发送信息1
  $  01.DCDC发送信息1
  $  REQ000:010220002400001c0068478       $  ANS000:18008FD010220002400001c0068478

  $  000.DCDC的life           $    $             $    $  ANS000.BYTE001  $  y=x;
  $  001.低压端实时电压       $    $  V          $    $  ANS000.BYTE002  $  y=x*0.1;
  $  002.低压端实时电流       $    $  A          $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.1;
  $  003.变压器温度           $    $  摄氏度     $    $  ANS000.BYTE005  $  y=x-40;
  $  004.高压端实时电压       $    $  V          $    $  ANS000.BYTE006  $  y=(x1*256+x2)*0.1;
  $  005.DSP结温              $    $  摄氏度     $    $  ANS000.BYTE008  $  y=x-40;

  $)  02.DCDC发送信息2
  $  02.DCDC发送信息2
  $  REQ000:010220002400001c00e8478       $  ANS000:18008FD010220002400001c00e8478

  $  000.DCDC的life                 $    $       $    $  ANS000.BYTE004  $  y=x;
  $  001.工作状态                   $    $       $    $  ANS000.BYTE002  $  if((x&0x07)==0x00) y=@0042;else if((x&0x07)==0x01) y=@0124;else if((x&0x07)==0x02) y=@0021;else if((x&0x07)==0x03) y=@00b4;else if((x&0x07)==0x04) y=@0125;else if((x&0x07)==0x05) y=@0126;else if((x&0x07)==0x06) y=@0127;else y=@010d;
  $  002.DCDC故障等级               $    $       $    $  ANS000.BYTE002  $  if((x&0x30)==0x00) y=@0035;else if((x&0x30)==0x10) y=@0131;else if((x&0x30)==0x20) y=@0132;else y=@0133;
  $  003.DCDC水冷系统启动指令       $    $       $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0122;else y=@0123;
  $  004.高压过压                   $    $       $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0017;else y=@0041;
  $  005.高压欠压                   $    $       $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0017;else y=@0041;
  $  006.低压过压                   $    $       $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0017;else y=@0041;
  $  007.输出短路                   $    $       $    $  ANS000.BYTE003  $  if((x&0x08)==0x00) y=@0017;else y=@0041;
  $  008.过温                       $    $       $    $  ANS000.BYTE003  $  if((x&0x01)==0x10) y=@0017;else y=@0041;
  $  009.低压欠压                   $    $       $    $  ANS000.BYTE003  $  if((x&0x20)==0x00) y=@0017;else y=@0041;
  $  010.停机失败                   $    $       $    $  ANS000.BYTE003  $  if((x&0x40)==0x00) y=@0017;else y=@0041;
  $  011.低压端电流传感器故障       $    $       $    $  ANS000.BYTE003  $  if((x&0x80)==0x00) y=@0017;else y=@0041;
  $  012.温度传感器故障             $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@0017;else y=@0041;
  $  013.DCDC工作指令报文丢失       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00) y=@0017;else y=@0041;
  $  014.互锁故障                   $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00) y=@0017;else y=@0041;
  $  015.允许失败                   $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00) y=@0017;else y=@0041;
  $  016.DCDC限功率                 $    $       $    $  ANS000.BYTE004  $  if((x&0x10)==0x00) y=@00e6;else y=@00e7;
  $  017.停机状态                   $    $       $    $  ANS000.BYTE006  $  if((x&0x01)==0x00) y=@0135;else y=@0136;
  $  018.DCDC硬件版本号             $    $       $    $  ANS000.BYTE007  $  y=x;
  $  019.DCDC软件版本号             $    $       $    $  ANS000.BYTE008  $  y=x;

;******************************************************************************************************************************************************

