
    车型ID：9f7b

    模拟：协议模拟-->9f7b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~250K$~C00EFD0,C01EFD0,C00D0EF,C01D0EF,C02D0EF,C03D0EF,C04D0EF,C05D0EF

进入命令:

  $~  REQ000:0       $~  ANS000:C00EFD0

空闲命令:


退出命令:



;******************************************************************************************************************************************************

读数据流: 

  $)  00.整车控制器发送信息1
  $  00.整车控制器发送信息1
  $  REQ000:01022000240000160077e80       $  ANS000:C00EFD01022000240000160077e80

  $  000.整车控制器life              $    $            $    $  ANS000.BYTE001  $  y=x;
  $  001.急停开关状态                $    $            $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0180;else y=@0181;
  $  002.BMS将要切断主负接触器       $    $            $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@017e;else y=@017f;
  $  003.驱动命令                    $    $            $    $  ANS000.BYTE002  $  if((x&0x0c)==0x00) y=@0003;else if((x&0x0c)==0x04) y=@0184;else if((x&0x0c)==0x08) y=@0185;else y=@0003;
  $  004.运行控制命令                $    $            $    $  ANS000.BYTE002  $  if((x&0x30)==0x00) y=@00ba;else if((x&0x30)==0x10) y=@0182;else if((x&0x30)==0x20) y=@0183;else y=@0177;
  $  005.模式控制命令                $    $            $    $  ANS000.BYTE002  $  if((x&0x40)==0x00) y=@017a;else y=@017b;
  $  006.关闭/启动命令               $    $            $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0015;else y=@0014;
  $  007.电动机限制转速命令          $    $  r/min     $    $  ANS000.BYTE003  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)-20000;
  $  008.电机转矩命令                $    $  牛米      $    $  ANS000.BYTE005  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-20000)*0.1;
  $  009.车辆状态                    $    $            $    $  ANS000.BYTE007  $  if(x==0x10) y=@00c5;else if(x==0x20) y=@00c6;else if(x==0x30) y=@00c7;else if(x==0x50) y=@00c8;else if(x==0x60) y=@00c9;else y=@00ca;
  $  010.电容放电                    $    $            $    $  ANS000.BYTE008  $  if((x&0x01)==0x00) y=@0186;else y=@0150;
  $  011.预充电继电器状态            $    $            $    $  ANS000.BYTE008  $  if((x&0x02)==0x00) y=@001f;else y=@001e;
  $  012.主接触器状态                $    $            $    $  ANS000.BYTE008  $  if((x&0x04)==0x00) y=@001f;else y=@001e;

  $)  01.整车控制器发送信息2
  $  01.整车控制器发送信息2
  $  REQ000:010220002400001600f7e80       $  ANS000:C00EFD010220002400001600f7e80

  $  000.整车控制器life       $    $            $    $  ANS000.BYTE001  $  y=x;
  $  001.电池组总电压         $    $  V         $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.1;
  $  002.手刹信号             $    $            $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@00ec;else y=@00ed;
  $  003.脚刹信号             $    $            $    $  ANS000.BYTE004  $  if((x&0x02)==0x00) y=@00ea;else y=@00eb;
  $  004.档位状态             $    $            $    $  ANS000.BYTE004  $  if((x&0x0c)==0x00) y=@009f;else if((x&0x0c)==0x04) y=@0057;else if((x&0x0c)==0x08) y=@009e;else y=@0056;
  $  005.停机指令             $    $            $    $  ANS000.BYTE004  $  if((x&0x10)==0x00) y=@0003;else y=@002e;
  $  006.加速踏板信号         $    $            $    $  ANS000.BYTE004  $  if((x&0x20)==0x00) y=@0173;else y=@0174;
  $  007.蠕行模式             $    $            $    $  ANS000.BYTE004  $  if((x&0x40)==0x00) y=@00cb;else y=@00cc;
  $  008.蠕行目标转速         $    $  r/min     $    $  ANS000.BYTE005  $  y=(x1*256+x2);

  $)  02.电机控制器发送信息1
  $  02.电机控制器发送信息1
  $  REQ000:01022000240000160068778       $  ANS000:C00EFD01022000240000160068778

  $  000.预充电状态                   $    $             $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0030;else y=@002f;
  $  001.工作模式                     $    $             $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@017a;else y=@017b;
  $  002.正转/反转                    $    $             $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0178;else y=@0179;
  $  003.其他/空转                    $    $             $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0076;else y=@0177;
  $  004.允许关断主接触器             $    $             $    $  ANS000.BYTE001  $  if((x&0x10)==0x00) y=@0175;else y=@0176;
  $  005.电机控制器弱电自检完成       $    $             $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0030;else y=@002f;
  $  006.故障状态                     $    $             $    $  ANS000.BYTE001  $  if((x&0xC0)==0x00) y=@0035;else if((x&0xC0)==0x40) y=@0077;else if((x&0xC0)==0x80) y=@0078;else y=@0079;
  $  007.MCU的LIFE值                  $    $             $    $  ANS000.BYTE002  $  y=x;
  $  008.电机当前转速                 $    $  r/min      $    $  ANS000.BYTE003  $  if((x1*256+x2)==0xFFFF)y=@0003;else if((x1*256+x2)==0xFFFE)y=@0018;else y=x1*256+x2;
  $  009.电机温度                     $    $  摄氏度     $    $  ANS000.BYTE005  $  y=x-40;
  $  010.电机控制器温度               $    $  摄氏度     $    $  ANS000.BYTE006  $  y=x-40;
  $  011.电机当前转矩                 $    $             $    $  ANS000.BYTE007  $  if((x1*256+x2)==0xFFFF)y=@0003;else if((x1*256+x2)==0xFFFE)y=@0018;else if(x1<0x80) y=(x1*256+x2)*0.1;else y=(x1*256+x2)*0.1-6528;

  $)  03.电机控制器发送信息2
  $  03.电机控制器发送信息2
  $  REQ000:010220002400001600e8778       $  ANS000:C00EFD010220002400001600e8778

  $  000.电机的最大驱动功率         $    $  千瓦     $    $  ANS000.BYTE001  $  y=((x1*256+x2)-32000)*0.01;
  $  001.电机的最大制动力功率       $    $  千瓦     $    $  ANS000.BYTE003  $  y=((x1*256+x2)-32000)*0.01;
  $  002.电机的最大驱动转矩         $    $  牛米     $    $  ANS000.BYTE005  $  y=((x1*256+x2)-30000)*0.1;
  $  003.电机的最大制动转矩         $    $  牛米     $    $  ANS000.BYTE007  $  y=((x1*256+x2)-30000)*0.1;

  $)  04.电机控制器发送信息3
  $  04.电机控制器发送信息3
  $  REQ000:01022000240000160168778       $  ANS000:C00EFD01022000240000160168778

  $  000.电机直流电压             $    $  V     $    $  ANS000.BYTE001  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=(x1*256+x2)*0.1;
  $  001.电机相电流(有效值)       $    $  A     $    $  ANS000.BYTE003  $  y=((x1*256+x2)-5000)*0.1;
  $  002.电机相电压               $    $  V     $    $  ANS000.BYTE005  $  y=(x1*256+x2);
  $  003.电机控制器类型           $    $        $    $  ANS000.BYTE007  $  if((x&0x0f)==0x01) y=@00c4;else y=@0076;
  $  004.停机状态                 $    $        $    $  ANS000.BYTE007  $  if((x&0x10)==0x00) y=@0135;else y=@0136;
  $  005.驻坡模式状态             $    $        $    $  ANS000.BYTE007  $  if((x&0x20)==0x00) y=@016e;else y=@016f;
  $  006.电容放电状态             $    $        $    $  ANS000.BYTE007  $  if((x&0xc0)==0x00) y=@0042;else if((x&0xc0)==0x40) y=@016b;else if((x&0xc0)==0x80) y=@016c;else y=@016d;
  $  007.驱动电机状态             $    $        $    $  ANS000.BYTE008  $  if((x&0x03)==0x00) y=@0169;else if((x&0x03)==0x01) y=@016a;else if((x&0x03)==0x02) y=@0015;else y=@003e;

  $)  05.电机控制器发送信息4
  $  05.电机控制器发送信息4
  $  REQ000:010220002400001601e8778       $  ANS000:C00EFD010220002400001601e8778

  $  000.IGBT保护                     $    $       $    $  ANS000.BYTE001  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  001.驱动电源欠压保护             $    $       $    $  ANS000.BYTE001  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  002.上下桥直通保护               $    $       $    $  ANS000.BYTE001  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  003.IGBT过温保护                 $    $       $    $  ANS000.BYTE001  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  004.母线电流过流保护             $    $       $    $  ANS000.BYTE001  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  005.相电流过流保护               $    $       $    $  ANS000.BYTE001  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  006.控制电压欠压保护             $    $       $    $  ANS000.BYTE001  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  007.控制电压防反接保护           $    $       $    $  ANS000.BYTE002  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  008.控制器电压防过压保护         $    $       $    $  ANS000.BYTE002  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  009.dq电流过流保护               $    $       $    $  ANS000.BYTE002  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  010.母线电压欠压保护             $    $       $    $  ANS000.BYTE002  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  011.母线电压过压保护             $    $       $    $  ANS000.BYTE002  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  012.过扭矩保护                   $    $       $    $  ANS000.BYTE002  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  013.过载保护                     $    $       $    $  ANS000.BYTE002  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  014.堵转保护                     $    $       $    $  ANS000.BYTE002  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  015.驱动板过温保护               $    $       $    $  ANS000.BYTE003  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  016.电机超速保护                 $    $       $    $  ANS000.BYTE003  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  017.CAN通讯故障保护              $    $       $    $  ANS000.BYTE003  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  018.整车回路内阻故障             $    $       $    $  ANS000.BYTE003  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  019.缺相保护                     $    $       $    $  ANS000.BYTE003  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  020.旋变保护                     $    $       $    $  ANS000.BYTE003  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  021.硬件关断信号保护             $    $       $    $  ANS000.BYTE003  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  022.放电故障                     $    $       $    $  ANS000.BYTE003  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  023.霍尔电流故障                 $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  024.驱动上桥故障                 $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  025.驱动下桥故障                 $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  026.KL30电源电压过低             $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  027.电流检测故障                 $    $       $    $  ANS000.BYTE004  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  028.主动放电故障                 $    $       $    $  ANS000.BYTE004  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  029.相间短路故障                 $    $       $    $  ANS000.BYTE004  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  030.母线快速欠压故障             $    $       $    $  ANS000.BYTE004  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  031.硬件过压故障                 $    $       $    $  ANS000.BYTE005  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  032.驱动芯片初始化失败故障       $    $       $    $  ANS000.BYTE005  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  033.IGBT结温检测故障1            $    $       $    $  ANS000.BYTE005  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  034.IGBT结温检测故障2            $    $       $    $  ANS000.BYTE005  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  035.EEROM故障                    $    $       $    $  ANS000.BYTE005  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  036.电机控制器过热报警           $    $       $    $  ANS000.BYTE005  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  037.电机控制器过热故障           $    $       $    $  ANS000.BYTE005  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  038.电机过热报警                 $    $       $    $  ANS000.BYTE005  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  039.电机过热故障                 $    $       $    $  ANS000.BYTE006  $  if((x&0x01)==0x00) y=@0017;else y=@0170;
  $  040.点击温度传感器掉线故障       $    $       $    $  ANS000.BYTE006  $  if((x&0x02)==0x00) y=@0017;else y=@0170;
  $  041.操作顺序保护报警             $    $       $    $  ANS000.BYTE006  $  if((x&0x04)==0x00) y=@0017;else y=@0170;
  $  042.高速停机保护报警             $    $       $    $  ANS000.BYTE006  $  if((x&0x08)==0x00) y=@0017;else y=@0170;
  $  043.高速误挂挡保护报警           $    $       $    $  ANS000.BYTE006  $  if((x&0x10)==0x00) y=@0017;else y=@0170;
  $  044.大扭矩停机保护报警           $    $       $    $  ANS000.BYTE006  $  if((x&0x20)==0x00) y=@0017;else y=@0170;
  $  045.速度偏差过大故障             $    $       $    $  ANS000.BYTE006  $  if((x&0x40)==0x00) y=@0017;else y=@0170;
  $  046.母线欠压报警                 $    $       $    $  ANS000.BYTE006  $  if((x&0x80)==0x00) y=@0017;else y=@0170;
  $  047.母线过压报警                 $    $       $    $  ANS000.BYTE007  $  if((x&0x01)==0x00) y=@0017;else y=@0170;

  $)  06.电机控制器发送信息5
  $  06.电机控制器发送信息5
  $  REQ000:01022000240000160268778       $  ANS000:C00EFD01022000240000160268778

  $  000.电机直流电流               $    $  A      $    $  ANS000.BYTE001  $  if((x1*256+x2)==0xFFFE) y=@0018;else if((x1*256+x2)==0xFFFF) y=@0003;else y=((x1*256+x2)-10000)*0.1;
  $  001.电机功率                   $    $  Kw     $    $  ANS000.BYTE003  $  y=((x1*256+x2)-32000)*0.01;
  $  002.电机控制器硬件版本号       $    $         $    $  ANS000.BYTE007  $  y=x;
  $  003.电机控制器软件版本号       $    $         $    $  ANS000.BYTE008  $  y=x;

  $)  07.电机控制器发送信息6
  $  07.电机控制器发送信息6
  $  REQ000:010220002400001602e8778       $  ANS000:C00EFD010220002400001602e8778

  $  000.驱动电机个数                 $    $        $    $  ANS000.BYTE001  $  y=x;
  $  001.驱动电机序号                 $    $        $    $  ANS000.BYTE002  $  y=x;
  $  002.电机控制器输入电压           $    $  V     $    $  ANS000.BYTE003  $  if((x1*256+x2)==0xFFFE) y=@0003;else if((x1*256+x2)==0xFFFF) y=@0018;else y=((x1*256+x2)-60000)*0.1;
  $  003.电机控制器直流母线电流       $    $  A     $    $  ANS000.BYTE005  $  if((x1*256+x2)==0xFFFE) y=@0003;else if((x1*256+x2)==0xFFFF) y=@0018;else y=((x1*256+x2)-10000)*0.1;
  $  004.驱动电机故障总数N2           $    $        $    $  ANS000.BYTE007  $  if(x==0xFE) y=@0018;else if(x==0xFF) y=@0003;else y=x;

;******************************************************************************************************************************************************

