
     系统名称:TCM (波箱控制模块)

     系统ID:0000443D

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 03 00 00 00 00 00       $~ ANS000:7E9 02 10 03 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 01 00 00 00 00 00       $~ ANS000:7E9 02 10 01 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10365602&quot;: &quot;0000443C&quot;, &quot;10513229&quot;: &quot;0000443D&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10365602&quot;: &quot;0000443C&quot;, &quot;10513229&quot;: &quot;0000443D&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E1 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/0000443D

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ001:7E1 03 22 F1 90 00 00 00 00            $%  
  $%  REQ002:7E1 03 22 F1 87 00 00 00 00            $%  
  $%  REQ003:7E1 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ004:7E1 03 22 F1 91 00 00 00 00            $%  
  $%  REQ005:7E1 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ006:7E1 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ007:7E1 03 22 F1 83 00 00 00 00            $%  
  $%  REQ008:7E1 03 22 F1 92 00 00 00 00            $%  
  $%  REQ009:7E1 03 22 F1 94 00 00 00 00            $%  
  $%  REQ010:7E1 03 22 F1 8A 00 00 00 00            $%  
  $%  REQ011:7E1 03 22 F1 A2 00 00 00 00            $%  
  $%  REQ012:7E1 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ013:7E1 03 22 F1 10 00 00 00 00            $%  

  $%  000:电控单元序列号                  $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  001:车辆识别码(VIN)                 $%    $%  ANS001.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  002:电控单元零件号                  $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元制造日期                $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3); 
  $%  004:电控单元硬件号                  $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元应用软件号              $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元标定软件号              $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  007:电控单元基础软件参考号          $%    $%  ANS007.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  008:供应商电控单元硬件参考号        $%    $%  ANS008.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  009:电控单元软件参考号              $%    $%  ANS009.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  010:系统供应商标识号                $%    $%  ANS010.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  011:电控单元网络参考号              $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8); 
  $%  012:电控单元刷新过程文件号          $%    $%  ANS012.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  013:刷新工具参考号记录              $%    $%  ANS013.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  014:刷新里程数记录                  $%    $%  ANS013.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E1 03 22 B1 27 00 00 00 00            $  
  $  REQ001:7E1 03 22 B1 28 00 00 00 00            $  
  $  REQ002:7E1 03 22 B1 25 00 00 00 00            $  
  $  REQ003:7E1 03 22 B1 26 00 00 00 00            $  
  $  REQ004:7E1 03 22 B1 3C 00 00 00 00            $  
  $  REQ005:7E1 03 22 B1 35 00 00 00 00            $  
  $  REQ006:7E1 03 22 27 FF 00 00 00 00            $  
  $  REQ007:7E1 03 22 B3 3D 00 00 00 00            $  
  $  REQ008:7E1 03 22 28 B9 00 00 00 00            $  
  $  REQ009:7E1 03 22 28 E7 00 00 00 00            $  
  $  REQ010:7E1 03 22 B1 31 00 00 00 00            $  
  $  REQ011:7E1 03 22 B1 3D 00 00 00 00            $  
  $  REQ012:7E1 03 22 B3 39 00 00 00 00            $  
  $  REQ013:7E1 03 22 B3 11 00 00 00 00            $  
  $  REQ014:7E1 03 22 B3 35 00 00 00 00            $  
  $  REQ015:7E1 03 22 B3 12 00 00 00 00            $  
  $  REQ016:7E1 03 22 B3 36 00 00 00 00            $  
  $  REQ017:7E1 03 22 00 42 00 00 00 00            $  
  $  REQ018:7E1 03 22 23 E2 00 00 00 00            $  
  $  REQ019:7E1 03 22 23 E3 00 00 00 00            $  
  $  REQ020:7E1 03 22 36 32 00 00 00 00            $  
  $  REQ021:7E1 03 22 33 CE 00 00 00 00            $  
  $  REQ022:7E1 03 22 33 BB 00 00 00 00            $  
  $  REQ023:7E1 03 22 B1 0C 00 00 00 00            $  
  $  REQ024:7E1 03 22 B1 0D 00 00 00 00            $  
  $  REQ025:7E1 03 22 B1 2C 00 00 00 00            $  
  $  REQ026:7E1 03 22 B2 14 00 00 00 00            $  
  $  REQ027:7E1 03 22 B1 0A 00 00 00 00            $  
  $  REQ028:7E1 03 22 B1 09 00 00 00 00            $  
  $  REQ029:7E1 03 22 B1 08 00 00 00 00            $  
  $  REQ030:7E1 03 22 B1 0B 00 00 00 00            $  
  $  REQ031:7E1 03 22 B3 88 00 00 00 00            $  
  $  REQ032:7E1 03 22 B1 23 00 00 00 00            $  
  $  REQ033:7E1 03 22 B1 24 00 00 00 00            $  
  $  REQ034:7E1 03 22 B3 50 00 00 00 00            $  
  $  REQ035:7E1 03 22 B3 26 00 00 00 00            $  
  $  REQ036:7E1 03 22 B3 0D 00 00 00 00            $  
  $  REQ037:7E1 03 22 B1 51 00 00 00 00            $  
  $  REQ038:7E1 03 22 B3 0F 00 00 00 00            $  
  $  REQ039:7E1 03 22 11 41 00 00 00 00            $  
  $  REQ040:7E1 03 22 23 D2 00 00 00 00            $  
  $  REQ041:7E1 03 22 23 D1 00 00 00 00            $  
  $  REQ042:7E1 03 22 23 D0 00 00 00 00            $  
  $  REQ043:7E1 03 22 23 D3 00 00 00 00            $  
  $  REQ044:7E1 03 22 B1 3F 00 00 00 00            $  
  $  REQ045:7E1 03 22 33 81 00 00 00 00            $  
  $  REQ046:7E1 03 22 33 83 00 00 00 00            $  
  $  REQ047:7E1 03 22 33 86 00 00 00 00            $  
  $  REQ048:7E1 03 22 33 85 00 00 00 00            $  
  $  REQ049:7E1 03 22 33 84 00 00 00 00            $  
  $  REQ050:7E1 03 22 33 87 00 00 00 00            $  
  $  REQ051:7E1 03 22 33 80 00 00 00 00            $  
  $  REQ052:7E1 03 22 33 82 00 00 00 00            $  
  $  REQ053:7E1 03 22 B3 15 00 00 00 00            $  
  $  REQ054:7E1 03 22 B3 14 00 00 00 00            $  
  $  REQ055:7E1 03 22 B3 13 00 00 00 00            $  
  $  REQ056:7E1 03 22 B1 02 00 00 00 00            $  
  $  REQ057:7E1 03 22 B3 2C 00 00 00 00            $  
  $  REQ058:7E1 03 22 19 40 00 00 00 00            $  
  $  REQ059:7E1 03 22 19 4F 00 00 00 00            $  
  $  REQ060:7E1 03 22 B1 3E 00 00 00 00            $  

  $  000.传感器5V供电1电压                $    $  伏          $    $  ANS000.BYTE003  $  y=(x)*0.1; 
  $  001.传感器5V供电2电压                $    $  伏          $    $  ANS001.BYTE003  $  y=(x)*0.1; 
  $  002.传感器9V供电1电压                $    $  伏          $    $  ANS002.BYTE003  $  y=(x)*0.1; 
  $  003.传感器9V供电2电压                $    $  伏          $    $  ANS003.BYTE003  $  y=(x)*0.1; 
  $  004.加速踏板位置                     $    $  百分比      $    $  ANS004.BYTE003  $  y=(x)*0.39216; 
  $  005.附件电压                         $    $  伏          $    $  ANS005.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  006.液压油压力                       $    $  巴          $    $  ANS006.BYTE003  $  y=(x1*256+x2)*0.000111111111111111; 
  $  007.自学习完成标志                   $    $              $    $  ANS007.BYTE003  $  switxh((x1*256+x2)&256)0x100:@0021;0x00:@0022; 
  $  008.液压油泵电机实际转速             $    $  转/分钟     $    $  ANS008.BYTE003  $  y=(x1*256+x2)*3-30000; 
  $  009.液压油泵电机期望转速             $    $  转/分钟     $    $  ANS009.BYTE003  $  y=(x1*256+x2)*3-30000; 
  $  010.电池电压                         $    $  伏特        $    $  ANS010.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  011.制动踏板位置                     $    $  百分比      $    $  ANS011.BYTE003  $  y=(x)*0.39216; 
  $  012.离合器入口冷却油油温             $    $  摄氏度      $    $  ANS012.BYTE003  $  y=(x)*1-40; 
  $  013.奇数离合器压力电磁阀压力         $    $  巴          $    $  ANS013.BYTE003  $  y=(x1*256+x2)*1.25; 
  $  014.奇数离合器摩擦功                 $    $  千焦        $    $  ANS014.BYTE003  $  y=(x1*256+x2)*1; 
  $  015.偶数离合器压力电磁阀压力         $    $  巴          $    $  ANS015.BYTE003  $  y=(x1*256+x2)*1.25; 
  $  016.偶数离合器摩擦功                 $    $  千焦        $    $  ANS016.BYTE003  $  y=(x1*256+x2)*1; 
  $  017.控制模块电压                     $    $  伏          $    $  ANS017.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  018.奇数离合器滑磨量                 $    $  转/分钟     $    $  ANS018.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.125;elsey=(x1*256+x2-0xFFFF)*0.125; 
  $  019.偶数离合器滑磨量                 $    $  转/分钟     $    $  ANS019.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.125;elsey=(x1*256+x2-0xFFFF)*0.125; 
  $  020.液压油泵电机继电器接合状态       $    $              $    $  ANS020.BYTE003  $  switxh(x&0x80)0x80:@0021;0x00:@0022; 
  $  021.液压油泵电机继电器打开           $    $              $    $  ANS020.BYTE003  $  switxh(x&0x40)0x40:@0021;0x00:@0022; 
  $  022.奇数离合器估算温度               $    $  摄氏度      $    $  ANS021.BYTE003  $  y=(x)*4-40; 
  $  023.偶数离合器估算温度               $    $  摄氏度      $    $  ANS022.BYTE003  $  y=(x)*4-40; 
  $  024.奇数离合器估算扭矩               $    $  牛米        $    $  ANS023.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  025.偶数离合器估算扭矩               $    $  牛米        $    $  ANS024.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  026.实际发动机扭矩                   $    $  牛米        $    $  ANS025.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  027.发动机冷却液温度                 $    $  摄氏度      $    $  ANS026.BYTE003  $  y=(x)*1-40; 
  $  028.发动机转速                       $    $  转/分       $    $  ANS027.BYTE003  $  y=(x1*256+x2)*1; 
  $  029.奇数挡输入轴转速                 $    $  转/分钟     $    $  ANS028.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  030.偶数挡输入轴转速                 $    $  转/分钟     $    $  ANS029.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  031.输出轴转速                       $    $  转/分       $    $  ANS030.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  032.挂档失败次数-1挡                 $    $              $    $  ANS031.BYTE005  $  y=(x1*256+x2)*1; 
  $  033.挂档失败次数-2挡                 $    $              $    $  ANS031.BYTE007  $  y=(x1*256+x2)*1; 
  $  034.挂档失败次数-3挡                 $    $              $    $  ANS031.BYTE009  $  y=(x1*256+x2)*1; 
  $  035.挂档失败次数-4挡                 $    $              $    $  ANS031.BYTE011  $  y=(x1*256+x2)*1; 
  $  036.挂档失败次数-5挡                 $    $              $    $  ANS031.BYTE013  $  y=(x1*256+x2)*1; 
  $  037.挂档失败次数-6挡                 $    $              $    $  ANS031.BYTE015  $  y=(x1*256+x2)*1; 
  $  038.挂档失败次数-7挡                 $    $              $    $  ANS031.BYTE017  $  y=(x1*256+x2)*1; 
  $  039.挂档失败次数-R挡                 $    $              $    $  ANS031.BYTE003  $  y=(x1*256+x2)*1; 
  $  040.电磁阀供电1电压                  $    $  伏          $    $  ANS032.BYTE003  $  y=(x)*0.1; 
  $  041.电磁阀供电2电压                  $    $  伏          $    $  ANS033.BYTE003  $  y=(x)*0.1; 
  $  042.电磁阀供电3电压                  $    $  伏          $    $  ANS034.BYTE003  $  y=(x)*0.1; 
  $  043.液压油温传感器供电               $    $  伏          $    $  ANS035.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  044.P/N挡信号电压                    $    $  伏          $    $  ANS036.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  045.奇数挡输入轴挂挡状态             $    $              $    $  ANS037.BYTE003  $  switxh(x)0x00:@0ce6;0x01:@00e9;0x02:@098c;0x03:@00eb;0x04:@00ec;0x05:@00ed;0x06:@00ee;0x07:@0069;0x0A:@007c;0x0B:@0ce7;0x0C:@0912;0x0D:@0ce8;0x0E:@0ce9;0x0F:@0cea;0x10:@0ceb;0x11:@0cec;0x12:@0ced;0x13:@0cee;0x18:@0cef;0x19:@0cf0;0x1A:@0cf1; 
  $  046.偶数挡输入轴挂挡状态             $    $              $    $  ANS037.BYTE004  $  switxh(x)0x00:@0ce6;0x01:@00e9;0x02:@098c;0x03:@00eb;0x04:@00ec;0x05:@00ed;0x06:@00ee;0x07:@0069;0x0A:@007c;0x0B:@0ce7;0x0C:@0912;0x0D:@0ce8;0x0E:@0ce9;0x0F:@0cea;0x10:@0ceb;0x11:@0cec;0x12:@0ced;0x13:@0cee;0x18:@0cef;0x19:@0cf0;0x1A:@0cf1; 
  $  047.驻车执行机构位置                 $    $  %           $    $  ANS038.BYTE003  $  y=(x1*256+x2)*0.002; 
  $  048.KL15(IGN)电路电压                $    $  伏          $    $  ANS039.BYTE003  $  y=(x)*0.1; 
  $  049.3/5挡拨叉位置                    $    $  毫米        $    $  ANS040.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  050.2/6挡拨叉位置                    $    $  毫米        $    $  ANS041.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  051.7/1挡拨叉位置                    $    $  毫米        $    $  ANS042.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  052.R/4挡拨叉位置                    $    $  毫米        $    $  ANS043.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  053.车辆坡度计算值                   $    $  %           $    $  ANS044.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  054.偶数挡支路压力电磁阀电流         $    $  安培        $    $  ANS045.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  055.偶数挡离合器压力电磁阀电流       $    $  安培        $    $  ANS046.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  056.3/5挡拨叉流量电磁阀电流          $    $  安培        $    $  ANS047.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  057.2/6挡拨叉流量电磁阀电流          $    $  安培        $    $  ANS048.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  058.7/1挡拨叉流量电磁阀电流          $    $  安培        $    $  ANS049.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  059.R/4挡拨叉流量电磁阀电流          $    $  安培        $    $  ANS050.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  060.奇数挡支路压力电磁阀电流         $    $  安培        $    $  ANS051.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  061.奇数挡离合器压力电磁阀电流       $    $  安培        $    $  ANS052.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  062.驻车电磁阀指令打开               $    $              $    $  ANS053.BYTE003  $  switxh(x&0x80)0x80:@0021;0x00:@0022; 
  $  063.驻车电磁阀控制电流               $    $  安培        $    $  ANS054.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  064.驻车解锁压力电磁阀电流           $    $  安培        $    $  ANS055.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  065.实际档位                         $    $              $    $  ANS056.BYTE004  $  switxh(x)0x00:@0cdc;0x01:@0010;0x02:@0011;0x03:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x07:@0069;0x0A:@007c;0x0B:@01b1;0x0C:@0912;0x0D:@0010;0x0E:@0011;0x0F:@0012;0x10:@0013;0x11:@0014;0x12:@0015;0x13:@0069;0x18:@0912;0x19:@0cdd;0x1A:@0cde; 
  $  066.期望挡位                         $    $              $    $  ANS056.BYTE003  $  switxh(x)0x00:@0cdc;0x01:@0010;0x02:@0011;0x03:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x07:@0069;0x0A:@007c;0x0B:@01b1;0x0C:@0912;0x0D:@0010;0x0E:@0011;0x0F:@0012;0x10:@0013;0x11:@0014;0x12:@0015;0x13:@0069;0x18:@0912;0x19:@0cdd;0x1A:@0cde; 
  $  067.液压油泵电机温度                 $    $  摄氏度      $    $  ANS057.BYTE003  $  y=(x)*1-40; 
  $  068.液压油温度                       $    $  摄氏度      $    $  ANS058.BYTE003  $  y=(x)*1-40; 
  $  069.变速器挡位                       $    $              $    $  ANS059.BYTE003  $  switxh(x)0x00:@01b1;0x01:@0939;0x02:@0912;0x03:@007c;0x04:@074d; 
  $  070.车速                             $    $  千米/时     $    $  ANS060.BYTE003  $  y=(x1*256+x2)*0.1; 

;******************************************************************************************************************************************************

