$~#7$~#7$~10400
;******************************************************************************************************************************************************

车型代号:CN100MCE
车型:五菱宏光
排量:1.2L
年份:2014
模块名缩写:ECM
模块名:发动机模块
供应商:西门子
诊断代码:CN100_1.2_2014_ECM_K
ECU地址:11
初始化方式:快速初始化
初始化头字节格式:80
其他服务头字节格式:80

;******************************************************************************************************************************************************
激活命令

	$~	REQ000: 80 11 F1 01 81 04          $~           11 F1 01 81 04

;******************************************************************************************************************************************************
退出命令

	$@	REQ000: 80 11 F1 01 82 05          $@

;******************************************************************************************************************************************************
空闲命令

	$!	REQ000: 80 11 F1 01 3E C1          $!

;******************************************************************************************************************************************************
$#读当前故障码

	$#	REQ000: 80 11 F1 04 18 00 FF 00 9D          $#

				规律:帧长决定故障码个数，$#BYTE02$#开始表示故障码，每$#3$#个字节表示一个故障码,前$#2$#个字节表示码号,后1个字节表示状态位。

				状态位-->当前:0xc,历史:0x0,间歇:-

		$*$*DTC/WLHGDTCS


;******************************************************************************************************************************************************
$#读历史故障码

	$#	REQ000: 80 11 F1 04 18 00 FF 00 9D          $#

				规律:帧长决定故障码个数，$#BYTE02$#开始表示故障码，每$#3$#个字节表示一个故障码,前$#2$#个字节表示码号,后1个字节表示状态位。

				状态位-->当前:0xc,历史:0x0,间歇:-

;******************************************************************************************************************************************************
清除故障码

	$$	REQ000: 80 11 F1 03 14 FF 00 98          $$

;******************************************************************************************************************************************************
模块信息

	$%	REQ000: 80 11 F1 02 21 80 25          $%

  $%  000:ECU 序列号           $%    $%  ANS000.BYTE002  $%  12个字节的ASCII显示
  $%  001:ECU 硬件号           $%    $%  ANS000.BYTE014  $%  16个字节的ASCII显示
  $%  002:ECU 出厂码           $%    $%  ANS000.BYTE030  $%  04个字节的ASCII显示
  $%  003:引导程序版本号       $%    $%  ANS000.BYTE034  $%  16个字节的ASCII显示
  $%  004:适用软件版本号       $%    $%  ANS000.BYTE050  $%  16个字节的ASCII显示
  $%  005:标定版本号           $%    $%  ANS000.BYTE066  $%  16个字节的ASCII显示
  $%  006:VIN码                $%    $%  ANS000.BYTE082  $%  17个字节的ASCII显示

;******************************************************************************************************************************************************
数据流

	$	REQ000: 80 11 F1 02 21 01 A6          $
	$	REQ001: 80 11 F1 02 21 03 A8          $

  $  000.离合开关状态                                     $    $  -          $    $  ANS000.BYTE074  $  if(X1&0x1)y=@0200;else y=@0199;
  $  001.制动激活状态                                     $    $  -          $    $  ANS000.BYTE074  $  if(X1&0x2)y=@0202;else y=@0201;
  $  002.制动测试开关状态                                 $    $  -          $    $  ANS000.BYTE074  $  if(X1&0x4)y=@0204;else y=@0203;
  $  003.空调压缩机离合器状态                             $    $  -          $    $  ANS000.BYTE075  $  if(X1&0x1)y=@0206;else y=@0205;
  $  004.主继电器控制指令状态                             $    $  -          $    $  ANS000.BYTE075  $  if(X1&0x8)y=@0208;else y=@0207;
  $  005.电动燃油泵状态                                   $    $  -          $    $  ANS000.BYTE075  $  if(X1&0x10)y=@0210;else y=@0209;
  $  006.启动继电器状态                                   $    $  -          $    $  ANS000.BYTE075  $  if(X1&0x20)y=@0212;else y=@0211;
  $  007.可变进气歧管驱动器激活标示位状态                 $    $  0          $    $  ANS000.BYTE075  $  if(X1&0x40)y=@0214;else y=@0213;
  $  008.故障指示灯状态                                   $    $  0          $    $  ANS000.BYTE076  $  if(X1&0x2)y=@0216;else y=@0215;
  $  009.氧传感器控制的激活标志状态                       $    $  0          $    $  ANS000.BYTE076  $  if(X1&0x20)y=@0218;else y=@0217;
  $  010.空调压力开关状态                                 $    $  0          $    $  ANS000.BYTE133  $  if(X1&0x10)y=@0220;else y=@0219;
  $  011.爆震标示位状态                                   $    $  0          $    $  ANS000.BYTE155  $  if(X1&0x1)y=@0222;else y=@0221;
  $  012.VVT的状态                                        $    $  0          $    $  ANS000.BYTE169  $  00:被动		01:准备		02:行动自适应		03:使用		04:跛行回家		其他:-
  $  013.VVT的驱动PWM状态                                 $    $  0          $    $  ANS000.BYTE170  $  00:保持		01:行动		02:被动		其他:-
  $  014.节气门位置传感器1原始电压                        $    $  V          $    $  ANS000.BYTE002  $  [0000-7FFF]:XY*0.0001526+0		[8000-FFFF]:(XY-65535)*0.0001526+0
  $  015.节气门位置传感器2原始电压                        $    $  V          $    $  ANS000.BYTE004  $  [0000-7FFF]:XY*0.0001526+0		[8000-FFFF]:(XY-65535)*0.0001526+0
  $  016.加速踏板传感器1电压                              $    $  V          $    $  ANS000.BYTE006  $  XY*0.0048828125
  $  017.加速踏板传感器2电压                              $    $  V          $    $  ANS000.BYTE008  $  XY*0.0048828125
  $  018.所有可用冷却液温度传感器的原始电压               $    $  V          $    $  ANS000.BYTE010  $  XY*0.000152588
  $  019.进气温度温度传感器电压                           $    $  V          $    $  ANS000.BYTE014  $  XY*0.000152588
  $  020.参数返回数字化电压值                             $    $  V          $    $  ANS000.BYTE016  $  XY*0.000152588
  $  021.点火开关后电池电压                               $    $  V          $    $  ANS000.BYTE022  $  XY*0.00062561
  $  022.空气压力传感器电压                               $    $  V          $    $  ANS000.BYTE028  $  XY*0.0001526
  $  023.PSTE压力传感器电压                               $    $  V          $    $  ANS000.BYTE030  $  XY*0.0001526
  $  024.节气门位置传感器                                 $    $  oTPS       $    $  ANS000.BYTE038  $  X*0.4668254
  $  025.油门踏板值                                       $    $  %          $    $  ANS000.BYTE039  $  XY*0.0976562
  $  026.发动机冷却液温度                                 $    $  C°        $    $  ANS000.BYTE041  $  X*0.75-48
  $  027.进气温度                                         $    $  C°        $    $  ANS000.BYTE043  $  X*0.75-48
  $  028.环境（大气）压力                                 $    $  hPa        $    $  ANS000.BYTE044  $  XY*0.08291752
  $  029.歧管空气压力                                     $    $  hPa        $    $  ANS000.BYTE046  $  XY*0.08291752
  $  030.节气门上游压力                                   $    $  hPa        $    $  ANS000.BYTE048  $  XY*0.08291752
  $  031.电瓶电压                                         $    $  V          $    $  ANS000.BYTE050  $  X*0.1015625
  $  032.上游氧传感器信号电压                             $    $  V          $    $  ANS000.BYTE051  $  XY*0.00488281
  $  033.下游氧传感器信号电压                             $    $  V          $    $  ANS000.BYTE053  $  XY*0.00488281
  $  034.变速箱档位                                       $    $  -          $    $  ANS000.BYTE055  $  X
  $  035.空调压力                                         $    $  V          $    $  ANS000.BYTE057  $  X*12.156863
  $  036.动力转向                                         $    $  [bar]      $    $  ANS000.BYTE058  $  XY*0.25
  $  037.爆震控制信号[0]                                  $    $  V          $    $  ANS000.BYTE062  $  XY*0.0000763
  $  038.爆震控制信号[1]                                  $    $  V          $    $  ANS000.BYTE064  $  XY*0.0000763
  $  039.爆震控制信号[2]                                  $    $  V          $    $  ANS000.BYTE066  $  XY*0.0000763
  $  040.爆震控制信号[3]                                  $    $  V          $    $  ANS000.BYTE068  $  XY*0.0000763
  $  041.车辆速度                                         $    $  km/h       $    $  ANS000.BYTE070  $  X
  $  042.交流发电机PWM（脉宽调制）                        $    $  [%]        $    $  ANS000.BYTE071  $  X*0.390625
  $  043.发动机转速                                       $    $  rpm        $    $  ANS000.BYTE072  $  XY
  $  044.上游氧传感器加热器PWM（脉宽调制）                $    $  %          $    $  ANS000.BYTE077  $  X*0.3906
  $  045.下游氧传感器加热器                               $    $  %          $    $  ANS000.BYTE078  $  X*0.3906
  $  046.修正后碳罐电磁阀开启PWM（脉宽调制）信号          $    $  %          $    $  ANS000.BYTE079  $  X*0.390625
  $  047.可变气门正时的脉宽调制（进气侧）                 $    $  %          $    $  ANS000.BYTE082  $  XY*0.0061035156
  $  048.所有可用的冷却风扇的功率输出                     $    $  %          $    $  ANS000.BYTE090  $  X*0.392
  $  049.发动机目标怠速                                   $    $  rpm        $    $  ANS000.BYTE095  $  XY
  $  050.实际执行的气缸独立喷射时间[0]                    $    $  ms         $    $  ANS000.BYTE097  $  XY*0.004
  $  051.实际执行的气缸独立喷射时间[1]                    $    $  ms         $    $  ANS000.BYTE099  $  XY*0.004
  $  052.实际执行的气缸独立喷射时间[2]                    $    $  ms         $    $  ANS000.BYTE101  $  XY*0.004
  $  053.实际执行的气缸独立喷射时间[3]                    $    $  ms         $    $  ANS000.BYTE103  $  XY*0.004
  $  054.来自氧传感器自适应输出的燃油质量设定值系数       $    $  %          $    $  ANS000.BYTE107  $  [0000-7FFF]:XY*0.00152588+0		[8000-FFFF]:(XY-65535)*0.00152588+0
  $  055.所有气缸点火角度实际值的平均值                   $    $  °CRK      $    $  ANS000.BYTE109  $  X*0.375-35.625
  $  056.带有自适应的爆震控制的总点火延迟[0]              $    $  °CRK      $    $  ANS000.BYTE110  $  X*0.375-48
  $  057.带有自适应的爆震控制的总点火延迟[1]              $    $  °CRK      $    $  ANS000.BYTE111  $  X*0.375-48
  $  058.带有自适应的爆震控制的总点火延迟[2]              $    $  °CRK      $    $  ANS000.BYTE112  $  X*0.375-48
  $  059.带有自适应的爆震控制的总点火延迟[3]              $    $  °CRK      $    $  ANS000.BYTE113  $  X*0.375-48
  $  060.空调蒸发器温度传感器电压值                       $    $  V          $    $  ANS000.BYTE114  $  XY*0.000152588
  $  061.空调蒸发温度                                     $    $  C°        $    $  ANS000.BYTE116  $  X*0.75-48
  $  062.进气量                                           $    $  kg/h       $    $  ANS000.BYTE125  $  XY*0.03125
  $  063.进气量                                           $    $  mg/stk     $    $  ANS000.BYTE127  $  XY*0.02119478
  $  064.基本充气效率偏移量的高原修正量                   $    $  -          $    $  ANS000.BYTE129  $  XY*0.000030517578125
  $  065.基本充气效率斜率的高原修正量                     $    $  -          $    $  ANS000.BYTE131  $  XY*0.000030517578125
  $  066.1缸的空燃比修正量                                $    $  %          $    $  ANS000.BYTE143  $  [0000-7FFF]:XY*0.001525878+0		[8000-FFFF]:(XY-65535)*0.001525878+0
  $  067.空燃比修正的燃油量                               $    $  mg/stk     $    $  ANS000.BYTE145  $  [0000-7FFF]:XY*0.021194781+0		[8000-FFFF]:(XY-65535)*0.021194781+0
  $  068.ETC执行器的占空比                                $    $  %          $    $  ANS000.BYTE147  $  [0000-7FFF]:XY*0.00305175+0		[8000-FFFF]:(XY-65535)*0.00305175+0
  $  069.碳罐负荷                                         $    $  -          $    $  ANS000.BYTE149  $  XY*0.000030517578125
  $  070.节气门位置的目标值                               $    $  °TPS      $    $  ANS000.BYTE151  $  XY*0.00729414
  $  071.点火线圈初级线圈的通电时间                       $    $  ms         $    $  ANS000.BYTE153  $  XY*0.004
  $  072.车辆累计总里程                                   $    $  Km         $    $  ANS000.BYTE156  $  X1X2X3X4*0.1
  $  073.机油温度（模型）                                 $    $  °C        $    $  ANS000.BYTE165  $  X*1-40 
  $  074.VVT的实际位置                                    $    $  °CRK      $    $  ANS000.BYTE166  $  [0000-7FFF]:XY*0.0078125+0		[8000-FFFF]:(XY-65535)*0.0078125+0
  $  075.VVT的目标位置                                    $    $  °CRK      $    $  ANS000.BYTE168  $  X*0.5
  $  076.停机时刻的冷却液温度                             $    $  °C        $    $  ANS001.BYTE055  $  X*0.75-48
  $  077.额外的节气门进气量修正量                         $    $  cm²         $    $  ANS001.BYTE056  $  [0000-7FFF]:XY*0.00089407+0		[8000-FFFF]:(XY-65535)*0.00089407+0
  $  078.节气门位置自学习的总修正                         $    $  %          $    $  ANS001.BYTE062  $  [0000-7FFF]:XY*0.00152588+0		[8000-FFFF]:(XY-65535)*0.00152588+0
  $  079.空燃比的修正量                                   $    $  %          $    $  ANS001.BYTE171  $  [0000-7FFF]:XY*0.00305176+0		[8000-FFFF]:(XY-65535)*0.00305176+0
  $  080.空燃比修正的燃油修正量                           $    $  mg/stk     $    $  ANS001.BYTE177  $  [0000-7FFF]:XY*0.0211948+0		[8000-FFFF]:(XY-65535)*0.0211948+0
  $  081.基本怠速控制的扭矩学习值                         $    $  Nm         $    $  ANS001.BYTE181  $  [00000000-7FFFFFFF]:X1X2X3X4*0.000000476837+0		[800000-FFFFFF]:(X1X2X3X4-4294967295)*0.000000476837+0
  $  082.空调压缩机引起的扭矩损失                         $    $  Nm         $    $  ANS001.BYTE189  $  [00000000-7FFFFFFF]:X1X2X3X4*0.000000476837+0		[800000-FFFFFF]:(X1X2X3X4-4294967295)*0.000000476837+0

