$~#6$~#14$~500$~738
;******************************************************************************************************************************************************

车型代号:CN113R
车型:CONFERO 
排量:1.5L
年份:2017
模块名缩写:SDM
模块名:安全气囊系统
供应商:奥托立夫
诊断代码:CN113R_1.5L_2017_SDM_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:730  02 10 01 00 00 00 00 00          $~          738  02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:730  02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:730  02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:730  03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/CONFERO SDTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:730  04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:730  02 11 03 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:730  03 22 F1 8B 00 00 00 00          $%
	$%	REQ001:730  03 22 F1 90 00 00 00 00          $%
	$%	REQ002:730  03 22 F1 93 00 00 00 00          $%
	$%	REQ003:730  03 22 F1 95 00 00 00 00          $%
	$%	REQ004:730  03 22 F1 B2 00 00 00 00          $%
	$%	REQ005:730  03 22 F1 CB 00 00 00 00          $%

  $%  000:ECU Manufacturing Date                     $%    $%  ANS000.BYTE003  $%  04个字节的HEX显示
  $%  001:VIN                                        $%    $%  ANS001.BYTE003  $%  17个字节的ASCII显示
  $%  002:Supplier ECU Hardware Version Number       $%    $%  ANS002.BYTE003  $%  02个字节的HEX显示
  $%  003:Supplier ECU Software Version Number       $%    $%  ANS003.BYTE003  $%  02个字节的HEX显示
  $%  004:Vehicle Manufacturing Date                 $%    $%  ANS004.BYTE003  $%  04个字节的HEX显示
  $%  005:End Model Part Number                      $%    $%  ANS005.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

 $ 00.Real-time Data

	$	REQ000:730  03 22 51 00 00 00 00 00          $
	$	REQ001:730  03 22 51 01 00 00 00 00          $

  $  000.Front Airbag Driver value          $    $  Ohm     $    $  ANS000.BYTE004  $  X*0.256
  $  001.Front Airbag Passenger value       $    $  Ohm     $    $  ANS000.BYTE006  $  X*0.256
  $  002.Battery voltage                    $    $  V       $    $  ANS001.BYTE006  $  X*0.256
  $  003.Energy reserve voltage             $    $  V       $    $  ANS001.BYTE007  $  X*0.256
  $  004.Ignition Cycle counter             $    $  -       $    $  ANS001.BYTE008  $  X1X2X3X4

 $ 01.Status Data

	$	REQ000:730  03 22 51 01 00 00 00 00          $

  $  000.Buckle Switch Driver real time status-Configure          $    $  -     $    $  ANS000.BYTE003  $  X&60		00:Defec		20:OK		40:Not Configured		60:-		
  $  001.Buckle Switch Driver real time status-Belted             $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x10)y=@0247;else y=@0246;
  $  002.Buckle Switch Passenger real time status-Configure       $    $  -     $    $  ANS000.BYTE003  $  X&06		00:Defec		02:OK		04:Not Configured		06:-		
  $  003.Buckle Switch Passenger real time status-Belted          $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x1)y=@0247;else y=@0246;
  $  004.Passenger Presence Detection status-Configured           $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x2)y=@0248;else y=@0245;
  $  005.Passenger Presence Detection status-Sitting              $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x1)y=@0016;else y=@0006;
  $  006.PADS Switch status- Configured                           $    $  -     $    $  ANS000.BYTE005  $  X&06		00:Defec		02:OK		04:Not Configured		06:-		
  $  007.PADS Switch status                                       $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x1)y=@0250;else y=@0249;


