$~#7$~#7$~10400
;******************************************************************************************************************************************************

车型代号:N310
车型:五菱宏光
排量:1.5L
年份:2011
模块名缩写:ABS
模块名:防抱死系统
供应商:博世
诊断代码:CN110V_EN_2019_ABS_BOSH_K
ECU地址:28
初始化方式:快速初始化
初始化头字节格式:80
其他服务头字节格式:80

;******************************************************************************************************************************************************
激活命令

	$~	REQ000: 80 28 F1 01 81 1B          $~           28 F1 01 81 1B

;******************************************************************************************************************************************************
退出命令

	$@	REQ000: 80 28 F1 01 82 1C          $@

;******************************************************************************************************************************************************
空闲命令

	$!	REQ000: 80 28 F1 02 3E 00 D9          $!

;******************************************************************************************************************************************************
$#读当前故障码

	$#	REQ000: 80 28 F1 02 18 01 B4          $#

				规律:帧长决定故障码个数，$#BYTE02$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号,后1个字节表示状态位。

				状态位-->当前:0x1,历史:0x3,间歇:0x2

		$*$*DTC/ALLDTCCODE


;******************************************************************************************************************************************************
$#读历史故障码

	$#	REQ000: 80 28 F1 02 18 02 B5          $#

				规律:帧长决定故障码个数，$#BYTE02$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号,后1个字节表示状态位。

				状态位-->当前:0x1,历史:0x3,间歇:0x2

;******************************************************************************************************************************************************
清除故障码

	$$	REQ000: 80 28 F1 04 14 FF FF FF AE          $$

;******************************************************************************************************************************************************
模块信息

	$%	REQ000: 80 28 F1 02 21 80 3C          $%

  $%  000:Name of the car                                $%    $%  ANS000.BYTE002  $%  05个字节的ASCII显示
  $%  001:The name of the system                         $%    $%  ANS000.BYTE007  $%  03个字节的ASCII显示
  $%  002:Software part number                           $%    $%  ANS000.BYTE010  $%  03个字节的HEX显示
  $%  003:Software version                               $%    $%  ANS000.BYTE013  $%  04个字节的HEX显示
  $%  004:Supplier part number                           $%    $%  ANS000.BYTE017  $%  05个字节的ASCII显示
  $%  005:Part number of the whole vehicle factory       $%    $%  ANS000.BYTE022  $%  13个字节的ASCII显示

;******************************************************************************************************************************************************
数据流

	$	REQ000: 80 28 F1 02 21 04 C0          $
	$	REQ001: 80 28 F1 02 21 08 C4          $
	$	REQ002: 80 28 F1 02 21 09 C5          $
	$	REQ003: 80 28 F1 02 21 10 CC          $
	$	REQ004: 80 28 F1 02 21 1C D8          $

  $  000.Wheel Speed FL                        $    $  km/h     $    $  ANS000.BYTE002  $  XY*0.0563
  $  001.Wheel Speed FR                        $    $  km/h     $    $  ANS000.BYTE004  $  XY*0.0563
  $  002.Wheel Speed RL                        $    $  km/h     $    $  ANS000.BYTE006  $  XY*0.0563
  $  003.Wheel Speed RR                        $    $  km/h     $    $  ANS000.BYTE008  $  XY*0.0563
  $  004.Vehicle Speed                         $    $  km/h     $    $  ANS001.BYTE002  $  XY*0.0563
  $  005.EVFL - Inlet valve front lefts        $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x1)y=@0009;else y=@0008;
  $  006.AVFL - Outlet valve front left        $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x2)y=@0009;else y=@0008;
  $  007.EVFR - Inlet valve front right        $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x4)y=@0009;else y=@0008;
  $  008.AVFR - Outlet valve front right       $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x8)y=@0009;else y=@0008;
  $  009.EVRL - Inlet valve rear left          $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x10)y=@0009;else y=@0008;
  $  010.AVRL - Outlet valve rear left         $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x20)y=@0009;else y=@0008;
  $  011.EVRR - Inlet valve rear right         $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x40)y=@0009;else y=@0008;
  $  012.AVRR - Outlet valve rear right        $    $  -        $    $  ANS002.BYTE002  $  if(X1&0x80)y=@0009;else y=@0008;
  $  013.Pump motor status                     $    $  -        $    $  ANS003.BYTE002  $  FF:ON 		00:OFF		其他:-
  $  014.Battery voltage                       $    $  V        $    $  ANS004.BYTE002  $  X*0.08

