$~#6$~#14$~500$~779
;******************************************************************************************************************************************************

车型代号:CN210M-48V
车型:CN210M-48V
排量:N/A
年份:2017
模块名缩写:MCU
模块名:电机控制模块
供应商:sevcon
诊断代码:210M48V_MCU_2017_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:771 02 10 01 00 00 00 00 00          $~          779 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:771 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:771 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:771 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/HECTORDTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:771 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:771 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:771 03 22 F1 90 00 00 00 00          $%
	$%	REQ001:771 03 22 F1 86 00 00 00 00          $%
	$%	REQ002:771 03 22 F1 8A 00 00 00 00          $%
	$%	REQ003:771 03 22 F1 8B 00 00 00 00          $%
	$%	REQ004:771 03 22 F1 8C 00 00 00 00          $%
	$%	REQ005:771 03 22 F1 93 00 00 00 00          $%
	$%	REQ006:771 03 22 F1 95 00 00 00 00          $%
	$%	REQ007:771 03 22 F1 CB 00 00 00 00          $%
	$%	REQ008:771 03 22 F1 92 00 00 00 00          $%
	$%	REQ009:771 03 22 F1 94 00 00 00 00          $%
	$%	REQ010:771 03 22 F1 88 00 00 00 00          $%
	$%	REQ011:771 03 22 F1 91 00 00 00 00          $%

  $%  000:SGMW VIN                                   $%    $%  ANS000.BYTE003  $%  17个字节的ASCII显示
  $%  001:Active Diagnostic Session                  $%    $%  ANS001.BYTE003  $%  X
  $%  002:Supplier Identifier Information            $%    $%  ANS002.BYTE003  $%  07个字节的ASCII显示
  $%  003:ECUManufacturingDate                       $%    $%  ANS003.BYTE003  $%  04个字节的HEX显示
  $%  004:ECU Serial Number                          $%    $%  ANS004.BYTE003  $%  17个字节的ASCII显示
  $%  005:Supplier ECU Hardware Version Number       $%    $%  ANS005.BYTE003  $%  05个字节的ASCII显示
  $%  006:Supplier ECU Software Version Number       $%    $%  ANS006.BYTE003  $%  08个字节的ASCII显示
  $%  007:EndModelPartNumber(SGMW P/N)               $%    $%  ANS007.BYTE003  $%  X1X2X3X4
  $%  008:Supplier ECU Hardware Number               $%    $%  ANS008.BYTE003  $%  05个字节的ASCII显示
  $%  009:Supplier ECU Software Number               $%    $%  ANS009.BYTE003  $%  08个字节的ASCII显示
  $%  010:SGMW ECU Software Number                   $%    $%  ANS010.BYTE003  $%  X1X2X3X4
  $%  011:SGMW ECU Hardware Number                   $%    $%  ANS011.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

   00.Data flow

	$	REQ000:771 03 22 2D 20 00 00 00 00          $
	$	REQ001:771 03 22 2D 21 00 00 00 00          $
	$	REQ002:771 03 22 2D 22 00 00 00 00          $
	$	REQ003:771 03 22 2D 34 00 00 00 00          $
	$	REQ004:771 03 22 2D 30 00 00 00 00          $
	$	REQ005:771 03 22 2D 32 00 00 00 00          $
	$	REQ006:771 03 22 2D 3B 00 00 00 00          $
	$	REQ007:771 03 22 2D 36 00 00 00 00          $
	$	REQ008:771 03 22 2D 2F 00 00 00 00          $
	$	REQ009:771 03 22 2D 65 00 00 00 00          $

  $  000.MM_REQUEST                        $    $  -       $    $  ANS000.BYTE003  $  01:NEUTRAL		05: TORQUE_CTRL		07: ESA		其他:-
  $  001.MM_STATUS                         $    $  -       $    $  ANS001.BYTE003  $  10:Standby		50:TORQUE_CTRL_ACTIVE		51:TORQUE_CTRL_IDLE		52:TORQUE_CTRL_FAULT		53:TORQUE_CTRL_OUT_OF_RANGE		54: TORQUE_CTRL_INHIB		55: TORQUE_CTRL_DERATING		56: TORQUE_CTRL_MAX		70: ESA_ACTIVE		71: ESA_DONE		72: ESA_FAULT		73: ESA_OUT_OF_RANGE		74: ESA_INHIB		90: GO_SLEEPiNG_ONGONING		其他:-
  $  002.MASTER_TorqueCtrl_RegTorque       $    $  Nm      $    $  ANS002.BYTE003  $  X*0.5-44
  $  003.Estimated_Torque                  $    $  Nm      $    $  ANS003.BYTE003  $  XY*0.1-100
  $  004.SCU_BUS_VOLTAGE                   $    $  V       $    $  ANS004.BYTE003  $  XY*0.02
  $  005.ENA_Status                        $    $  -       $    $  ANS005.BYTE003  $  00:NOT_ACTIVE		01:ACTIVE		其他:-
  $  006.iBSG_Temperature_Rate             $    $  %       $    $  ANS006.BYTE003  $  X
  $  007.SCU_IDC_Current                   $    $  A       $    $  ANS007.BYTE003  $  XY*1-400
  $  008.Rotor_Speed                       $    $  Rpm     $    $  ANS008.BYTE003  $  XY*1-2000
  $  009.BSG System Status                 $    $  -       $    $  ANS009.BYTE003  $  00: System OK		01: System fault state1		02: System fault state2		03: System fault state3 		04: System fault state3		其他:-


