$~#6$~#14$~500$~778
;******************************************************************************************************************************************************

车型代号:CN202SR_IN
车型:HECTOR
排量:2.0D
年份:2019
模块名缩写:BMS
模块名:电机控制模块
供应商:sevcon
诊断代码:CN202SR_IN_2019_BMS_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:770 02 10 01 00 00 00 00 00          $~          778 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:770 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:770 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:770 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/HECTORDTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:770 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:770 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:770 03 22 F1 90 00 00 00 00          $%
	$%	REQ001:770 03 22 F1 8A 00 00 00 00          $%
	$%	REQ002:770 03 22 F1 8B 00 00 00 00          $%
	$%	REQ003:770 03 22 F1 8C 00 00 00 00          $%
	$%	REQ004:770 03 22 F1 93 00 00 00 00          $%
	$%	REQ005:770 03 22 F1 95 00 00 00 00          $%
	$%	REQ006:770 03 22 F1 CB 00 00 00 00          $%

  $%  000:SGMW VIN                                   $%    $%  ANS000.BYTE003  $%  17个字节的ASCII显示
  $%  001:Supplier Identifier Information            $%    $%  ANS001.BYTE003  $%  07个字节的ASCII显示
  $%  002:ECUManufacturingDate                       $%    $%  ANS002.BYTE003  $%  04个字节的HEX显示
  $%  003:ECU Serial Number                          $%    $%  ANS003.BYTE003  $%  06个字节的HEX显示
  $%  004:Supplier ECU Hardware Version Number       $%    $%  ANS004.BYTE003  $%  20个字节的ASCII显示
  $%  005:Supplier ECU Software Version Number       $%    $%  ANS005.BYTE003  $%  20个字节的ASCII显示
  $%  006:EndModelPartNumber(SGMW P/N)               $%    $%  ANS006.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

   00.Data flow

	$	REQ000:770 03 22 F0 11 00 00 00 00          $
	$	REQ001:770 03 22 F0 12 00 00 00 00          $
	$	REQ002:770 03 22 F0 13 00 00 00 00          $
	$	REQ003:770 03 22 F0 14 00 00 00 00          $
	$	REQ004:770 03 22 F1 F1 00 00 00 00          $
	$	REQ005:770 03 22 F1 F2 00 00 00 00          $
	$	REQ006:770 03 22 F1 F3 00 00 00 00          $
	$	REQ007:770 03 22 FE 31 00 00 00 00          $
	$	REQ008:770 03 22 FE 36 00 00 00 00          $
	$	REQ009:770 03 22 FE 37 00 00 00 00          $
	$	REQ010:770 03 22 FE 38 00 00 00 00          $
	$	REQ011:770 03 22 FE 3C 00 00 00 00          $
	$	REQ012:770 03 22 FE 3D 00 00 00 00          $
	$	REQ013:770 03 22 FE 3E 00 00 00 00          $
	$	REQ014:770 03 22 FE 50 00 00 00 00          $
	$	REQ015:770 03 22 FE 61 00 00 00 00          $
	$	REQ016:770 03 22 FE 62 00 00 00 00          $
	$	REQ017:770 03 22 FE 86 00 00 00 00          $
	$	REQ018:770 03 22 FE 88 00 00 00 00          $
	$	REQ019:770 03 22 FE 8A 00 00 00 00          $
	$	REQ020:770 03 22 FE 8C 00 00 00 00          $
	$	REQ021:770 03 22 FE 8D 00 00 00 00          $
	$	REQ022:770 03 22 FE AE 00 00 00 00          $
	$	REQ023:770 03 22 FE AF 00 00 00 00          $
	$	REQ024:770 03 22 FE CB 00 00 00 00          $

  $  000.ECU Voltage                                                   $    $  V        $    $  ANS000.BYTE003  $  X*0.1
  $  001.Engine Speed                                                  $    $  rpm      $    $  ANS001.BYTE003  $  XY*0.25
  $  002.Vehicle Speed                                                 $    $  km       $    $  ANS002.BYTE003  $  XY*0.015625
  $  003.Vehicle Odometer                                              $    $  km/h     $    $  ANS003.BYTE003  $  XYZ*0.015625
  $  004.Read Serial Number Pack                                       $    $  -        $    $  ANS004.BYTE003  $  05个字节的HEX显示
  $  005.Read Part Number Pack                                         $    $  -        $    $  ANS005.BYTE003  $  06个字节的HEX显示
  $  006.Read BOSCH System name                                        $    $  -        $    $  ANS006.BYTE003  $  07个字节的HEX显示
  $  007.Read Data Recorder: Main relay open/close event counter       $    $  -        $    $  ANS007.BYTE003  $  08个字节的HEX显示
  $  008.Read voltage drop across shunt resistor                       $    $  mV       $    $  ANS008.BYTE003  $  10个字节的HEX显示
  $  009.Read current sensor calibration status                        $    $  -        $    $  ANS009.BYTE003  $  00:INIT		18:PRELIMINARY		81:ADJUSTED		FF:ERROR		其他:-
  $  010.Read resistance of shunt                                      $    $  uOhm     $    $  ANS010.BYTE003  $  12个字节的HEX显示
  $  011.Read pack voltage                                             $    $  V        $    $  ANS011.BYTE003  $  13个字节的HEX显示
  $  012.Read pack current                                             $    $  A        $    $  ANS012.BYTE003  $  14个字节的HEX显示
  $  013.Read link voltage                                             $    $  V        $    $  ANS013.BYTE003  $  15个字节的HEX显示
  $  014.Crash signal validity                                         $    $  -        $    $  ANS014.BYTE003  $  00:FALSE		01:TRUE		其他:-
  $  015.Contactor Low-Side Analog Monitor                             $    $  V        $    $  ANS015.BYTE003  $  17个字节的HEX显示
  $  016.Contactor HSD voltage                                         $    $  V        $    $  ANS016.BYTE003  $  18个字节的HEX显示
  $  017.Read Spannung Klemme 30                                       $    $  mV       $    $  ANS017.BYTE003  $  X*5000
  $  018.Read Status Klemme 15                                         $    $  -        $    $  ANS018.BYTE003  $  00:FALSE		01:TRUE		其他:-
  $  019.Read Open line status                                         $    $  -        $    $  ANS019.BYTE003  $  00:PAIR_RESULT_NOT_AVAILABLE		03:PAIR_RESULT_NOT_OK		07:PAIR_RESULT_OK		其他:-
  $  020.Read SOC                                                      $    $  %        $    $  ANS020.BYTE003  $  XYZ*0.0039-57
  $  021.Read SOH                                                      $    $  -        $    $  ANS021.BYTE003  $  X1X2X3X4*0.0001
  $  022.Read temperature of sensor 1                                  $    $  ℃       $    $  ANS022.BYTE003  $  05个字节的HEX显示
  $  023.Read temperature of sensor 2                                  $    $  ℃       $    $  ANS023.BYTE003  $  06个字节的HEX显示
  $  024.Read balancing events counters                                $    $  -        $    $  ANS024.BYTE003  $  07个字节的HEX显示


