$~#6$~#14$~500$~759
;******************************************************************************************************************************************************

车型代号:CN202SR
车型:ALMAZ
排量:N15T
年份:2019
模块名缩写:AC
模块名:空调控制模块
供应商:上海福太隆
诊断代码:CN202SR_2019_AC_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:751 02 10 01 00 00 00 00 00          $~          759 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:751 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:751 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:751 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/CAPTIVADTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:751 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:751 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:751 03 22 F1 8A 00 00 00 00          $%
	$%	REQ001:751 03 22 F1 8B 00 00 00 00          $%
	$%	REQ002:751 03 22 F1 90 00 00 00 00          $%
	$%	REQ003:751 03 22 F1 CB 00 00 00 00          $%
	$%	REQ004:751 03 22 F1 93 00 00 00 00          $%
	$%	REQ005:751 03 22 F1 94 00 00 00 00          $%
	$%	REQ006:751 03 22 F1 95 00 00 00 00          $%

  $%  000:Supplier Identifier Information            $%    $%  ANS000.BYTE003  $%  07个字节的ASCII显示
  $%  001:ECUManufacturingDate                       $%    $%  ANS001.BYTE003  $%  04个字节的HEX显示
  $%  002:VIN                                        $%    $%  ANS002.BYTE003  $%  17个字节的ASCII显示
  $%  003:SGMW P/N                                   $%    $%  ANS003.BYTE003  $%  X1X2X3X4
  $%  004:Supplier ECU Hardware Version Number       $%    $%  ANS004.BYTE003  $%  01个字节的ASCII显示
  $%  005:Supplier ECU Software Number               $%    $%  ANS005.BYTE003  $%  03个字节的HEX显示
  $%  006:Supplier ECU Software Version Number       $%    $%  ANS006.BYTE003  $%  03个字节的HEX显示

;******************************************************************************************************************************************************
数据流

 $ 00.sensor voltage

	$	REQ000:751 03 22 98 01 00 00 00 00          $
	$	REQ001:751 03 22 98 02 00 00 00 00          $
	$	REQ002:751 03 22 98 03 00 00 00 00          $
	$	REQ003:751 03 22 98 0B 00 00 00 00          $
	$	REQ004:751 03 22 98 0C 00 00 00 00          $
	$	REQ005:751 03 22 98 0D 00 00 00 00          $
	$	REQ006:751 03 22 98 0E 00 00 00 00          $
	$	REQ007:751 03 22 98 0F 00 00 00 00          $
	$	REQ008:751 03 22 98 17 00 00 00 00          $
	$	REQ009:751 03 22 98 18 00 00 00 00          $

  $  000.Incar temperature sensor voltage        $    $  V      $    $  ANS000.BYTE003  $  X*0.02
  $  001.Sun sensor voltage                      $    $  V      $    $  ANS001.BYTE003  $  X*0.02
  $  002.Outcar temperature sensor voltage       $    $  V      $    $  ANS002.BYTE003  $  X*0.02
  $  003.Recirculation Actuator Position         $    $  -      $    $  ANS003.BYTE003  $  00:internal recycle		01:external recycle		其他:-
  $  004.Mode Actuator Feedback Voltage          $    $  V      $    $  ANS004.BYTE003  $  X*0.1
  $  005.Mode Actuator Position                  $    $  -      $    $  ANS005.BYTE003  $  00:face		01:face and foot		02:foot		03:foot and defrost		04:defrost		其他:-
  $  006.Mixture Actuator Feedback Voltage       $    $  V      $    $  ANS006.BYTE003  $  X*0.1
  $  007.Mixture Actuator Position               $    $  %      $    $  ANS007.BYTE003  $  X
  $  008.Evaporator temperature                  $    $  ℃     $    $  ANS008.BYTE003  $  X*1-40
  $  009.Rear Blower feedback Voltage            $    $  V      $    $  ANS009.BYTE003  $  X*+

 $ 01.temperature

	$	REQ000:751 03 22 98 04 00 00 00 00          $
	$	REQ001:751 03 22 98 05 00 00 00 00          $
	$	REQ002:751 03 22 98 06 00 00 00 00          $
	$	REQ003:751 03 22 98 16 00 00 00 00          $

  $  000.Incar temperature        $    $  ℃       $    $  ANS000.BYTE003  $  XY*0.1-40
  $  001.Sun intensity            $    $  W/m2     $    $  ANS001.BYTE003  $  XY
  $  002.Outcar temperature       $    $  ℃       $    $  ANS002.BYTE003  $  XY*0.1-40
  $  003.Set temperature          $    $  ℃       $    $  ANS003.BYTE003  $  XY*0.1-40

 $ 02.blower

	$	REQ000:751 03 22 98 07 00 00 00 00          $
	$	REQ001:751 03 22 98 08 00 00 00 00          $
	$	REQ002:751 03 22 98 09 00 00 00 00          $
	$	REQ003:751 03 22 98 0A 00 00 00 00          $

  $  000.Blower Supply Voltage             $    $  V     $    $  ANS000.BYTE003  $  X*0.1
  $  001.Blower feedback Voltage           $    $  V     $    $  ANS001.BYTE003  $  X*0.1
  $  002.Blower control signal (PWM)       $    $  %     $    $  ANS002.BYTE003  $  X
  $  003.Blower Speed Level                $    $  -     $    $  ANS003.BYTE003  $  00:class 0		01:class 1		02:class 2		03:class 3		04:class 4		05:class 5		06:class 6		07:class 7		其他:-

 $ 03.switch

	$	REQ000:751 03 22 98 10 00 00 00 00          $
	$	REQ001:751 03 22 98 11 00 00 00 00          $
	$	REQ002:751 03 22 98 12 00 00 00 00          $
	$	REQ003:751 03 22 98 13 00 00 00 00          $
	$	REQ004:751 03 22 98 14 00 00 00 00          $
	$	REQ005:751 03 22 98 15 00 00 00 00          $

  $  000.AC switch status                  $    $  -     $    $  ANS000.BYTE003  $  00:OFF		01:ON		其他:-
  $  001.AC output status (to ECM)         $    $  -     $    $  ANS001.BYTE003  $  00:OFF		01:ON		其他:-
  $  002.Front defrost switch status       $    $  -     $    $  ANS002.BYTE003  $  00:OFF		01:ON		其他:-
  $  003.Rear defrost switch status        $    $  -     $    $  ANS003.BYTE003  $  00:OFF		01:ON		其他:-
  $  004.Rear defrost output status        $    $  -     $    $  ANS004.BYTE003  $  00:OFF		01:ON		其他:-
  $  005.AUTO switch status                $    $  -     $    $  ANS005.BYTE003  $  00:OFF		01:ON		其他:-


