$~#6$~#14$~500$~75D
;******************************************************************************************************************************************************

车型代号:CN202M
车型:RM-5
排量:1.5L
年份:2019
模块名缩写:SMM
模块名:座椅记忆模块
供应商:延锋安道拓
诊断代码:CN202M_2019_SMM_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:755 02 10 01 00 00 00 00 00          $~          75D 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:755 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:755 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:755 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/RM-5DTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:755 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:755 03 22 F1 8A 00 00 00 00          $%
	$%	REQ001:755 03 22 F1 90 00 00 00 00          $%
	$%	REQ002:755 03 22 F1 93 00 00 00 00          $%
	$%	REQ003:755 03 22 F1 95 00 00 00 00          $%
	$%	REQ004:755 03 22 F1 CB 00 00 00 00          $%
	$%	REQ005:755 03 22 F1 88 00 00 00 00          $%
	$%	REQ006:755 03 22 F1 91 00 00 00 00          $%

  $%  000:供应商信息                $%    $%  ANS000.BYTE003  $%  07个字节的ASCII显示
  $%  001:VIN                       $%    $%  ANS001.BYTE003  $%  17个字节的ASCII显示
  $%  002:供应商ECU硬件版本号       $%    $%  ANS002.BYTE003  $%  06个字节的ASCII显示
  $%  003:供应商ECU软件版本号       $%    $%  ANS003.BYTE003  $%  06个字节的ASCII显示
  $%  004:零件号                    $%    $%  ANS004.BYTE003  $%  X1X2X3X4
  $%  005:SGMW软件号                $%    $%  ANS005.BYTE003  $%  X1X2X3X4
  $%  006:SGMW硬件号                $%    $%  ANS006.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

   00.数据流

	$	REQ000:755 03 22 B0 01 00 00 00 00          $
	$	REQ001:755 03 22 B0 04 00 00 00 00          $
	$	REQ002:755 03 22 B0 05 00 00 00 00          $
	$	REQ003:755 03 22 B0 06 00 00 00 00          $
	$	REQ004:755 03 22 B0 07 00 00 00 00          $
	$	REQ005:755 03 22 B0 08 00 00 00 00          $
	$	REQ006:755 03 22 B0 09 00 00 00 00          $
	$	REQ007:755 03 22 B0 0A 00 00 00 00          $
	$	REQ008:755 03 22 B0 02 00 00 00 00          $
	$	REQ009:755 03 22 B0 03 00 00 00 00          $
	$	REQ010:755 03 22 B0 0B 00 00 00 00          $

  $  000.座椅前部电机位置计数                      $    $  -     $    $  ANS000.BYTE003  $  XY
  $  001.座椅后部电机位置计数                      $    $  -     $    $  ANS000.BYTE005  $  XY
  $  002.滑道电机位置计数                          $    $  -     $    $  ANS000.BYTE007  $  XY
  $  003.靠背电机位置计数                          $    $  -     $    $  ANS000.BYTE009  $  XY
  $  004.左后视镜上下电机位置计数                  $    $  -     $    $  ANS000.BYTE011  $  XY
  $  005.右后视镜上下电机位置计数                  $    $  -     $    $  ANS000.BYTE013  $  XY
  $  006.左后视镜左右电机位置计数                  $    $  -     $    $  ANS000.BYTE015  $  XY
  $  007.右后视镜左右电机位置计数                  $    $  -     $    $  ANS000.BYTE017  $  XY
  $  008.记忆按键1的座椅前部电机位置计数           $    $  -     $    $  ANS001.BYTE003  $  XY
  $  009.记忆按键1的座椅后部电机位置计数           $    $  -     $    $  ANS001.BYTE005  $  XY
  $  010.记忆按键1的滑道电机位置计数               $    $  -     $    $  ANS001.BYTE007  $  XY
  $  011.记忆按键1的靠背电机位置计数               $    $  -     $    $  ANS001.BYTE009  $  XY
  $  012.记忆按键1的左后视镜上下电机位置计数       $    $  -     $    $  ANS001.BYTE011  $  XY
  $  013.记忆按键1的右后视镜上下电机位置计数       $    $  -     $    $  ANS001.BYTE013  $  XY
  $  014.记忆按键1的左后视镜左右电机位置计数       $    $  -     $    $  ANS001.BYTE015  $  XY
  $  015.记忆按键1的右后视镜左右电机位置计数       $    $  -     $    $  ANS001.BYTE017  $  XY
  $  016.记忆按键2的座椅前部电机位置计数           $    $  -     $    $  ANS002.BYTE003  $  XY
  $  017.记忆按键2的座椅后部电机位置计数           $    $  -     $    $  ANS002.BYTE005  $  XY
  $  018.记忆按键2的滑道电机位置计数               $    $  -     $    $  ANS002.BYTE007  $  XY
  $  019.记忆按键2的靠背电机位置计数               $    $  -     $    $  ANS002.BYTE009  $  XY
  $  020.记忆按键2的左后视镜上下电机位置计数       $    $  -     $    $  ANS002.BYTE011  $  XY
  $  021.记忆按键2的右后视镜上下电机位置计数       $    $  -     $    $  ANS002.BYTE013  $  XY
  $  022.记忆按键2的左后视镜左右电机位置计数       $    $  -     $    $  ANS002.BYTE015  $  XY
  $  023.记忆按键2的右后视镜左右电机位置计数       $    $  -     $    $  ANS002.BYTE017  $  XY
  $  024.记忆按键3的座椅前部电机位置计数           $    $  -     $    $  ANS003.BYTE003  $  XY
  $  025.记忆按键3的座椅后部电机位置计数           $    $  -     $    $  ANS003.BYTE005  $  XY
  $  026.记忆按键3的滑道电机位置计数               $    $  -     $    $  ANS003.BYTE007  $  XY
  $  027.记忆按键3的靠背电机位置计数               $    $  -     $    $  ANS003.BYTE009  $  XY
  $  028.记忆按键3的左后视镜上下电机位置计数       $    $  -     $    $  ANS003.BYTE011  $  XY
  $  029.记忆按键3的右后视镜上下电机位置计数       $    $  -     $    $  ANS003.BYTE013  $  XY
  $  030.记忆按键3的左后视镜左右电机位置计数       $    $  -     $    $  ANS003.BYTE015  $  XY
  $  031.记忆按键3的右后视镜左右电机位置计数       $    $  -     $    $  ANS003.BYTE017  $  XY
  $  032.钥匙1的座椅前部电机位置计数               $    $  -     $    $  ANS004.BYTE003  $  XY
  $  033.钥匙1的座椅后部电机位置计数               $    $  -     $    $  ANS004.BYTE005  $  XY
  $  034.钥匙1的滑道电机位置计数                   $    $  -     $    $  ANS004.BYTE007  $  XY
  $  035.钥匙1的靠背电机位置计数                   $    $  -     $    $  ANS004.BYTE009  $  XY
  $  036.钥匙1的左后视镜上下电机位置计数           $    $  -     $    $  ANS004.BYTE011  $  XY
  $  037.钥匙1的右后视镜上下电机位置计数           $    $  -     $    $  ANS004.BYTE013  $  XY
  $  038.钥匙1的左后视镜左右电机位置计数           $    $  -     $    $  ANS004.BYTE015  $  XY
  $  039.钥匙1的右后视镜左右电机位置计数           $    $  -     $    $  ANS004.BYTE017  $  XY
  $  040.钥匙2的座椅前部电机位置计数               $    $  -     $    $  ANS005.BYTE003  $  XY
  $  041.钥匙2的座椅后部电机位置计数               $    $  -     $    $  ANS005.BYTE005  $  XY
  $  042.钥匙2的滑道电机位置计数                   $    $  -     $    $  ANS005.BYTE007  $  XY
  $  043.钥匙2的靠背电机位置计数                   $    $  -     $    $  ANS005.BYTE009  $  XY
  $  044.钥匙2的左后视镜上下电机位置计数           $    $  -     $    $  ANS005.BYTE011  $  XY
  $  045.钥匙2的右后视镜上下电机位置计数           $    $  -     $    $  ANS005.BYTE013  $  XY
  $  046.钥匙2的左后视镜左右电机位置计数           $    $  -     $    $  ANS005.BYTE015  $  XY
  $  047.钥匙2的右后视镜左右电机位置计数           $    $  -     $    $  ANS005.BYTE017  $  XY
  $  048.主驾座椅加热状态                          $    $  -     $    $  ANS006.BYTE003  $  00:加热关闭		01:加热1		02:加热2		03:加热3		其他:-
  $  049.主驾座椅通风状态                          $    $  -     $    $  ANS007.BYTE003  $  00:通风关闭		01:通风1		02:通风2		03:通风3		其他:-
  $  050.座椅滑道电机软止点学习状态                $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x80)y=@0134;else y=@0133;
  $  051.座椅靠背电机软止点学习状态                $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x40)y=@0134;else y=@0133;
  $  052.座椅前部电机软止点学习状态                $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x20)y=@0134;else y=@0133;
  $  053.座椅后部电机软止点学习状态                $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x10)y=@0134;else y=@0133;
  $  054.左后视镜上下电机软止点学习状态            $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x8)y=@0134;else y=@0133;
  $  055.右后视镜上下电机软止点学习状态            $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x4)y=@0134;else y=@0133;
  $  056.左后视镜左右电机软止点学习状态            $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x2)y=@0134;else y=@0133;
  $  057.右后视镜左右电机软止点学习状态            $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x1)y=@0134;else y=@0133;
  $  058.滑道向前开关状态                          $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x80)y=@0086;else y=@0085;
  $  059.滑道向后开关状态                          $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x40)y=@0086;else y=@0085;
  $  060.座椅前部向上开关状态                      $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x20)y=@0086;else y=@0085;
  $  061.座椅前部向下开关状态                      $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x10)y=@0086;else y=@0085;
  $  062.座椅后部向上开关状态                      $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x8)y=@0086;else y=@0085;
  $  063.座椅后部向下开关状态                      $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x4)y=@0086;else y=@0085;
  $  064.靠背向前开关状态                          $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x2)y=@0086;else y=@0085;
  $  065.靠背向后开关状态                          $    $  -     $    $  ANS009.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  066.舒适上下车设置状态                        $    $  -     $    $  ANS010.BYTE003  $  if(X1&0x80)y=@0009;else y=@0008;


