$~#6$~#14$~500$~718
;******************************************************************************************************************************************************

车型代号:CN202SR
车型:HECTOR
排量:N15T
年份:2019
模块名缩写:GW
模块名:网关
供应商:华东
诊断代码:CN202SR_IN_2019_GW_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:710 02 10 01 00 00 00 00 00          $~          718 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:710 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:710 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:710 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/HECTORDTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:710 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:710 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:710 03 22 F1 8B 00 00 00 00          $%
	$%	REQ001:710 03 22 F1 90 00 00 00 00          $%
	$%	REQ002:710 03 22 F1 CB 00 00 00 00          $%
	$%	REQ003:710 03 22 F1 92 00 00 00 00          $%
	$%	REQ004:710 03 22 F1 93 00 00 00 00          $%
	$%	REQ005:710 03 22 F1 94 00 00 00 00          $%
	$%	REQ006:710 03 22 F1 95 00 00 00 00          $%
	$%	REQ007:710 03 22 F1 8A 00 00 00 00          $%

  $%  000:ECU Manufacturing Date                     $%    $%  ANS000.BYTE003  $%  04个字节的HEX显示
  $%  001:VIN                                        $%    $%  ANS001.BYTE003  $%  17个字节的ASCII显示
  $%  002:SGMW P/N                                   $%    $%  ANS002.BYTE003  $%  X1X2X3X4
  $%  003:ECU Hardware Number                        $%    $%  ANS003.BYTE003  $%  10个字节的ASCII显示
  $%  004:SupplierECUHardwareVersionNumber           $%    $%  ANS004.BYTE003  $%  01个字节的HEX显示
  $%  005:ECU Hardware Version Number                $%    $%  ANS005.BYTE003  $%  10个字节的ASCII显示
  $%  006:Supplier ECU Software Version Number       $%    $%  ANS006.BYTE003  $%  03个字节的HEX显示
  $%  007:Supplier Identifier Information            $%    $%  ANS007.BYTE003  $%  07个字节的ASCII显示
  $%  008:Supplier ECU Software Version Number       $%    $%  ANS006.BYTE003  $%  03个字节的HEX显示

;******************************************************************************************************************************************************
数据流

   00.All Data

	$	REQ000:710 03 22 B1 50 00 00 00 00          $
	$	REQ001:710 03 22 B1 66 00 00 00 00          $
	$	REQ002:710 03 22 C1 10 00 00 00 00          $
	$	REQ003:710 03 22 C1 01 00 00 00 00          $
	$	REQ004:710 03 22 D1 00 00 00 00 00          $

  $  000.Power Input                         $    $  V     $    $  ANS000.BYTE003  $  XY*0.0276+0.42
  $  001.EEPROM Check                        $    $  -     $    $  ANS001.BYTE003  $  00:Software is not to match the eprom		01:Software is to match the eprom		其他:-
  $  002.Diagnostic CAN Report               $    $  -     $    $  ANS002.BYTE003  $  00:not report any CAN messages to Diagnostic CAN		01:Report P CAN messages to Diagnostic CAN		02:Report B CAN messages to Diagnostic CAN		03:Report E CAN messages to Diagnostic CAN		其他:-
  $  003.TCM Gear box configuration          $    $  -     $    $  ANS003.BYTE003  $  01:MT		02:AMT		03:CVT		04:AT		05:DCT		其他:-
  $  004.Signal Input-ON input status        $    $  -     $    $  ANS004.BYTE003  $  if(X1&0x80)y=@0275;else y=@0014;
  $  005.Signal Input-ACC input status       $    $  -     $    $  ANS004.BYTE003  $  if(X1&0x40)y=@0275;else y=@0014;
  $  006.Signal Input-OFF input status       $    $  -     $    $  ANS004.BYTE003  $  if(X1&0x20)y=@0275;else y=@0014;


