$~#6$~#14$~500$~74B
;******************************************************************************************************************************************************

车型代号:CN202SR
车型:HECTOR
排量:N15T
年份:2019
模块名缩写:PLG
模块名:电动尾门控制模块
供应商:麦格纳
诊断代码:CN202SR_IN_2019_PLG_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:743 02 10 01 00 00 00 00 00          $~          74B 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:743 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:743 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:743 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/HECTORDTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:743 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:743 02 11 03 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:743 03 22 F1 8A 00 00 00 00          $%
	$%	REQ001:743 03 22 F1 8B 00 00 00 00          $%
	$%	REQ002:743 03 22 F1 90 00 00 00 00          $%
	$%	REQ003:743 03 22 F1 92 00 00 00 00          $%
	$%	REQ004:743 03 22 F1 94 00 00 00 00          $%
	$%	REQ005:743 03 22 F1 CB 00 00 00 00          $%

  $%  000:Supplier Identifier Information       $%    $%  ANS000.BYTE003  $%  07个字节的ASCII显示
  $%  001:ECU Manufacturing Date                $%    $%  ANS001.BYTE003  $%  04个字节的HEX显示
  $%  002:VIN                                   $%    $%  ANS002.BYTE003  $%  17个字节的ASCII显示
  $%  003:Supplier ECU Hardware Number          $%    $%  ANS003.BYTE003  $%  08个字节的ASCII显示
  $%  004:Supplier ECU Software Number          $%    $%  ANS004.BYTE003  $%  08个字节的ASCII显示
  $%  005:PartNumber                            $%    $%  ANS005.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

   00.All Data

	$	REQ000:743 03 22 46 10 00 00 00 00          $
	$	REQ001:743 03 22 46 11 00 00 00 00          $
	$	REQ002:743 03 22 46 12 00 00 00 00          $
	$	REQ003:743 03 22 46 13 00 00 00 00          $
	$	REQ004:743 03 22 46 14 00 00 00 00          $
	$	REQ005:743 03 22 46 15 00 00 00 00          $
	$	REQ006:743 03 22 46 16 00 00 00 00          $
	$	REQ007:743 03 22 46 17 00 00 00 00          $
	$	REQ008:743 03 22 46 18 00 00 00 00          $
	$	REQ009:743 03 22 46 1A 00 00 00 00          $
	$	REQ010:743 03 22 C1 01 00 00 00 00          $

  $  000.Self priming lock pawl switch status       $    $  -     $    $  ANS000.BYTE003  $  00:OFF		01:ON		其他:-
  $  001.Secondary Switch                           $    $  -     $    $  ANS001.BYTE003  $  00:OFF		01:ON		其他:-
  $  002.Latch status                               $    $  -     $    $  ANS002.BYTE003  $  00:Unknown		01:Cinched		02:Cinching		03:Released		04:Releasing		其他:-
  $  003.0 Position Switch                          $    $  -     $    $  ANS003.BYTE003  $  00:OFF		01:ON		其他:-
  $  004.Power Lift Gate Status                     $    $  -     $    $  ANS004.BYTE003  $  00:Lift Gate is fully opened		01:Mechanical failure		02:Cank is in process		03:Liftgate released		04:Lift Gate is Power opening		05:Lift Gate is power closing		06:Liftgate is in cinching state		07:Liftgate is in releasing state		08:Lift gate fully closed		其他:-
  $  005.Shut face switch status                    $    $  -     $    $  ANS005.BYTE003  $  00:OFF switch inactive		01:Short press detected		02:Long press detected		其他:-
  $  006.Tell Tale                                  $    $  -     $    $  ANS006.BYTE003  $  00:OK		01:Voltage out of normal range		02:Speed out of range		04:Crank was in process		08:Ambient Temperature out of range		10:APS is Active		20:Play protection		40:Vehicle is not in park mode		80:Vehicle Antitheft Status is Armed		100:Door lock status is all door locked		其他:-
  $  007.Lift gate Learn Status                     $    $  -     $    $  ANS007.BYTE003  $  00:unlearned		01:learned		其他:-
  $  008.Memory SET position                        $    $  %     $    $  ANS008.BYTE003  $  X*0.394
  $  009.Driver Motor Status                        $    $  -     $    $  ANS009.BYTE003  $  00:Stop		01:Running		02:Failure		其他:-
  $  010.TCM Gear box configuration                 $    $  -     $    $  ANS010.BYTE003  $  01:MT		02:AMT		03:CVT		04:AT		05:DCT		其他:-


