$~#6$~#14$~500$~728
;******************************************************************************************************************************************************

车型代号:CN210S
车型:宝骏560
排量:N15T
年份:2018
模块名缩写:ABS/ESP
模块名:防抱死系统
供应商:BOSCH
诊断代码:CN202M_2019_ABS_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:720 02 10 01 00 00 00 00 00          $~          728 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:720 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:720 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:720 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/RM-5DTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:720 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:720 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:720 03 22 F1 8B 00 00 00 00          $%
	$%	REQ001:720 03 22 F1 90 00 00 00 00          $%
	$%	REQ002:720 03 22 F1 92 00 00 00 00          $%
	$%	REQ003:720 03 22 F1 94 00 00 00 00          $%
	$%	REQ004:720 03 22 F1 CB 00 00 00 00          $%
	$%	REQ005:720 03 22 F1 95 00 00 00 00          $%
	$%	REQ006:720 03 22 F1 88 00 00 00 00          $%
	$%	REQ007:720 03 22 F1 91 00 00 00 00          $%

  $%  000:ECU生产日期               $%    $%  ANS000.BYTE003  $%  06个字节的ASCII显示
  $%  001:VIN                       $%    $%  ANS001.BYTE003  $%  17个字节的ASCII显示
  $%  002:供应商ECU硬件号           $%    $%  ANS002.BYTE003  $%  05个字节的HEX显示
  $%  003:供应商ECU软件号           $%    $%  ANS003.BYTE003  $%  03个字节的HEX显示
  $%  004:零件号                    $%    $%  ANS004.BYTE003  $%  X1X2X3X4
  $%  005:供应商ECU软件版本号       $%    $%  ANS005.BYTE003  $%  04个字节的HEX显示
  $%  006:SGMW软件号                $%    $%  ANS006.BYTE003  $%  X1X2X3X4
  $%  007:SGMW硬件号                $%    $%  ANS007.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

 $ 00.ABS/ESC数据流

	$	REQ000:720 03 22 2D 00 00 00 00 00          $
	$	REQ001:720 03 22 2D 05 00 00 00 00          $
	$	REQ002:720 03 22 2D 01 00 00 00 00          $
	$	REQ003:720 03 22 2D 0F 00 00 00 00          $
	$	REQ004:720 03 22 2D 33 00 00 00 00          $
	$	REQ005:720 03 22 2D 34 00 00 00 00          $
	$	REQ006:720 03 22 2D 02 00 00 00 00          $

  $  000.车速信息                              $    $  km/h      $    $  ANS000.BYTE003  $  XY*0.05625
  $  001.左前轮速                              $    $  km/h      $    $  ANS000.BYTE005  $  XY*0.05625
  $  002.右前轮速                              $    $  km/h      $    $  ANS000.BYTE007  $  XY*0.05625
  $  003.左后轮速                              $    $  km/h      $    $  ANS000.BYTE009  $  XY*0.05625
  $  004.右后轮速                              $    $  km/h      $    $  ANS000.BYTE011  $  XY*0.05625
  $  005.主缸压力                              $    $  bar       $    $  ANS001.BYTE003  $  [0000-7FFF]:XY*0.0153+0		[8000-FFFF]:(XY-65535)*0.0153+0
  $  006.方向盘转角                            $    $  °        $    $  ANS001.BYTE005  $  [0000-7FFF]:XY*0.1+0		[8000-FFFF]:(XY-65535)*0.1+0
  $  007.偏航率（横摆角速度）                  $    $  rad/s     $    $  ANS001.BYTE007  $  [0000-7FFF]:XY*0.00213+0		[8000-FFFF]:(XY-65535)*0.00213+0
  $  008.侧向加速度                            $    $  m/s2      $    $  ANS001.BYTE009  $  [0000-7FFF]:XY*0.02712+0		[8000-FFFF]:(XY-65535)*0.02712+0
  $  009.纵向加速度                            $    $  m/s2      $    $  ANS001.BYTE011  $  [0000-7FFF]:XY*0.02712+0		[8000-FFFF]:(XY-65535)*0.02712+0
  $  010.电池电压                              $    $  V         $    $  ANS002.BYTE003  $  X*0.08
  $  011.刹车灯开关                            $    $  -         $    $  ANS002.BYTE004  $  00:关		01:开		其他:-
  $  012.ESP开发故障                           $    $  -         $    $  ANS002.BYTE005  $  00:关		01:开		其他:-
  $  013.方向盘转向角自学习值                  $    $  rad       $    $  ANS003.BYTE003  $  [0000-7FFF]:XY*0.0009765+0		[8000-FFFF]:(XY-65535)*0.0009765+0
  $  014.电子手刹指示灯状态（仅EPB）           $    $  -         $    $  ANS004.BYTE003  $  00:关		01:开		其他:-
  $  015.自动电子手刹指示灯状态（仅EPB）       $    $  -         $    $  ANS005.BYTE003  $  00:关		01:开		其他:-
  $  016.制动灯开关                            $    $  -         $    $  ANS002.BYTE004  $  if(X1&0x1)y=@0120;else y=@0119;
  $  017.ESP开关                               $    $  -         $    $  ANS002.BYTE005  $  if(X1&0x1)y=@0041;else y=@0040;
  $  018.阀继电器状态                          $    $  -         $    $  ANS006.BYTE003  $  if(X1&0x1)y=@0041;else y=@0040;
  $  019.泵电机状态                            $    $  -         $    $  ANS006.BYTE004  $  if(X1&0x1)y=@0041;else y=@0040;
  $  020.右后出油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x80)y=@0039;else y=@0151;
  $  021.右后进油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x40)y=@0039;else y=@0151;
  $  022.左后出油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x20)y=@0039;else y=@0151;
  $  023.左后进油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x10)y=@0039;else y=@0151;
  $  024.右前出油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x8)y=@0039;else y=@0151;
  $  025.右前进油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x4)y=@0039;else y=@0151;
  $  026.左前出油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x2)y=@0039;else y=@0151;
  $  027.左前进油阀激活状态                    $    $  -         $    $  ANS006.BYTE005  $  if(X1&0x1)y=@0039;else y=@0151;
  $  028.高压阀2                               $    $  -         $    $  ANS006.BYTE006  $  if(X1&0x8)y=@0039;else y=@0151;
  $  029.高压阀1 (ESP Only)                    $    $  -         $    $  ANS006.BYTE006  $  if(X1&0x4)y=@0039;else y=@0151;
  $  030.回路控制阀2                           $    $  -         $    $  ANS006.BYTE006  $  if(X1&0x2)y=@0039;else y=@0151;
  $  031.回路控制阀1                           $    $  -         $    $  ANS006.BYTE006  $  if(X1&0x1)y=@0039;else y=@0151;

 $ 01.间接式胎压数据流

	$	REQ000:720 03 22 2D 35 00 00 00 00          $
	$	REQ001:720 03 22 2D 36 00 00 00 00          $
	$	REQ002:720 03 22 2D 38 00 00 00 00          $
	$	REQ003:720 03 22 2D 39 00 00 00 00          $
	$	REQ004:720 03 22 2D 40 00 00 00 00          $
	$	REQ005:720 03 22 2D 41 00 00 00 00          $
	$	REQ006:720 03 22 2D 43 00 00 00 00          $

  $  000.最后一次重置时里程表值（ESC集成间接式胎压专用）             $    $  Km       $    $  ANS000.BYTE003  $  X1X2X3X4
  $  001.倒数第二次重置时里程表值（ESC集成间接式胎压专用）           $    $  Km       $    $  ANS000.BYTE007  $  X1X2X3X4
  $  002.倒数第三次重置时里程表值（ESC集成间接式胎压专用）           $    $  Km       $    $  ANS000.BYTE011  $  X1X2X3X4
  $  003.倒数第四次重置时里程表值（ESC集成间接式胎压专用）           $    $  Km       $    $  ANS000.BYTE015  $  X1X2X3X4
  $  004.最后一次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km       $    $  ANS001.BYTE003  $  X1X2X3X4
  $  005.最后二次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km       $    $  ANS001.BYTE007  $  X1X2X3X4
  $  006.最后三次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km       $    $  ANS001.BYTE011  $  X1X2X3X4
  $  007.最后四次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km       $    $  ANS001.BYTE015  $  X1X2X3X4
  $  008.左前轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -        $    $  ANS002.BYTE003  $  X
  $  009.右前轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -        $    $  ANS002.BYTE004  $  X
  $  010.左后轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -        $    $  ANS002.BYTE005  $  X
  $  011.右后轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -        $    $  ANS002.BYTE006  $  X
  $  012.左前轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $  -        $    $  ANS003.BYTE003  $  X
  $  013.右前轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $  -        $    $  ANS003.BYTE004  $  X
  $  014.左后轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $  -        $    $  ANS003.BYTE005  $  X
  $  015.右后轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $           $    $  ANS003.BYTE006  $  X
  $  016.胎压监测系统报警状态                                        $    $  -        $    $  ANS004.BYTE003  $  00:正常		01:欠压		50:系统故障		其他:-
  $  017.胎压监测系统的运行状态                                      $    $  -        $    $  ANS005.BYTE003  $  00:当前处于标定阶段不能识别欠压		01:标定阶段已完成可以识别欠压		其他:-
  $  018.胎压监测高敏感模式触发计时器                                $    $  s        $    $  ANS005.BYTE004  $  XY*(-)
  $  019.胎压监测高敏感模式触发等级                                  $    $  %        $    $  ANS005.BYTE006  $  X*(-)
  $  020.左前轮80-90km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE007  $  00:未完成		11:完成		其他:-
  $  021.左前轮90-100km/h WSA标定完成情况                            $    $  -        $    $  ANS005.BYTE009  $  00:未完成		11:完成		其他:-
  $  022.左前轮100-110km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE011  $  00:未完成		11:完成		其他:-
  $  023.左前轮110-120km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE013  $  00:未完成		11:完成		其他:-
  $  024.左前轮40-50km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE008  $  00:未完成		11:完成		其他:-
  $  025.左前轮50-60km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE010  $  00:未完成		11:完成		其他:-
  $  026.左前轮60-70km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE012  $  00:未完成		11:完成		其他:-
  $  027.左前轮70-80km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE014  $  00:未完成		11:完成		其他:-
  $  028.右前轮80-90km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE009  $  00:未完成		11:完成		其他:-
  $  029.右前轮90-100km/h WSA标定完成情况                            $    $  -        $    $  ANS005.BYTE011  $  00:未完成		11:完成		其他:-
  $  030.右前轮100-110km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE013  $  00:未完成		11:完成		其他:-
  $  031.右前轮110-120km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE015  $  00:未完成		11:完成		其他:-
  $  032.右前轮40-50km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE010  $  00:未完成		11:完成		其他:-
  $  033.右前轮50-60km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE012  $  00:未完成		11:完成		其他:-
  $  034.右前轮60-70km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE014  $  00:未完成		11:完成		其他:-
  $  035.右前轮70-80km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE016  $  00:未完成		11:完成		其他:-
  $  036.左后轮80-90km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE011  $  00:未完成		11:完成		其他:-
  $  037.左后轮90-100km/h WSA标定完成情况                            $    $  -        $    $  ANS005.BYTE013  $  00:未完成		11:完成		其他:-
  $  038.左后轮100-110km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE015  $  00:未完成		11:完成		其他:-
  $  039.左后轮110-120km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE017  $  00:未完成		11:完成		其他:-
  $  040.左后轮40-50km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE012  $  00:未完成		11:完成		其他:-
  $  041.左后轮50-60km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE014  $  00:未完成		11:完成		其他:-
  $  042.左后轮60-70km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE016  $  00:未完成		11:完成		其他:-
  $  043.左后轮70-80km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE018  $  00:未完成		11:完成		其他:-
  $  044.右后轮80-90km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE013  $  00:未完成		11:完成		其他:-
  $  045.右后轮90-100km/h WSA标定完成情况                            $    $  -        $    $  ANS005.BYTE015  $  00:未完成		11:完成		其他:-
  $  046.右后轮100-110km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE017  $  00:未完成		11:完成		其他:-
  $  047.右后轮110-120km/h WSA标定完成情况                           $    $  -        $    $  ANS005.BYTE019  $  00:未完成		11:完成		其他:-
  $  048.右后轮40-50km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE014  $  00:未完成		11:完成		其他:-
  $  049.右后轮50-60km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE016  $  00:未完成		11:完成		其他:-
  $  050.右后轮60-70km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE018  $  00:未完成		11:完成		其他:-
  $  051.右后轮70-80km/h WSA标定完成情况                             $    $  -        $    $  ANS005.BYTE020  $  00:未完成		11:完成		其他:-
  $  052.激活状态下的行驶天数                                        $    $  Day      $    $  ANS006.BYTE003  $  X
  $  053.WRA激活状态下的行驶小时数                                   $    $  h        $    $  ANS006.BYTE004  $  X
  $  054.WRA激活状态下的行驶分钟数                                   $    $  min      $    $  ANS006.BYTE005  $  X
  $  055.WRA激活状态下的行驶秒数                                     $    $  s        $    $  ANS006.BYTE006  $  X
  $  056.WSA激活状态下，行驶速度为10-40km/h的天数                    $    $  Day      $    $  ANS006.BYTE007  $  X
  $  057.WSA激活状态下，行驶速度为10-40km/h的小时数                  $    $  h        $    $  ANS006.BYTE008  $  X
  $  058.WSA激活状态下，行驶速度为10-40km/h的分钟数                  $    $  min      $    $  ANS006.BYTE009  $  X
  $  059.WSA激活状态下，行驶速度为10-40km/h的秒数                    $    $  s        $    $  ANS006.BYTE010  $  X
  $  060.WSA激活状态下，行驶速度为40-60km/h的天数                    $    $  Day      $    $  ANS006.BYTE011  $  X
  $  061.WSA激活状态下，行驶速度在40-60km/h的小时数                  $    $  h        $    $  ANS006.BYTE012  $  X
  $  062.WSA激活状态下，行驶速度在40-60km/h的分钟数                  $    $  min      $    $  ANS006.BYTE013  $  X
  $  063.WSA激活状态下，行驶速度在40-60km/h的秒数                    $    $  s        $    $  ANS006.BYTE014  $  X
  $  064.WSA激活状态下，行驶速度在60-80km/h的天数                    $    $  Day      $    $  ANS006.BYTE015  $  X
  $  065.WSA激活状态下，行驶速度在60-80km/h的小时数                  $    $  h        $    $  ANS006.BYTE016  $  X
  $  066.WSA激活状态下，行驶速度在60-80km/h的分钟数                  $    $  min      $    $  ANS006.BYTE017  $  X
  $  067.WSA激活状态下，行驶速度在60-80km/h的秒数                    $    $  s        $    $  ANS006.BYTE018  $  X
  $  068.WSA激活状态下，行驶速度在80-100km/h的天数                   $    $  Day      $    $  ANS006.BYTE019  $  X
  $  069.WSA激活状态下，行驶速度在80-100km/h的小时数                 $    $  h        $    $  ANS006.BYTE020  $  X
  $  070.WSA激活状态下，行驶速度在80-100km/h的分钟数                 $    $  min      $    $  ANS006.BYTE021  $  X
  $  071.WSA激活状态下，行驶速度在80-100km/h的秒数                   $    $  s        $    $  ANS006.BYTE022  $  X
  $  072.WSA激活状态下，行驶速度在100-120km/h的天数                  $    $  Day      $    $  ANS006.BYTE023  $  X
  $  073.WSA激活状态下，行驶速度在100-120km/h的小时数                $    $  h        $    $  ANS006.BYTE024  $  X
  $  074.WSA激活状态下，行驶速度在100-120km/h的分钟数                $    $  min      $    $  ANS006.BYTE025  $  X
  $  075.WSA active WSA激活状态下，行驶速度在100-120km/h的秒数       $    $  s        $    $  ANS006.BYTE026  $  X
  $  076.WSA模块激活时间                                             $    $  S        $    $  ANS006.BYTE027  $  X1X2X3X4
  $  077.WRA WSA激活时间                                             $    $  S        $    $  ANS006.BYTE031  $  X1X2X3X4
  $  078.WRA启用时间, 以百分比表示                                   $    $  %        $    $  ANS006.BYTE035  $  X
  $  079.WSA启用时间, 以百分比表示                                   $    $  %        $    $  ANS006.BYTE036  $  X


