$~#6$~#14$~500$~77B
;******************************************************************************************************************************************************

车型代号:CN202SR_IN
车型:HECTOR
排量:2.0D
年份:2019
模块名缩写:DCDC
模块名:直流转换器块
供应商:sevcon
诊断代码:CN202SR_IN_2019_DCDC_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:773 02 10 01 00 00 00 00 00          $~          77B 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:773 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:773 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:773 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/HECTORDTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:773 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:773 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:773 03 22 F1 90 00 00 00 00          $%
	$%	REQ001:773 03 22 F1 86 00 00 00 00          $%
	$%	REQ002:773 03 22 F1 8A 00 00 00 00          $%
	$%	REQ003:773 03 22 F1 8B 00 00 00 00          $%
	$%	REQ004:773 03 22 F1 92 00 00 00 00          $%
	$%	REQ005:773 03 22 F1 94 00 00 00 00          $%
	$%	REQ006:773 03 22 F1 CB 00 00 00 00          $%

  $%  000:SGMW VIN                              $%    $%  ANS000.BYTE003  $%  17个字节的ASCII显示
  $%  001:Active Diagnostic Session             $%    $%  ANS001.BYTE003  $%  X
  $%  002:Supplier Identifier Information       $%    $%  ANS002.BYTE003  $%  07个字节的ASCII显示
  $%  003:ECUManufacturingDate                  $%    $%  ANS003.BYTE003  $%  04个字节的HEX显示
  $%  004:Supplier ECU Hardware Number          $%    $%  ANS004.BYTE003  $%  10个字节的ASCII显示
  $%  005:Supplier ECU Software Number          $%    $%  ANS005.BYTE003  $%  10个字节的ASCII显示
  $%  006:EndModelPartNumber(SGMW P/N)          $%    $%  ANS006.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

   00.Data flow

	$	REQ000:773 03 22 D0 00 00 00 00 00          $
	$	REQ001:773 03 22 D0 01 00 00 00 00          $
	$	REQ002:773 03 22 D0 02 00 00 00 00          $
	$	REQ003:773 03 22 D0 03 00 00 00 00          $
	$	REQ004:773 03 22 D0 04 00 00 00 00          $
	$	REQ005:773 03 22 D0 05 00 00 00 00          $
	$	REQ006:773 03 22 D0 06 00 00 00 00          $
	$	REQ007:773 03 22 D0 07 00 00 00 00          $
	$	REQ008:773 03 22 D0 08 00 00 00 00          $
	$	REQ009:773 03 22 D0 09 00 00 00 00          $
	$	REQ010:773 03 22 D0 10 00 00 00 00          $
	$	REQ011:773 03 22 D0 11 00 00 00 00          $
	$	REQ012:773 03 22 D0 12 00 00 00 00          $
	$	REQ013:773 03 22 D0 13 00 00 00 00          $
	$	REQ014:773 03 22 D0 14 00 00 00 00          $
	$	REQ015:773 03 22 D0 15 00 00 00 00          $
	$	REQ016:773 03 22 D0 16 00 00 00 00          $
	$	REQ017:773 03 22 D0 17 00 00 00 00          $
	$	REQ018:773 03 22 D0 18 00 00 00 00          $
	$	REQ019:773 03 22 D0 19 00 00 00 00          $
	$	REQ020:773 03 22 D0 20 00 00 00 00          $
	$	REQ021:773 03 22 D0 21 00 00 00 00          $
	$	REQ022:773 03 22 D0 22 00 00 00 00          $
	$	REQ023:773 03 22 F0 11 00 00 00 00          $
	$	REQ024:773 03 22 F0 12 00 00 00 00          $
	$	REQ025:773 03 22 F0 13 00 00 00 00          $
	$	REQ026:773 03 22 F0 14 00 00 00 00          $

  $  000.Actual 48V side voltage                         $    $  V        $    $  ANS000.BYTE003  $  XY*0.00390625
  $  001.Actual 48V side current                         $    $  A        $    $  ANS001.BYTE003  $  [0000-7FFF]:XY*0.00390625+0		[8000-FFFF]:(XY-65535)*0.00390625+0
  $  002.Actual 12V side voltage                         $    $  V        $    $  ANS002.BYTE003  $  XY*0.001953
  $  003.Actual 12V side current                         $    $  A        $    $  ANS003.BYTE003  $  [0000-7FFF]:XY*0.015625+0		[8000-FFFF]:(XY-65535)*0.015625+0
  $  004.Actual 48V side internal  voltage                 $    $  V        $    $  ANS004.BYTE003  $  XY*0.00390625
  $  005.Actual 12V side internal voltage                  $    $  V        $    $  ANS005.BYTE003  $  XY*0.001953
  $  006.HCU request mode                                $    $  -        $    $  ANS006.BYTE003  $  00:Not available signal		01:Standby		02:Buck		03:Invalid		04:Precharge		其他:-
  $  007.HCU request voltage setpoint for 12V side       $    $  V        $    $  ANS007.BYTE003  $  [0000-7FFF]:XY*0.001953+0		[8000-FFFF]:(XY-65535)*0.001953+0
  $  008.HCU request current setpoint for 12V side        $    $  A        $    $  ANS008.BYTE003  $  [0000-7FFF]:XY*0.015625+0		[8000-FFFF]:(XY-65535)*0.015625+0
  $  009.HCU request voltage setpoint for 48V side       $    $  V        $    $  ANS009.BYTE003  $  [0000-7FFF]:XY*0.0078125+0		[8000-FFFF]:(XY-65535)*0.0078125+0
  $  010.HCU request current setpoint for 48V side        $    $  A        $    $  ANS010.BYTE003  $  [0000-7FFF]:XY*0.00390625+0		[8000-FFFF]:(XY-65535)*0.00390625+0
  $  011.DCDC power derating reason                      $    $  -        $    $  ANS011.BYTE003  $  00:No derating		01:Temperature		02:Max power		03:Highside voltage		04:Invalid		05:Highside current limit		06:Lowside current limit		其他:-
  $  012.DCDC actual mode                                $    $  -        $    $  ANS012.BYTE003  $  00:Init		01:Standby		02:Precharge		03:Buck		04:Invalid		05:Failure		06:Shutdown		07:Sleep		08:Limphome Buck		其他:-
  $  013.DCDC temperature                                $    $  -        $    $  ANS013.BYTE003  $  [0000-7FFF]:XY*0.0078125+0		[8000-FFFF]:(XY-65535)*0.0078125+0
  $  014.Actual control loop                             $    $  -        $    $  ANS014.BYTE003  $  00:Voltage loop		01:Current loop		其他:-
  $  015.Actual Driver power supply voltage              $    $  V        $    $  ANS015.BYTE003  $  XY*0.001953
  $  016.Actual dutycycle                                $    $  -        $    $  ANS016.BYTE003  $  XY*0.0002441
  $  017.BnetOCP status                                  $    $  -        $    $  ANS017.BYTE003  $  00:Normal		01:Error		其他:-
  $  018.BnetOVP status                                  $    $  -        $    $  ANS018.BYTE003  $  00:Normal		01:Error		其他:-
  $  019.TnetOCP status                                  $    $  -        $    $  ANS019.BYTE003  $  00:Normal		01:Error		其他:-
  $  020.TnetOVP status                                  $    $  -        $    $  ANS020.BYTE003  $  00:Normal		01:Error		其他:-
  $  021.5V status                                       $    $  -        $    $  ANS021.BYTE003  $  00:Normal		01:Error		其他:-
  $  022.actual 2.5V AD                                  $    $  -        $    $  ANS022.BYTE003  $  XY
  $  023.ECU Voltage                                     $    $  V        $    $  ANS023.BYTE003  $  X*0.1
  $  024.Engine Speed                                    $    $  rpm      $    $  ANS024.BYTE003  $  XY*0.25
  $  025.Vehicle Speed                                   $    $  km/h     $    $  ANS025.BYTE003  $  XY*0.015625
  $  026.Vehicle Odometer                                $    $  km       $    $  ANS026.BYTE003  $  X1X2X3X4*0.015625


