$~#6$~#14$~500$~75D
;******************************************************************************************************************************************************

车型代号:CN202M
车型:RM-5
排量:1.5L
年份:2019
模块名缩写:SMM
模块名:座椅记忆模块
供应商:延锋安道拓
诊断代码:CN210S_280T_2020_SMM_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:755 02 10 01 00 00 00 00 00          $~          75D 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:755 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:755 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:755 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/RS-5DTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:755 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:755 03 22 F1 8A 00 00 00 00          $%
	$%	REQ001:755 03 22 F1 90 00 00 00 00          $%
	$%	REQ002:755 03 22 F1 93 00 00 00 00          $%
	$%	REQ003:755 03 22 F1 95 00 00 00 00          $%
	$%	REQ004:755 03 22 F1 CB 00 00 00 00          $%
	$%	REQ005:755 03 22 F1 88 00 00 00 00          $%
	$%	REQ006:755 03 22 F1 91 00 00 00 00          $%

  $%  000:供应商信息                $%    $%  ANS000.BYTE003  $%  07个字节的ASCII显示
  $%  001:VIN                       $%    $%  ANS001.BYTE003  $%  17个字节的ASCII显示
  $%  002:供应商ECU硬件版本号       $%    $%  ANS002.BYTE003  $%  06个字节的ASCII显示
  $%  003:供应商ECU软件版本号       $%    $%  ANS003.BYTE003  $%  06个字节的ASCII显示
  $%  004:零件号                    $%    $%  ANS004.BYTE003  $%  X1X2X3X4
  $%  005:SGMW软件号                $%    $%  ANS005.BYTE003  $%  X1X2X3X4
  $%  006:SGMW硬件号                $%    $%  ANS006.BYTE003  $%  X1X2X3X4

;******************************************************************************************************************************************************
数据流

   00.数据流

	$	REQ000:755 03 22 B0 01 00 00 00 00          $
	$	REQ001:755 03 22 B0 0B 00 00 00 00          $
	$	REQ002:755 03 22 B0 0C 00 00 00 00          $
	$	REQ003:755 03 22 B0 0D 00 00 00 00          $
	$	REQ004:755 03 22 B0 0E 00 00 00 00          $
	$	REQ005:755 03 22 B0 0F 00 00 00 00          $
	$	REQ006:755 03 22 B0 10 00 00 00 00          $
	$	REQ007:755 03 22 B0 11 00 00 00 00          $
	$	REQ008:755 03 22 B0 12 00 00 00 00          $
	$	REQ009:755 03 22 B0 13 00 00 00 00          $
	$	REQ010:755 03 22 B0 14 00 00 00 00          $
	$	REQ011:755 03 22 B0 15 00 00 00 00          $
	$	REQ012:755 03 22 B0 16 00 00 00 00          $
	$	REQ013:755 03 22 B0 02 00 00 00 00          $
	$	REQ014:755 03 22 B0 03 00 00 00 00          $
	$	REQ015:755 03 22 B0 17 00 00 00 00          $

  $  000.座椅前部电机位置计数                   $    $  -     $    $  ANS000.BYTE003  $  XY
  $  001.座椅后部电机位置计数                   $    $  -     $    $  ANS000.BYTE005  $  XY
  $  002.滑道电机位置计数                       $    $  -     $    $  ANS000.BYTE007  $  XY
  $  003.靠背电机位置计数                       $    $  -     $    $  ANS000.BYTE009  $  XY
  $  004.左后视镜上下电机位置计数               $    $  -     $    $  ANS000.BYTE011  $  XY
  $  005.右后视镜上下电机位置计数               $    $  -     $    $  ANS000.BYTE013  $  XY
  $  006.左后视镜左右电机位置计数               $    $  -     $    $  ANS000.BYTE015  $  XY
  $  007.右后视镜左右电机位置计数               $    $  -     $    $  ANS000.BYTE017  $  XY
  $  008.舒适上下车设置状态                     $    $  -     $    $  ANS001.BYTE007  $  00:不可用		01:关闭		02:打开		其他:-
  $  009.倒挡外后视镜倾斜设置状态               $    $  -     $    $  ANS001.BYTE003  $  00:无请求		01:关闭		02:两边倾斜		03:左边倾斜		04:右边倾斜		其他:-
  $  010.记忆用户状态设置状态                   $    $  -     $    $  ANS001.BYTE008  $  00:无请求		01:用户1		02:用户2		03:用户3		04:用户4		05:用户5		06:用户6		07:用户7		08:用户8		09:用户9		0A:用户10		其他:-
  $  011.记忆功能操作设置状态                   $    $  -     $    $  ANS001.BYTE004  $  00:不可用		01:恢复		02:保存		03:新建用户		04:调用		05:删除		06:运动中		其他:-
  $  012.有后视镜或座椅调节操作                 $    $  -     $    $  ANS001.BYTE012  $  00:无操作		01:有操作		其他:-
  $  013.驾驶员座椅加热控制状态                 $    $  -     $    $  ANS001.BYTE008  $  00:正常		01:故障		其他:-
  $  014.用户1的座椅前部电机位置计数            $    $  -     $    $  ANS002.BYTE003  $  XY
  $  015.用户1的座椅后部电机位置计数            $    $  -     $    $  ANS002.BYTE005  $  XY
  $  016.用户1的滑道电机位置计数                $    $  -     $    $  ANS002.BYTE007  $  XY
  $  017.用户1的靠背电机位置计数                $    $  -     $    $  ANS002.BYTE009  $  XY
  $  018.用户1的左后视镜上下电机位置计数        $    $  -     $    $  ANS002.BYTE011  $  XY
  $  019.用户1的右后视镜上下电机位置计数        $    $  -     $    $  ANS002.BYTE013  $  XY
  $  020.用户1的左后视镜左右电机位置计数        $    $  -     $    $  ANS002.BYTE015  $  XY
  $  021.用户1的右后视镜左右电机位置计数        $    $  -     $    $  ANS002.BYTE017  $  XY
  $  022.用户2的座椅前部电机位置计数            $    $  -     $    $  ANS003.BYTE003  $  XY
  $  023.用户2的座椅后部电机位置计数            $    $  -     $    $  ANS003.BYTE005  $  XY
  $  024.用户2的滑道电机位置计数                $    $  -     $    $  ANS003.BYTE007  $  XY
  $  025.用户2的靠背电机位置计数                $    $  -     $    $  ANS003.BYTE009  $  XY
  $  026.用户2的左后视镜上下电机位置计数        $    $  -     $    $  ANS003.BYTE011  $  XY
  $  027.用户2的右后视镜上下电机位置计数        $    $  -     $    $  ANS003.BYTE013  $  XY
  $  028.用户2的左后视镜左右电机位置计数        $    $  -     $    $  ANS003.BYTE015  $  XY
  $  029.用户2的右后视镜左右电机位置计数        $    $  -     $    $  ANS003.BYTE017  $  XY
  $  030.用户3的座椅前部电机位置计数            $    $  -     $    $  ANS004.BYTE003  $  XY
  $  031.用户3的座椅后部电机位置计数            $    $  -     $    $  ANS004.BYTE005  $  XY
  $  032.用户3的滑道电机位置计数                $    $  -     $    $  ANS004.BYTE007  $  XY
  $  033.用户3的靠背电机位置计数                $    $  -     $    $  ANS004.BYTE009  $  XY
  $  034.用户3的左后视镜上下电机位置计数        $    $  -     $    $  ANS004.BYTE011  $  XY
  $  035.用户3的右后视镜上下电机位置计数        $    $  -     $    $  ANS004.BYTE013  $  XY
  $  036.用户3的左后视镜左右电机位置计数        $    $  -     $    $  ANS004.BYTE015  $  XY
  $  037.用户3的右后视镜左右电机位置计数        $    $  -     $    $  ANS004.BYTE017  $  XY
  $  038.用户4的座椅前部电机位置计数            $    $  -     $    $  ANS005.BYTE003  $  XY
  $  039.用户4的座椅后部电机位置计数            $    $  -     $    $  ANS005.BYTE005  $  XY
  $  040.用户4的滑道电机位置计数                $    $  -     $    $  ANS005.BYTE007  $  XY
  $  041.用户4的靠背电机位置计数                $    $  -     $    $  ANS005.BYTE009  $  XY
  $  042.用户4的左后视镜上下电机位置计数        $    $  -     $    $  ANS005.BYTE011  $  XY
  $  043.用户4的右后视镜上下电机位置计数        $    $  -     $    $  ANS005.BYTE013  $  XY
  $  044.用户4的左后视镜左右电机位置计数        $    $  -     $    $  ANS005.BYTE015  $  XY
  $  045.用户4的右后视镜左右电机位置计数        $    $  -     $    $  ANS005.BYTE017  $  XY
  $  046.用户5的座椅前部电机位置计数            $    $  -     $    $  ANS006.BYTE003  $  XY
  $  047.用户5的座椅后部电机位置计数            $    $  -     $    $  ANS006.BYTE005  $  XY
  $  048.用户5的滑道电机位置计数                $    $  -     $    $  ANS006.BYTE007  $  XY
  $  049.用户5的靠背电机位置计数                $    $  -     $    $  ANS006.BYTE009  $  XY
  $  050.用户5的左后视镜上下电机位置计数        $    $  -     $    $  ANS006.BYTE011  $  XY
  $  051.用户5的右后视镜上下电机位置计数        $    $  -     $    $  ANS006.BYTE013  $  XY
  $  052.用户5的左后视镜左右电机位置计数        $    $  -     $    $  ANS006.BYTE015  $  XY
  $  053.用户5的右后视镜左右电机位置计数        $    $  -     $    $  ANS006.BYTE017  $  XY
  $  054.用户6的座椅前部电机位置计数            $    $  -     $    $  ANS007.BYTE003  $  XY
  $  055.用户6的座椅后部电机位置计数            $    $  -     $    $  ANS007.BYTE005  $  XY
  $  056.用户6的滑道电机位置计数                $    $  -     $    $  ANS007.BYTE007  $  XY
  $  057.用户6的靠背电机位置计数                $    $  -     $    $  ANS007.BYTE009  $  XY
  $  058.用户6的左后视镜上下电机位置计数        $    $  -     $    $  ANS007.BYTE011  $  XY
  $  059.用户6的右后视镜上下电机位置计数        $    $  -     $    $  ANS007.BYTE013  $  XY
  $  060.用户6的左后视镜左右电机位置计数        $    $  -     $    $  ANS007.BYTE015  $  XY
  $  061.用户6的右后视镜左右电机位置计数        $    $  -     $    $  ANS007.BYTE017  $  XY
  $  062.用户7的座椅前部电机位置计数            $    $  -     $    $  ANS008.BYTE003  $  XY
  $  063.用户7的座椅后部电机位置计数            $    $  -     $    $  ANS008.BYTE005  $  XY
  $  064.用户7的滑道电机位置计数                $    $  -     $    $  ANS008.BYTE007  $  XY
  $  065.用户7的靠背电机位置计数                $    $  -     $    $  ANS008.BYTE009  $  XY
  $  066.用户7的左后视镜上下电机位置计数        $    $  -     $    $  ANS008.BYTE011  $  XY
  $  067.用户7的右后视镜上下电机位置计数        $    $  -     $    $  ANS008.BYTE013  $  XY
  $  068.用户7的左后视镜左右电机位置计数        $    $  -     $    $  ANS008.BYTE015  $  XY
  $  069.用户7的右后视镜左右电机位置计数        $    $  -     $    $  ANS008.BYTE017  $  XY
  $  070.用户8的座椅前部电机位置计数            $    $  -     $    $  ANS009.BYTE003  $  XY
  $  071.用户8的座椅后部电机位置计数            $    $  -     $    $  ANS009.BYTE005  $  XY
  $  072.用户8的滑道电机位置计数                $    $  -     $    $  ANS009.BYTE007  $  XY
  $  073.用户8的靠背电机位置计数                $    $  -     $    $  ANS009.BYTE009  $  XY
  $  074.用户8的左后视镜上下电机位置计数        $    $  -     $    $  ANS009.BYTE011  $  XY
  $  075.用户8的右后视镜上下电机位置计数        $    $  -     $    $  ANS009.BYTE013  $  XY
  $  076.用户8的左后视镜左右电机位置计数        $    $  -     $    $  ANS009.BYTE015  $  XY
  $  077.用户8的右后视镜左右电机位置计数        $    $  -     $    $  ANS009.BYTE017  $  XY
  $  078.用户9的座椅前部电机位置计数            $    $  -     $    $  ANS010.BYTE003  $  XY
  $  079.用户9的座椅后部电机位置计数            $    $  -     $    $  ANS010.BYTE005  $  XY
  $  080.用户9的滑道电机位置计数                $    $  -     $    $  ANS010.BYTE007  $  XY
  $  081.用户9的靠背电机位置计数                $    $  -     $    $  ANS010.BYTE009  $  XY
  $  082.用户9的左后视镜上下电机位置计数        $    $  -     $    $  ANS010.BYTE011  $  XY
  $  083.用户9的右后视镜上下电机位置计数        $    $  -     $    $  ANS010.BYTE013  $  XY
  $  084.用户9的左后视镜左右电机位置计数        $    $  -     $    $  ANS010.BYTE015  $  XY
  $  085.用户9的右后视镜左右电机位置计数        $    $  -     $    $  ANS010.BYTE017  $  XY
  $  086.用户10的座椅前部电机位置计数           $    $  -     $    $  ANS011.BYTE003  $  XY
  $  087.用户10的座椅后部电机位置计数           $    $  -     $    $  ANS011.BYTE005  $  XY
  $  088.用户10的滑道电机位置计数               $    $  -     $    $  ANS011.BYTE007  $  XY
  $  089.用户10的靠背电机位置计数               $    $  -     $    $  ANS011.BYTE009  $  XY
  $  090.用户10的左后视镜上下电机位置计数       $    $  -     $    $  ANS011.BYTE011  $  XY
  $  091.用户10的右后视镜上下电机位置计数       $    $  -     $    $  ANS011.BYTE013  $  XY
  $  092.用户10的左后视镜左右电机位置计数       $    $  -     $    $  ANS011.BYTE015  $  XY
  $  093.用户10的右后视镜左右电机位置计数       $    $  -     $    $  ANS011.BYTE017  $  XY
  $  094.前抬升电机向上软止点                   $    $  -     $    $  ANS012.BYTE003  $  XY
  $  095.前抬升电机向下软止点                   $    $  -     $    $  ANS012.BYTE005  $  XY
  $  096.后抬升电机向上软止点                   $    $  -     $    $  ANS012.BYTE007  $  XY
  $  097.后抬升电机向下软止点                   $    $  -     $    $  ANS012.BYTE009  $  XY
  $  098.滑轨电机向前软止点                     $    $  -     $    $  ANS012.BYTE011  $  XY
  $  099.滑轨电机向后软止点                     $    $  -     $    $  ANS012.BYTE013  $  XY
  $  100.靠背电机向前软止点                     $    $  -     $    $  ANS012.BYTE015  $  XY
  $  101.靠背电机向后软止点                     $    $  -     $    $  ANS012.BYTE017  $  XY
  $  102.座椅滑道电机软止点学习状态             $    $  -     $    $  ANS013.BYTE003  $  if(X1&0x80)y=@0134;else y=@0133;
  $  103.座椅靠背电机软止点学习状态             $    $  -     $    $  ANS013.BYTE003  $  if(X1&0x40)y=@0134;else y=@0133;
  $  104.座椅前部电机软止点学习状态             $    $  -     $    $  ANS013.BYTE003  $  if(X1&0x20)y=@0134;else y=@0133;
  $  105.座椅后部电机软止点学习状态             $    $  -     $    $  ANS013.BYTE003  $  if(X1&0x10)y=@0134;else y=@0133;
  $  106.滑道向前开关状态                       $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x80)y=@0086;else y=@0085;
  $  107.滑道向后开关状态                       $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x40)y=@0086;else y=@0085;
  $  108.座椅前部向上开关状态                   $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x20)y=@0086;else y=@0085;
  $  109.座椅前部向下开关状态                   $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x10)y=@0086;else y=@0085;
  $  110.座椅后部向上开关状态                   $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x8)y=@0086;else y=@0085;
  $  111.座椅后部向下开关状态                   $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x4)y=@0086;else y=@0085;
  $  112.靠背向前开关状态                       $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x2)y=@0086;else y=@0085;
  $  113.靠背向后开关状态                       $    $  -     $    $  ANS014.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  114.左后视镜向左开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x80)y=@0086;else y=@0085;
  $  115.左后视镜向右开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x40)y=@0086;else y=@0085;
  $  116.左后视镜向上开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x20)y=@0086;else y=@0085;
  $  117.左后视镜向下开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x10)y=@0086;else y=@0085;
  $  118.右后视镜向左开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x8)y=@0086;else y=@0085;
  $  119.右后视镜向右开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x4)y=@0086;else y=@0085;
  $  120.右后视镜向上开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x2)y=@0086;else y=@0085;
  $  121.右后视镜向下开关状态                   $    $  -     $    $  ANS015.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;


