$~#6$~#14$~500$~728
;******************************************************************************************************************************************************

车型代号:CN210M
车型:宝骏730
排量:N15T
年份:2019
模块名缩写:ESP
模块名:电子稳定程序
供应商:博世
诊断代码:CN210M_ESP_2019_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:720 02 10 01 00 00 00 00 00          $~          728 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:720 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:720 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:720 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/BJ730DTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:720 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:720 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:720 03 22 F1 90 00 00 00 00          $%
	$%	REQ001:720 03 22 F1 8A 00 00 00 00          $%
	$%	REQ002:720 03 22 F1 92 00 00 00 00          $%
	$%	REQ003:720 03 22 F1 94 00 00 00 00          $%
	$%	REQ004:720 03 22 F1 95 00 00 00 00          $%
	$%	REQ005:720 03 22 F1 CB 00 00 00 00          $%
	$%	REQ006:720 03 22 2D 42 00 00 00 00          $%

  $%  000:车辆标识信息（VIN）        $%    $%  ANS000.BYTE003  $%  17个字节的ASCII显示
  $%  001:供应商标识信息             $%    $%  ANS001.BYTE003  $%  07个字节的ASCII显示
  $%  002:供应商ECU硬件号            $%    $%  ANS002.BYTE003  $%  05个字节的HEX显示
  $%  003:供应商ECU软件号            $%    $%  ANS003.BYTE003  $%  03个字节的HEX显示
  $%  004:供应商ECU软件版本号        $%    $%  ANS004.BYTE003  $%  04个字节的HEX显示
  $%  005:零件号（SGMW P/N）         $%    $%  ANS005.BYTE003  $%  X1X2X3X4
  $%  006:胎压监测系统TPMS版本       $%    $%  ANS006.BYTE003  $%  16个字节的ASCII显示

;******************************************************************************************************************************************************
数据流

   00.所有数据

	$	REQ000:720 03 22 2D 00 00 00 00 00          $
	$	REQ001:720 03 22 2D 01 00 00 00 00          $
	$	REQ002:720 03 22 2D 03 00 00 00 00          $
	$	REQ003:720 03 22 2D 04 00 00 00 00          $
	$	REQ004:720 03 22 2D 05 00 00 00 00          $
	$	REQ005:720 03 22 2D 0F 00 00 00 00          $
	$	REQ006:720 03 22 2D 10 00 00 00 00          $
	$	REQ007:720 03 22 2D 35 00 00 00 00          $
	$	REQ008:720 03 22 2D 36 00 00 00 00          $
	$	REQ009:720 03 22 2D 38 00 00 00 00          $
	$	REQ010:720 03 22 2D 39 00 00 00 00          $
	$	REQ011:720 03 22 2D 40 00 00 00 00          $
	$	REQ012:720 03 22 2D 41 00 00 00 00          $
	$	REQ013:720 03 22 2D 43 00 00 00 00          $
	$	REQ014:720 03 22 2D 02 00 00 00 00          $
	$	REQ015:720 03 22 2D 07 00 00 00 00          $
	$	REQ016:720 03 22 2D 08 00 00 00 00          $

  $  000.车速                                                        $    $  km/h      $    $  ANS000.BYTE003  $  XY*0.056625
  $  001.前左侧轮速                                                  $    $  km/h      $    $  ANS000.BYTE005  $  XY*0.056625
  $  002.前右侧轮速                                                  $    $  km/h      $    $  ANS000.BYTE007  $  XY*0.056625
  $  003.后左侧轮速                                                  $    $  km/h      $    $  ANS000.BYTE009  $  XY*0.056625
  $  004.后右侧轮速                                                  $    $  km/h      $    $  ANS000.BYTE011  $  XY*0.056625
  $  005.电池电压                                                    $    $  V         $    $  ANS001.BYTE003  $  X*0.08
  $  006.填充状态                                                    $    $  -         $    $  ANS002.BYTE003  $  00:正在填充未完成		AA:填充完成且OK		EE:填充完成且not OK		FF:NA		其他:-
  $  007.EOL状态                                                     $    $  -         $    $  ANS003.BYTE003  $  00:离线测试未完成		AA:离线测试完成且OK		11F:离线测试完成且not OK		FF:NA		其他:-
  $  008.主缸压力                                                    $    $  bar       $    $  ANS004.BYTE003  $  [0000-7FFF]:XY*0.0153+0		[8000-FFFF]:(XY-65535)*0.0153+0
  $  009.转向角度                                                    $    $  deg       $    $  ANS004.BYTE005  $  [0000-7FFF]:XY*0.1+0		[8000-FFFF]:(XY-65535)*0.1+0
  $  010.偏转角度                                                    $    $  rad/s     $    $  ANS004.BYTE007  $  [0000-7FFF]:XY*0.00213+0		[8000-FFFF]:(XY-65535)*0.00213+0
  $  011.横摆加速度                                                  $    $  m/s2      $    $  ANS004.BYTE009  $  [0000-7FFF]:XY*0.02712+0		[8000-FFFF]:(XY-65535)*0.02712+0
  $  012.纵向加速度                                                  $    $  m/s2      $    $  ANS004.BYTE011  $  [0000-7FFF]:XY*0.02712+0		[8000-FFFF]:(XY-65535)*0.02712+0
  $  013.SAS偏移值                                                   $    $  rad       $    $  ANS005.BYTE003  $  [0000-7FFF]:XY*0.001+0		[8000-FFFF]:(XY-65535)*0.001+0
  $  014.系统名称                                                    $    $  -         $    $  ANS006.BYTE003  $  6F2B6:ESP		6522D:ABS		其他:-
  $  015.最后一次重置时里程表值（ESC集成间接式胎压专用）             $    $  Km        $    $  ANS007.BYTE003  $  X1X2X3X4
  $  016.倒数第二次重置时里程表值（ESC集成间接式胎压专用）           $    $  Km        $    $  ANS007.BYTE007  $  X1X2X3X4
  $  017.倒数第三次重置时里程表值（ESC集成间接式胎压专用）           $    $  Km        $    $  ANS007.BYTE011  $  X1X2X3X4
  $  018.倒数第四次重置时里程表值（ESC集成间接式胎压专用）           $    $  Km        $    $  ANS007.BYTE015  $  X1X2X3X4
  $  019.最后一次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km        $    $  ANS008.BYTE003  $  X1X2X3X4
  $  020.最后二次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km        $    $  ANS008.BYTE007  $  X1X2X3X4
  $  021.最后三次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km        $    $  ANS008.BYTE011  $  X1X2X3X4
  $  022.最后四次胎压报警时里程表值（ESC集成间接式胎压专用）         $    $  Km        $    $  ANS008.BYTE015  $  X1X2X3X4
  $  023.左前轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -         $    $  ANS009.BYTE003  $  X
  $  024.右前轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -         $    $  ANS009.BYTE004  $  X
  $  025.左后轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -         $    $  ANS009.BYTE005  $  X
  $  026.右后轮快速漏气指示数值（ESC集成间接式胎压专用）             $    $  -         $    $  ANS009.BYTE006  $  X
  $  027.左前轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $  -         $    $  ANS010.BYTE003  $  X
  $  028.右前轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $  -         $    $  ANS010.BYTE004  $  X
  $  029.左后轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $  -         $    $  ANS010.BYTE005  $  X
  $  030.右后轮慢速漏气指示数值（ESC集成间接式胎压专用）             $    $            $    $  ANS010.BYTE006  $  X
  $  031.胎压监测系统报警状态                                        $    $  -         $    $  ANS011.BYTE003  $  00:正常		01:欠压		50:系统故障		其他:-
  $  032.胎压监测系统的运行状态                                      $    $  -         $    $  ANS012.BYTE003  $  00:当前处于标定阶段不能识别欠压		01:标定阶段已完成可以识别欠压		其他:-
  $  033.胎压监测高敏感模式触发计时器                                $    $  s         $    $  ANS012.BYTE004  $  XY*(-)
  $  034.胎压监测高敏感模式触发等级                                  $    $  %         $    $  ANS012.BYTE006  $  X*(-)
  $  035.左前轮80-90km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE007  $  00:未完成		11:完成		其他:-
  $  036.左前轮90-100km/h WSA标定完成情况                            $    $  -         $    $  ANS012.BYTE009  $  00:未完成		11:完成		其他:-
  $  037.左前轮100-110km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE011  $  00:未完成		11:完成		其他:-
  $  038.左前轮110-120km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE013  $  00:未完成		11:完成		其他:-
  $  039.左前轮40-50km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE008  $  00:未完成		11:完成		其他:-
  $  040.左前轮50-60km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE010  $  00:未完成		11:完成		其他:-
  $  041.左前轮60-70km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE012  $  00:未完成		11:完成		其他:-
  $  042.左前轮70-80km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE014  $  00:未完成		11:完成		其他:-
  $  043.右前轮80-90km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE009  $  00:未完成		11:完成		其他:-
  $  044.右前轮90-100km/h WSA标定完成情况                            $    $  -         $    $  ANS012.BYTE011  $  00:未完成		11:完成		其他:-
  $  045.右前轮100-110km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE013  $  00:未完成		11:完成		其他:-
  $  046.右前轮110-120km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE015  $  00:未完成		11:完成		其他:-
  $  047.右前轮40-50km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE010  $  00:未完成		11:完成		其他:-
  $  048.右前轮50-60km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE012  $  00:未完成		11:完成		其他:-
  $  049.右前轮60-70km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE014  $  00:未完成		11:完成		其他:-
  $  050.右前轮70-80km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE016  $  00:未完成		11:完成		其他:-
  $  051.左后轮80-90km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE011  $  00:未完成		11:完成		其他:-
  $  052.左后轮90-100km/h WSA标定完成情况                            $    $  -         $    $  ANS012.BYTE013  $  00:未完成		11:完成		其他:-
  $  053.左后轮100-110km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE015  $  00:未完成		11:完成		其他:-
  $  054.左后轮110-120km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE017  $  00:未完成		11:完成		其他:-
  $  055.左后轮40-50km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE012  $  00:未完成		11:完成		其他:-
  $  056.左后轮50-60km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE014  $  00:未完成		11:完成		其他:-
  $  057.左后轮60-70km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE016  $  00:未完成		11:完成		其他:-
  $  058.左后轮70-80km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE018  $  00:未完成		11:完成		其他:-
  $  059.右后轮80-90km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE013  $  00:未完成		11:完成		其他:-
  $  060.右后轮90-100km/h WSA标定完成情况                            $    $  -         $    $  ANS012.BYTE015  $  00:未完成		11:完成		其他:-
  $  061.右后轮100-110km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE017  $  00:未完成		11:完成		其他:-
  $  062.右后轮110-120km/h WSA标定完成情况                           $    $  -         $    $  ANS012.BYTE019  $  00:未完成		11:完成		其他:-
  $  063.右后轮40-50km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE014  $  00:未完成		11:完成		其他:-
  $  064.右后轮50-60km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE016  $  00:未完成		11:完成		其他:-
  $  065.右后轮60-70km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE018  $  00:未完成		11:完成		其他:-
  $  066.右后轮70-80km/h WSA标定完成情况                             $    $  -         $    $  ANS012.BYTE020  $  00:未完成		11:完成		其他:-
  $  067.激活状态下的行驶天数                                        $    $  Day       $    $  ANS013.BYTE003  $  X
  $  068.WRA激活状态下的行驶小时数                                   $    $  h         $    $  ANS013.BYTE004  $  X
  $  069.WRA激活状态下的行驶分钟数                                   $    $  min       $    $  ANS013.BYTE005  $  X
  $  070.WRA激活状态下的行驶秒数                                     $    $  s         $    $  ANS013.BYTE006  $  X
  $  071.WSA激活状态下，行驶速度为10-40km/h的天数                    $    $  Day       $    $  ANS013.BYTE007  $  X
  $  072.WSA激活状态下，行驶速度为10-40km/h的小时数                  $    $  h         $    $  ANS013.BYTE008  $  X
  $  073.WSA激活状态下，行驶速度为10-40km/h的分钟数                  $    $  min       $    $  ANS013.BYTE009  $  X
  $  074.WSA激活状态下，行驶速度为10-40km/h的秒数                    $    $  s         $    $  ANS013.BYTE010  $  X
  $  075.WSA激活状态下，行驶速度为40-60km/h的天数                    $    $  Day       $    $  ANS013.BYTE011  $  X
  $  076.WSA激活状态下，行驶速度在40-60km/h的小时数                  $    $  h         $    $  ANS013.BYTE012  $  X
  $  077.WSA激活状态下，行驶速度在40-60km/h的分钟数                  $    $  min       $    $  ANS013.BYTE013  $  X
  $  078.WSA激活状态下，行驶速度在40-60km/h的秒数                    $    $  s         $    $  ANS013.BYTE014  $  X
  $  079.WSA激活状态下，行驶速度在60-80km/h的天数                    $    $  Day       $    $  ANS013.BYTE015  $  X
  $  080.WSA激活状态下，行驶速度在60-80km/h的小时数                  $    $  h         $    $  ANS013.BYTE016  $  X
  $  081.WSA激活状态下，行驶速度在60-80km/h的分钟数                  $    $  min       $    $  ANS013.BYTE017  $  X
  $  082.WSA激活状态下，行驶速度在60-80km/h的秒数                    $    $  s         $    $  ANS013.BYTE018  $  X
  $  083.WSA激活状态下，行驶速度在80-100km/h的天数                   $    $  Day       $    $  ANS013.BYTE019  $  X
  $  084.WSA激活状态下，行驶速度在80-100km/h的小时数                 $    $  h         $    $  ANS013.BYTE020  $  X
  $  085.WSA激活状态下，行驶速度在80-100km/h的分钟数                 $    $  min       $    $  ANS013.BYTE021  $  X
  $  086.WSA激活状态下，行驶速度在80-100km/h的秒数                   $    $  s         $    $  ANS013.BYTE022  $  X
  $  087.WSA激活状态下，行驶速度在100-120km/h的天数                  $    $  Day       $    $  ANS013.BYTE023  $  X
  $  088.WSA激活状态下，行驶速度在100-120km/h的小时数                $    $  h         $    $  ANS013.BYTE024  $  X
  $  089.WSA激活状态下，行驶速度在100-120km/h的分钟数                $    $  min       $    $  ANS013.BYTE025  $  X
  $  090.WSA active WSA激活状态下，行驶速度在100-120km/h的秒数       $    $  s         $    $  ANS013.BYTE026  $  X
  $  091.WSA模块激活时间                                             $    $  S         $    $  ANS013.BYTE027  $  X1X2X3X4
  $  092.WRA WSA激活时间                                             $    $  S         $    $  ANS013.BYTE031  $  X1X2X3X4
  $  093.WRA启用时间, 以百分比表示                                   $    $  %         $    $  ANS013.BYTE035  $  X
  $  094.WSA启用时间, 以百分比表示                                   $    $  %         $    $  ANS013.BYTE036  $  X
  $  095.制动灯开关                                                  $    $  -         $    $  ANS001.BYTE004  $  if(X1&0x1)y=@0041;else y=@0040;
  $  096.ESP_PATA开关                                                $    $  -         $    $  ANS001.BYTE005  $  if(X1&0x1)y=@0041;else y=@0040;
  $  097.油阀继电器状态                                              $    $  -         $    $  ANS014.BYTE003  $  if(X1&0x1)y=@0041;else y=@0040;
  $  098.泵电机状态                                                  $    $  -         $    $  ANS014.BYTE004  $  if(X1&0x1)y=@0041;else y=@0040;
  $  099.右后输出阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x80)y=@0039;else y=@0038;
  $  100.右后输入阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x40)y=@0039;else y=@0038;
  $  101.左后输出阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x20)y=@0039;else y=@0038;
  $  102.左后输入阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x10)y=@0039;else y=@0038;
  $  103.右前输出阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x8)y=@0039;else y=@0038;
  $  104.右前输入阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x4)y=@0039;else y=@0038;
  $  105.左前输出阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x2)y=@0039;else y=@0038;
  $  106.左前输入阀状态                                              $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x1)y=@0039;else y=@0038;
  $  107.速度限制使能                                                $    $  -         $    $  ANS015.BYTE003  $  if(X1&0x1)y=@0043;else y=@0042;
  $  108.禁用阀门继电器关机                                          $    $  -         $    $  ANS016.BYTE003  $  if(X1&0x1)y=@0043;else y=@0042;


