$~#6$~#14$~500$~76B
;******************************************************************************************************************************************************

车型代号:CN210S
车型:宝骏560
排量:N15T
年份:2018
模块名缩写:T-Box
模块名:T-Box
供应商:慧翰微电子
诊断代码:CN201S_2018_T-BOX_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:763 02 10 01 00 00 00 00 00          $~          76B 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:763 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:763 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:763 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/RS-5DTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:763 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:763 02 11 03 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:763 03 22 F1 8B 00 00 00 00          $%
	$%	REQ001:763 03 22 F1 90 00 00 00 00          $%
	$%	REQ002:763 03 22 F1 93 00 00 00 00          $%
	$%	REQ003:763 03 22 F1 95 00 00 00 00          $%
	$%	REQ004:763 03 22 F1 CB 00 00 00 00          $%
	$%	REQ005:763 03 22 F1 8A 00 00 00 00          $%
	$%	REQ006:763 03 22 F1 8C 00 00 00 00          $%
	$%	REQ007:763 03 22 B0 00 00 00 00 00          $%
	$%	REQ008:763 03 22 B0 01 00 00 00 00          $%
	$%	REQ009:763 03 22 B0 03 00 00 00 00          $%
	$%	REQ010:763 03 22 B0 04 00 00 00 00          $%
	$%	REQ011:763 03 22 B0 05 00 00 00 00          $%
	$%	REQ012:763 03 22 B0 06 00 00 00 00          $%
	$%	REQ013:763 03 22 B0 07 00 00 00 00          $%
	$%	REQ014:763 03 22 B0 08 00 00 00 00          $%

  $%  000:ECU生产日期           $%    $%  ANS000.BYTE003  $%  04个字节的HEX显示
  $%  001:VIN                   $%    $%  ANS001.BYTE003  $%  17个字节的ASCII显示
  $%  002:供应商ECU硬件号       $%    $%  ANS002.BYTE003  $%  10个字节的ASCII显示
  $%  003:供应商ECU软件号       $%    $%  ANS003.BYTE003  $%  10个字节的ASCII显示
  $%  004:零件号SGMW P/N        $%    $%  ANS004.BYTE003  $%  X1X2X3X4
  $%  005:供应商标识符          $%    $%  ANS005.BYTE003  $%  07个字节的ASCII显示
  $%  006:产品序列号            $%    $%  ANS006.BYTE003  $%  20个字节的ASCII显示
  $%  007:MPU软件内部版本       $%    $%  ANS007.BYTE003  $%  24个字节的ASCII显示
  $%  008:SIM卡唯一码           $%    $%  ANS008.BYTE003  $%  20个字节的ASCII显示
  $%  009:蓝牙模块版本          $%    $%  ANS009.BYTE003  $%  20个字节的ASCII显示
  $%  010:模块唯一码            $%    $%  ANS010.BYTE003  $%  24个字节的ASCII显示
  $%  011:Modem软件版本         $%    $%  ANS011.BYTE003  $%  24个字节的ASCII显示
  $%  012:Modem硬件版本         $%    $%  ANS012.BYTE003  $%  24个字节的ASCII显示
  $%  013:Tbox序列号            $%    $%  ANS013.BYTE003  $%  12个字节的ASCII显示
  $%  014:蓝牙MAC地址           $%    $%  ANS014.BYTE003  $%  12个字节的ASCII显示

;******************************************************************************************************************************************************
数据流

   00.数据流

	$	REQ000:763 03 22 B0 82 00 00 00 00          $
	$	REQ001:763 03 22 B0 84 00 00 00 00          $
	$	REQ002:763 03 22 B1 00 00 00 00 00          $
	$	REQ003:763 03 22 B1 01 00 00 00 00          $
	$	REQ004:763 03 22 B1 02 00 00 00 00          $
	$	REQ005:763 03 22 B1 80 00 00 00 00          $
	$	REQ006:763 03 22 B1 81 00 00 00 00          $
	$	REQ007:763 03 22 B1 84 00 00 00 00          $
	$	REQ008:763 03 22 B2 00 00 00 00 00          $
	$	REQ009:763 03 22 B2 10 00 00 00 00          $
	$	REQ010:763 03 22 B2 20 00 00 00 00          $
	$	REQ011:763 03 22 B2 21 00 00 00 00          $
	$	REQ012:763 03 22 B2 22 00 00 00 00          $
	$	REQ013:763 03 22 B2 23 00 00 00 00          $
	$	REQ014:763 03 22 B2 25 00 00 00 00          $
	$	REQ015:763 03 22 B2 40 00 00 00 00          $
	$	REQ016:763 03 22 B2 50 00 00 00 00          $

  $  000.当前系统时间                         $    $  s           $    $  ANS000.BYTE003  $  X1X2X3X4
  $  001.拨号成功次数累计                     $    $  -           $    $  ANS001.BYTE003  $  XY
  $  002.拨号失败次数累计                     $    $  -           $    $  ANS001.BYTE005  $  XY
  $  003.掉网次数累计                         $    $  -           $    $  ANS001.BYTE007  $  XY
  $  004.GNSS天线状态                         $    $  -           $    $  ANS002.BYTE003  $  00:断开		01:连接		其他:-
  $  005.GNSS经度                             $    $              $    $  ANS003.BYTE003  $  X1X2X3X4*0.000001
  $  006.GNSS纬度                             $    $              $    $  ANS003.BYTE007  $  X1X2X3X4*0.000001
  $  007.GNSS定位时间                         $    $  s           $    $  ANS004.BYTE003  $  X1X2X3X4
  $  008.GNSS水平精度因子                     $    $  HDOP        $    $  ANS004.BYTE007  $  X*0.1
  $  009.GNSS速度                             $    $  kph         $    $  ANS004.BYTE008  $  X
  $  010.GNSS方向                             $    $  Degrees     $    $  ANS004.BYTE009  $  X*2
  $  011.GNSS卫星数量                         $    $              $    $  ANS004.BYTE010  $  X1X2X3X4
  $  012.GNSS信号质量                         $    $  -           $    $  ANS004.BYTE014  $  00:无信号		01:低信号		02:高信号		其他:-
  $  013.移动运营商国家码                     $    $  -           $    $  ANS005.BYTE003  $  XYZ*(-)-
  $  014.移动运营商网络码                     $    $  -           $    $  ANS006.BYTE006  $  [000000-7FFFFF]:XYZ*(-)-		[800000-FFFFFF]:(XYZ-16777215)*(-)-
  $  015.原始信号强度                         $    $  db          $    $  ANS006.BYTE003  $  XY*0.1-150
  $  016.信号场强级别                         $    $              $    $  ANS006.BYTE005  $  XYZ
  $  017.网络制式类型                         $    $  -           $    $  ANS006.BYTE008  $  00:未注册		01:CDMA		02:GSM		03:CDMA2000		04:WCDMA		05:LTEFDD		06:LTETDD		07:预留		其他:-
  $  018.当前在用SIM卡位置                    $    $  -           $    $  ANS006.BYTE011  $  00:内部		01:外部		其他:-
  $  019.运营商连接状态                       $    $  -           $    $  ANS006.BYTE006  $  00:无服务		01:信号搜索中		02:已注册		03:注册失败		04:未使用		05:漫游		其他:-
  $  020.主天线状态                           $    $  -           $    $  ANS007.BYTE003  $  00:未连接		01:已连接		其他:-
  $  021.分级天线状态                         $    $  -           $    $  ANS007.BYTE005  $  00:未连接		01:已连接		其他:-
  $  022.内置天线状态                         $    $  -           $    $  ANS007.BYTE007  $  00:未连接		01:已连接		其他:-
  $  023.当前在用天线位置                     $    $  -           $    $  ANS007.BYTE009  $  00:内部		01:外部		其他:-
  $  024.TBOX的激活状态                       $    $  -           $    $  ANS008.BYTE003  $  01:失效模式		02:激活模式		03:暂停/ EOL模式		00:保留		其他:-
  $  025.远程控车业务开关                     $    $  -           $    $  ANS008.BYTE004  $  00:禁用		01:启用		其他:-
  $  026.防盗提醒业务开关                     $    $  -           $    $  ANS008.BYTE005  $  00:禁用		01:启用		其他:-
  $  027.车机上网开关                         $    $  -           $    $  ANS008.BYTE006  $  00:禁用		01:启用		其他:-
  $  028.行程功能开关                         $    $  -           $    $  ANS008.BYTE007  $  00:禁用		01:启用		其他:-
  $  029.车辆状态上报业务开关                 $    $  -           $    $  ANS008.BYTE008  $  00:禁用		01:启用		其他:-
  $  030.ICALL业务开关（预留）                $    $  -           $    $  ANS008.BYTE009  $  00:禁用		01:启用		其他:-
  $  031.BCALL业务开关                        $    $  -           $    $  ANS008.BYTE010  $  00:禁用		01:启用		其他:-
  $  032.ECALL业务开关                        $    $  -           $    $  ANS008.BYTE011  $  00:禁用		01:启用		其他:-
  $  033.大数据业务开关                       $    $  -           $    $  ANS008.BYTE005  $  00:禁用		01:启用		其他:-
  $  034.远程诊断业务开关                     $    $  -           $    $  ANS008.BYTE006  $  00:禁用		01:启用		其他:-
  $  035.蓝牙控车业务开关                     $    $  -           $    $  ANS008.BYTE007  $  00:禁用		01:启用		其他:-
  $  036.初始秘钥交换结果                     $    $  -           $    $  ANS009.BYTE003  $  00:未完成		01:完成		其他:-
  $  037.最后一个秘钥交换结果                 $    $  -           $    $  ANS009.BYTE005  $  00:没有运行		01:正在进行中		02:失败:没有网络		03:失败:PDP上下文失败		04: TSP连接失败		05: TBox ID不匹配		06:密钥交换处理超时		07: TSP结果错误		08: TSP不会生成公钥		09: TSP拒绝		0A:成功		其他:-
  $  038.配置检查状态                         $    $  -           $    $  ANS009.BYTE004  $  00:闲置		01:正在进行中		其他:-
  $  039.远程闭锁状态                         $    $              $    $  ANS010.BYTE003  $  00:闲置		01:正在进行中		其他:-
  $  040.远程闭锁最终时间                     $    $  s           $    $  ANS010.BYTE004  $  X1X2X3X4
  $  041.远程闭锁最终状态                     $    $              $    $  ANS010.BYTE008  $  X
  $  042.远程解锁状态                         $    $              $    $  ANS011.BYTE003  $  00:闲置		01:正在进行中		其他:-
  $  043.远程解锁最终时间                     $    $  s           $    $  ANS011.BYTE004  $  X1X2X3X4
  $  044.远程解锁最终状态                     $    $              $    $  ANS011.BYTE008  $  X
  $  045.远程空调控制状态                     $    $              $    $  ANS012.BYTE003  $  00:闲置		01:正在进行中		其他:-
  $  046.远程空调控制最终时间                 $    $  s           $    $  ANS012.BYTE004  $  X1X2X3X4
  $  047.远程空调控制最终状态                 $    $              $    $  ANS012.BYTE008  $  X
  $  048.远程座椅加热状态                     $    $              $    $  ANS013.BYTE003  $  00:闲置		01:正在进行中		其他:-
  $  049.远程座椅加热最终时间                 $    $  s           $    $  ANS013.BYTE004  $  X1X2X3X4
  $  050.远程座椅加热最终状态                 $    $              $    $  ANS013.BYTE008  $  X
  $  051.远程发动机启动状态                   $    $              $    $  ANS014.BYTE003  $  00:闲置		01:正在进行中		其他:-
  $  052.远程发动机启动最终时间               $    $  s           $    $  ANS014.BYTE004  $  X1X2X3X4
  $  053.远程发动机启动最终状态               $    $              $    $  ANS014.BYTE008  $  X
  $  054.ICALL运行                            $    $              $    $  ANS015.BYTE003  $  00:未运行		01:运行中		其他:-
  $  055.ICALL运行状态                        $    $  Min         $    $  ANS015.BYTE004  $  XY
  $  056.当前保存钥匙总数(包括备用钥匙)       $    $              $    $  ANS016.BYTE003  $  X
  $  057.当前使用的钥匙信息                   $    $              $    $  ANS016.BYTE004  $  X1X2X3X4
  $  058.当前使用的钥匙信息                   $    $  s           $    $  ANS016.BYTE008  $  X1X2X3X4
  $  059.当前使用的钥匙信息                   $    $  s           $    $  ANS016.BYTE012  $  X1X2X3X4


