$~#6$~#14$~500$~74A
;******************************************************************************************************************************************************

车型代号:E200
车型:E200
排量:N/A
年份:2016
模块名缩写:VCU
模块名:整车控制器
供应商:联电
诊断代码:E100_VCU_2016_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:742 02 10 01 00 00 00 00 00          $~          74A 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:742 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:742 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:742 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/E200DTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:742 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:742 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:742 03 22 F1 90 00 00 00 00          $%
	$%	REQ001:742 03 22 F1 86 00 00 00 00          $%
	$%	REQ002:742 03 22 F1 8A 00 00 00 00          $%
	$%	REQ003:742 03 22 F1 8B 00 00 00 00          $%
	$%	REQ004:742 03 22 F1 CB 00 00 00 00          $%
	$%	REQ005:742 03 22 F1 92 00 00 00 00          $%
	$%	REQ006:742 03 22 F1 93 00 00 00 00          $%
	$%	REQ007:742 03 22 F1 94 00 00 00 00          $%
	$%	REQ008:742 03 22 F1 95 00 00 00 00          $%
	$%	REQ009:742 03 22 D1 20 00 00 00 00          $%

  $%  000:车辆标识信息（VIN）            $%    $%  ANS000.BYTE003  $%  17个字节的ASCII显示
  $%  001:激活诊断会话                   $%    $%  ANS001.BYTE003  $%  X
  $%  002:供应商标识信息                 $%    $%  ANS002.BYTE003  $%  07个字节的ASCII显示
  $%  003:ECU制造日期                    $%    $%  ANS003.BYTE003  $%  04个字节的HEX显示
  $%  004:零件号（SGMW P/N）             $%    $%  ANS004.BYTE003  $%  X1X2X3X4
  $%  005:供应商ECU硬件号                $%    $%  ANS005.BYTE003  $%  09个字节的ASCII显示
  $%  006:供应商ECU硬件版本号            $%    $%  ANS006.BYTE003  $%  16个字节的ASCII显示
  $%  007:供应商ECU软件号                $%    $%  ANS007.BYTE003  $%  09个字节的ASCII显示
  $%  008:供应商ECU软件版本号            $%    $%  ANS008.BYTE003  $%  11个字节的ASCII显示
  $%  009:供应商释放受控软件软件号       $%    $%  ANS009.BYTE003  $%  10个字节的ASCII显示

;******************************************************************************************************************************************************
数据流

 $ 00.所有数据

	$	REQ000:742 03 22 D0 06 00 00 00 00          $
	$	REQ001:742 03 22 F0 13 00 00 00 00          $
	$	REQ002:742 03 22 F0 14 00 00 00 00          $
	$	REQ003:742 03 22 D0 13 00 00 00 00          $
	$	REQ004:742 03 22 D0 14 00 00 00 00          $
	$	REQ005:742 03 22 D0 15 00 00 00 00          $
	$	REQ006:742 03 22 D0 16 00 00 00 00          $
	$	REQ007:742 03 22 D0 17 00 00 00 00          $
	$	REQ008:742 03 22 D0 1B 00 00 00 00          $
	$	REQ009:742 03 22 D0 1C 00 00 00 00          $
	$	REQ010:742 03 22 D0 1D 00 00 00 00          $
	$	REQ011:742 03 22 D0 1E 00 00 00 00          $
	$	REQ012:742 03 22 D0 21 00 00 00 00          $
	$	REQ013:742 03 22 D0 22 00 00 00 00          $
	$	REQ014:742 03 22 D0 23 00 00 00 00          $
	$	REQ015:742 03 22 D0 24 00 00 00 00          $
	$	REQ016:742 03 22 D0 25 00 00 00 00          $
	$	REQ017:742 03 22 D0 26 00 00 00 00          $
	$	REQ018:742 03 22 D0 27 00 00 00 00          $
	$	REQ019:742 03 22 D0 28 00 00 00 00          $
	$	REQ020:742 03 22 D0 29 00 00 00 00          $
	$	REQ021:742 03 22 D0 2A 00 00 00 00          $
	$	REQ022:742 03 22 D0 2B 00 00 00 00          $
	$	REQ023:742 03 22 D0 2C 00 00 00 00          $
	$	REQ024:742 03 22 D0 2D 00 00 00 00          $
	$	REQ025:742 03 22 D0 2E 00 00 00 00          $
	$	REQ026:742 03 22 D0 2F 00 00 00 00          $
	$	REQ027:742 03 22 D0 30 00 00 00 00          $
	$	REQ028:742 03 22 D0 31 00 00 00 00          $
	$	REQ029:742 03 22 D0 32 00 00 00 00          $
	$	REQ030:742 03 22 D0 33 00 00 00 00          $
	$	REQ031:742 03 22 D0 34 00 00 00 00          $
	$	REQ032:742 03 22 D0 35 00 00 00 00          $
	$	REQ033:742 03 22 D0 36 00 00 00 00          $
	$	REQ034:742 03 22 D0 37 00 00 00 00          $
	$	REQ035:742 03 22 D0 38 00 00 00 00          $
	$	REQ036:742 03 22 D0 39 00 00 00 00          $
	$	REQ037:742 03 22 D0 3B 00 00 00 00          $
	$	REQ038:742 03 22 D0 3D 00 00 00 00          $
	$	REQ039:742 03 22 D0 40 00 00 00 00          $
	$	REQ040:742 03 22 D0 4E 00 00 00 00          $
	$	REQ041:742 03 22 D0 4F 00 00 00 00          $
	$	REQ042:742 03 22 D0 51 00 00 00 00          $
	$	REQ043:742 03 22 D0 52 00 00 00 00          $
	$	REQ044:742 03 22 D0 53 00 00 00 00          $
	$	REQ045:742 03 22 D0 55 00 00 00 00          $
	$	REQ046:742 03 22 D0 56 00 00 00 00          $
	$	REQ047:742 03 22 D0 59 00 00 00 00          $
	$	REQ048:742 03 22 D0 5A 00 00 00 00          $
	$	REQ049:742 03 22 D0 5C 00 00 00 00          $
	$	REQ050:742 03 22 D0 60 00 00 00 00          $
	$	REQ051:742 03 22 D0 61 00 00 00 00          $
	$	REQ052:742 03 22 D0 62 00 00 00 00          $
	$	REQ053:742 03 22 D0 63 00 00 00 00          $
	$	REQ054:742 03 22 D0 64 00 00 00 00          $
	$	REQ055:742 03 22 D0 65 00 00 00 00          $
	$	REQ056:742 03 22 D0 66 00 00 00 00          $
	$	REQ057:742 03 22 D0 67 00 00 00 00          $
	$	REQ058:742 03 22 D0 68 00 00 00 00          $
	$	REQ059:742 03 22 D0 69 00 00 00 00          $
	$	REQ060:742 03 22 D0 6A 00 00 00 00          $
	$	REQ061:742 03 22 D0 6B 00 00 00 00          $
	$	REQ062:742 03 22 D0 6C 00 00 00 00          $
	$	REQ063:742 03 22 D0 6D 00 00 00 00          $
	$	REQ064:742 03 22 D0 6E 00 00 00 00          $
	$	REQ065:742 03 22 D0 6F 00 00 00 00          $
	$	REQ066:742 03 22 D0 70 00 00 00 00          $
	$	REQ067:742 03 22 D0 71 00 00 00 00          $
	$	REQ068:742 03 22 D0 72 00 00 00 00          $
	$	REQ069:742 03 22 D0 73 00 00 00 00          $
	$	REQ070:742 03 22 D0 74 00 00 00 00          $
	$	REQ071:742 03 22 D0 7D 00 00 00 00          $
	$	REQ072:742 03 22 D0 81 00 00 00 00          $
	$	REQ073:742 03 22 D0 82 00 00 00 00          $
	$	REQ074:742 03 22 D0 84 00 00 00 00          $
	$	REQ075:742 03 22 D0 87 00 00 00 00          $
	$	REQ076:742 03 22 D0 88 00 00 00 00          $
	$	REQ077:742 03 22 D0 8D 00 00 00 00          $
	$	REQ078:742 03 22 D0 8E 00 00 00 00          $
	$	REQ079:742 03 22 D0 8F 00 00 00 00          $
	$	REQ080:742 03 22 D0 90 00 00 00 00          $
	$	REQ081:742 03 22 D0 91 00 00 00 00          $
	$	REQ082:742 03 22 D0 92 00 00 00 00          $
	$	REQ083:742 03 22 D0 93 00 00 00 00          $
	$	REQ084:742 03 22 D0 94 00 00 00 00          $
	$	REQ085:742 03 22 D0 95 00 00 00 00          $
	$	REQ086:742 03 22 D0 96 00 00 00 00          $
	$	REQ087:742 03 22 D0 97 00 00 00 00          $
	$	REQ088:742 03 22 D0 98 00 00 00 00          $
	$	REQ089:742 03 22 D0 99 00 00 00 00          $
	$	REQ090:742 03 22 D0 9D 00 00 00 00          $
	$	REQ091:742 03 22 D1 00 00 00 00 00          $
	$	REQ092:742 03 22 D1 01 00 00 00 00          $
	$	REQ093:742 03 22 D1 0B 00 00 00 00          $
	$	REQ094:742 03 22 D1 13 00 00 00 00          $
	$	REQ095:742 03 22 D1 14 00 00 00 00          $
	$	REQ096:742 03 22 D0 1F 00 00 00 00          $
	$	REQ097:742 03 22 D0 20 00 00 00 00          $
	$	REQ098:742 03 22 D0 42 00 00 00 00          $
	$	REQ099:742 03 22 D0 43 00 00 00 00          $
	$	REQ100:742 03 22 D0 44 00 00 00 00          $
	$	REQ101:742 03 22 D0 50 00 00 00 00          $
	$	REQ102:742 03 22 D0 54 00 00 00 00          $
	$	REQ103:742 03 22 D0 57 00 00 00 00          $
	$	REQ104:742 03 22 D0 58 00 00 00 00          $
	$	REQ105:742 03 22 D0 5D 00 00 00 00          $
	$	REQ106:742 03 22 D0 5E 00 00 00 00          $
	$	REQ107:742 03 22 D0 5F 00 00 00 00          $
	$	REQ108:742 03 22 D0 75 00 00 00 00          $
	$	REQ109:742 03 22 D0 76 00 00 00 00          $
	$	REQ110:742 03 22 D0 77 00 00 00 00          $
	$	REQ111:742 03 22 D0 78 00 00 00 00          $
	$	REQ112:742 03 22 D0 79 00 00 00 00          $
	$	REQ113:742 03 22 D0 7A 00 00 00 00          $
	$	REQ114:742 03 22 D0 7B 00 00 00 00          $
	$	REQ115:742 03 22 D0 7C 00 00 00 00          $
	$	REQ116:742 03 22 D0 7E 00 00 00 00          $
	$	REQ117:742 03 22 D0 7F 00 00 00 00          $
	$	REQ118:742 03 22 D0 80 00 00 00 00          $
	$	REQ119:742 03 22 D0 83 00 00 00 00          $
	$	REQ120:742 03 22 D0 85 00 00 00 00          $
	$	REQ121:742 03 22 D0 86 00 00 00 00          $
	$	REQ122:742 03 22 D0 89 00 00 00 00          $
	$	REQ123:742 03 22 D0 8A 00 00 00 00          $
	$	REQ124:742 03 22 D0 8B 00 00 00 00          $
	$	REQ125:742 03 22 D0 8C 00 00 00 00          $
	$	REQ126:742 03 22 D0 9A 00 00 00 00          $
	$	REQ127:742 03 22 D0 9B 00 00 00 00          $
	$	REQ128:742 03 22 D0 9C 00 00 00 00          $
	$	REQ129:742 03 22 D1 02 00 00 00 00          $
	$	REQ130:742 03 22 D1 03 00 00 00 00          $
	$	REQ131:742 03 22 D1 04 00 00 00 00          $
	$	REQ132:742 03 22 D1 05 00 00 00 00          $
	$	REQ133:742 03 22 D1 06 00 00 00 00          $
	$	REQ134:742 03 22 D1 07 00 00 00 00          $
	$	REQ135:742 03 22 D1 08 00 00 00 00          $
	$	REQ136:742 03 22 D1 09 00 00 00 00          $
	$	REQ137:742 03 22 D1 0A 00 00 00 00          $
	$	REQ138:742 03 22 D1 0C 00 00 00 00          $
	$	REQ139:742 03 22 D1 0D 00 00 00 00          $
	$	REQ140:742 03 22 D1 0E 00 00 00 00          $
	$	REQ141:742 03 22 D1 0F 00 00 00 00          $
	$	REQ142:742 03 22 D1 10 00 00 00 00          $
	$	REQ143:742 03 22 D1 11 00 00 00 00          $
	$	REQ144:742 03 22 D1 16 00 00 00 00          $
	$	REQ145:742 03 22 D1 17 00 00 00 00          $
	$	REQ146:742 03 22 D1 18 00 00 00 00          $
	$	REQ147:742 03 22 D1 19 00 00 00 00          $
	$	REQ148:742 03 22 D1 1A 00 00 00 00          $
	$	REQ149:742 03 22 D1 1B 00 00 00 00          $
	$	REQ150:742 03 22 D1 1F 00 00 00 00          $

  $  000.加速踏板位置                         $    $  %         $    $  ANS000.BYTE003  $  X
  $  001.车速                                 $    $  km/h      $    $  ANS001.BYTE003  $  XY*0.01625
  $  002.行驶里程                             $    $  km        $    $  ANS002.BYTE003  $  X1X2X3X4*0.015625
  $  003.OBC输入电压                          $    $  V         $    $  ANS003.BYTE003  $  XY
  $  004.OBC输出电压                          $    $  V         $    $  ANS004.BYTE003  $  XY*0.1
  $  005.OBC输出电流                          $    $  A         $    $  ANS005.BYTE003  $  XY*0.1
  $  006.OBC温度                              $    $  ℃        $    $  ANS006.BYTE003  $  X
  $  007.BMS高电压功率请求                    $    $  -         $    $  ANS007.BYTE003  $  00:断开高压开关		01:紧急断开高压开关		02:闭合高压开关		其他:-
  $  008.电池包故障等级                       $    $  -         $    $  ANS008.BYTE003  $  00:正常		01:放电轻微故障		02:放电功率限制		03:放电跛行行车		04:停车		05:紧急停车		06:充电轻微故障		07:充电功率限制		08:充电紧急停止		09:放电紧急停止		0A:充电紧急停止		其他:-
  $  009.电池包绝缘值                         $    $  kΩ       $    $  ANS009.BYTE003  $  XY
  $  010.电池包内侧电压                       $    $  V         $    $  ANS010.BYTE003  $  XY*0.1
  $  011.电池包外侧电压                       $    $  V         $    $  ANS011.BYTE003  $  XY*0.1
  $  012.电池包慢充状态                       $    $  -         $    $  ANS012.BYTE003  $  00:不可充电		01:可充电		02:充电完成		其他:-
  $  013.电池包主正继电器状态                 $    $  -         $    $  ANS013.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  014.电池包主负继电器状态                 $    $  -         $    $  ANS014.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  015.电池包预充继电器状态                 $    $  -         $    $  ANS015.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  016.电池包慢充继电器状态                 $    $  -         $    $  ANS016.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  017.电池包高电压互锁状态                 $    $  -         $    $  ANS017.BYTE003  $  00:断开		01:连接		02:故障		其他:-
  $  018.电池包总电流                         $    $  A         $    $  ANS018.BYTE003  $  XY*0.1-1000
  $  019.电池包继续放电可用功率               $    $  kW        $    $  ANS019.BYTE003  $  XY*0.01
  $  020.电池包脉冲放电可用功率（2S）         $    $  kW        $    $  ANS020.BYTE003  $  XY*0.01
  $  021.电池包脉冲放电可用功率（10S）        $    $  kW        $    $  ANS021.BYTE003  $  XY*0.01
  $  022.电池包平均温度                       $    $  ℃        $    $  ANS022.BYTE003  $  X*1-50
  $  023.电池包最高温度                       $    $  ℃        $    $  ANS023.BYTE003  $  X*1-50
  $  024.电池包最低温度                       $    $  ℃        $    $  ANS024.BYTE003  $  X*1-50
  $  025.电机母线当前温度                     $    $  ℃        $    $  ANS025.BYTE003  $  X*1-40
  $  026.电机母线节点温度                     $    $  ℃        $    $  ANS026.BYTE003  $  X*1-40
  $  027.电机扭矩请求                         $    $  Nm        $    $  ANS027.BYTE003  $  XY*0.25-511
  $  028.电机当前负扭矩极限                   $    $  Nm        $    $  ANS028.BYTE003  $  XY*0.25-511
  $  029.电机当前正扭矩极限                   $    $  Nm        $    $  ANS029.BYTE003  $  XY*0.25
  $  030.电机速度请求                         $    $  rpm       $    $  ANS030.BYTE003  $  XY*1-16384
  $  031.电机当前速度                         $    $  rpm       $    $  ANS031.BYTE003  $  XY*1-16384
  $  032.电机当前功率                         $    $  kW        $    $  ANS032.BYTE003  $  XY*0.1-102
  $  033.电机当前温度                         $    $  ℃        $    $  ANS033.BYTE003  $  X*1-40
  $  034.电机母线电流                         $    $  A         $    $  ANS034.BYTE003  $  XY*1-1023
  $  035.电机母线电压                         $    $  V         $    $  ANS035.BYTE003  $  XY
  $  036.电机控制模式请求                     $    $  -         $    $  ANS036.BYTE003  $  01:转速控制		02:扭矩控制		其他:-
  $  037.电机工作状态请求                     $    $  -         $    $  ANS037.BYTE003  $  00:禁止		02:使能		03:紧急停止		其他:-
  $  038.电机当前工作状态                     $    $  -         $    $  ANS038.BYTE003  $  00:未准备完毕		01:低压自检通过		02:MOS管自检通过		03:准备完毕		06:故障		其他:-
  $  039.车辆充电模式状态                     $    $  -         $    $  ANS039.BYTE003  $  00:未充电		01:在线充电		02:充电故障		其他:-
  $  040.车辆当前总电流                       $    $  A         $    $  ANS040.BYTE003  $  XY*0.1-1000
  $  041.车辆当前总电压                       $    $  V         $    $  ANS041.BYTE003  $  XY*0.1
  $  042.车辆操作模式                         $    $  -         $    $  ANS042.BYTE003  $  00:休眠		01:初始化		02:上电		03:行驶		04:充电		05:下电		06:故障		07:跛行回家		08:保留		其他:-
  $  043.车辆充电请求                         $    $  -         $    $  ANS043.BYTE003  $  00:禁止充电		01:允许充电		02:充电完成		其他:-
  $  044.车辆当前档位状态                     $    $  -         $    $  ANS044.BYTE003  $  00:空挡		01:前进		02:后退		03:驻车		其他:-
  $  045.车辆驱动模式                         $    $  -         $    $  ANS045.BYTE003  $  00:正常模式		01:经济模式		02:运行模式		03:预留		其他:-
  $  046.剩余行驶里程                         $    $  km        $    $  ANS046.BYTE003  $  X
  $  047.电机当前控制模式                     $    $  -         $    $  ANS047.BYTE003  $  01:转速控制		02:扭矩控制		其他:-
  $  048.电机当前扭矩                         $    $  Nm        $    $  ANS048.BYTE003  $  XY*0.25-511
  $  049.母线电压状态                         $    $  -         $    $  ANS049.BYTE003  $  00:正常		01:过高		02:过低		其他:-
  $  050.电池包可用能量                       $    $  kwh       $    $  ANS050.BYTE003  $  X*0.12
  $  051.电池包SOH                            $    $  %         $    $  ANS051.BYTE003  $  X
  $  052.电池包SOC                            $    $  %         $    $  ANS052.BYTE003  $  X
  $  053.电池包充放电次数                     $    $  -         $    $  ANS053.BYTE003  $  XY
  $  054.电池包剩余充电时间                   $    $  min       $    $  ANS054.BYTE003  $  XY
  $  055.电池包继续充电可用功率               $    $  kW        $    $  ANS055.BYTE003  $  XY*0.01
  $  056.电池包脉冲充电可用功率（2S）         $    $  kW        $    $  ANS056.BYTE003  $  XY*0.01
  $  057.电池包脉冲充电可用功率（10S）        $    $  kW        $    $  ANS057.BYTE003  $  XY*0.01
  $  058.电池包总电压和                       $    $  V         $    $  ANS058.BYTE003  $  XY*0.1
  $  059.电池包充电截止电压                   $    $  V         $    $  ANS059.BYTE003  $  XY*0.1
  $  060.电池包最高单体电压                   $    $  mV        $    $  ANS060.BYTE003  $  XY
  $  061.电池包最高单体电压位置               $    $  -         $    $  ANS061.BYTE003  $  X
  $  062.电池包最低单体电压                   $    $  mV        $    $  ANS062.BYTE003  $  XY
  $  063.电池包最低单体电压位置               $    $  -         $    $  ANS063.BYTE003  $  X
  $  064.电池包平均单体电压                   $    $  mV        $    $  ANS064.BYTE003  $  XY
  $  065.电池包最高温度位置                   $    $  -         $    $  ANS065.BYTE003  $  X
  $  066.电池包最低温度位置                   $    $  -         $    $  ANS066.BYTE003  $  X
  $  067.电池包平均单体电压状态               $    $  -         $    $  ANS067.BYTE003  $  00:正常		01:电压过高		02:电压过低		03:电压不均衡		其他:-
  $  068.电池包总电压状态                     $    $  -         $    $  ANS068.BYTE003  $  00:正常		01:电压过高		02:电压过低		其他:-
  $  069.电池包温度状态                       $    $  -         $    $  ANS069.BYTE003  $  00:正常		01:温度过高		02:温度过低		03:温度不均衡		其他:-
  $  070.电池包SOC状态                        $    $  -         $    $  ANS070.BYTE003  $  00:正常		01:SOC过高		02:SOC过低		其他:-
  $  071.预约充电时间                         $    $  min       $    $  ANS071.BYTE003  $  XY*0.5
  $  072.驾驶座空置状态                       $    $  -         $    $  ANS072.BYTE003  $  00:空置		01:有人		02:预留		03:传感器故障		其他:-
  $  073.方向盘角度传感器校准状态             $    $  -         $    $  ANS073.BYTE003  $  00:未使用		01:预估		02:校准		03:预留		其他:-
  $  074.方向盘角度                           $    $  deg       $    $  ANS074.BYTE003  $  [0000-7FFF]:XY*0.0625+0		[8000-FFFF]:(XY-65535)*0.0625+0
  $  075.EPS工作电流                          $    $  A         $    $  ANS075.BYTE003  $  XY*0.25
  $  076.OBC状态                              $    $  -         $    $  ANS076.BYTE003  $  01:充电准备完成		02:正常工作		03:降功率工作		04:故障		05:待机		其他:-
  $  077.底盘系统扭矩干预类型                 $    $  -         $    $  ANS077.BYTE003  $  00:不干预		01:降扭		02:升扭		其他:-
  $  078.底盘系统请求电机增扭值               $    $  Nm        $    $  ANS078.BYTE003  $  XY*0.5-848
  $  079.底盘系统请求电机快速降低扭矩值       $    $  Nm        $    $  ANS079.BYTE003  $  XY*0.5-848
  $  080.底盘系统请求电机慢速降低扭矩值       $    $  Nm        $    $  ANS080.BYTE003  $  XY*0.5-848
  $  081.左驱动轮对地面速度                   $    $  km/h      $    $  ANS081.BYTE003  $  XY*0.01
  $  082.右驱动轮对地面速度                   $    $  km/h      $    $  ANS082.BYTE003  $  XY*0.01
  $  083.左从动轮对地面速度                   $    $  km/h      $    $  ANS083.BYTE003  $  XY*0.01
  $  084.右从动轮对地面速度                   $    $  km/h      $    $  ANS084.BYTE003  $  XY*0.01
  $  085.VSC纵向加速度                        $    $  m / s²     $    $  ANS085.BYTE003  $  [0000-7FFF]:XY*0.015625+0		[8000-FFFF]:(XY-65535)*0.015625+0
  $  086.EPB运行状态                          $    $  -         $    $  ANS086.BYTE003  $  00:默认状态		01:驻车状态		02:释放状态		03:预留		其他:-
  $  087.EPB系统工作状态                      $    $  -         $    $  ANS087.BYTE003  $  00:未知		01:释放		02:加紧		03:释放过程中		04:加紧过程中		其他:-
  $  088.EPB系统报警显示要求                  $    $  -         $    $  ANS088.BYTE003  $  00:不指示		01:连续指示		02:闪烁指示		其他:-
  $  089.驻车键状态                           $    $  -         $    $  ANS089.BYTE003  $  00:正常		01:释放		02:拉起		其他:-
  $  090.EPB坡度信号                          $    $  %         $    $  ANS090.BYTE003  $  XY*0.1
  $  091.加速踏板信号1电压值                  $    $  V         $    $  ANS091.BYTE003  $  XY*0.00488
  $  092.加速踏板信号2电压值                  $    $  V         $    $  ANS092.BYTE003  $  XY*0.00488
  $  093.12V蓄电池电压                        $    $  V         $    $  ANS093.BYTE003  $  XY*0.01
  $  094.车速传感器                           $    $  kHz       $    $  ANS094.BYTE003  $  X*0.008
  $  095.真空泵工作模式频率                   $    $  Hz        $    $  ANS095.BYTE003  $  XY
  $  096.电池包电源状态                       $    $  -         $    $  ANS096.BYTE003  $  if(X1&0x1)y=@0045;else y=@0044;
  $  097.电池包保险状态                       $    $  -         $    $  ANS097.BYTE003  $  if(X1&0x1)y=@0046;else y=@0032;
  $  098.车辆充电线连接状态                   $    $  -         $    $  ANS098.BYTE003  $  if(X1&0x1)y=@0048;else y=@0047;
  $  099.12V电池充电状态                      $    $  -         $    $  ANS099.BYTE003  $  if(X1&0x1)y=@0050;else y=@0049;
  $  100.车辆运行模式就绪                     $    $  -         $    $  ANS100.BYTE003  $  if(X1&0x1)y=@0052;else y=@0051;
  $  101.激活放电请求                         $    $  -         $    $  ANS101.BYTE003  $  if(X1&0x1)y=@0054;else y=@0053;
  $  102.12V电池充电状态指示                  $    $  -         $    $  ANS102.BYTE003  $  if(X1&0x80)y=@0055;else y=@0050;
  $  103.电机&MCU过热指示                     $    $  -         $    $  ANS102.BYTE003  $  if(X1&0x20)y=@0056;else y=@0032;
  $  104.车辆充电状态指示                     $    $  -         $    $  ANS102.BYTE003  $  if(X1&0x8)y=@0050;else y=@0055;
  $  105.动力电池切断指示                     $    $  -         $    $  ANS102.BYTE003  $  if(X1&0x2)y=@0058;else y=@0057;
  $  106.车辆绝缘警告指示                     $    $  -         $    $  ANS102.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  107.动力电池故障指示                     $    $  -         $    $  ANS102.BYTE004  $  if(X1&0x80)y=@0033;else y=@0032;
  $  108.车辆故障指示                         $    $  -         $    $  ANS102.BYTE004  $  if(X1&0x40)y=@0033;else y=@0032;
  $  109.能源恢复指示                         $    $  -         $    $  ANS102.BYTE004  $  if(X1&0x20)y=@0060;else y=@0059;
  $  110.驱动功率极限指示                     $    $  -         $    $  ANS102.BYTE004  $  if(X1&0x8)y=@0033;else y=@0032;
  $  111.动力电池温度异常指示                 $    $  -         $    $  ANS102.BYTE004  $  if(X1&0x4)y=@0033;else y=@0032;
  $  112.真空泵警告指示                       $    $  -         $    $  ANS102.BYTE004  $  if(X1&0x1)y=@0033;else y=@0032;
  $  113.电机故障指示                         $    $  -         $    $  ANS102.BYTE005  $  if(X1&0x80)y=@0033;else y=@0032;
  $  114.车辆SOC低报警指示                    $    $  -         $    $  ANS102.BYTE005  $  if(X1&0x40)y=@0033;else y=@0032;
  $  115.电机超速指示                         $    $  -         $    $  ANS102.BYTE005  $  if(X1&0x20)y=@0033;else y=@0032;
  $  116.动力转向故障指示                     $    $  -         $    $  ANS102.BYTE005  $  if(X1&0x10)y=@0033;else y=@0032;
  $  117.ABS指示                              $    $  -         $    $  ANS102.BYTE005  $  if(X1&0x8)y=@0033;else y=@0032;
  $  118.制动过程指示                         $    $  -         $    $  ANS102.BYTE005  $  if(X1&0x4)y=@0033;else y=@0032;
  $  119.VSC关闭指示                          $    $  -         $    $  ANS102.BYTE005  $  if(X1&0x2)y=@0033;else y=@0032;
  $  120.电机旋变标定状态                     $    $  -         $    $  ANS103.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  121.电机降额工作状态                     $    $  -         $    $  ANS104.BYTE003  $  if(X1&0x1)y=@0061;else y=@0032;
  $  122.母线回馈过流指示                     $    $  -         $    $  ANS105.BYTE003  $  if(X1&0x1)y=@0062;else y=@0032;
  $  123.电机驱动过流指示                     $    $  -         $    $  ANS106.BYTE003  $  if(X1&0x1)y=@0062;else y=@0032;
  $  124.电机或母线过温指示                   $    $  -         $    $  ANS107.BYTE003  $  if(X1&0x1)y=@0063;else y=@0032;
  $  125.电池包反接保护                       $    $  -         $    $  ANS108.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  126.电池包充电电流状态                   $    $  -         $    $  ANS109.BYTE003  $  if(X1&0x1)y=@0065;else y=@0032;
  $  127.电池包放电电流状态                   $    $  -         $    $  ANS110.BYTE003  $  if(X1&0x1)y=@0066;else y=@0032;
  $  128.电池包绝缘状态                       $    $  -         $    $  ANS111.BYTE003  $  if(X1&0x1)y=@0067;else y=@0032;
  $  129.电池包内部CAN总线故障                $    $  -         $    $  ANS112.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  130.电池包温度传感器故障                 $    $  -         $    $  ANS113.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  131.电池包电流传感器故障                 $    $  -         $    $  ANS114.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  132.电池包单体电压传感器故障             $    $  -         $    $  ANS115.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  133.碰撞信号输出                         $    $  -         $    $  ANS116.BYTE003  $  if(X1&0x1)y=@0069;else y=@0068;
  $  134.后碰撞检测                           $    $  -         $    $  ANS117.BYTE003  $  if(X1&0x1)y=@0069;else y=@0068;
  $  135.驾驶员安全带状态                     $    $  -         $    $  ANS118.BYTE003  $  if(X1&0x1)y=@0071;else y=@0070;
  $  136.方向盘角度传感器初始化               $    $  -         $    $  ANS119.BYTE003  $  if(X1&0x1)y=@0073;else y=@0072;
  $  137.动力转向故障指示                     $    $  -         $    $  ANS120.BYTE003  $  if(X1&0x1)y=@0075;else y=@0074;
  $  138.转向负载-EPS激活                     $    $  -         $    $  ANS121.BYTE003  $  if(X1&0x1)y=@0077;else y=@0076;
  $  139.ABS激活                              $    $  -         $    $  ANS122.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  140.VSC激活                              $    $  -         $    $  ANS123.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  141.牵引力空置系统激活                   $    $  -         $    $  ANS124.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  142.坡道保持控制激活                     $    $  -         $    $  ANS125.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  143.EPB故障                              $    $  -         $    $  ANS088.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  144.EPB动态驻车                          $    $  -         $    $  ANS126.BYTE003  $  if(X1&0x1)y=@0080;else y=@0032;
  $  145.EPB制动灯点亮请求                    $    $  -         $    $  ANS127.BYTE003  $  if(X1&0x1)y=@0082;else y=@0081;
  $  146.EPB系统状态指示灯需求有效性          $    $  -         $    $  ANS128.BYTE003  $  if(X1&0x1)y=@0084;else y=@0083;
  $  147.制动踏板信号                         $    $  -         $    $  ANS129.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  148.换挡开关的D档                        $    $  -         $    $  ANS130.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  149.换挡开关的N档                        $    $  -         $    $  ANS131.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  150.换挡开关的P档                        $    $  -         $    $  ANS132.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  151.换挡开关的R档                        $    $  -         $    $  ANS133.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  152.PTC1信号                             $    $  -         $    $  ANS134.BYTE003  $  if(X1&0x1)y=@0085;else y=@0086;
  $  153.PTC2信号                             $    $  -         $    $  ANS135.BYTE003  $  if(X1&0x1)y=@0085;else y=@0086;
  $  154.A/C开关                              $    $  -         $    $  ANS136.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  155.高压配电箱开启信号                   $    $  -         $    $  ANS137.BYTE003  $  if(X1&0x1)y=@0087;else y=@0040;
  $  156.手刹信号                             $    $  -         $    $  ANS138.BYTE003  $  if(X1&0x1)y=@0089;else y=@0088;
  $  157.运行模式开关                         $    $  -         $    $  ANS139.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  158.经济模式开关                         $    $  -         $    $  ANS140.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  159.钥匙ON档                             $    $  -         $    $  ANS141.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  160.钥匙ACC档                            $    $  -         $    $  ANS142.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  161.DCDC故障信号                         $    $  -         $    $  ANS143.BYTE003  $  if(X1&0x1)y=@0032;else y=@0033;
  $  162.冷凝风扇控制信号                     $    $  -         $    $  ANS144.BYTE003  $  if(X1&0x1)y=@0093;else y=@0092;
  $  163.PTC1继电器控制信号                   $    $  -         $    $  ANS145.BYTE003  $  if(X1&0x1)y=@0095;else y=@0094;
  $  164.PTC2继电器控制信号                   $    $  -         $    $  ANS146.BYTE003  $  if(X1&0x1)y=@0097;else y=@0096;
  $  165.DCDC使能信号                         $    $  -         $    $  ANS147.BYTE003  $  if(X1&0x1)y=@0043;else y=@0098;
  $  166.BMS使能信号                          $    $  -         $    $  ANS148.BYTE003  $  if(X1&0x1)y=@0043;else y=@0098;
  $  167.AC启停控制信号                       $    $  -         $    $  ANS149.BYTE003  $  if(X1&0x1)y=@0100;else y=@0099;
  $  168.倒车灯继电器控制信号                 $    $  -         $    $  ANS150.BYTE003  $  if(X1&0x1)y=@0102;else y=@0101;

 $ 01.12V蓄电池

	$	REQ000:742 03 22 D1 0B 00 00 00 00          $
	$	REQ001:742 03 22 D0 43 00 00 00 00          $
	$	REQ002:742 03 22 D0 54 00 00 00 00          $

  $  000.12V蓄电池电压             $    $  V     $    $  ANS000.BYTE003  $  XY*0.01
  $  001.12V电池充电状态           $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x1)y=@0050;else y=@0049;
  $  002.12V电池充电状态指示       $    $  -     $    $  ANS002.BYTE003  $  if(X1&0x80)y=@0055;else y=@0050;

 $ 02.车辆状态

	$	REQ000:742 03 22 F0 13 00 00 00 00          $
	$	REQ001:742 03 22 F0 14 00 00 00 00          $
	$	REQ002:742 03 22 D0 40 00 00 00 00          $
	$	REQ003:742 03 22 D0 4E 00 00 00 00          $
	$	REQ004:742 03 22 D0 4F 00 00 00 00          $
	$	REQ005:742 03 22 D0 51 00 00 00 00          $
	$	REQ006:742 03 22 D0 52 00 00 00 00          $
	$	REQ007:742 03 22 D0 53 00 00 00 00          $
	$	REQ008:742 03 22 D0 55 00 00 00 00          $
	$	REQ009:742 03 22 D0 56 00 00 00 00          $
	$	REQ010:742 03 22 D0 95 00 00 00 00          $
	$	REQ011:742 03 22 D1 13 00 00 00 00          $
	$	REQ012:742 03 22 D0 42 00 00 00 00          $
	$	REQ013:742 03 22 D0 44 00 00 00 00          $
	$	REQ014:742 03 22 D0 54 00 00 00 00          $
	$	REQ015:742 03 22 D0 7E 00 00 00 00          $
	$	REQ016:742 03 22 D0 7F 00 00 00 00          $
	$	REQ017:742 03 22 D1 03 00 00 00 00          $
	$	REQ018:742 03 22 D1 04 00 00 00 00          $
	$	REQ019:742 03 22 D1 05 00 00 00 00          $
	$	REQ020:742 03 22 D1 06 00 00 00 00          $
	$	REQ021:742 03 22 D1 0D 00 00 00 00          $
	$	REQ022:742 03 22 D1 0E 00 00 00 00          $

  $  000.车速                     $    $  km/h      $    $  ANS000.BYTE003  $  XY*0.01625
  $  001.行驶里程                 $    $  km        $    $  ANS001.BYTE003  $  X1X2X3X4*0.015625
  $  002.车辆充电模式状态         $    $  -         $    $  ANS002.BYTE003  $  00:未充电		01:在线充电		02:充电故障		其他:-
  $  003.车辆当前总电流           $    $  A         $    $  ANS003.BYTE003  $  XY*0.1-1000
  $  004.车辆当前总电压           $    $  V         $    $  ANS004.BYTE003  $  XY*0.1
  $  005.车辆操作模式             $    $  -         $    $  ANS005.BYTE003  $  00:休眠		01:初始化		02:上电		03:行驶		04:充电		05:下电		06:故障		07:跛行回家		08:保留		其他:-
  $  006.车辆充电请求             $    $  -         $    $  ANS006.BYTE003  $  00:禁止充电		01:允许充电		02:充电完成		其他:-
  $  007.车辆当前档位状态         $    $  -         $    $  ANS007.BYTE003  $  00:空挡		01:前进		02:后退		03:驻车		其他:-
  $  008.车辆驱动模式             $    $  -         $    $  ANS008.BYTE003  $  00:正常模式		01:经济模式		02:运行模式		03:预留		其他:-
  $  009.剩余行驶里程             $    $  km        $    $  ANS009.BYTE003  $  X
  $  010.VSC纵向加速度            $    $  m / s²     $    $  ANS010.BYTE003  $  [0000-7FFF]:XY*0.015625+0		[8000-FFFF]:(XY-65535)*0.015625+0
  $  011.车速传感器               $    $  kHz       $    $  ANS011.BYTE003  $  X*0.008
  $  012.车辆充电线连接状态       $    $  -         $    $  ANS012.BYTE003  $  if(X1&0x1)y=@0048;else y=@0047;
  $  013.车辆运行模式就绪         $    $  -         $    $  ANS013.BYTE003  $  if(X1&0x1)y=@0052;else y=@0051;
  $  014.车辆充电状态指示         $    $  -         $    $  ANS014.BYTE003  $  if(X1&0x8)y=@0050;else y=@0055;
  $  015.车辆绝缘警告指示         $    $  -         $    $  ANS014.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  016.车辆故障指示             $    $  -         $    $  ANS014.BYTE004  $  if(X1&0x40)y=@0033;else y=@0032;
  $  017.能源恢复指示             $    $  -         $    $  ANS014.BYTE004  $  if(X1&0x20)y=@0060;else y=@0059;
  $  018.车辆SOC低报警指示        $    $  -         $    $  ANS014.BYTE005  $  if(X1&0x40)y=@0033;else y=@0032;
  $  019.碰撞信号输出             $    $  -         $    $  ANS015.BYTE003  $  if(X1&0x1)y=@0069;else y=@0068;
  $  020.后碰撞检测               $    $  -         $    $  ANS016.BYTE003  $  if(X1&0x1)y=@0069;else y=@0068;
  $  021.换挡开关的D档            $    $  -         $    $  ANS017.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  022.换挡开关的N档            $    $  -         $    $  ANS018.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  023.换挡开关的P档            $    $  -         $    $  ANS019.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  024.换挡开关的R档            $    $  -         $    $  ANS020.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  025.运行模式开关             $    $  -         $    $  ANS021.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  026.经济模式开关             $    $  -         $    $  ANS022.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;

 $ 03.BMS&OBC

	$	REQ000:742 03 22 D0 13 00 00 00 00          $
	$	REQ001:742 03 22 D0 14 00 00 00 00          $
	$	REQ002:742 03 22 D0 15 00 00 00 00          $
	$	REQ003:742 03 22 D0 16 00 00 00 00          $
	$	REQ004:742 03 22 D0 17 00 00 00 00          $
	$	REQ005:742 03 22 D0 88 00 00 00 00          $
	$	REQ006:742 03 22 D0 54 00 00 00 00          $
	$	REQ007:742 03 22 D1 1A 00 00 00 00          $

  $  000.OBC输入电压                $    $  V      $    $  ANS000.BYTE003  $  XY
  $  001.OBC输出电压                $    $  V      $    $  ANS001.BYTE003  $  XY*0.1
  $  002.OBC输出电流                $    $  A      $    $  ANS002.BYTE003  $  XY*0.1
  $  003.OBC温度                    $    $  ℃     $    $  ANS003.BYTE003  $  X
  $  004.BMS高电压功率请求          $    $  -      $    $  ANS004.BYTE003  $  00:断开高压开关		01:紧急断开高压开关		02:闭合高压开关		其他:-
  $  005.OBC状态                    $    $  -      $    $  ANS005.BYTE003  $  01:充电准备完成		02:正常工作		03:降功率工作		04:故障		05:待机		其他:-
  $  006.动力电池切断指示           $    $  -      $    $  ANS006.BYTE003  $  if(X1&0x2)y=@0058;else y=@0057;
  $  007.动力电池故障指示           $    $  -      $    $  ANS006.BYTE004  $  if(X1&0x80)y=@0033;else y=@0032;
  $  008.驱动功率极限指示           $    $  -      $    $  ANS006.BYTE004  $  if(X1&0x8)y=@0033;else y=@0032;
  $  009.动力电池温度异常指示       $    $  -      $    $  ANS006.BYTE004  $  if(X1&0x4)y=@0033;else y=@0032;
  $  010.BMS使能信号                $    $  -      $    $  ANS007.BYTE003  $  if(X1&0x1)y=@0043;else y=@0098;

 $ 04.电池包

	$	REQ000:742 03 22 D0 1B 00 00 00 00          $
	$	REQ001:742 03 22 D0 1C 00 00 00 00          $
	$	REQ002:742 03 22 D0 1D 00 00 00 00          $
	$	REQ003:742 03 22 D0 1E 00 00 00 00          $
	$	REQ004:742 03 22 D0 21 00 00 00 00          $
	$	REQ005:742 03 22 D0 22 00 00 00 00          $
	$	REQ006:742 03 22 D0 23 00 00 00 00          $
	$	REQ007:742 03 22 D0 24 00 00 00 00          $
	$	REQ008:742 03 22 D0 25 00 00 00 00          $
	$	REQ009:742 03 22 D0 26 00 00 00 00          $
	$	REQ010:742 03 22 D0 27 00 00 00 00          $
	$	REQ011:742 03 22 D0 28 00 00 00 00          $
	$	REQ012:742 03 22 D0 29 00 00 00 00          $
	$	REQ013:742 03 22 D0 2A 00 00 00 00          $
	$	REQ014:742 03 22 D0 2B 00 00 00 00          $
	$	REQ015:742 03 22 D0 2C 00 00 00 00          $
	$	REQ016:742 03 22 D0 2D 00 00 00 00          $
	$	REQ017:742 03 22 D0 60 00 00 00 00          $
	$	REQ018:742 03 22 D0 61 00 00 00 00          $
	$	REQ019:742 03 22 D0 62 00 00 00 00          $
	$	REQ020:742 03 22 D0 63 00 00 00 00          $
	$	REQ021:742 03 22 D0 64 00 00 00 00          $
	$	REQ022:742 03 22 D0 65 00 00 00 00          $
	$	REQ023:742 03 22 D0 66 00 00 00 00          $
	$	REQ024:742 03 22 D0 67 00 00 00 00          $
	$	REQ025:742 03 22 D0 68 00 00 00 00          $
	$	REQ026:742 03 22 D0 69 00 00 00 00          $
	$	REQ027:742 03 22 D0 6A 00 00 00 00          $
	$	REQ028:742 03 22 D0 6B 00 00 00 00          $
	$	REQ029:742 03 22 D0 6C 00 00 00 00          $
	$	REQ030:742 03 22 D0 6D 00 00 00 00          $
	$	REQ031:742 03 22 D0 6E 00 00 00 00          $
	$	REQ032:742 03 22 D0 6F 00 00 00 00          $
	$	REQ033:742 03 22 D0 70 00 00 00 00          $
	$	REQ034:742 03 22 D0 71 00 00 00 00          $
	$	REQ035:742 03 22 D0 72 00 00 00 00          $
	$	REQ036:742 03 22 D0 73 00 00 00 00          $
	$	REQ037:742 03 22 D0 74 00 00 00 00          $
	$	REQ038:742 03 22 D0 7D 00 00 00 00          $
	$	REQ039:742 03 22 D0 1F 00 00 00 00          $
	$	REQ040:742 03 22 D0 20 00 00 00 00          $
	$	REQ041:742 03 22 D0 50 00 00 00 00          $
	$	REQ042:742 03 22 D0 75 00 00 00 00          $
	$	REQ043:742 03 22 D0 76 00 00 00 00          $
	$	REQ044:742 03 22 D0 77 00 00 00 00          $
	$	REQ045:742 03 22 D0 78 00 00 00 00          $
	$	REQ046:742 03 22 D0 79 00 00 00 00          $
	$	REQ047:742 03 22 D0 7A 00 00 00 00          $
	$	REQ048:742 03 22 D0 7B 00 00 00 00          $
	$	REQ049:742 03 22 D0 7C 00 00 00 00          $

  $  000.电池包故障等级                      $    $  -       $    $  ANS000.BYTE003  $  00:正常		01:放电轻微故障		02:放电功率限制		03:放电跛行行车		04:停车		05:紧急停车		06:充电轻微故障		07:充电功率限制		08:充电紧急停止		09:放电紧急停止		0A:充电紧急停止		其他:-
  $  001.电池包绝缘值                        $    $  kΩ     $    $  ANS001.BYTE003  $  XY
  $  002.电池包内侧电压                      $    $  V       $    $  ANS002.BYTE003  $  XY*0.1
  $  003.电池包外侧电压                      $    $  V       $    $  ANS003.BYTE003  $  XY*0.1
  $  004.电池包慢充状态                      $    $  -       $    $  ANS004.BYTE003  $  00:不可充电		01:可充电		02:充电完成		其他:-
  $  005.电池包主正继电器状态                $    $  -       $    $  ANS005.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  006.电池包主负继电器状态                $    $  -       $    $  ANS006.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  007.电池包预充继电器状态                $    $  -       $    $  ANS007.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  008.电池包慢充继电器状态                $    $  -       $    $  ANS008.BYTE003  $  00:断开		01:连接		02:粘连		其他:-
  $  009.电池包高电压互锁状态                $    $  -       $    $  ANS009.BYTE003  $  00:断开		01:连接		02:故障		其他:-
  $  010.电池包总电流                        $    $  A       $    $  ANS010.BYTE003  $  XY*0.1-1000
  $  011.电池包继续放电可用功率              $    $  kW      $    $  ANS011.BYTE003  $  XY*0.01
  $  012.电池包脉冲放电可用功率（2S）        $    $  kW      $    $  ANS012.BYTE003  $  XY*0.01
  $  013.电池包脉冲放电可用功率（10S）       $    $  kW      $    $  ANS013.BYTE003  $  XY*0.01
  $  014.电池包平均温度                      $    $  ℃      $    $  ANS014.BYTE003  $  X*1-50
  $  015.电池包最高温度                      $    $  ℃      $    $  ANS015.BYTE003  $  X*1-50
  $  016.电池包最低温度                      $    $  ℃      $    $  ANS016.BYTE003  $  X*1-50
  $  017.电池包可用能量                      $    $  kwh     $    $  ANS017.BYTE003  $  X*0.12
  $  018.电池包SOH                           $    $  %       $    $  ANS018.BYTE003  $  X
  $  019.电池包SOC                           $    $  %       $    $  ANS019.BYTE003  $  X
  $  020.电池包充放电次数                    $    $  -       $    $  ANS020.BYTE003  $  XY
  $  021.电池包剩余充电时间                  $    $  min     $    $  ANS021.BYTE003  $  XY
  $  022.电池包继续充电可用功率              $    $  kW      $    $  ANS022.BYTE003  $  XY*0.01
  $  023.电池包脉冲充电可用功率（2S）        $    $  kW      $    $  ANS023.BYTE003  $  XY*0.01
  $  024.电池包脉冲充电可用功率（10S）       $    $  kW      $    $  ANS024.BYTE003  $  XY*0.01
  $  025.电池包总电压和                      $    $  V       $    $  ANS025.BYTE003  $  XY*0.1
  $  026.电池包充电截止电压                  $    $  V       $    $  ANS026.BYTE003  $  XY*0.1
  $  027.电池包最高单体电压                  $    $  mV      $    $  ANS027.BYTE003  $  XY
  $  028.电池包最高单体电压位置              $    $  -       $    $  ANS028.BYTE003  $  X
  $  029.电池包最低单体电压                  $    $  mV      $    $  ANS029.BYTE003  $  XY
  $  030.电池包最低单体电压位置              $    $  -       $    $  ANS030.BYTE003  $  X
  $  031.电池包平均单体电压                  $    $  mV      $    $  ANS031.BYTE003  $  XY
  $  032.电池包最高温度位置                  $    $  -       $    $  ANS032.BYTE003  $  X
  $  033.电池包最低温度位置                  $    $  -       $    $  ANS033.BYTE003  $  X
  $  034.电池包平均单体电压状态              $    $  -       $    $  ANS034.BYTE003  $  00:正常		01:电压过高		02:电压过低		03:电压不均衡		其他:-
  $  035.电池包总电压状态                    $    $  -       $    $  ANS035.BYTE003  $  00:正常		01:电压过高		02:电压过低		其他:-
  $  036.电池包温度状态                      $    $  -       $    $  ANS036.BYTE003  $  00:正常		01:温度过高		02:温度过低		03:温度不均衡		其他:-
  $  037.电池包SOC状态                       $    $  -       $    $  ANS037.BYTE003  $  00:正常		01:SOC过高		02:SOC过低		其他:-
  $  038.预约充电时间                        $    $  min     $    $  ANS038.BYTE003  $  XY*0.5
  $  039.电池包电源状态                      $    $  -       $    $  ANS039.BYTE003  $  if(X1&0x1)y=@0045;else y=@0044;
  $  040.电池包保险状态                      $    $  -       $    $  ANS040.BYTE003  $  if(X1&0x1)y=@0046;else y=@0032;
  $  041.激活放电请求                        $    $  -       $    $  ANS041.BYTE003  $  if(X1&0x1)y=@0054;else y=@0053;
  $  042.电池包反接保护                      $    $  -       $    $  ANS042.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  043.电池包充电电流状态                  $    $  -       $    $  ANS043.BYTE003  $  if(X1&0x1)y=@0065;else y=@0032;
  $  044.电池包放电电流状态                  $    $  -       $    $  ANS044.BYTE003  $  if(X1&0x1)y=@0066;else y=@0032;
  $  045.电池包绝缘状态                      $    $  -       $    $  ANS045.BYTE003  $  if(X1&0x1)y=@0067;else y=@0032;
  $  046.电池包内部CAN总线故障               $    $  -       $    $  ANS046.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  047.电池包温度传感器故障                $    $  -       $    $  ANS047.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  048.电池包电流传感器故障                $    $  -       $    $  ANS048.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;
  $  049.电池包单体电压传感器故障            $    $  -       $    $  ANS049.BYTE003  $  if(X1&0x1)y=@0064;else y=@0032;

 $ 05.电机

	$	REQ000:742 03 22 D0 2E 00 00 00 00          $
	$	REQ001:742 03 22 D0 2F 00 00 00 00          $
	$	REQ002:742 03 22 D0 30 00 00 00 00          $
	$	REQ003:742 03 22 D0 31 00 00 00 00          $
	$	REQ004:742 03 22 D0 32 00 00 00 00          $
	$	REQ005:742 03 22 D0 33 00 00 00 00          $
	$	REQ006:742 03 22 D0 34 00 00 00 00          $
	$	REQ007:742 03 22 D0 35 00 00 00 00          $
	$	REQ008:742 03 22 D0 36 00 00 00 00          $
	$	REQ009:742 03 22 D0 37 00 00 00 00          $
	$	REQ010:742 03 22 D0 38 00 00 00 00          $
	$	REQ011:742 03 22 D0 39 00 00 00 00          $
	$	REQ012:742 03 22 D0 3B 00 00 00 00          $
	$	REQ013:742 03 22 D0 3D 00 00 00 00          $
	$	REQ014:742 03 22 D0 59 00 00 00 00          $
	$	REQ015:742 03 22 D0 5A 00 00 00 00          $
	$	REQ016:742 03 22 D0 5C 00 00 00 00          $
	$	REQ017:742 03 22 D0 54 00 00 00 00          $
	$	REQ018:742 03 22 D0 57 00 00 00 00          $
	$	REQ019:742 03 22 D0 58 00 00 00 00          $
	$	REQ020:742 03 22 D0 5D 00 00 00 00          $
	$	REQ021:742 03 22 D0 5E 00 00 00 00          $
	$	REQ022:742 03 22 D0 5F 00 00 00 00          $

  $  000.电机母线当前温度         $    $  ℃      $    $  ANS000.BYTE003  $  X*1-40
  $  001.电机母线节点温度         $    $  ℃      $    $  ANS001.BYTE003  $  X*1-40
  $  002.电机扭矩请求             $    $  Nm      $    $  ANS002.BYTE003  $  XY*0.25-511
  $  003.电机当前负扭矩极限       $    $  Nm      $    $  ANS003.BYTE003  $  XY*0.25-511
  $  004.电机当前正扭矩极限       $    $  Nm      $    $  ANS004.BYTE003  $  XY*0.25
  $  005.电机速度请求             $    $  rpm     $    $  ANS005.BYTE003  $  XY*1-16384
  $  006.电机当前速度             $    $  rpm     $    $  ANS006.BYTE003  $  XY*1-16384
  $  007.电机当前功率             $    $  kW      $    $  ANS007.BYTE003  $  XY*0.1-102
  $  008.电机当前温度             $    $  ℃      $    $  ANS008.BYTE003  $  X*1-40
  $  009.电机母线电流             $    $  A       $    $  ANS009.BYTE003  $  XY*1-1023
  $  010.电机母线电压             $    $  V       $    $  ANS010.BYTE003  $  XY
  $  011.电机控制模式请求         $    $  -       $    $  ANS011.BYTE003  $  01:转速控制		02:扭矩控制		其他:-
  $  012.电机工作状态请求         $    $  -       $    $  ANS012.BYTE003  $  00:禁止		02:使能		03:紧急停止		其他:-
  $  013.电机当前工作状态         $    $  -       $    $  ANS013.BYTE003  $  00:未准备完毕		01:低压自检通过		02:MOS管自检通过		03:准备完毕		06:故障		其他:-
  $  014.电机当前控制模式         $    $  -       $    $  ANS014.BYTE003  $  01:转速控制		02:扭矩控制		其他:-
  $  015.电机当前扭矩             $    $  Nm      $    $  ANS015.BYTE003  $  XY*0.25-511
  $  016.母线电压状态             $    $  -       $    $  ANS016.BYTE003  $  00:正常		01:过高		02:过低		其他:-
  $  017.电机&MCU过热指示         $    $  -       $    $  ANS017.BYTE003  $  if(X1&0x20)y=@0056;else y=@0032;
  $  018.电机故障指示             $    $  -       $    $  ANS017.BYTE005  $  if(X1&0x80)y=@0033;else y=@0032;
  $  019.电机超速指示             $    $  -       $    $  ANS017.BYTE005  $  if(X1&0x20)y=@0033;else y=@0032;
  $  020.电机旋变标定状态         $    $  -       $    $  ANS018.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  021.电机降额工作状态         $    $  -       $    $  ANS019.BYTE003  $  if(X1&0x1)y=@0061;else y=@0032;
  $  022.母线回馈过流指示         $    $  -       $    $  ANS020.BYTE003  $  if(X1&0x1)y=@0062;else y=@0032;
  $  023.电机驱动过流指示         $    $  -       $    $  ANS021.BYTE003  $  if(X1&0x1)y=@0062;else y=@0032;
  $  024.电机或母线过温指示       $    $  -       $    $  ANS022.BYTE003  $  if(X1&0x1)y=@0063;else y=@0032;

 $ 06.转向系统

	$	REQ000:742 03 22 D0 82 00 00 00 00          $
	$	REQ001:742 03 22 D0 84 00 00 00 00          $
	$	REQ002:742 03 22 D0 87 00 00 00 00          $
	$	REQ003:742 03 22 D0 54 00 00 00 00          $
	$	REQ004:742 03 22 D0 83 00 00 00 00          $
	$	REQ005:742 03 22 D0 85 00 00 00 00          $
	$	REQ006:742 03 22 D0 86 00 00 00 00          $

  $  000.方向盘角度传感器校准状态       $    $  -       $    $  ANS000.BYTE003  $  00:未使用		01:预估		02:校准		03:预留		其他:-
  $  001.方向盘角度                     $    $  deg     $    $  ANS001.BYTE003  $  [0000-7FFF]:XY*0.0625+0		[8000-FFFF]:(XY-65535)*0.0625+0
  $  002.EPS工作电流                    $    $  A       $    $  ANS002.BYTE003  $  XY*0.25
  $  003.动力转向故障指示               $    $  -       $    $  ANS003.BYTE005  $  if(X1&0x10)y=@0033;else y=@0032;
  $  004.方向盘角度传感器初始化         $    $  -       $    $  ANS004.BYTE003  $  if(X1&0x1)y=@0073;else y=@0072;
  $  005.动力转向故障指示               $    $  -       $    $  ANS005.BYTE003  $  if(X1&0x1)y=@0075;else y=@0074;
  $  006.转向负载-EPS激活               $    $  -       $    $  ANS006.BYTE003  $  if(X1&0x1)y=@0077;else y=@0076;

 $ 07.底盘系统

	$	REQ000:742 03 22 D0 8D 00 00 00 00          $
	$	REQ001:742 03 22 D0 8E 00 00 00 00          $
	$	REQ002:742 03 22 D0 8F 00 00 00 00          $
	$	REQ003:742 03 22 D0 90 00 00 00 00          $
	$	REQ004:742 03 22 D0 91 00 00 00 00          $
	$	REQ005:742 03 22 D0 92 00 00 00 00          $
	$	REQ006:742 03 22 D0 93 00 00 00 00          $
	$	REQ007:742 03 22 D0 94 00 00 00 00          $

  $  000.底盘系统扭矩干预类型                 $    $  -        $    $  ANS000.BYTE003  $  00:不干预		01:降扭		02:升扭		其他:-
  $  001.底盘系统请求电机增扭值               $    $  Nm       $    $  ANS001.BYTE003  $  XY*0.5-848
  $  002.底盘系统请求电机快速降低扭矩值       $    $  Nm       $    $  ANS002.BYTE003  $  XY*0.5-848
  $  003.底盘系统请求电机慢速降低扭矩值       $    $  Nm       $    $  ANS003.BYTE003  $  XY*0.5-848
  $  004.左驱动轮对地面速度                   $    $  km/h     $    $  ANS004.BYTE003  $  XY*0.01
  $  005.右驱动轮对地面速度                   $    $  km/h     $    $  ANS005.BYTE003  $  XY*0.01
  $  006.左从动轮对地面速度                   $    $  km/h     $    $  ANS006.BYTE003  $  XY*0.01
  $  007.右从动轮对地面速度                   $    $  km/h     $    $  ANS007.BYTE003  $  XY*0.01

 $ 08.电子驻车（EPB）

	$	REQ000:742 03 22 D0 96 00 00 00 00          $
	$	REQ001:742 03 22 D0 97 00 00 00 00          $
	$	REQ002:742 03 22 D0 98 00 00 00 00          $
	$	REQ003:742 03 22 D0 99 00 00 00 00          $
	$	REQ004:742 03 22 D0 9D 00 00 00 00          $
	$	REQ005:742 03 22 D0 8C 00 00 00 00          $
	$	REQ006:742 03 22 D0 9A 00 00 00 00          $
	$	REQ007:742 03 22 D0 9B 00 00 00 00          $
	$	REQ008:742 03 22 D0 9C 00 00 00 00          $

  $  000.EPB运行状态                       $    $  -     $    $  ANS000.BYTE003  $  00:默认状态		01:驻车状态		02:释放状态		03:预留		其他:-
  $  001.EPB系统工作状态                   $    $  -     $    $  ANS001.BYTE003  $  00:未知		01:释放		02:加紧		03:释放过程中		04:加紧过程中		其他:-
  $  002.EPB系统报警显示要求               $    $  -     $    $  ANS002.BYTE003  $  00:不指示		01:连续指示		02:闪烁指示		其他:-
  $  003.驻车键状态                        $    $  -     $    $  ANS003.BYTE003  $  00:正常		01:释放		02:拉起		其他:-
  $  004.EPB坡度信号                       $    $  %     $    $  ANS004.BYTE003  $  XY*0.1
  $  005.坡道保持控制激活                  $    $  -     $    $  ANS005.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  006.EPB故障                           $    $  -     $    $  ANS002.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  007.EPB动态驻车                       $    $  -     $    $  ANS006.BYTE003  $  if(X1&0x1)y=@0080;else y=@0032;
  $  008.EPB制动灯点亮请求                 $    $  -     $    $  ANS007.BYTE003  $  if(X1&0x1)y=@0082;else y=@0081;
  $  009.EPB系统状态指示灯需求有效性       $    $  -     $    $  ANS008.BYTE003  $  if(X1&0x1)y=@0084;else y=@0083;

 $ 09.其他

	$	REQ000:742 03 22 D0 06 00 00 00 00          $
	$	REQ001:742 03 22 D0 81 00 00 00 00          $
	$	REQ002:742 03 22 D1 00 00 00 00 00          $
	$	REQ003:742 03 22 D1 01 00 00 00 00          $
	$	REQ004:742 03 22 D1 14 00 00 00 00          $
	$	REQ005:742 03 22 D0 54 00 00 00 00          $
	$	REQ006:742 03 22 D0 80 00 00 00 00          $
	$	REQ007:742 03 22 D0 89 00 00 00 00          $
	$	REQ008:742 03 22 D0 8A 00 00 00 00          $
	$	REQ009:742 03 22 D0 8B 00 00 00 00          $
	$	REQ010:742 03 22 D1 02 00 00 00 00          $
	$	REQ011:742 03 22 D1 07 00 00 00 00          $
	$	REQ012:742 03 22 D1 08 00 00 00 00          $
	$	REQ013:742 03 22 D1 09 00 00 00 00          $
	$	REQ014:742 03 22 D1 0A 00 00 00 00          $
	$	REQ015:742 03 22 D1 0C 00 00 00 00          $
	$	REQ016:742 03 22 D1 0F 00 00 00 00          $
	$	REQ017:742 03 22 D1 10 00 00 00 00          $
	$	REQ018:742 03 22 D1 11 00 00 00 00          $
	$	REQ019:742 03 22 D1 16 00 00 00 00          $
	$	REQ020:742 03 22 D1 17 00 00 00 00          $
	$	REQ021:742 03 22 D1 18 00 00 00 00          $
	$	REQ022:742 03 22 D1 19 00 00 00 00          $
	$	REQ023:742 03 22 D1 1B 00 00 00 00          $
	$	REQ024:742 03 22 D1 1F 00 00 00 00          $

  $  000.加速踏板位置               $    $  %      $    $  ANS000.BYTE003  $  X
  $  001.驾驶座空置状态             $    $  -      $    $  ANS001.BYTE003  $  00:空置		01:有人		02:预留		03:传感器故障		其他:-
  $  002.加速踏板信号1电压值        $    $  V      $    $  ANS002.BYTE003  $  XY*0.00488
  $  003.加速踏板信号2电压值        $    $  V      $    $  ANS003.BYTE003  $  XY*0.00488
  $  004.真空泵工作模式频率         $    $  Hz     $    $  ANS004.BYTE003  $  XY
  $  005.真空泵警告指示             $    $  -      $    $  ANS005.BYTE004  $  if(X1&0x1)y=@0033;else y=@0032;
  $  006.ABS指示                    $    $  -      $    $  ANS005.BYTE005  $  if(X1&0x8)y=@0033;else y=@0032;
  $  007.制动过程指示               $    $  -      $    $  ANS005.BYTE005  $  if(X1&0x4)y=@0033;else y=@0032;
  $  008.VSC关闭指示                $    $  -      $    $  ANS005.BYTE005  $  if(X1&0x2)y=@0033;else y=@0032;
  $  009.驾驶员安全带状态           $    $  -      $    $  ANS006.BYTE003  $  if(X1&0x1)y=@0071;else y=@0070;
  $  010.ABS激活                    $    $  -      $    $  ANS007.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  011.VSC激活                    $    $  -      $    $  ANS008.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  012.牵引力空置系统激活         $    $  -      $    $  ANS009.BYTE003  $  if(X1&0x1)y=@0079;else y=@0078;
  $  013.制动踏板信号               $    $  -      $    $  ANS010.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  014.PTC1信号                   $    $  -      $    $  ANS011.BYTE003  $  if(X1&0x1)y=@0085;else y=@0086;
  $  015.PTC2信号                   $    $  -      $    $  ANS012.BYTE003  $  if(X1&0x1)y=@0085;else y=@0086;
  $  016.A/C开关                    $    $  -      $    $  ANS013.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  017.高压配电箱开启信号         $    $  -      $    $  ANS014.BYTE003  $  if(X1&0x1)y=@0087;else y=@0040;
  $  018.手刹信号                   $    $  -      $    $  ANS015.BYTE003  $  if(X1&0x1)y=@0089;else y=@0088;
  $  019.钥匙ON档                   $    $  -      $    $  ANS016.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  020.钥匙ACC档                  $    $  -      $    $  ANS017.BYTE003  $  if(X1&0x1)y=@0086;else y=@0085;
  $  021.DCDC故障信号               $    $  -      $    $  ANS018.BYTE003  $  if(X1&0x1)y=@0032;else y=@0033;
  $  022.冷凝风扇控制信号           $    $  -      $    $  ANS019.BYTE003  $  if(X1&0x1)y=@0093;else y=@0092;
  $  023.PTC1继电器控制信号         $    $  -      $    $  ANS020.BYTE003  $  if(X1&0x1)y=@0095;else y=@0094;
  $  024.PTC2继电器控制信号         $    $  -      $    $  ANS021.BYTE003  $  if(X1&0x1)y=@0097;else y=@0096;
  $  025.DCDC使能信号               $    $  -      $    $  ANS022.BYTE003  $  if(X1&0x1)y=@0043;else y=@0098;
  $  026.AC启停控制信号             $    $  -      $    $  ANS023.BYTE003  $  if(X1&0x1)y=@0100;else y=@0099;
  $  027.倒车灯继电器控制信号       $    $  -      $    $  ANS024.BYTE003  $  if(X1&0x1)y=@0102;else y=@0101;


