$~#6$~#14$~500$~7E8
;******************************************************************************************************************************************************

车型代号:GP30
车型:宝骏330
排量:1.5
年份:2015
模块名缩写:ECM
模块名:发动机控制模块
供应商:未知
诊断代码:GP30_1.5L_2015_ECM_CAN

;******************************************************************************************************************************************************
激活命令

	$~	REQ000:7E0 02 10 01 00 00 00 00 00          $~          7E8 02 10 01 00 00 00 00 00

;******************************************************************************************************************************************************
诊断仪在线需回复

	 	REQ000:7E0 02 3E 00 00 00 00 00 00           

;******************************************************************************************************************************************************
诊断仪在线无回复

	$!	REQ000:7E0 02 3E 80 00 00 00 00 00          $!

;******************************************************************************************************************************************************
读取故障码

	$#	REQ000:7E0 03 19 02 08 00 00 00 00          $#

			规律:帧长决定故障码个数，$#BYTE03$#开始表示故障码，每$#4$#个字节表示一个故障码,前$#2$#个字节表示码号,无状态位。

		$*$*DTC/BJ330DTCS


;******************************************************************************************************************************************************
清除故障码

	$$	REQ000:7E0 04 14 FF FF FF 00 00 00          $$

;******************************************************************************************************************************************************
ECU复位

		REQ000:7E0 02 11 01 00 00 00 00 00          

;******************************************************************************************************************************************************
模块信息

	$%	REQ000:7E0 03 22 F1 83 00 00 00 00          $%
	$%	REQ001:7E0 03 22 F1 87 00 00 00 00          $%
	$%	REQ002:7E0 03 22 F1 90 00 00 00 00          $%
	$%	REQ003:7E0 03 22 F1 91 00 00 00 00          $%
	$%	REQ004:7E0 03 22 F1 92 00 00 00 00          $%
	$%	REQ005:7E0 03 22 F1 94 00 00 00 00          $%
	$%	REQ006:7E0 03 22 F1 8B 00 00 00 00          $%
	$%	REQ007:7E0 03 22 F1 8C 00 00 00 00          $%
	$%	REQ008:7E0 03 22 F1 AA 00 00 00 00          $%

  $%  000:ECU软件号             $%    $%  ANS000.BYTE003  $%  10个字节的ASCII显示
  $%  001:ECU零件号             $%    $%  ANS001.BYTE003  $%  05个字节的HEX显示
  $%  002:VIN                   $%    $%  ANS002.BYTE003  $%  17个字节的ASCII显示
  $%  003:ECU硬件号             $%    $%  ANS003.BYTE003  $%  05个字节的HEX显示
  $%  004:供应商ECU硬件号       $%    $%  ANS004.BYTE003  $%  10个字节的ASCII显示
  $%  005:供应商ECU软件号       $%    $%  ANS005.BYTE003  $%  10个字节的ASCII显示
  $%  006:ECU制造日期           $%    $%  ANS006.BYTE003  $%  03个字节的HEX显示
  $%  007:供应商ECU序列号       $%    $%  ANS007.BYTE003  $%  15个字节的ASCII显示
  $%  008:ECU编程文件号         $%    $%  ANS008.BYTE003  $%  05个字节的HEX显示

;******************************************************************************************************************************************************
数据流

 $ 00.数据

	$	REQ000:7E0 03 22 E0 00 00 00 00 00          $
	$	REQ001:7E0 03 22 E0 01 00 00 00 00          $
	$	REQ002:7E0 03 22 E0 02 00 00 00 00          $
	$	REQ003:7E0 03 22 E0 03 00 00 00 00          $
	$	REQ004:7E0 03 22 E0 04 00 00 00 00          $
	$	REQ005:7E0 03 22 E0 05 00 00 00 00          $
	$	REQ006:7E0 03 22 E0 06 00 00 00 00          $
	$	REQ007:7E0 03 22 E0 07 00 00 00 00          $
	$	REQ008:7E0 03 22 E0 09 00 00 00 00          $
	$	REQ009:7E0 03 22 E0 10 00 00 00 00          $
	$	REQ010:7E0 03 22 E0 11 00 00 00 00          $
	$	REQ011:7E0 03 22 E0 12 00 00 00 00          $
	$	REQ012:7E0 03 22 E0 13 00 00 00 00          $
	$	REQ013:7E0 03 22 E0 14 00 00 00 00          $
	$	REQ014:7E0 03 22 E0 16 00 00 00 00          $
	$	REQ015:7E0 03 22 E0 17 00 00 00 00          $
	$	REQ016:7E0 03 22 E0 18 00 00 00 00          $
	$	REQ017:7E0 03 22 E0 19 00 00 00 00          $
	$	REQ018:7E0 03 22 E0 29 00 00 00 00          $
	$	REQ019:7E0 03 22 E1 00 00 00 00 00          $
	$	REQ020:7E0 03 22 E1 03 00 00 00 00          $
	$	REQ021:7E0 03 22 E2 01 00 00 00 00          $
	$	REQ022:7E0 03 22 E2 02 00 00 00 00          $
	$	REQ023:7E0 03 22 E2 03 00 00 00 00          $
	$	REQ024:7E0 03 22 E2 04 00 00 00 00          $
	$	REQ025:7E0 03 22 E4 00 00 00 00 00          $
	$	REQ026:7E0 03 22 E4 01 00 00 00 00          $
	$	REQ027:7E0 03 22 E5 00 00 00 00 00          $
	$	REQ028:7E0 03 22 E5 01 00 00 00 00          $
	$	REQ029:7E0 03 22 E5 02 00 00 00 00          $
	$	REQ030:7E0 03 22 E5 03 00 00 00 00          $
	$	REQ031:7E0 03 22 E5 04 00 00 00 00          $
	$	REQ032:7E0 03 22 E5 05 00 00 00 00          $
	$	REQ033:7E0 03 22 E5 06 00 00 00 00          $
	$	REQ034:7E0 03 22 E5 07 00 00 00 00          $
	$	REQ035:7E0 03 22 E5 08 00 00 00 00          $
	$	REQ036:7E0 03 22 E6 00 00 00 00 00          $
	$	REQ037:7E0 03 22 E6 01 00 00 00 00          $
	$	REQ038:7E0 03 22 E6 02 00 00 00 00          $
	$	REQ039:7E0 03 22 E6 03 00 00 00 00          $
	$	REQ040:7E0 03 22 E6 04 00 00 00 00          $
	$	REQ041:7E0 03 22 E6 05 00 00 00 00          $
	$	REQ042:7E0 03 22 E6 06 00 00 00 00          $
	$	REQ043:7E0 03 22 E7 00 00 00 00 00          $
	$	REQ044:7E0 03 22 E7 01 00 00 00 00          $
	$	REQ045:7E0 03 22 E8 01 00 00 00 00          $
	$	REQ046:7E0 03 22 E8 02 00 00 00 00          $
	$	REQ047:7E0 03 22 E8 03 00 00 00 00          $
	$	REQ048:7E0 03 22 E8 04 00 00 00 00          $

  $  000.电池电压                                    $    $  V           $    $  ANS000.BYTE003  $  X*0.06836
  $  001.主继电器电压                                $    $  V           $    $  ANS001.BYTE003  $  X*0.1 
  $  002.驾驶员踩油门加速踏板角度                    $    $  %           $    $  ANS002.BYTE003  $  X*0.392
  $  003.加速踏板位置传感器1电压                     $    $  V           $    $  ANS003.BYTE003  $  X*0.0195
  $  004.加速踏板位置传感器2电压                     $    $  V           $    $  ANS004.BYTE003  $  X*0.0195
  $  005.发动机冷却液温度                            $    $  deg C       $    $  ANS005.BYTE003  $  X*1-40
  $  006.发动机冷却液温度传感器电压                  $    $  V           $    $  ANS006.BYTE003  $  X*0.0195
  $  007.车速                                        $    $  Kmh         $    $  ANS007.BYTE003  $  X
  $  008.节气门绝对位置                              $    $  %           $    $  ANS008.BYTE003  $  X*0.39216
  $  009.发动机油温                                  $    $  deg C       $    $  ANS009.BYTE003  $  X*1-60
  $  010.发动机油温传感器电压                        $    $  V           $    $  ANS010.BYTE003  $  X*0.0195
  $  011.发动机转速                                  $    $  Rpm         $    $  ANS011.BYTE003  $  XY*0.25
  $  012.进气温度                                    $    $  deg C       $    $  ANS012.BYTE003  $  X*0.75-48
  $  013.进气温度传感器电压                          $    $  V           $    $  ANS013.BYTE003  $  X*0.0195
  $  014.进气管绝对压力                              $    $  hPa         $    $  ANS014.BYTE003  $  X*10
  $  015.进气管绝对压力传感器电压                    $    $  V           $    $  ANS015.BYTE003  $  X*0.0195
  $  016.油量                                        $    $  L           $    $  ANS016.BYTE003  $  X*0.4
  $  017.交流发电机负荷                              $    $  %           $    $  ANS017.BYTE003  $  X*0.392
  $  018.环境温度                                    $    $  Deg C       $    $  ANS018.BYTE003  $  X*1-40
  $  019.空调蒸发器温度                              $    $  Deg C       $    $  ANS019.BYTE003  $  X*0.75-48
  $  020.空调蒸发器温度传感器电压                    $    $  V           $    $  ANS020.BYTE003  $  X*0.0195
  $  021.实际指示转矩                                $    $  %           $    $  ANS021.BYTE003  $  X*0.3906
  $  022.实际内部扭矩                                $    $  %           $    $  ANS022.BYTE003  $  X*0.3906
  $  023.驾驶员请求扭矩值                            $    $  %           $    $  ANS023.BYTE003  $  X*0.3906
  $  024.摩擦损失扭矩                                $    $  %           $    $  ANS024.BYTE003  $  X*0.3906
  $  025.巡航开关电压                                $    $  V           $    $  ANS025.BYTE003  $  X*0.0195
  $  026.车速                                        $    $  Kph         $    $  ANS026.BYTE003  $  XY*0.0078
  $  027.节气门开度（根据传感器1）                   $    $  % DK        $    $  ANS027.BYTE003  $  X*0.392
  $  028.节气门开度（根据传感器2）                   $    $  % DK        $    $  ANS028.BYTE003  $  X*0.392
  $  029.低位机械停止位的节气门角度                  $    $  % DK        $    $  ANS029.BYTE003  $  X*0.000625
  $  030.节气门位置传感器1电压                       $    $  V           $    $  ANS030.BYTE003  $  X*0.0195
  $  031.节气门位置传感器2电压                       $    $  V           $    $  ANS031.BYTE003  $  X*0.0195
  $  032.低位机械停止位的节气门位置传感器1电压       $    $  V           $    $  ANS032.BYTE003  $  X*0.0195
  $  033.低位机械停止位的节气门位置传感器2电压       $    $  V           $    $  ANS033.BYTE003  $  X*0.0195
  $  034.跛行回家模式下节气门开度                    $    $  % DK        $    $  ANS034.BYTE003  $  XY*0.001526
  $  035.节气门开度自适应值                          $    $  % DK        $    $  ANS035.BYTE003  $  XY*0.001526
  $  036.上游氧传感器周期                            $    $  Sec's       $    $  ANS036.BYTE003  $  X*0.04
  $  037.下游氧传感器电压                            $    $  V           $    $  ANS037.BYTE003  $  X*0.0195
  $  038.上游氧传感器电压                            $    $  V           $    $  ANS038.BYTE003  $  X*0.0195
  $  039.上游氧传感器加热器占空比                    $    $  N/A         $    $  ANS039.BYTE003  $  X*0.01
  $  040.下游氧传感器加热器占空比                    $    $  N/A         $    $  ANS040.BYTE003  $  X*0.01
  $  041.碳罐吹洗阀工作率                            $    $  %           $    $  ANS041.BYTE003  $  X*0.392
  $  042.碳罐吹洗负荷                                $    $  N/A         $    $  ANS042.BYTE003  $  XY*0.00195
  $  043.手动变速器                                  $    $  N/A         $    $  ANS043.BYTE003  $  X
  $  044.手动变速器档位                              $    $  N/A         $    $  ANS044.BYTE003  $  X*0.1
  $  045.可变进气凸轮正时系统参考延迟位置            $    $  Grad KW     $    $  ANS045.BYTE003  $  [0000-7FFF]:XY*0.01562+0		[8000-FFFF]:(XY-65535)*0.01562+0
  $  046.可变进气凸轮正时系统参考提前位置            $    $  Grad KW     $    $  ANS046.BYTE003  $  [0000-7FFF]:XY*0.01562+0		[8000-FFFF]:(XY-65535)*0.01562+0
  $  047.可变进气凸轮正时系统期望角度                $    $  Grad KW     $    $  ANS047.BYTE003  $  [0000-7FFF]:XY*0.01562+0		[8000-FFFF]:(XY-65535)*0.01562+0
  $  048.可变进气凸轮正时系统实际角度                $    $  Grad KW     $    $  ANS048.BYTE003  $  [0000-7FFF]:XY*0.01562+0		[8000-FFFF]:(XY-65535)*0.01562+0

 $ 01.发动机输入输出状态

	$	REQ000:7E0 03 22 D0 00 00 00 00 00          $
	$	REQ001:7E0 03 22 D0 03 00 00 00 00          $

  $  000.保养指示灯状态                                  $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x40)y=@0120;else y=@0119;
  $  001.故障指示灯状态                                  $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x20)y=@0120;else y=@0119;
  $  002.离合快关状态                                    $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x10)y=@0120;else y=@0119;
  $  003.安全制动开关状态                                $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x8)y=@0120;else y=@0119;
  $  004.主制动开关状态                                  $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x4)y=@0120;else y=@0119;
  $  005.不确定的开关状态                                $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x2)y=@0120;else y=@0119;
  $  006.点火开关                                        $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x1)y=@0120;else y=@0119;
  $  007.可变进气凸轮正时系统阀是否激活                  $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x4)y=@0039;else y=@0038;
  $  008.碳罐净化是否激活                                $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x2)y=@0039;else y=@0038;
  $  009.燃油泵继电器状态                                $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x1)y=@0120;else y=@0119;
  $  010.可变进气凸轮正时系统自检是否激活                $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x40)y=@0039;else y=@0038;
  $  011.可变进气凸轮正时系统自检5是否完成               $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x20)y=@0073;else y=@0072;
  $  012.可变进气凸轮正时系统自检4是否完成               $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x10)y=@0073;else y=@0072;
  $  013.可变进气凸轮正时系统自检3是否完成               $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x8)y=@0073;else y=@0072;
  $  014.可变进气凸轮正时系统自检2是否完成               $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x4)y=@0073;else y=@0072;
  $  015.可变进气凸轮正时系统自检1是否完成               $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x2)y=@0073;else y=@0072;
  $  016.可变进气凸轮正时系统自检0是否完成               $    $  -     $    $  ANS000.BYTE005  $  if(X1&0x1)y=@0073;else y=@0072;
  $  017.可变进气凸轮正时系统自检在第5阶段时被打断       $    $  -     $    $  ANS000.BYTE006  $  if(X1&0x10)y=@0162;else y=@0161;
  $  018.可变进气凸轮正时系统自检在第4阶段时被打断       $    $  -     $    $  ANS000.BYTE006  $  if(X1&0x8)y=@0162;else y=@0161;
  $  019.可变进气凸轮正时系统自检在第3阶段时被打断       $    $  -     $    $  ANS000.BYTE006  $  if(X1&0x4)y=@0162;else y=@0161;
  $  020.可变进气凸轮正时系统自检在第2阶段时被打断       $    $  -     $    $  ANS000.BYTE006  $  if(X1&0x2)y=@0162;else y=@0161;
  $  021.可变进气凸轮正时系统自检在第1阶段时被打断       $    $  -     $    $  ANS000.BYTE006  $  if(X1&0x1)y=@0162;else y=@0161;
  $  022.交流发电机占空比                                $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x80)y=@0033;else y=@0032;
  $  023.冷却液温度传感器                                $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x40)y=@0033;else y=@0032;
  $  024.空气温度传感器                                  $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x20)y=@0033;else y=@0032;
  $  025.门锁传感器                                      $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x10)y=@0033;else y=@0032;
  $  026.油温传感器                                      $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x8)y=@0033;else y=@0032;
  $  027.歧管压力传感器                                  $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x4)y=@0033;else y=@0032;
  $  028.曲轴信号                                        $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x2)y=@0033;else y=@0032;
  $  029.凸轮轴信号                                      $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  030.失火信号2                                       $    $  -     $    $  ANS001.BYTE004  $  if(X1&0x80)y=@0033;else y=@0032;
  $  031.失火信号1                                       $    $  -     $    $  ANS001.BYTE004  $  if(X1&0x40)y=@0033;else y=@0032;
  $  032.凸轮轴控制系统                                  $    $  -     $    $  ANS001.BYTE004  $  if(X1&0x20)y=@0033;else y=@0032;
  $  033.碳罐净化系统                                    $    $  -     $    $  ANS001.BYTE004  $  if(X1&0x10)y=@0033;else y=@0032;
  $  034.燃油泵继电器状态                                $    $  -     $    $  ANS001.BYTE004  $  if(X1&0x8)y=@0033;else y=@0032;
  $  035.离合器开关                                      $    $  -     $    $  ANS001.BYTE004  $  if(X1&0x2)y=@0033;else y=@0032;
  $  036.制动开关                                        $    $  -     $    $  ANS001.BYTE004  $  if(X1&0x1)y=@0033;else y=@0032;
  $  037.上游氧传感器                                    $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x80)y=@0033;else y=@0032;
  $  038.上游氧传感器加热                                $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x40)y=@0033;else y=@0032;
  $  039.下游氧传感器                                    $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x20)y=@0033;else y=@0032;
  $  040.下游氧传感器加热                                $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x10)y=@0033;else y=@0032;
  $  041.喷油泵电磁阀4                                   $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x8)y=@0033;else y=@0032;
  $  042.喷油泵电磁阀3                                   $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x4)y=@0033;else y=@0032;
  $  043.喷油泵电磁阀2                                   $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x2)y=@0033;else y=@0032;
  $  044.喷油泵电磁阀1                                   $    $  -     $    $  ANS001.BYTE005  $  if(X1&0x1)y=@0033;else y=@0032;
  $  045.主电池供电电压                                  $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x80)y=@0033;else y=@0032;
  $  046.主继电器供电电压                                $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x40)y=@0033;else y=@0032;
  $  047.电子节气门电源状态                              $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x20)y=@0033;else y=@0032;
  $  048.电子节气门马达                                  $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x10)y=@0033;else y=@0032;
  $  049.节气门位置传感器2                               $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x8)y=@0033;else y=@0032;
  $  050.节气门位置传感器1                               $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x4)y=@0033;else y=@0032;
  $  051.加速踏板位置传感器2                             $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x2)y=@0033;else y=@0032;
  $  052.加速踏板位置传感器1                             $    $  -     $    $  ANS001.BYTE006  $  if(X1&0x1)y=@0033;else y=@0032;

 $ 02.诊断管理状态

	$	REQ000:7E0 03 22 D0 02 00 00 00 00          $

  $  000.默认诊断会话是否激活           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x4)y=@0039;else y=@0038;
  $  001.编程诊断会话是否激活           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x2)y=@0039;else y=@0038;
  $  002.扩展诊断会话是否激活           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x1)y=@0039;else y=@0038;
  $  003.系统供应商级安全访问状态       $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x8)y=@0039;else y=@0038;
  $  004.IMMO级安全访问状态             $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x4)y=@0164;else y=@0163;
  $  005.编程级安全访问状态             $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x2)y=@0164;else y=@0163;
  $  006.OEM级安全访问状态              $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x1)y=@0164;else y=@0163;

 $ 03.环境控制操作状态

	$	REQ000:7E0 03 22 D1 00 00 00 00 00          $
	$	REQ001:7E0 03 22 D1 01 00 00 00 00          $

  $  000.冷却风扇开关状态           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x40)y=@0166;else y=@0165;
  $  001.冷却风扇2继电器状态        $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x20)y=@0120;else y=@0119;
  $  002.冷却风扇1继电器状态        $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x10)y=@0120;else y=@0119;
  $  003.空调压缩机请求             $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x4)y=@0120;else y=@0119;
  $  004.空调配置                   $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x20)y=@0168;else y=@0167;
  $  005.蒸发器温度传感器           $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x10)y=@0120;else y=@0119;
  $  006.冷却风扇占空比电源         $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x8)y=@0120;else y=@0119;
  $  007.冷却风扇2继电器电源        $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x4)y=@0120;else y=@0119;
  $  008.冷却风扇1继电器电源        $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x2)y=@0120;else y=@0119;
  $  009.空调压缩机继电器电源       $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x1)y=@0120;else y=@0119;

 $ 04.网络错误状态

	$	REQ000:7E0 03 22 D2 00 00 00 00 00          $

  $  000.车速信号状态                       $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x80)y=@0086;else y=@0085;
  $  001.车速信号状态                       $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x40)y=@0033;else y=@0032;
  $  002.接收信息状态                       $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x10)y=@0166;else y=@0165;
  $  003.仪表模块信息接收状态               $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x8)y=@0169;else y=@0032;
  $  004.电路诊断短接端口信息接收状态       $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x2)y=@0169;else y=@0032;
  $  005.总线状态                           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x1)y=@0033;else y=@0032;
  $  006.安全控制模块信号接收               $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x8)y=@0169;else y=@0032;
  $  007.安全气囊报警模块信号接收           $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x4)y=@0169;else y=@0032;
  $  008.变速器模块信号接收                 $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x2)y=@0169;else y=@0032;
  $  009.车身模块信号接收                   $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x1)y=@0169;else y=@0032;

 $ 05.扭矩干涉状态

	$	REQ000:7E0 03 22 D2 01 00 00 00 00          $
	$	REQ001:7E0 03 22 D4 01 00 00 00 00          $

  $  000.扭矩减少驱动防滑状态         $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x20)y=@0039;else y=@0038;
  $  001.扭矩增加阻力矩控制状态       $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x10)y=@0039;else y=@0038;
  $  002.巡航激活指示灯               $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x8)y=@0082;else y=@0170;
  $  003.巡航备用指示灯               $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x4)y=@0082;else y=@0170;
  $  004.刹车踏板                     $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x2)y=@0172;else y=@0171;
  $  005.离合踏板                     $    $  -     $    $  ANS001.BYTE003  $  if(X1&0x1)y=@0172;else y=@0171;

 $ 06.车速控制可逆性关闭

	$	REQ000:7E0 03 22 D4 03 00 00 00 00          $

  $  000.车速阀值           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x80)y=@0173;else y=@0032;
  $  001.目标测试偏差       $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x40)y=@0063;else y=@0032;
  $  002.目标测试偏差       $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x20)y=@0174;else y=@0032;
  $  003.刹车踏板           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x10)y=@0172;else y=@0171;
  $  004.离合踏板           $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x8)y=@0172;else y=@0171;
  $  005.档位               $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x4)y=@0175;else y=@0032;
  $  006.发动机转速         $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x2)y=@0175;else y=@0032;
  $  007.扭矩               $    $  -     $    $  ANS000.BYTE003  $  if(X1&0x1)y=@0176;else y=@0032;
  $  008.加速度             $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x2)y=@0063;else y=@0032;
  $  009.加速度             $    $  -     $    $  ANS000.BYTE004  $  if(X1&0x1)y=@0174;else y=@0032;


