
    车型ID：061e

    模拟：协议模拟-->061e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E9

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 00 00 00 00 00 00       $!  ANS000:7E9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/fe000000


  $#  01.读故障码库
  $#  REQ000:7E1 02 19 0A 00 00 00 00 00       $#  ANS000:7E9 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/fe000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 12 00 00 00 00       $%  ANS000:7E9 03 22 F1 12 00 00 00 00
  $%  REQ001:7E1 03 22 F1 87 00 00 00 00       $%  ANS001:7E9 03 22 F1 87 00 00 00 00
  $%  REQ002:7E1 03 22 F1 8A 00 00 00 00       $%  ANS002:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ003:7E1 03 22 F1 8C 00 00 00 00       $%  ANS003:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ004:7E1 03 22 F1 90 00 00 00 00       $%  ANS004:7E9 03 22 F1 90 00 00 00 00
  $%  REQ005:7E1 03 22 F1 92 00 00 00 00       $%  ANS005:7E9 03 22 F1 92 00 00 00 00
  $%  REQ006:7E1 03 22 F1 93 00 00 00 00       $%  ANS006:7E9 03 22 F1 93 00 00 00 00
  $%  REQ007:7E1 03 22 F1 94 00 00 00 00       $%  ANS007:7E9 03 22 F1 94 00 00 00 00
  $%  REQ008:7E1 03 22 F1 95 00 00 00 00       $%  ANS008:7E9 03 22 F1 95 00 00 00 00
  $%  REQ009:7E1 03 22 F1 9D 00 00 00 00       $%  ANS009:7E9 03 22 F1 9D 00 00 00 00
  $%  REQ010:7E1 03 22 F1 01 00 00 00 00       $%  ANS010:7E9 03 22 F1 01 00 00 00 00
  $%  REQ011:7E1 03 22 F1 02 00 00 00 00       $%  ANS011:7E9 03 22 F1 02 00 00 00 00
  $%  REQ012:7E1 03 22 F1 82 00 00 00 00       $%  ANS012:7E9 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                        $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                                          $%    $%  ANS001.BYTE004  $%  0 ASCII
  $%  002:供应商代号:                                      $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:ECU(电子控制器)序列号:                           $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  004:TCU(自动变速器控制单元)标定变量代码:             $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  005:ECU(电子控制器)硬件号:                           $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $%  006:ECU(电子控制器)硬件版本号:                       $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:ECU(电子控制器)软件号:                           $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  008:ECU(电子控制器)软件版本号:                       $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)安装日期:                         $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  010:应用软件版本号软件版本:                          $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  011:应用软件版本号软件平台:                          $%    $%  ANS010.BYTE004  $%  ASCII(x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40);
  $%  012:应用软件版本号全部应用软件:                      $%    $%  ANS010.BYTE004  $%  ASCII(x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60);
  $%  013:应用软件版本号应用软件循环冗赘校验(CRC16):       $%    $%  ANS010.BYTE004  $%  HEX(x61,x62);
  $%  014:应用数据版本号应用数据版本:                      $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  015:应用数据版本号应用数据平台:                      $%    $%  ANS011.BYTE004  $%  ASCII(x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40);
  $%  016:应用数据版本号全部应用数据:                      $%    $%  ANS011.BYTE004  $%  ASCII(x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60);
  $%  017:应用数据版本号应用数据循环冗赘校验(CRC16):       $%    $%  ANS011.BYTE004  $%  HEX(x61,x62);
  $%  018:标定软件版本号:                                  $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.档位选择器信息
  $  00.档位选择器信息
  $  REQ000:7E1 03 22 FD 05 00 00 00 00       $  ANS000:7E9 03 22 FD 05 00 00 00 00

  $  000.档位选择器位置       $    $  /     $    $  ANS000.BYTE004  $  if(x1==0x00) y=@0113;else if(x1==0x01) y=@0114;else if(x1==0x02) y=@0115;else if(x1==0x03) y=@0116;else if(x1==0x04) y=@0117;else y=@0008;
  $  001.手动换档(TGS)        $    $  /     $    $  ANS000.BYTE004  $  if(x2==0x00) y=@0111;else if(x2==0x01) y=@0106;else if(x2==0x02) y=@0107;else if(x2==0x03) y=@0112;else if(x2==0x04) y=@00be;else y=@0008;
  $  002.手动换档(SW)         $    $  /     $    $  ANS000.BYTE004  $  if(x3==0x00) y=@0111;else if(x3==0x01) y=@0106;else if(x3==0x02) y=@0107;else if(x3==0x03) y=@0112;else if(x3==0x04) y=@00be;else y=@0008;
  $  003.手动换档(结合)       $    $  /     $    $  ANS000.BYTE004  $  if(x4==0x00) y=@010e;else if(x4==0x01) y=@001c;else if(x4==0x02) y=@0106;else if(x4==0x03) y=@0107;else y=@0008;
  $  004.传动模式             $    $  /     $    $  ANS000.BYTE004  $  if(x5==0x00) y=@010f;else if(x5==0x01) y=@0110;else if(x5==0x02) y=@0104;else if(x5==0x03) y=@0103;else y=@0008;

  $)  01.扫描工具
  $  01.扫描工具
  $  REQ000:7E1 03 22 FD 06 00 00 00 00       $  ANS000:7E9 03 22 FD 06 00 00 00 00

  $  000.TCU(自动变速器控制单元)供电电压       $    $  V        $    $  ANS000.BYTE004  $  y=x1/10;
  $  001.T/M机油温度                           $    $  degC     $    $  ANS000.BYTE004  $  y=x2-40;
  $  002.换挡杆位置                            $    $  /        $    $  ANS000.BYTE004  $  if(x3==0x00) y=@0113;else if(x3==0x01) y=@0114;else if(x3==0x02) y=@0115;else if(x3==0x03) y=@0116;else if(x3==0x04) y=@0117;else y=@0008;
  $  003.手动换档控制                          $    $  /        $    $  ANS000.BYTE004  $  if(x4==0x00) y=@010e;else if(x4==0x01) y=@001c;else if(x4==0x02) y=@0106;else if(x4==0x03) y=@0107;else y=@0008;
  $  004.正常，冬季， 运动模式开关             $    $  /        $    $  ANS000.BYTE004  $  if(x5==0x00) y=@010f;else if(x5==0x01) y=@0110;else if(x5==0x02) y=@0104;else if(x5==0x03) y=@0103;else y=@0008;
  $  005.T/M跛行回家模式                       $    $  /        $    $  ANS000.BYTE004  $  if(x6==0x00) y=@001d;else y=@001c;
  $  006.发动机速度(CAN)                       $    $  rpm      $    $  ANS000.BYTE004  $  y=x8*0x100+x7;
  $  007.T/C 滑动速度                          $    $  rpm      $    $  ANS000.BYTE004  $  y=x10*0x100+x9;
  $  008.输入速度                              $    $  rpm      $    $  ANS000.BYTE004  $  y=x12*0x100+x11;
  $  009.输出速度                              $    $  rpm      $    $  ANS000.BYTE004  $  y=x14*0x100+x13;
  $  010.辅助速度                              $    $  rpm      $    $  ANS000.BYTE004  $  y=x16*0x100+x15;
  $  011.油门踏板位置(CAN)                     $    $  %        $    $  ANS000.BYTE004  $  y=x17;
  $  012.当前档位                              $    $  /        $    $  ANS000.BYTE004  $  if(x18==0x00) y=@0118;else if(x18==0x01) y=@0119;else if(x18==0x02) y=@011a;else if(x18==0x03) y=@011b;else if(x18==0x04) y=@011c;else if(x18==0x05) y=@011d;else if(x18==0x06) y=@011e;else if(x18==0x07) y=@011f;else if(x18==0x08) y=@0120;else if(x18==0x09) y=@011f;else if(x18==0x0A) y=@011f;else if(x18==0x0B) y=@0121;else if(x18==0x0C) y=@0122;else y=@0008;
  $  013.指令档位                              $    $  /        $    $  ANS000.BYTE004  $  if(X19==0x00) y=@0118;else if(X19==0x01) y=@0119;else if(X19==0x02) y=@011a;else if(X19==0x03) y=@011b;else if(X19==0x04) y=@011c;else if(X19==0x05) y=@011d;else if(X19==0x06) y=@011e;else if(X19==0x07) y=@011f;else if(X19==0x08) y=@0120;else if(X19==0x09) y=@011f;else if(X19==0x0A) y=@011f;else if(X19==0x0B) y=@0121;else if(X19==0x0C) y=@0122;else y=@0008;
  $  014.T/C当前离合器                         $    $  /        $    $  ANS000.BYTE004  $  if(x20==0x00) y=@0001;else if(x20==0x01) y=@0001;else if(x20==0x02) y=@0123;else if(x20==0x03) y=@0123;else if(x20==0x04) y=@0124;else y=@0008;
  $  015.T/C离合器指令                         $    $  /        $    $  ANS000.BYTE004  $  if(x21==0x00) y=@0001;else if(x21==0x01) y=@0001;else if(x21==0x02) y=@0123;else if(x21==0x03) y=@0123;else if(x21==0x04) y=@0124;else y=@0008;
  $  016.分动器状态                            $    $  /        $    $  ANS000.BYTE004  $  if(x22==0x00) y=@0125;else if(x22==0x01) y=@0126;else if(x22==0x02) y=@0127;else if(x22==0x03) y=@0128;else y=@0008;

  $)  02.TCU(自动变速器控制单元)印制电路板温度
  $  02.TCU(自动变速器控制单元)印制电路板温度
  $  REQ000:7E1 03 22 FD 07 00 00 00 00       $  ANS000:7E9 03 22 FD 07 00 00 00 00

  $  000.TCU(自动变速器控制单元)印制电路板温度：       $    $  degC     $    $  ANS000.BYTE004  $  if(x1>0x80) y=(x2*0x100+x1-65536); else y=(x2*0x100+x1);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
