
    车型ID：0631

    模拟：协议模拟-->0631

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7EA

进入命令:

  $~  REQ000:7E2 02 10 01 00 00 00 00 00       $~  ANS000:7EA 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E2 02 3E 00 00 00 00 00 00       $!  ANS000:7EA 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7E2 03 19 02 09 00 00 00 00       $#  ANS000:7EA 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d1000000


  $#  01.读故障码库
  $#  REQ000:7E2 02 19 0A 00 00 00 00 00       $#  ANS000:7EA 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d1000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E2 04 14 FF FF FF 00 00 00       $$  ANS000:7EA 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E2 03 22 F1 12 00 00 00 00       $%  ANS000:7EA 03 22 F1 12 00 00 00 00
  $%  REQ001:7E2 03 22 F1 86 00 00 00 00       $%  ANS001:7EA 03 22 F1 86 00 00 00 00
  $%  REQ002:7E2 03 22 F1 87 00 00 00 00       $%  ANS002:7EA 03 22 F1 87 00 00 00 00
  $%  REQ003:7E2 03 22 F1 89 00 00 00 00       $%  ANS003:7EA 03 22 F1 89 00 00 00 00
  $%  REQ004:7E2 03 22 F1 8A 00 00 00 00       $%  ANS004:7EA 03 22 F1 8A 00 00 00 00
  $%  REQ005:7E2 03 22 F1 8B 00 00 00 00       $%  ANS005:7EA 03 22 F1 8B 00 00 00 00
  $%  REQ006:7E2 03 22 F1 8C 00 00 00 00       $%  ANS006:7EA 03 22 F1 8C 00 00 00 00
  $%  REQ007:7E2 03 22 F1 90 00 00 00 00       $%  ANS007:7EA 03 22 F1 90 00 00 00 00
  $%  REQ008:7E2 03 22 F1 98 00 00 00 00       $%  ANS008:7EA 03 22 F1 98 00 00 00 00
  $%  REQ009:7E2 03 22 F1 99 00 00 00 00       $%  ANS009:7EA 03 22 F1 99 00 00 00 00
  $%  REQ010:7E2 03 22 F1 9D 00 00 00 00       $%  ANS010:7EA 03 22 F1 9D 00 00 00 00

  $%  000:车辆名称:                        $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:主动诊断会话数据标识符:          $%    $%  ANS001.BYTE004  $%  HEX(x);
  $%  002:BCM(车身控制模块)产品信息:       $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  003:BCM(车身控制模块)软件版本:       $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3);
  $%  004:供应商代号:                      $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:产品生产日期:                    $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  006:BCM(车身控制模块)生产信息:       $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  007:车辆识别码(VIN码):               $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  008:维修店号:                        $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  009:编程或配置日期:                  $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  010:安装日期:                        $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.动态数据流
  $  00.动态数据流
  $  REQ000:7E2 03 22 02 00 00 00 00 00       $  ANS000:7EA 03 22 02 00 00 00 00 00
  $  REQ001:7E2 03 22 02 01 00 00 00 00       $  ANS001:7EA 03 22 02 01 00 00 00 00
  $  REQ002:7E2 03 22 DF 01 00 00 00 00       $  ANS002:7EA 03 22 DF 01 00 00 00 00
  $  REQ003:7E2 03 22 DF 02 00 00 00 00       $  ANS003:7EA 03 22 DF 02 00 00 00 00
  $  REQ004:7E2 03 22 DF 03 00 00 00 00       $  ANS004:7EA 03 22 DF 03 00 00 00 00
  $  REQ005:7E2 03 22 DF 04 00 00 00 00       $  ANS005:7EA 03 22 DF 04 00 00 00 00

  $  000.编程成功计数器       $    $  /        $    $  ANS000.BYTE004  $  HEX(x);
  $  001.编程计数器           $    $  /        $    $  ANS001.BYTE004  $  HEX(x);
  $  002.车速                 $    $  km/h     $    $  ANS002.BYTE004  $  y=INT(((x1<<8)+x2)*0.05625);
  $  003.转速                 $    $  rpm      $    $  ANS003.BYTE004  $  y=INT(((x1<<8)+x2)*0.25);
  $  004.电池电压             $    $  V        $    $  ANS004.BYTE004  $  y=x*0.073675;
  $  005.里程                 $    $  km       $    $  ANS005.BYTE004  $  y=((x1<<16)+(x2<<8)+x3);

  $)  01.输入信号
  $  01.输入信号
  $  REQ000:7E2 03 22 DF 10 00 00 00 00       $  ANS000:7EA 03 22 DF 10 00 00 00 00

  $  000.右后侧门状态             $    $  /     $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@0000;else y=@0001;
  $  001.左后侧门状态             $    $  /     $    $  ANS000.BYTE004  $  if((x&0x02)==0x00) y=@0000;else y=@0001;
  $  002.乘客侧门状态             $    $  /     $    $  ANS000.BYTE004  $  if((x&0x04)==0x00) y=@0000;else y=@0001;
  $  003.司机侧门状态             $    $  /     $    $  ANS000.BYTE004  $  if((x&0x08)==0x00) y=@0000;else y=@0001;
  $  004.后备箱状态               $    $  /     $    $  ANS000.BYTE004  $  if((x&0x10)==0x00) y=@0000;else y=@0001;
  $  005.st信号                   $    $  /     $    $  ANS000.BYTE004  $  if((x&0x20)==0x00) y=@0000;else y=@0001;
  $  006.acc信号                  $    $  /     $    $  ANS000.BYTE004  $  if((x&0x40)==0x00) y=@0000;else y=@0001;
  $  007.ig信号                   $    $  /     $    $  ANS000.BYTE004  $  if((x&0x80)==0x00) y=@0000;else y=@0001;
  $  008.危险告警开关状态         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x01)==0x00) y=@0000;else y=@0001;
  $  009.喇叭开关状态             $    $  /     $    $  ANS000.BYTE005  $  if((x&0x02)==0x00) y=@0000;else y=@0001;
  $  010.阳关传感器状态           $    $  /     $    $  ANS000.BYTE005  $  if((x&0x04)==0x00) y=@01a3;else y=@01a4;
  $  011.灯光开关在自动档         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x08)==0x00) y=@0000;else y=@0001;
  $  012.灯光开关在小灯档         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x10)==0x00) y=@0000;else y=@0001;
  $  013.灯光开关在近光档         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x20)==0x00) y=@0000;else y=@0001;
  $  014.灯光开关在远光档         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x40)==0x00) y=@0000;else y=@0001;
  $  015.灯光开关在超车档         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x80)==0x00) y=@0000;else y=@0001;
  $  016.后除霜开关状态           $    $  /     $    $  ANS000.BYTE006  $  if((x&0x01)==0x00) y=@0000;else y=@0001;
  $  017.机舱盖开关状态           $    $  /     $    $  ANS000.BYTE006  $  if((x&0x02)==0x00) y=@0000;else y=@0001;
  $  018.钥匙插入信号             $    $  /     $    $  ANS000.BYTE006  $  if((x&0x04)==0x00) y=@0000;else y=@0001;
  $  019.司机侧锁状态信号         $    $  /     $    $  ANS000.BYTE006  $  if((x&0x08)==0x00) y=@0000;else y=@0001;
  $  020.中控解锁信号             $    $  /     $    $  ANS000.BYTE006  $  if((x&0x10)==0x00) y=@0000;else y=@0001;
  $  021.中控闭锁信号             $    $  /     $    $  ANS000.BYTE006  $  if((x&0x20)==0x00) y=@0000;else y=@0001;
  $  022.钥匙解锁信号             $    $  /     $    $  ANS000.BYTE006  $  if((x&0x40)==0x00) y=@0000;else y=@0001;
  $  023.钥匙闭锁信号             $    $  /     $    $  ANS000.BYTE006  $  if((x&0x80)==0x00) y=@0000;else y=@0001;
  $  024.右后电动窗降信号         $    $  /     $    $  ANS000.BYTE007  $  if((x&0x01)==0x00) y=@0000;else y=@0001;
  $  025.右后电动窗升信号         $    $  /     $    $  ANS000.BYTE007  $  if((x&0x02)==0x00) y=@0000;else y=@0001;
  $  026.左后电动窗降信号         $    $  /     $    $  ANS000.BYTE007  $  if((x&0x04)==0x00) y=@0000;else y=@0001;
  $  027.左后电动窗升信号         $    $  /     $    $  ANS000.BYTE007  $  if((x&0x08)==0x00) y=@0000;else y=@0001;
  $  028.乘客侧电动窗降信号       $    $  /     $    $  ANS000.BYTE007  $  if((x&0x10)==0x00) y=@0000;else y=@0001;
  $  029.乘客侧电动窗升信号       $    $  /     $    $  ANS000.BYTE007  $  if((x&0x20)==0x00) y=@0000;else y=@0001;
  $  030.司机侧电动窗降信号       $    $  /     $    $  ANS000.BYTE007  $  if((x&0x40)==0x00) y=@0000;else y=@0001;
  $  031.司机侧电动窗升信号       $    $  /     $    $  ANS000.BYTE007  $  if((x&0x80)==0x00) y=@0000;else y=@0001;
  $  032.行李箱解锁开关状态       $    $  /     $    $  ANS000.BYTE008  $  if((x&0x01)==0x00) y=@0000;else y=@0001;
  $  033.右转向开关状态           $    $  /     $    $  ANS000.BYTE008  $  if((x&0x02)==0x00) y=@0000;else y=@0001;
  $  034.左转向开关状态           $    $  /     $    $  ANS000.BYTE008  $  if((x&0x04)==0x00) y=@0000;else y=@0001;
  $  035.雨刮停止位状态           $    $  /     $    $  ANS000.BYTE008  $  if((x&0x08)==0x00) y=@019c;else y=@019d;
  $  036.洗涤开关状态             $    $  /     $    $  ANS000.BYTE008  $  if((x&0x10)==0x00) y=@0000;else y=@0001;
  $  037.雨刮间隙开关状态         $    $  /     $    $  ANS000.BYTE008  $  if((x&0x20)==0x00) y=@0000;else y=@0001;
  $  038.雨刮低速开关状态         $    $  /     $    $  ANS000.BYTE008  $  if((x&0x40)==0x00) y=@0000;else y=@0001;
  $  039.雨刮高速开关状态         $    $  /     $    $  ANS000.BYTE008  $  if((x&0x80)==0x00) y=@0000;else y=@0001;
  $  040.雨刮间歇档位             $    $  /     $    $  ANS000.BYTE009  $  if((x&0xE0)==0x00) y=@019e;else if((x&0xE0)==0x20) y=@019f;else if((x&0xE0)==0x40) y=@01a0;else if((x&0xE0)==0x60) y=@01a1;else if((x&0xE0)==0x80) y=@01a2;else y=@00b8;

  $)  02.输出信号
  $  02.输出信号
  $  REQ000:7E2 03 22 DF 20 00 00 00 00       $  ANS000:7EA 03 22 DF 20 00 00 00 00

  $  000.右后电动窗降                       $    $  /     $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@001d;else y=@001c;
  $  001.右后电动窗升                       $    $  /     $    $  ANS000.BYTE004  $  if((x&0x02)==0x00) y=@001d;else y=@001c;
  $  002.左后电动窗降                       $    $  /     $    $  ANS000.BYTE004  $  if((x&0x04)==0x00) y=@001d;else y=@001c;
  $  003.左后电动窗升                       $    $  /     $    $  ANS000.BYTE004  $  if((x&0x08)==0x00) y=@001d;else y=@001c;
  $  004.乘客侧电动窗降                     $    $  /     $    $  ANS000.BYTE004  $  if((x&0x10)==0x00) y=@001d;else y=@001c;
  $  005.乘客侧电动窗升                     $    $  /     $    $  ANS000.BYTE004  $  if((x&0x20)==0x00) y=@001d;else y=@001c;
  $  006.司机侧电动窗降                     $    $  /     $    $  ANS000.BYTE004  $  if((x&0x40)==0x00) y=@001d;else y=@001c;
  $  007.司机侧电动窗升                     $    $  /     $    $  ANS000.BYTE004  $  if((x&0x80)==0x00) y=@001d;else y=@001c;
  $  008.室内灯工作状态                     $    $  /     $    $  ANS000.BYTE005  $  if((x&0x01)==0x00) y=@001d;else y=@001c;
  $  009.行李箱解锁工作状态                 $    $  /     $    $  ANS000.BYTE005  $  if((x&0x02)==0x00) y=@001d;else y=@001c;
  $  010.中控解锁工作状态                   $    $  /     $    $  ANS000.BYTE005  $  if((x&0x04)==0x00) y=@001d;else y=@001c;
  $  011.中控闭锁工作状态                   $    $  /     $    $  ANS000.BYTE005  $  if((x&0x08)==0x00) y=@001d;else y=@001c;
  $  012.右侧转向灯工作状态                 $    $  /     $    $  ANS000.BYTE005  $  if((x&0x10)==0x00) y=@001d;else y=@001c;
  $  013.左侧转向灯工作状态                 $    $  /     $    $  ANS000.BYTE005  $  if((x&0x20)==0x00) y=@001d;else y=@001c;
  $  014.雨刮低速工作状态                   $    $  /     $    $  ANS000.BYTE005  $  if((x&0x40)==0x00) y=@001d;else y=@001c;
  $  015.雨刮高速工作状态                   $    $  /     $    $  ANS000.BYTE005  $  if((x&0x80)==0x00) y=@001d;else y=@001c;
  $  016.后除霜工作状态                     $    $  /     $    $  ANS000.BYTE006  $  if((x&0x04)==0x00) y=@001d;else y=@001c;
  $  017.喇叭工作状态                       $    $  /     $    $  ANS000.BYTE006  $  if((x&0x08)==0x00) y=@001d;else y=@001c;
  $  018.日行灯工作状态                     $    $  /     $    $  ANS000.BYTE006  $  if((x&0x10)==0x00) y=@001d;else y=@001c;
  $  019.小灯工作状态                       $    $  /     $    $  ANS000.BYTE006  $  if((x&0x20)==0x00) y=@001d;else y=@001c;
  $  020.近光灯工作状态                     $    $  /     $    $  ANS000.BYTE006  $  if((x&0x40)==0x00) y=@001d;else y=@001c;
  $  021.远光灯工作状态                     $    $  /     $    $  ANS000.BYTE006  $  if((x&0x80)==0x00) y=@001d;else y=@001c;
  $  022.ST(正时电磁阀)继电器工作状态       $    $  /     $    $  ANS000.BYTE007  $  if((x&0x10)==0x00) y=@001d;else y=@001c;
  $  023.ACC继电器工作状态                  $    $  /     $    $  ANS000.BYTE007  $  if((x&0x20)==0x00) y=@001d;else y=@001c;
  $  024.IG1继电器工作状态                  $    $  /     $    $  ANS000.BYTE007  $  if((x&0x40)==0x00) y=@001d;else y=@001c;
  $  025.IG2继电器工作状态                  $    $  /     $    $  ANS000.BYTE007  $  if((x&0x80)==0x00) y=@001d;else y=@001c;

  $)  03.ECU(电子控制器)功能配置
  $  03.ECU(电子控制器)功能配置
  $  REQ000:7E2 03 22 F1 01 00 00 00 00       $  ANS000:7EA 03 22 F1 01 00 00 00 00

  $  000.电源未关闭提醒           $    $  /     $    $  ANS000.BYTE004  $  if((x)==0x00) y=@0198;else if((x)==0x01) y=@0199;else if((x)==0x02) y=@019a;else y=@0033;
  $  001.钥匙不在车内提醒         $    $  /     $    $  ANS000.BYTE005  $  if((x)==0x00) y=@012e;else if((x)==0x01) y=@001c;else y=@0033;
  $  002.电子锁锁止失败提醒       $    $  /     $    $  ANS000.BYTE006  $  if((x)==0x00) y=@012e;else if((x)==0x01) y=@001c;else y=@0033;
  $  003.行车自动落锁功能         $    $  /     $    $  ANS000.BYTE007  $  if((x)==0x00) y=@0024;else if((x)==0x01) y=@0192;else if((x)==0x02) y=@0193;else if((x)==0x03) y=@0194;else y=@0033;
  $  004.懒惰解锁                 $    $  /     $    $  ANS000.BYTE008  $  if((x)==0x00) y=@0024;else if((x)==0x01) y=@0195;else if((x)==0x02) y=@0196;else if((x)==0x03) y=@0197;else y=@0033;
  $  005.白昼灯功能               $    $  /     $    $  ANS000.BYTE009  $  if((x)==0x00) y=@012e;else if((x)==0x01) y=@001c;else y=@0033;
  $  006.电源非OFF报警            $    $  /     $    $  ANS000.BYTE010  $  if((x)==0x00) y=@012e;else if((x)==0x01) y=@001c;else y=@0033;
  $  007.车门未关闭报警           $    $  /     $    $  ANS000.BYTE011  $  if((x)==0x00) y=@012e;else if((x)==0x01) y=@001c;else y=@0033;
  $  008.钥匙在车内报警           $    $  /     $    $  ANS000.BYTE012  $  if((x)==0x00) y=@012e;else if((x)==0x01) y=@001c;else y=@0033;
  $  009.有无天窗                 $    $  /     $    $  ANS000.BYTE013  $  if((x)==0x00) y=@0024;else if((x)==0x01) y=@019b;else y=@0033;

  $)  04.网络节点配置
  $  04.网络节点配置
  $  REQ000:7E2 03 22 F1 10 00 00 00 00       $  ANS000:7EA 03 22 F1 10 00 00 00 00

  $  000.EMS(发动机管理系统)                       $    $  /     $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@015a;else y=@015b;
  $  001.ICU(仪表控制单元)                         $    $  /     $    $  ANS000.BYTE004  $  if((x&0x02)==0x00) y=@015a;else y=@015b;
  $  002.BCM(车身控制模块)                         $    $  /     $    $  ANS000.BYTE004  $  if((x&0x04)==0x00) y=@015a;else y=@015b;
  $  003.TCU(自动变速器控制单元)                   $    $  /     $    $  ANS000.BYTE004  $  if((x&0x08)==0x00) y=@015a;else y=@015b;
  $  004.ACU(安全气囊控制单元)                     $    $  /     $    $  ANS000.BYTE004  $  if((x&0x10)==0x00) y=@015a;else y=@015b;
  $  005.ABS(防抱死系统)/ESP(电子稳定控制器)       $    $  /     $    $  ANS000.BYTE004  $  if((x&0x20)==0x00) y=@015a;else y=@015b;
  $  006.PEPS(无钥匙进入一键式启动单元)            $    $  /     $    $  ANS000.BYTE004  $  if((x&0x40)==0x00) y=@015a;else y=@015b;
  $  007.EPS(电动助力转向系统)                     $    $  /     $    $  ANS000.BYTE004  $  if((x&0x80)==0x00) y=@015a;else y=@015b;
  $  008.SAS(方向盘转角传感器)                     $    $  /     $    $  ANS000.BYTE005  $  if((x&0x01)==0x00) y=@015a;else y=@015b;
  $  009.FRS(前雷达系统)                           $    $  /     $    $  ANS000.BYTE005  $  if((x&0x02)==0x00) y=@015a;else y=@015b;
  $  010.AC(空调控制器)                            $    $  /     $    $  ANS000.BYTE005  $  if((x&0x04)==0x00) y=@015a;else y=@015b;
  $  011.MMI(多媒体交互系统)                       $    $  /     $    $  ANS000.BYTE005  $  if((x&0x08)==0x00) y=@015a;else y=@015b;
  $  012.PAS(泊车辅助系统)                         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x10)==0x00) y=@015a;else y=@015b;
  $  013.TPMS(胎压监视系统)                        $    $  /     $    $  ANS000.BYTE005  $  if((x&0x20)==0x00) y=@015a;else y=@015b;
  $  014.T-BOX(远程信息处理控制器)                 $    $  /     $    $  ANS000.BYTE005  $  if((x&0x40)==0x00) y=@015a;else y=@015b;
  $  015.ESCL(电子转向柱锁控制单元)                $    $  /     $    $  ANS000.BYTE005  $  if((x&0x80)==0x00) y=@015a;else y=@015b;
  $  016.EPB(电子驻车制动系统)                     $    $  /     $    $  ANS000.BYTE006  $  if((x&0x01)==0x00) y=@015a;else y=@015b;
  $  017.FCS(前摄像头系统)                         $    $  /     $    $  ANS000.BYTE006  $  if((x&0x02)==0x00) y=@015a;else y=@015b;
  $  018.PTG(后背门自动举升)                       $    $  /     $    $  ANS000.BYTE006  $  if((x&0x04)==0x00) y=@015a;else y=@015b;
  $  019.DSCU(驾驶员座椅控制模块)                  $    $  /     $    $  ANS000.BYTE006  $  if((x&0x08)==0x00) y=@015a;else y=@015b;
  $  020.AFS(智能前大灯随动系统)                   $    $  /     $    $  ANS000.BYTE006  $  if((x&0x10)==0x00) y=@015a;else y=@015b;
  $  021.SDC                                       $    $  /     $    $  ANS000.BYTE006  $  if((x&0x20)==0x00) y=@015a;else y=@015b;
  $  022.IMMO(防盗控制模块)                        $    $  /     $    $  ANS000.BYTE006  $  if((x&0x40)==0x00) y=@015a;else y=@015b;
  $  023.4WD(四轮驱动系统)                         $    $  /     $    $  ANS000.BYTE006  $  if((x&0x80)==0x00) y=@015a;else y=@015b;
  $  024.RCM(后摄像头模块)                         $    $  /     $    $  ANS000.BYTE007  $  if((x&0x02)==0x00) y=@015a;else y=@015b;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E2 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
