
    车型ID：0685

    模拟：协议模拟-->0685

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k$~7B8,1905DC0

进入命令:

  $~  REQ000:7B0 02 10 01 00 00 00 00 00       $~  ANS000:7B8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B0 02 3E 00 00 00 00 00 00       $!  ANS000:7B8 02 3E 00 00 00 00 00 00

退出命令:

  $@  REQ000:7B0 01 20 00 00 00 00 00 00       $@  ANS000:7B8 01 20 00 00 00 00 00 00


;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B0 03 19 02 09 00 00 00 00       $#  ANS000:7B8 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/85000000


  $#  01.读历史故障码
  $#  REQ000:7B0 03 19 02 08 00 00 00 00       $#  ANS000:7B8 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/85000000


  $#  02.读故障码库
  $#  REQ000:7B0 02 19 0A 00 00 00 00 00       $#  ANS000:7B8 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/85000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="2">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B0 04 14 FF FF FF 00 00 00       $$  ANS000:7B8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B0 03 22 F1 12 00 00 00 00       $%  ANS000:7B8 03 22 F1 12 00 00 00 00
  $%  REQ001:7B0 03 22 F1 87 00 00 00 00       $%  ANS001:7B8 03 22 F1 87 00 00 00 00
  $%  REQ002:7B0 03 22 F1 8A 00 00 00 00       $%  ANS002:7B8 03 22 F1 8A 00 00 00 00
  $%  REQ003:7B0 03 22 F1 8B 00 00 00 00       $%  ANS003:7B8 03 22 F1 8B 00 00 00 00
  $%  REQ004:7B0 03 22 F1 8C 00 00 00 00       $%  ANS004:7B8 03 22 F1 8C 00 00 00 00
  $%  REQ005:7B0 03 22 F1 90 00 00 00 00       $%  ANS005:7B8 03 22 F1 90 00 00 00 00
  $%  REQ006:7B0 03 22 F1 93 00 00 00 00       $%  ANS006:7B8 03 22 F1 93 00 00 00 00
  $%  REQ007:7B0 03 22 F1 95 00 00 00 00       $%  ANS007:7B8 03 22 F1 95 00 00 00 00
  $%  REQ008:7B0 03 22 F1 97 00 00 00 00       $%  ANS008:7B8 03 22 F1 97 00 00 00 00
  $%  REQ009:7B0 03 22 F1 9D 00 00 00 00       $%  ANS009:7B8 03 22 F1 9D 00 00 00 00

  $%  000:车辆名称:                                  $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                                    $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:供应商代码:                                $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:ECU(电子控制器)生产日期:                   $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  004:ECU(电子控制器)序列号:                     $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  005:车辆识别号（VIN码）:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  006:ECU(电子控制器)硬件版本号:                 $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:ECU(电子控制器)软件版本号:                 $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)系统名称或发动机类型:       $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  009:ECU(电子控制器)安装日期:                   $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B0 03 22 D0 00 00 00 00 00       $  ANS000:7B8 03 22 D0 00 00 00 00 00
  $  REQ001:7B0 03 22 D0 01 00 00 00 00       $  ANS001:7B8 03 22 D0 01 00 00 00 00
  $  REQ002:7B0 03 22 D0 02 00 00 00 00       $  ANS002:7B8 03 22 D0 02 00 00 00 00
  $  REQ003:7B0 03 22 D0 04 00 00 00 00       $  ANS003:7B8 03 22 D0 04 00 00 00 00
  $  REQ004:7B0 03 22 D0 05 00 00 00 00       $  ANS004:7B8 03 22 D0 05 00 00 00 00
  $  REQ005:7B0 03 22 D0 07 00 00 00 00       $  ANS005:7B8 03 22 D0 07 00 00 00 00
  $  REQ006:7B0 03 22 D0 10 00 00 00 00       $  ANS006:7B8 03 22 D0 10 00 00 00 00
  $  REQ007:7B0 03 22 D0 16 00 00 00 00       $  ANS007:7B8 03 22 D0 16 00 00 00 00
  $  REQ008:7B0 03 22 D0 18 00 00 00 00       $  ANS008:7B8 03 22 D0 18 00 00 00 00
  $  REQ009:7B0 03 22 D0 19 00 00 00 00       $  ANS009:7B8 03 22 D0 19 00 00 00 00
  $  REQ010:7B0 03 22 D0 20 00 00 00 00       $  ANS010:7B8 03 22 D0 20 00 00 00 00
  $  REQ011:7B0 03 22 D0 31 00 00 00 00       $  ANS011:7B8 03 22 D0 31 00 00 00 00
  $  REQ012:7B0 03 22 D0 33 00 00 00 00       $  ANS012:7B8 03 22 D0 33 00 00 00 00
  $  REQ013:7B0 03 22 D0 35 00 00 00 00       $  ANS013:7B8 03 22 D0 35 00 00 00 00
  $  REQ014:7B0 03 22 D0 36 00 00 00 00       $  ANS014:7B8 03 22 D0 36 00 00 00 00
  $  REQ015:7B0 03 22 D0 41 00 00 00 00       $  ANS015:7B8 03 22 D0 41 00 00 00 00
  $  REQ016:7B0 03 22 D0 42 00 00 00 00       $  ANS016:7B8 03 22 D0 42 00 00 00 00
  $  REQ017:7B0 03 22 D0 44 00 00 00 00       $  ANS017:7B8 03 22 D0 44 00 00 00 00
  $  REQ018:7B0 03 22 D0 45 00 00 00 00       $  ANS018:7B8 03 22 D0 45 00 00 00 00
  $  REQ019:7B0 03 22 D0 50 00 00 00 00       $  ANS019:7B8 03 22 D0 50 00 00 00 00
  $  REQ020:7B0 03 22 D0 52 00 00 00 00       $  ANS020:7B8 03 22 D0 52 00 00 00 00
  $  REQ021:7B0 03 22 D0 53 00 00 00 00       $  ANS021:7B8 03 22 D0 53 00 00 00 00
  $  REQ022:7B0 03 22 D0 80 00 00 00 00       $  ANS022:7B8 03 22 D0 80 00 00 00 00
  $  REQ023:7B0 03 22 D0 81 00 00 00 00       $  ANS023:7B8 03 22 D0 81 00 00 00 00
  $  REQ024:7B0 03 22 D0 91 00 00 00 00       $  ANS024:7B8 03 22 D0 91 00 00 00 00
  $  REQ025:7B0 03 22 D0 92 00 00 00 00       $  ANS025:7B8 03 22 D0 92 00 00 00 00
  $  REQ026:7B0 03 22 D0 93 00 00 00 00       $  ANS026:7B8 03 22 D0 93 00 00 00 00
  $  REQ027:7B0 03 22 D0 95 00 00 00 00       $  ANS027:7B8 03 22 D0 95 00 00 00 00
  $  REQ028:7B0 03 22 D0 97 00 00 00 00       $  ANS028:7B8 03 22 D0 97 00 00 00 00
  $  REQ029:7B0 03 22 D1 05 00 00 00 00       $  ANS029:7B8 03 22 D1 05 00 00 00 00
  $  REQ030:7B0 03 22 D1 06 00 00 00 00       $  ANS030:7B8 03 22 D1 06 00 00 00 00
  $  REQ031:7B0 03 22 D1 07 00 00 00 00       $  ANS031:7B8 03 22 D1 07 00 00 00 00
  $  REQ032:7B0 03 22 D1 08 00 00 00 00       $  ANS032:7B8 03 22 D1 08 00 00 00 00
  $  REQ033:7B0 03 22 D1 09 00 00 00 00       $  ANS033:7B8 03 22 D1 09 00 00 00 00
  $  REQ034:7B0 03 22 D1 53 00 00 00 00       $  ANS034:7B8 03 22 D1 53 00 00 00 00
  $  REQ035:7B0 03 22 D1 54 00 00 00 00       $  ANS035:7B8 03 22 D1 54 00 00 00 00
  $  REQ036:7B0 03 22 D1 55 00 00 00 00       $  ANS036:7B8 03 22 D1 55 00 00 00 00
  $  REQ037:7B0 03 22 D1 56 00 00 00 00       $  ANS037:7B8 03 22 D1 56 00 00 00 00
  $  REQ038:7B0 03 22 D1 57 00 00 00 00       $  ANS038:7B8 03 22 D1 57 00 00 00 00
  $  REQ039:7B0 03 22 D1 71 00 00 00 00       $  ANS039:7B8 03 22 D1 71 00 00 00 00
  $  REQ040:7B0 03 22 D1 74 00 00 00 00       $  ANS040:7B8 03 22 D1 74 00 00 00 00
  $  REQ041:7B0 03 22 D1 75 00 00 00 00       $  ANS041:7B8 03 22 D1 75 00 00 00 00
  $  REQ042:7B0 03 22 D1 76 00 00 00 00       $  ANS042:7B8 03 22 D1 76 00 00 00 00
  $  REQ043:7B0 03 22 D1 77 00 00 00 00       $  ANS043:7B8 03 22 D1 77 00 00 00 00
  $  REQ044:7B0 03 22 D1 78 00 00 00 00       $  ANS044:7B8 03 22 D1 78 00 00 00 00
  $  REQ045:7B0 03 22 D1 79 00 00 00 00       $  ANS045:7B8 03 22 D1 79 00 00 00 00
  $  REQ046:7B0 03 22 D1 83 00 00 00 00       $  ANS046:7B8 03 22 D1 83 00 00 00 00
  $  REQ047:7B0 03 22 D2 02 00 00 00 00       $  ANS047:7B8 03 22 D2 02 00 00 00 00
  $  REQ048:7B0 03 22 D2 05 00 00 00 00       $  ANS048:7B8 03 22 D2 05 00 00 00 00
  $  REQ049:7B0 03 22 D2 06 00 00 00 00       $  ANS049:7B8 03 22 D2 06 00 00 00 00
  $  REQ050:7B0 03 22 D2 14 00 00 00 00       $  ANS050:7B8 03 22 D2 14 00 00 00 00
  $  REQ051:7B0 03 22 D2 19 00 00 00 00       $  ANS051:7B8 03 22 D2 19 00 00 00 00
  $  REQ052:7B0 03 22 D2 27 00 00 00 00       $  ANS052:7B8 03 22 D2 27 00 00 00 00
  $  REQ053:7B0 03 22 D2 37 00 00 00 00       $  ANS053:7B8 03 22 D2 37 00 00 00 00
  $  REQ054:7B0 03 22 D2 42 00 00 00 00       $  ANS054:7B8 03 22 D2 42 00 00 00 00
  $  REQ055:7B0 03 22 D2 48 00 00 00 00       $  ANS055:7B8 03 22 D2 48 00 00 00 00
  $  REQ056:7B0 03 22 D2 49 00 00 00 00       $  ANS056:7B8 03 22 D2 49 00 00 00 00
  $  REQ057:7B0 03 22 D2 50 00 00 00 00       $  ANS057:7B8 03 22 D2 50 00 00 00 00
  $  REQ058:7B0 03 22 D2 51 00 00 00 00       $  ANS058:7B8 03 22 D2 51 00 00 00 00
  $  REQ059:7B0 03 22 D2 53 00 00 00 00       $  ANS059:7B8 03 22 D2 53 00 00 00 00
  $  REQ060:7B0 03 22 D2 54 00 00 00 00       $  ANS060:7B8 03 22 D2 54 00 00 00 00
  $  REQ061:7B0 03 22 D2 55 00 00 00 00       $  ANS061:7B8 03 22 D2 55 00 00 00 00
  $  REQ062:7B0 03 22 D2 56 00 00 00 00       $  ANS062:7B8 03 22 D2 56 00 00 00 00
  $  REQ063:7B0 03 22 D2 58 00 00 00 00       $  ANS063:7B8 03 22 D2 58 00 00 00 00
  $  REQ064:7B0 03 22 D2 59 00 00 00 00       $  ANS064:7B8 03 22 D2 59 00 00 00 00
  $  REQ065:7B0 03 22 D2 63 00 00 00 00       $  ANS065:7B8 03 22 D2 63 00 00 00 00
  $  REQ066:7B0 03 22 D2 67 00 00 00 00       $  ANS066:7B8 03 22 D2 67 00 00 00 00
  $  REQ067:7B0 03 22 D2 68 00 00 00 00       $  ANS067:7B8 03 22 D2 68 00 00 00 00
  $  REQ068:7B0 03 22 D2 77 00 00 00 00       $  ANS068:7B8 03 22 D2 77 00 00 00 00
  $  REQ069:7B0 03 22 D2 78 00 00 00 00       $  ANS069:7B8 03 22 D2 78 00 00 00 00
  $  REQ070:7B0 03 22 D2 87 00 00 00 00       $  ANS070:7B8 03 22 D2 87 00 00 00 00
  $  REQ071:7B0 03 22 D2 88 00 00 00 00       $  ANS071:7B8 03 22 D2 88 00 00 00 00
  $  REQ072:7B0 03 22 D2 97 00 00 00 00       $  ANS072:7B8 03 22 D2 97 00 00 00 00
  $  REQ073:7B0 03 22 D3 00 00 00 00 00       $  ANS073:7B8 03 22 D3 00 00 00 00 00
  $  REQ074:7B0 03 22 D3 02 00 00 00 00       $  ANS074:7B8 03 22 D3 02 00 00 00 00
  $  REQ075:7B0 03 22 D3 03 00 00 00 00       $  ANS075:7B8 03 22 D3 03 00 00 00 00
  $  REQ076:7B0 03 22 D3 10 00 00 00 00       $  ANS076:7B8 03 22 D3 10 00 00 00 00
  $  REQ077:7B0 03 22 D3 12 00 00 00 00       $  ANS077:7B8 03 22 D3 12 00 00 00 00
  $  REQ078:7B0 03 22 D3 14 00 00 00 00       $  ANS078:7B8 03 22 D3 14 00 00 00 00
  $  REQ079:7B0 03 22 D3 16 00 00 00 00       $  ANS079:7B8 03 22 D3 16 00 00 00 00
  $  REQ080:7B0 03 22 D3 17 00 00 00 00       $  ANS080:7B8 03 22 D3 17 00 00 00 00
  $  REQ081:7B0 03 22 D3 18 00 00 00 00       $  ANS081:7B8 03 22 D3 18 00 00 00 00
  $  REQ082:7B0 03 22 D3 23 00 00 00 00       $  ANS082:7B8 03 22 D3 23 00 00 00 00
  $  REQ083:7B0 03 22 D3 24 00 00 00 00       $  ANS083:7B8 03 22 D3 24 00 00 00 00
  $  REQ084:7B0 03 22 D3 25 00 00 00 00       $  ANS084:7B8 03 22 D3 25 00 00 00 00
  $  REQ085:7B0 03 22 D3 26 00 00 00 00       $  ANS085:7B8 03 22 D3 26 00 00 00 00
  $  REQ086:7B0 03 22 D3 27 00 00 00 00       $  ANS086:7B8 03 22 D3 27 00 00 00 00
  $  REQ087:7B0 03 22 D3 28 00 00 00 00       $  ANS087:7B8 03 22 D3 28 00 00 00 00
  $  REQ088:7B0 03 22 D3 29 00 00 00 00       $  ANS088:7B8 03 22 D3 29 00 00 00 00
  $  REQ089:7B0 03 22 D3 30 00 00 00 00       $  ANS089:7B8 03 22 D3 30 00 00 00 00
  $  REQ090:7B0 03 22 D3 31 00 00 00 00       $  ANS090:7B8 03 22 D3 31 00 00 00 00
  $  REQ091:7B0 03 22 D3 32 00 00 00 00       $  ANS091:7B8 03 22 D3 32 00 00 00 00
  $  REQ092:7B0 03 22 D3 33 00 00 00 00       $  ANS092:7B8 03 22 D3 33 00 00 00 00

  $  000.电机实际转速                                               $    $  rpm      $    $  ANS000.BYTE004  $  y=x1*0x100+x2-14000;
  $  001.电机系统故障状态                                           $    $  /        $    $  ANS001.BYTE004  $  if(x==0x00) y=@04a2;else if(x==0x01) y=@04a3;else if(x==0x02) y=@04a4;else if(x==0x03) y=@04a1;else y=@0009;
  $  002.电机系统控制状态                                           $    $  /        $    $  ANS002.BYTE004  $  if(x==0x00) y=@04a5;else if(x==0x01) y=@0427;else if(x==0x02) y=@023f;else if(x==0x03) y=@023f;else y=@0009;
  $  003.电机实际转矩                                               $    $  Nm       $    $  ANS003.BYTE004  $  y=(x1*0x100+x2)*0.5-300;
  $  004.电机故障码                                                 $    $  /        $    $  ANS004.BYTE004  $  y=x;
  $  005.电机系统状态模式                                           $    $  /        $    $  ANS005.BYTE004  $  if(x==0x01) y=@0318;else if(x==0x02) y=@002d;else if(x==0x03) y=@03e2;else if(x==0x04) y=@0424;else if(x==0x05) y=@0425;else if(x==0x09) y=@03d9;else if(x==0x0B) y=@03e8;else if(x==0x0C) y=@0426;else if(x==0x0D) y=@04a1;else y=@0009;
  $  006.电机控制器实际进水口温度                                   $    $  degC     $    $  ANS006.BYTE004  $  y=x-40;
  $  007.DCDC(DC-DC转换控制器)内部温度                              $    $  degC     $    $  ANS007.BYTE004  $  y=x-40;
  $  008.DCDC(DC-DC转换控制器)故障状态                              $    $  /        $    $  ANS008.BYTE004  $  if(x==0x00) y=@04a2;else if(x==0x01) y=@04a3;else if(x==0x02) y=@04a4;else if(x==0x03) y=@04a1;else y=@0009;
  $  009.DCDC(DC-DC转换控制器)控制状态                              $    $  /        $    $  ANS009.BYTE004  $  if(x==0x00) y=@04a5;else if(x==0x01) y=@0427;else if(x==0x02) y=@023f;else if(x==0x03) y=@023f;else y=@0009;
  $  010.DCDC(DC-DC转换控制器)低压输出电流                          $    $  A        $    $  ANS010.BYTE004  $  y=(x1*0x100+x2)*0.125;
  $  011.电机控制器过温降功率                                       $    $  /        $    $  ANS011.BYTE004  $  if(x==0x00) y=@04a5;else if(x==0x01) y=@0427;else if(x==0x02) y=@023f;else if(x==0x03) y=@023f;else y=@0009;
  $  012.VCU(整车控制器)紧急下电请求                                $    $  /        $    $  ANS012.BYTE004  $  if(x==0x00) y=@0424;else if(x==0x01) y=@03fe;else y=@0009;
  $  013.VCU(整车控制器)请求驻车指令                                $    $  /        $    $  ANS013.BYTE004  $  switxh(x&0x03) 0x00:y=@04a6;0x01:y=@0431;0x02:y=@0432;0x03:y=@0008;default:y=@0009;
  $  014.VCU(整车控制器)档位                                        $    $  /        $    $  ANS014.BYTE004  $  switxh(x&0x0f) 0x00:y=@04a7;0x01:y=@04a8;0x02:y=@04a9;0x03:y=@04aa;0x0f:y=@04ab;default:y=@0009;
  $  015.VCU(整车控制器)对IPU(集成动力控制器)状态模式请求           $    $  /        $    $  ANS015.BYTE004  $  switxh(x&0x0f) 0x02:y=@002d;0x04:y=@0424;0x0b:y=@03e8;0x0d:y=@04a1;0x0f:y=@0008;default:y=@0009;
  $  016.VCU(整车控制器)对IPU(集成动力控制器)控制状态请求           $    $  /        $    $  ANS016.BYTE004  $  switxh(x&0x03) 0x00:y=@04a5;0x01:y=@0427;0x02:y=@023f;0x03:y=@023f;default:y=@0009;
  $  017.VCU(整车控制器)对IPU(集成动力控制器)的请求扭矩上限         $    $  Nm       $    $  ANS017.BYTE004  $  y=x1*0x100+x2;
  $  018.VCU(整车控制器)对IPU(集成动力控制器)的请求扭矩下限         $    $  Nm       $    $  ANS018.BYTE004  $  y=x1*0x100+x2-300;
  $  019.VCU(整车控制器)对DCDC(DC-DC转换控制器)的控制状态请求       $    $  /        $    $  ANS019.BYTE004  $  switxh(x&0x03) 0x00:y=@04a5;0x01:y=@0427;0x02:y=@023f;0x03:y=@023f;default:y=@0009;
  $  020.VCU(整车控制器)_DCDC(DC-DC转换控制器)_iActHvMax            $    $  A        $    $  ANS020.BYTE004  $  y=x*0.125;
  $  021.VCU(整车控制器)对BMS(电池管理系统)的状态模式请求           $    $  /        $    $  ANS021.BYTE004  $  switxh(x&0x0f) 0x02:y=@002d;0x04:y=@0424;0x0b:y=@03e8;0x0d:y=@04a1;0x0f:y=@0008;default:y=@0009;
  $  022.BMS(电池管理系统)状态模式                                  $    $  /        $    $  ANS022.BYTE004  $  switxh(x&0x0f) 0x00:y=@023f;0x01:y=@0318;0x02:y=@002d;0x03:y=@03e2;0x04:y=@04ac;0x05:y=@04ad;0x06:y=@04ae;0x07:y=@03e6;0x08:y=@04af;0x09:y=@04b0;0x0a:y=@03e9;0x0b:y=@03e8;0x0b:y=@04b1;0x0c:y=@03eb;0x0d:y=@03ec;0x0e:y=@04b2;0x0f:y=@04b3;default:y=@0009;
  $  023.BMS(电池管理系统)检测充电线CP信号                          $    $  /        $    $  ANS023.BYTE004  $  switxh(x&0x07) 0x00:y=@01c3;0x01:y=@0489;0x02:y=@048a;0x03:y=@048b;0x07:y=@048c;default:y=@0009;
  $  024.BMS(电池管理系统)检测充电线CC信号                          $    $  /        $    $  ANS024.BYTE004  $  if(((x>>0)&1)) y=@01c4;else y=@01c3;
  $  025.BMS(电池管理系统)检测快充连接状态                          $    $  /        $    $  ANS025.BYTE004  $  if(((x>>0)&1)) y=@01c4;else y=@01c3;
  $  026.BMS(电池管理系统)系统故障等级                              $    $  /        $    $  ANS026.BYTE004  $  switxh(x&0x0f) 0x00:y=@0424;default:y=x;
  $  027.电池电流                                                   $    $  A        $    $  ANS027.BYTE004  $  y=(x1*0x100+x2)*0.1-500;
  $  028.电池电压                                                   $    $  A        $    $  ANS028.BYTE004  $  y=x1*0x100+x2;
  $  029.BMS(电池管理系统)峰值充电功率                              $    $  kW       $    $  ANS029.BYTE004  $  y=x;
  $  030.BMS(电池管理系统)持续充电功率                              $    $  kW       $    $  ANS030.BYTE004  $  y=x;
  $  031.BMS(电池管理系统)峰值放电功率                              $    $  kW       $    $  ANS031.BYTE004  $  y=x;
  $  032.BMS(电池管理系统)持续放电功率                              $    $  kW       $    $  ANS032.BYTE004  $  y=x;
  $  033.电量SOC                                                    $    $  %        $    $  ANS033.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  034.车载充电机模式状态                                         $    $  /        $    $  ANS034.BYTE004  $  switxh(x&0x0f) 0x01:y=@0201;0x02:y=@002d;0x04:y=@0424;0x09:y=@04b7;0x0b:y=@03e8;0x0c:y=@04a6;0x0f:y=@0008;default:y=@0009;
  $  035.车载充电机故障状态                                         $    $  /        $    $  ANS035.BYTE004  $  switxh(x&0x03) 0x00:y=@04a2;0x01:y=@04a3;0x02:y=@04b4;0x03:y=@04a1;
  $  036.车载充电机高压互锁                                         $    $  /        $    $  ANS036.BYTE004  $  if(((x>>0)&1)) y=@04b5;else y=@04b6;
  $  037.车载充电机实际输出电压                                     $    $  V        $    $  ANS037.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  038.车载充电机实际输出电流                                     $    $  A        $    $  ANS038.BYTE004  $  y=x1*0x100+x2;
  $  039.车载充电机进水口温度                                       $    $  degC     $    $  ANS039.BYTE004  $  y=x;
  $  040.T-lock状态                                                 $    $  /        $    $  ANS040.BYTE004  $  switxh(x) 0x0:y=@04ba;0x1:y=@03ff;0x2:y=@010a;0x3:y=@0400;0x4:y=@0401;0x5:y=@0402;0x6:y=@04bb;0x7:y=@0404;
  $  041.T-lock故障状态                                             $    $  /        $    $  ANS041.BYTE004  $  if(((x>>0)&1)) y=@0430;else y=@03fe;
  $  042.档位器信号                                                 $    $  /        $    $  ANS042.BYTE004  $  switxh(x&0x07) 0x00:y=@04b8;0x01:y=@02fa;0x02:y=@04b9;0x07:y=@0132;default:y=@0009;
  $  043.档位P按钮状态                                              $    $  /        $    $  ANS043.BYTE004  $  if(((x>>0)&1)) y=@001c;else y=@04a5;
  $  044.档位P按钮有效状态                                          $    $  /        $    $  ANS044.BYTE004  $  if(((x>>0)&1)) y=@0169;else y=@0008;
  $  045.EPB(电子驻车制动系统)按钮状态                              $    $  /        $    $  ANS045.BYTE004  $  switxh(x&0x03) 0x00:y=@00d1;0x01:y=@010a;0x02:y=@0018;0x03:y=@0008;
  $  046.EPB(电子驻车制动系统)实际状态                              $    $  /        $    $  ANS046.BYTE004  $  switxh(x&0x07) 0x00:y=@0018;0x01:y=@03f5;0x02:y=@048d;0x03:y=@048e;0x04:y=@03f7;0x05:y=@01df;default:y=@0009;
  $  047.智能充电请求                                               $    $  /        $    $  ANS047.BYTE004  $  switxh(x) 0x00:y=@03e0;0x01:y=@0170;0x02:y=@010e;0x03:y=@0008;default:y=@0009;
  $  048.ACM检测充电线CP信号                                        $    $  /        $    $  ANS048.BYTE004  $  switxh(x) 0x00:y=@01c3;0x01:y=@0489;0x02:y=@048a;0x03:y=@048b;0x07:y=@048c;default:y=@0009;
  $  049.ACM检测充电线CC信号                                        $    $  /        $    $  ANS049.BYTE004  $  if(((x>>0)&1)==0) y=@01c3;else y=@01c4;
  $  050.VCU(整车控制器)检测的车速                                  $    $  km/h     $    $  ANS050.BYTE004  $  y=x;
  $  051.档位器错误等级                                             $    $  /        $    $  ANS051.BYTE004  $  switxh(x&0x03) 0x00:y=@0485;0x01:y=@0486;0x02:y=@0487;0x03:y=@010f;
  $  052.碰撞断电请求                                               $    $  /        $    $  ANS052.BYTE004  $  if(((x>>0)&1)) y=@0413;else y=@0488;
  $  053.一键启动电源模式                                           $    $  /        $    $  ANS053.BYTE004  $  switxh(x) 0x00:y=@010e;0x01:y=@0416;0x02:y=@0170;0x03:y=@023f;0x04:y=@0494;0x05:y=@023f;default:y=@0009;
  $  054.一键启动学习状态                                           $    $  /        $    $  ANS054.BYTE004  $  switxh(x) 0x00:y=@0220;0x01:y=@0130;0x02:y=@040c;0x03:y=@01df;default:y=@0009;
  $  055.压缩机功率消耗                                             $    $  kW       $    $  ANS055.BYTE004  $  y=x*0.1;
  $  056.压缩机工作状态                                             $    $  /        $    $  ANS056.BYTE004  $  switxh(x) 0x00:y=@010e;0x01:y=@0416;0x02:y=@0170;0x03:y=@023f;0x04:y=@0494;0x05:y=@023f;default:y=@0009;
  $  057.压缩机故障码                                               $    $  /        $    $  ANS057.BYTE004  $  switxh(x) 0x00:y=@01ac;0x01:y=@040d;0x02:y=@02ad;0x4:y=@02ac;0x08:y=@0491;0x10:y=@0492;0x20:y=@0411;0x40:y=@0493;0xff:y=@0132;default:y=@0009;
  $  058.空调高速风扇请求                                           $    $  /        $    $  ANS058.BYTE004  $  if(((x>>0)&1)==0) y=@010e;else y=@0170;
  $  059.空调除霜除雾状态                                           $    $  /        $    $  ANS059.BYTE004  $  if(((x>>0)&1)==0) y=@010f;else y=@0490;
  $  060.空调PTC(高压加热电阻)状态                                  $    $  /        $    $  ANS060.BYTE004  $  if(((x>>0)&1)==0) y=@041f;else y=@048f;
  $  061.空调PTC(高压加热电阻)实际功率                              $    $  kW       $    $  ANS061.BYTE004  $  y=x*0.1;
  $  062.空调PTC(高压加热电阻)功率请求                              $    $  W        $    $  ANS062.BYTE004  $  y=x*0.025;
  $  063.空调压缩机功率请求                                         $    $  kW       $    $  ANS063.BYTE004  $  if((x&0x0f)>0x0a) y=0x0a;else y=x&0x0f;
  $  064.ABS(防抱刹车系统)激活                                      $    $  /        $    $  ANS064.BYTE004  $  if(((x>>0)&1)==0) y=@001d;else y=@001c;
  $  065.TCS(牵引力控制系统)激活                                    $    $  /        $    $  ANS065.BYTE004  $  if(((x>>0)&1)==0) y=@001d;else y=@001c;
  $  066.ESC(电子稳定控制单元)车速                                  $    $  km/h     $    $  ANS066.BYTE004  $  y=INT((x1*0x100+x2)*0.05625);
  $  067.ESC(电子稳定控制单元)车速有效状态                          $    $  /        $    $  ANS067.BYTE004  $  if(((x>>0)&1)) y=@0008;else y=@0169;
  $  068.TCS(牵引力控制系统)快速降扭目标                            $    $  Nm       $    $  ANS068.BYTE004  $  y=(x1*0x100+x2)-2047;
  $  069.TCS(牵引力控制系统)快速降扭激活                            $    $  /        $    $  ANS069.BYTE004  $  if(((x>>0)&1)==0) y=@001d;else y=@001c;
  $  070.RBS(制动回馈系统)回收目标                                  $    $  Nm       $    $  ANS070.BYTE004  $  y=(x1*0x100+x2)-32768;
  $  071.RBS(制动回馈系统)回收状态                                  $    $  /        $    $  ANS071.BYTE004  $  switxh(x) 0x00:y=@0497;0x01:y=@010f;0x02:y=@0498;default:y=@0009;
  $  072.油门1信号                                                  $    $  /        $    $  ANS072.BYTE004  $  y=x;
  $  073.油门2信号                                                  $    $  /        $    $  ANS073.BYTE004  $  y=x;
  $  074.刹车1信号                                                  $    $  /        $    $  ANS074.BYTE004  $  switxh(x) 0x00:y=@0495;0x01:y=@0496;default:y=@0009;
  $  075.刹车2信号                                                  $    $  /        $    $  ANS075.BYTE004  $  switxh(x) 0x00:y=@0495;0x01:y=@0496;default:y=@0009;
  $  076.硬线使能DCDC(DC-DC转换控制器)状态                          $    $  /        $    $  ANS076.BYTE004  $  switxh(x) 0x00:y=@001d;0x01:y=@001c;default:y=@0009;
  $  077.硬线使能T-Lock状态                                         $    $  /        $    $  ANS077.BYTE004  $  switxh(x) 0x00:y=@001d;0x01:y=@001c;default:y=@0009;
  $  078.散热水泵控制状态                                           $    $  %        $    $  ANS078.BYTE004  $  y=x;
  $  079.散热水泵使能状态                                           $    $  /        $    $  ANS079.BYTE004  $  switxh(x) 0x00:y=@0495;0x01:y=@0496;default:y=@0009;
  $  080.高速风扇状态                                               $    $  /        $    $  ANS080.BYTE004  $  switxh(x) 0x00:y=@0495;0x01:y=@0496;default:y=@0009;
  $  081.低速风扇状态                                               $    $  /        $    $  ANS081.BYTE004  $  switxh(x) 0x00:y=@0495;0x01:y=@0496;default:y=@0009;
  $  082.VCU(整车控制器)内部上下电状态                              $    $  /        $    $  ANS082.BYTE004  $  y=x;
  $  083.VCU(整车控制器)内部实际模式                                $    $  /        $    $  ANS083.BYTE004  $  switxh(x) 2:y=@049e;4:y=@043b;6:y=@049f;7:y=@030d;default:y=@0168;
  $  084.VCU(整车控制器)内部车辆驱动状态                            $    $  /        $    $  ANS084.BYTE004  $  switxh(x) 2:y=@017d;3:y=@017b;4:y=@017a;5:y=@017c;7:y=@04a0;default:y=@0009;
  $  085.VCU(整车控制器)请求EPB(电子驻车制动系统)夹紧               $    $  /        $    $  ANS085.BYTE004  $  switxh(x) 0x00:y=@010f;0x01:y=@0000;default:y=@0009;
  $  086.VCU(整车控制器)解析油门                                    $    $  %        $    $  ANS086.BYTE004  $  y=x*0.4;
  $  087.VCU(整车控制器)解析油门有效性                              $    $  /        $    $  ANS087.BYTE004  $  switxh(x) 0x00:y=@010f;0x01:y=@0000;default:y=@0009;
  $  088.VCU(整车控制器)最大压缩机功率限制                          $    $  kW       $    $  ANS088.BYTE004  $  y=x*0.1;
  $  089.VCU(整车控制器)最大PTC(高压加热电阻)功率限制               $    $  W        $    $  ANS089.BYTE004  $  y=x*40;
  $  090.ECO(经济模式)按钮                                          $    $  /        $    $  ANS090.BYTE004  $  switxh(x) 0x00:y=@049c;0x01:y=@049d;default:y=@0009;
  $  091.Sport(运动模式)按钮                                        $    $  /        $    $  ANS091.BYTE004  $  switxh(x) 0x00:y=@0499;0x01:y=@049a;default:y=@0009;
  $  092.VCU(整车控制器)请求BMS(电池管理系统)下电状态               $    $  /        $    $  ANS092.BYTE004  $  switxh(x) 0x00:y=@049b;0x01:y=@049b;default:y=@0009;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
