
    车型ID：068b

    模拟：协议模拟-->068b

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k$~7B9

进入命令:

  $~  REQ000:7B1 02 10 01 AA AA AA AA AA       $~  ANS000:7B9 02 10 01 AA AA AA AA AA

空闲命令:

  $!  REQ000:7B1 02 3E 00 AA AA AA AA AA       $!  ANS000:7B9 02 3E 00 AA AA AA AA AA

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B1 03 19 02 09 AA AA AA AA       $#  ANS000:7B9 03 19 02 09 AA AA AA AA

		控制公式：
			y=(x1<<16)+(x2<<8)+(x3<<0);

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/8b000000


  $#  01.读故障码库
  $#  REQ000:7B1 02 19 0A AA AA AA AA AA       $#  ANS000:7B9 02 19 0A AA AA AA AA AA

		控制公式：
			y=(x1<<16)+(x2<<8)+(x3<<0);

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/8b000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B1 04 14 FF FF FF AA AA AA       $$  ANS000:7B9 04 14 FF FF FF AA AA AA

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B1 03 22 F1 12 AA AA AA AA       $%  ANS000:7B9 03 22 F1 12 AA AA AA AA
  $%  REQ001:7B1 03 22 F1 87 AA AA AA AA       $%  ANS001:7B9 03 22 F1 87 AA AA AA AA
  $%  REQ002:7B1 03 22 F1 89 AA AA AA AA       $%  ANS002:7B9 03 22 F1 89 AA AA AA AA
  $%  REQ003:7B1 03 22 F1 8A AA AA AA AA       $%  ANS003:7B9 03 22 F1 8A AA AA AA AA
  $%  REQ004:7B1 03 22 F1 90 AA AA AA AA       $%  ANS004:7B9 03 22 F1 90 AA AA AA AA
  $%  REQ005:7B1 03 22 F1 93 AA AA AA AA       $%  ANS005:7B9 03 22 F1 93 AA AA AA AA
  $%  REQ006:7B1 03 22 F1 95 AA AA AA AA       $%  ANS006:7B9 03 22 F1 95 AA AA AA AA
  $%  REQ007:7B1 03 22 F1 9D AA AA AA AA       $%  ANS007:7B9 03 22 F1 9D AA AA AA AA
  $%  REQ008:7B1 03 22 02 00 AA AA AA AA       $%  ANS008:7B9 03 22 02 00 AA AA AA AA
  $%  REQ009:7B1 03 22 02 01 AA AA AA AA       $%  ANS009:7B9 03 22 02 01 AA AA AA AA

  $%  000:车辆名称:                          $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                            $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:Geely软件版本号:                   $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3);
  $%  003:供应商代码:                        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:车辆识别号（VIN码）:               $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  005:ECU(电子控制器)硬件版本号:         $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  006:ECU(电子控制器)软件版本号:         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:ECU(电子控制器)安装日期:           $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  008:ECU(电子控制器)成功刷写次数:       $%    $%  ANS008.BYTE004  $%  HEX(x1);
  $%  009:ECU(电子控制器)尝试刷写次数:       $%    $%  ANS009.BYTE004  $%  HEX(x1);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B1 03 22 E0 01 AA AA AA AA       $  ANS000:7B9 03 22 E0 01 AA AA AA AA

  $  000.Pack电流值                      $    $  A        $    $  ANS000.BYTE004  $  y=(x1*0x100+x2)*0.1-2000;
  $  001.Pack电压值                      $    $  V        $    $  ANS000.BYTE006  $  y=(x1*0x100+x2)*0.1;
  $  002.模组平均温度                    $    $  degC     $    $  ANS000.BYTE008  $  y=x-50;
  $  003.模组最大温度                    $    $  degC     $    $  ANS000.BYTE009  $  y=x-50;
  $  004.模组最小温度                    $    $  degC     $    $  ANS000.BYTE010  $  y=x-50;
  $  005.电池包SOH(电池包健康状态)       $    $  %        $    $  ANS000.BYTE011  $  y=x;
  $  006.电池包SOC(电池包荷电状态)       $    $  %        $    $  ANS000.BYTE012  $  y=x;
  $  007.模组最大温度位置                $    $  /        $    $  ANS000.BYTE013  $  y=x;
  $  008.模组最小温度位置                $    $  /        $    $  ANS000.BYTE014  $  y=x;
  $  009.单体电芯最大电压位置            $    $  /        $    $  ANS000.BYTE015  $  y=x;
  $  010.单体电芯最小电压位置            $    $  /        $    $  ANS000.BYTE016  $  y=x;
  $  011.单体电芯最大电压                $    $  mV       $    $  ANS000.BYTE017  $  y=x1*256+x2;
  $  012.单体电芯最小电压                $    $  mV       $    $  ANS000.BYTE019  $  y=x1*256+x2;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
