
    车型ID：0766

    模拟：协议模拟-->0766

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7EC

进入命令:

  $~  REQ000:7E4 02 10 01 00 00 00 00 00       $~  ANS000:7EC 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E4 02 3E 00 00 00 00 00 00       $!  ANS000:7EC 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7E4 03 19 02 09 00 00 00 00       $#  ANS000:7EC 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/37000000


  $#  01.读故障码库
  $#  REQ000:7E4 02 19 0A 00 00 00 00 00       $#  ANS000:7EC 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/37000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E4 04 14 FF FF FF 00 00 00       $$  ANS000:7EC 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E4 03 22 F1 12 00 00 00 00       $%  ANS000:7EC 03 22 F1 12 00 00 00 00
  $%  REQ001:7E4 03 22 F1 87 00 00 00 00       $%  ANS001:7EC 03 22 F1 87 00 00 00 00
  $%  REQ002:7E4 03 22 F1 89 00 00 00 00       $%  ANS002:7EC 03 22 F1 89 00 00 00 00
  $%  REQ003:7E4 03 22 F1 8A 00 00 00 00       $%  ANS003:7EC 03 22 F1 8A 00 00 00 00
  $%  REQ004:7E4 03 22 F1 8B 00 00 00 00       $%  ANS004:7EC 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E4 03 22 F1 8C 00 00 00 00       $%  ANS005:7EC 03 22 F1 8C 00 00 00 00
  $%  REQ006:7E4 03 22 F1 90 00 00 00 00       $%  ANS006:7EC 03 22 F1 90 00 00 00 00
  $%  REQ007:7E4 03 22 F1 93 00 00 00 00       $%  ANS007:7EC 03 22 F1 93 00 00 00 00
  $%  REQ008:7E4 03 22 F1 95 00 00 00 00       $%  ANS008:7EC 03 22 F1 95 00 00 00 00
  $%  REQ009:7E4 03 22 F1 9D 00 00 00 00       $%  ANS009:7EC 03 22 F1 9D 00 00 00 00

  $%  000:车辆名称:                        $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:Geely软件版本号:                 $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3);
  $%  003:供应商代码:                      $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:         $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:           $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  006:车辆识别号（VIN码）:             $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:       $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:       $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)安装日期:         $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读数据流
  $  00.读数据流
  $  REQ000:7E4 03 22 DF 01 00 00 00 00       $  ANS000:7EC 03 22 DF 01 00 00 00 00
  $  REQ001:7E4 03 22 DF 00 00 00 00 00       $  ANS001:7EC 03 22 DF 00 00 00 00 00
  $  REQ002:7E4 03 22 30 02 00 00 00 00       $  ANS002:7EC 03 22 30 02 00 00 00 00
  $  REQ003:7E4 03 22 30 03 00 00 00 00       $  ANS003:7EC 03 22 30 03 00 00 00 00
  $  REQ004:7E4 03 22 30 04 00 00 00 00       $  ANS004:7EC 03 22 30 04 00 00 00 00
  $  REQ005:7E4 03 22 FD 11 00 00 00 00       $  ANS005:7EC 03 22 FD 11 00 00 00 00

  $  000.车速                                 $    $  km/h     $    $  ANS000.BYTE004  $  y=INT((x1*0x100+x2)*0.05625);
  $  001.ECU(电子控制器)供电电压              $    $  V        $    $  ANS001.BYTE004  $  y=x*0.1;
  $  002.左前轮速                             $    $  km/h     $    $  ANS002.BYTE004  $  y=x;
  $  003.右前轮速                             $    $  km/h     $    $  ANS002.BYTE005  $  y=x;
  $  004.左后轮速                             $    $  km/h     $    $  ANS002.BYTE006  $  y=x;
  $  005.右后轮速                             $    $  km/h     $    $  ANS002.BYTE007  $  y=x;
  $  006.左前常开阀                           $    $  /        $    $  ANS003.BYTE004  $  switxh((x>>0)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  007.右前常开阀                           $    $  /        $    $  ANS003.BYTE004  $  switxh((x>>2)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  008.左后常开阀                           $    $  /        $    $  ANS003.BYTE004  $  switxh((x>>4)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  009.右后常开阀                           $    $  /        $    $  ANS003.BYTE004  $  switxh((x>>6)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  010.左前常闭阀                           $    $  /        $    $  ANS003.BYTE005  $  switxh((x>>0)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  011.右前常闭阀                           $    $  /        $    $  ANS003.BYTE005  $  switxh((x>>2)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  012.左后常闭阀                           $    $  /        $    $  ANS003.BYTE005  $  switxh((x>>4)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  013.右后常闭阀                           $    $  /        $    $  ANS003.BYTE005  $  switxh((x>>6)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  014.泵马达继电器状态                     $    $  /        $    $  ANS003.BYTE007  $  switxh((x>>0)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  015.阀继电器状态                         $    $  /        $    $  ANS003.BYTE007  $  switxh((x>>2)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  016.刹车灯开关                           $    $  /        $    $  ANS004.BYTE004  $  switxh((x>>2)&0x03) 0x00:y=@010e;0x01:y=@0170;default:y=@0009;
  $  017.TPMS(胎压监视系统)系统可用状态       $    $  /        $    $  ANS005.BYTE004  $  if(x==0x01) y=@09d0;else if(x==0x00) y=@09d1;else y=@0220;

  $)  01.TPMS(胎压监测系统)基本信息
  $  01.TPMS(胎压监测系统)基本信息
  $  REQ000:7E4 03 22 FD 10 00 00 00 00       $  ANS000:7EC 03 22 FD 10 00 00 00 00

  $  000.最后第一次自学习里程数               $    $  km     $    $  ANS000.BYTE004  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  001.最后第二次自学习里程数               $    $  km     $    $  ANS000.BYTE008  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  002.最后第三次自学习里程数               $    $  km     $    $  ANS000.BYTE012  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  003.最后第四次自学习里程数               $    $  km     $    $  ANS000.BYTE016  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  004.最后第一次欠压报警里程数             $    $  km     $    $  ANS000.BYTE020  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  005.最后第二次欠压报警里程数             $    $  km     $    $  ANS000.BYTE024  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  006.最后第三次欠压报警里程数             $    $  km     $    $  ANS000.BYTE028  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  007.最后第四次欠压报警里程数             $    $  km     $    $  ANS000.BYTE032  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  008.最后第一次欠压报警诊断数据           $    $  /      $    $  ANS000.BYTE036  $  y=HEX(x1,x2,x3,x4);
  $  009.最后第二次欠压报警诊断数据           $    $  /      $    $  ANS000.BYTE040  $  y=HEX(x1,x2,x3,x4);
  $  010.最后第三次欠压报警诊断数据           $    $  /      $    $  ANS000.BYTE044  $  y=HEX(x1,x2,x3,x4);
  $  011.最后第四次欠压报警诊断数据           $    $  /      $    $  ANS000.BYTE048  $  y=HEX(x1,x2,x3,x4);
  $  012.左前轮穿刺指示                       $    $  /      $    $  ANS000.BYTE052  $  y=x;
  $  013.右前轮穿刺指示                       $    $  /      $    $  ANS000.BYTE053  $  y=x;
  $  014.左后轮穿刺指示                       $    $  /      $    $  ANS000.BYTE054  $  y=x;
  $  015.右后轮穿刺指示                       $    $  /      $    $  ANS000.BYTE055  $  y=x;
  $  016.左前轮慢漏气指示                     $    $  /      $    $  ANS000.BYTE056  $  y=x;
  $  017.右前轮慢漏气指示                     $    $  /      $    $  ANS000.BYTE057  $  y=x;
  $  018.左后轮慢漏气指示                     $    $  /      $    $  ANS000.BYTE058  $  y=x;
  $  019.右后轮慢漏气指示                     $    $  /      $    $  ANS000.BYTE059  $  y=x;
  $  020.胎压监测报警状态                     $    $  /      $    $  ANS000.BYTE060  $  if(x==0x01) y=@0891;else if(x==0x00) y=@010f;else y=@0220;
  $  021.低速标定完成状态                     $    $  %      $    $  ANS000.BYTE061  $  y=x*100/255;
  $  022.高速标定完成状态                     $    $  %      $    $  ANS000.BYTE062  $  y=x*100/255;
  $  023.TPMS(胎压监视系统)软件版本号         $    $  /      $    $  ANS000.BYTE063  $  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $  024.TPMS(胎压监视系统)内部数据状态       $    $  /      $    $  ANS000.BYTE071  $  y=HEX(x1,x2);
  $  025.10 - 40 kph行驶时间                  $    $  /      $    $  ANS000.BYTE073  $  y=SPRINTF([%2d %s,%2d %s,%2d %s,%2d %s],x1,@09d2,x2,@09d3,x3,@09d4,x4,@09d5);
  $  026.40 - 60 kph行驶时间                  $    $  /      $    $  ANS000.BYTE077  $  y=SPRINTF([%2d %s,%2d %s,%2d %s,%2d %s],x1,@09d2,x2,@09d3,x3,@09d4,x4,@09d5);
  $  027.60 - 80 kph行驶时间                  $    $  /      $    $  ANS000.BYTE081  $  y=SPRINTF([%2d %s,%2d %s,%2d %s,%2d %s],x1,@09d2,x2,@09d3,x3,@09d4,x4,@09d5);
  $  028.80 - 100  kph行驶时间                $    $  /      $    $  ANS000.BYTE085  $  y=SPRINTF([%2d %s,%2d %s,%2d %s,%2d %s],x1,@09d2,x2,@09d3,x3,@09d4,x4,@09d5);
  $  029.100 - 120 kph行驶时间                $    $  /      $    $  ANS000.BYTE089  $  y=SPRINTF([%2d %s,%2d %s,%2d %s,%2d %s],x1,@09d2,x2,@09d3,x3,@09d4,x4,@09d5);
  $  030.> 120 kph行驶时间                    $    $  /      $    $  ANS000.BYTE093  $  y=SPRINTF([%2d %s,%2d %s,%2d %s,%2d %s],x1,@09d2,x2,@09d3,x3,@09d4,x4,@09d5);
  $  031.WRA低可用计数                        $    $  s      $    $  ANS000.BYTE097  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  032.WSA低可用计数                        $    $  s      $    $  ANS000.BYTE101  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  033.WRA学习状态                          $    $  %      $    $  ANS000.BYTE105  $  y=x*100/255;
  $  034.WSA学习状态                          $    $  %      $    $  ANS000.BYTE106  $  y=x*100/255;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E4 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7E4 30 00 0B 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
