
    车型ID：077d

    模拟：协议模拟-->077d

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B8

进入命令:

  $~  REQ000:7B0 02 10 01 00 00 00 00 00       $~  ANS000:7B8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B0 02 3E 00 00 00 00 00 00       $!  ANS000:7B8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B0 03 19 02 09 00 00 00 00       $#  ANS000:7B8 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/55000000


  $#  01.读故障码库
  $#  REQ000:7B0 02 19 0A 00 00 00 00 00       $#  ANS000:7B8 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/55000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B0 04 14 FF FF FF 00 00 00       $$  ANS000:7B8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B0 03 22 F1 12 00 00 00 00       $%  ANS000:7B8 03 22 F1 12 00 00 00 00
  $%  REQ001:7B0 03 22 F1 90 00 00 00 00       $%  ANS001:7B8 03 22 F1 90 00 00 00 00
  $%  REQ002:7B0 03 22 F1 13 00 00 00 00       $%  ANS002:7B8 03 22 F1 13 00 00 00 00
  $%  REQ003:7B0 03 22 F1 97 00 00 00 00       $%  ANS003:7B8 03 22 F1 97 00 00 00 00
  $%  REQ004:7B0 03 22 F1 87 00 00 00 00       $%  ANS004:7B8 03 22 F1 87 00 00 00 00
  $%  REQ005:7B0 03 22 F1 8B 00 00 00 00       $%  ANS005:7B8 03 22 F1 8B 00 00 00 00
  $%  REQ006:7B0 03 22 F1 9D 00 00 00 00       $%  ANS006:7B8 03 22 F1 9D 00 00 00 00
  $%  REQ007:7B0 03 22 F1 99 00 00 00 00       $%  ANS007:7B8 03 22 F1 99 00 00 00 00
  $%  REQ008:7B0 03 22 F1 93 00 00 00 00       $%  ANS008:7B8 03 22 F1 93 00 00 00 00
  $%  REQ009:7B0 03 22 F1 95 00 00 00 00       $%  ANS009:7B8 03 22 F1 95 00 00 00 00
  $%  REQ010:7B0 03 22 F1 82 00 00 00 00       $%  ANS010:7B8 03 22 F1 82 00 00 00 00
  $%  REQ011:7B0 03 22 F1 8A 00 00 00 00       $%  ANS011:7B8 03 22 F1 8A 00 00 00 00
  $%  REQ012:7B0 03 22 F1 98 00 00 00 00       $%  ANS012:7B8 03 22 F1 98 00 00 00 00

  $%  000:车辆名称:                               $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:车辆VIN码:                              $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  002:诊断协议版本:                           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d%d%d%d],x1,x2,x3,x4);
  $%  003:ECU(电子控制器)控制器名称:              $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:零件BOM号:                              $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:ECU(电子控制器)制造日期:                $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  006:ECU(电子控制器)装配日期:                $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  007:ECU(电子控制器)软件刷新日期:            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  008:供应商ECU(电子控制器)硬件版本号:        $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  009:供应商ECU(电子控制器)软件版本号:        $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  010:标定版本号:                             $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  011:供应商识别号:                           $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  012:诊断仪序列号:                           $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B0 03 22 DF 00 00 00 00 00       $  ANS000:7B8 03 22 DF 00 00 00 00 00
  $  REQ001:7B0 03 22 DF 01 00 00 00 00       $  ANS001:7B8 03 22 DF 01 00 00 00 00
  $  REQ002:7B0 03 22 DF 02 00 00 00 00       $  ANS002:7B8 03 22 DF 02 00 00 00 00
  $  REQ003:7B0 03 22 DF 03 00 00 00 00       $  ANS003:7B8 03 22 DF 03 00 00 00 00
  $  REQ004:7B0 03 22 DF 04 00 00 00 00       $  ANS004:7B8 03 22 DF 04 00 00 00 00
  $  REQ005:7B0 03 22 4C 00 00 00 00 00       $  ANS005:7B8 03 22 4C 00 00 00 00 00
  $  REQ006:7B0 03 22 4C 01 00 00 00 00       $  ANS006:7B8 03 22 4C 01 00 00 00 00
  $  REQ007:7B0 03 22 4C 02 00 00 00 00       $  ANS007:7B8 03 22 4C 02 00 00 00 00
  $  REQ008:7B0 03 22 4C 03 00 00 00 00       $  ANS008:7B8 03 22 4C 03 00 00 00 00
  $  REQ009:7B0 03 22 4C 04 00 00 00 00       $  ANS009:7B8 03 22 4C 04 00 00 00 00
  $  REQ010:7B0 03 22 4C 05 00 00 00 00       $  ANS010:7B8 03 22 4C 05 00 00 00 00
  $  REQ011:7B0 03 22 4C 06 00 00 00 00       $  ANS011:7B8 03 22 4C 06 00 00 00 00
  $  REQ012:7B0 03 22 4C 07 00 00 00 00       $  ANS012:7B8 03 22 4C 07 00 00 00 00
  $  REQ013:7B0 03 22 4C 08 00 00 00 00       $  ANS013:7B8 03 22 4C 08 00 00 00 00
  $  REQ014:7B0 03 22 4C 09 00 00 00 00       $  ANS014:7B8 03 22 4C 09 00 00 00 00
  $  REQ015:7B0 03 22 4C 0A 00 00 00 00       $  ANS015:7B8 03 22 4C 0A 00 00 00 00
  $  REQ016:7B0 03 22 4C 0B 00 00 00 00       $  ANS016:7B8 03 22 4C 0B 00 00 00 00
  $  REQ017:7B0 03 22 4C 0C 00 00 00 00       $  ANS017:7B8 03 22 4C 0C 00 00 00 00
  $  REQ018:7B0 03 22 4C 0D 00 00 00 00       $  ANS018:7B8 03 22 4C 0D 00 00 00 00
  $  REQ019:7B0 03 22 4C 0E 00 00 00 00       $  ANS019:7B8 03 22 4C 0E 00 00 00 00
  $  REQ020:7B0 03 22 4C 0F 00 00 00 00       $  ANS020:7B8 03 22 4C 0F 00 00 00 00
  $  REQ021:7B0 03 22 4C 10 00 00 00 00       $  ANS021:7B8 03 22 4C 10 00 00 00 00
  $  REQ022:7B0 03 22 4C 11 00 00 00 00       $  ANS022:7B8 03 22 4C 11 00 00 00 00
  $  REQ023:7B0 03 22 4C 12 00 00 00 00       $  ANS023:7B8 03 22 4C 12 00 00 00 00
  $  REQ024:7B0 03 22 4C 13 00 00 00 00       $  ANS024:7B8 03 22 4C 13 00 00 00 00
  $  REQ025:7B0 03 22 4C 14 00 00 00 00       $  ANS025:7B8 03 22 4C 14 00 00 00 00
  $  REQ026:7B0 03 22 4C 15 00 00 00 00       $  ANS026:7B8 03 22 4C 15 00 00 00 00
  $  REQ027:7B0 03 22 4C 16 00 00 00 00       $  ANS027:7B8 03 22 4C 16 00 00 00 00
  $  REQ028:7B0 03 22 4C 17 00 00 00 00       $  ANS028:7B8 03 22 4C 17 00 00 00 00
  $  REQ029:7B0 03 22 4C 18 00 00 00 00       $  ANS029:7B8 03 22 4C 18 00 00 00 00
  $  REQ030:7B0 03 22 4C 1B 00 00 00 00       $  ANS030:7B8 03 22 4C 1B 00 00 00 00
  $  REQ031:7B0 03 22 4C 21 00 00 00 00       $  ANS031:7B8 03 22 4C 21 00 00 00 00
  $  REQ032:7B0 03 22 4C 23 00 00 00 00       $  ANS032:7B8 03 22 4C 23 00 00 00 00
  $  REQ033:7B0 03 22 4C 24 00 00 00 00       $  ANS033:7B8 03 22 4C 24 00 00 00 00
  $  REQ034:7B0 03 22 4C 25 00 00 00 00       $  ANS034:7B8 03 22 4C 25 00 00 00 00
  $  REQ035:7B0 03 22 4C 26 00 00 00 00       $  ANS035:7B8 03 22 4C 26 00 00 00 00
  $  REQ036:7B0 03 22 4C 27 00 00 00 00       $  ANS036:7B8 03 22 4C 27 00 00 00 00
  $  REQ037:7B0 03 22 4C 28 00 00 00 00       $  ANS037:7B8 03 22 4C 28 00 00 00 00
  $  REQ038:7B0 03 22 4C 29 00 00 00 00       $  ANS038:7B8 03 22 4C 29 00 00 00 00
  $  REQ039:7B0 03 22 4C 2A 00 00 00 00       $  ANS039:7B8 03 22 4C 2A 00 00 00 00
  $  REQ040:7B0 03 22 4C 2B 00 00 00 00       $  ANS040:7B8 03 22 4C 2B 00 00 00 00
  $  REQ041:7B0 03 22 4C 2D 00 00 00 00       $  ANS041:7B8 03 22 4C 2D 00 00 00 00
  $  REQ042:7B0 03 22 4C 2E 00 00 00 00       $  ANS042:7B8 03 22 4C 2E 00 00 00 00
  $  REQ043:7B0 03 22 4C 2F 00 00 00 00       $  ANS043:7B8 03 22 4C 2F 00 00 00 00
  $  REQ044:7B0 03 22 4C 31 00 00 00 00       $  ANS044:7B8 03 22 4C 31 00 00 00 00
  $  REQ045:7B0 03 22 4C 32 00 00 00 00       $  ANS045:7B8 03 22 4C 32 00 00 00 00
  $  REQ046:7B0 03 22 4C 33 00 00 00 00       $  ANS046:7B8 03 22 4C 33 00 00 00 00
  $  REQ047:7B0 03 22 4C 34 00 00 00 00       $  ANS047:7B8 03 22 4C 34 00 00 00 00
  $  REQ048:7B0 03 22 4C 35 00 00 00 00       $  ANS048:7B8 03 22 4C 35 00 00 00 00
  $  REQ049:7B0 03 22 4C 36 00 00 00 00       $  ANS049:7B8 03 22 4C 36 00 00 00 00
  $  REQ050:7B0 03 22 4C 37 00 00 00 00       $  ANS050:7B8 03 22 4C 37 00 00 00 00
  $  REQ051:7B0 03 22 4C 38 00 00 00 00       $  ANS051:7B8 03 22 4C 38 00 00 00 00
  $  REQ052:7B0 03 22 4C 39 00 00 00 00       $  ANS052:7B8 03 22 4C 39 00 00 00 00
  $  REQ053:7B0 03 22 4C 3B 00 00 00 00       $  ANS053:7B8 03 22 4C 3B 00 00 00 00
  $  REQ054:7B0 03 22 4C 3C 00 00 00 00       $  ANS054:7B8 03 22 4C 3C 00 00 00 00
  $  REQ055:7B0 03 22 4C 40 00 00 00 00       $  ANS055:7B8 03 22 4C 40 00 00 00 00
  $  REQ056:7B0 03 22 4C 41 00 00 00 00       $  ANS056:7B8 03 22 4C 41 00 00 00 00
  $  REQ057:7B0 03 22 4C 42 00 00 00 00       $  ANS057:7B8 03 22 4C 42 00 00 00 00
  $  REQ058:7B0 03 22 4C 43 00 00 00 00       $  ANS058:7B8 03 22 4C 43 00 00 00 00
  $  REQ059:7B0 03 22 4C 44 00 00 00 00       $  ANS059:7B8 03 22 4C 44 00 00 00 00
  $  REQ060:7B0 03 22 4C 45 00 00 00 00       $  ANS060:7B8 03 22 4C 45 00 00 00 00
  $  REQ061:7B0 03 22 4C 47 00 00 00 00       $  ANS061:7B8 03 22 4C 47 00 00 00 00
  $  REQ062:7B0 03 22 4C 48 00 00 00 00       $  ANS062:7B8 03 22 4C 48 00 00 00 00
  $  REQ063:7B0 03 22 4C 49 00 00 00 00       $  ANS063:7B8 03 22 4C 49 00 00 00 00
  $  REQ064:7B0 03 22 4C 4A 00 00 00 00       $  ANS064:7B8 03 22 4C 4A 00 00 00 00
  $  REQ065:7B0 03 22 4C 4B 00 00 00 00       $  ANS065:7B8 03 22 4C 4B 00 00 00 00
  $  REQ066:7B0 03 22 4C 4C 00 00 00 00       $  ANS066:7B8 03 22 4C 4C 00 00 00 00
  $  REQ067:7B0 03 22 4C 4D 00 00 00 00       $  ANS067:7B8 03 22 4C 4D 00 00 00 00
  $  REQ068:7B0 03 22 4C 4E 00 00 00 00       $  ANS068:7B8 03 22 4C 4E 00 00 00 00
  $  REQ069:7B0 03 22 4C 4F 00 00 00 00       $  ANS069:7B8 03 22 4C 4F 00 00 00 00
  $  REQ070:7B0 03 22 4C 50 00 00 00 00       $  ANS070:7B8 03 22 4C 50 00 00 00 00
  $  REQ071:7B0 03 22 4C 51 00 00 00 00       $  ANS071:7B8 03 22 4C 51 00 00 00 00
  $  REQ072:7B0 03 22 4C 52 00 00 00 00       $  ANS072:7B8 03 22 4C 52 00 00 00 00
  $  REQ073:7B0 03 22 4C 53 00 00 00 00       $  ANS073:7B8 03 22 4C 53 00 00 00 00
  $  REQ074:7B0 03 22 4C 54 00 00 00 00       $  ANS074:7B8 03 22 4C 54 00 00 00 00
  $  REQ075:7B0 03 22 4C 55 00 00 00 00       $  ANS075:7B8 03 22 4C 55 00 00 00 00
  $  REQ076:7B0 03 22 4C 56 00 00 00 00       $  ANS076:7B8 03 22 4C 56 00 00 00 00
  $  REQ077:7B0 03 22 4C 57 00 00 00 00       $  ANS077:7B8 03 22 4C 57 00 00 00 00
  $  REQ078:7B0 03 22 4C 58 00 00 00 00       $  ANS078:7B8 03 22 4C 58 00 00 00 00
  $  REQ079:7B0 03 22 4C 59 00 00 00 00       $  ANS079:7B8 03 22 4C 59 00 00 00 00
  $  REQ080:7B0 03 22 4C 5C 00 00 00 00       $  ANS080:7B8 03 22 4C 5C 00 00 00 00
  $  REQ081:7B0 03 22 4C 5D 00 00 00 00       $  ANS081:7B8 03 22 4C 5D 00 00 00 00
  $  REQ082:7B0 03 22 4C 5E 00 00 00 00       $  ANS082:7B8 03 22 4C 5E 00 00 00 00
  $  REQ083:7B0 03 22 4C 5F 00 00 00 00       $  ANS083:7B8 03 22 4C 5F 00 00 00 00
  $  REQ084:7B0 03 22 4C 60 00 00 00 00       $  ANS084:7B8 03 22 4C 60 00 00 00 00
  $  REQ085:7B0 03 22 4C 62 00 00 00 00       $  ANS085:7B8 03 22 4C 62 00 00 00 00
  $  REQ086:7B0 03 22 4C 64 00 00 00 00       $  ANS086:7B8 03 22 4C 64 00 00 00 00
  $  REQ087:7B0 03 22 4C 65 00 00 00 00       $  ANS087:7B8 03 22 4C 65 00 00 00 00
  $  REQ088:7B0 03 22 4C 66 00 00 00 00       $  ANS088:7B8 03 22 4C 66 00 00 00 00
  $  REQ089:7B0 03 22 4C 67 00 00 00 00       $  ANS089:7B8 03 22 4C 67 00 00 00 00
  $  REQ090:7B0 03 22 4C 68 00 00 00 00       $  ANS090:7B8 03 22 4C 68 00 00 00 00
  $  REQ091:7B0 03 22 4C 6A 00 00 00 00       $  ANS091:7B8 03 22 4C 6A 00 00 00 00
  $  REQ092:7B0 03 22 4C 70 00 00 00 00       $  ANS092:7B8 03 22 4C 70 00 00 00 00
  $  REQ093:7B0 03 22 4C 71 00 00 00 00       $  ANS093:7B8 03 22 4C 71 00 00 00 00
  $  REQ094:7B0 03 22 4C 72 00 00 00 00       $  ANS094:7B8 03 22 4C 72 00 00 00 00
  $  REQ095:7B0 03 22 4C 73 00 00 00 00       $  ANS095:7B8 03 22 4C 73 00 00 00 00
  $  REQ096:7B0 03 22 4C 74 00 00 00 00       $  ANS096:7B8 03 22 4C 74 00 00 00 00

  $  000.ECU(电子控制器)供电电压                                                            $    $  V        $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.车速                                                                               $    $  km/h     $    $  ANS001.BYTE004  $  y=INT((x1*256+x2)*0.05625);
  $  002.故障发生次数计数器                                                                 $    $  time     $    $  ANS002.BYTE004  $  y=x*0.1;
  $  003.第一次发生故障时的里程数                                                           $    $  km       $    $  ANS003.BYTE004  $  y=(x1*256+x2)*1;
  $  004.最后一次发生故障时的里程数                                                         $    $  km       $    $  ANS004.BYTE004  $  y=(x1*256+x2)*1;
  $  005.电机转速                                                                           $    $  rpm      $    $  ANS005.BYTE004  $  if((x1*256+x2)==0xFFFE) y=@0421;else if((x1*256+x2)==0xFFFF)y=@0132;else y=(x1*256+x2)-14000;
  $  006.电机故障状态                                                                       $    $  /        $    $  ANS006.BYTE004  $  switxh(x)0x00:y=@01ac;0x01:y=@0405;0x02:y=@0429;0x03:y=@0407;default:y=@036f;
  $  007.电机工作模式                                                                       $    $  /        $    $  ANS007.BYTE004  $  switxh(x)0x00:y=@0132;0x01:y=@0427;0x02:y=@0209;0x03:y=@0428;default:y=@036f;
  $  008.电机实际扭矩                                                                       $    $  Nm       $    $  ANS008.BYTE004  $  if((x1*256+x2)==0x3FFE)y=@0421;else if((x1*256+x2)==0x3FFF)y=@0132;else y=(x1*256+x2)*0.5-300;
  $  009.VCU(整车控制器)发出的BMS(电池管理系统)充电状态请求                                 $    $  /        $    $  ANS009.BYTE004  $  switxh(x)0x00:y=@00d1;0x01:y=@0422;0x02:y=@0423;0x03:y=@0209;default:y=@036f;
  $  010.电机状态模式                                                                       $    $  /        $    $  ANS010.BYTE004  $  switxh(x)0x01:y=@0318;0x02:y=@002d;0x03:y=@03e2;0x04:y=@0424;0x05:y=@0425;0x09:y=@03d9;0x0B:y=@03e8;0x0C:y=@0426;0x0D:y=@0407;default:y=@036f;
  $  011.电机冷却液入口实际温度                                                             $    $  degC     $    $  ANS011.BYTE004  $  if(x1==0xFE)y=@0421;else if(x1==0xFF)y=@0132;else y=x1*1-40;
  $  012.DCDC(DC-DC转换控制器)温度                                                          $    $  degC     $    $  ANS012.BYTE004  $  if(x1==0xFF)y=@0132;else y=(x1*1-40);
  $  013.DCDC(DC-DC转换控制器)故障状态                                                      $    $  /        $    $  ANS013.BYTE004  $  switxh(x)0x00:y=@01ac;0x01:y=@0405;0x02:y=@0433;0x03:y=@0434;default:y=@036f;
  $  014.DCDC(DC-DC转换控制器)工作模式                                                      $    $  /        $    $  ANS014.BYTE004  $  switxh(x)0x00:y=@0435;0x01:y=@0424;0x02:y=@0421;0x03:y=@0132;default:y=@036f;
  $  015.DCDC(DC-DC转换控制器)低压侧实际电流                                                $    $  A        $    $  ANS015.BYTE004  $  y=(x1*256+x2)*0.125;
  $  016.电机过温保护降级模式                                                               $    $  /        $    $  ANS016.BYTE004  $  if(x1==0x00)y=@01df;else if(x1==0x01)y=@0191;else y=@0230;
  $  017.VCU(整车控制器)紧急下电请求                                                        $    $  /        $    $  ANS017.BYTE004  $  if(x1==0x00)y=@0430;else if(x1==0x01)y=@03fe;else y=@0230;
  $  018.VCU(整车控制器)发出的锁P档请求                                                     $    $  /        $    $  ANS018.BYTE004  $  switxh(x)0x00:y=@0000;0x01:y=@0431;0x02:y=@0432;0x03:y=@0132;default:y=@036f;
  $  019.VCU(整车控制器)发出的当前档位                                                      $    $  /        $    $  ANS019.BYTE004  $  switxh(x)0x00:y=@042a;0x01:y=@042b;0x02:y=@042c;0x03:y=@042d;0x04:y=@042e;0x1F:y=@0132;default:y=@0162;
  $  020.VCU(整车控制器)发出的电机状态请求                                                  $    $  /        $    $  ANS020.BYTE004  $  switxh(x)0x02:y=@002d;0x04:y=@0424;0x05:y=@0425;0x0B:y=@03e8;0x0D:y=@0407;0x0F:y=@042f;default:y=@036f;
  $  021.VCU(整车控制器)发出的电机控制模式请求                                              $    $  /        $    $  ANS021.BYTE004  $  switxh(x)0x00:y=@0132;0x01:y=@0427;0x02:y=@0209;0x03:y=@0428;default:y=@036f;
  $  022.VCU(整车控制器)发出的电机扭矩请求                                                  $    $  Nm       $    $  ANS022.BYTE004  $  y=(x1*256+x2)*0.5-300;
  $  023.VCU(整车控制器)发出的电机允许扭矩上限值                                            $    $  Nm       $    $  ANS023.BYTE004  $  y=(x1*256+x2)*1;
  $  024.VCU(整车控制器)发出的电机允许扭矩下限值                                            $    $  Nm       $    $  ANS024.BYTE004  $  y=(x1*256+x2)*1-300;
  $  025.BMS(电池管理系统)放电故障等级                                                      $    $  /        $    $  ANS025.BYTE004  $  switxh(x)0x00:y=@010f;0x01:y=@02f9;0x02:y=@02f8;0x03:y=@03d4;0x04:y=@03d5;0x05:y=@0438;0x06:y=@0439;0x0F:y=@0132;default:y=@036f;
  $  026.VCU(整车控制器)发出的DCDC(DC-DC转换控制器)控制模式请求                             $    $  /        $    $  ANS026.BYTE004  $  switxh(x)0x00:y=@0435;0x01:y=@0424;0x02:y=@0162;0x03:y=@0162;default:y=@036f;
  $  027.VCU(整车控制器)发出的DCDC(DC-DC转换控制器)低压侧电压                               $    $  V        $    $  ANS027.BYTE004  $  y=x*0.125+10;
  $  028.VCU(整车控制器)的高压互锁信号                                                      $    $  /        $    $  ANS028.BYTE004  $  if(x1==0x00)y=@010f;else if(x1==0x01)y=@01b0;else y=@0230;
  $  029.DCDC(DC-DC转换控制器)高压侧电流最大值                                              $    $  A        $    $  ANS029.BYTE004  $  y=x*0.125;
  $  030.VCU(整车控制器)发出的BMS(电池管理系统)放电状态请求                                 $    $  /        $    $  ANS030.BYTE004  $  switxh(x)0x00:y=@0430;0x01:y=@0436;0x02:y=@0437;0x03:y=@0407;0x04:y=@0162;0x05:y=@0162;0x06:y=@0162;0x07:y=@03e1;default:y=@036f;
  $  031.BMS(电池管理系统)状态模式                                                          $    $  /        $    $  ANS031.BYTE004  $  switxh(x)0x00:y=@0209;0x01:y=@0318;0x02:y=@03e1;0x03:y=@03e2;0x04:y=@03e3;0x05:y=@03e4;0x06:y=@03e5;0x07:y=@03e6;0x08:y=@03e7;0x09:y=@03e8;0x0A:y=@03e9;0x0B:y=@03ea;0x0C:y=@03eb;0x0D:y=@03ec;0x0E:y=@03ed;0x0F:y=@03ee;default:y=@036f;
  $  032.外部能量状态_CP信号                                                                $    $  /        $    $  ANS032.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@03ef;0x02:y=@03f0;0x03:y=@03f1;0x07:y=@03f2;default:y=@036f;
  $  033.外部线缆连接状态_CC信号                                                            $    $  /        $    $  ANS033.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@0240;0x02:y=@03df;0x03:y=@03e0;default:@036f;
  $  034.BMS(电池管理系统)直流充电枪连接状态                                                $    $  /        $    $  ANS034.BYTE004  $  if(x1==0x00)y=@01c3;else if(x1==0x01)y=@0240;else y=@0230;
  $  035.BMS(电池管理系统)充电故障状态                                                      $    $  /        $    $  ANS035.BYTE004  $  switxh(x)0x00:y=@010f;0x01:y=@02f9;0x02:y=@02f8;0x03:y=@03d4;0x04:y=@03d5;0x05:y=@0438;0x06:y=@0439;0x0F:y=@0132;default:y=@036f;
  $  036.BMS(电池管理系统)发送系统电流                                                      $    $  A        $    $  ANS036.BYTE004  $  y=(x1*256+x2)*0.1-500;
  $  037.Pack电压                                                                           $    $  V        $    $  ANS037.BYTE004  $  y=(x1*256+x2)*0.1;
  $  038.BMS(电池管理系统)充电峰值功率                                                      $    $  kW       $    $  ANS038.BYTE004  $  y=x;
  $  039.BMS(电池管理系统)最大的充电持续功率                                                $    $  kW       $    $  ANS039.BYTE004  $  y=x;
  $  040.BMS(电池管理系统)放电峰值功率                                                      $    $  kW       $    $  ANS040.BYTE004  $  y=x;
  $  041.最大的放电持续功率                                                                 $    $  kW       $    $  ANS041.BYTE004  $  y=x;
  $  042.剩余电量                                                                           $    $  %        $    $  ANS042.BYTE004  $  y=(x1*256+x2)*0.1;
  $  043.OBC(车载充电机)状态请求                                                            $    $  /        $    $  ANS043.BYTE004  $  switxh(x)0x00:y=@0209;0x01:y=@0318;0x02:y=@0209;0x03:y=@0209;0x04:y=@03d6;0x05:y=@0162;0x06:y=@03d7;0x07:y=@0209;0x08:y=@03d8;0x09:y=@03d9;0x0A:y=@03da;0x0B:y=@03db;0x0C:y=@03dc;0x0D:y=@03dd;0x0E:y=@03de;0x0F:y=@0132;default:y=@036f;
  $  044.OBC(车载充电机)故障等级                                                            $    $  /        $    $  ANS044.BYTE004  $  switxh(x)0x00:y=@01ac;0x01:y=@0405;0x02:y=@0406;0x03:y=@0407;default:y=@036f;
  $  045.充电枪电子锁状态                                                                   $    $  /        $    $  ANS045.BYTE004  $  switxh(x)0x00:y=@0408;0x01:y=@010a;0x02:y=@010b;0x03:y=@0409;0x04:y=@040a;default:y=@036f;
  $  046.车载充电机输出充电电压                                                             $    $  V        $    $  ANS046.BYTE004  $  y=x*0.1;
  $  047.车载充电机输出充电电流                                                             $    $  A        $    $  ANS047.BYTE004  $  y=x*0.1;
  $  048.车载充电机本体温度                                                                 $    $  degC     $    $  ANS048.BYTE004  $  y=x*1-40;
  $  049.P档锁止状态                                                                        $    $  /        $    $  ANS049.BYTE004  $  switxh(x)0x00:y=@0000;0x01:y=@03ff;0x02:y=@010a;0x03:y=@0400;0x04:y=@0401;0x05:y=@0402;0x06:y=@0403;0x07:y=@0404;default:y=@036f;
  $  050.P档控制器故障灯请求                                                                $    $  /        $    $  ANS050.BYTE004  $  if(x1==0x00)y=@0430;else if(x1==0x01)y=@03fe;else y=@0230;
  $  051.GSM(传统换挡器)档杆位置                                                            $    $  /        $    $  ANS051.BYTE004  $  switxh(x)0x00:y=@02fa;0x01:y=@03f9;0x02:y=@03fa;0x03:y=@03fb;0x04:y=@03fc;0x05:y=@0209;0x06:y=@0209;0x07:y=@0132;default:y=@036f;
  $  052.GSM(传统换挡器)请求P档按钮状态                                                     $    $  /        $    $  ANS052.BYTE004  $  switxh(x)0x00:y=@03fd;0x01:y=@03fe;0x02:y=@0162;0x03:y=@0132;default:y=@036f;
  $  053.EPB(电子驻车制动系统)开关状态                                                      $    $  /        $    $  ANS053.BYTE004  $  switxh(x)0x00:y=@03f3;0x01:y=@03f4;0x02:y=@0018;0x04:y=@0132;default:y=@036f;
  $  054.EPB(电子驻车制动系统)系统状态                                                      $    $  /        $    $  ANS054.BYTE004  $  switxh(x)0x00:y=@0018;0x01:y=@03f5;0x02:y=@03f6;0x03:y=@01b0;0x04:y=@03f7;0x05:y=@03f8;default:y=@036f;
  $  055.VCU(整车控制器)信号提示当前车速                                                    $    $  km/h     $    $  ANS055.BYTE004  $  if(x==0xff)y=@0132;else y=x*1;
  $  056.换挡杆故障等级                                                                     $    $  /        $    $  ANS056.BYTE004  $  switxh(x)0x00:y=@010f;0x01:y=@041a;0x02:y=@041b;0x03:y=@041c;default:y=@0162;
  $  057.ACU(安全气囊控制单元)信号提示车辆被碰撞(安全气囊弹出)                              $    $  /        $    $  ANS057.BYTE004  $  if(x==0x01)y=@0413;else if(y==0x01)y=@0414;else y=@0230;
  $  058.PEPS(无钥匙进入一键式启动单元)电源模式                                             $    $  /        $    $  ANS058.BYTE004  $  switxh(x)0x00:y=@0415;0x01:y=@0416;0x02:y=@0417;0x03:y=@0418;0x04:y=@0419;0x05:y=@0418;default:y=@036f;
  $  059.PEPS(无钥匙进入一键式启动单元)系统学习状态                                         $    $  /        $    $  ANS059.BYTE004  $  switxh(x)0x00:y=@0220;0x01:y=@0130;0x02:y=@040c;0x03:y=@0143;default:y=@036f;
  $  060.压缩机实际消耗功率                                                                 $    $  kW       $    $  ANS060.BYTE004  $  y=x*0.1;
  $  061.压缩机故障码                                                                       $    $  /        $    $  ANS061.BYTE004  $  switxh(x)0x00:y=@01ac;0x01:y=@040d;0x02:y=@02ad;0x04:y=@040e;0x08:y=@040f;0x10:y=@0410;0x20:y=@0411;0x40:y=@0412;0xFF:y=@0008;default:y=@036f;
  $  062.空调发出的高速风扇请求                                                             $    $  /        $    $  ANS062.BYTE004  $  if(x1==0x00)y=@03fd;else if(x1==0x01)y=@03fe;else y=@0230;
  $  063.除霜模式                                                                           $    $  /        $    $  ANS063.BYTE004  $  if(x1==0x00)y=@030d;else if(x1==0x01)y=@040b;else y=@0230;
  $  064.加热器开关机命令                                                                   $    $  /        $    $  ANS064.BYTE004  $  if(x1==0x00)y=@041f;else if(x1==0x01)y=@0420;else y=@0230;
  $  065.PTC(高压加热电阻)消耗的功率                                                        $    $  kW       $    $  ANS065.BYTE004  $  y=x*0.1;
  $  066.PTC(高压加热电阻)功率请求                                                          $    $  W        $    $  ANS066.BYTE004  $  y=x*40;
  $  067.压缩机功率请求                                                                     $    $  kW       $    $  ANS067.BYTE004  $  y=x*0.5;
  $  068.ABS(防抱刹车系统)是否被激活                                                        $    $  /        $    $  ANS068.BYTE004  $  if(x1==0x00)y=@001d;else if(x1==0x01)y=@001c;else y=@0230;
  $  069.TCS(牵引力控制系统)是否被激活                                                      $    $  /        $    $  ANS069.BYTE004  $  if(x1==0x00)y=@041d;else if(x1==0x01)y=@041e;else y=@0230;
  $  070.ABS(防抱刹车系统)_ESC(电子稳定控制单元)信号提示车速                                $    $  km/h     $    $  ANS070.BYTE004  $  y=INT(x*0.05625);
  $  071.ABS(防抱刹车系统)_ESC(电子稳定控制单元)信号提示车速信号是否有效                    $    $  /        $    $  ANS071.BYTE004  $  if(x1==0x00)y=@0169;else if(x1==0x01)y=@0132;else y=@0230;
  $  072.ESC(电子稳定控制单元)信号提示系统向EMS(发动机管理系统)要求需快速减扭到的扭距       $    $  Nm       $    $  ANS072.BYTE004  $  y=(x1*256+x2)-2047;
  $  073.ESC(电子稳定控制单元)指示发动机速减扭请求是否激活                                  $    $  /        $    $  ANS073.BYTE004  $  if(x1==0x00)y=@001d;else if(x1==0x01)y=@001c;else y=@0230;
  $  074.目标回馈扭矩                                                                       $    $  Nm       $    $  ANS074.BYTE004  $  y=(x1*256+x2)-32768;
  $  075.目标回馈扭矩状态                                                                   $    $  /        $    $  ANS075.BYTE004  $  switxh(x)0x00:y=@023a;0x01:y=@010f;0x02:y=@01b0;default:y=@036f;
  $  076.加速踏板1信号                                                                      $    $  V        $    $  ANS076.BYTE004  $  y=x*0.02;
  $  077.加速踏板2信号                                                                      $    $  V        $    $  ANS077.BYTE004  $  y=x*0.02;
  $  078.制动踏板1信号                                                                      $    $  /        $    $  ANS078.BYTE004  $  if(x1==0x00)y=@03fe;else if(x1==0x01)y=@03fd;else y=@0230;
  $  079.制动踏板2信号                                                                      $    $  /        $    $  ANS079.BYTE004  $  if(x1==0x00)y=@03fe;else if(x1==0x01)y=@03fd;else y=@0230;
  $  080.电机水泵控制                                                                       $    $  %        $    $  ANS080.BYTE004  $  y=x;
  $  081.电机水泵继电器电源                                                                 $    $  /        $    $  ANS081.BYTE004  $  if(x1==0x00)y=@0191;else if(x1==0x01)y=@0190;else y=@0230;
  $  082.高速风扇使能                                                                       $    $  /        $    $  ANS082.BYTE004  $  if(x1==0x00)y=@0191;else if(x1==0x01)y=@0190;else y=@0230;
  $  083.低速风扇使能                                                                       $    $  /        $    $  ANS083.BYTE004  $  if(x1==0x00)y=@0191;else if(x1==0x01)y=@0190;else y=@0230;
  $  084.上下电逻辑状态                                                                     $    $  /        $    $  ANS084.BYTE004  $  switxh(x)0:y=@043e;1:y=@043f;2:y=@0440;5:y=@0441;10:y=@0442;15:y=@0443;25:y=@0444;50:y=@0445;65:y=@0446;79:y=@0447;80:y=@0448;81:y=@0449;82:y=@044a;83:y=@044b;85:y=@044c;86:y=@044d;87:y=@044e;89:y=@044f;90:y=@0450;91:y=@0451;95:y=@0452;96:y=@0453;97:y=@0454;98:y=@0455;99:y=@0407;100:y=@0456;105:y=@0457;110:y=@0458;115:y=@0459;125:y=@045a;130:y=@045b;131:y=@045c;160:y=@045d;165:y=@045e;180:y=@045f;185:y=@03ec;187:y=@0460;189:y=@0461;190:y=@0462;191:y=@0463;205:y=@0464;210:y=@0465;215:y=@0466;220:y=@0467;222:y=@0468;225:y=@0469;230:y=@046a;235:y=@046b;240:y=@046c;245:y=@046d;250:y=@046e;252:y=@046f;254:y=@0470;255:y=@0471;default:y=@036f;
  $  085.扭矩模式管理                                                                       $    $  /        $    $  ANS085.BYTE004  $  switxh(x)0x02:y=@043a;0x04:y=@043b;0x06:y=@0435;0x07:y=@043c;default:y=@036f;
  $  086.VCU(整车控制器)发出的EPB(电子驻车制动系统)锁止请求                                 $    $  /        $    $  ANS086.BYTE004  $  if(x1==0x00)y=@03fd;else if(x1==0x01)y=@043d;else y=@0230;
  $  087.油门踩压位置                                                                       $    $  %        $    $  ANS087.BYTE004  $  y=x*0.4;
  $  088.EMS(发动机管理系统)信号提示当前油门信号有效                                        $    $  /        $    $  ANS088.BYTE004  $  if(x1==0x00)y=@0169;else if(x1==0x01)y=@0132;else y=@0230;
  $  089.最大允许压缩机消耗的功率                                                           $    $  kW       $    $  ANS089.BYTE004  $  y=x*0.1;
  $  090.最大允许PTC(高压加热电阻)消耗的功率                                                $    $  W        $    $  ANS090.BYTE004  $  y=x*40;
  $  091.DMS(驾驶模式开关)驾驶模式请求                                                      $    $  /        $    $  ANS091.BYTE004  $  switxh(x)0x00:y=@03fd;0x01:y=@0162;0x02:y=@0477;0x03:y=@0478;default:y=@0162;
  $  092.制动开关状态                                                                       $    $  /        $    $  ANS092.BYTE004  $  switxh(x)0x00:y=@0162;0x01:y=@0475;0x02:y=@001c;0x03:y=@0162;default:y=@036f;
  $  093.制动主缸压力                                                                       $    $  bar      $    $  ANS093.BYTE004  $  if(x==0xFF) y=@0476; else y=x;
  $  094.绝缘阻值过低故障报警                                                               $    $  /        $    $  ANS094.BYTE005  $  switxh(x)0x00:y=@010f;0x01:y=@0472;0x02:y=@0473;0x03:y=@0474;default:y=@036f;
  $  095.整车高压互锁故障                                                                   $    $  /        $    $  ANS095.BYTE006  $  if(x1==0x00)y=@010f;else if(x1==0x01)y=@01b0;else y=@0230;
  $  096.VCU(整车控制器) 锁P档请求                                                          $    $  /        $    $  ANS096.BYTE006  $  switxh(x)0x00:y=@0000;0x01:y=@0431;0x02:y=@0432;0x03:y=@0132;default:y=@036f;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
