
    车型ID：07c5

    模拟：协议模拟-->07c5

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B9

进入命令:

  $~  REQ000:7B1 02 10 01 00 00 00 00 00       $~  ANS000:7B9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B1 02 3E 00 00 00 00 00 00       $!  ANS000:7B9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B1 03 19 02 09 00 00 00 00       $#  ANS000:7B9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/40000000


  $#  01.读故障码库
  $#  REQ000:7B1 02 19 0A 00 00 00 00 00       $#  ANS000:7B9 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/40000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B1 04 14 FF FF FF 00 00 00       $$  ANS000:7B9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B1 03 22 F1 12 00 00 00 00       $%  ANS000:7B9 03 22 F1 12 00 00 00 00
  $%  REQ001:7B1 03 22 F1 87 00 00 00 00       $%  ANS001:7B9 03 22 F1 87 00 00 00 00
  $%  REQ002:7B1 03 22 F1 89 00 00 00 00       $%  ANS002:7B9 03 22 F1 89 00 00 00 00
  $%  REQ003:7B1 03 22 F1 8A 00 00 00 00       $%  ANS003:7B9 03 22 F1 8A 00 00 00 00
  $%  REQ004:7B1 03 22 F1 8B 00 00 00 00       $%  ANS004:7B9 03 22 F1 8B 00 00 00 00
  $%  REQ005:7B1 03 22 F1 8C 00 00 00 00       $%  ANS005:7B9 03 22 F1 8C 00 00 00 00
  $%  REQ006:7B1 03 22 F1 90 00 00 00 00       $%  ANS006:7B9 03 22 F1 90 00 00 00 00
  $%  REQ007:7B1 03 22 F1 93 00 00 00 00       $%  ANS007:7B9 03 22 F1 93 00 00 00 00
  $%  REQ008:7B1 03 22 F1 95 00 00 00 00       $%  ANS008:7B9 03 22 F1 95 00 00 00 00
  $%  REQ009:7B1 03 22 F1 9D 00 00 00 00       $%  ANS009:7B9 03 22 F1 9D 00 00 00 00
  $%  REQ010:7B1 03 22 F1 13 00 00 00 00       $%  ANS010:7B9 03 22 F1 13 00 00 00 00
  $%  REQ011:7B1 03 22 4B 02 00 00 00 00       $%  ANS011:7B9 03 22 4B 02 00 00 00 00

  $%  000:车辆名称:                         $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                           $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:Geely软件版本号:                  $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3);
  $%  003:供应商代码:                       $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:ECU(电子控制器)生产日期:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:            $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号(VIN码):                $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:        $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:        $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)安装日期:          $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  010:诊断版本:                         $%    $%  ANS010.BYTE004  $%  y=SPRINTF([V%X.%X%X%X],x1,x2,x3,x4);
  $%  011:电池包版本号:                     $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B1 03 22 4B 02 00 00 00 00       $  ANS000:7B9 03 22 4B 02 00 00 00 00
  $  REQ001:7B1 03 22 4B 03 00 00 00 00       $  ANS001:7B9 03 22 4B 03 00 00 00 00
  $  REQ002:7B1 03 22 4B 04 00 00 00 00       $  ANS002:7B9 03 22 4B 04 00 00 00 00
  $  REQ003:7B1 03 22 4B 05 00 00 00 00       $  ANS003:7B9 03 22 4B 05 00 00 00 00
  $  REQ004:7B1 03 22 4B 06 00 00 00 00       $  ANS004:7B9 03 22 4B 06 00 00 00 00
  $  REQ005:7B1 03 22 4B 07 00 00 00 00       $  ANS005:7B9 03 22 4B 07 00 00 00 00
  $  REQ006:7B1 03 22 4B 08 00 00 00 00       $  ANS006:7B9 03 22 4B 08 00 00 00 00
  $  REQ007:7B1 03 22 4B 09 00 00 00 00       $  ANS007:7B9 03 22 4B 09 00 00 00 00
  $  REQ008:7B1 03 22 4B 0A 00 00 00 00       $  ANS008:7B9 03 22 4B 0A 00 00 00 00
  $  REQ009:7B1 03 22 4B 0B 00 00 00 00       $  ANS009:7B9 03 22 4B 0B 00 00 00 00
  $  REQ010:7B1 03 22 4B 0C 00 00 00 00       $  ANS010:7B9 03 22 4B 0C 00 00 00 00
  $  REQ011:7B1 03 22 4B 0D 00 00 00 00       $  ANS011:7B9 03 22 4B 0D 00 00 00 00
  $  REQ012:7B1 03 22 4B 0E 00 00 00 00       $  ANS012:7B9 03 22 4B 0E 00 00 00 00
  $  REQ013:7B1 03 22 4B 0F 00 00 00 00       $  ANS013:7B9 03 22 4B 0F 00 00 00 00
  $  REQ014:7B1 03 22 4B 10 00 00 00 00       $  ANS014:7B9 03 22 4B 10 00 00 00 00
  $  REQ015:7B1 03 22 4B 11 00 00 00 00       $  ANS015:7B9 03 22 4B 11 00 00 00 00
  $  REQ016:7B1 03 22 4B 12 00 00 00 00       $  ANS016:7B9 03 22 4B 12 00 00 00 00
  $  REQ017:7B1 03 22 4B 13 00 00 00 00       $  ANS017:7B9 03 22 4B 13 00 00 00 00
  $  REQ018:7B1 03 22 4B 15 00 00 00 00       $  ANS018:7B9 03 22 4B 15 00 00 00 00
  $  REQ019:7B1 03 22 4B 16 00 00 00 00       $  ANS019:7B9 03 22 4B 16 00 00 00 00
  $  REQ020:7B1 03 22 4B 17 00 00 00 00       $  ANS020:7B9 03 22 4B 17 00 00 00 00
  $  REQ021:7B1 03 22 4B 18 00 00 00 00       $  ANS021:7B9 03 22 4B 18 00 00 00 00
  $  REQ022:7B1 03 22 4B 19 00 00 00 00       $  ANS022:7B9 03 22 4B 19 00 00 00 00
  $  REQ023:7B1 03 22 4B 1A 00 00 00 00       $  ANS023:7B9 03 22 4B 1A 00 00 00 00
  $  REQ024:7B1 03 22 4B 1C 00 00 00 00       $  ANS024:7B9 03 22 4B 1C 00 00 00 00
  $  REQ025:7B1 03 22 4B 1D 00 00 00 00       $  ANS025:7B9 03 22 4B 1D 00 00 00 00
  $  REQ026:7B1 03 22 4B 1E 00 00 00 00       $  ANS026:7B9 03 22 4B 1E 00 00 00 00
  $  REQ027:7B1 03 22 4B 1F 00 00 00 00       $  ANS027:7B9 03 22 4B 1F 00 00 00 00
  $  REQ028:7B1 03 22 4B 20 00 00 00 00       $  ANS028:7B9 03 22 4B 20 00 00 00 00
  $  REQ029:7B1 03 22 4B 21 00 00 00 00       $  ANS029:7B9 03 22 4B 21 00 00 00 00
  $  REQ030:7B1 03 22 4B 22 00 00 00 00       $  ANS030:7B9 03 22 4B 22 00 00 00 00
  $  REQ031:7B1 03 22 4B 23 00 00 00 00       $  ANS031:7B9 03 22 4B 23 00 00 00 00
  $  REQ032:7B1 03 22 4B 24 00 00 00 00       $  ANS032:7B9 03 22 4B 24 00 00 00 00
  $  REQ033:7B1 03 22 4B 25 00 00 00 00       $  ANS033:7B9 03 22 4B 25 00 00 00 00
  $  REQ034:7B1 03 22 4B 26 00 00 00 00       $  ANS034:7B9 03 22 4B 26 00 00 00 00
  $  REQ035:7B1 03 22 4B 27 00 00 00 00       $  ANS035:7B9 03 22 4B 27 00 00 00 00
  $  REQ036:7B1 03 22 4B 28 00 00 00 00       $  ANS036:7B9 03 22 4B 28 00 00 00 00
  $  REQ037:7B1 03 22 4B 29 00 00 00 00       $  ANS037:7B9 03 22 4B 29 00 00 00 00
  $  REQ038:7B1 03 22 4B 2A 00 00 00 00       $  ANS038:7B9 03 22 4B 2A 00 00 00 00
  $  REQ039:7B1 03 22 4B 2C 00 00 00 00       $  ANS039:7B9 03 22 4B 2C 00 00 00 00
  $  REQ040:7B1 03 22 4B 2D 00 00 00 00       $  ANS040:7B9 03 22 4B 2D 00 00 00 00
  $  REQ041:7B1 03 22 4B 2E 00 00 00 00       $  ANS041:7B9 03 22 4B 2E 00 00 00 00
  $  REQ042:7B1 03 22 4B 2F 00 00 00 00       $  ANS042:7B9 03 22 4B 2F 00 00 00 00
  $  REQ043:7B1 03 22 4B 30 00 00 00 00       $  ANS043:7B9 03 22 4B 30 00 00 00 00
  $  REQ044:7B1 03 22 4B 31 00 00 00 00       $  ANS044:7B9 03 22 4B 31 00 00 00 00
  $  REQ045:7B1 03 22 4B 32 00 00 00 00       $  ANS045:7B9 03 22 4B 32 00 00 00 00
  $  REQ046:7B1 03 22 4B 33 00 00 00 00       $  ANS046:7B9 03 22 4B 33 00 00 00 00
  $  REQ047:7B1 03 22 4B 34 00 00 00 00       $  ANS047:7B9 03 22 4B 34 00 00 00 00
  $  REQ048:7B1 03 22 4B 35 00 00 00 00       $  ANS048:7B9 03 22 4B 35 00 00 00 00
  $  REQ049:7B1 03 22 4B 36 00 00 00 00       $  ANS049:7B9 03 22 4B 36 00 00 00 00
  $  REQ050:7B1 03 22 4B 37 00 00 00 00       $  ANS050:7B9 03 22 4B 37 00 00 00 00
  $  REQ051:7B1 03 22 4B 38 00 00 00 00       $  ANS051:7B9 03 22 4B 38 00 00 00 00
  $  REQ052:7B1 03 22 4B 39 00 00 00 00       $  ANS052:7B9 03 22 4B 39 00 00 00 00
  $  REQ053:7B1 03 22 4B 3A 00 00 00 00       $  ANS053:7B9 03 22 4B 3A 00 00 00 00
  $  REQ054:7B1 03 22 4B 3B 00 00 00 00       $  ANS054:7B9 03 22 4B 3B 00 00 00 00
  $  REQ055:7B1 03 22 4B 3C 00 00 00 00       $  ANS055:7B9 03 22 4B 3C 00 00 00 00
  $  REQ056:7B1 03 22 4B 41 00 00 00 00       $  ANS056:7B9 03 22 4B 41 00 00 00 00
  $  REQ057:7B1 03 22 4B 42 00 00 00 00       $  ANS057:7B9 03 22 4B 42 00 00 00 00
  $  REQ058:7B1 03 22 4B 43 00 00 00 00       $  ANS058:7B9 03 22 4B 43 00 00 00 00
  $  REQ059:7B1 03 22 4B 44 00 00 00 00       $  ANS059:7B9 03 22 4B 44 00 00 00 00
  $  REQ060:7B1 03 22 4B 45 00 00 00 00       $  ANS060:7B9 03 22 4B 45 00 00 00 00
  $  REQ061:7B1 03 22 4B 46 00 00 00 00       $  ANS061:7B9 03 22 4B 46 00 00 00 00
  $  REQ062:7B1 03 22 4B 47 00 00 00 00       $  ANS062:7B9 03 22 4B 47 00 00 00 00
  $  REQ063:7B1 03 22 4B 48 00 00 00 00       $  ANS063:7B9 03 22 4B 48 00 00 00 00
  $  REQ064:7B1 03 22 4B 49 00 00 00 00       $  ANS064:7B9 03 22 4B 49 00 00 00 00
  $  REQ065:7B1 03 22 4B 4A 00 00 00 00       $  ANS065:7B9 03 22 4B 4A 00 00 00 00
  $  REQ066:7B1 03 22 4B 4B 00 00 00 00       $  ANS066:7B9 03 22 4B 4B 00 00 00 00
  $  REQ067:7B1 03 22 4B 4C 00 00 00 00       $  ANS067:7B9 03 22 4B 4C 00 00 00 00
  $  REQ068:7B1 03 22 4B 4D 00 00 00 00       $  ANS068:7B9 03 22 4B 4D 00 00 00 00
  $  REQ069:7B1 03 22 4B 4E 00 00 00 00       $  ANS069:7B9 03 22 4B 4E 00 00 00 00
  $  REQ070:7B1 03 22 4B 4F 00 00 00 00       $  ANS070:7B9 03 22 4B 4F 00 00 00 00
  $  REQ071:7B1 03 22 4B 50 00 00 00 00       $  ANS071:7B9 03 22 4B 50 00 00 00 00
  $  REQ072:7B1 03 22 4B 51 00 00 00 00       $  ANS072:7B9 03 22 4B 51 00 00 00 00
  $  REQ073:7B1 03 22 4B 52 00 00 00 00       $  ANS073:7B9 03 22 4B 52 00 00 00 00
  $  REQ074:7B1 03 22 4B 53 00 00 00 00       $  ANS074:7B9 03 22 4B 53 00 00 00 00
  $  REQ075:7B1 03 22 4B 54 00 00 00 00       $  ANS075:7B9 03 22 4B 54 00 00 00 00
  $  REQ076:7B1 03 22 4B 55 00 00 00 00       $  ANS076:7B9 03 22 4B 55 00 00 00 00
  $  REQ077:7B1 03 22 4B 56 00 00 00 00       $  ANS077:7B9 03 22 4B 56 00 00 00 00
  $  REQ078:7B1 03 22 4B 57 00 00 00 00       $  ANS078:7B9 03 22 4B 57 00 00 00 00
  $  REQ079:7B1 03 22 4B 58 00 00 00 00       $  ANS079:7B9 03 22 4B 58 00 00 00 00
  $  REQ080:7B1 03 22 4B 59 00 00 00 00       $  ANS080:7B9 03 22 4B 59 00 00 00 00
  $  REQ081:7B1 03 22 4B 5A 00 00 00 00       $  ANS081:7B9 03 22 4B 5A 00 00 00 00
  $  REQ082:7B1 03 22 4B 5B 00 00 00 00       $  ANS082:7B9 03 22 4B 5B 00 00 00 00
  $  REQ083:7B1 03 22 02 00 00 00 00 00       $  ANS083:7B9 03 22 02 00 00 00 00 00
  $  REQ084:7B1 03 22 02 01 00 00 00 00       $  ANS084:7B9 03 22 02 01 00 00 00 00

  $  000.电池包版本号                                  $    $  /        $    $  ANS000.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $  001.电池包标称容量                                $    $  Ah       $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.1;
  $  002.电池包标称能量                                $    $  KWh      $    $  ANS002.BYTE004  $  y=(x1*256+x2)*0.1;
  $  003.标称电压                                      $    $  V        $    $  ANS003.BYTE004  $  y=(x1*256+x2)*1;
  $  004.电池类型码                                    $    $  /        $    $  ANS004.BYTE004  $  if(x==0)y=@0162;else if(x==1)y=@06a4;else if(x==2)y=@06a5;else if(x==3)y=@04cc;else if(x==4)y=@04cd;else if(x==5)y=@04ce;else if(x==6)y=@06a6;else if(x==7)y=@06a7;else if(x==15)y=@06a8;else y=@0220;
  $  005.Cell总数                                      $    $  /        $    $  ANS005.BYTE004  $  y=x;
  $  006.Cell温度传感器总数                            $    $  /        $    $  ANS006.BYTE004  $  HEX(x1);
  $  007.电池包单次放电容量                            $    $  Ah       $    $  ANS007.BYTE004  $  y=(x1*256+x2)*0.1;
  $  008.电池包单次充电容量                            $    $  Ah       $    $  ANS008.BYTE004  $  y=(x1*256+x2)*0.1;
  $  009.电池包累计放电容量                            $    $  Ah       $    $  ANS009.BYTE004  $  y=((x1<<24)+(x2<<16)+x3*256+x4)*0.1;
  $  010.电池包累计充电容量                            $    $  Ah       $    $  ANS010.BYTE004  $  y=((x1<<24)+(x2<<16)+x3*256+x4)*0.1;
  $  011.1#模组序列号                                  $    $  /        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6);
  $  012.2#模组序列号                                  $    $  /        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6);
  $  013.3#模组序列号                                  $    $  /        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6);
  $  014.4#模组序列号                                  $    $  /        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6);
  $  015.5#模组序列号                                  $    $  /        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6);
  $  016.6#模组序列号                                  $    $  /        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6);
  $  017.7#模组序列号                                  $    $  /        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6);
  $  018.1#模组制造日期                                $    $  /        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3,x4);
  $  019.2#模组制造日期                                $    $  /        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3,x4);
  $  020.3#模组制造日期                                $    $  /        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3,x4);
  $  021.4#模组制造日期                                $    $  /        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3,x4);
  $  022.5#模组制造日期                                $    $  /        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3,x4);
  $  023.6#模组制造日期                                $    $  /        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3,x4);
  $  024.7#模组制造日期                                $    $  /        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3,x4);
  $  025.主控板供应商代码                              $    $  /        $    $  ANS013.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  026.主控板序列号                                  $    $  /        $    $  ANS014.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $  027.主控板制造日期                                $    $  /        $    $  ANS015.BYTE004  $  HEX(x1,x2,x3,x4);
  $  028.HCU(整车控制器)放电控制                       $    $  /        $    $  ANS016.BYTE004  $  if((x&0x0f)==0)y=@012f;else if((x&0x0f)==4)y=@06aa;else if((x&0x0f)==9)y=@06ab;else if((x&0x0f)==0x0B)y=@06ac;else y=@0220;
  $  029.HCU(整车控制器)充电控制                       $    $  /        $    $  ANS017.BYTE004  $  if((x&0x03)==0)y=@06a9;else if((x&0x03)==1)y=@0422;else if((x&0x03)==2)y=@0209;else if((x&0x03)==3)y=@0209;
  $  030.BMS(电池管理系统)状态                         $    $  /        $    $  ANS018.BYTE004  $  if((x&0x0f)==0)y=@0162;else if((x&0x0f)==1)y=@05c2;else if((x&0x0f)==2)y=@05c3;else if((x&0x0f)==3)y=@05c4;else if((x&0x0f)==4)y=@05c5;else if((x&0x0f)==8)y=@05c6;else if((x&0x0f)==9)y=@05c7;else if((x&0x0f)==0x0A)y=@0589;else if((x&0x0f)==0x0B)y=@06a2;else if((x&0x0f)==0x0C)y=@05c9;else if((x&0x0f)==0x0E)y=@05ca;else if((x&0x0f)==0x0F) y=@0162;
  $  031.BMS(电池管理系统)放电故障等级                 $    $  /        $    $  ANS019.BYTE004  $  if((x&0x1f)==0)y=@010f;else if((x&0x1f)==1)y=@06ad;else if((x&0x1f)==2)y=@06ae;else if((x&0x1f)==3)y=@03e8;else if((x&0x1f)==4)y=@010a;else if((x&0x1f)>=5 && (x&0x1f)<=15)y=@0132;
  $  032.BMS(电池管理系统)充电故障等级                 $    $  /        $    $  ANS020.BYTE004  $  if((x&0x1f)==0)y=@010f;else if((x&0x1f)==1)y=@06ad;else if((x&0x1f)==2)y=@06ae;else if((x&0x1f)==3)y=@03e8;else if((x&0x1f)==4)y=@010a;else if((x&0x1f)>=5 && (x&0x1f)<=15)y=@0132;
  $  033.BMS(电池管理系统)放电回路预充状态             $    $  /        $    $  ANS021.BYTE004  $  if((x&0x07)==0)y=@00d1;else if((x&0x07)==1)y=@06af;else if((x&0x07)==2)y=@06b0;else if((x&0x07)==3)y=@03e6;else if((x&0x07)==4)y=@06b1;else y=@0209;
  $  034.BMS(电池管理系统)充电回路预充状态             $    $  /        $    $  ANS022.BYTE004  $  if((x&0x07)==0)y=@00d1;else if((x&0x07)==1)y=@06af;else if((x&0x07)==2)y=@06b0;else if((x&0x07)==3)y=@03e6;else if((x&0x07)==4)y=@06b1;else y=@0209;
  $  035.ECU(电子控制器)电源电压                       $    $  V        $    $  ANS023.BYTE004  $  y=0.1*x;
  $  036.1#模组1#温度值                                $    $  degC     $    $  ANS024.BYTE004  $  y=x*0.5-40;
  $  037.1#模组2#温度值                                $    $  degC     $    $  ANS024.BYTE005  $  y=x*0.5-40;
  $  038.2#模组1#温度值                                $    $  degC     $    $  ANS024.BYTE006  $  y=x*0.5-40;
  $  039.2#模组2#温度值                                $    $  degC     $    $  ANS024.BYTE007  $  y=x*0.5-40;
  $  040.3#模组1#温度值                                $    $  degC     $    $  ANS024.BYTE008  $  y=x*0.5-40;
  $  041.3#模组2#温度值                                $    $  degC     $    $  ANS024.BYTE009  $  y=x*0.5-40;
  $  042.4#模组1#温度值                                $    $  degC     $    $  ANS024.BYTE010  $  y=x*0.5-40;
  $  043.4#模组2#温度值                                $    $  degC     $    $  ANS024.BYTE011  $  y=x*0.5-40;
  $  044.5#模组1#温度值                                $    $  degC     $    $  ANS024.BYTE012  $  y=x*0.5-40;
  $  045.5#模组2#温度值                                $    $  degC     $    $  ANS024.BYTE013  $  y=x*0.5-40;
  $  046.6#模组1#温度值                                $    $  degC     $    $  ANS024.BYTE014  $  y=x*0.5-40;
  $  047.6#模组2#温度值                                $    $  degC     $    $  ANS024.BYTE015  $  y=x*0.5-40;
  $  048.7#模组1#温度值                                $    $  degC     $    $  ANS024.BYTE016  $  y=x*0.5-40;
  $  049.7#模组2#温度值                                $    $  degC     $    $  ANS024.BYTE017  $  y=x*0.5-40;
  $  050.最大电芯电压                                  $    $  mV       $    $  ANS025.BYTE004  $  y=(x1<<8)+x2;
  $  051.最大电芯电压的电芯号                          $    $  /        $    $  ANS026.BYTE004  $  y=x;
  $  052.最小电芯电压                                  $    $  mV       $    $  ANS027.BYTE004  $  y=(x1<<8)+x2;
  $  053.最小电芯电压的电芯号                          $    $  /        $    $  ANS028.BYTE004  $  y=x;
  $  054.电池包总电压                                  $    $  V        $    $  ANS029.BYTE004  $  y=(x1<<8)+x2;
  $  055.电池包总电流                                  $    $  A        $    $  ANS030.BYTE004  $  y=((x1<<8)+x2)*0.1-500;
  $  056.电池包最高温度                                $    $  degC     $    $  ANS031.BYTE004  $  y=x*0.5-40;
  $  057.电池包最高温度的温度传感器号                  $    $  /        $    $  ANS032.BYTE004  $  y=x;
  $  058.电池包最低温度                                $    $  degC     $    $  ANS033.BYTE004  $  y=x*0.5-40;
  $  059.电池包最低温度的温度传感器号                  $    $  /        $    $  ANS034.BYTE004  $  y=x;
  $  060.绝缘电阻值                                    $    $  Kohm     $    $  ANS035.BYTE004  $  y=((x1<<8)+x2)*5;
  $  061.绝缘监测状态                                  $    $  /        $    $  ANS036.BYTE004  $  if((x&0x03)==0)y=@06b3;else if((x&0x03)==1)y=@06b4;else if((x&0x03)==2)y=@06b5;else if((x&0x03)==3)y=@06b6;
  $  062.高压互锁线状态                                $    $  /        $    $  ANS037.BYTE004  $  if((x&0x03)==0)y=@06b7;else if((x&0x03)==1)y=@06b8;else if((x&0x03)==3)y=@0008;
  $  063.主正继电器K1状态                              $    $  /        $    $  ANS038.BYTE004  $  if((x&0x03)==0)y=@0001;else if((x&0x03)==1)y=@068c;else if((x&0x03)==2)y=@06b2;
  $  064.主负继电器K2状态                              $    $  /        $    $  ANS038.BYTE004  $  if(((x>>2)&0x03)==0)y=@0001;else if(((x>>2)&0x03)==1)y=@068c;else if(((x>>2)&0x03)==2)y=@068d;
  $  065.预充继电器K3状态                              $    $  /        $    $  ANS038.BYTE004  $  if(((x>>4)&0x03)==0)y=@0001;else if(((x>>4)&0x03)==1)y=@068c;else if(((x>>4)&0x03)==2)y=@068d;
  $  066.充电继电器K4状态                              $    $  /        $    $  ANS038.BYTE004  $  if(((x>>6)&0x03)==0)y=@0001;else if(((x>>6)&0x03)==1)y=@068c;else if(((x>>6)&0x03)==2)y=@068d;
  $  067.充电预充继电器K5状态                          $    $  /        $    $  ANS038.BYTE005  $  if((x&0x03)==0)y=@0001;else if((x&0x03)==1)y=@068c;else if((x&0x03)==2)y=@068d;y=@0209;
  $  068.继电器K6状态(预留)                            $    $  /        $    $  ANS038.BYTE005  $  if(((x>>2)&0x03)==0)y=@0001;else if(((x>>2)&0x03)==1)y=@068c;else if(((x>>2)&0x03)==2)y=@068d;else y=@0209;
  $  069.继电器K7状态(预留)                            $    $  /        $    $  ANS038.BYTE005  $  if(((x>>4)&0x03)==0)y=@0001;else if(((x>>4)&0x03)==1)y=@068c;else if(((x>>4)&0x03)==2)y=@068d;else y=@0209;
  $  070.继电器K8状态(预留)                            $    $  /        $    $  ANS038.BYTE005  $  if(((x>>6)&0x03)==0)y=@0001;else if(((x>>6)&0x03)==1)y=@068c;else if(((x>>6)&0x03)==2)y=@068d;else y=@0209;
  $  071.充电机错误状态                                $    $  /        $    $  ANS039.BYTE004  $  if((x&0x03)==0)y=@010f;else if((x&0x03)==1)y=@03d9;else if((x&0x03)==2)y=@068b;else if((x&0x03)==3)y=@04a1;
  $  072.充电机输出电流                                $    $  A        $    $  ANS040.BYTE004  $  y=(x1*256+x2)*0.1;
  $  073.充电机输出电压                                $    $  V        $    $  ANS041.BYTE004  $  y=(x1*256+x2)*0.1;
  $  074.高压(内部)                                    $    $  V        $    $  ANS042.BYTE004  $  y=(x1*256+x2)*1;
  $  075.高压U_HVP                                     $    $  V        $    $  ANS043.BYTE004  $  y=(x1*256+x2)*1;
  $  076.高压U_HVN                                     $    $  V        $    $  ANS044.BYTE004  $  y=(x1*256+x2)*1;
  $  077.高压U_Ext(外部)                               $    $  V        $    $  ANS045.BYTE004  $  y=(x1*256+x2)*1;
  $  078.SOC最大值                                     $    $  %        $    $  ANS046.BYTE004  $  y=(x1*256+x2)*0.1;
  $  079.SOC最小值                                     $    $  %        $    $  ANS047.BYTE004  $  y=(x1*256+x2)*0.1;
  $  080.SOC内部值                                     $    $  %        $    $  ANS048.BYTE004  $  y=(x1*256+x2)*0.1;
  $  081.S显示SOC                                      $    $  %        $    $  ANS049.BYTE004  $  y=(x1*256+x2)*0.1;
  $  082.电池健康度                                    $    $  %        $    $  ANS050.BYTE004  $  y=(x1*256+x2)*0.1;
  $  083.剩余能量                                      $    $  Kwh      $    $  ANS051.BYTE004  $  y=(x1*256+x2)*0.1;
  $  084.允许的持续放电功率                            $    $  kW       $    $  ANS052.BYTE004  $  y=x;
  $  085.允许的峰值放电功率                            $    $  kW       $    $  ANS053.BYTE004  $  y=x;
  $  086.允许的持续充电功率                            $    $  kW       $    $  ANS054.BYTE004  $  y=x;
  $  087.允许的峰值充电功率                            $    $  kW       $    $  ANS055.BYTE004  $  y=x;
  $  088.充电枪CC状态                                  $    $  /        $    $  ANS056.BYTE004  $  if((x&0x01)==0)y=@0687;else if((x&0x01)==1)y=@0240;
  $  089.充电机CP连接状态                              $    $  /        $    $  ANS057.BYTE004  $  if((x&0x0f)==0)y=@0687;else if((x&0x0f)==1)y=@0688;else if((x&0x0f)==2)y=@0689;else if((x&0x0f)==3)y=@063d;else if((x&0x0f)==7)y=@068a;
  $  090.充电允许指令                                  $    $  /        $    $  ANS058.BYTE004  $  if((x&0x0f)==0)y=@012f;else if((x&0x0f)==2)y=@0235;else if((x&0x0f)==4)y=@0422;else if((x&0x0f)==0x0B)y=@0685;else y=@0220;
  $  091.BMS(电池管理系统)请求的充电电流               $    $  A        $    $  ANS059.BYTE004  $  y=(x1*256+x2)*0.1;
  $  092.BMS(电池管理系统)请求的充电电压               $    $  V        $    $  ANS060.BYTE004  $  y=(x1*256+x2)*0.1;
  $  093.BMS(电池管理系统)热管理请求                   $    $  /        $    $  ANS061.BYTE004  $  if((x&0x03)==0)y=@00d1;else if((x&0x03)==1)y=@03de;else if((x&0x03)==2)y=@03dd;else if((x&0x03)==3)y=@0686;
  $  094.AC(空调)热管理应答                            $    $  /        $    $  ANS062.BYTE004  $  if((x&0x07)==0)y=@012f;else if((x&0x07)==1)y=@0692;else if((x&0x07)==2)y=@0693;else if((x&0x07)==3)y=@0694;else if((x&0x07)==4)y=@0695;else if((x&0x07)==5)y=@01b0;
  $  095.电池包进水口温度                              $    $  degC     $    $  ANS063.BYTE004  $  y=x*0.5-40;
  $  096.预刷写控制器编号                              $    $  /        $    $  ANS064.BYTE004  $  if(x<0x0F)y=@0696;else if(x>=0x0F && x<=0xFC)y=@0162;else if(x==0xFD)y=@0697;else if(x==0xFE)y=@0698;else if(x==0xFF)y=@0008;
  $  097.BMS(电池管理系统)请求退出强制电动模式         $    $  /        $    $  ANS065.BYTE004  $  if(x==0)y=@068e;else if(x==1)y=@068f;
  $  098.BMS(电池管理系统) crank能力标志位             $    $  /        $    $  ANS066.BYTE004  $  if((x&0x01)==0)y=@0690;else if((x&0x01)==1)y=@0691;;
  $  099.电压_模组_1_电芯_1                            $    $  mV       $    $  ANS067.BYTE004  $  y=x1*256+x2;
  $  100.电压_模组_1_电芯_2                            $    $  mV       $    $  ANS067.BYTE006  $  y=x1*256+x2;
  $  101.电压_模组_1_电芯_3                            $    $  mV       $    $  ANS067.BYTE008  $  y=x1*256+x2;
  $  102.电压_模组_1_电芯_4                            $    $  mV       $    $  ANS067.BYTE010  $  y=x1*256+x2;
  $  103.电压_模组_1_电芯_5                            $    $  mV       $    $  ANS067.BYTE012  $  y=x1*256+x2;
  $  104.电压_模组_1_电芯_6                            $    $  mV       $    $  ANS067.BYTE014  $  y=x1*256+x2;
  $  105.电压_模组_1_电芯_7                            $    $  mV       $    $  ANS067.BYTE016  $  y=x1*256+x2;
  $  106.电压_模组_1_电芯_8                            $    $  mV       $    $  ANS067.BYTE018  $  y=x1*256+x2;
  $  107.电压_模组_1_电芯_9                            $    $  mV       $    $  ANS067.BYTE020  $  y=x1*256+x2;
  $  108.电压_模组_1_电芯_10                           $    $  mV       $    $  ANS067.BYTE022  $  y=x1*256+x2;
  $  109.电压_模组_1_电芯_11                           $    $  mV       $    $  ANS067.BYTE024  $  y=x1*256+x2;
  $  110.电压_模组_1_电芯_12                           $    $  mV       $    $  ANS067.BYTE026  $  y=x1*256+x2;
  $  111.电压_模组_2_电芯_1                            $    $  mV       $    $  ANS068.BYTE004  $  y=x1*256+x2;
  $  112.电压_模组_2_电芯_2                            $    $  mV       $    $  ANS068.BYTE006  $  y=x1*256+x2;
  $  113.电压_模组_2_电芯_3                            $    $  mV       $    $  ANS068.BYTE008  $  y=x1*256+x2;
  $  114.电压_模组_2_电芯_4                            $    $  mV       $    $  ANS068.BYTE010  $  y=x1*256+x2;
  $  115.电压_模组_2_电芯_5                            $    $  mV       $    $  ANS068.BYTE012  $  y=x1*256+x2;
  $  116.电压_模组_2_电芯_6                            $    $  mV       $    $  ANS068.BYTE014  $  y=x1*256+x2;
  $  117.电压_模组_2_电芯_7                            $    $  mV       $    $  ANS068.BYTE016  $  y=x1*256+x2;
  $  118.电压_模组_2_电芯_8                            $    $  mV       $    $  ANS068.BYTE018  $  y=x1*256+x2;
  $  119.电压_模组_2_电芯_9                            $    $  mV       $    $  ANS068.BYTE020  $  y=x1*256+x2;
  $  120.电压_模组_2_电芯_10                           $    $  mV       $    $  ANS068.BYTE022  $  y=x1*256+x2;
  $  121.电压_模组_2_电芯_11                           $    $  mV       $    $  ANS068.BYTE024  $  y=x1*256+x2;
  $  122.电压_模组_2_电芯_12                           $    $  mV       $    $  ANS068.BYTE026  $  y=x1*256+x2;
  $  123.电压_模组_3_电芯_1                            $    $  mV       $    $  ANS069.BYTE004  $  y=x1*256+x2;
  $  124.电压_模组_3_电芯_2                            $    $  mV       $    $  ANS069.BYTE006  $  y=x1*256+x2;
  $  125.电压_模组_3_电芯_3                            $    $  mV       $    $  ANS069.BYTE008  $  y=x1*256+x2;
  $  126.电压_模组_3_电芯_4                            $    $  mV       $    $  ANS069.BYTE010  $  y=x1*256+x2;
  $  127.电压_模组_3_电芯_5                            $    $  mV       $    $  ANS069.BYTE012  $  y=x1*256+x2;
  $  128.电压_模组_3_电芯_6                            $    $  mV       $    $  ANS069.BYTE014  $  y=x1*256+x2;
  $  129.电压_模组_3_电芯_7                            $    $  mV       $    $  ANS069.BYTE016  $  y=x1*256+x2;
  $  130.电压_模组_3_电芯_8                            $    $  mV       $    $  ANS069.BYTE018  $  y=x1*256+x2;
  $  131.电压_模组_3_电芯_9                            $    $  mV       $    $  ANS069.BYTE020  $  y=x1*256+x2;
  $  132.电压_模组_3_电芯_10                           $    $  mV       $    $  ANS069.BYTE022  $  y=x1*256+x2;
  $  133.电压_模组_3_电芯_11                           $    $  mV       $    $  ANS069.BYTE024  $  y=x1*256+x2;
  $  134.电压_模组_3_电芯_12                           $    $  mV       $    $  ANS069.BYTE026  $  y=x1*256+x2;
  $  135.电压_模组_4_电芯_1                            $    $  mV       $    $  ANS070.BYTE004  $  y=x1*256+x2;
  $  136.电压_模组_4_电芯_2                            $    $  mV       $    $  ANS070.BYTE006  $  y=x1*256+x2;
  $  137.电压_模组_4_电芯_3                            $    $  mV       $    $  ANS070.BYTE008  $  y=x1*256+x2;
  $  138.电压_模组_4_电芯_4                            $    $  mV       $    $  ANS070.BYTE010  $  y=x1*256+x2;
  $  139.电压_模组_4_电芯_5                            $    $  mV       $    $  ANS070.BYTE012  $  y=x1*256+x2;
  $  140.电压_模组_4_电芯_6                            $    $  mV       $    $  ANS070.BYTE014  $  y=x1*256+x2;
  $  141.电压_模组_4_电芯_7                            $    $  mV       $    $  ANS070.BYTE016  $  y=x1*256+x2;
  $  142.电压_模组_4_电芯_8                            $    $  mV       $    $  ANS070.BYTE018  $  y=x1*256+x2;
  $  143.电压_模组_4_电芯_9                            $    $  mV       $    $  ANS070.BYTE020  $  y=x1*256+x2;
  $  144.电压_模组_4_电芯_10                           $    $  mV       $    $  ANS070.BYTE022  $  y=x1*256+x2;
  $  145.电压_模组_4_电芯_11                           $    $  mV       $    $  ANS070.BYTE024  $  y=x1*256+x2;
  $  146.电压_模组_4_电芯_12                           $    $  mV       $    $  ANS070.BYTE026  $  y=x1*256+x2;
  $  147.电压_模组_5_电芯_1                            $    $  mV       $    $  ANS071.BYTE004  $  y=x1*256+x2;
  $  148.电压_模组_5_电芯_2                            $    $  mV       $    $  ANS071.BYTE006  $  y=x1*256+x2;
  $  149.电压_模组_5_电芯_3                            $    $  mV       $    $  ANS071.BYTE008  $  y=x1*256+x2;
  $  150.电压_模组_5_电芯_4                            $    $  mV       $    $  ANS071.BYTE010  $  y=x1*256+x2;
  $  151.电压_模组_5_电芯_5                            $    $  mV       $    $  ANS071.BYTE012  $  y=x1*256+x2;
  $  152.电压_模组_5_电芯_6                            $    $  mV       $    $  ANS071.BYTE014  $  y=x1*256+x2;
  $  153.电压_模组_5_电芯_7                            $    $  mV       $    $  ANS071.BYTE016  $  y=x1*256+x2;
  $  154.电压_模组_5_电芯_8                            $    $  mV       $    $  ANS071.BYTE018  $  y=x1*256+x2;
  $  155.电压_模组_5_电芯_9                            $    $  mV       $    $  ANS071.BYTE020  $  y=x1*256+x2;
  $  156.电压_模组_5_电芯_10                           $    $  mV       $    $  ANS071.BYTE022  $  y=x1*256+x2;
  $  157.电压_模组_5_电芯_11                           $    $  mV       $    $  ANS071.BYTE024  $  y=x1*256+x2;
  $  158.电压_模组_5_电芯_12                           $    $  mV       $    $  ANS071.BYTE026  $  y=x1*256+x2;
  $  159.电压_模组_6_电芯_1                            $    $  mV       $    $  ANS072.BYTE004  $  y=x1*256+x2;
  $  160.电压_模组_6_电芯_2                            $    $  mV       $    $  ANS072.BYTE006  $  y=x1*256+x2;
  $  161.电压_模组_6_电芯_3                            $    $  mV       $    $  ANS072.BYTE008  $  y=x1*256+x2;
  $  162.电压_模组_6_电芯_4                            $    $  mV       $    $  ANS072.BYTE010  $  y=x1*256+x2;
  $  163.电压_模组_6_电芯_5                            $    $  mV       $    $  ANS072.BYTE012  $  y=x1*256+x2;
  $  164.电压_模组_6_电芯_6                            $    $  mV       $    $  ANS072.BYTE014  $  y=x1*256+x2;
  $  165.电压_模组_6_电芯_7                            $    $  mV       $    $  ANS072.BYTE016  $  y=x1*256+x2;
  $  166.电压_模组_6_电芯_8                            $    $  mV       $    $  ANS072.BYTE018  $  y=x1*256+x2;
  $  167.电压_模组_6_电芯_9                            $    $  mV       $    $  ANS072.BYTE020  $  y=x1*256+x2;
  $  168.电压_模组_6_电芯_10                           $    $  mV       $    $  ANS072.BYTE022  $  y=x1*256+x2;
  $  169.电压_模组_6_电芯_11                           $    $  mV       $    $  ANS072.BYTE024  $  y=x1*256+x2;
  $  170.电压_模组_6_电芯_12                           $    $  mV       $    $  ANS072.BYTE026  $  y=x1*256+x2;
  $  171.电压_模组_7_电芯_1                            $    $  mV       $    $  ANS073.BYTE004  $  y=x1*256+x2;
  $  172.电压_模组_7_电芯_2                            $    $  mV       $    $  ANS073.BYTE006  $  y=x1*256+x2;
  $  173.电压_模组_7_电芯_3                            $    $  mV       $    $  ANS073.BYTE008  $  y=x1*256+x2;
  $  174.电压_模组_7_电芯_4                            $    $  mV       $    $  ANS073.BYTE010  $  y=x1*256+x2;
  $  175.电压_模组_7_电芯_5                            $    $  mV       $    $  ANS073.BYTE012  $  y=x1*256+x2;
  $  176.电压_模组_7_电芯_6                            $    $  mV       $    $  ANS073.BYTE014  $  y=x1*256+x2;
  $  177.电压_模组_7_电芯_7                            $    $  mV       $    $  ANS073.BYTE016  $  y=x1*256+x2;
  $  178.电压_模组_7_电芯_8                            $    $  mV       $    $  ANS073.BYTE018  $  y=x1*256+x2;
  $  179.电压_模组_7_电芯_9                            $    $  mV       $    $  ANS073.BYTE020  $  y=x1*256+x2;
  $  180.电压_模组_7_电芯_10                           $    $  mV       $    $  ANS073.BYTE022  $  y=x1*256+x2;
  $  181.电压_模组_7_电芯_11                           $    $  mV       $    $  ANS073.BYTE024  $  y=x1*256+x2;
  $  182.电压_模组_7_电芯_12                           $    $  mV       $    $  ANS073.BYTE026  $  y=x1*256+x2;
  $  183.1号模组软件版本号                             $    $  /        $    $  ANS074.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  184.2号模组软件版本号                             $    $  /        $    $  ANS074.BYTE011  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  185.3号模组软件版本号                             $    $  /        $    $  ANS074.BYTE018  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  186.4号模组软件版本号                             $    $  /        $    $  ANS074.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  187.5模组软件版本号                               $    $  /        $    $  ANS074.BYTE032  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  188.6模组软件版本号                               $    $  /        $    $  ANS074.BYTE039  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  189.7模组软件版本号                               $    $  /        $    $  ANS074.BYTE046  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  190.1号模组硬件版本号                             $    $  /        $    $  ANS075.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  191.2号模组硬件版本号                             $    $  /        $    $  ANS075.BYTE019  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  192.3号模组硬件版本号                             $    $  /        $    $  ANS075.BYTE034  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  193.4号模组硬件版本号                             $    $  /        $    $  ANS075.BYTE049  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  194.5号模组硬件版本号                             $    $  /        $    $  ANS075.BYTE064  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  195.6号模组硬件版本号                             $    $  /        $    $  ANS075.BYTE079  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  196.7号模组硬件版本号                             $    $  /        $    $  ANS075.BYTE094  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  197.最近一次成功上高压后，高压下电时的时间        $    $  /        $    $  ANS076.BYTE004  $  HEX(x1,x2,x3,x4,x5,x6,x7);
  $  198.最近一次成功上高压后，高压下电时的SOC值       $    $  %        $    $  ANS077.BYTE004  $  y=(x1*256+x2)*0.1;
  $  199.整车运行状态                                  $    $  /        $    $  ANS078.BYTE004  $  if((x&0x0f)==0)y=@0318;else if((x&0x0f)==1)y=@069b;else if((x&0x0f)==2)y=@069c;else if((x&0x0f)==3)y=@069d;else if((x&0x0f)==4)y=@069e;else if((x&0x0f)==5)y=@069f;else if((x&0x0f)==6)y=@06a0;else if((x&0x0f)==7)y=@06a1;else if((x&0x0f)==8)y=@06a2;else if((x&0x0f)==0x0F)y=@0008;
  $  200.发动机状态                                    $    $  /        $    $  ANS079.BYTE004  $  if((x&0x07)==0)y=@0204;else if((x&0x07)==1)y=@06a3;else if((x&0x07)==2)y=@0162;else if((x&0x07)==3)y=@0027;else if((x&0x07)==4)y=@0162;else if((x&0x07)==5)y=@0162;else if((x&0x07)==6)y=@0162;else if((x&0x07)==7)y=@01b0;
  $  201.车钥匙档位                                    $    $  /        $    $  ANS080.BYTE004  $  if((x&0x07)==0)y=@0415;else if((x&0x07)==1)y=@0416;else if((x&0x07)==2)y=@0417;else if((x&0x07)==3)y=@0699;else if((x&0x07)==4)y=@0494;else if((x&0x07)==5)y=@069a;
  $  202.电流采集板硬件版本号                          $    $  /        $    $  ANS081.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $  203.电流采集板软件版本号                          $    $  /        $    $  ANS082.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $  204.编程次数                                      $    $  /        $    $  ANS083.BYTE004  $  HEX(x1);
  $  205.尝试编程次数                                  $    $  /        $    $  ANS084.BYTE004  $  HEX(x1);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
