
    车型ID：0841

    模拟：协议模拟-->0841

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B9

进入命令:

  $~  REQ000:7B1 02 10 01 00 00 00 00 00       $~  ANS000:7B9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B1 02 3E 00 00 00 00 00 00       $!  ANS000:7B9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B1 03 19 02 09 00 00 00 00       $#  ANS000:7B9 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/a7000000


  $#  01.读故障码库
  $#  REQ000:7B1 02 19 0A 00 00 00 00 00       $#  ANS000:7B9 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/a7000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B1 04 14 FF FF FF 00 00 00       $$  ANS000:7B9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B1 03 22 F1 12 00 00 00 00       $%  ANS000:7B9 03 22 F1 12 00 00 00 00
  $%  REQ001:7B1 03 22 F1 80 00 00 00 00       $%  ANS001:7B9 03 22 F1 80 00 00 00 00
  $%  REQ002:7B1 03 22 F1 87 00 00 00 00       $%  ANS002:7B9 03 22 F1 87 00 00 00 00
  $%  REQ003:7B1 03 22 F1 8A 00 00 00 00       $%  ANS003:7B9 03 22 F1 8A 00 00 00 00
  $%  REQ004:7B1 03 22 F1 8B 00 00 00 00       $%  ANS004:7B9 03 22 F1 8B 00 00 00 00
  $%  REQ005:7B1 03 22 F1 8C 00 00 00 00       $%  ANS005:7B9 03 22 F1 8C 00 00 00 00
  $%  REQ006:7B1 03 22 F1 90 00 00 00 00       $%  ANS006:7B9 03 22 F1 90 00 00 00 00
  $%  REQ007:7B1 03 22 F1 93 00 00 00 00       $%  ANS007:7B9 03 22 F1 93 00 00 00 00
  $%  REQ008:7B1 03 22 F1 95 00 00 00 00       $%  ANS008:7B9 03 22 F1 95 00 00 00 00
  $%  REQ009:7B1 03 22 F1 98 00 00 00 00       $%  ANS009:7B9 03 22 F1 98 00 00 00 00
  $%  REQ010:7B1 03 22 F1 99 00 00 00 00       $%  ANS010:7B9 03 22 F1 99 00 00 00 00
  $%  REQ011:7B1 03 22 F1 9D 00 00 00 00       $%  ANS011:7B9 03 22 F1 9D 00 00 00 00
  $%  REQ012:7B1 03 22 F1 82 00 00 00 00       $%  ANS012:7B9 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:引导程序软件识别号:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                                      $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)刷写日期:                     $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  011:ECU(电子控制器)安装日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:标定软件版本号:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B1 03 22 DF 00 00 00 00 00       $  ANS000:7B9 03 22 DF 00 00 00 00 00
  $  REQ001:7B1 03 22 DF 01 00 00 00 00       $  ANS001:7B9 03 22 DF 01 00 00 00 00
  $  REQ002:7B1 03 22 DF 04 00 00 00 00       $  ANS002:7B9 03 22 DF 04 00 00 00 00
  $  REQ003:7B1 03 22 4B 02 00 00 00 00       $  ANS003:7B9 03 22 4B 02 00 00 00 00
  $  REQ004:7B1 03 22 4B 03 00 00 00 00       $  ANS004:7B9 03 22 4B 03 00 00 00 00
  $  REQ005:7B1 03 22 4B 04 00 00 00 00       $  ANS005:7B9 03 22 4B 04 00 00 00 00
  $  REQ006:7B1 03 22 4B 05 00 00 00 00       $  ANS006:7B9 03 22 4B 05 00 00 00 00
  $  REQ007:7B1 03 22 4B 06 00 00 00 00       $  ANS007:7B9 03 22 4B 06 00 00 00 00
  $  REQ008:7B1 03 22 4B 07 00 00 00 00       $  ANS008:7B9 03 22 4B 07 00 00 00 00
  $  REQ009:7B1 03 22 4B 08 00 00 00 00       $  ANS009:7B9 03 22 4B 08 00 00 00 00
  $  REQ010:7B1 03 22 4B 09 00 00 00 00       $  ANS010:7B9 03 22 4B 09 00 00 00 00
  $  REQ011:7B1 03 22 4B 0A 00 00 00 00       $  ANS011:7B9 03 22 4B 0A 00 00 00 00
  $  REQ012:7B1 03 22 4B 0B 00 00 00 00       $  ANS012:7B9 03 22 4B 0B 00 00 00 00
  $  REQ013:7B1 03 22 4B 0C 00 00 00 00       $  ANS013:7B9 03 22 4B 0C 00 00 00 00
  $  REQ014:7B1 03 22 4B 0E 00 00 00 00       $  ANS014:7B9 03 22 4B 0E 00 00 00 00
  $  REQ015:7B1 03 22 4B 0F 00 00 00 00       $  ANS015:7B9 03 22 4B 0F 00 00 00 00
  $  REQ016:7B1 03 22 4B 10 00 00 00 00       $  ANS016:7B9 03 22 4B 10 00 00 00 00
  $  REQ017:7B1 03 22 4B 11 00 00 00 00       $  ANS017:7B9 03 22 4B 11 00 00 00 00
  $  REQ018:7B1 03 22 4B 13 00 00 00 00       $  ANS018:7B9 03 22 4B 13 00 00 00 00
  $  REQ019:7B1 03 22 4B 15 00 00 00 00       $  ANS019:7B9 03 22 4B 15 00 00 00 00
  $  REQ020:7B1 03 22 4B 17 00 00 00 00       $  ANS020:7B9 03 22 4B 17 00 00 00 00
  $  REQ021:7B1 03 22 4B 18 00 00 00 00       $  ANS021:7B9 03 22 4B 18 00 00 00 00
  $  REQ022:7B1 03 22 4B 19 00 00 00 00       $  ANS022:7B9 03 22 4B 19 00 00 00 00
  $  REQ023:7B1 03 22 4B 1C 00 00 00 00       $  ANS023:7B9 03 22 4B 1C 00 00 00 00
  $  REQ024:7B1 03 22 4B 1D 00 00 00 00       $  ANS024:7B9 03 22 4B 1D 00 00 00 00
  $  REQ025:7B1 03 22 4B 1E 00 00 00 00       $  ANS025:7B9 03 22 4B 1E 00 00 00 00
  $  REQ026:7B1 03 22 4B 1F 00 00 00 00       $  ANS026:7B9 03 22 4B 1F 00 00 00 00
  $  REQ027:7B1 03 22 4B 20 00 00 00 00       $  ANS027:7B9 03 22 4B 20 00 00 00 00
  $  REQ028:7B1 03 22 4B 21 00 00 00 00       $  ANS028:7B9 03 22 4B 21 00 00 00 00
  $  REQ029:7B1 03 22 4B 22 00 00 00 00       $  ANS029:7B9 03 22 4B 22 00 00 00 00
  $  REQ030:7B1 03 22 4B 23 00 00 00 00       $  ANS030:7B9 03 22 4B 23 00 00 00 00
  $  REQ031:7B1 03 22 4B 24 00 00 00 00       $  ANS031:7B9 03 22 4B 24 00 00 00 00
  $  REQ032:7B1 03 22 4B 25 00 00 00 00       $  ANS032:7B9 03 22 4B 25 00 00 00 00
  $  REQ033:7B1 03 22 4B 26 00 00 00 00       $  ANS033:7B9 03 22 4B 26 00 00 00 00
  $  REQ034:7B1 03 22 4B 27 00 00 00 00       $  ANS034:7B9 03 22 4B 27 00 00 00 00
  $  REQ035:7B1 03 22 4B 28 00 00 00 00       $  ANS035:7B9 03 22 4B 28 00 00 00 00
  $  REQ036:7B1 03 22 4B 29 00 00 00 00       $  ANS036:7B9 03 22 4B 29 00 00 00 00
  $  REQ037:7B1 03 22 4B 2A 00 00 00 00       $  ANS037:7B9 03 22 4B 2A 00 00 00 00
  $  REQ038:7B1 03 22 4B 2B 00 00 00 00       $  ANS038:7B9 03 22 4B 2B 00 00 00 00
  $  REQ039:7B1 03 22 4B 2C 00 00 00 00       $  ANS039:7B9 03 22 4B 2C 00 00 00 00
  $  REQ040:7B1 03 22 4B 2D 00 00 00 00       $  ANS040:7B9 03 22 4B 2D 00 00 00 00
  $  REQ041:7B1 03 22 4B 2E 00 00 00 00       $  ANS041:7B9 03 22 4B 2E 00 00 00 00
  $  REQ042:7B1 03 22 4B 35 00 00 00 00       $  ANS042:7B9 03 22 4B 35 00 00 00 00
  $  REQ043:7B1 03 22 4B 36 00 00 00 00       $  ANS043:7B9 03 22 4B 36 00 00 00 00
  $  REQ044:7B1 03 22 4B 37 00 00 00 00       $  ANS044:7B9 03 22 4B 37 00 00 00 00
  $  REQ045:7B1 03 22 4B 38 00 00 00 00       $  ANS045:7B9 03 22 4B 38 00 00 00 00
  $  REQ046:7B1 03 22 4B 39 00 00 00 00       $  ANS046:7B9 03 22 4B 39 00 00 00 00
  $  REQ047:7B1 03 22 4B 3A 00 00 00 00       $  ANS047:7B9 03 22 4B 3A 00 00 00 00
  $  REQ048:7B1 03 22 4B 3B 00 00 00 00       $  ANS048:7B9 03 22 4B 3B 00 00 00 00
  $  REQ049:7B1 03 22 4B 3C 00 00 00 00       $  ANS049:7B9 03 22 4B 3C 00 00 00 00
  $  REQ050:7B1 03 22 4B 3D 00 00 00 00       $  ANS050:7B9 03 22 4B 3D 00 00 00 00
  $  REQ051:7B1 03 22 4B 3E 00 00 00 00       $  ANS051:7B9 03 22 4B 3E 00 00 00 00
  $  REQ052:7B1 03 22 4B 3F 00 00 00 00       $  ANS052:7B9 03 22 4B 3F 00 00 00 00
  $  REQ053:7B1 03 22 4B 41 00 00 00 00       $  ANS053:7B9 03 22 4B 41 00 00 00 00
  $  REQ054:7B1 03 22 4B 42 00 00 00 00       $  ANS054:7B9 03 22 4B 42 00 00 00 00
  $  REQ055:7B1 03 22 4B 43 00 00 00 00       $  ANS055:7B9 03 22 4B 43 00 00 00 00
  $  REQ056:7B1 03 22 4B 44 00 00 00 00       $  ANS056:7B9 03 22 4B 44 00 00 00 00
  $  REQ057:7B1 03 22 4B 45 00 00 00 00       $  ANS057:7B9 03 22 4B 45 00 00 00 00
  $  REQ058:7B1 03 22 4B 46 00 00 00 00       $  ANS058:7B9 03 22 4B 46 00 00 00 00
  $  REQ059:7B1 03 22 4B 47 00 00 00 00       $  ANS059:7B9 03 22 4B 47 00 00 00 00
  $  REQ060:7B1 03 22 4B 48 00 00 00 00       $  ANS060:7B9 03 22 4B 48 00 00 00 00
  $  REQ061:7B1 03 22 4B 49 00 00 00 00       $  ANS061:7B9 03 22 4B 49 00 00 00 00
  $  REQ062:7B1 03 22 4B 58 00 00 00 00       $  ANS062:7B9 03 22 4B 58 00 00 00 00
  $  REQ063:7B1 03 22 4B 59 00 00 00 00       $  ANS063:7B9 03 22 4B 59 00 00 00 00
  $  REQ064:7B1 03 22 4B 5A 00 00 00 00       $  ANS064:7B9 03 22 4B 5A 00 00 00 00
  $  REQ065:7B1 03 22 4B 5B 00 00 00 00       $  ANS065:7B9 03 22 4B 5B 00 00 00 00
  $  REQ066:7B1 03 22 4B 5C 00 00 00 00       $  ANS066:7B9 03 22 4B 5C 00 00 00 00
  $  REQ067:7B1 03 22 4B 5D 00 00 00 00       $  ANS067:7B9 03 22 4B 5D 00 00 00 00
  $  REQ068:7B1 03 22 4B 5E 00 00 00 00       $  ANS068:7B9 03 22 4B 5E 00 00 00 00
  $  REQ069:7B1 03 22 4B 5F 00 00 00 00       $  ANS069:7B9 03 22 4B 5F 00 00 00 00
  $  REQ070:7B1 03 22 4B A8 00 00 00 00       $  ANS070:7B9 03 22 4B A8 00 00 00 00
  $  REQ071:7B1 03 22 4B A9 00 00 00 00       $  ANS071:7B9 03 22 4B A9 00 00 00 00
  $  REQ072:7B1 03 22 4B 63 00 00 00 00       $  ANS072:7B9 03 22 4B 63 00 00 00 00
  $  REQ073:7B1 03 22 4B 64 00 00 00 00       $  ANS073:7B9 03 22 4B 64 00 00 00 00
  $  REQ074:7B1 03 22 4B 65 00 00 00 00       $  ANS074:7B9 03 22 4B 65 00 00 00 00
  $  REQ075:7B1 03 22 4B 66 00 00 00 00       $  ANS075:7B9 03 22 4B 66 00 00 00 00
  $  REQ076:7B1 03 22 4B 67 00 00 00 00       $  ANS076:7B9 03 22 4B 67 00 00 00 00
  $  REQ077:7B1 03 22 4B 68 00 00 00 00       $  ANS077:7B9 03 22 4B 68 00 00 00 00
  $  REQ078:7B1 03 22 4B 69 00 00 00 00       $  ANS078:7B9 03 22 4B 69 00 00 00 00
  $  REQ079:7B1 03 22 4B 6A 00 00 00 00       $  ANS079:7B9 03 22 4B 6A 00 00 00 00
  $  REQ080:7B1 03 22 4B 6B 00 00 00 00       $  ANS080:7B9 03 22 4B 6B 00 00 00 00
  $  REQ081:7B1 03 22 4B 6C 00 00 00 00       $  ANS081:7B9 03 22 4B 6C 00 00 00 00
  $  REQ082:7B1 03 22 4B C0 00 00 00 00       $  ANS082:7B9 03 22 4B C0 00 00 00 00
  $  REQ083:7B1 03 22 4B C1 00 00 00 00       $  ANS083:7B9 03 22 4B C1 00 00 00 00
  $  REQ084:7B1 03 22 4B C2 00 00 00 00       $  ANS084:7B9 03 22 4B C2 00 00 00 00
  $  REQ085:7B1 03 22 4B C3 00 00 00 00       $  ANS085:7B9 03 22 4B C3 00 00 00 00
  $  REQ086:7B1 03 22 4B C4 00 00 00 00       $  ANS086:7B9 03 22 4B C4 00 00 00 00
  $  REQ087:7B1 03 22 4B C5 00 00 00 00       $  ANS087:7B9 03 22 4B C5 00 00 00 00
  $  REQ088:7B1 03 22 4B C6 00 00 00 00       $  ANS088:7B9 03 22 4B C6 00 00 00 00
  $  REQ089:7B1 03 22 4B C7 00 00 00 00       $  ANS089:7B9 03 22 4B C7 00 00 00 00
  $  REQ090:7B1 03 22 4B C8 00 00 00 00       $  ANS090:7B9 03 22 4B C8 00 00 00 00
  $  REQ091:7B1 03 22 4B C9 00 00 00 00       $  ANS091:7B9 03 22 4B C9 00 00 00 00
  $  REQ092:7B1 03 22 4B CA 00 00 00 00       $  ANS092:7B9 03 22 4B CA 00 00 00 00
  $  REQ093:7B1 03 22 4B CB 00 00 00 00       $  ANS093:7B9 03 22 4B CB 00 00 00 00
  $  REQ094:7B1 03 22 4B CC 00 00 00 00       $  ANS094:7B9 03 22 4B CC 00 00 00 00
  $  REQ095:7B1 03 22 4B CD 00 00 00 00       $  ANS095:7B9 03 22 4B CD 00 00 00 00
  $  REQ096:7B1 03 22 4B CE 00 00 00 00       $  ANS096:7B9 03 22 4B CE 00 00 00 00
  $  REQ097:7B1 03 22 4B CF 00 00 00 00       $  ANS097:7B9 03 22 4B CF 00 00 00 00
  $  REQ098:7B1 03 22 4B D0 00 00 00 00       $  ANS098:7B9 03 22 4B D0 00 00 00 00
  $  REQ099:7B1 03 22 4B D1 00 00 00 00       $  ANS099:7B9 03 22 4B D1 00 00 00 00
  $  REQ100:7B1 03 22 4B D2 00 00 00 00       $  ANS100:7B9 03 22 4B D2 00 00 00 00
  $  REQ101:7B1 03 22 4B D3 00 00 00 00       $  ANS101:7B9 03 22 4B D3 00 00 00 00
  $  REQ102:7B1 03 22 4B D4 00 00 00 00       $  ANS102:7B9 03 22 4B D4 00 00 00 00
  $  REQ103:7B1 03 22 4B D5 00 00 00 00       $  ANS103:7B9 03 22 4B D5 00 00 00 00
  $  REQ104:7B1 03 22 4B D6 00 00 00 00       $  ANS104:7B9 03 22 4B D6 00 00 00 00
  $  REQ105:7B1 03 22 4B D7 00 00 00 00       $  ANS105:7B9 03 22 4B D7 00 00 00 00
  $  REQ106:7B1 03 22 4B D8 00 00 00 00       $  ANS106:7B9 03 22 4B D8 00 00 00 00
  $  REQ107:7B1 03 22 4B D9 00 00 00 00       $  ANS107:7B9 03 22 4B D9 00 00 00 00
  $  REQ108:7B1 03 22 4B DA 00 00 00 00       $  ANS108:7B9 03 22 4B DA 00 00 00 00
  $  REQ109:7B1 03 22 4B DB 00 00 00 00       $  ANS109:7B9 03 22 4B DB 00 00 00 00
  $  REQ110:7B1 03 22 4B DC 00 00 00 00       $  ANS110:7B9 03 22 4B DC 00 00 00 00
  $  REQ111:7B1 03 22 4B DD 00 00 00 00       $  ANS111:7B9 03 22 4B DD 00 00 00 00
  $  REQ112:7B1 03 22 4B DE 00 00 00 00       $  ANS112:7B9 03 22 4B DE 00 00 00 00
  $  REQ113:7B1 03 22 4B DF 00 00 00 00       $  ANS113:7B9 03 22 4B DF 00 00 00 00
  $  REQ114:7B1 03 22 4B E0 00 00 00 00       $  ANS114:7B9 03 22 4B E0 00 00 00 00

  $  000.ECU(电子控制器)供电电压                 $    $  V        $    $  ANS000.BYTE004  $  y=x1*0.1;
  $  001.车速                                    $    $  km/h     $    $  ANS001.BYTE004  $  y=INT(((x1<<8)+x2)*0.05625);
  $  002.故障里程                                $    $  km       $    $  ANS002.BYTE004  $  y=x1*0x10000+x2*0x100+x3;
  $  003.电池包版本号                            $    $  /        $    $  ANS003.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  004.电池包标称容量                          $    $  Ah       $    $  ANS004.BYTE004  $  y=(x1*256+x2)*0.1;
  $  005.电池包标称能量                          $    $  kWh      $    $  ANS005.BYTE004  $  y=(x1*256+x2)*0.1;
  $  006.标称电压                                $    $  V        $    $  ANS006.BYTE004  $  y=(x1*256+x2)*0.1;
  $  007.电池类型码                              $    $  /        $    $  ANS007.BYTE004  $  if(x==0x01) y=@04cc; else if(x==0x02) y=@04cd; else if(x==0x03) y=@04ce; else if(x==0x04) y=@04cf; else if(x==0x05) y=@04d0; else if(x==0x06) y=@04d1; else if(x==0x07) y=@04d2; else if(x==0xfc) y=@0951; else if(x==0xff) y=@0952; else y=@0220;
  $  008.Cell总数                                $    $  /        $    $  ANS008.BYTE004  $  y=x;
  $  009.Cell温度传感器总数                      $    $  /        $    $  ANS009.BYTE004  $  y=x;
  $  010.电池包单次放电容量                      $    $  Ah       $    $  ANS010.BYTE004  $  y=(x1*256+x2)*0.1;
  $  011.电池包单次充电容量                      $    $  Ah       $    $  ANS011.BYTE004  $  y=(x1*256+x2)*0.1;
  $  012.电池包累计放电容量                      $    $  Ah       $    $  ANS012.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.1;
  $  013.电池包累计充电容量                      $    $  Ah       $    $  ANS013.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.1;
  $  014.1#模组制造日期                          $    $  /        $    $  ANS014.BYTE004  $  HEX(x1,x2,x3,x4);
  $  015.2#模组制造日期                          $    $  /        $    $  ANS014.BYTE008  $  HEX(x1,x2,x3,x4);
  $  016.3#模组制造日期                          $    $  /        $    $  ANS014.BYTE012  $  HEX(x1,x2,x3,x4);
  $  017.4#模组制造日期                          $    $  /        $    $  ANS014.BYTE016  $  HEX(x1,x2,x3,x4);
  $  018.5#模组制造日期                          $    $  /        $    $  ANS014.BYTE020  $  HEX(x1,x2,x3,x4);
  $  019.6#模组制造日期                          $    $  /        $    $  ANS014.BYTE024  $  HEX(x1,x2,x3,x4);
  $  020.7#模组制造日期                          $    $  /        $    $  ANS014.BYTE028  $  HEX(x1,x2,x3,x4);
  $  021.主控板供应商代码                        $    $  /        $    $  ANS015.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  022.主控板序列号                            $    $  /        $    $  ANS016.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  023.主控板制造日期                          $    $  /        $    $  ANS017.BYTE004  $  HEX(x1,x2,x3,x4);
  $  024.VCU(整车控制器)充电允许                 $    $  /        $    $  ANS018.BYTE004  $  if(x==0x00)y=@0e61;else if(x==0x01)y=@0670;else if(x==0x02 || x==0x03)y=@0209;
  $  025.BMS(电池管理系统)状态                   $    $  /        $    $  ANS019.BYTE004  $  switxh(x)0x00:y=@00e8;0x01:y=@0318;0x02:y=@05cb;0x03:y=@0e62;0x04:y=@0e63;0x06:y=@03e3;0x07:y=@0e64;0x08:y=@09ab;0x09:y=@0e65;0x0a:y=@0e66;0x0b:y=@03db;0x0c:y=@0589;0x0d:y=@04a1;default:y=@0209;
  $  026.BMS(电池管理系统)充电故障等级           $    $  /        $    $  ANS020.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@010f;0x02:y=@0129;0x03:y=@03d9;0x05:y=@0e6a;0x06:y=@0e6b;default:y=@0209;
  $  027.BMS(电池管理系统)放电回路预充状态       $    $  /        $    $  ANS021.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@010f;0x02:y=@0129;0x03:y=@03d9;0x04:y=@095d;0x05:y=@0e51;0x06:y=@0e52;default:y=@0209;
  $  028.BMS(电池管理系统)充电回路预充状态       $    $  /        $    $  ANS022.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@06af;0x02:y=@06b0;0x03:y=@03e6;0x04:y=@06b1;default:y=@0209;
  $  029.1#模组1#温度值                          $    $  degC     $    $  ANS023.BYTE004  $  y=x*0.5-40;
  $  030.1#模组2#温度值                          $    $  degC     $    $  ANS023.BYTE005  $  y=x*0.5-40;
  $  031.2#模组1#温度值                          $    $  degC     $    $  ANS023.BYTE006  $  y=x*0.5-40;
  $  032.2#模组2#温度值                          $    $  degC     $    $  ANS023.BYTE007  $  y=x*0.5-40;
  $  033.3#模组1#温度值                          $    $  degC     $    $  ANS023.BYTE008  $  y=x*0.5-40;
  $  034.3#模组2#温度值                          $    $  degC     $    $  ANS023.BYTE009  $  y=x*0.5-40;
  $  035.4#模组1#温度值                          $    $  degC     $    $  ANS023.BYTE010  $  y=x*0.5-40;
  $  036.4#模组2#温度值                          $    $  degC     $    $  ANS023.BYTE011  $  y=x*0.5-40;
  $  037.5#模组1#温度值                          $    $  degC     $    $  ANS023.BYTE012  $  y=x*0.5-40;
  $  038.5#模组2#温度值                          $    $  degC     $    $  ANS023.BYTE013  $  y=x*0.5-40;
  $  039.6#模组1#温度值                          $    $  degC     $    $  ANS023.BYTE014  $  y=x*0.5-40;
  $  040.6#模组2#温度值                          $    $  degC     $    $  ANS023.BYTE015  $  y=x*0.5-40;
  $  041.7#模组1#温度值                          $    $  degC     $    $  ANS023.BYTE016  $  y=x*0.5-40;
  $  042.7#模组2#温度值                          $    $  degC     $    $  ANS023.BYTE017  $  y=x*0.5-40;
  $  043.最大电芯电压                            $    $  V        $    $  ANS024.BYTE004  $  y=(x1*256+x2)*0.001;
  $  044.最大电芯电压的电芯号                    $    $  /        $    $  ANS025.BYTE004  $  y=x;
  $  045.最小电芯电压                            $    $  V        $    $  ANS026.BYTE004  $  y=(x1*256+x2)*0.001;
  $  046.最小电芯电压的电芯号                    $    $  /        $    $  ANS027.BYTE004  $  y=x;
  $  047.电池包总电压                            $    $  V        $    $  ANS028.BYTE004  $  y=(x1*256+x2)*0.1;
  $  048.电池包总电流                            $    $  A        $    $  ANS029.BYTE004  $  y=(x1*256+x2)*0.1-500;
  $  049.电池包最高温度                          $    $  degC     $    $  ANS030.BYTE004  $  y=x*0.5-40;
  $  050.电池包最高温度的温度传感器号            $    $  /        $    $  ANS031.BYTE004  $  y=x;
  $  051.电池包最低温度                          $    $  degC     $    $  ANS032.BYTE004  $  y=x*0.5-40;
  $  052.电池包最低温度的温度传感器号            $    $  /        $    $  ANS033.BYTE004  $  y=x;
  $  053.绝缘电阻值                              $    $  Kohm     $    $  ANS034.BYTE004  $  y=x1*256+x2;
  $  054.绝缘监测状态                            $    $  /        $    $  ANS035.BYTE004  $  switxh(x)0x00:y=@0e67;0x01:y=@0e68;0x02:y=@0e69;default:y=@0209;
  $  055.整车高压互锁状态                        $    $  /        $    $  ANS036.BYTE004  $  switxh(x)0x00:y=@06b7;0x01:y=@06b8;default:y=@0209;
  $  056.主正继电器状态                          $    $  /        $    $  ANS037.BYTE004  $  if(0==((x>>0)&1) && 0==((x>>1)&1))y=@0001;else if(1==((x>>0)&1) && 0==((x>>1)&1))y=@0000;else if(0==((x>>0)&1) && 1==((x>>1)&1))y=@0e78;
  $  057.主负继电器状态                          $    $  /        $    $  ANS037.BYTE004  $  if(0==((x>>2)&1) && 0==((x>>3)&1))y=@0001;else if(1==((x>>2)&1) && 0==((x>>3)&1))y=@0000;else if(0==((x>>2)&1) && 1==((x>>3)&1))y=@068c;
  $  058.预充继电器状态                          $    $  /        $    $  ANS037.BYTE004  $  if(0==((x>>4)&1) && 0==((x>>5)&1))y=@0001;else if(1==((x>>4)&1) && 0==((x>>5)&1))y=@0000;
  $  059.充电继电器状态                          $    $  /        $    $  ANS037.BYTE004  $  if(0==((x>>6)&1) && 0==((x>>7)&1))y=@0001;else if(1==((x>>6)&1) && 0==((x>>7)&1))y=@0000;else if(0==((x>>6)&1) && 1==((x>>7)&1))y=@0e78;
  $  060.充电预充继电器状态                      $    $  /        $    $  ANS037.BYTE005  $  if(0==((x>>0)&1) && 0==((x>>1)&1))y=@0001;else if(1==((x>>0)&1) && 0==((x>>1)&1))y=@0000;
  $  061.充电机实际工作状态                      $    $  /        $    $  ANS038.BYTE004  $  switxh(x)0x00:y=@0209;0x01:y=@0e71;0x02:y=@0e72;0x03:y=@0b73;0x04:y=@03d6;0x05:y=@05e4;0x06:y=@0b74;0x07:y=@0b75;0x08:y=@0b76;0x09:y=@03d9;0x0A:y=@068b;0x0B:y=@0e73;0x0C:y=@0e74;
  $  062.充电机错误状态                          $    $  /        $    $  ANS039.BYTE004  $  switxh(x)0x00:y=@0481;0x01:y=@0e75;0x02:y=@0e76;0x03:y=@0e77;
  $  063.充电机输出电流                          $    $  A        $    $  ANS040.BYTE004  $  y=(x1*256+x2)*0.1;
  $  064.充电机输出电压                          $    $  V        $    $  ANS041.BYTE004  $  y=x1*256+x2;
  $  065.电池荷电状态                            $    $  %        $    $  ANS042.BYTE004  $  y=(x1*256+x2)*0.1;
  $  066.电池显示剩余电量                        $    $  %        $    $  ANS043.BYTE004  $  y=(x1*256+x2)*0.1;
  $  067.电池健康度                              $    $  %        $    $  ANS044.BYTE004  $  y=(x1*256+x2)*0.1;
  $  068.剩余能量                                $    $  Kwh      $    $  ANS045.BYTE004  $  y=(x1*256+x2)*0.1;
  $  069.允许的持续放电功率                      $    $  kW       $    $  ANS046.BYTE004  $  y=x;
  $  070.允许的峰值放电功率                      $    $  kW       $    $  ANS047.BYTE004  $  y=x;
  $  071.允许的持续充电功率                      $    $  kW       $    $  ANS048.BYTE004  $  y=x;
  $  072.允许的峰值充电功率                      $    $  kW       $    $  ANS049.BYTE004  $  y=x;
  $  073.电池单体最高容量                        $    $  Ah       $    $  ANS050.BYTE004  $  y=(x1*256+x2)*0.1;
  $  074.电池单体最低容量                        $    $  Ah       $    $  ANS051.BYTE004  $  y=(x1*256+x2)*0.1;
  $  075.空调对电池水泵请求的反馈                $    $  %        $    $  ANS052.BYTE004  $  y=x;
  $  076.充电枪CC状态                            $    $  /        $    $  ANS053.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@0240;0x02:y=@0e6c;0x03:y=@0e6d;
  $  077.充电机CP连接状态                        $    $  /        $    $  ANS054.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@0e6e;0x02:y=@0e6f;0x03:y=@0e70;0x07:y=@063e;
  $  078.充电允许指令                            $    $  /        $    $  ANS055.BYTE004  $  switxh(x)0x00:y=@012f;0x04:y=@0422;0x05:y=@095a;0x0A:y=@0e5a;0x0B:y=@0e5b;0x0C:y=@0e5c;default:y=@0209;
  $  079.BMS(电池管理系统)请求的充电电流         $    $  A        $    $  ANS056.BYTE004  $  y=(x1*256+x2)*0.1;
  $  080.BMS(电池管理系统)请求的充电电压         $    $  V        $    $  ANS057.BYTE004  $  y=(x1*256+x2)*0.1;
  $  081.BMS(电池管理系统)热管理请求             $    $  /        $    $  ANS058.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@08ea;0x02:y=@0e5d;default:y=@0209;
  $  082.AC(空调)热管理应答                      $    $  /        $    $  ANS059.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@08ea;0x02:y=@0693;0x03:y=@0e56;0x04:y=@0e57;0x05:y=@0e58;0x06:y=@07a3;default:y=@0209;
  $  083.电池包进水口温度                        $    $  degC     $    $  ANS060.BYTE004  $  y=x*0.5-40;
  $  084.预刷写控制器编号                        $    $  /        $    $  ANS061.BYTE004  $  if(x>=0x00 && x<=0x0E)y=@0e59;else if(x>=0x0F && x<=0xFC)y=@0209;else if(0xFD==x)y=@0697;else if(0xFE==x)y=@0698;else if(0xFF==x)y=@0132;
  $  085.发动机状态                              $    $  /        $    $  ANS062.BYTE004  $  switxh(x)0x00:y=@0390;0x01:y=@0e55;0x02:y=@06dc;0x03:y=@0373;0x04:y=@0209;0x05:y=@0209;0x06:y=@0421;0x07:y=@0132;
  $  086.电压_模组_1_电芯_1                      $    $  V        $    $  ANS063.BYTE004  $  y=(x1*256+x2)*0.001;
  $  087.电压_模组_1_电芯_2                      $    $  V        $    $  ANS063.BYTE006  $  y=(x1*256+x2)*0.001;
  $  088.电压_模组_1_电芯_3                      $    $  V        $    $  ANS063.BYTE008  $  y=(x1*256+x2)*0.001;
  $  089.电压_模组_1_电芯_4                      $    $  V        $    $  ANS063.BYTE010  $  y=(x1*256+x2)*0.001;
  $  090.电压_模组_1_电芯_5                      $    $  V        $    $  ANS063.BYTE012  $  y=(x1*256+x2)*0.001;
  $  091.电压_模组_1_电芯_6                      $    $  V        $    $  ANS063.BYTE014  $  y=(x1*256+x2)*0.001;
  $  092.电压_模组_1_电芯_7                      $    $  V        $    $  ANS063.BYTE016  $  y=(x1*256+x2)*0.001;
  $  093.电压_模组_1_电芯_8                      $    $  V        $    $  ANS063.BYTE018  $  y=(x1*256+x2)*0.001;
  $  094.电压_模组_1_电芯_9                      $    $  V        $    $  ANS063.BYTE020  $  y=(x1*256+x2)*0.001;
  $  095.电压_模组_1_电芯_10                     $    $  V        $    $  ANS063.BYTE022  $  y=(x1*256+x2)*0.001;
  $  096.电压_模组_2_电芯_1                      $    $  V        $    $  ANS064.BYTE004  $  y=(x1*256+x2)*0.001;
  $  097.电压_模组_2_电芯_2                      $    $  V        $    $  ANS064.BYTE006  $  y=(x1*256+x2)*0.001;
  $  098.电压_模组_2_电芯_3                      $    $  V        $    $  ANS064.BYTE008  $  y=(x1*256+x2)*0.001;
  $  099.电压_模组_2_电芯_4                      $    $  V        $    $  ANS064.BYTE010  $  y=(x1*256+x2)*0.001;
  $  100.电压_模组_2_电芯_5                      $    $  V        $    $  ANS064.BYTE012  $  y=(x1*256+x2)*0.001;
  $  101.电压_模组_2_电芯_6                      $    $  V        $    $  ANS064.BYTE014  $  y=(x1*256+x2)*0.001;
  $  102.电压_模组_2_电芯_7                      $    $  V        $    $  ANS064.BYTE016  $  y=(x1*256+x2)*0.001;
  $  103.电压_模组_2_电芯_8                      $    $  V        $    $  ANS064.BYTE018  $  y=(x1*256+x2)*0.001;
  $  104.电压_模组_2_电芯_9                      $    $  V        $    $  ANS064.BYTE020  $  y=(x1*256+x2)*0.001;
  $  105.电压_模组_2_电芯_10                     $    $  V        $    $  ANS064.BYTE022  $  y=(x1*256+x2)*0.001;
  $  106.电压_模组_2_电芯_11                     $    $  V        $    $  ANS064.BYTE024  $  y=(x1*256+x2)*0.001;
  $  107.电压_模组_2_电芯_12                     $    $  V        $    $  ANS064.BYTE026  $  y=(x1*256+x2)*0.001;
  $  108.电压_模组_3_电芯_1                      $    $  V        $    $  ANS065.BYTE004  $  y=(x1*256+x2)*0.001;
  $  109.电压_模组_3_电芯_2                      $    $  V        $    $  ANS065.BYTE006  $  y=(x1*256+x2)*0.001;
  $  110.电压_模组_3_电芯_3                      $    $  V        $    $  ANS065.BYTE008  $  y=(x1*256+x2)*0.001;
  $  111.电压_模组_3_电芯_4                      $    $  V        $    $  ANS065.BYTE010  $  y=(x1*256+x2)*0.001;
  $  112.电压_模组_3_电芯_5                      $    $  V        $    $  ANS065.BYTE012  $  y=(x1*256+x2)*0.001;
  $  113.电压_模组_3_电芯_6                      $    $  V        $    $  ANS065.BYTE014  $  y=(x1*256+x2)*0.001;
  $  114.电压_模组_3_电芯_7                      $    $  V        $    $  ANS065.BYTE016  $  y=(x1*256+x2)*0.001;
  $  115.电压_模组_3_电芯_8                      $    $  V        $    $  ANS065.BYTE018  $  y=(x1*256+x2)*0.001;
  $  116.电压_模组_3_电芯_9                      $    $  V        $    $  ANS065.BYTE020  $  y=(x1*256+x2)*0.001;
  $  117.电压_模组_3_电芯_10                     $    $  V        $    $  ANS065.BYTE022  $  y=(x1*256+x2)*0.001;
  $  118.电压_模组_3_电芯_11                     $    $  V        $    $  ANS065.BYTE024  $  y=(x1*256+x2)*0.001;
  $  119.电压_模组_3_电芯_12                     $    $  V        $    $  ANS065.BYTE026  $  y=(x1*256+x2)*0.001;
  $  120.电压_模组_4_电芯_1                      $    $  V        $    $  ANS066.BYTE004  $  y=(x1*256+x2)*0.001;
  $  121.电压_模组_4_电芯_2                      $    $  V        $    $  ANS066.BYTE006  $  y=(x1*256+x2)*0.001;
  $  122.电压_模组_4_电芯_3                      $    $  V        $    $  ANS066.BYTE008  $  y=(x1*256+x2)*0.001;
  $  123.电压_模组_4_电芯_4                      $    $  V        $    $  ANS066.BYTE010  $  y=(x1*256+x2)*0.001;
  $  124.电压_模组_4_电芯_5                      $    $  V        $    $  ANS066.BYTE012  $  y=(x1*256+x2)*0.001;
  $  125.电压_模组_4_电芯_6                      $    $  V        $    $  ANS066.BYTE014  $  y=(x1*256+x2)*0.001;
  $  126.电压_模组_4_电芯_7                      $    $  V        $    $  ANS066.BYTE016  $  y=(x1*256+x2)*0.001;
  $  127.电压_模组_4_电芯_8                      $    $  V        $    $  ANS066.BYTE018  $  y=(x1*256+x2)*0.001;
  $  128.电压_模组_4_电芯_9                      $    $  V        $    $  ANS066.BYTE020  $  y=(x1*256+x2)*0.001;
  $  129.电压_模组_4_电芯_10                     $    $  V        $    $  ANS066.BYTE022  $  y=(x1*256+x2)*0.001;
  $  130.电压_模组_4_电芯_11                     $    $  V        $    $  ANS066.BYTE024  $  y=(x1*256+x2)*0.001;
  $  131.电压_模组_4_电芯_12                     $    $  V        $    $  ANS066.BYTE026  $  y=(x1*256+x2)*0.001;
  $  132.电压_模组_5_电芯_1                      $    $  V        $    $  ANS067.BYTE004  $  y=(x1*256+x2)*0.001;
  $  133.电压_模组_5_电芯_2                      $    $  V        $    $  ANS067.BYTE006  $  y=(x1*256+x2)*0.001;
  $  134.电压_模组_5_电芯_3                      $    $  V        $    $  ANS067.BYTE008  $  y=(x1*256+x2)*0.001;
  $  135.电压_模组_5_电芯_4                      $    $  V        $    $  ANS067.BYTE010  $  y=(x1*256+x2)*0.001;
  $  136.电压_模组_5_电芯_5                      $    $  V        $    $  ANS067.BYTE012  $  y=(x1*256+x2)*0.001;
  $  137.电压_模组_5_电芯_6                      $    $  V        $    $  ANS067.BYTE014  $  y=(x1*256+x2)*0.001;
  $  138.电压_模组_5_电芯_7                      $    $  V        $    $  ANS067.BYTE016  $  y=(x1*256+x2)*0.001;
  $  139.电压_模组_5_电芯_8                      $    $  V        $    $  ANS067.BYTE018  $  y=(x1*256+x2)*0.001;
  $  140.电压_模组_5_电芯_9                      $    $  V        $    $  ANS067.BYTE020  $  y=(x1*256+x2)*0.001;
  $  141.电压_模组_5_电芯_10                     $    $  V        $    $  ANS067.BYTE022  $  y=(x1*256+x2)*0.001;
  $  142.电压_模组_5_电芯_11                     $    $  V        $    $  ANS067.BYTE024  $  y=(x1*256+x2)*0.001;
  $  143.电压_模组_5_电芯_12                     $    $  V        $    $  ANS067.BYTE026  $  y=(x1*256+x2)*0.001;
  $  144.电压_模组_6_电芯_1                      $    $  V        $    $  ANS068.BYTE004  $  y=(x1*256+x2)*0.001;
  $  145.电压_模组_6_电芯_2                      $    $  V        $    $  ANS068.BYTE006  $  y=(x1*256+x2)*0.001;
  $  146.电压_模组_6_电芯_3                      $    $  V        $    $  ANS068.BYTE008  $  y=(x1*256+x2)*0.001;
  $  147.电压_模组_6_电芯_4                      $    $  V        $    $  ANS068.BYTE010  $  y=(x1*256+x2)*0.001;
  $  148.电压_模组_6_电芯_5                      $    $  V        $    $  ANS068.BYTE012  $  y=(x1*256+x2)*0.001;
  $  149.电压_模组_6_电芯_6                      $    $  V        $    $  ANS068.BYTE014  $  y=(x1*256+x2)*0.001;
  $  150.电压_模组_6_电芯_7                      $    $  V        $    $  ANS068.BYTE016  $  y=(x1*256+x2)*0.001;
  $  151.电压_模组_6_电芯_8                      $    $  V        $    $  ANS068.BYTE018  $  y=(x1*256+x2)*0.001;
  $  152.电压_模组_6_电芯_9                      $    $  V        $    $  ANS068.BYTE020  $  y=(x1*256+x2)*0.001;
  $  153.电压_模组_6_电芯_10                     $    $  V        $    $  ANS068.BYTE022  $  y=(x1*256+x2)*0.001;
  $  154.电压_模组_6_电芯_11                     $    $  V        $    $  ANS068.BYTE024  $  y=(x1*256+x2)*0.001;
  $  155.电压_模组_6_电芯_12                     $    $  V        $    $  ANS068.BYTE026  $  y=(x1*256+x2)*0.001;
  $  156.电压_模组_7_电芯_1                      $    $  V        $    $  ANS069.BYTE004  $  y=(x1*256+x2)*0.001;
  $  157.电压_模组_7_电芯_2                      $    $  V        $    $  ANS069.BYTE006  $  y=(x1*256+x2)*0.001;
  $  158.电压_模组_7_电芯_3                      $    $  V        $    $  ANS069.BYTE008  $  y=(x1*256+x2)*0.001;
  $  159.电压_模组_7_电芯_4                      $    $  V        $    $  ANS069.BYTE010  $  y=(x1*256+x2)*0.001;
  $  160.电压_模组_7_电芯_5                      $    $  V        $    $  ANS069.BYTE012  $  y=(x1*256+x2)*0.001;
  $  161.电压_模组_7_电芯_6                      $    $  V        $    $  ANS069.BYTE014  $  y=(x1*256+x2)*0.001;
  $  162.电压_模组_7_电芯_7                      $    $  V        $    $  ANS069.BYTE016  $  y=(x1*256+x2)*0.001;
  $  163.电压_模组_7_电芯_8                      $    $  V        $    $  ANS069.BYTE018  $  y=(x1*256+x2)*0.001;
  $  164.电压_模组_7_电芯_9                      $    $  V        $    $  ANS069.BYTE020  $  y=(x1*256+x2)*0.001;
  $  165.电压_模组_7_电芯_10                     $    $  V        $    $  ANS069.BYTE022  $  y=(x1*256+x2)*0.001;
  $  166.电压_模组_8_电芯_1                      $    $  V        $    $  ANS070.BYTE004  $  y=(x1*0x100+x2)*0.001;
  $  167.电压_模组_8_电芯_2                      $    $  V        $    $  ANS070.BYTE006  $  y=(x1*0x100+x2)*0.001;
  $  168.电压_模组_8_电芯_3                      $    $  V        $    $  ANS070.BYTE008  $  y=(x1*0x100+x2)*0.001;
  $  169.电压_模组_8_电芯_4                      $    $  V        $    $  ANS070.BYTE010  $  y=(x1*0x100+x2)*0.001;
  $  170.电压_模组_8_电芯_5                      $    $  V        $    $  ANS070.BYTE012  $  y=(x1*0x100+x2)*0.001;
  $  171.电压_模组_8_电芯_6                      $    $  V        $    $  ANS070.BYTE014  $  y=(x1*0x100+x2)*0.001;
  $  172.电压_模组_8_电芯_7                      $    $  V        $    $  ANS070.BYTE016  $  y=(x1*0x100+x2)*0.001;
  $  173.电压_模组_9_电芯_1                      $    $  V        $    $  ANS071.BYTE004  $  y=(x1*0x100+x2)*0.001;
  $  174.电压_模组_9_电芯_2                      $    $  V        $    $  ANS071.BYTE006  $  y=(x1*0x100+x2)*0.001;
  $  175.电压_模组_9_电芯_3                      $    $  V        $    $  ANS071.BYTE008  $  y=(x1*0x100+x2)*0.001;
  $  176.电压_模组_9_电芯_4                      $    $  V        $    $  ANS071.BYTE010  $  y=(x1*0x100+x2)*0.001;
  $  177.电压_模组_9_电芯_5                      $    $  V        $    $  ANS071.BYTE012  $  y=(x1*0x100+x2)*0.001;
  $  178.电压_模组_9_电芯_6                      $    $  V        $    $  ANS071.BYTE014  $  y=(x1*0x100+x2)*0.001;
  $  179.电压_模组_9_电芯_7                      $    $  V        $    $  ANS071.BYTE016  $  y=(x1*0x100+x2)*0.001;
  $  180.电压_模组_9_电芯_8                      $    $  V        $    $  ANS071.BYTE018  $  y=(x1*0x100+x2)*0.001;
  $  181.电池包互锁状态                          $    $  /        $    $  ANS072.BYTE004  $  switxh(x)0x00:y=@101c;0x01:y=@101d;0x02:y=@0dd6;default:y=@0220;
  $  182.BMS(电池管理系统)放电故障等级           $    $  /        $    $  ANS073.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@010f;0x02:y=@0129;0x03:y=@03d9;0x04:y=@095d;0x05:y=@0e51;0x06:y=@0e52;default:y=@0209;
  $  183.内部高压互锁源状态                      $    $  /        $    $  ANS074.BYTE004  $  switxh(x)0x00:y=@0e53;0x01:y=@0e54;
  $  184.外部高压互锁源状态                      $    $  /        $    $  ANS075.BYTE004  $  switxh(x)0x00:y=@0e53;0x01:y=@0e54;
  $  185.VCU(整车控制器)模式控制                 $    $  /        $    $  ANS076.BYTE004  $  switxh(x)0x00:y=@0e5e;0x01:y=@0987;0x02:y=@0988;0x03:y=@0e5f;default:y=@0209;
  $  186.link+侧电压                             $    $  V        $    $  ANS077.BYTE004  $  y=x1*256+x2;
  $  187.link-侧电压                             $    $  V        $    $  ANS078.BYTE004  $  y=x1*256+x2;
  $  188.碰撞输出状态                            $    $  /        $    $  ANS079.BYTE004  $  strcat:if(((x>>1)&1))y=@0e60;if(((x>>2)&1))y=@094c;if(((x>>3)&1))y=@094d;if(((x>>4)&1))y=@094e;
  $  189.电流采集板硬件版本号                    $    $  /        $    $  ANS080.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  190.电流采集板软件版本号                    $    $  /        $    $  ANS081.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  191.充正继电器外侧电压                      $    $  V        $    $  ANS082.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  192.累加和                                  $    $  /        $    $  ANS083.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  193.平均温度                                $    $  degC     $    $  ANS084.BYTE004  $  y=x-40;
  $  194.最大SOC                                 $    $  %        $    $  ANS085.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  195.最小SOC                                 $    $  %        $    $  ANS086.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  196.主回路高压互锁状态                      $    $  /        $    $  ANS087.BYTE004  $  y=x;
  $  197.快充回路高压互锁状态                    $    $  /        $    $  ANS088.BYTE004  $  y=x;
  $  198.主回路高压互锁外侧电压                  $    $  mV       $    $  ANS089.BYTE004  $  y=x1*0x100+x2;
  $  199.主回路高压互锁内侧电压                  $    $  mV       $    $  ANS090.BYTE004  $  y=x1*0x100+x2;
  $  200.快充回路高压互锁外侧电压                $    $  mV       $    $  ANS091.BYTE004  $  y=x1*0x100+x2;
  $  201.快充回路高压互锁内侧电压                $    $  mV       $    $  ANS092.BYTE004  $  y=x1*0x100+x2;
  $  202.正极绝缘值                              $    $  K        $    $  ANS093.BYTE004  $  y=x1*0x100+x2;
  $  203.负极绝缘值                              $    $  K        $    $  ANS094.BYTE004  $  y=x1*0x100+x2;
  $  204.钥匙信号                                $    $  mV       $    $  ANS095.BYTE004  $  y=x1*0x100+x2;
  $  205.快充唤醒源电压                          $    $  mV       $    $  ANS096.BYTE004  $  y=x1*0x100+x2;
  $  206.CC2电压值                               $    $  mV       $    $  ANS097.BYTE004  $  y=x1*0x100+x2;
  $  207.CRM00超时标志                           $    $  /        $    $  ANS098.BYTE004  $  y=x;
  $  208.CRMAA超时标志                           $    $  /        $    $  ANS099.BYTE004  $  y=x;
  $  209.CTS或CML超时标志                        $    $  /        $    $  ANS100.BYTE004  $  y=x;
  $  210.CRO超时                                 $    $  /        $    $  ANS101.BYTE004  $  y=x;
  $  211.CCS(巡航控制系统)超时                   $    $  /        $    $  ANS102.BYTE004  $  y=x;
  $  212.接收到CST（非人工停止）                 $    $  /        $    $  ANS103.BYTE004  $  y=x;
  $  213.充电桩最大输出电压                      $    $  V        $    $  ANS104.BYTE004  $  y=x1*0x100+x2;
  $  214.充电桩最小输出电压                      $    $  V        $    $  ANS105.BYTE004  $  y=x1*0x100+x2;
  $  215.CCS(巡航控制系统)输出电流值             $    $  A        $    $  ANS106.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  216.CCS(巡航控制系统)输出电压值             $    $  V        $    $  ANS107.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  217.充电插座温度                            $    $  degC     $    $  ANS108.BYTE004  $  y=x-40;
  $  218.出水口温度                              $    $  degC     $    $  ANS109.BYTE004  $  y=x-40;
  $  219.均衡开启状态                            $    $  /        $    $  ANS110.BYTE004  $  y=x;
  $  220.预约充电开启状态                        $    $  /        $    $  ANS111.BYTE004  $  y=x;
  $  221.智能补电开启状态                        $    $  /        $    $  ANS112.BYTE004  $  y=x;
  $  222.PCB最大温度                             $    $  degC     $    $  ANS113.BYTE004  $  y=x-40;
  $  223.强制切断继电器次数                      $    $  /        $    $  ANS114.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
