
    车型ID：086f

    模拟：协议模拟-->086f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E9

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 00 00 00 00 00 00       $!  ANS000:7E9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9d000000


  $#  01.读故障码库
  $#  REQ000:7E1 02 19 0A 00 00 00 00 00       $#  ANS000:7E9 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9d000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 12 00 00 00 00       $%  ANS000:7E9 03 22 F1 12 00 00 00 00
  $%  REQ001:7E1 03 22 F1 80 00 00 00 00       $%  ANS001:7E9 03 22 F1 80 00 00 00 00
  $%  REQ002:7E1 03 22 F1 87 00 00 00 00       $%  ANS002:7E9 03 22 F1 87 00 00 00 00
  $%  REQ003:7E1 03 22 F1 8A 00 00 00 00       $%  ANS003:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ004:7E1 03 22 F1 8B 00 00 00 00       $%  ANS004:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E1 03 22 F1 8C 00 00 00 00       $%  ANS005:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ006:7E1 03 22 F1 90 00 00 00 00       $%  ANS006:7E9 03 22 F1 90 00 00 00 00
  $%  REQ007:7E1 03 22 F1 93 00 00 00 00       $%  ANS007:7E9 03 22 F1 93 00 00 00 00
  $%  REQ008:7E1 03 22 F1 95 00 00 00 00       $%  ANS008:7E9 03 22 F1 95 00 00 00 00
  $%  REQ009:7E1 03 22 F1 98 00 00 00 00       $%  ANS009:7E9 03 22 F1 98 00 00 00 00
  $%  REQ010:7E1 03 22 F1 99 00 00 00 00       $%  ANS010:7E9 03 22 F1 99 00 00 00 00
  $%  REQ011:7E1 03 22 F1 9D 00 00 00 00       $%  ANS011:7E9 03 22 F1 9D 00 00 00 00
  $%  REQ012:7E1 03 22 F1 82 00 00 00 00       $%  ANS012:7E9 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:引导程序软件识别号:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                                      $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)刷写日期:                     $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  011:ECU(电子控制器)安装日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:标定软件版本号:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读数据流
  $  00.读数据流
  $  REQ000:7E1 03 22 0A 00 00 00 00 00       $  ANS000:7E9 03 22 0A 00 00 00 00 00
  $  REQ001:7E1 03 22 0A 01 00 00 00 00       $  ANS001:7E9 03 22 0A 01 00 00 00 00
  $  REQ002:7E1 03 22 0A 02 00 00 00 00       $  ANS002:7E9 03 22 0A 02 00 00 00 00
  $  REQ003:7E1 03 22 0A 03 00 00 00 00       $  ANS003:7E9 03 22 0A 03 00 00 00 00
  $  REQ004:7E1 03 22 0A 04 00 00 00 00       $  ANS004:7E9 03 22 0A 04 00 00 00 00
  $  REQ005:7E1 03 22 0A 05 00 00 00 00       $  ANS005:7E9 03 22 0A 05 00 00 00 00
  $  REQ006:7E1 03 22 0A 06 00 00 00 00       $  ANS006:7E9 03 22 0A 06 00 00 00 00
  $  REQ007:7E1 03 22 0A 07 00 00 00 00       $  ANS007:7E9 03 22 0A 07 00 00 00 00
  $  REQ008:7E1 03 22 0A 08 00 00 00 00       $  ANS008:7E9 03 22 0A 08 00 00 00 00
  $  REQ009:7E1 03 22 0A 09 00 00 00 00       $  ANS009:7E9 03 22 0A 09 00 00 00 00
  $  REQ010:7E1 03 22 0A 0A 00 00 00 00       $  ANS010:7E9 03 22 0A 0A 00 00 00 00
  $  REQ011:7E1 03 22 0A 0B 00 00 00 00       $  ANS011:7E9 03 22 0A 0B 00 00 00 00
  $  REQ012:7E1 03 22 0A 0C 00 00 00 00       $  ANS012:7E9 03 22 0A 0C 00 00 00 00
  $  REQ013:7E1 03 22 0A 11 00 00 00 00       $  ANS013:7E9 03 22 0A 11 00 00 00 00
  $  REQ014:7E1 03 22 0A 12 00 00 00 00       $  ANS014:7E9 03 22 0A 12 00 00 00 00
  $  REQ015:7E1 03 22 0A 13 00 00 00 00       $  ANS015:7E9 03 22 0A 13 00 00 00 00
  $  REQ016:7E1 03 22 0A 14 00 00 00 00       $  ANS016:7E9 03 22 0A 14 00 00 00 00
  $  REQ017:7E1 03 22 0A 15 00 00 00 00       $  ANS017:7E9 03 22 0A 15 00 00 00 00
  $  REQ018:7E1 03 22 0A 16 00 00 00 00       $  ANS018:7E9 03 22 0A 16 00 00 00 00
  $  REQ019:7E1 03 22 0A 17 00 00 00 00       $  ANS019:7E9 03 22 0A 17 00 00 00 00
  $  REQ020:7E1 03 22 0A 18 00 00 00 00       $  ANS020:7E9 03 22 0A 18 00 00 00 00
  $  REQ021:7E1 03 22 0A 19 00 00 00 00       $  ANS021:7E9 03 22 0A 19 00 00 00 00
  $  REQ022:7E1 03 22 0A 1A 00 00 00 00       $  ANS022:7E9 03 22 0A 1A 00 00 00 00
  $  REQ023:7E1 03 22 0A 1B 00 00 00 00       $  ANS023:7E9 03 22 0A 1B 00 00 00 00
  $  REQ024:7E1 03 22 0A 1C 00 00 00 00       $  ANS024:7E9 03 22 0A 1C 00 00 00 00
  $  REQ025:7E1 03 22 0A 1D 00 00 00 00       $  ANS025:7E9 03 22 0A 1D 00 00 00 00
  $  REQ026:7E1 03 22 0A 1E 00 00 00 00       $  ANS026:7E9 03 22 0A 1E 00 00 00 00
  $  REQ027:7E1 03 22 0A 1F 00 00 00 00       $  ANS027:7E9 03 22 0A 1F 00 00 00 00
  $  REQ028:7E1 03 22 0A 30 00 00 00 00       $  ANS028:7E9 03 22 0A 30 00 00 00 00
  $  REQ029:7E1 03 22 0A 32 00 00 00 00       $  ANS029:7E9 03 22 0A 32 00 00 00 00
  $  REQ030:7E1 03 22 0A 33 00 00 00 00       $  ANS030:7E9 03 22 0A 33 00 00 00 00
  $  REQ031:7E1 03 22 0A 34 00 00 00 00       $  ANS031:7E9 03 22 0A 34 00 00 00 00
  $  REQ032:7E1 03 22 0A 35 00 00 00 00       $  ANS032:7E9 03 22 0A 35 00 00 00 00
  $  REQ033:7E1 03 22 0A 36 00 00 00 00       $  ANS033:7E9 03 22 0A 36 00 00 00 00
  $  REQ034:7E1 03 22 0A 37 00 00 00 00       $  ANS034:7E9 03 22 0A 37 00 00 00 00
  $  REQ035:7E1 03 22 0A 38 00 00 00 00       $  ANS035:7E9 03 22 0A 38 00 00 00 00
  $  REQ036:7E1 03 22 0A 39 00 00 00 00       $  ANS036:7E9 03 22 0A 39 00 00 00 00
  $  REQ037:7E1 03 22 0A 3B 00 00 00 00       $  ANS037:7E9 03 22 0A 3B 00 00 00 00
  $  REQ038:7E1 03 22 0A 41 00 00 00 00       $  ANS038:7E9 03 22 0A 41 00 00 00 00
  $  REQ039:7E1 03 22 0A 42 00 00 00 00       $  ANS039:7E9 03 22 0A 42 00 00 00 00
  $  REQ040:7E1 03 22 0A 40 00 00 00 00       $  ANS040:7E9 03 22 0A 40 00 00 00 00
  $  REQ041:7E1 03 22 0A 44 00 00 00 00       $  ANS041:7E9 03 22 0A 44 00 00 00 00
  $  REQ042:7E1 03 22 0A 43 00 00 00 00       $  ANS042:7E9 03 22 0A 43 00 00 00 00
  $  REQ043:7E1 03 22 0A 45 00 00 00 00       $  ANS043:7E9 03 22 0A 45 00 00 00 00
  $  REQ044:7E1 03 22 0A 46 00 00 00 00       $  ANS044:7E9 03 22 0A 46 00 00 00 00
  $  REQ045:7E1 03 22 0A 47 00 00 00 00       $  ANS045:7E9 03 22 0A 47 00 00 00 00
  $  REQ046:7E1 03 22 0A 48 00 00 00 00       $  ANS046:7E9 03 22 0A 48 00 00 00 00
  $  REQ047:7E1 03 22 0A 49 00 00 00 00       $  ANS047:7E9 03 22 0A 49 00 00 00 00
  $  REQ048:7E1 03 22 0A 4A 00 00 00 00       $  ANS048:7E9 03 22 0A 4A 00 00 00 00
  $  REQ049:7E1 03 22 0A 51 00 00 00 00       $  ANS049:7E9 03 22 0A 51 00 00 00 00
  $  REQ050:7E1 03 22 0A 52 00 00 00 00       $  ANS050:7E9 03 22 0A 52 00 00 00 00
  $  REQ051:7E1 03 22 0A 53 00 00 00 00       $  ANS051:7E9 03 22 0A 53 00 00 00 00
  $  REQ052:7E1 03 22 0A 54 00 00 00 00       $  ANS052:7E9 03 22 0A 54 00 00 00 00
  $  REQ053:7E1 03 22 36 06 00 00 00 00       $  ANS053:7E9 03 22 36 06 00 00 00 00
  $  REQ054:7E1 03 22 36 07 00 00 00 00       $  ANS054:7E9 03 22 36 07 00 00 00 00
  $  REQ055:7E1 03 22 36 08 00 00 00 00       $  ANS055:7E9 03 22 36 08 00 00 00 00

  $  000.输入带轮转速原始值Hz                      $    $  Hz       $    $  ANS000.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  001.输出带轮转速原始值Hz                      $    $  Hz       $    $  ANS001.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  002.涡轮转速原始值Hz                          $    $  Hz       $    $  ANS002.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  003.输入带轮压力原始值                        $    $  V        $    $  ANS003.BYTE004  $  y=(x1*0x100+x2)*0.004875;
  $  004.输出带轮压力原始值                        $    $  V        $    $  ANS004.BYTE004  $  y=(x1*0x100+x2)*0.004875;
  $  005.变速器油温原始值                          $    $  V        $    $  ANS005.BYTE004  $  y=(x1*0x100+x2)*0.015625;
  $  006.手柄位置请求                              $    $  /        $    $  ANS006.BYTE004  $  y=x;
  $  007.目标发动机怠速请求                        $    $  rpm      $    $  ANS007.BYTE004  $  y=x1*0x100+x2;
  $  008.变矩器状态                                $    $  /        $    $  ANS008.BYTE004  $  y=x;
  $  009.驾驶模式                                  $    $  /        $    $  ANS009.BYTE004  $  y=x;
  $  010.变速器故障状态                            $    $  /        $    $  ANS010.BYTE004  $  y=x;
  $  011.客户代码                                  $    $  /        $    $  ANS011.BYTE004  $  y=ASCII(x);
  $  012.换挡锁止状态                              $    $  /        $    $  ANS012.BYTE004  $  y=x;
  $  013.输入带轮压力                              $    $  bar      $    $  ANS013.BYTE004  $  y=(x1*0x100+x2)*0.00390625;
  $  014.输出带轮压力                              $    $  bar      $    $  ANS014.BYTE004  $  y=(x1*0x100+x2)*0.00390625;
  $  015.涡轮转速                                  $    $  rpm      $    $  ANS015.BYTE004  $  y=x1*0x100+x2;
  $  016.输入带轮转速                              $    $  rpm      $    $  ANS016.BYTE004  $  y=x1*0x100+x2;
  $  017.输出带轮转速                              $    $  rpm      $    $  ANS017.BYTE004  $  y=x1*0x100+x2;
  $  018.目标速比                                  $    $  /        $    $  ANS018.BYTE004  $  y=(x1*0x100+x2)*0.0001220703125;
  $  019.实际速比                                  $    $  /        $    $  ANS019.BYTE004  $  y=(x1*0x100+x2)*0.0001220703125;
  $  020.输入带轮扭矩容量                          $    $  /        $    $  ANS020.BYTE004  $  y=(x1*0x100+x2)*0.00006103515625;
  $  021.输出带轮扭矩容量                          $    $  /        $    $  ANS021.BYTE004  $  y=(x1*0x100+x2)*0.00006103515625;
  $  022.变速器挡位                                $    $  /        $    $  ANS022.BYTE004  $  y=x;
  $  023.变速器油温                                $    $  deg      $    $  ANS023.BYTE004  $  y=x-40;
  $  024.变速器限扭值                              $    $  Nm       $    $  ANS024.BYTE004  $  y=(x1*0x100+x2)*0.015625;
  $  025.输入带轮目标压力                          $    $  bar      $    $  ANS025.BYTE004  $  y=(x1*0x100+x2)*0.00390625;
  $  026.输出带轮目标压力                          $    $  bar      $    $  ANS026.BYTE004  $  y=(x1*0x100+x2)*0.00390625;
  $  027.换挡模式                                  $    $  /        $    $  ANS027.BYTE004  $  y=x;
  $  028.油门踏板开度                              $    $  %        $    $  ANS028.BYTE004  $  y=x*0.5;
  $  029.发动机扭矩                                $    $  Nm       $    $  ANS029.BYTE004  $  y=(x1*0x100+x2)*0.015625;
  $  030.冷却水温度                                $    $  degC     $    $  ANS030.BYTE004  $  y=x-40;
  $  031.刹车踏板状态                              $    $  /        $    $  ANS031.BYTE004  $  y=x;
  $  032.ABS(防抱刹车系统)激活状态                 $    $  /        $    $  ANS032.BYTE004  $  y=x;
  $  033.左前轮速                                  $    $  km/h     $    $  ANS033.BYTE004  $  y=INT((x1*0x100+x2)*0.0625);
  $  034.右前轮速                                  $    $  km/h     $    $  ANS034.BYTE004  $  y=INT((x1*0x100+x2)*0.0625);
  $  035.左后轮速                                  $    $  km/h     $    $  ANS035.BYTE004  $  y=INT((x1*0x100+x2)*0.0625);
  $  036.右后轮速                                  $    $  km/h     $    $  ANS036.BYTE004  $  y=INT((x1*0x100+x2)*0.0625);
  $  037.车速（TCU(自动变速器控制单元)计算）       $    $  km/h     $    $  ANS037.BYTE004  $  y=INT((x1*0x100+x2)*0.0625);
  $  038.输入带轮控制电流                          $    $  mA       $    $  ANS038.BYTE004  $  y=x1*0x100+x2;
  $  039.输出带轮控制电流                          $    $  mA       $    $  ANS039.BYTE004  $  y=x1*0x100+x2;
  $  040.主油压控制电流                            $    $  mA       $    $  ANS040.BYTE004  $  y=x1*0x100+x2;
  $  041.变矩器控制电流                            $    $  mA       $    $  ANS041.BYTE004  $  y=x1*0x100+x2;
  $  042.离合器控制电流                            $    $  mA       $    $  ANS042.BYTE004  $  y=x1*0x100+x2;
  $  043.钥匙打开次数计数                          $    $  /        $    $  ANS043.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  044.RAM(随机存储器)运行时间                   $    $  s        $    $  ANS044.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  045.里程数                                    $    $  km       $    $  ANS045.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  046.TCU(自动变速器控制单元)运行总时间         $    $  min      $    $  ANS046.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  047.故障类型                                  $    $  /        $    $  ANS047.BYTE004  $  y=x;
  $  048.故障序号                                  $    $  /        $    $  ANS048.BYTE004  $  y=x;
  $  049.系统故障数据                              $    $  /        $    $  ANS049.BYTE004  $  y=HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30);
  $  050.异常挂入P挡统计                           $    $  /        $    $  ANS050.BYTE004  $  y=HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $  051.软件功能类型                              $    $  /        $    $  ANS051.BYTE004  $  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $  052.速比超限计数                              $    $  /        $    $  ANS052.BYTE004  $  y=x;
  $  053.读取PBC(电子驻车夹紧电机)软件版本号       $    $  /        $    $  ANS053.BYTE004  $  y=ASCII(x1,x2,x3,x4,x5,x6);
  $  054.读取左执行机构当前状态                    $    $  /        $    $  ANS054.BYTE004  $  if(x==0x00) y=@09cc; else if(x==0x01) y=@09cd; else if(x==0x02) y=@08ed; else if(x==0x03) y=@025e; else if(x==0x04) y=@0404; else if(x==0x05) y=@09ce; else if(x==0x06) y=@09cf; else y=@0220;
  $  055.读取右执行机构当前状态                    $    $  /        $    $  ANS055.BYTE004  $  if(x==0x00) y=@09cc; else if(x==0x01) y=@09cd; else if(x==0x02) y=@08ed; else if(x==0x03) y=@025e; else if(x==0x04) y=@0404; else if(x==0x05) y=@09ce; else if(x==0x06) y=@09cf; else y=@0220;

  $)  01.前进挡离合器充油自学习值
  $  01.前进挡离合器充油自学习值
  $  REQ000:7E1 03 22 0A 55 00 00 00 00       $  ANS000:7E9 03 22 0A 55 00 00 00 00

  $  000.前进挡离合器充油自学习值[0]        $    $  ms     $    $  ANS000.BYTE004  $  y=x1*0x100+x2;
  $  001.前进挡离合器充油自学习值[1]        $    $  ms     $    $  ANS000.BYTE006  $  y=x1*0x100+x2;
  $  002.前进挡离合器充油自学习值[2]        $    $  ms     $    $  ANS000.BYTE008  $  y=x1*0x100+x2;
  $  003.前进挡离合器充油自学习值[3]        $    $  ms     $    $  ANS000.BYTE010  $  y=x1*0x100+x2;
  $  004.前进挡离合器充油自学习值[4]        $    $  ms     $    $  ANS000.BYTE012  $  y=x1*0x100+x2;
  $  005.前进挡离合器充油自学习值[5]        $    $  ms     $    $  ANS000.BYTE014  $  y=x1*0x100+x2;
  $  006.前进挡离合器充油自学习值[6]        $    $  ms     $    $  ANS000.BYTE016  $  y=x1*0x100+x2;
  $  007.前进挡离合器充油自学习值[7]        $    $  ms     $    $  ANS000.BYTE018  $  y=x1*0x100+x2;
  $  008.前进挡离合器充油自学习值[8]        $    $  ms     $    $  ANS000.BYTE020  $  y=x1*0x100+x2;
  $  009.前进挡离合器充油自学习值[9]        $    $  ms     $    $  ANS000.BYTE022  $  y=x1*0x100+x2;
  $  010.前进挡离合器充油自学习值[10]       $    $  ms     $    $  ANS000.BYTE024  $  y=x1*0x100+x2;
  $  011.前进挡离合器充油自学习值[11]       $    $  ms     $    $  ANS000.BYTE026  $  y=x1*0x100+x2;
  $  012.前进挡离合器充油自学习值[12]       $    $  ms     $    $  ANS000.BYTE028  $  y=x1*0x100+x2;
  $  013.前进挡离合器充油自学习值[13]       $    $  ms     $    $  ANS000.BYTE030  $  y=x1*0x100+x2;
  $  014.前进挡离合器充油自学习值[14]       $    $  ms     $    $  ANS000.BYTE032  $  y=x1*0x100+x2;

  $)  02.倒挡离合器充油自学习值
  $  02.倒挡离合器充油自学习值
  $  REQ000:7E1 03 22 0A 56 00 00 00 00       $  ANS000:7E9 03 22 0A 56 00 00 00 00

  $  000.倒挡离合器充油自学习值[0]        $    $  ms     $    $  ANS000.BYTE004  $  y=x1*0x100+x2;
  $  001.倒挡离合器充油自学习值[1]        $    $  ms     $    $  ANS000.BYTE006  $  y=x1*0x100+x2;
  $  002.倒挡离合器充油自学习值[2]        $    $  ms     $    $  ANS000.BYTE008  $  y=x1*0x100+x2;
  $  003.倒挡离合器充油自学习值[3]        $    $  ms     $    $  ANS000.BYTE010  $  y=x1*0x100+x2;
  $  004.倒挡离合器充油自学习值[4]        $    $  ms     $    $  ANS000.BYTE012  $  y=x1*0x100+x2;
  $  005.倒挡离合器充油自学习值[5]        $    $  ms     $    $  ANS000.BYTE014  $  y=x1*0x100+x2;
  $  006.倒挡离合器充油自学习值[6]        $    $  ms     $    $  ANS000.BYTE016  $  y=x1*0x100+x2;
  $  007.倒挡离合器充油自学习值[7]        $    $  ms     $    $  ANS000.BYTE018  $  y=x1*0x100+x2;
  $  008.倒挡离合器充油自学习值[8]        $    $  ms     $    $  ANS000.BYTE020  $  y=x1*0x100+x2;
  $  009.倒挡离合器充油自学习值[9]        $    $  ms     $    $  ANS000.BYTE022  $  y=x1*0x100+x2;
  $  010.倒挡离合器充油自学习值[10]       $    $  ms     $    $  ANS000.BYTE024  $  y=x1*0x100+x2;
  $  011.倒挡离合器充油自学习值[11]       $    $  ms     $    $  ANS000.BYTE026  $  y=x1*0x100+x2;
  $  012.倒挡离合器充油自学习值[12]       $    $  ms     $    $  ANS000.BYTE028  $  y=x1*0x100+x2;
  $  013.倒挡离合器充油自学习值[13]       $    $  ms     $    $  ANS000.BYTE030  $  y=x1*0x100+x2;
  $  014.倒挡离合器充油自学习值[14]       $    $  ms     $    $  ANS000.BYTE032  $  y=x1*0x100+x2;

  $)  03.前进挡离合器触点自学习值
  $  03.前进挡离合器触点自学习值
  $  REQ000:7E1 03 22 0A 57 00 00 00 00       $  ANS000:7E9 03 22 0A 57 00 00 00 00

  $  000.前进挡离合器触点自学习值[0]        $    $  bar     $    $  ANS000.BYTE004  $  y=(x1*0x100+x2)/4096;
  $  001.前进挡离合器触点自学习值[1]        $    $  bar     $    $  ANS000.BYTE006  $  y=(x1*0x100+x2)/4096;
  $  002.前进挡离合器触点自学习值[2]        $    $  bar     $    $  ANS000.BYTE008  $  y=(x1*0x100+x2)/4096;
  $  003.前进挡离合器触点自学习值[3]        $    $  bar     $    $  ANS000.BYTE010  $  y=(x1*0x100+x2)/4096;
  $  004.前进挡离合器触点自学习值[4]        $    $  bar     $    $  ANS000.BYTE012  $  y=(x1*0x100+x2)/4096;
  $  005.前进挡离合器触点自学习值[5]        $    $  bar     $    $  ANS000.BYTE014  $  y=(x1*0x100+x2)/4096;
  $  006.前进挡离合器触点自学习值[6]        $    $  bar     $    $  ANS000.BYTE016  $  y=(x1*0x100+x2)/4096;
  $  007.前进挡离合器触点自学习值[7]        $    $  bar     $    $  ANS000.BYTE018  $  y=(x1*0x100+x2)/4096;
  $  008.前进挡离合器触点自学习值[8]        $    $  bar     $    $  ANS000.BYTE020  $  y=(x1*0x100+x2)/4096;
  $  009.前进挡离合器触点自学习值[9]        $    $  bar     $    $  ANS000.BYTE022  $  y=(x1*0x100+x2)/4096;
  $  010.前进挡离合器触点自学习值[10]       $    $  bar     $    $  ANS000.BYTE024  $  y=(x1*0x100+x2)/4096;
  $  011.前进挡离合器触点自学习值[11]       $    $  bar     $    $  ANS000.BYTE026  $  y=(x1*0x100+x2)/4096;
  $  012.前进挡离合器触点自学习值[12]       $    $  bar     $    $  ANS000.BYTE028  $  y=(x1*0x100+x2)/4096;
  $  013.前进挡离合器触点自学习值[13]       $    $  bar     $    $  ANS000.BYTE030  $  y=(x1*0x100+x2)/4096;
  $  014.前进挡离合器触点自学习值[14]       $    $  bar     $    $  ANS000.BYTE032  $  y=(x1*0x100+x2)/4096;

  $)  04.倒挡离合器触点自学习值
  $  04.倒挡离合器触点自学习值
  $  REQ000:7E1 03 22 0A 58 00 00 00 00       $  ANS000:7E9 03 22 0A 58 00 00 00 00

  $  000.倒挡离合器触点自学习值[0]        $    $  bar     $    $  ANS000.BYTE004  $  y=(x1*0x100+x2)/4096;
  $  001.倒挡离合器触点自学习值[1]        $    $  bar     $    $  ANS000.BYTE006  $  y=(x1*0x100+x2)/4096;
  $  002.倒挡离合器触点自学习值[2]        $    $  bar     $    $  ANS000.BYTE008  $  y=(x1*0x100+x2)/4096;
  $  003.倒挡离合器触点自学习值[3]        $    $  bar     $    $  ANS000.BYTE010  $  y=(x1*0x100+x2)/4096;
  $  004.倒挡离合器触点自学习值[4]        $    $  bar     $    $  ANS000.BYTE012  $  y=(x1*0x100+x2)/4096;
  $  005.倒挡离合器触点自学习值[5]        $    $  bar     $    $  ANS000.BYTE014  $  y=(x1*0x100+x2)/4096;
  $  006.倒挡离合器触点自学习值[6]        $    $  bar     $    $  ANS000.BYTE016  $  y=(x1*0x100+x2)/4096;
  $  007.倒挡离合器触点自学习值[7]        $    $  bar     $    $  ANS000.BYTE018  $  y=(x1*0x100+x2)/4096;
  $  008.倒挡离合器触点自学习值[8]        $    $  bar     $    $  ANS000.BYTE020  $  y=(x1*0x100+x2)/4096;
  $  009.倒挡离合器触点自学习值[9]        $    $  bar     $    $  ANS000.BYTE022  $  y=(x1*0x100+x2)/4096;
  $  010.倒挡离合器触点自学习值[10]       $    $  bar     $    $  ANS000.BYTE024  $  y=(x1*0x100+x2)/4096;
  $  011.倒挡离合器触点自学习值[11]       $    $  bar     $    $  ANS000.BYTE026  $  y=(x1*0x100+x2)/4096;
  $  012.倒挡离合器触点自学习值[12]       $    $  bar     $    $  ANS000.BYTE028  $  y=(x1*0x100+x2)/4096;
  $  013.倒挡离合器触点自学习值[13]       $    $  bar     $    $  ANS000.BYTE030  $  y=(x1*0x100+x2)/4096;
  $  014.倒挡离合器触点自学习值[14]       $    $  bar     $    $  ANS000.BYTE032  $  y=(x1*0x100+x2)/4096;

  $)  05.液力变矩器锁止离合器触点自学习值
  $  05.液力变矩器锁止离合器触点自学习值
  $  REQ000:7E1 03 22 0A 59 00 00 00 00       $  ANS000:7E9 03 22 0A 59 00 00 00 00

  $  000.液力变矩器锁止离合器触点自学习值[0]       $    $  bar     $    $  ANS000.BYTE004  $  y=(x1*0x100+x2)/32768;
  $  001.液力变矩器锁止离合器触点自学习值[1]       $    $  bar     $    $  ANS000.BYTE006  $  y=(x1*0x100+x2)/32768;
  $  002.液力变矩器锁止离合器触点自学习值[2]       $    $  bar     $    $  ANS000.BYTE008  $  y=(x1*0x100+x2)/32768;
  $  003.液力变矩器锁止离合器触点自学习值[3]       $    $  bar     $    $  ANS000.BYTE010  $  y=(x1*0x100+x2)/32768;
  $  004.液力变矩器锁止离合器触点自学习值[4]       $    $  bar     $    $  ANS000.BYTE012  $  y=(x1*0x100+x2)/32768;
  $  005.液力变矩器锁止离合器触点自学习值[5]       $    $  bar     $    $  ANS000.BYTE014  $  y=(x1*0x100+x2)/32768;
  $  006.液力变矩器锁止离合器触点自学习值[6]       $    $  bar     $    $  ANS000.BYTE016  $  y=(x1*0x100+x2)/32768;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7E1 30 00 0B 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
