
    车型ID：08de

    模拟：协议模拟-->08de

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B9

进入命令:

  $~  REQ000:7B1 02 10 01 00 00 00 00 00       $~  ANS000:7B9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B1 02 3E 00 00 00 00 00 00       $!  ANS000:7B9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B1 03 19 02 09 00 00 00 00       $#  ANS000:7B9 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/a7000000


  $#  01.读故障码库
  $#  REQ000:7B1 02 19 0A 00 00 00 00 00       $#  ANS000:7B9 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/a7000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B1 04 14 FF FF FF 00 00 00       $$  ANS000:7B9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B1 03 22 F1 12 00 00 00 00       $%  ANS000:7B9 03 22 F1 12 00 00 00 00
  $%  REQ001:7B1 03 22 F1 87 00 00 00 00       $%  ANS001:7B9 03 22 F1 87 00 00 00 00
  $%  REQ002:7B1 03 22 F1 89 00 00 00 00       $%  ANS002:7B9 03 22 F1 89 00 00 00 00
  $%  REQ003:7B1 03 22 F1 8A 00 00 00 00       $%  ANS003:7B9 03 22 F1 8A 00 00 00 00
  $%  REQ004:7B1 03 22 F1 8B 00 00 00 00       $%  ANS004:7B9 03 22 F1 8B 00 00 00 00
  $%  REQ005:7B1 03 22 F1 8C 00 00 00 00       $%  ANS005:7B9 03 22 F1 8C 00 00 00 00
  $%  REQ006:7B1 03 22 F1 90 00 00 00 00       $%  ANS006:7B9 03 22 F1 90 00 00 00 00
  $%  REQ007:7B1 03 22 F1 93 00 00 00 00       $%  ANS007:7B9 03 22 F1 93 00 00 00 00
  $%  REQ008:7B1 03 22 F1 95 00 00 00 00       $%  ANS008:7B9 03 22 F1 95 00 00 00 00
  $%  REQ009:7B1 03 22 F1 9D 00 00 00 00       $%  ANS009:7B9 03 22 F1 9D 00 00 00 00
  $%  REQ010:7B1 03 22 F1 98 00 00 00 00       $%  ANS010:7B9 03 22 F1 98 00 00 00 00
  $%  REQ011:7B1 03 22 F1 99 00 00 00 00       $%  ANS011:7B9 03 22 F1 99 00 00 00 00
  $%  REQ012:7B1 03 22 4B 02 00 00 00 00       $%  ANS012:7B9 03 22 4B 02 00 00 00 00
  $%  REQ013:7B1 03 22 F1 82 00 00 00 00       $%  ANS013:7B9 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                                      $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:Geely软件版本号:                             $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)安装日期:                     $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  010:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  011:ECU(电子控制器)刷写日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:电池包版本号:                                $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  013:标定软件版本号:                              $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7B1 03 22 4B 03 00 00 00 00       $  ANS000:7B9 03 22 4B 03 00 00 00 00
  $  REQ001:7B1 03 22 4B 04 00 00 00 00       $  ANS001:7B9 03 22 4B 04 00 00 00 00
  $  REQ002:7B1 03 22 4B 05 00 00 00 00       $  ANS002:7B9 03 22 4B 05 00 00 00 00
  $  REQ003:7B1 03 22 4B 07 00 00 00 00       $  ANS003:7B9 03 22 4B 07 00 00 00 00
  $  REQ004:7B1 03 22 4B 08 00 00 00 00       $  ANS004:7B9 03 22 4B 08 00 00 00 00
  $  REQ005:7B1 03 22 4B 09 00 00 00 00       $  ANS005:7B9 03 22 4B 09 00 00 00 00
  $  REQ006:7B1 03 22 4B 0A 00 00 00 00       $  ANS006:7B9 03 22 4B 0A 00 00 00 00
  $  REQ007:7B1 03 22 4B 0B 00 00 00 00       $  ANS007:7B9 03 22 4B 0B 00 00 00 00
  $  REQ008:7B1 03 22 4B 0C 00 00 00 00       $  ANS008:7B9 03 22 4B 0C 00 00 00 00
  $  REQ009:7B1 03 22 4B 13 00 00 00 00       $  ANS009:7B9 03 22 4B 13 00 00 00 00
  $  REQ010:7B1 03 22 4B 15 00 00 00 00       $  ANS010:7B9 03 22 4B 15 00 00 00 00
  $  REQ011:7B1 03 22 4B 17 00 00 00 00       $  ANS011:7B9 03 22 4B 17 00 00 00 00
  $  REQ012:7B1 03 22 4B 18 00 00 00 00       $  ANS012:7B9 03 22 4B 18 00 00 00 00
  $  REQ013:7B1 03 22 4B 19 00 00 00 00       $  ANS013:7B9 03 22 4B 19 00 00 00 00
  $  REQ014:7B1 03 22 4B 1A 00 00 00 00       $  ANS014:7B9 03 22 4B 1A 00 00 00 00
  $  REQ015:7B1 03 22 4B 1C 00 00 00 00       $  ANS015:7B9 03 22 4B 1C 00 00 00 00
  $  REQ016:7B1 03 22 4B 1D 00 00 00 00       $  ANS016:7B9 03 22 4B 1D 00 00 00 00
  $  REQ017:7B1 03 22 4B 1E 00 00 00 00       $  ANS017:7B9 03 22 4B 1E 00 00 00 00
  $  REQ018:7B1 03 22 4B 1F 00 00 00 00       $  ANS018:7B9 03 22 4B 1F 00 00 00 00
  $  REQ019:7B1 03 22 4B 20 00 00 00 00       $  ANS019:7B9 03 22 4B 20 00 00 00 00
  $  REQ020:7B1 03 22 4B 21 00 00 00 00       $  ANS020:7B9 03 22 4B 21 00 00 00 00
  $  REQ021:7B1 03 22 4B 22 00 00 00 00       $  ANS021:7B9 03 22 4B 22 00 00 00 00
  $  REQ022:7B1 03 22 4B 23 00 00 00 00       $  ANS022:7B9 03 22 4B 23 00 00 00 00
  $  REQ023:7B1 03 22 4B 24 00 00 00 00       $  ANS023:7B9 03 22 4B 24 00 00 00 00
  $  REQ024:7B1 03 22 4B 25 00 00 00 00       $  ANS024:7B9 03 22 4B 25 00 00 00 00
  $  REQ025:7B1 03 22 4B 26 00 00 00 00       $  ANS025:7B9 03 22 4B 26 00 00 00 00
  $  REQ026:7B1 03 22 4B 27 00 00 00 00       $  ANS026:7B9 03 22 4B 27 00 00 00 00
  $  REQ027:7B1 03 22 4B 28 00 00 00 00       $  ANS027:7B9 03 22 4B 28 00 00 00 00
  $  REQ028:7B1 03 22 4B 29 00 00 00 00       $  ANS028:7B9 03 22 4B 29 00 00 00 00
  $  REQ029:7B1 03 22 4B 2A 00 00 00 00       $  ANS029:7B9 03 22 4B 2A 00 00 00 00
  $  REQ030:7B1 03 22 4B 2B 00 00 00 00       $  ANS030:7B9 03 22 4B 2B 00 00 00 00
  $  REQ031:7B1 03 22 4B 2C 00 00 00 00       $  ANS031:7B9 03 22 4B 2C 00 00 00 00
  $  REQ032:7B1 03 22 4B 2D 00 00 00 00       $  ANS032:7B9 03 22 4B 2D 00 00 00 00
  $  REQ033:7B1 03 22 4B 2E 00 00 00 00       $  ANS033:7B9 03 22 4B 2E 00 00 00 00
  $  REQ034:7B1 03 22 4B 35 00 00 00 00       $  ANS034:7B9 03 22 4B 35 00 00 00 00
  $  REQ035:7B1 03 22 4B 36 00 00 00 00       $  ANS035:7B9 03 22 4B 36 00 00 00 00
  $  REQ036:7B1 03 22 4B 37 00 00 00 00       $  ANS036:7B9 03 22 4B 37 00 00 00 00
  $  REQ037:7B1 03 22 4B 38 00 00 00 00       $  ANS037:7B9 03 22 4B 38 00 00 00 00
  $  REQ038:7B1 03 22 4B 39 00 00 00 00       $  ANS038:7B9 03 22 4B 39 00 00 00 00
  $  REQ039:7B1 03 22 4B 3A 00 00 00 00       $  ANS039:7B9 03 22 4B 3A 00 00 00 00
  $  REQ040:7B1 03 22 4B 3B 00 00 00 00       $  ANS040:7B9 03 22 4B 3B 00 00 00 00
  $  REQ041:7B1 03 22 4B 3C 00 00 00 00       $  ANS041:7B9 03 22 4B 3C 00 00 00 00
  $  REQ042:7B1 03 22 4B 3D 00 00 00 00       $  ANS042:7B9 03 22 4B 3D 00 00 00 00
  $  REQ043:7B1 03 22 4B 3E 00 00 00 00       $  ANS043:7B9 03 22 4B 3E 00 00 00 00
  $  REQ044:7B1 03 22 4B 3F 00 00 00 00       $  ANS044:7B9 03 22 4B 3F 00 00 00 00
  $  REQ045:7B1 03 22 4B 42 00 00 00 00       $  ANS045:7B9 03 22 4B 42 00 00 00 00
  $  REQ046:7B1 03 22 4B 43 00 00 00 00       $  ANS046:7B9 03 22 4B 43 00 00 00 00
  $  REQ047:7B1 03 22 4B 44 00 00 00 00       $  ANS047:7B9 03 22 4B 44 00 00 00 00
  $  REQ048:7B1 03 22 4B 45 00 00 00 00       $  ANS048:7B9 03 22 4B 45 00 00 00 00
  $  REQ049:7B1 03 22 4B 46 00 00 00 00       $  ANS049:7B9 03 22 4B 46 00 00 00 00
  $  REQ050:7B1 03 22 4B 47 00 00 00 00       $  ANS050:7B9 03 22 4B 47 00 00 00 00
  $  REQ051:7B1 03 22 4B 48 00 00 00 00       $  ANS051:7B9 03 22 4B 48 00 00 00 00
  $  REQ052:7B1 03 22 4B 58 00 00 00 00       $  ANS052:7B9 03 22 4B 58 00 00 00 00
  $  REQ053:7B1 03 22 4B 02 00 00 00 00       $  ANS053:7B9 03 22 4B 02 00 00 00 00
  $  REQ054:7B1 03 22 4B 06 00 00 00 00       $  ANS054:7B9 03 22 4B 06 00 00 00 00
  $  REQ055:7B1 03 22 4B 0D 00 00 00 00       $  ANS055:7B9 03 22 4B 0D 00 00 00 00
  $  REQ056:7B1 03 22 4B 0E 00 00 00 00       $  ANS056:7B9 03 22 4B 0E 00 00 00 00
  $  REQ057:7B1 03 22 4B 0F 00 00 00 00       $  ANS057:7B9 03 22 4B 0F 00 00 00 00
  $  REQ058:7B1 03 22 4B 10 00 00 00 00       $  ANS058:7B9 03 22 4B 10 00 00 00 00
  $  REQ059:7B1 03 22 4B 11 00 00 00 00       $  ANS059:7B9 03 22 4B 11 00 00 00 00
  $  REQ060:7B1 03 22 4B 53 00 00 00 00       $  ANS060:7B9 03 22 4B 53 00 00 00 00
  $  REQ061:7B1 03 22 4B 54 00 00 00 00       $  ANS061:7B9 03 22 4B 54 00 00 00 00

  $  000.电池包标称容量                          $    $  Ah       $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.1;
  $  001.电池包标称能量                          $    $  kWh      $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.1;
  $  002.标称电压                                $    $  V        $    $  ANS002.BYTE004  $  y=(x1*256+x2)*1;
  $  003.Cell总数                                $    $  /        $    $  ANS003.BYTE004  $  y=x;
  $  004.Cell温度传感器总数                      $    $  /        $    $  ANS004.BYTE004  $  y=x;
  $  005.电池包单次放电容量                      $    $  Ah       $    $  ANS005.BYTE004  $  y=(x1*256+x2)*0.1;
  $  006.电池包单次充电容量                      $    $  Ah       $    $  ANS006.BYTE004  $  y=(x1*256+x2)*0.1;
  $  007.电池包累计放电容量                      $    $  Ah       $    $  ANS007.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.1;
  $  008.电池包累计充电容量                      $    $  Ah       $    $  ANS008.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.1;
  $  009.VCU(整车控制器)充电允许                 $    $  /        $    $  ANS009.BYTE004  $  if(x==0x00)y=@0e61;else if(x==0x01)y=@0670;else if(x==0x02 || x==0x03)y=@0209;
  $  010.BMS(电池管理系统)状态                   $    $  /        $    $  ANS010.BYTE004  $  switxh(x)0x00:y=@00e8;0x01:y=@0318;0x02:y=@05cb;0x03:y=@0e62;0x04:y=@0e63;0x06:y=@03e3;0x07:y=@0e64;0x08:y=@09ab;0x09:y=@0e65;0x0a:y=@0e66;0x0b:y=@03db;0x0c:y=@0589;0x0d:y=@04a1;default:y=@0209;
  $  011.BMS(电池管理系统)充电故障等级           $    $  /        $    $  ANS011.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@010f;0x02:y=@0129;0x03:y=@03d9;0x05:y=@0e6a;0x06:y=@0e6b;default:y=@0209;
  $  012.BMS(电池管理系统)放电回路预充状态       $    $  /        $    $  ANS012.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@010f;0x02:y=@0129;0x03:y=@03d9;0x04:y=@095d;0x05:y=@0e51;0x06:y=@0e52;default:y=@0209;
  $  013.BMS(电池管理系统)充电回路预充状态       $    $  /        $    $  ANS013.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@06af;0x02:y=@06b0;0x03:y=@03e6;0x04:y=@06b1;default:y=@0209;
  $  014.ECU(电子控制器)电源电压                 $    $  V        $    $  ANS014.BYTE004  $  y=x*0.1;
  $  015.1#模组1#温度值                          $    $  degC     $    $  ANS015.BYTE004  $  y=x*0.5-40;
  $  016.1#模组2#温度值                          $    $  degC     $    $  ANS015.BYTE005  $  y=x*0.5-40;
  $  017.2#模组1#温度值                          $    $  degC     $    $  ANS015.BYTE006  $  y=x*0.5-40;
  $  018.2#模组2#温度值                          $    $  degC     $    $  ANS015.BYTE007  $  y=x*0.5-40;
  $  019.3#模组1#温度值                          $    $  degC     $    $  ANS015.BYTE008  $  y=x*0.5-40;
  $  020.3#模组2#温度值                          $    $  degC     $    $  ANS015.BYTE009  $  y=x*0.5-40;
  $  021.4#模组1#温度值                          $    $  degC     $    $  ANS015.BYTE010  $  y=x*0.5-40;
  $  022.4#模组2#温度值                          $    $  degC     $    $  ANS015.BYTE011  $  y=x*0.5-40;
  $  023.5#模组1#温度值                          $    $  degC     $    $  ANS015.BYTE012  $  y=x*0.5-40;
  $  024.5#模组2#温度值                          $    $  degC     $    $  ANS015.BYTE013  $  y=x*0.5-40;
  $  025.6#模组1#温度值                          $    $  degC     $    $  ANS015.BYTE014  $  y=x*0.5-40;
  $  026.6#模组2#温度值                          $    $  degC     $    $  ANS015.BYTE015  $  y=x*0.5-40;
  $  027.7#模组1#温度值                          $    $  degC     $    $  ANS015.BYTE016  $  y=x*0.5-40;
  $  028.7#模组2#温度值                          $    $  degC     $    $  ANS015.BYTE017  $  y=x*0.5-40;
  $  029.最大电芯电压                            $    $  V        $    $  ANS016.BYTE004  $  y=(x1*256+x2)*0.001;
  $  030.最大电芯电压的电芯号                    $    $  /        $    $  ANS017.BYTE004  $  y=x;
  $  031.最小电芯电压                            $    $  V        $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.001;
  $  032.最小电芯电压的电芯号                    $    $  /        $    $  ANS019.BYTE004  $  y=x;
  $  033.电池包总电压                            $    $  V        $    $  ANS020.BYTE004  $  y=(x1*256+x2)*0.1;
  $  034.电池包总电流                            $    $  A        $    $  ANS021.BYTE004  $  y=(x1*256+x2)*0.1-500;
  $  035.电池包最高温度                          $    $  degC     $    $  ANS022.BYTE004  $  y=x*0.5-40;
  $  036.电池包最高温度的温度传感器号            $    $  /        $    $  ANS023.BYTE004  $  y=x;
  $  037.电池包最低温度                          $    $  degC     $    $  ANS024.BYTE004  $  y=x*0.5-40;
  $  038.电池包最低温度的温度传感器号            $    $  /        $    $  ANS025.BYTE004  $  y=x;
  $  039.绝缘电阻值                              $    $  Kohm     $    $  ANS026.BYTE004  $  y=x1*256+x2;
  $  040.绝缘监测状态                            $    $  /        $    $  ANS027.BYTE004  $  switxh(x)0x00:y=@0e67;0x01:y=@0e68;0x02:y=@0e69;default:y=@0209;
  $  041.整车高压互锁状态                        $    $  /        $    $  ANS028.BYTE004  $  switxh(x)0x00:y=@06b7;0x01:y=@06b8;default:y=@0209;
  $  042.主正继电器状态                          $    $  /        $    $  ANS029.BYTE004  $  if(0==((x>>0)&1) && 0==((x>>1)&1))y=@0001;else if(1==((x>>0)&1) && 0==((x>>1)&1))y=@0000;else if(0==((x>>0)&1) && 1==((x>>1)&1))y=@0e78;
  $  043.主负继电器状态                          $    $  /        $    $  ANS029.BYTE004  $  if(0==((x>>2)&1) && 0==((x>>3)&1))y=@0001;else if(1==((x>>2)&1) && 0==((x>>3)&1))y=@0000;else if(0==((x>>2)&1) && 1==((x>>3)&1))y=@068c;
  $  044.预充继电器状态                          $    $  /        $    $  ANS029.BYTE004  $  if(0==((x>>4)&1) && 0==((x>>5)&1))y=@0001;else if(1==((x>>4)&1) && 0==((x>>5)&1))y=@0000;
  $  045.充电继电器状态                          $    $  /        $    $  ANS029.BYTE004  $  if(0==((x>>6)&1) && 0==((x>>7)&1))y=@0001;else if(1==((x>>6)&1) && 0==((x>>7)&1))y=@0000;else if(0==((x>>6)&1) && 1==((x>>7)&1))y=@0e78;
  $  046.充电预充继电器状态                      $    $  /        $    $  ANS029.BYTE005  $  if(0==((x>>0)&1) && 0==((x>>1)&1))y=@0001;else if(1==((x>>0)&1) && 0==((x>>1)&1))y=@0000;
  $  047.充电机实际工作状态                      $    $  /        $    $  ANS030.BYTE004  $  switxh(x)0x00:y=@0209;0x01:y=@0e71;0x02:y=@0e72;0x03:y=@0b73;0x04:y=@03d6;0x05:y=@05e4;0x06:y=@0b74;0x07:y=@0b75;0x08:y=@0b76;0x09:y=@03d9;0x0A:y=@068b;0x0B:y=@0e73;0x0C:y=@0e74;
  $  048.充电机错误状态                          $    $  /        $    $  ANS031.BYTE004  $  switxh(x)0x00:y=@0481;0x01:y=@0e75;0x02:y=@0e76;0x03:y=@0e77;
  $  049.充电机输出电流                          $    $  A        $    $  ANS032.BYTE004  $  y=(x1*256+x2)*0.1;
  $  050.充电机输出电压                          $    $  V        $    $  ANS033.BYTE004  $  y=x1*256+x2;
  $  051.电池荷电状态                            $    $  %        $    $  ANS034.BYTE004  $  y=(x1*256+x2)*0.1;
  $  052.电池显示剩余电量                        $    $  %        $    $  ANS035.BYTE004  $  y=(x1*256+x2)*0.1;
  $  053.电池健康度                              $    $  %        $    $  ANS036.BYTE004  $  y=(x1*256+x2)*0.1;
  $  054.剩余能量                                $    $  Kwh      $    $  ANS037.BYTE004  $  y=(x1*256+x2)*0.1;
  $  055.允许的持续放电功率                      $    $  kW       $    $  ANS038.BYTE004  $  y=x;
  $  056.允许的峰值放电功率                      $    $  kW       $    $  ANS039.BYTE004  $  y=x;
  $  057.允许的持续充电功率                      $    $  kW       $    $  ANS040.BYTE004  $  y=x;
  $  058.允许的峰值充电功率                      $    $  kW       $    $  ANS041.BYTE004  $  y=x;
  $  059.电池单体最高容量                        $    $  Ah       $    $  ANS042.BYTE004  $  y=(x1*256+x2)*0.1;
  $  060.电池单体最低容量                        $    $  Ah       $    $  ANS043.BYTE004  $  y=(x1*256+x2)*0.1;
  $  061.空调对电池水泵请求的反馈                $    $  %        $    $  ANS044.BYTE004  $  y=x;
  $  062.充电机CP连接状态                        $    $  /        $    $  ANS045.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@0e6e;0x02:y=@0e6f;0x03:y=@0e70;0x07:y=@063e;
  $  063.充电允许指令                            $    $  /        $    $  ANS046.BYTE004  $  switxh(x)0x00:y=@012f;0x04:y=@0422;0x05:y=@095a;0x0A:y=@0e5a;0x0B:y=@0e5b;0x0C:y=@0e5c;default:y=@0209;
  $  064.BMS(电池管理系统)请求的充电电流         $    $  A        $    $  ANS047.BYTE004  $  y=(x1*256+x2)*0.1;
  $  065.BMS(电池管理系统)请求的充电电压         $    $  V        $    $  ANS048.BYTE004  $  y=(x1*256+x2)*0.1;
  $  066.BMS(电池管理系统)热管理请求             $    $  /        $    $  ANS049.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@08ea;0x02:y=@0e5d;default:y=@0209;
  $  067.AC(空调)热管理应答                      $    $  /        $    $  ANS050.BYTE004  $  switxh(x)0x00:y=@012f;0x01:y=@08ea;0x02:y=@0693;0x03:y=@0e56;0x04:y=@0e57;0x05:y=@0e58;0x06:y=@07a3;default:y=@0209;
  $  068.电池包进水口温度                        $    $  degC     $    $  ANS051.BYTE004  $  y=x*0.5-40;
  $  069.发动机状态                              $    $  /        $    $  ANS052.BYTE004  $  switxh(x)0x00:y=@0390;0x01:y=@0e55;0x02:y=@06dc;0x03:y=@0373;0x04:y=@0209;0x05:y=@0209;0x06:y=@0421;0x07:y=@0132;
  $  070.电池包版本号                            $    $  /        $    $  ANS053.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  071.电池类型码                              $    $  /        $    $  ANS054.BYTE004  $  if(x==0x01) y=@04cc; else if(x==0x02) y=@04cd; else if(x==0x03) y=@04ce; else if(x==0x04) y=@04cf; else if(x==0x05) y=@04d0; else if(x==0x06) y=@04d1; else if(x==0x07) y=@04d2; else if(x==0xfc) y=@0951; else if(x==0xff) y=@0952; else y=@0220;
  $  072.1#模组序列号                            $    $  /        $    $  ANS055.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  073.2#模组序列号                            $    $  /        $    $  ANS055.BYTE028  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  074.3#模组序列号                            $    $  /        $    $  ANS055.BYTE052  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  075.4#模组序列号                            $    $  /        $    $  ANS055.BYTE076  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  076.5#模组序列号                            $    $  /        $    $  ANS055.BYTE100  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  077.6#模组序列号                            $    $  /        $    $  ANS055.BYTE124  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  078.7#模组序列号                            $    $  /        $    $  ANS055.BYTE148  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  079.1#模组制造日期                          $    $  /        $    $  ANS056.BYTE004  $  HEX(x1,x2,x3,x4);
  $  080.2#模组制造日期                          $    $  /        $    $  ANS056.BYTE008  $  HEX(x1,x2,x3,x4);
  $  081.3#模组制造日期                          $    $  /        $    $  ANS056.BYTE012  $  HEX(x1,x2,x3,x4);
  $  082.4#模组制造日期                          $    $  /        $    $  ANS056.BYTE016  $  HEX(x1,x2,x3,x4);
  $  083.5#模组制造日期                          $    $  /        $    $  ANS056.BYTE020  $  HEX(x1,x2,x3,x4);
  $  084.6#模组制造日期                          $    $  /        $    $  ANS056.BYTE024  $  HEX(x1,x2,x3,x4);
  $  085.7#模组制造日期                          $    $  /        $    $  ANS056.BYTE028  $  HEX(x1,x2,x3,x4);
  $  086.主控板供应商代码                        $    $  /        $    $  ANS057.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  087.主控板序列号                            $    $  /        $    $  ANS058.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  088.主控板制造日期                          $    $  /        $    $  ANS059.BYTE004  $  HEX(x1,x2,x3,x4);
  $  089.模组软件版本号                          $    $  /        $    $  ANS060.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  090.1号模组硬件版本号                       $    $  /        $    $  ANS061.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  091.2号模组硬件版本号                       $    $  /        $    $  ANS061.BYTE028  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  092.3号模组硬件版本号                       $    $  /        $    $  ANS061.BYTE052  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  093.4号模组硬件版本号                       $    $  /        $    $  ANS061.BYTE076  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  094.5号模组硬件版本号                       $    $  /        $    $  ANS061.BYTE100  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  095.6号模组硬件版本号                       $    $  /        $    $  ANS061.BYTE124  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  096.7号模组硬件版本号                       $    $  /        $    $  ANS061.BYTE148  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);

  $)  01.电芯充电老化次数
  $  01.电芯充电老化次数
  $  REQ000:7B1 03 22 4B 6D 00 00 00 00       $  ANS000:7B9 03 22 4B 6D 00 00 00 00
  $  REQ001:7B1 03 22 4B 6E 00 00 00 00       $  ANS001:7B9 03 22 4B 6E 00 00 00 00
  $  REQ002:7B1 03 22 4B 6F 00 00 00 00       $  ANS002:7B9 03 22 4B 6F 00 00 00 00
  $  REQ003:7B1 03 22 4B 70 00 00 00 00       $  ANS003:7B9 03 22 4B 70 00 00 00 00
  $  REQ004:7B1 03 22 4B 71 00 00 00 00       $  ANS004:7B9 03 22 4B 71 00 00 00 00
  $  REQ005:7B1 03 22 4B 72 00 00 00 00       $  ANS005:7B9 03 22 4B 72 00 00 00 00
  $  REQ006:7B1 03 22 4B 73 00 00 00 00       $  ANS006:7B9 03 22 4B 73 00 00 00 00
  $  REQ007:7B1 03 22 4B 74 00 00 00 00       $  ANS007:7B9 03 22 4B 74 00 00 00 00
  $  REQ008:7B1 03 22 4B 75 00 00 00 00       $  ANS008:7B9 03 22 4B 75 00 00 00 00
  $  REQ009:7B1 03 22 4B 76 00 00 00 00       $  ANS009:7B9 03 22 4B 76 00 00 00 00
  $  REQ010:7B1 03 22 4B 77 00 00 00 00       $  ANS010:7B9 03 22 4B 77 00 00 00 00
  $  REQ011:7B1 03 22 4B 78 00 00 00 00       $  ANS011:7B9 03 22 4B 78 00 00 00 00
  $  REQ012:7B1 03 22 4B 79 00 00 00 00       $  ANS012:7B9 03 22 4B 79 00 00 00 00
  $  REQ013:7B1 03 22 4B 7A 00 00 00 00       $  ANS013:7B9 03 22 4B 7A 00 00 00 00
  $  REQ014:7B1 03 22 4B 8F 00 00 00 00       $  ANS014:7B9 03 22 4B 8F 00 00 00 00
  $  REQ015:7B1 03 22 4B 7B 00 00 00 00       $  ANS015:7B9 03 22 4B 7B 00 00 00 00
  $  REQ016:7B1 03 22 4B 7C 00 00 00 00       $  ANS016:7B9 03 22 4B 7C 00 00 00 00
  $  REQ017:7B1 03 22 4B 7D 00 00 00 00       $  ANS017:7B9 03 22 4B 7D 00 00 00 00
  $  REQ018:7B1 03 22 4B 7E 00 00 00 00       $  ANS018:7B9 03 22 4B 7E 00 00 00 00
  $  REQ019:7B1 03 22 4B 7F 00 00 00 00       $  ANS019:7B9 03 22 4B 7F 00 00 00 00
  $  REQ020:7B1 03 22 4B 80 00 00 00 00       $  ANS020:7B9 03 22 4B 80 00 00 00 00
  $  REQ021:7B1 03 22 4B 81 00 00 00 00       $  ANS021:7B9 03 22 4B 81 00 00 00 00
  $  REQ022:7B1 03 22 4B 82 00 00 00 00       $  ANS022:7B9 03 22 4B 82 00 00 00 00
  $  REQ023:7B1 03 22 4B 83 00 00 00 00       $  ANS023:7B9 03 22 4B 83 00 00 00 00
  $  REQ024:7B1 03 22 4B 84 00 00 00 00       $  ANS024:7B9 03 22 4B 84 00 00 00 00
  $  REQ025:7B1 03 22 4B 85 00 00 00 00       $  ANS025:7B9 03 22 4B 85 00 00 00 00
  $  REQ026:7B1 03 22 4B 86 00 00 00 00       $  ANS026:7B9 03 22 4B 86 00 00 00 00
  $  REQ027:7B1 03 22 4B 87 00 00 00 00       $  ANS027:7B9 03 22 4B 87 00 00 00 00
  $  REQ028:7B1 03 22 4B 88 00 00 00 00       $  ANS028:7B9 03 22 4B 88 00 00 00 00
  $  REQ029:7B1 03 22 4B 89 00 00 00 00       $  ANS029:7B9 03 22 4B 89 00 00 00 00
  $  REQ030:7B1 03 22 4B 8A 00 00 00 00       $  ANS030:7B9 03 22 4B 8A 00 00 00 00
  $  REQ031:7B1 03 22 4B 8B 00 00 00 00       $  ANS031:7B9 03 22 4B 8B 00 00 00 00
  $  REQ032:7B1 03 22 4B 8C 00 00 00 00       $  ANS032:7B9 03 22 4B 8C 00 00 00 00
  $  REQ033:7B1 03 22 4B 8D 00 00 00 00       $  ANS033:7B9 03 22 4B 8D 00 00 00 00
  $  REQ034:7B1 03 22 4B 8E 00 00 00 00       $  ANS034:7B9 03 22 4B 8E 00 00 00 00
  $  REQ035:7B1 03 22 4B B0 00 00 00 00       $  ANS035:7B9 03 22 4B B0 00 00 00 00
  $  REQ036:7B1 03 22 4B B1 00 00 00 00       $  ANS036:7B9 03 22 4B B1 00 00 00 00
  $  REQ037:7B1 03 22 4B B2 00 00 00 00       $  ANS037:7B9 03 22 4B B2 00 00 00 00
  $  REQ038:7B1 03 22 4B B3 00 00 00 00       $  ANS038:7B9 03 22 4B B3 00 00 00 00
  $  REQ039:7B1 03 22 4B B4 00 00 00 00       $  ANS039:7B9 03 22 4B B4 00 00 00 00
  $  REQ040:7B1 03 22 4B B5 00 00 00 00       $  ANS040:7B9 03 22 4B B5 00 00 00 00
  $  REQ041:7B1 03 22 4B B6 00 00 00 00       $  ANS041:7B9 03 22 4B B6 00 00 00 00
  $  REQ042:7B1 03 22 4B B7 00 00 00 00       $  ANS042:7B9 03 22 4B B7 00 00 00 00
  $  REQ043:7B1 03 22 4B B8 00 00 00 00       $  ANS043:7B9 03 22 4B B8 00 00 00 00
  $  REQ044:7B1 03 22 4B B9 00 00 00 00       $  ANS044:7B9 03 22 4B B9 00 00 00 00

  $  000.电芯充电老化次数_模组_1_电芯_1                          $    $  time     $    $  ANS000.BYTE004  $  y=x;
  $  001.电芯充电老化次数_模组_1_电芯_2                          $    $  time     $    $  ANS000.BYTE005  $  y=x;
  $  002.电芯充电老化次数_模组_1_电芯_3                          $    $  time     $    $  ANS000.BYTE006  $  y=x;
  $  003.电芯充电老化次数_模组_1_电芯_4                          $    $  time     $    $  ANS000.BYTE007  $  y=x;
  $  004.电芯充电老化次数_模组_1_电芯_5                          $    $  time     $    $  ANS000.BYTE008  $  y=x;
  $  005.电芯充电老化次数_模组_1_电芯_6                          $    $  time     $    $  ANS000.BYTE009  $  y=x;
  $  006.电芯充电老化次数_模组_1_电芯_7                          $    $  time     $    $  ANS000.BYTE010  $  y=x;
  $  007.电芯充电老化次数_模组_1_电芯_8                          $    $  time     $    $  ANS000.BYTE011  $  y=x;
  $  008.电芯充电老化次数_模组_1_电芯_9                          $    $  time     $    $  ANS000.BYTE012  $  y=x;
  $  009.电芯充电老化次数_模组_1_电芯_10                         $    $  time     $    $  ANS000.BYTE013  $  y=x;
  $  010.电芯充电老化次数_模组_1_电芯_11                         $    $  time     $    $  ANS000.BYTE014  $  y=x;
  $  011.电芯充电老化次数_模组_1_电芯_12                         $    $  time     $    $  ANS000.BYTE015  $  y=x;
  $  012.电芯充电老化次数_模组_2_电芯_1                          $    $  time     $    $  ANS001.BYTE004  $  y=x;
  $  013.电芯充电老化次数_模组_2_电芯_2                          $    $  time     $    $  ANS001.BYTE005  $  y=x;
  $  014.电芯充电老化次数_模组_2_电芯_3                          $    $  time     $    $  ANS001.BYTE006  $  y=x;
  $  015.电芯充电老化次数_模组_2_电芯_4                          $    $  time     $    $  ANS001.BYTE007  $  y=x;
  $  016.电芯充电老化次数_模组_2_电芯_5                          $    $  time     $    $  ANS001.BYTE008  $  y=x;
  $  017.电芯充电老化次数_模组_2_电芯_6                          $    $  time     $    $  ANS001.BYTE009  $  y=x;
  $  018.电芯充电老化次数_模组_2_电芯_7                          $    $  time     $    $  ANS001.BYTE010  $  y=x;
  $  019.电芯充电老化次数_模组_2_电芯_8                          $    $  time     $    $  ANS001.BYTE011  $  y=x;
  $  020.电芯充电老化次数_模组_2_电芯_9                          $    $  time     $    $  ANS001.BYTE012  $  y=x;
  $  021.电芯充电老化次数_模组_2_电芯_10                         $    $  time     $    $  ANS001.BYTE013  $  y=x;
  $  022.电芯充电老化次数_模组_2_电芯_11                         $    $  time     $    $  ANS001.BYTE014  $  y=x;
  $  023.电芯充电老化次数_模组_2_电芯_12                         $    $  time     $    $  ANS001.BYTE015  $  y=x;
  $  024.电芯充电老化次数_模组_3_电芯_1                          $    $  time     $    $  ANS002.BYTE004  $  y=x;
  $  025.电芯充电老化次数_模组_3_电芯_2                          $    $  time     $    $  ANS002.BYTE005  $  y=x;
  $  026.电芯充电老化次数_模组_3_电芯_3                          $    $  time     $    $  ANS002.BYTE006  $  y=x;
  $  027.电芯充电老化次数_模组_3_电芯_4                          $    $  time     $    $  ANS002.BYTE007  $  y=x;
  $  028.电芯充电老化次数_模组_3_电芯_5                          $    $  time     $    $  ANS002.BYTE008  $  y=x;
  $  029.电芯充电老化次数_模组_3_电芯_6                          $    $  time     $    $  ANS002.BYTE009  $  y=x;
  $  030.电芯充电老化次数_模组_3_电芯_7                          $    $  time     $    $  ANS002.BYTE010  $  y=x;
  $  031.电芯充电老化次数_模组_3_电芯_8                          $    $  time     $    $  ANS002.BYTE011  $  y=x;
  $  032.电芯充电老化次数_模组_3_电芯_9                          $    $  time     $    $  ANS002.BYTE012  $  y=x;
  $  033.电芯充电老化次数_模组_3_电芯_10                         $    $  time     $    $  ANS002.BYTE013  $  y=x;
  $  034.电芯充电老化次数_模组_3_电芯_11                         $    $  time     $    $  ANS002.BYTE014  $  y=x;
  $  035.电芯充电老化次数_模组_3_电芯_12                         $    $  time     $    $  ANS002.BYTE015  $  y=x;
  $  036.电芯充电老化次数_模组_4_电芯_1                          $    $  time     $    $  ANS003.BYTE004  $  y=x;
  $  037.电芯充电老化次数_模组_4_电芯_2                          $    $  time     $    $  ANS003.BYTE005  $  y=x;
  $  038.电芯充电老化次数_模组_4_电芯_3                          $    $  time     $    $  ANS003.BYTE006  $  y=x;
  $  039.电芯充电老化次数_模组_4_电芯_4                          $    $  time     $    $  ANS003.BYTE007  $  y=x;
  $  040.电芯充电老化次数_模组_4_电芯_5                          $    $  time     $    $  ANS003.BYTE008  $  y=x;
  $  041.电芯充电老化次数_模组_4_电芯_6                          $    $  time     $    $  ANS003.BYTE009  $  y=x;
  $  042.电芯充电老化次数_模组_4_电芯_7                          $    $  time     $    $  ANS003.BYTE010  $  y=x;
  $  043.电芯充电老化次数_模组_4_电芯_8                          $    $  time     $    $  ANS003.BYTE011  $  y=x;
  $  044.电芯充电老化次数_模组_4_电芯_9                          $    $  time     $    $  ANS003.BYTE012  $  y=x;
  $  045.电芯充电老化次数_模组_4_电芯_10                         $    $  time     $    $  ANS003.BYTE013  $  y=x;
  $  046.电芯充电老化次数_模组_4_电芯_11                         $    $  time     $    $  ANS003.BYTE014  $  y=x;
  $  047.电芯充电老化次数_模组_4_电芯_12                         $    $  time     $    $  ANS003.BYTE015  $  y=x;
  $  048.电芯充电老化次数_模组_5_电芯_1                          $    $  time     $    $  ANS004.BYTE004  $  y=x;
  $  049.电芯充电老化次数_模组_5_电芯_2                          $    $  time     $    $  ANS004.BYTE005  $  y=x;
  $  050.电芯充电老化次数_模组_5_电芯_3                          $    $  time     $    $  ANS004.BYTE006  $  y=x;
  $  051.电芯充电老化次数_模组_5_电芯_4                          $    $  time     $    $  ANS004.BYTE007  $  y=x;
  $  052.电芯充电老化次数_模组_5_电芯_5                          $    $  time     $    $  ANS004.BYTE008  $  y=x;
  $  053.电芯充电老化次数_模组_5_电芯_6                          $    $  time     $    $  ANS004.BYTE009  $  y=x;
  $  054.电芯充电老化次数_模组_5_电芯_7                          $    $  time     $    $  ANS004.BYTE010  $  y=x;
  $  055.电芯充电老化次数_模组_5_电芯_8                          $    $  time     $    $  ANS004.BYTE011  $  y=x;
  $  056.电芯充电老化次数_模组_5_电芯_9                          $    $  time     $    $  ANS004.BYTE012  $  y=x;
  $  057.电芯充电老化次数_模组_5_电芯_10                         $    $  time     $    $  ANS004.BYTE013  $  y=x;
  $  058.电芯充电老化次数_模组_5_电芯_11                         $    $  time     $    $  ANS004.BYTE014  $  y=x;
  $  059.电芯充电老化次数_模组_5_电芯_12                         $    $  time     $    $  ANS004.BYTE015  $  y=x;
  $  060.电芯充电老化次数_模组_6_电芯_1                          $    $  time     $    $  ANS005.BYTE004  $  y=x;
  $  061.电芯充电老化次数_模组_6_电芯_2                          $    $  time     $    $  ANS005.BYTE005  $  y=x;
  $  062.电芯充电老化次数_模组_6_电芯_3                          $    $  time     $    $  ANS005.BYTE006  $  y=x;
  $  063.电芯充电老化次数_模组_6_电芯_4                          $    $  time     $    $  ANS005.BYTE007  $  y=x;
  $  064.电芯充电老化次数_模组_6_电芯_5                          $    $  time     $    $  ANS005.BYTE008  $  y=x;
  $  065.电芯充电老化次数_模组_6_电芯_6                          $    $  time     $    $  ANS005.BYTE009  $  y=x;
  $  066.电芯充电老化次数_模组_6_电芯_7                          $    $  time     $    $  ANS005.BYTE010  $  y=x;
  $  067.电芯充电老化次数_模组_6_电芯_8                          $    $  time     $    $  ANS005.BYTE011  $  y=x;
  $  068.电芯充电老化次数_模组_6_电芯_9                          $    $  time     $    $  ANS005.BYTE012  $  y=x;
  $  069.电芯充电老化次数_模组_6_电芯_10                         $    $  time     $    $  ANS005.BYTE013  $  y=x;
  $  070.电芯充电老化次数_模组_6_电芯_11                         $    $  time     $    $  ANS005.BYTE014  $  y=x;
  $  071.电芯充电老化次数_模组_6_电芯_12                         $    $  time     $    $  ANS005.BYTE015  $  y=x;
  $  072.电芯充电老化次数_模组_7_电芯_1                          $    $  time     $    $  ANS006.BYTE004  $  y=x;
  $  073.电芯充电老化次数_模组_7_电芯_2                          $    $  time     $    $  ANS006.BYTE005  $  y=x;
  $  074.电芯充电老化次数_模组_7_电芯_3                          $    $  time     $    $  ANS006.BYTE006  $  y=x;
  $  075.电芯充电老化次数_模组_7_电芯_4                          $    $  time     $    $  ANS006.BYTE007  $  y=x;
  $  076.电芯充电老化次数_模组_7_电芯_5                          $    $  time     $    $  ANS006.BYTE008  $  y=x;
  $  077.电芯充电老化次数_模组_7_电芯_6                          $    $  time     $    $  ANS006.BYTE009  $  y=x;
  $  078.电芯充电老化次数_模组_7_电芯_7                          $    $  time     $    $  ANS006.BYTE010  $  y=x;
  $  079.电芯充电老化次数_模组_7_电芯_8                          $    $  time     $    $  ANS006.BYTE011  $  y=x;
  $  080.电芯充电老化次数_模组_7_电芯_9                          $    $  time     $    $  ANS006.BYTE012  $  y=x;
  $  081.电芯充电老化次数_模组_7_电芯_10                         $    $  time     $    $  ANS006.BYTE013  $  y=x;
  $  082.电芯充电老化次数_模组_7_电芯_11                         $    $  time     $    $  ANS006.BYTE014  $  y=x;
  $  083.电芯充电老化次数_模组_7_电芯_12                         $    $  time     $    $  ANS006.BYTE015  $  y=x;
  $  084.电芯放电老化次数_模组_1_电芯_1                          $    $  time     $    $  ANS007.BYTE004  $  y=x;
  $  085.电芯放电老化次数_模组_1_电芯_2                          $    $  time     $    $  ANS007.BYTE005  $  y=x;
  $  086.电芯放电老化次数_模组_1_电芯_3                          $    $  time     $    $  ANS007.BYTE006  $  y=x;
  $  087.电芯放电老化次数_模组_1_电芯_4                          $    $  time     $    $  ANS007.BYTE007  $  y=x;
  $  088.电芯放电老化次数_模组_1_电芯_5                          $    $  time     $    $  ANS007.BYTE008  $  y=x;
  $  089.电芯放电老化次数_模组_1_电芯_6                          $    $  time     $    $  ANS007.BYTE009  $  y=x;
  $  090.电芯放电老化次数_模组_1_电芯_7                          $    $  time     $    $  ANS007.BYTE010  $  y=x;
  $  091.电芯放电老化次数_模组_1_电芯_8                          $    $  time     $    $  ANS007.BYTE011  $  y=x;
  $  092.电芯放电老化次数_模组_1_电芯_9                          $    $  time     $    $  ANS007.BYTE012  $  y=x;
  $  093.电芯放电老化次数_模组_1_电芯_10                         $    $  time     $    $  ANS007.BYTE013  $  y=x;
  $  094.电芯放电老化次数_模组_1_电芯_11                         $    $  time     $    $  ANS007.BYTE014  $  y=x;
  $  095.电芯放电老化次数_模组_1_电芯_12                         $    $  time     $    $  ANS007.BYTE015  $  y=x;
  $  096.电芯放电老化次数_模组_2_电芯_1                          $    $  time     $    $  ANS008.BYTE004  $  y=x;
  $  097.电芯放电老化次数_模组_2_电芯_2                          $    $  time     $    $  ANS008.BYTE005  $  y=x;
  $  098.电芯放电老化次数_模组_2_电芯_3                          $    $  time     $    $  ANS008.BYTE006  $  y=x;
  $  099.电芯放电老化次数_模组_2_电芯_4                          $    $  time     $    $  ANS008.BYTE007  $  y=x;
  $  100.电芯放电老化次数_模组_2_电芯_5                          $    $  time     $    $  ANS008.BYTE008  $  y=x;
  $  101.电芯放电老化次数_模组_2_电芯_6                          $    $  time     $    $  ANS008.BYTE009  $  y=x;
  $  102.电芯放电老化次数_模组_2_电芯_7                          $    $  time     $    $  ANS008.BYTE010  $  y=x;
  $  103.电芯放电老化次数_模组_2_电芯_8                          $    $  time     $    $  ANS008.BYTE011  $  y=x;
  $  104.电芯放电老化次数_模组_2_电芯_9                          $    $  time     $    $  ANS008.BYTE012  $  y=x;
  $  105.电芯放电老化次数_模组_2_电芯_10                         $    $  time     $    $  ANS008.BYTE013  $  y=x;
  $  106.电芯放电老化次数_模组_2_电芯_11                         $    $  time     $    $  ANS008.BYTE014  $  y=x;
  $  107.电芯放电老化次数_模组_2_电芯_12                         $    $  time     $    $  ANS008.BYTE015  $  y=x;
  $  108.电芯放电老化次数_模组_3_电芯_1                          $    $  time     $    $  ANS009.BYTE004  $  y=x;
  $  109.电芯放电老化次数_模组_3_电芯_2                          $    $  time     $    $  ANS009.BYTE005  $  y=x;
  $  110.电芯放电老化次数_模组_3_电芯_3                          $    $  time     $    $  ANS009.BYTE006  $  y=x;
  $  111.电芯放电老化次数_模组_3_电芯_4                          $    $  time     $    $  ANS009.BYTE007  $  y=x;
  $  112.电芯放电老化次数_模组_3_电芯_5                          $    $  time     $    $  ANS009.BYTE008  $  y=x;
  $  113.电芯放电老化次数_模组_3_电芯_6                          $    $  time     $    $  ANS009.BYTE009  $  y=x;
  $  114.电芯放电老化次数_模组_3_电芯_7                          $    $  time     $    $  ANS009.BYTE010  $  y=x;
  $  115.电芯放电老化次数_模组_3_电芯_8                          $    $  time     $    $  ANS009.BYTE011  $  y=x;
  $  116.电芯放电老化次数_模组_3_电芯_9                          $    $  time     $    $  ANS009.BYTE012  $  y=x;
  $  117.电芯放电老化次数_模组_3_电芯_10                         $    $  time     $    $  ANS009.BYTE013  $  y=x;
  $  118.电芯放电老化次数_模组_3_电芯_11                         $    $  time     $    $  ANS009.BYTE014  $  y=x;
  $  119.电芯放电老化次数_模组_3_电芯_12                         $    $  time     $    $  ANS009.BYTE015  $  y=x;
  $  120.电芯放电老化次数_模组_4_电芯_1                          $    $  time     $    $  ANS010.BYTE004  $  y=x;
  $  121.电芯放电老化次数_模组_4_电芯_2                          $    $  time     $    $  ANS010.BYTE005  $  y=x;
  $  122.电芯放电老化次数_模组_4_电芯_3                          $    $  time     $    $  ANS010.BYTE006  $  y=x;
  $  123.电芯放电老化次数_模组_4_电芯_4                          $    $  time     $    $  ANS010.BYTE007  $  y=x;
  $  124.电芯放电老化次数_模组_4_电芯_5                          $    $  time     $    $  ANS010.BYTE008  $  y=x;
  $  125.电芯放电老化次数_模组_4_电芯_6                          $    $  time     $    $  ANS010.BYTE009  $  y=x;
  $  126.电芯放电老化次数_模组_4_电芯_7                          $    $  time     $    $  ANS010.BYTE010  $  y=x;
  $  127.电芯放电老化次数_模组_4_电芯_8                          $    $  time     $    $  ANS010.BYTE011  $  y=x;
  $  128.电芯放电老化次数_模组_4_电芯_9                          $    $  time     $    $  ANS010.BYTE012  $  y=x;
  $  129.电芯放电老化次数_模组_4_电芯_10                         $    $  time     $    $  ANS010.BYTE013  $  y=x;
  $  130.电芯放电老化次数_模组_4_电芯_11                         $    $  time     $    $  ANS010.BYTE014  $  y=x;
  $  131.电芯放电老化次数_模组_4_电芯_12                         $    $  time     $    $  ANS010.BYTE015  $  y=x;
  $  132.电芯放电老化次数_模组_5_电芯_1                          $    $  time     $    $  ANS011.BYTE004  $  y=x;
  $  133.电芯放电老化次数_模组_5_电芯_2                          $    $  time     $    $  ANS011.BYTE005  $  y=x;
  $  134.电芯放电老化次数_模组_5_电芯_3                          $    $  time     $    $  ANS011.BYTE006  $  y=x;
  $  135.电芯放电老化次数_模组_5_电芯_4                          $    $  time     $    $  ANS011.BYTE007  $  y=x;
  $  136.电芯放电老化次数_模组_5_电芯_5                          $    $  time     $    $  ANS011.BYTE008  $  y=x;
  $  137.电芯放电老化次数_模组_5_电芯_6                          $    $  time     $    $  ANS011.BYTE009  $  y=x;
  $  138.电芯放电老化次数_模组_5_电芯_7                          $    $  time     $    $  ANS011.BYTE010  $  y=x;
  $  139.电芯放电老化次数_模组_5_电芯_8                          $    $  time     $    $  ANS011.BYTE011  $  y=x;
  $  140.电芯放电老化次数_模组_5_电芯_9                          $    $  time     $    $  ANS011.BYTE012  $  y=x;
  $  141.电芯放电老化次数_模组_5_电芯_10                         $    $  time     $    $  ANS011.BYTE013  $  y=x;
  $  142.电芯放电老化次数_模组_5_电芯_11                         $    $  time     $    $  ANS011.BYTE014  $  y=x;
  $  143.电芯放电老化次数_模组_5_电芯_12                         $    $  time     $    $  ANS011.BYTE015  $  y=x;
  $  144.电芯放电老化次数_模组_6_电芯_1                          $    $  time     $    $  ANS012.BYTE004  $  y=x;
  $  145.电芯放电老化次数_模组_6_电芯_2                          $    $  time     $    $  ANS012.BYTE005  $  y=x;
  $  146.电芯放电老化次数_模组_6_电芯_3                          $    $  time     $    $  ANS012.BYTE006  $  y=x;
  $  147.电芯放电老化次数_模组_6_电芯_4                          $    $  time     $    $  ANS012.BYTE007  $  y=x;
  $  148.电芯放电老化次数_模组_6_电芯_5                          $    $  time     $    $  ANS012.BYTE008  $  y=x;
  $  149.电芯放电老化次数_模组_6_电芯_6                          $    $  time     $    $  ANS012.BYTE009  $  y=x;
  $  150.电芯放电老化次数_模组_6_电芯_7                          $    $  time     $    $  ANS012.BYTE010  $  y=x;
  $  151.电芯放电老化次数_模组_6_电芯_8                          $    $  time     $    $  ANS012.BYTE011  $  y=x;
  $  152.电芯放电老化次数_模组_6_电芯_9                          $    $  time     $    $  ANS012.BYTE012  $  y=x;
  $  153.电芯放电老化次数_模组_6_电芯_10                         $    $  time     $    $  ANS012.BYTE013  $  y=x;
  $  154.电芯放电老化次数_模组_6_电芯_11                         $    $  time     $    $  ANS012.BYTE014  $  y=x;
  $  155.电芯放电老化次数_模组_6_电芯_12                         $    $  time     $    $  ANS012.BYTE015  $  y=x;
  $  156.电芯放电老化次数_模组_7_电芯_1                          $    $  time     $    $  ANS013.BYTE004  $  y=x;
  $  157.电芯放电老化次数_模组_7_电芯_2                          $    $  time     $    $  ANS013.BYTE005  $  y=x;
  $  158.电芯放电老化次数_模组_7_电芯_3                          $    $  time     $    $  ANS013.BYTE006  $  y=x;
  $  159.电芯放电老化次数_模组_7_电芯_4                          $    $  time     $    $  ANS013.BYTE007  $  y=x;
  $  160.电芯放电老化次数_模组_7_电芯_5                          $    $  time     $    $  ANS013.BYTE008  $  y=x;
  $  161.电芯放电老化次数_模组_7_电芯_6                          $    $  time     $    $  ANS013.BYTE009  $  y=x;
  $  162.电芯放电老化次数_模组_7_电芯_7                          $    $  time     $    $  ANS013.BYTE010  $  y=x;
  $  163.电芯放电老化次数_模组_7_电芯_8                          $    $  time     $    $  ANS013.BYTE011  $  y=x;
  $  164.电芯放电老化次数_模组_7_电芯_9                          $    $  time     $    $  ANS013.BYTE012  $  y=x;
  $  165.电芯放电老化次数_模组_7_电芯_10                         $    $  time     $    $  ANS013.BYTE013  $  y=x;
  $  166.电芯放电老化次数_模组_7_电芯_11                         $    $  time     $    $  ANS013.BYTE014  $  y=x;
  $  167.电芯放电老化次数_模组_7_电芯_12                         $    $  time     $    $  ANS013.BYTE015  $  y=x;
  $  168.1#模组供应商代码                                        $    $  /        $    $  ANS014.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  169.2#模组供应商代码                                        $    $  /        $    $  ANS014.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  170.3#模组供应商代码                                        $    $  /        $    $  ANS014.BYTE016  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  171.4#模组供应商代码                                        $    $  /        $    $  ANS014.BYTE022  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  172.5#模组供应商代码                                        $    $  /        $    $  ANS014.BYTE028  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  173.6#模组供应商代码                                        $    $  /        $    $  ANS014.BYTE034  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  174.7#模组供应商代码                                        $    $  /        $    $  ANS014.BYTE040  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  175.BMS(电池管理系统)工作时间                               $    $  min      $    $  ANS015.BYTE004  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  176.累计均衡总时间                                          $    $  min      $    $  ANS016.BYTE004  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  177.均衡功能开启状态                                        $    $  /        $    $  ANS017.BYTE004  $  switxh(x)0x00: y=@0000;0x01: y=@012d;
  $  178.均衡故障状态                                            $    $  /        $    $  ANS018.BYTE004  $  switxh(x)0x00: y=@01ac;0x01: y=@01b0;
  $  179.可用放电能量                                            $    $  KWH      $    $  ANS019.BYTE004  $  y=(x1*0x100+x2)*0.001;
  $  180.可用充电能量                                            $    $  KWH      $    $  ANS020.BYTE004  $  y=(x1*0x100+x2)*0.001;
  $  181.基于内阻的电池健康度                                    $    $  %        $    $  ANS021.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.000001;
  $  182.基于充放电循环的电池健康度                              $    $  %        $    $  ANS022.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.000001;
  $  183.基于单次充放电容量的电池健康度                          $    $  %        $    $  ANS023.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.000001;
  $  184.拟合后的电池健康度                                      $    $  %        $    $  ANS024.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.000001;
  $  185.积分SOC                                                 $    $  %        $    $  ANS025.BYTE004  $  y=x;
  $  186.高压继电器带载切断次数1                                 $    $  /        $    $  ANS026.BYTE004  $  y=x1*0x100+x2;
  $  187.高压继电器带载切断次数2                                 $    $  /        $    $  ANS027.BYTE004  $  y=x1*0x100+x2;
  $  188.高压继电器带载切断次数3                                 $    $  /        $    $  ANS028.BYTE004  $  y=x1*0x100+x2;
  $  189.高压继电器带载切断次数4                                 $    $  /        $    $  ANS029.BYTE004  $  y=x1*0x100+x2;
  $  190.电池包实际容量                                          $    $  Ah       $    $  ANS030.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  191.电流采集板供应商代码                                    $    $  /        $    $  ANS031.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  192.电流采集板序列号                                        $    $  /        $    $  ANS032.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30);
  $  193.电流采集板制造日期                                      $    $  /        $    $  ANS033.BYTE004  $  y=SPRINTF([%02d%02d-%02d-%02d],X1,X2,X3,X4);
  $  194.电池包条形码                                            $    $  /        $    $  ANS034.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27);
  $  195.电流有效性反馈                                          $    $  /        $    $  ANS035.BYTE004  $  switxh(x)0x00: y=@0169;0x01: y=@0132;0x02: y=@0e4c;0x03: y=@0e4d;0x04: y=@0e4e;0x05: y=@0e4f;0x06: y=@0e50;
  $  196.电流采集板电流值                                        $    $  A        $    $  ANS036.BYTE004  $  y=(x1*0x100+x2)*0.1-500;
  $  197.RTC时间有效性反馈                                       $    $  /        $    $  ANS037.BYTE004  $  switxh(x)0x00: y=@0e4a;0x01: y=@0169;0x02: y=@0e4b;
  $  198.RTC模式状态反馈                                         $    $  /        $    $  ANS038.BYTE004  $  switxh(x)0x00: y=@03e0;0x01: y=@094f;0x02: y=@0950;
  $  199.设置RTC模式                                             $    $  /        $    $  ANS039.BYTE004  $  switxh(x)0x00: y=@03e0;0x01: y=@094f;0x02: y=@0950;
  $  200.RTC倒计时设置状态反馈                                   $    $  /        $    $  ANS040.BYTE004  $  switxh(x)0x00: y=@0132;0x01: y=@0169;0x02: y=@00be;
  $  201.设置RTC时钟状态反馈                                     $    $  /        $    $  ANS041.BYTE004  $  switxh(x)0x00: y=@0e4a;0x01: y=@0169;0x02: y=@0e4b;
  $  202.底层上传的总压，link端电压状态反馈                      $    $  /        $    $  ANS042.BYTE004  $  switxh(x)0x00: y=@0169;0x01: y=@0132;0x02: y=@0e4c;0x03: y=@0e4d;0x04: y=@0e4e;0x05: y=@0e4f;0x06: y=@0e50;
  $  203.底层上传的OBC(车载充电机)侧电压，负继电器状态反馈       $    $  /        $    $  ANS043.BYTE004  $  switxh(x)0x00: y=@0169;0x01: y=@0132;0x02: y=@0e4c;0x03: y=@0e4d;0x04: y=@0e4e;0x05: y=@0e4f;0x06: y=@0e50;
  $  204.底层上传的负边状态                                      $    $  /        $    $  ANS044.BYTE004  $  switxh(x)0x00: y=@0ccb;0x01: y=@068c;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B1 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7B1 30 00 0B 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
