
    车型ID：0912

    模拟：协议模拟-->0912

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E9

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 00 00 00 00 00 00       $!  ANS000:7E9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9d000000


  $#  01.读故障码库
  $#  REQ000:7E1 02 19 0A 00 00 00 00 00       $#  ANS000:7E9 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9d000000


  $#  02.读全状态故障码
  $#  REQ000:7E1 03 19 02 2C 00 00 00 00       $#  ANS000:7E9 03 19 02 2C 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9d000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="2">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 12 00 00 00 00       $%  ANS000:7E9 03 22 F1 12 00 00 00 00
  $%  REQ001:7E1 03 22 F1 80 00 00 00 00       $%  ANS001:7E9 03 22 F1 80 00 00 00 00
  $%  REQ002:7E1 03 22 F1 87 00 00 00 00       $%  ANS002:7E9 03 22 F1 87 00 00 00 00
  $%  REQ003:7E1 03 22 F1 8A 00 00 00 00       $%  ANS003:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ004:7E1 03 22 F1 8B 00 00 00 00       $%  ANS004:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E1 03 22 F1 8C 00 00 00 00       $%  ANS005:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ006:7E1 03 22 F1 90 00 00 00 00       $%  ANS006:7E9 03 22 F1 90 00 00 00 00
  $%  REQ007:7E1 03 22 F1 93 00 00 00 00       $%  ANS007:7E9 03 22 F1 93 00 00 00 00
  $%  REQ008:7E1 03 22 F1 95 00 00 00 00       $%  ANS008:7E9 03 22 F1 95 00 00 00 00
  $%  REQ009:7E1 03 22 F1 98 00 00 00 00       $%  ANS009:7E9 03 22 F1 98 00 00 00 00
  $%  REQ010:7E1 03 22 F1 99 00 00 00 00       $%  ANS010:7E9 03 22 F1 99 00 00 00 00
  $%  REQ011:7E1 03 22 F1 9D 00 00 00 00       $%  ANS011:7E9 03 22 F1 9D 00 00 00 00
  $%  REQ012:7E1 03 22 F1 82 00 00 00 00       $%  ANS012:7E9 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:引导程序软件识别号:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                                      $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)刷写日期:                     $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  011:ECU(电子控制器)安装日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:标定软件版本号:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7E1 03 22 D9 00 00 00 00 00       $  ANS000:7E9 03 22 D9 00 00 00 00 00
  $  REQ001:7E1 03 22 D9 04 00 00 00 00       $  ANS001:7E9 03 22 D9 04 00 00 00 00
  $  REQ002:7E1 03 22 D9 06 00 00 00 00       $  ANS002:7E9 03 22 D9 06 00 00 00 00
  $  REQ003:7E1 03 22 D9 0C 00 00 00 00       $  ANS003:7E9 03 22 D9 0C 00 00 00 00
  $  REQ004:7E1 03 22 D9 0D 00 00 00 00       $  ANS004:7E9 03 22 D9 0D 00 00 00 00
  $  REQ005:7E1 03 22 D9 0E 00 00 00 00       $  ANS005:7E9 03 22 D9 0E 00 00 00 00
  $  REQ006:7E1 03 22 D9 1E 00 00 00 00       $  ANS006:7E9 03 22 D9 1E 00 00 00 00
  $  REQ007:7E1 03 22 D9 26 00 00 00 00       $  ANS007:7E9 03 22 D9 26 00 00 00 00
  $  REQ008:7E1 03 22 D9 27 00 00 00 00       $  ANS008:7E9 03 22 D9 27 00 00 00 00
  $  REQ009:7E1 03 22 D9 28 00 00 00 00       $  ANS009:7E9 03 22 D9 28 00 00 00 00
  $  REQ010:7E1 03 22 D9 38 00 00 00 00       $  ANS010:7E9 03 22 D9 38 00 00 00 00
  $  REQ011:7E1 03 22 D9 40 00 00 00 00       $  ANS011:7E9 03 22 D9 40 00 00 00 00
  $  REQ012:7E1 03 22 D9 41 00 00 00 00       $  ANS012:7E9 03 22 D9 41 00 00 00 00
  $  REQ013:7E1 03 22 D9 5D 00 00 00 00       $  ANS013:7E9 03 22 D9 5D 00 00 00 00
  $  REQ014:7E1 03 22 D9 61 00 00 00 00       $  ANS014:7E9 03 22 D9 61 00 00 00 00
  $  REQ015:7E1 03 22 D9 62 00 00 00 00       $  ANS015:7E9 03 22 D9 62 00 00 00 00
  $  REQ016:7E1 03 22 D9 67 00 00 00 00       $  ANS016:7E9 03 22 D9 67 00 00 00 00
  $  REQ017:7E1 03 22 D9 6A 00 00 00 00       $  ANS017:7E9 03 22 D9 6A 00 00 00 00
  $  REQ018:7E1 03 22 D9 6B 00 00 00 00       $  ANS018:7E9 03 22 D9 6B 00 00 00 00
  $  REQ019:7E1 03 22 D9 6D 00 00 00 00       $  ANS019:7E9 03 22 D9 6D 00 00 00 00
  $  REQ020:7E1 03 22 D9 70 00 00 00 00       $  ANS020:7E9 03 22 D9 70 00 00 00 00
  $  REQ021:7E1 03 22 D9 73 00 00 00 00       $  ANS021:7E9 03 22 D9 73 00 00 00 00
  $  REQ022:7E1 03 22 D9 74 00 00 00 00       $  ANS022:7E9 03 22 D9 74 00 00 00 00
  $  REQ023:7E1 03 22 D9 76 00 00 00 00       $  ANS023:7E9 03 22 D9 76 00 00 00 00
  $  REQ024:7E1 03 22 D9 79 00 00 00 00       $  ANS024:7E9 03 22 D9 79 00 00 00 00
  $  REQ025:7E1 03 22 D9 B4 00 00 00 00       $  ANS025:7E9 03 22 D9 B4 00 00 00 00
  $  REQ026:7E1 03 22 D9 CA 00 00 00 00       $  ANS026:7E9 03 22 D9 CA 00 00 00 00
  $  REQ027:7E1 03 22 D9 D2 00 00 00 00       $  ANS027:7E9 03 22 D9 D2 00 00 00 00
  $  REQ028:7E1 03 22 D9 E9 00 00 00 00       $  ANS028:7E9 03 22 D9 E9 00 00 00 00
  $  REQ029:7E1 03 22 DA 5F 00 00 00 00       $  ANS029:7E9 03 22 DA 5F 00 00 00 00
  $  REQ030:7E1 03 22 DA 60 00 00 00 00       $  ANS030:7E9 03 22 DA 60 00 00 00 00
  $  REQ031:7E1 03 22 DA 61 00 00 00 00       $  ANS031:7E9 03 22 DA 61 00 00 00 00
  $  REQ032:7E1 03 22 DA 62 00 00 00 00       $  ANS032:7E9 03 22 DA 62 00 00 00 00
  $  REQ033:7E1 03 22 DA 63 00 00 00 00       $  ANS033:7E9 03 22 DA 63 00 00 00 00
  $  REQ034:7E1 03 22 DA 64 00 00 00 00       $  ANS034:7E9 03 22 DA 64 00 00 00 00
  $  REQ035:7E1 03 22 DA 68 00 00 00 00       $  ANS035:7E9 03 22 DA 68 00 00 00 00
  $  REQ036:7E1 03 22 DA 69 00 00 00 00       $  ANS036:7E9 03 22 DA 69 00 00 00 00
  $  REQ037:7E1 03 22 DA 6A 00 00 00 00       $  ANS037:7E9 03 22 DA 6A 00 00 00 00
  $  REQ038:7E1 03 22 DA 6B 00 00 00 00       $  ANS038:7E9 03 22 DA 6B 00 00 00 00
  $  REQ039:7E1 03 22 DA 6C 00 00 00 00       $  ANS039:7E9 03 22 DA 6C 00 00 00 00
  $  REQ040:7E1 03 22 DA 6D 00 00 00 00       $  ANS040:7E9 03 22 DA 6D 00 00 00 00
  $  REQ041:7E1 03 22 DA 71 00 00 00 00       $  ANS041:7E9 03 22 DA 71 00 00 00 00
  $  REQ042:7E1 03 22 DA 72 00 00 00 00       $  ANS042:7E9 03 22 DA 72 00 00 00 00
  $  REQ043:7E1 03 22 DA 73 00 00 00 00       $  ANS043:7E9 03 22 DA 73 00 00 00 00
  $  REQ044:7E1 03 22 DA 74 00 00 00 00       $  ANS044:7E9 03 22 DA 74 00 00 00 00
  $  REQ045:7E1 03 22 DA 75 00 00 00 00       $  ANS045:7E9 03 22 DA 75 00 00 00 00
  $  REQ046:7E1 03 22 DA 76 00 00 00 00       $  ANS046:7E9 03 22 DA 76 00 00 00 00
  $  REQ047:7E1 03 22 DA 86 00 00 00 00       $  ANS047:7E9 03 22 DA 86 00 00 00 00
  $  REQ048:7E1 03 22 DA 87 00 00 00 00       $  ANS048:7E9 03 22 DA 87 00 00 00 00
  $  REQ049:7E1 03 22 DA 88 00 00 00 00       $  ANS049:7E9 03 22 DA 88 00 00 00 00
  $  REQ050:7E1 03 22 DA BD 00 00 00 00       $  ANS050:7E9 03 22 DA BD 00 00 00 00
  $  REQ051:7E1 03 22 DA BE 00 00 00 00       $  ANS051:7E9 03 22 DA BE 00 00 00 00
  $  REQ052:7E1 03 22 DA BF 00 00 00 00       $  ANS052:7E9 03 22 DA BF 00 00 00 00
  $  REQ053:7E1 03 22 DA C0 00 00 00 00       $  ANS053:7E9 03 22 DA C0 00 00 00 00
  $  REQ054:7E1 03 22 DA C1 00 00 00 00       $  ANS054:7E9 03 22 DA C1 00 00 00 00
  $  REQ055:7E1 03 22 DA C2 00 00 00 00       $  ANS055:7E9 03 22 DA C2 00 00 00 00
  $  REQ056:7E1 03 22 DA C3 00 00 00 00       $  ANS056:7E9 03 22 DA C3 00 00 00 00
  $  REQ057:7E1 03 22 DA C4 00 00 00 00       $  ANS057:7E9 03 22 DA C4 00 00 00 00
  $  REQ058:7E1 03 22 DA C5 00 00 00 00       $  ANS058:7E9 03 22 DA C5 00 00 00 00
  $  REQ059:7E1 03 22 DA CC 00 00 00 00       $  ANS059:7E9 03 22 DA CC 00 00 00 00
  $  REQ060:7E1 03 22 DA CD 00 00 00 00       $  ANS060:7E9 03 22 DA CD 00 00 00 00
  $  REQ061:7E1 03 22 DA CE 00 00 00 00       $  ANS061:7E9 03 22 DA CE 00 00 00 00
  $  REQ062:7E1 03 22 DA DB 00 00 00 00       $  ANS062:7E9 03 22 DA DB 00 00 00 00
  $  REQ063:7E1 03 22 DA DC 00 00 00 00       $  ANS063:7E9 03 22 DA DC 00 00 00 00
  $  REQ064:7E1 03 22 DA DD 00 00 00 00       $  ANS064:7E9 03 22 DA DD 00 00 00 00
  $  REQ065:7E1 03 22 DA DE 00 00 00 00       $  ANS065:7E9 03 22 DA DE 00 00 00 00
  $  REQ066:7E1 03 22 DA DF 00 00 00 00       $  ANS066:7E9 03 22 DA DF 00 00 00 00
  $  REQ067:7E1 03 22 DA E3 00 00 00 00       $  ANS067:7E9 03 22 DA E3 00 00 00 00
  $  REQ068:7E1 03 22 DA E4 00 00 00 00       $  ANS068:7E9 03 22 DA E4 00 00 00 00
  $  REQ069:7E1 03 22 DA E5 00 00 00 00       $  ANS069:7E9 03 22 DA E5 00 00 00 00
  $  REQ070:7E1 03 22 DA E6 00 00 00 00       $  ANS070:7E9 03 22 DA E6 00 00 00 00
  $  REQ071:7E1 03 22 DA E8 00 00 00 00       $  ANS071:7E9 03 22 DA E8 00 00 00 00
  $  REQ072:7E1 03 22 DA EA 00 00 00 00       $  ANS072:7E9 03 22 DA EA 00 00 00 00
  $  REQ073:7E1 03 22 DA EB 00 00 00 00       $  ANS073:7E9 03 22 DA EB 00 00 00 00
  $  REQ074:7E1 03 22 DA ED 00 00 00 00       $  ANS074:7E9 03 22 DA ED 00 00 00 00
  $  REQ075:7E1 03 22 DA EE 00 00 00 00       $  ANS075:7E9 03 22 DA EE 00 00 00 00
  $  REQ076:7E1 03 22 DA EF 00 00 00 00       $  ANS076:7E9 03 22 DA EF 00 00 00 00
  $  REQ077:7E1 03 22 DA C6 00 00 00 00       $  ANS077:7E9 03 22 DA C6 00 00 00 00
  $  REQ078:7E1 03 22 DA C7 00 00 00 00       $  ANS078:7E9 03 22 DA C7 00 00 00 00
  $  REQ079:7E1 03 22 DA C8 00 00 00 00       $  ANS079:7E9 03 22 DA C8 00 00 00 00
  $  REQ080:7E1 03 22 DA C9 00 00 00 00       $  ANS080:7E9 03 22 DA C9 00 00 00 00
  $  REQ081:7E1 03 22 DA CA 00 00 00 00       $  ANS081:7E9 03 22 DA CA 00 00 00 00
  $  REQ082:7E1 03 22 DA CB 00 00 00 00       $  ANS082:7E9 03 22 DA CB 00 00 00 00
  $  REQ083:7E1 03 22 DB 45 00 00 00 00       $  ANS083:7E9 03 22 DB 45 00 00 00 00
  $  REQ084:7E1 03 22 DD 01 00 00 00 00       $  ANS084:7E9 03 22 DD 01 00 00 00 00
  $  REQ085:7E1 03 22 DD 02 00 00 00 00       $  ANS085:7E9 03 22 DD 02 00 00 00 00
  $  REQ086:7E1 03 22 0B 59 00 00 00 00       $  ANS086:7E9 03 22 0B 59 00 00 00 00

  $  000.离合器冷却液温度                                $    $  degC      $    $  ANS000.BYTE004  $  if(x1<0x80)y=(x1*256+x2)*0.1;else y=(x1*256+x2)*0.1-6553.6;
  $  001.变速器关闭类型                                  $    $  /         $    $  ANS001.BYTE004  $  if(x==0x00) y=@1021; else if(x==0x01) y=@1022; else if(x==0x02) y=@1023; else if(x==0x03) y=@0d02; else y=@000b;
  $  002.变速器操作模式                                  $    $  /         $    $  ANS002.BYTE004  $  if(x==0x00) y=@0000; else if(x==0x0A) y=@0318; else if(x==0x14) y=@0d10; else if(x==0x1e) y=@030d; else if(x==0x23) y=@101f; else if(x==0x28) y=@1020; else if(x==0x32) y=@0a23; else if(x==0x3c) y=@03db;  else y=@000b;
  $  003.油泵流量                                        $    $  L/min     $    $  ANS003.BYTE004  $  y=(x1*256+x2)*0.001;
  $  004.油池温度                                        $    $  degC      $    $  ANS004.BYTE004  $  if(x1<0x80)y=(x1*256+x2)*0.01;else y=(x1*256+x2)*0.01-655.36;
  $  005.离合器1中期触点                                 $    $  mm        $    $  ANS005.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2-65536)*0.01;
  $  006.离合器1摩擦系数                                 $    $  /         $    $  ANS006.BYTE004  $  y=(x1*0x100+x2);
  $  007.离合器1温度                                     $    $  degC      $    $  ANS007.BYTE004  $  if(x1<0x80)y=x1*256+x2;else y=x1*256+x2-65536;
  $  008.离合器1力矩可靠度                               $    $  /         $    $  ANS008.BYTE004  $  switxh(x)0x00:y=@0a73;0x01:y=@00bc;0x02:y=@02fa;0x03:y=@00bd; default:y=@000b;
  $  009.离合器2中期触点                                 $    $  mm        $    $  ANS009.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2-65536)*0.01;
  $  010.离合器2摩擦系数                                 $    $  /         $    $  ANS010.BYTE004  $  y=(x1*0x100+x2);
  $  011.离合器2温度                                     $    $  degC      $    $  ANS011.BYTE004  $  if(x1<0x80)y=x1*256+x2;else y=x1*256+x2-65536;
  $  012.离合器2力矩可靠度                               $    $  /         $    $  ANS012.BYTE004  $  switxh(x)0:y=@0a73;1:y=@00bc;2:y=@02fa;3:y=@00bd; default:y=@000b;
  $  013.输入轴目标档位(奇数档)                          $    $  /         $    $  ANS013.BYTE004  $  switxh(x)0x00:y=@011f;0x01:y=@0118;0x03:y=@011a;0x05:y=@011c;0x07:y=@02bd;0x09:y=@0b00;0xFF:y=@0b01;default:y=@0b02;
  $  014.输入轴目标档位(偶数档)                          $    $  /         $    $  ANS013.BYTE005  $  switxh(x)0x00:y=@011f;0x02:y=@0119;0x04:y=@011b;0x06:y=@011d;0x08:y=@011e;0xFF:y=@0b01;default:y=@0b02;
  $  015.换挡执行机构位置                                $    $  mm        $    $  ANS014.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2)*0.01-655.36;
  $  016.选档执行机构位置                                $    $  mm        $    $  ANS015.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2)*0.01-655.36;
  $  017.参考位置搜寻                                    $    $  /         $    $  ANS016.BYTE004  $  if(((x>>0)&1)) y=@0aff; else y=@02df;
  $  018.HCA(静液式离合器执行机构)1电源信号电压          $    $  V         $    $  ANS017.BYTE004  $  y=(x1*0x100+x2)*0.01;
  $  019.HCA(静液式离合器执行机构)1电路板温度            $    $  degC      $    $  ANS018.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=x1*0x100+x2;else y=x1*0x100+x2-65536;
  $  020.HCA(静液式离合器执行机构)1启动信号              $    $  /         $    $  ANS019.BYTE004  $  if(x==0x00) y=@1028; else if(x==0x01) y=@0191; else y=@000b;
  $  021.HCA(静液式离合器执行机构)1目标位置              $    $  mm        $    $  ANS020.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2)*0.01-655.36;
  $  022.HCA(静液式离合器执行机构)2电源信号电压          $    $  V         $    $  ANS021.BYTE004  $  y=(x1*0x100+x2)*0.01;
  $  023.HCA(静液式离合器执行机构)2电路板温度            $    $  degC      $    $  ANS022.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=x1*0x100+x2;else y=x1*0x100+x2-65536;
  $  024.HCA(静液式离合器执行机构)2启动信号              $    $  /         $    $  ANS023.BYTE004  $  if(x==0x00) y=@1028; else if(x==0x01) y=@0191; else y=@000b;
  $  025.HCA(静液式离合器执行机构)2目标位置              $    $  mm        $    $  ANS024.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2)*0.01-655.36;
  $  026.离合器扭矩                                      $    $  Nm        $    $  ANS025.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=x1*0x100+x2;else y=x1*0x100+x2-65536;
  $  027.变速器锁止请求                                  $    $  /         $    $  ANS026.BYTE004  $  if(x==0x00) y=@0220; else if(x==0x01) y=@01d0; else if(x==0x02) y=@010a; else y=@000b;
  $  028.变速器驻车锁止                                  $    $  /         $    $  ANS027.BYTE004  $  if(x==0x00) y=@1025; else if(x==0x01) y=@1026; else if(x==0x02) y=@1027;else if(x==0x03) y=@0220; else y=@000b;
  $  029.暖机循环                                        $    $  /         $    $  ANS028.BYTE004  $  if(x==0x00) y=@010e; else if(x==0x01) y=@0170; else y=@000b;
  $  030.选档电机实际电压                                $    $  V         $    $  ANS029.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2-65536)*0.01;
  $  031.换挡电机实际电压                                $    $  V         $    $  ANS030.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2-65536)*0.01;
  $  032.油泵电机实际电压                                $    $  V         $    $  ANS031.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2-65536)*0.01;
  $  033.选档电机驱动能效                                $    $  %         $    $  ANS032.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  034.换挡电机驱动能效                                $    $  %         $    $  ANS033.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  035.油泵电机驱动能效                                $    $  %         $    $  ANS034.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  036.选档电机当前霍尔传感器电压                      $    $  V         $    $  ANS035.BYTE004  $  y = (x1*0x100+x2)*0.001;
  $  037.换挡电机当前霍尔传感器电压                      $    $  V         $    $  ANS036.BYTE004  $  y = (x1*0x100+x2)*0.001;
  $  038.油泵电机当前霍尔传感器电压                      $    $  V         $    $  ANS037.BYTE004  $  y = (x1*0x100+x2)*0.001;
  $  039.选档电机驱动相位电压                            $    $  V         $    $  ANS038.BYTE004  $  y = (x1*0x100+x2)*0.001;
  $  040.换挡电机驱动相位电压                            $    $  V         $    $  ANS039.BYTE004  $  y = (x1*0x100+x2)*0.001;
  $  041.油泵电机驱动相位电压                            $    $  V         $    $  ANS040.BYTE004  $  y = (x1*0x100+x2)*0.001;
  $  042.选档电机平均电流                                $    $  A         $    $  ANS041.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2)*0.01-655.36;
  $  043.换挡电机平均电流                                $    $  A         $    $  ANS042.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2)*0.01-655.36;
  $  044.油泵电机平均电流                                $    $  A         $    $  ANS043.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.01;else y=(x1*0x100+x2)*0.01-655.36;
  $  045.选档电机电流信号状态                            $    $  /         $    $  ANS044.BYTE004  $  if(x==0xf0) y=@0318; else if(x==0xAA) y=@0169; else if(x==0xff) y=@0132; else if(x==0xc3) y=@1024; else if(x==0x0f) y=@000b; else y=@000b;
  $  046.换挡电机电流信号状态                            $    $  /         $    $  ANS045.BYTE004  $  if(x==0xf0) y=@0318; else if(x==0xAA) y=@0169; else if(x==0xff) y=@0132; else if(x==0xc3) y=@1024; else if(x==0x0f) y=@000b; else y=@000b;
  $  047.油泵电机电流信号状态                            $    $  /         $    $  ANS046.BYTE004  $  if(x==0xf0) y=@0318; else if(x==0xAA) y=@0169; else if(x==0xff) y=@0132; else if(x==0xc3) y=@1024; else if(x==0x0f) y=@000b; else y=@000b;
  $  048.选档电机驱动电路工作模式                        $    $  /         $    $  ANS047.BYTE004  $  if(x==0x00) y=@102c; else if(x==0x01) y=@102d; else if(x==0x02) y=@102e; else if(x==0x03) y=@102f; else if(x==0x04) y=@1030; else if(x==0x05) y=@1031; else if(x==0x06) y=@030d; else if(x==0x07) y=@06d9; else if(x==0x08) y=@1032; else if(x==0x09) y=@1033; else if(x==0x0A) y=@1034;  else y=@000b;
  $  049.换挡电机驱动电路工作模式                        $    $  /         $    $  ANS048.BYTE004  $  if(x==0x00) y=@102c; else if(x==0x01) y=@102d; else if(x==0x02) y=@102e; else if(x==0x03) y=@102f; else if(x==0x04) y=@1030; else if(x==0x05) y=@1031; else if(x==0x06) y=@030d; else if(x==0x07) y=@06d9; else if(x==0x08) y=@1032; else if(x==0x09) y=@1033; else if(x==0x0A) y=@1034;  else y=@000b;
  $  050.油泵电机驱动电路工作模式                        $    $  /         $    $  ANS049.BYTE004  $  if(x==0x00) y=@102c; else if(x==0x01) y=@102d; else if(x==0x02) y=@102e; else if(x==0x03) y=@102f; else if(x==0x04) y=@1030; else if(x==0x05) y=@1031; else if(x==0x06) y=@030d; else if(x==0x07) y=@06d9; else if(x==0x08) y=@1032; else if(x==0x09) y=@1033; else if(x==0x0A) y=@1034;  else y=@000b;
  $  051.驻车锁位置信号状态                              $    $  /         $    $  ANS050.BYTE004  $  if(x==0xAA) y=@0169; else if(x==0xFF) y=@0132; else y=@000b;
  $  052.驻车锁位置占空比信号                            $    $  %         $    $  ANS051.BYTE004  $  y=(x1*256+x2)*0.1;
  $  053.驻车锁位置周期时间信号                          $    $  μs       $    $  ANS052.BYTE004  $  y=(x1*0x100+x2)*0.1;
  $  054.输入轴1转速信号                                 $    $  rpm       $    $  ANS053.BYTE004  $  y=x1*256+x2;
  $  055.输入轴2转速信号                                 $    $  rpm       $    $  ANS054.BYTE004  $  y=x1*256+x2;
  $  056.输出轴转速信号                                  $    $  rpm       $    $  ANS055.BYTE004  $  y=x1*256+x2;
  $  057.输入轴1转速方向信号                             $    $  /         $    $  ANS056.BYTE004  $  if(x==0x00) y=@0143; else if(x==0x01) y=@1029; else if(x==0x02) y=@102a; else if(x==0x03) y=@102b; else y=@000b;
  $  058.输入轴2转速方向信号                             $    $  /         $    $  ANS057.BYTE004  $  if(x==0x00) y=@0143; else if(x==0x01) y=@1029; else if(x==0x02) y=@102a; else if(x==0x03) y=@102b; else y=@000b;
  $  059.输出轴转速方向信号                              $    $  /         $    $  ANS058.BYTE004  $  if(x==0x00) y=@0143; else if(x==0x01) y=@1029; else if(x==0x02) y=@102a; else if(x==0x03) y=@102b; else y=@000b;
  $  060.输入轴1转速信号状态                             $    $  /         $    $  ANS059.BYTE004  $  if(x==0xAA) y=@0169; else if(x==0xFF) y=@0132; else y=@000b;
  $  061.输入轴2转速信号状态                             $    $  /         $    $  ANS060.BYTE004  $  if(x==0xAA) y=@0169; else if(x==0xFF) y=@0132; else y=@000b;
  $  062.输出轴转速信号状态                              $    $  /         $    $  ANS061.BYTE004  $  if(x==0xAA) y=@0169; else if(x==0xFF) y=@0132; else y=@000b;
  $  063.芯片温度信号负温度系数热敏电阻器1(asic)         $    $  degC      $    $  ANS062.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.1;else y=(x1*0x100+x2)*0.1-6553.6;
  $  064.芯片温度信号负温度系数热敏电阻器2(mosfet)       $    $  degC      $    $  ANS063.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.1;else y=(x1*0x100+x2)*0.1-6553.6;
  $  065.芯片温度信号负温度系数热敏电阻器3(mosfet)       $    $  degC      $    $  ANS064.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.1;else y=(x1*0x100+x2)*0.1-6553.6;
  $  066.芯片温度信号负温度系数热敏电阻器4(mosfet)       $    $  degC      $    $  ANS065.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.1;else y=(x1*0x100+x2)*0.1-6553.6;
  $  067.油温传感器原始电压                              $    $  V         $    $  ANS066.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  068.5V1（选挡电机）传感器供能电压                   $    $  V         $    $  ANS067.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  069.5V2（换挡电机）传感器供能电压                   $    $  V         $    $  ANS068.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  070.5V3（油泵电机）传感器供能电压                   $    $  V         $    $  ANS069.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  071.电池高功率电压（CL滤波器之后）                  $    $  V         $    $  ANS070.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  072.点火线电压                                      $    $  V         $    $  ANS071.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  073.电池line1原始电流                               $    $  A         $    $  ANS072.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.001;else y=(x1*0x100+x2-65536)*0.001;
  $  074.电池line2原始电流                               $    $  A         $    $  ANS073.BYTE004  $  if((x1*0x100+x2)<0x7FFF)y=(x1*0x100+x2)*0.001;else y=(x1*0x100+x2-65536)*0.001;
  $  075.电池平均电压                                    $    $  V         $    $  ANS074.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  076.电池line1原始电压                               $    $  V         $    $  ANS075.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  077.电池line2原始电压                               $    $  V         $    $  ANS076.BYTE004  $  if((x1*0x100+x2)<0x7FFF) y=(x1*0x100+x2)*0.001; else y=@0008;
  $  078.输入1轴轴速脉冲宽度信号                         $    $  μs       $    $  ANS077.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  079.输入2轴轴速脉冲宽度信号                         $    $  μs       $    $  ANS078.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  080.输出轴轴速脉冲宽度信号                          $    $  μs       $    $  ANS079.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  081.输入1轴轴速周期时间信号                         $    $  μs       $    $  ANS080.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  082.输入2轴轴速周期时间信号                         $    $  μs       $    $  ANS081.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  083.输出轴轴速周期时间信号                          $    $  μs       $    $  ANS082.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  084.TCU(自动变速器控制单元)实际运行时间             $    $  s         $    $  ANS083.BYTE004  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  085.总里程                                          $    $  km        $    $  ANS084.BYTE004  $  y=x1*0x10000+x2*0x100+x3;
  $  086.车辆蓄电池电压                                  $    $  V         $    $  ANS085.BYTE004  $  y=x*0.25;
  $  087.坡道补偿模式                                    $    $  /         $    $  ANS086.BYTE004  $  if(x==0x00)y=@001d;else if(x==0x01)y=@001c;else y=@0209;

  $)  01.离合器模型1EOL完成状态
  $  01.离合器模型1EOL完成状态
  $  REQ000:7E1 03 22 D9 63 00 00 00 00       $  ANS000:7E9 03 22 D9 63 00 00 00 00

  $  000.离合器触点学习             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0aff; else y=@02df;
  $  001.离合器特性曲线自适应       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0aff; else y=@02df;
  $  002.离合器参数学习             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0aff; else y=@02df;
  $  003.离合器交互                 $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0aff; else y=@02df;
  $  004.离合器压力曲线             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0aff; else y=@02df;
  $  005.离合器压力模型参数         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0aff; else y=@02df;
  $  006.离合器压力交互             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0aff; else y=@02df;

  $)  02.离合器执行机构1EOL完成状态
  $  02.离合器执行机构1EOL完成状态
  $  REQ000:7E1 03 22 D9 64 00 00 00 00       $  ANS000:7E9 03 22 D9 64 00 00 00 00

  $  000.离合器参考位置             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0aff; else y=@02df;
  $  001.离合器注油检测             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0aff; else y=@02df;
  $  002.离合器装配状态             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0aff; else y=@02df;
  $  003.离合器载荷曲线自适应       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0aff; else y=@02df;
  $  004.离合器初始调整             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0aff; else y=@02df;
  $  005.离合器自分离               $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0aff; else y=@02df;

  $)  03.离合器模型2EOL完成状态
  $  03.离合器模型2EOL完成状态
  $  REQ000:7E1 03 22 D9 65 00 00 00 00       $  ANS000:7E9 03 22 D9 65 00 00 00 00

  $  000.离合器触点学习             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0aff; else y=@02df;
  $  001.离合器特性曲线自适应       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0aff; else y=@02df;
  $  002.离合器参数学习             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0aff; else y=@02df;
  $  003.离合器交互                 $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0aff; else y=@02df;
  $  004.离合器压力曲线             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0aff; else y=@02df;
  $  005.离合器压力模型参数         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0aff; else y=@02df;
  $  006.离合器压力交互             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0aff; else y=@02df;

  $)  04.离合器执行机构2EOL完成状态
  $  04.离合器执行机构2EOL完成状态
  $  REQ000:7E1 03 22 D9 66 00 00 00 00       $  ANS000:7E9 03 22 D9 66 00 00 00 00

  $  000.离合器参考位置             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0aff; else y=@02df;
  $  001.离合器注油检测             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0aff; else y=@02df;
  $  002.离合器装配状态             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0aff; else y=@02df;
  $  003.离合器载荷曲线自适应       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0aff; else y=@02df;
  $  004.离合器初始调整             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0aff; else y=@02df;
  $  005.离合器自分离               $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0aff; else y=@02df;

  $)  05.挡位自学习状态
  $  05.挡位自学习状态
  $  REQ000:7E1 03 22 D9 68 00 00 00 00       $  ANS000:7E9 03 22 D9 68 00 00 00 00

  $  000.一挡学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0aff; else y=@02df;
  $  001.二挡学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0aff; else y=@02df;
  $  002.三档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0aff; else y=@02df;
  $  003.四档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0aff; else y=@02df;
  $  004.五档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0aff; else y=@02df;
  $  005.六档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0aff; else y=@02df;
  $  006.七档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0aff; else y=@02df;
  $  007.倒档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0aff; else y=@02df;
  $  008.P档学习        $    $  /     $    $  ANS000.BYTE005  $  if(((x>>0)&1)) y=@0aff; else y=@02df;

  $)  06.同步器自学习状态
  $  06.同步器自学习状态
  $  REQ000:7E1 03 22 D9 69 00 00 00 00       $  ANS000:7E9 03 22 D9 69 00 00 00 00

  $  000.一挡学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0aff; else y=@02df;
  $  001.二挡学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0aff; else y=@02df;
  $  002.三档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0aff; else y=@02df;
  $  003.四档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0aff; else y=@02df;
  $  004.五档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0aff; else y=@02df;
  $  005.六档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0aff; else y=@02df;
  $  006.七档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0aff; else y=@02df;
  $  007.倒档学习       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0aff; else y=@02df;

  $)  07.混动离合器卡钳1内部诊断信息
  $  07.混动离合器卡钳1内部诊断信息
  $  REQ000:7E1 03 22 D9 6E 00 00 00 00       $  ANS000:7E9 03 22 D9 6E 00 00 00 00

  $  000.HCA(静液式离合器执行机构)1 的PCB板温度传感器信号       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)==0 && ((x>>7)&1)==0) y=@06eb; else if(((x>>6)&1)==1 && ((x>>7)&1)==0) y=@0169; else if(((x>>6)&1)==0 && ((x>>7)&1)==1) y=@0162;  else if(((x>>6)&1)==1 && ((x>>7)&1)==1) y=@0132;
  $  001.HCA(静液式离合器执行机构)1 压力传感器信号              $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)==0 && ((x>>5)&1)==0) y=@06eb; else if(((x>>4)&1)==1 && ((x>>5)&1)==0) y=@0169; else if(((x>>4)&1)==0 && ((x>>5)&1)==1) y=@0162;  else if(((x>>4)&1)==1 && ((x>>5)&1)==1) y=@0132;
  $  002.HCA(静液式离合器执行机构)1 行程传感器信号              $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)==0 && ((x>>3)&1)==0) y=@06eb; else if(((x>>2)&1)==1 && ((x>>3)&1)==0) y=@0169; else if(((x>>2)&1)==0 && ((x>>3)&1)==1) y=@0162;  else if(((x>>2)&1)==1 && ((x>>3)&1)==1) y=@0132;
  $  003.HCA(静液式离合器执行机构)1 角度传感器信号              $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)==0 && ((x>>1)&1)==0) y=@06eb; else if(((x>>0)&1)==1 && ((x>>1)&1)==0) y=@0169; else if(((x>>0)&1)==0 && ((x>>1)&1)==1) y=@0162;  else if(((x>>0)&1)==1 && ((x>>1)&1)==1) y=@0132;

  $)  08.混动离合器卡钳1内部诊断信息2
  $  08.混动离合器卡钳1内部诊断信息2
  $  REQ000:7E1 03 22 D9 6F 00 00 00 00       $  ANS000:7E9 03 22 D9 6F 00 00 00 00

  $  000.HCA(静液式离合器执行机构)1 数字模拟信号转换       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)==0 && ((x>>7)&1)==0) y=@06eb; else if(((x>>6)&1)==1 && ((x>>7)&1)==0) y=@0169; else if(((x>>6)&1)==0 && ((x>>7)&1)==1) y=@0162;  else if(((x>>6)&1)==1 && ((x>>7)&1)==1) y=@0132;
  $  001.HCA(静液式离合器执行机构)1 驱动功率管过载         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)==0 && ((x>>5)&1)==0) y=@06eb; else if(((x>>4)&1)==1 && ((x>>5)&1)==0) y=@0169; else if(((x>>4)&1)==0 && ((x>>5)&1)==1) y=@0162;  else if(((x>>4)&1)==1 && ((x>>5)&1)==1) y=@0132;
  $  002.HCA(静液式离合器执行机构)1 B6驱动桥过热           $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)==0 && ((x>>3)&1)==0) y=@06eb; else if(((x>>2)&1)==1 && ((x>>3)&1)==0) y=@0169; else if(((x>>2)&1)==0 && ((x>>3)&1)==1) y=@0162;  else if(((x>>2)&1)==1 && ((x>>3)&1)==1) y=@0132;
  $  003.HCA(静液式离合器执行机构)1 芯片状态               $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)==0 && ((x>>1)&1)==0) y=@06eb; else if(((x>>0)&1)==1 && ((x>>1)&1)==0) y=@0169; else if(((x>>0)&1)==0 && ((x>>1)&1)==1) y=@0162;  else if(((x>>0)&1)==1 && ((x>>1)&1)==1) y=@0132;

  $)  09.混动离合器卡钳2内部诊断信息
  $  09.混动离合器卡钳2内部诊断信息
  $  REQ000:7E1 03 22 D9 77 00 00 00 00       $  ANS000:7E9 03 22 D9 77 00 00 00 00

  $  000.HCA(静液式离合器执行机构)2的PCB板温度传感器信号       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)==0 && ((x>>7)&1)==0) y=@06eb; else if(((x>>6)&1)==1 && ((x>>7)&1)==0) y=@0169; else if(((x>>6)&1)==0 && ((x>>7)&1)==1) y=@0162;  else if(((x>>6)&1)==1 && ((x>>7)&1)==1) y=@0132;
  $  001.HCA(静液式离合器执行机构)2 压力传感器信号             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)==0 && ((x>>5)&1)==0) y=@06eb; else if(((x>>4)&1)==1 && ((x>>5)&1)==0) y=@0169; else if(((x>>4)&1)==0 && ((x>>5)&1)==1) y=@0162;  else if(((x>>4)&1)==1 && ((x>>5)&1)==1) y=@0132;
  $  002.HCA(静液式离合器执行机构)2 行程传感器信号             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)==0 && ((x>>3)&1)==0) y=@06eb; else if(((x>>2)&1)==1 && ((x>>3)&1)==0) y=@0169; else if(((x>>2)&1)==0 && ((x>>3)&1)==1) y=@0162;  else if(((x>>2)&1)==1 && ((x>>3)&1)==1) y=@0132;
  $  003.HCA(静液式离合器执行机构)2 角度传感器信号             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)==0 && ((x>>1)&1)==0) y=@06eb; else if(((x>>0)&1)==1 && ((x>>1)&1)==0) y=@0169; else if(((x>>0)&1)==0 && ((x>>1)&1)==1) y=@0162;  else if(((x>>0)&1)==1 && ((x>>1)&1)==1) y=@0132;

  $)  10.混动离合器卡钳2内部诊断信息2
  $  10.混动离合器卡钳2内部诊断信息2
  $  REQ000:7E1 03 22 D9 78 00 00 00 00       $  ANS000:7E9 03 22 D9 78 00 00 00 00

  $  000.HCA(静液式离合器执行机构)2 数字模拟信号转换       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)==0 && ((x>>7)&1)==0) y=@06eb; else if(((x>>6)&1)==1 && ((x>>7)&1)==0) y=@0169; else if(((x>>6)&1)==0 && ((x>>7)&1)==1) y=@0162;  else if(((x>>6)&1)==1 && ((x>>7)&1)==1) y=@0132;
  $  001.HCA(静液式离合器执行机构)2 驱动功率管过载         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)==0 && ((x>>5)&1)==0) y=@06eb; else if(((x>>4)&1)==1 && ((x>>5)&1)==0) y=@0169; else if(((x>>4)&1)==0 && ((x>>5)&1)==1) y=@0162;  else if(((x>>4)&1)==1 && ((x>>5)&1)==1) y=@0132;
  $  002.HCA(静液式离合器执行机构)2 B6驱动桥过热           $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)==0 && ((x>>3)&1)==0) y=@06eb; else if(((x>>2)&1)==1 && ((x>>3)&1)==0) y=@0169; else if(((x>>2)&1)==0 && ((x>>3)&1)==1) y=@0162;  else if(((x>>2)&1)==1 && ((x>>3)&1)==1) y=@0132;
  $  003.HCA(静液式离合器执行机构)2 芯片状态               $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)==0 && ((x>>1)&1)==0) y=@06eb; else if(((x>>0)&1)==1 && ((x>>1)&1)==0) y=@0169; else if(((x>>0)&1)==0 && ((x>>1)&1)==1) y=@0162;  else if(((x>>0)&1)==1 && ((x>>1)&1)==1) y=@0132;

  $)  11.输入1轴轴速信号故障
  $  11.输入1轴轴速信号故障
  $  REQ000:7E1 03 22 DA CF 00 00 00 00       $  ANS000:7E9 03 22 DA CF 00 00 00 00

  $  000.短路到地         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0191; else y=@0190;
  $  001.开路故障         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0191; else y=@0190;
  $  002.短路到电源       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0191; else y=@0190;
  $  003.温度过高         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0191; else y=@0190;
  $  004.电压过低         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0191; else y=@0190;
  $  005.方向未知         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0191; else y=@0190;
  $  006.速度过高         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0191; else y=@0190;
  $  007.卡滞             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0191; else y=@0190;

  $)  12.输入2轴轴速信号故障
  $  12.输入2轴轴速信号故障
  $  REQ000:7E1 03 22 DB 31 00 00 00 00       $  ANS000:7E9 03 22 DB 31 00 00 00 00

  $  000.短路到地         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0191; else y=@0190;
  $  001.开路故障         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0191; else y=@0190;
  $  002.短路到电源       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0191; else y=@0190;
  $  003.温度过高         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0191; else y=@0190;
  $  004.电压过低         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0191; else y=@0190;
  $  005.方向未知         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0191; else y=@0190;
  $  006.速度过高         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0191; else y=@0190;
  $  007.卡滞             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0191; else y=@0190;

  $)  13.输出轴轴速信号故障
  $  13.输出轴轴速信号故障
  $  REQ000:7E1 03 22 DB 32 00 00 00 00       $  ANS000:7E9 03 22 DB 32 00 00 00 00

  $  000.短路到地         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0191; else y=@0190;
  $  001.开路故障         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0191; else y=@0190;
  $  002.短路到电源       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0191; else y=@0190;
  $  003.温度过高         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0191; else y=@0190;
  $  004.电压过低         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0191; else y=@0190;
  $  005.方向未知         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0191; else y=@0190;
  $  006.速度过高         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0191; else y=@0190;
  $  007.卡滞             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0191; else y=@0190;

  $)  14.读取电子油泵类型信息
  $  14.读取电子油泵类型信息
  $  REQ000:7E1 03 22 0A FF 00 00 00 00       $  ANS000:7E9 03 22 0A FF 00 00 00 00

  $  000.写入方式             $    $  /     $    $  ANS000.BYTE004  $  if(x==0) y=@09ba;else if(x==0x10) y=@09bd;else if(x==0x20) y=@09be;else y=@0008;
  $  001.油泵识别码补码       $    $  /     $    $  ANS000.BYTE005  $  y=x;
  $  002.油泵识别码           $    $  /     $    $  ANS000.BYTE006  $  if(x==0) y=@09ba;else if(x==0x15) y=@09bb;else if(x==0x2a) y=@09bc;else if(x==0xee) y=@0714;else y=@0008;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7E1 30 00 0B 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
