
    车型ID：0926

    模拟：协议模拟-->0926

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7A8

进入命令:

  $~  REQ000:7A0 02 10 01 00 00 00 00 00       $~  ANS000:7A8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7A0 02 3E 00 00 00 00 00 00       $!  ANS000:7A8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7A0 03 19 02 09 00 00 00 00       $#  ANS000:7A8 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b4000000


  $#  01.读故障码库
  $#  REQ000:7A0 02 19 0A 00 00 00 00 00       $#  ANS000:7A8 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b4000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7A0 04 14 FF FF FF 00 00 00       $$  ANS000:7A8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7A0 03 22 F1 12 00 00 00 00       $%  ANS000:7A8 03 22 F1 12 00 00 00 00
  $%  REQ001:7A0 03 22 F1 87 00 00 00 00       $%  ANS001:7A8 03 22 F1 87 00 00 00 00
  $%  REQ002:7A0 03 22 F1 89 00 00 00 00       $%  ANS002:7A8 03 22 F1 89 00 00 00 00
  $%  REQ003:7A0 03 22 F1 8A 00 00 00 00       $%  ANS003:7A8 03 22 F1 8A 00 00 00 00
  $%  REQ004:7A0 03 22 F1 8B 00 00 00 00       $%  ANS004:7A8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7A0 03 22 F1 8C 00 00 00 00       $%  ANS005:7A8 03 22 F1 8C 00 00 00 00
  $%  REQ006:7A0 03 22 F1 90 00 00 00 00       $%  ANS006:7A8 03 22 F1 90 00 00 00 00
  $%  REQ007:7A0 03 22 F1 93 00 00 00 00       $%  ANS007:7A8 03 22 F1 93 00 00 00 00
  $%  REQ008:7A0 03 22 F1 95 00 00 00 00       $%  ANS008:7A8 03 22 F1 95 00 00 00 00
  $%  REQ009:7A0 03 22 F1 97 00 00 00 00       $%  ANS009:7A8 03 22 F1 97 00 00 00 00
  $%  REQ010:7A0 03 22 F1 98 00 00 00 00       $%  ANS010:7A8 03 22 F1 98 00 00 00 00
  $%  REQ011:7A0 03 22 F1 99 00 00 00 00       $%  ANS011:7A8 03 22 F1 99 00 00 00 00
  $%  REQ012:7A0 03 22 F1 9D 00 00 00 00       $%  ANS012:7A8 03 22 F1 9D 00 00 00 00
  $%  REQ013:7A0 03 22 F1 82 00 00 00 00       $%  ANS013:7A8 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                                      $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:Geely软件版本号:                             $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)系统名称或发动机类型:         $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  010:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  011:ECU(电子控制器)刷写日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:ECU(电子控制器)安装日期:                     $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  013:标定软件版本号:                              $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7A0 03 22 68 00 00 00 00 00       $  ANS000:7A8 03 22 68 00 00 00 00 00
  $  REQ001:7A0 03 22 68 01 00 00 00 00       $  ANS001:7A8 03 22 68 01 00 00 00 00
  $  REQ002:7A0 03 22 68 03 00 00 00 00       $  ANS002:7A8 03 22 68 03 00 00 00 00
  $  REQ003:7A0 03 22 68 04 00 00 00 00       $  ANS003:7A8 03 22 68 04 00 00 00 00
  $  REQ004:7A0 03 22 68 05 00 00 00 00       $  ANS004:7A8 03 22 68 05 00 00 00 00
  $  REQ005:7A0 03 22 68 06 00 00 00 00       $  ANS005:7A8 03 22 68 06 00 00 00 00
  $  REQ006:7A0 03 22 68 09 00 00 00 00       $  ANS006:7A8 03 22 68 09 00 00 00 00
  $  REQ007:7A0 03 22 68 0A 00 00 00 00       $  ANS007:7A8 03 22 68 0A 00 00 00 00
  $  REQ008:7A0 03 22 68 0C 00 00 00 00       $  ANS008:7A8 03 22 68 0C 00 00 00 00
  $  REQ009:7A0 03 22 68 0E 00 00 00 00       $  ANS009:7A8 03 22 68 0E 00 00 00 00
  $  REQ010:7A0 03 22 68 0F 00 00 00 00       $  ANS010:7A8 03 22 68 0F 00 00 00 00
  $  REQ011:7A0 03 22 68 10 00 00 00 00       $  ANS011:7A8 03 22 68 10 00 00 00 00
  $  REQ012:7A0 03 22 68 11 00 00 00 00       $  ANS012:7A8 03 22 68 11 00 00 00 00
  $  REQ013:7A0 03 22 68 12 00 00 00 00       $  ANS013:7A8 03 22 68 12 00 00 00 00
  $  REQ014:7A0 03 22 68 14 00 00 00 00       $  ANS014:7A8 03 22 68 14 00 00 00 00
  $  REQ015:7A0 03 22 68 15 00 00 00 00       $  ANS015:7A8 03 22 68 15 00 00 00 00
  $  REQ016:7A0 03 22 68 16 00 00 00 00       $  ANS016:7A8 03 22 68 16 00 00 00 00
  $  REQ017:7A0 03 22 68 17 00 00 00 00       $  ANS017:7A8 03 22 68 17 00 00 00 00
  $  REQ018:7A0 03 22 68 18 00 00 00 00       $  ANS018:7A8 03 22 68 18 00 00 00 00
  $  REQ019:7A0 03 22 68 19 00 00 00 00       $  ANS019:7A8 03 22 68 19 00 00 00 00
  $  REQ020:7A0 03 22 68 1A 00 00 00 00       $  ANS020:7A8 03 22 68 1A 00 00 00 00
  $  REQ021:7A0 03 22 68 1E 00 00 00 00       $  ANS021:7A8 03 22 68 1E 00 00 00 00
  $  REQ022:7A0 03 22 68 2D 00 00 00 00       $  ANS022:7A8 03 22 68 2D 00 00 00 00
  $  REQ023:7A0 03 22 DF 00 00 00 00 00       $  ANS023:7A8 03 22 DF 00 00 00 00 00
  $  REQ024:7A0 03 22 68 0B 00 00 00 00       $  ANS024:7A8 03 22 68 0B 00 00 00 00
  $  REQ025:7A0 03 22 68 0D 00 00 00 00       $  ANS025:7A8 03 22 68 0D 00 00 00 00
  $  REQ026:7A0 03 22 68 1B 00 00 00 00       $  ANS026:7A8 03 22 68 1B 00 00 00 00
  $  REQ027:7A0 03 22 68 1C 00 00 00 00       $  ANS027:7A8 03 22 68 1C 00 00 00 00
  $  REQ028:7A0 03 22 68 1F 00 00 00 00       $  ANS028:7A8 03 22 68 1F 00 00 00 00
  $  REQ029:7A0 03 22 68 20 00 00 00 00       $  ANS029:7A8 03 22 68 20 00 00 00 00
  $  REQ030:7A0 03 22 68 21 00 00 00 00       $  ANS030:7A8 03 22 68 21 00 00 00 00
  $  REQ031:7A0 03 22 68 22 00 00 00 00       $  ANS031:7A8 03 22 68 22 00 00 00 00
  $  REQ032:7A0 03 22 68 23 00 00 00 00       $  ANS032:7A8 03 22 68 23 00 00 00 00
  $  REQ033:7A0 03 22 68 24 00 00 00 00       $  ANS033:7A8 03 22 68 24 00 00 00 00
  $  REQ034:7A0 03 22 68 25 00 00 00 00       $  ANS034:7A8 03 22 68 25 00 00 00 00
  $  REQ035:7A0 03 22 68 26 00 00 00 00       $  ANS035:7A8 03 22 68 26 00 00 00 00
  $  REQ036:7A0 03 22 68 27 00 00 00 00       $  ANS036:7A8 03 22 68 27 00 00 00 00
  $  REQ037:7A0 03 22 68 28 00 00 00 00       $  ANS037:7A8 03 22 68 28 00 00 00 00
  $  REQ038:7A0 03 22 68 29 00 00 00 00       $  ANS038:7A8 03 22 68 29 00 00 00 00
  $  REQ039:7A0 03 22 68 2A 00 00 00 00       $  ANS039:7A8 03 22 68 2A 00 00 00 00
  $  REQ040:7A0 03 22 68 2B 00 00 00 00       $  ANS040:7A8 03 22 68 2B 00 00 00 00
  $  REQ041:7A0 03 22 68 2E 00 00 00 00       $  ANS041:7A8 03 22 68 2E 00 00 00 00
  $  REQ042:7A0 03 22 68 31 00 00 00 00       $  ANS042:7A8 03 22 68 31 00 00 00 00
  $  REQ043:7A0 03 22 68 32 00 00 00 00       $  ANS043:7A8 03 22 68 32 00 00 00 00
  $  REQ044:7A0 03 22 68 33 00 00 00 00       $  ANS044:7A8 03 22 68 33 00 00 00 00
  $  REQ045:7A0 03 22 68 34 00 00 00 00       $  ANS045:7A8 03 22 68 34 00 00 00 00
  $  REQ046:7A0 03 22 68 35 00 00 00 00       $  ANS046:7A8 03 22 68 35 00 00 00 00

  $  000.集成电路卡识别码                                                                                          $    $  /         $    $  ANS000.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $  001.国际移动用户识别码                                                                                        $    $  /         $    $  ANS001.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  002.移动设备国际身份证码                                                                                      $    $  /         $    $  ANS002.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  003.E-CALL(紧急呼叫系统)默认呼叫中心号码                                                                      $    $  /         $    $  ANS003.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18);
  $  004.B-Call(故障救援服务)默认呼叫中心号码                                                                      $    $  /         $    $  ANS004.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18);
  $  005.I-Call(信息服务)默认呼叫中心号码                                                                          $    $  /         $    $  ANS005.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18);
  $  006.网络注册状态                                                                                              $    $  /         $    $  ANS006.BYTE004  $  switxh(x)0x00:y=@052d;0x01:y=@052e;0x02:y=@052f;0x03:y=@0530;0x04:y=@0531;default:y=@0162;
  $  007.内部电池状态                                                                                              $    $  /         $    $  ANS007.BYTE004  $  switxh(x)0x00:y=@0532;0x01:y=@0533;0x02:y=@0534;default:y=@0162;
  $  008.网络信号强度                                                                                              $    $  /         $    $  ANS008.BYTE004  $  if(0xFF==x)y=@0132;else y=x;
  $  009.系统时间                                                                                                  $    $  /         $    $  ANS009.BYTE004  $  y=SPRINTF([%02x%02x-%02x-%02x %02x:%02x:%02x],X1,X2,x3,x4,x5,x6,x7);
  $  010.天线状态                                                                                                  $    $  /         $    $  ANS010.BYTE004  $  strcat:if((x&0xFC)==0x04) y=@0b64; if((x&0xFC)==0x00) y=@0b63; if((x&0x03)==0x01) y=@01c4; if((x&0x03)==0x00) y=@01c3;
  $  011.T-BOX(远程信息处理控制器)温度                                                                             $    $  degC      $    $  ANS011.BYTE004  $  y=x-48;
  $  012.T-BOX(远程信息处理控制器)电话号码                                                                         $    $  /         $    $  ANS012.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  013.GNSS定位位置信息 最后定位位置-经度                                                                        $    $  deg/m     $    $  ANS013.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.000001- 180;
  $  014.Led背光灯状态                                                                                             $    $  /         $    $  ANS014.BYTE004  $  if(0x00==x)y=@0cdd;else if(0x01==x)y=@0cde;else y=@0162;
  $  015.公网APN专线登陆地址                                                                                       $    $  /         $    $  ANS015.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40,x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60,x61,x62,x63,x64);
  $  016.公网APN专线登陆账户名                                                                                     $    $  /         $    $  ANS016.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  017.公网APN专线登陆账户密码                                                                                   $    $  /         $    $  ANS017.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  018.私网APN专线登陆地址                                                                                       $    $  /         $    $  ANS018.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40,x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60,x61,x62,x63,x64);
  $  019.私网APN专线登陆账户名                                                                                     $    $  /         $    $  ANS019.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  020.私网APN专线登陆账户密码                                                                                   $    $  /         $    $  ANS020.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  021.PKI密码写入状态                                                                                           $    $  /         $    $  ANS021.BYTE004  $  if(x==0x00)y=@0241;else if(x==0x01)y=@0242; else y=@062f;
  $  022.ESK写入状态                                                                                               $    $  /         $    $  ANS022.BYTE004  $  switxh(x)0x00:y=@0536;0x01:y=@0f0e;default:y=@0162;
  $  023.ECU(电子控制器)供电电压                                                                                   $    $  V         $    $  ANS023.BYTE004  $  y=x*0.1;
  $  024.网络运营商国别代码                                                                                        $    $  /         $    $  ANS024.BYTE004  $  HEX(x1,x2,x3);
  $  025.网络通信制式                                                                                              $    $  /         $    $  ANS025.BYTE004  $  switxh(x)0x00:y=@0526;0x01:y=@0f1c;0x02:y=@0528;0x03:y=@0529;0x04:y=@052a;0x05:y=@052b;0x06:y=@052c;default:y=@0162;
  $  026.GNSS定位位置信息 最后定位位置-纬度                                                                        $    $  deg/m     $    $  ANS013.BYTE008  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.000001- 90;
  $  027.IP地址类型                                                                                                $    $  /         $    $  ANS026.BYTE004  $  switxh(x) 0x00:y=@0539;0x01:y=@053a;default:y=@0009;
  $  028.IP地址                                                                                                    $    $  /         $    $  ANS026.BYTE004  $  switxh(((x1>>0)&1))0x00:y=SPRINTF([%d.%d.%d.%d],X2,x3,x4,x5);0x01:y=SPRINTF([%x%x:%x%x:%x%x:%x%x:%x%x:%x%x:%x%x:%x%x],x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $  029.访问端口                                                                                                  $    $  /         $    $  ANS026.BYTE021  $  y=x1*256+x2;
  $  030.Wifi密码设置                                                                                              $    $  /         $    $  ANS027.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $  031.开始读取故障信息延时时间(车辆电源IG-ON持续XX秒数后开始故障读取的时间)                                     $    $  s         $    $  ANS028.BYTE004  $  y=x;
  $  032.故障信息定时上传间隔时间(前一次上传XX分钟数后再次开始故障读取的时间)                                      $    $  min       $    $  ANS029.BYTE004  $  y=x;
  $  033.等待网络唤醒时间(远程控制前需要唤醒整车网络等待超时的时间)                                                $    $  ms        $    $  ANS030.BYTE004  $  y=x*10;
  $  034.远程控制超时时间                                                                                          $    $  s         $    $  ANS031.BYTE004  $  y=x;
  $  035.服务器反馈超时时间                                                                                        $    $  s         $    $  ANS032.BYTE004  $  y=x;
  $  036.TBOX(远程信息处理控制器)数据上传重试次数                                                                  $    $  /         $    $  ANS033.BYTE004  $  y=x;
  $  037.TBOX(远程信息处理控制器)数据上传重试间隔时间                                                              $    $  min       $    $  ANS034.BYTE004  $  y=x;
  $  038.短信发送延时时间(MQTT失败后转为发短信的延时时间)                                                          $    $  s         $    $  ANS035.BYTE004  $  y=x;
  $  039.日志存储最大时间(日志信息存储在T-BOX(远程信息处理控制器)的最大时间)                                       $    $  h         $    $  ANS036.BYTE004  $  y=x;
  $  040.服务器数据存储最大时间(数据存在在服务器的最大时间（因T-BOX(远程信息处理控制器)处于Sleep_Pool模式）)       $    $  h         $    $  ANS037.BYTE004  $  y=x;
  $  041.空气质量信息定时上传间隔时间                                                                              $    $  min       $    $  ANS038.BYTE004  $  y=x;
  $  042.驾驶行为信息定时上传间隔时间                                                                              $    $  min       $    $  ANS039.BYTE004  $  y=x;
  $  043.远程控制结果上传延时时间（收到整车反馈的控制结果至上传车身数据的延时时间）                                $    $  ms        $    $  ANS040.BYTE004  $  y=x*10;
  $  044.睡眠时间标定                                                                                              $    $  s         $    $  ANS041.BYTE004  $  y=x1*256+x2;
  $  045.PKI写入状态                                                                                               $    $  /         $    $  ANS042.BYTE004  $  switxh(x)0x00:y=@0901;0x01:y=@09de;default:y=@0162;
  $  046.TSP访问地址                                                                                               $    $  /         $    $  ANS043.BYTE004  $  switxh(x1) 0x00:y=@0539;0x01:y=@053a;0x02:y=@0953;
  $  047.TSP访问地址                                                                                               $    $  /         $    $  ANS043.BYTE005  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40,x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60,x61,x62,x63);
  $  048.TSP访问地址                                                                                               $    $  /         $    $  ANS044.BYTE004  $  switxh(x1) 0x00:y=@0539;0x01:y=@053a;0x02:y=@0953;
  $  049.OTA升级地址                                                                                               $    $  /         $    $  ANS044.BYTE005  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40,x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60,x61,x62,x63);
  $  050.TSP访问地址                                                                                               $    $  /         $    $  ANS045.BYTE004  $  switxh(x1) 0x00:y=@0539;0x01:y=@053a;0x02:y=@0953;
  $  051.TEMlog上传地址                                                                                            $    $  /         $    $  ANS045.BYTE005  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40,x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60,x61,x62,x63);
  $  052.GB32960新能源监控功能开关状态                                                                             $    $  /         $    $  ANS046.BYTE004  $  if(x==0x00) y=@085c; else if(x==0x01) y=@085d; else y=@0220;

  $)  01.GNSS定位参数
  $  01.GNSS定位参数
  $  REQ000:7A0 03 22 68 13 00 00 00 00       $  ANS000:7A8 03 22 68 13 00 00 00 00

  $  000.GNSS定位参数1       $    $  /        $    $  ANS000.BYTE004  $  y=SPRINTF([%02x%02x-%02x-%02x %02x:%02x:%02x],X1,X2,x3,x4,x5,x6,x7);
  $  001.GNSS定位参数2       $    $  HDOP     $    $  ANS000.BYTE011  $  y=x*0.1;
  $  002.GNSS定位参数3       $    $  km/h     $    $  ANS000.BYTE012  $  y=x;
  $  003.GNSS定位参数4       $    $  deg      $    $  ANS000.BYTE013  $  y=x*2;
  $  004.GNSS定位参数5       $    $  /        $    $  ANS000.BYTE014  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7A0 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7A0 30 00 0B 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
