
    车型ID：093c

    模拟：协议模拟-->093c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7EA

进入命令:

  $~  REQ000:7E2 02 10 01 00 00 00 00 00       $~  ANS000:7EA 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E2 02 3E 00 00 00 00 00 00       $!  ANS000:7EA 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7E2 03 19 02 09 00 00 00 00       $#  ANS000:7EA 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/3b000000


  $#  01.读故障码库
  $#  REQ000:7E2 02 19 0A 00 00 00 00 00       $#  ANS000:7EA 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/3b000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E2 04 14 FF FF FF 00 00 00       $$  ANS000:7EA 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E2 03 22 F1 12 00 00 00 00       $%  ANS000:7EA 03 22 F1 12 00 00 00 00
  $%  REQ001:7E2 03 22 F1 80 00 00 00 00       $%  ANS001:7EA 03 22 F1 80 00 00 00 00
  $%  REQ002:7E2 03 22 F1 87 00 00 00 00       $%  ANS002:7EA 03 22 F1 87 00 00 00 00
  $%  REQ003:7E2 03 22 F1 8A 00 00 00 00       $%  ANS003:7EA 03 22 F1 8A 00 00 00 00
  $%  REQ004:7E2 03 22 F1 8B 00 00 00 00       $%  ANS004:7EA 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E2 03 22 F1 8C 00 00 00 00       $%  ANS005:7EA 03 22 F1 8C 00 00 00 00
  $%  REQ006:7E2 03 22 F1 90 00 00 00 00       $%  ANS006:7EA 03 22 F1 90 00 00 00 00
  $%  REQ007:7E2 03 22 F1 93 00 00 00 00       $%  ANS007:7EA 03 22 F1 93 00 00 00 00
  $%  REQ008:7E2 03 22 F1 95 00 00 00 00       $%  ANS008:7EA 03 22 F1 95 00 00 00 00
  $%  REQ009:7E2 03 22 F1 98 00 00 00 00       $%  ANS009:7EA 03 22 F1 98 00 00 00 00
  $%  REQ010:7E2 03 22 F1 99 00 00 00 00       $%  ANS010:7EA 03 22 F1 99 00 00 00 00
  $%  REQ011:7E2 03 22 F1 9D 00 00 00 00       $%  ANS011:7EA 03 22 F1 9D 00 00 00 00

  $%  000:车辆名称:                         $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:引导程序软件识别号:               $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                           $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:供应商代码:                       $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU生产日期:                      $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU序列号:                        $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:              $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU硬件版本号:                    $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU软件版本号:                    $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU刷写维修店代号或设备号:        $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU刷写日期:                      $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  011:ECU安装日期:                      $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E2 03 22 DF 00 00 00 00 00       $  ANS000:7EA 03 22 DF 00 00 00 00 00
  $  REQ001:7E2 03 22 4A 00 00 00 00 00       $  ANS001:7EA 03 22 4A 00 00 00 00 00
  $  REQ002:7E2 03 22 4A 01 00 00 00 00       $  ANS002:7EA 03 22 4A 01 00 00 00 00
  $  REQ003:7E2 03 22 4A 02 00 00 00 00       $  ANS003:7EA 03 22 4A 02 00 00 00 00
  $  REQ004:7E2 03 22 4A 03 00 00 00 00       $  ANS004:7EA 03 22 4A 03 00 00 00 00
  $  REQ005:7E2 03 22 4A 04 00 00 00 00       $  ANS005:7EA 03 22 4A 04 00 00 00 00
  $  REQ006:7E2 03 22 4A 05 00 00 00 00       $  ANS006:7EA 03 22 4A 05 00 00 00 00
  $  REQ007:7E2 03 22 4A 06 00 00 00 00       $  ANS007:7EA 03 22 4A 06 00 00 00 00
  $  REQ008:7E2 03 22 4A 07 00 00 00 00       $  ANS008:7EA 03 22 4A 07 00 00 00 00
  $  REQ009:7E2 03 22 4A 08 00 00 00 00       $  ANS009:7EA 03 22 4A 08 00 00 00 00
  $  REQ010:7E2 03 22 4A 09 00 00 00 00       $  ANS010:7EA 03 22 4A 09 00 00 00 00
  $  REQ011:7E2 03 22 4A 0A 00 00 00 00       $  ANS011:7EA 03 22 4A 0A 00 00 00 00
  $  REQ012:7E2 03 22 4A 0B 00 00 00 00       $  ANS012:7EA 03 22 4A 0B 00 00 00 00
  $  REQ013:7E2 03 22 4A 22 00 00 00 00       $  ANS013:7EA 03 22 4A 22 00 00 00 00
  $  REQ014:7E2 03 22 4A 23 00 00 00 00       $  ANS014:7EA 03 22 4A 23 00 00 00 00
  $  REQ015:7E2 03 22 4A 24 00 00 00 00       $  ANS015:7EA 03 22 4A 24 00 00 00 00
  $  REQ016:7E2 03 22 4A 25 00 00 00 00       $  ANS016:7EA 03 22 4A 25 00 00 00 00
  $  REQ017:7E2 03 22 4A 26 00 00 00 00       $  ANS017:7EA 03 22 4A 26 00 00 00 00
  $  REQ018:7E2 03 22 4A 27 00 00 00 00       $  ANS018:7EA 03 22 4A 27 00 00 00 00
  $  REQ019:7E2 03 22 4A 28 00 00 00 00       $  ANS019:7EA 03 22 4A 28 00 00 00 00
  $  REQ020:7E2 03 22 4A 29 00 00 00 00       $  ANS020:7EA 03 22 4A 29 00 00 00 00
  $  REQ021:7E2 03 22 4A 2A 00 00 00 00       $  ANS021:7EA 03 22 4A 2A 00 00 00 00
  $  REQ022:7E2 03 22 4A 2B 00 00 00 00       $  ANS022:7EA 03 22 4A 2B 00 00 00 00
  $  REQ023:7E2 03 22 4A 2C 00 00 00 00       $  ANS023:7EA 03 22 4A 2C 00 00 00 00
  $  REQ024:7E2 03 22 4A 3D 00 00 00 00       $  ANS024:7EA 03 22 4A 3D 00 00 00 00
  $  REQ025:7E2 03 22 4A 2E 00 00 00 00       $  ANS025:7EA 03 22 4A 2E 00 00 00 00
  $  REQ026:7E2 03 22 4A 2F 00 00 00 00       $  ANS026:7EA 03 22 4A 2F 00 00 00 00
  $  REQ027:7E2 03 22 4A 30 00 00 00 00       $  ANS027:7EA 03 22 4A 30 00 00 00 00
  $  REQ028:7E2 03 22 4A 34 00 00 00 00       $  ANS028:7EA 03 22 4A 34 00 00 00 00
  $  REQ029:7E2 03 22 4A 35 00 00 00 00       $  ANS029:7EA 03 22 4A 35 00 00 00 00
  $  REQ030:7E2 03 22 4A 36 00 00 00 00       $  ANS030:7EA 03 22 4A 36 00 00 00 00
  $  REQ031:7E2 03 22 4A 37 00 00 00 00       $  ANS031:7EA 03 22 4A 37 00 00 00 00
  $  REQ032:7E2 03 22 4A 38 00 00 00 00       $  ANS032:7EA 03 22 4A 38 00 00 00 00
  $  REQ033:7E2 03 22 4A 3E 00 00 00 00       $  ANS033:7EA 03 22 4A 3E 00 00 00 00
  $  REQ034:7E2 03 22 4A 3F 00 00 00 00       $  ANS034:7EA 03 22 4A 3F 00 00 00 00
  $  REQ035:7E2 03 22 4A 40 00 00 00 00       $  ANS035:7EA 03 22 4A 40 00 00 00 00
  $  REQ036:7E2 03 22 4A 41 00 00 00 00       $  ANS036:7EA 03 22 4A 41 00 00 00 00
  $  REQ037:7E2 03 22 4A 42 00 00 00 00       $  ANS037:7EA 03 22 4A 42 00 00 00 00
  $  REQ038:7E2 03 22 4A 43 00 00 00 00       $  ANS038:7EA 03 22 4A 43 00 00 00 00
  $  REQ039:7E2 03 22 4A 44 00 00 00 00       $  ANS039:7EA 03 22 4A 44 00 00 00 00
  $  REQ040:7E2 03 22 4A 45 00 00 00 00       $  ANS040:7EA 03 22 4A 45 00 00 00 00

  $  000.ECU供电电压值                                       $    $  V         $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.电量百分比                                          $    $  %         $    $  ANS001.BYTE004  $  if(x==0xff) y=@0132;else y=x;
  $  002.EMS闭合/断开电池包继电器请求                        $    $  /         $    $  ANS002.BYTE004  $  if(x==0x00) y=@068c;else if(x==0x01) y=@0ccb;
  $  003.单体均衡命令                                        $    $  /         $    $  ANS003.BYTE004  $  if(x==0x00) y=@02e8;else if(x==0x01) y=@079c;
  $  004.电池包总电压（电池包继电器内侧）                    $    $  V         $    $  ANS004.BYTE004  $  y=(x1*0x100+x2)*0.001;
  $  005.48V回路电压（电池包继电器外侧）                     $    $  V         $    $  ANS005.BYTE004  $  y=(x1*0x100+x2)*0.001;
  $  006.电池包电流                                          $    $  A         $    $  ANS006.BYTE004  $  if((x1*0x1000000+x2*0x10000+x3*0x100+x4)<=0x7FFFFFFF) y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;else if((x1*0x1000000+x2*0x10000+x3*0x100+x4)>0x7FFFFFFF) y=((x1<<24)+(x2<<16)+(x3<<8)+x4)*0.001;
  $  007.电池包温度传感器1温度                               $    $  degC      $    $  ANS007.BYTE004  $  y=(x1*0x100+x2)*0.1-40;
  $  008.电池包温度传感器2温度                               $    $  degC      $    $  ANS008.BYTE004  $  y=(x1*0x100+x2)*0.1-40;
  $  009.电池单体电压（No.1）                                $    $  V         $    $  ANS009.BYTE004  $  y=(x1*0x100+x2)*0.001;
  $  010.电池单体电压（No.2）                                $    $  V         $    $  ANS009.BYTE006  $  y=(x1*0x100+x2)*0.001;
  $  011.电池单体电压（No.3）                                $    $  V         $    $  ANS009.BYTE008  $  y=(x1*0x100+x2)*0.001;
  $  012.电池单体电压（No.4）                                $    $  V         $    $  ANS009.BYTE010  $  y=(x1*0x100+x2)*0.001;
  $  013.电池单体电压（No.5）                                $    $  V         $    $  ANS009.BYTE012  $  y=(x1*0x100+x2)*0.001;
  $  014.电池单体电压（No.6）                                $    $  V         $    $  ANS009.BYTE014  $  y=(x1*0x100+x2)*0.001;
  $  015.电池单体电压（No.7）                                $    $  V         $    $  ANS009.BYTE016  $  y=(x1*0x100+x2)*0.001;
  $  016.电池单体电压（No.8）                                $    $  V         $    $  ANS009.BYTE018  $  y=(x1*0x100+x2)*0.001;
  $  017.电池单体电压（No.9）                                $    $  V         $    $  ANS009.BYTE020  $  y=(x1*0x100+x2)*0.001;
  $  018.电池单体电压（No.10）                               $    $  V         $    $  ANS009.BYTE022  $  y=(x1*0x100+x2)*0.001;
  $  019.电池单体电压（No.11）                               $    $  V         $    $  ANS009.BYTE024  $  y=(x1*0x100+x2)*0.001;
  $  020.电池单体电压（No.12）                               $    $  V         $    $  ANS009.BYTE026  $  y=(x1*0x100+x2)*0.001;
  $  021.电池单体电压（No.13）                               $    $  V         $    $  ANS009.BYTE028  $  y=(x1*0x100+x2)*0.001;
  $  022.电池单体电压（No.14）                               $    $  V         $    $  ANS009.BYTE030  $  y=(x1*0x100+x2)*0.001;
  $  023.电池健康度                                          $    $  %         $    $  ANS010.BYTE004  $  if(x==0xff) y=@0132;else y=x;
  $  024.PCB板序列号                                         $    $  /         $    $  ANS011.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $  025.继电器状态                                          $    $  /         $    $  ANS012.BYTE004  $  if(x==0x00) y=@0170;else if(x==0x01) y=@010e;else if(x==0x02) y=@00be;else y=@0209;
  $  026.电流传感器压降                                      $    $  mV        $    $  ANS013.BYTE004  $  if((x1*0x1000000+x2*0x10000+x3*0x100+x4)<=0x7FFFFFFF) y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.0006;else if((x1*0x1000000+x2*0x10000+x3*0x100+x4)>0x7FFFFFFF) y=((x1<<24)+(x2<<16)+(x3<<8)+x4)*0.0006;
  $  027.电流传感器标定状态                                  $    $  /         $    $  ANS014.BYTE004  $  if(x==0x00) y=@058a;else if(x==0x81) y=@0ccc;else if(x==0x18) y=@0ccd;else if(x==0xff) y=@00be;else y=@0143;
  $  028.电流传感器阻值                                      $    $  uOhm      $    $  ANS015.BYTE004  $  y=(x1*0x100+x2)*0.005;
  $  029.电池电压（继电器前端电压）                          $    $  V         $    $  ANS016.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*1.526/10000;
  $  030.电池Link电压（继电器后端电压）                      $    $  V         $    $  ANS017.BYTE004  $  if((x1*0x100+x2)<=0x7FFF) y=(x1*0x100+x2)*0.01;else if((x1*0x100+x2)>0x7FFF) y=((x1*0x100+x2)-0x10000)*0.01;
  $  031.电池老化率（容量相关）                              $    $  %         $    $  ANS018.BYTE004  $  y=((x1*0x100+x2)-14535)*0.0039625;
  $  032.电池老化率（电阻相关）                              $    $  %         $    $  ANS019.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  033.电池继电器关闭次数                                  $    $  /         $    $  ANS020.BYTE004  $  y=x1*0x100+x2;
  $  034.从电池出厂开始的充电安时数                          $    $  Ah        $    $  ANS021.BYTE004  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  035.从电池出厂开始的放电安时数                          $    $  Ah        $    $  ANS021.BYTE008  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  036.电池温度传感器1的值                                 $    $  degC      $    $  ANS022.BYTE004  $  if((x1*0x100+x2)<=0x7FFF) y=(x1*0x100+x2)*0.01;else if((x1*0x100+x2)>0x7FFF) y=((x1*0x100+x2)-0x10000)*0.01;
  $  037.电池温度传感器2的值                                 $    $  degC      $    $  ANS023.BYTE004  $  if((x1*0x100+x2)<=0x7FFF) y=(x1*0x100+x2)*0.01;else if((x1*0x100+x2)>0x7FFF) y=((x1*0x100+x2)-0x10000)*0.01;
  $  038.读取标定验证码                                      $    $  /         $    $  ANS024.BYTE004  $  HEX(x1,x2,x3,x4);
  $  039.蓄电池电压低于阙值的时间（蓄电池电压低于6V）        $    $  s         $    $  ANS025.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  040.蓄电池电压低于阙值的时间（蓄电池电压低于9V）        $    $  s         $    $  ANS025.BYTE008  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  041.蓄电池电压低于阙值的时间（蓄电池电压小于11V）       $    $  s         $    $  ANS025.BYTE012  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.1;
  $  042.唤醒的次数（钥匙唤醒）                              $    $  /         $    $  ANS026.BYTE004  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  043.唤醒的次数（均衡唤醒）                              $    $  /         $    $  ANS026.BYTE008  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  044.均衡参与的电芯数量统计:区间1                        $    $  /         $    $  ANS027.BYTE004  $  y=x1*0x100+x2;
  $  045.均衡参与的电芯数量统计:区间2                        $    $  /         $    $  ANS027.BYTE006  $  y=x1*0x100+x2;
  $  046.均衡参与的电芯数量统计:区间3                        $    $  /         $    $  ANS027.BYTE008  $  y=x1*0x100+x2;
  $  047.均衡参与的电芯数量统计:区间4                        $    $  /         $    $  ANS027.BYTE010  $  y=x1*0x100+x2;
  $  048.每个电芯均衡的时间:电芯1                            $    $  min       $    $  ANS028.BYTE004  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  049.每个电芯均衡的时间:电芯2                            $    $  min       $    $  ANS028.BYTE008  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  050.每个电芯均衡的时间:电芯3                            $    $  min       $    $  ANS028.BYTE012  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  051.每个电芯均衡的时间:电芯4                            $    $  min       $    $  ANS028.BYTE016  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  052.每个电芯均衡的时间:电芯5                            $    $  min       $    $  ANS028.BYTE020  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  053.每个电芯均衡的时间:电芯6                            $    $  min       $    $  ANS028.BYTE024  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  054.每个电芯均衡的时间:电芯7                            $    $  min       $    $  ANS028.BYTE028  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  055.每个电芯均衡的时间:电芯8                            $    $  min       $    $  ANS028.BYTE032  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  056.每个电芯均衡的时间:电芯9                            $    $  min       $    $  ANS028.BYTE036  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  057.每个电芯均衡的时间:电芯10                           $    $  min       $    $  ANS028.BYTE040  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  058.每个电芯均衡的时间:电芯11                           $    $  min       $    $  ANS028.BYTE044  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  059.每个电芯均衡的时间:电芯12                           $    $  min       $    $  ANS028.BYTE048  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  060.均衡次数计数（均衡被终止的次数）                    $    $  /         $    $  ANS029.BYTE004  $  y=x1*0x100+x2;
  $  061.均衡次数计数（均衡完成的次数）                      $    $  /         $    $  ANS029.BYTE006  $  y=x1*0x100+x2;
  $  062.没有被均衡电芯的比率:1组                            $    $  /         $    $  ANS030.BYTE004  $  y=(x1*0x100+x2)*0.01;
  $  063.没有被均衡电芯的比率:2组                            $    $  /         $    $  ANS030.BYTE006  $  y=(x1*0x100+x2)*0.01;
  $  064.没有被均衡电芯的比率:3组                            $    $  /         $    $  ANS030.BYTE008  $  y=(x1*0x100+x2)*0.01;
  $  065.没有被均衡电芯的比率:4组                            $    $  /         $    $  ANS030.BYTE010  $  y=(x1*0x100+x2)*0.01;
  $  066.没有被均衡电芯的比率:5组                            $    $  /         $    $  ANS030.BYTE012  $  y=(x1*0x100+x2)*0.01;
  $  067.电池电阻老化率矩阵                                  $    $  %         $    $  ANS031.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  068.电池电量变化区间的电池功率输出:区间1                $    $  KW*h      $    $  ANS032.BYTE004  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  069.电池电量变化区间的电池功率输出:区间2                $    $  KW*h      $    $  ANS032.BYTE008  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  070.电池电量变化区间的电池功率输出:区间3                $    $  KW*h      $    $  ANS032.BYTE012  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  071.电池电量变化区间的电池功率输出:区间4                $    $  KW*h      $    $  ANS032.BYTE016  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  072.电池电量变化区间的电池功率输出:区间5                $    $  KW*h      $    $  ANS032.BYTE020  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  073.电池电量变化区间的电池功率输出:区间6                $    $  KW*h      $    $  ANS032.BYTE024  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  074.电池电量变化区间的电池功率输出:区间7                $    $  KW*h      $    $  ANS032.BYTE028  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  075.电池电量变化区间的电池功率输出:区间8                $    $  KW*h      $    $  ANS032.BYTE032  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  076.电池电量变化区间的电池功率输出:区间9                $    $  KW*h      $    $  ANS032.BYTE036  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  077.电池电量变化区间的电池功率输出:区间10               $    $  KW*h      $    $  ANS032.BYTE040  $  y=(x1*0x1000000+x2*0x10000+x3*0x100+x4)*0.001;
  $  078.车辆负载                                            $    $  %         $    $  ANS033.BYTE004  $  y=x*100/255;
  $  079.发动机水温                                          $    $  degC      $    $  ANS034.BYTE004  $  y=x-40;
  $  080.发动机转速                                          $    $  1/min     $    $  ANS035.BYTE004  $  y=INT((x1*0x100+x2)*0.25);
  $  081.车速                                                $    $  km/h      $    $  ANS036.BYTE004  $  y=x;
  $  082.节气门位置                                          $    $  %         $    $  ANS037.BYTE004  $  y=x*100/255;
  $  083.48V电池诊断执行率                                   $    $  %         $    $  ANS038.BYTE004  $  y=(x1*0x100+x2)*100/8192;
  $  084.控制模块系统电压                                    $    $  mv        $    $  ANS039.BYTE004  $  if((x1*0x100+x2)<=0x7FFF) y=(x1*0x100+x2)*20;else if((x1*0x100+x2)>0x7FFF) y=((x1*0x100+x2)-0x10000)*20;
  $  085.电池电量                                            $    $  %         $    $  ANS040.BYTE004  $  y=x*100/255;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E2 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7E2 30 00 01 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
