
    车型ID：0944

    模拟：协议模拟-->0944

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7AF

进入命令:

  $~  REQ000:7A7 02 10 01 00 00 00 00 00       $~  ANS000:7AF 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7A7 02 3E 00 00 00 00 00 00       $!  ANS000:7AF 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7A7 03 19 02 09 00 00 00 00       $#  ANS000:7AF 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b0000000


  $#  01.读故障码库
  $#  REQ000:7A7 02 19 0A 00 00 00 00 00       $#  ANS000:7AF 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b0000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7A7 04 14 FF FF FF 00 00 00       $$  ANS000:7AF 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7A7 03 22 F1 12 00 00 00 00       $%  ANS000:7AF 03 22 F1 12 00 00 00 00
  $%  REQ001:7A7 03 22 F1 80 00 00 00 00       $%  ANS001:7AF 03 22 F1 80 00 00 00 00
  $%  REQ002:7A7 03 22 F1 87 00 00 00 00       $%  ANS002:7AF 03 22 F1 87 00 00 00 00
  $%  REQ003:7A7 03 22 F1 8A 00 00 00 00       $%  ANS003:7AF 03 22 F1 8A 00 00 00 00
  $%  REQ004:7A7 03 22 F1 8B 00 00 00 00       $%  ANS004:7AF 03 22 F1 8B 00 00 00 00
  $%  REQ005:7A7 03 22 F1 8C 00 00 00 00       $%  ANS005:7AF 03 22 F1 8C 00 00 00 00
  $%  REQ006:7A7 03 22 F1 90 00 00 00 00       $%  ANS006:7AF 03 22 F1 90 00 00 00 00
  $%  REQ007:7A7 03 22 F1 93 00 00 00 00       $%  ANS007:7AF 03 22 F1 93 00 00 00 00
  $%  REQ008:7A7 03 22 F1 95 00 00 00 00       $%  ANS008:7AF 03 22 F1 95 00 00 00 00
  $%  REQ009:7A7 03 22 F1 98 00 00 00 00       $%  ANS009:7AF 03 22 F1 98 00 00 00 00
  $%  REQ010:7A7 03 22 F1 99 00 00 00 00       $%  ANS010:7AF 03 22 F1 99 00 00 00 00
  $%  REQ011:7A7 03 22 F1 9D 00 00 00 00       $%  ANS011:7AF 03 22 F1 9D 00 00 00 00
  $%  REQ012:7A7 03 22 F1 82 00 00 00 00       $%  ANS012:7AF 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:引导程序软件识别号:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                                      $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)刷写日期:                     $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  011:ECU(电子控制器)安装日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:标定软件版本号:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读数据流
  $  00.读数据流
  $  REQ000:7A7 03 22 F1 9E 00 00 00 00       $  ANS000:7AF 03 22 F1 9E 00 00 00 00
  $  REQ001:7A7 03 22 F1 8E 00 00 00 00       $  ANS001:7AF 03 22 F1 8E 00 00 00 00

  $  000.ODX文件识别号                $    $  /     $    $  ANS000.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  001.车辆制造商工具安装件号       $    $  /     $    $  ANS001.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

  $)  01.软件零件号
  $  01.软件零件号
  $  REQ000:7A7 03 22 F1 AE 00 00 00 00       $  ANS000:7AF 03 22 F1 AE 00 00 00 00

  $  000.s19文件数                  $    $  /     $    $  ANS000.BYTE004  $  HEX(x1);
  $  001.闪存驱动器软件件号         $    $  /     $    $  ANS000.BYTE005  $  HEX(x1,x2,x3,x4,x5);
  $  002.闪存驱动器软件版本号       $    $  /     $    $  ANS000.BYTE010  $  ASCII(x1,x2,x3);
  $  003.应用软件件号               $    $  /     $    $  ANS000.BYTE013  $  HEX(x1,x2,x3,x4,x5);
  $  004.应用软件版本号             $    $  /     $    $  ANS000.BYTE018  $  ASCII(x1,x2,x3);
  $  005.配置文件软件件号           $    $  /     $    $  ANS000.BYTE021  $  HEX(x1,x2,x3,x4,x5);
  $  006.配置文件软件版本号         $    $  /     $    $  ANS000.BYTE026  $  ASCII(x1,x2,x3);

  $)  02.最近一次产生的故障信息
  $  02.最近一次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE008  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE005  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE005  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE005  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE005  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE005  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE005  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE005  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE005  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE006  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE006  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE006  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE006  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE006  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE006  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE006  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE006  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE007  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE007  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE007  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE007  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE007  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE007  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE007  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  03.最近第2次产生的故障信息
  $  03.最近第2次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE016  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE012  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE012  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE012  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE012  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE012  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE012  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE012  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE012  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE013  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE013  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE013  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE013  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE013  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE013  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE013  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE013  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE014  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE014  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE014  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE014  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE014  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE014  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE014  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE014  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE015  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE015  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE015  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE015  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE015  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE015  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE015  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.最近第3次产生的故障信息
  $  00.最近第3次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE024  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE020  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE020  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE020  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE020  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE020  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE020  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE020  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE020  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE021  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE021  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE021  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE021  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE021  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE021  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE021  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE021  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE022  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE022  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE022  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE022  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE022  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE022  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE022  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE022  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE023  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE023  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE023  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE023  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE023  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE023  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE023  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  01.最近第4次产生的故障信息
  $  01.最近第4次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE032  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE028  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE028  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE028  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE028  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE028  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE028  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE028  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE028  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE029  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE029  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE029  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE029  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE029  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE029  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE029  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE029  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE030  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE030  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE030  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE030  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE030  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE030  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE030  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE030  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE031  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE031  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE031  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE031  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE031  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE031  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE031  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  02.最近第5次产生的故障信息
  $  02.最近第5次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE040  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE036  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE036  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE036  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE036  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE036  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE036  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE036  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE036  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE037  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE037  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE037  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE037  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE037  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE037  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE037  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE037  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE038  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE038  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE038  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE038  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE038  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE038  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE038  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE038  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE039  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE039  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE039  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE039  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE039  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE039  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE039  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  03.最近第6次产生的故障信息
  $  03.最近第6次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE048  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE044  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE044  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE044  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE044  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE044  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE044  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE044  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE044  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE045  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE045  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE045  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE045  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE045  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE045  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE045  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE045  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE046  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE046  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE046  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE046  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE046  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE046  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE046  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE046  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE047  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE047  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE047  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE047  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE047  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE047  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE047  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.最近第7次产生的故障信息
  $  00.最近第7次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE056  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE052  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE052  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE052  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE052  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE052  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE052  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE052  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE052  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE053  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE053  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE053  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE053  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE053  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE053  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE053  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE053  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE054  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE054  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE054  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE054  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE054  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE054  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE054  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE054  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE055  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE055  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE055  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE055  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE055  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE055  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE055  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  01.最近第8次产生的故障信息
  $  01.最近第8次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE064  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE060  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE060  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE060  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE060  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE060  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE060  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE060  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE060  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE061  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE061  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE061  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE061  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE061  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE061  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE061  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE061  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE062  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE062  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE062  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE062  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE062  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE062  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE062  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE062  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE063  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE063  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE063  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE063  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE063  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE063  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE063  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  02.最近第9次产生的故障信息
  $  02.最近第9次产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE072  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE068  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE068  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE068  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE068  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE068  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE068  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE068  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE068  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE069  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE069  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE069  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE069  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE069  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE069  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE069  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE069  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE070  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE070  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE070  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE070  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE070  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE070  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE070  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE070  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE071  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE071  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE071  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE071  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE071  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE071  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE071  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  03.最早产生的故障信息
  $  03.最早产生的故障信息
  $  REQ000:7A7 03 22 6A 04 00 00 00 00       $  ANS000:7AF 03 22 6A 04 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE080  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE076  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE076  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE076  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE076  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE076  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE076  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE076  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE076  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE077  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE077  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE077  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE077  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE077  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE077  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE077  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE077  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE078  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE078  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE078  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE078  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE078  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE078  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE078  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE078  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE079  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE079  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE079  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE079  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE079  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE079  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE079  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.最近一次产生的故障信息
  $  00.最近一次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE008  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE005  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE005  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE005  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE005  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE005  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE005  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE005  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE005  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE006  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE006  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE006  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE006  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE006  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE006  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE006  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE006  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE007  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE007  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE007  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE007  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE007  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE007  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE007  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  01.最近第2次产生的故障信息
  $  01.最近第2次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE016  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE012  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE012  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE012  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE012  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE012  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE012  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE012  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE012  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE013  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE013  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE013  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE013  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE013  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE013  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE013  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE013  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE014  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE014  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE014  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE014  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE014  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE014  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE014  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE014  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE015  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE015  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE015  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE015  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE015  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE015  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE015  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  02.最近第3次产生的故障信息
  $  02.最近第3次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE024  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE020  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE020  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE020  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE020  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE020  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE020  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE020  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE020  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE021  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE021  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE021  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE021  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE021  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE021  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE021  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE021  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE022  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE022  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE022  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE022  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE022  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE022  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE022  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE022  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE023  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE023  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE023  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE023  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE023  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE023  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE023  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  03.最近第4次产生的故障信息
  $  03.最近第4次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE032  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE028  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE028  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE028  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE028  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE028  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE028  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE028  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE028  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE029  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE029  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE029  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE029  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE029  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE029  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE029  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE029  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE030  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE030  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE030  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE030  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE030  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE030  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE030  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE030  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE031  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE031  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE031  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE031  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE031  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE031  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE031  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.最近第5次产生的故障信息
  $  00.最近第5次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE040  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE036  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE036  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE036  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE036  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE036  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE036  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE036  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE036  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE037  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE037  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE037  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE037  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE037  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE037  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE037  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE037  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE038  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE038  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE038  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE038  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE038  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE038  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE038  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE038  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE039  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE039  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE039  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE039  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE039  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE039  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE039  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  01.最近第6次产生的故障信息
  $  01.最近第6次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE048  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE044  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE044  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE044  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE044  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE044  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE044  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE044  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE044  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE045  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE045  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE045  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE045  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE045  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE045  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE045  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE045  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE046  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE046  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE046  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE046  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE046  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE046  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE046  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE046  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE047  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE047  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE047  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE047  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE047  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE047  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE047  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  02.最近第7次产生的故障信息
  $  02.最近第7次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE056  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE052  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE052  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE052  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE052  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE052  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE052  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE052  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE052  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE053  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE053  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE053  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE053  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE053  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE053  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE053  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE053  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE054  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE054  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE054  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE054  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE054  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE054  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE054  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE054  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE055  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE055  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE055  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE055  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE055  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE055  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE055  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  03.最近第8次产生的故障信息
  $  03.最近第8次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE064  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE060  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE060  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE060  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE060  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE060  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE060  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE060  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE060  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE061  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE061  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE061  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE061  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE061  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE061  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE061  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE061  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE062  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE062  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE062  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE062  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE062  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE062  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE062  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE062  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE063  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE063  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE063  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE063  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE063  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE063  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE063  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.最近第9次产生的故障信息
  $  00.最近第9次产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE072  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE068  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE068  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE068  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE068  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE068  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE068  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE068  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE068  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE069  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE069  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE069  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE069  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE069  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE069  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE069  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE069  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE070  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE070  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE070  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE070  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE070  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE070  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE070  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE070  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE071  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE071  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE071  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE071  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE071  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE071  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE071  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

  $)  01.最早产生的故障信息
  $  01.最早产生的故障信息
  $  REQ000:7A7 03 22 6A 05 00 00 00 00       $  ANS000:7AF 03 22 6A 05 00 00 00 00

  $  000.异常时间                             $    $  /     $    $  ANS000.BYTE080  $  SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0c93,x2,@0c94,x3,@0c95,x4,@0c96);
  $  001.BCM(车身控制模块)                    $    $  /     $    $  ANS000.BYTE076  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  002.PEPS(无钥匙进入一键式启动单元)       $    $  /     $    $  ANS000.BYTE076  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  003.ESCL(电子转向柱锁控制单元)           $    $  /     $    $  ANS000.BYTE076  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  004.AC(空调)                             $    $  /     $    $  ANS000.BYTE076  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  005.DSCU(驾驶员座椅控制模块)             $    $  /     $    $  ANS000.BYTE076  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  006.PTG(后背门自动举升)                  $    $  /     $    $  ANS000.BYTE076  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  007.DDM(司机门模块)                      $    $  /     $    $  ANS000.BYTE076  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  008.PDM(副驾门模块)                      $    $  /     $    $  ANS000.BYTE076  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  009.IPK(组合仪表控制单元)                $    $  /     $    $  ANS000.BYTE077  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  010.MMI(多媒体)                          $    $  /     $    $  ANS000.BYTE077  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  011.TBOX(远程信息处理控制器)             $    $  /     $    $  ANS000.BYTE077  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  012.DVR(行车记录仪)                      $    $  /     $    $  ANS000.BYTE077  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  013.HUD(抬头显示系统)                    $    $  /     $    $  ANS000.BYTE077  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  014.ESC(电子稳定控制单元)                $    $  /     $    $  ANS000.BYTE077  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  015.TCM(转向柱组合开关)                  $    $  /     $    $  ANS000.BYTE077  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  016.VCU(整车控制器)_CS                   $    $  /     $    $  ANS000.BYTE077  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  017.RML(左约束模块)                      $    $  /     $    $  ANS000.BYTE078  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  018.IB(智能制动助力增压器)               $    $  /     $    $  ANS000.BYTE078  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  019.TCU(自动变速器控制单元)              $    $  /     $    $  ANS000.BYTE078  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  020.EGSM(电子换挡器)                     $    $  /     $    $  ANS000.BYTE078  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  021.EMS(发动机管理系统)_PT               $    $  /     $    $  ANS000.BYTE078  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  022.VCU(整车控制器)_PT                   $    $  /     $    $  ANS000.BYTE078  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  023.EMS(发动机管理系统)_HB               $    $  /     $    $  ANS000.BYTE078  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;
  $  024.VCU(整车控制器)_HB                   $    $  /     $    $  ANS000.BYTE078  $  if(((x>>7)&1)) y=@0c91; else y=@0c92;
  $  025.BMSH(电池管理系统)                   $    $  /     $    $  ANS000.BYTE079  $  if(((x>>0)&1)) y=@0c91; else y=@0c92;
  $  026.IPU(集成动力控制器)                  $    $  /     $    $  ANS000.BYTE079  $  if(((x>>1)&1)) y=@0c91; else y=@0c92;
  $  027.OBC(车载充电机)                      $    $  /     $    $  ANS000.BYTE079  $  if(((x>>2)&1)) y=@0c91; else y=@0c92;
  $  028.TBOX(远程信息处理控制器)_HB          $    $  /     $    $  ANS000.BYTE079  $  if(((x>>3)&1)) y=@0c91; else y=@0c92;
  $  029.TPMS(胎压监视系统)                   $    $  /     $    $  ANS000.BYTE079  $  if(((x>>4)&1)) y=@0c91; else y=@0c92;
  $  030.AVM(全景影像模块)                    $    $  /     $    $  ANS000.BYTE079  $  if(((x>>5)&1)) y=@0c91; else y=@0c92;
  $  031.DMM                                  $    $  /     $    $  ANS000.BYTE079  $  if(((x>>6)&1)) y=@0c91; else y=@0c92;

30帧:

  $FC REQ000:7A7 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
