
    车型ID：0994

    模拟：协议模拟-->0994

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B8

进入命令:

  $~  REQ000:7B0 02 10 01 00 00 00 00 00       $~  ANS000:7B8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B0 02 3E 00 00 00 00 00 00       $!  ANS000:7B8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B0 03 19 02 09 00 00 00 00       $#  ANS000:7B8 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9b000000


  $#  01.读故障码库
  $#  REQ000:7B0 02 19 0A 00 00 00 00 00       $#  ANS000:7B8 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9b000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B0 04 14 FF FF FF 00 00 00       $$  ANS000:7B8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B0 03 22 F1 12 00 00 00 00       $%  ANS000:7B8 03 22 F1 12 00 00 00 00
  $%  REQ001:7B0 03 22 F1 80 00 00 00 00       $%  ANS001:7B8 03 22 F1 80 00 00 00 00
  $%  REQ002:7B0 03 22 F1 87 00 00 00 00       $%  ANS002:7B8 03 22 F1 87 00 00 00 00
  $%  REQ003:7B0 03 22 F1 8A 00 00 00 00       $%  ANS003:7B8 03 22 F1 8A 00 00 00 00
  $%  REQ004:7B0 03 22 F1 8B 00 00 00 00       $%  ANS004:7B8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7B0 03 22 F1 8C 00 00 00 00       $%  ANS005:7B8 03 22 F1 8C 00 00 00 00
  $%  REQ006:7B0 03 22 F1 90 00 00 00 00       $%  ANS006:7B8 03 22 F1 90 00 00 00 00
  $%  REQ007:7B0 03 22 F1 93 00 00 00 00       $%  ANS007:7B8 03 22 F1 93 00 00 00 00
  $%  REQ008:7B0 03 22 F1 95 00 00 00 00       $%  ANS008:7B8 03 22 F1 95 00 00 00 00
  $%  REQ009:7B0 03 22 F1 98 00 00 00 00       $%  ANS009:7B8 03 22 F1 98 00 00 00 00
  $%  REQ010:7B0 03 22 F1 99 00 00 00 00       $%  ANS010:7B8 03 22 F1 99 00 00 00 00
  $%  REQ011:7B0 03 22 F1 9D 00 00 00 00       $%  ANS011:7B8 03 22 F1 9D 00 00 00 00
  $%  REQ012:7B0 03 22 F1 82 00 00 00 00       $%  ANS012:7B8 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:引导程序软件识别号:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                                      $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)刷写日期:                     $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  011:ECU(电子控制器)安装日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:标定软件版本号:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B0 03 22 DF 00 00 00 00 00       $  ANS000:7B8 03 22 DF 00 00 00 00 00
  $  REQ001:7B0 03 22 DF 01 00 00 00 00       $  ANS001:7B8 03 22 DF 01 00 00 00 00
  $  REQ002:7B0 03 22 4C 03 00 00 00 00       $  ANS002:7B8 03 22 4C 03 00 00 00 00
  $  REQ003:7B0 03 22 4C 10 00 00 00 00       $  ANS003:7B8 03 22 4C 10 00 00 00 00
  $  REQ004:7B0 03 22 4C 11 00 00 00 00       $  ANS004:7B8 03 22 4C 11 00 00 00 00
  $  REQ005:7B0 03 22 4C 12 00 00 00 00       $  ANS005:7B8 03 22 4C 12 00 00 00 00
  $  REQ006:7B0 03 22 4C 16 00 00 00 00       $  ANS006:7B8 03 22 4C 16 00 00 00 00
  $  REQ007:7B0 03 22 4C 18 00 00 00 00       $  ANS007:7B8 03 22 4C 18 00 00 00 00
  $  REQ008:7B0 03 22 4C 22 00 00 00 00       $  ANS008:7B8 03 22 4C 22 00 00 00 00
  $  REQ009:7B0 03 22 4C 40 00 00 00 00       $  ANS009:7B8 03 22 4C 40 00 00 00 00
  $  REQ010:7B0 03 22 4C 4B 00 00 00 00       $  ANS010:7B8 03 22 4C 4B 00 00 00 00
  $  REQ011:7B0 03 22 4C 4C 00 00 00 00       $  ANS011:7B8 03 22 4C 4C 00 00 00 00
  $  REQ012:7B0 03 22 4C 4D 00 00 00 00       $  ANS012:7B8 03 22 4C 4D 00 00 00 00
  $  REQ013:7B0 03 22 4C 4E 00 00 00 00       $  ANS013:7B8 03 22 4C 4E 00 00 00 00
  $  REQ014:7B0 03 22 4C 4F 00 00 00 00       $  ANS014:7B8 03 22 4C 4F 00 00 00 00
  $  REQ015:7B0 03 22 4C 5A 00 00 00 00       $  ANS015:7B8 03 22 4C 5A 00 00 00 00
  $  REQ016:7B0 03 22 4C 5B 00 00 00 00       $  ANS016:7B8 03 22 4C 5B 00 00 00 00
  $  REQ017:7B0 03 22 4C 5C 00 00 00 00       $  ANS017:7B8 03 22 4C 5C 00 00 00 00
  $  REQ018:7B0 03 22 4C 5D 00 00 00 00       $  ANS018:7B8 03 22 4C 5D 00 00 00 00
  $  REQ019:7B0 03 22 4C 5E 00 00 00 00       $  ANS019:7B8 03 22 4C 5E 00 00 00 00
  $  REQ020:7B0 03 22 4C 5F 00 00 00 00       $  ANS020:7B8 03 22 4C 5F 00 00 00 00
  $  REQ021:7B0 03 22 4C 6A 00 00 00 00       $  ANS021:7B8 03 22 4C 6A 00 00 00 00
  $  REQ022:7B0 03 22 4C 6B 00 00 00 00       $  ANS022:7B8 03 22 4C 6B 00 00 00 00
  $  REQ023:7B0 03 22 4C 6C 00 00 00 00       $  ANS023:7B8 03 22 4C 6C 00 00 00 00
  $  REQ024:7B0 03 22 4C 6F 00 00 00 00       $  ANS024:7B8 03 22 4C 6F 00 00 00 00
  $  REQ025:7B0 03 22 4C 7A 00 00 00 00       $  ANS025:7B8 03 22 4C 7A 00 00 00 00
  $  REQ026:7B0 03 22 4C 7B 00 00 00 00       $  ANS026:7B8 03 22 4C 7B 00 00 00 00
  $  REQ027:7B0 03 22 4C 7C 00 00 00 00       $  ANS027:7B8 03 22 4C 7C 00 00 00 00
  $  REQ028:7B0 03 22 4C 7D 00 00 00 00       $  ANS028:7B8 03 22 4C 7D 00 00 00 00
  $  REQ029:7B0 03 22 4C 7E 00 00 00 00       $  ANS029:7B8 03 22 4C 7E 00 00 00 00
  $  REQ030:7B0 03 22 4C 7F 00 00 00 00       $  ANS030:7B8 03 22 4C 7F 00 00 00 00
  $  REQ031:7B0 03 22 4C 8A 00 00 00 00       $  ANS031:7B8 03 22 4C 8A 00 00 00 00
  $  REQ032:7B0 03 22 4C 8B 00 00 00 00       $  ANS032:7B8 03 22 4C 8B 00 00 00 00
  $  REQ033:7B0 03 22 4C 8C 00 00 00 00       $  ANS033:7B8 03 22 4C 8C 00 00 00 00
  $  REQ034:7B0 03 22 4C 8D 00 00 00 00       $  ANS034:7B8 03 22 4C 8D 00 00 00 00
  $  REQ035:7B0 03 22 4C 9A 00 00 00 00       $  ANS035:7B8 03 22 4C 9A 00 00 00 00
  $  REQ036:7B0 03 22 4C 9B 00 00 00 00       $  ANS036:7B8 03 22 4C 9B 00 00 00 00
  $  REQ037:7B0 03 22 4C 9C 00 00 00 00       $  ANS037:7B8 03 22 4C 9C 00 00 00 00
  $  REQ038:7B0 03 22 4C 9D 00 00 00 00       $  ANS038:7B8 03 22 4C 9D 00 00 00 00
  $  REQ039:7B0 03 22 4C 9E 00 00 00 00       $  ANS039:7B8 03 22 4C 9E 00 00 00 00
  $  REQ040:7B0 03 22 4C A5 00 00 00 00       $  ANS040:7B8 03 22 4C A5 00 00 00 00
  $  REQ041:7B0 03 22 4C A6 00 00 00 00       $  ANS041:7B8 03 22 4C A6 00 00 00 00
  $  REQ042:7B0 03 22 4C A7 00 00 00 00       $  ANS042:7B8 03 22 4C A7 00 00 00 00
  $  REQ043:7B0 03 22 4C A3 00 00 00 00       $  ANS043:7B8 03 22 4C A3 00 00 00 00
  $  REQ044:7B0 03 22 4C A8 00 00 00 00       $  ANS044:7B8 03 22 4C A8 00 00 00 00
  $  REQ045:7B0 03 22 4C A9 00 00 00 00       $  ANS045:7B8 03 22 4C A9 00 00 00 00
  $  REQ046:7B0 03 22 4C E0 00 00 00 00       $  ANS046:7B8 03 22 4C E0 00 00 00 00
  $  REQ047:7B0 03 22 4C C0 00 00 00 00       $  ANS047:7B8 03 22 4C C0 00 00 00 00
  $  REQ048:7B0 03 22 4C C1 00 00 00 00       $  ANS048:7B8 03 22 4C C1 00 00 00 00
  $  REQ049:7B0 03 22 4C C2 00 00 00 00       $  ANS049:7B8 03 22 4C C2 00 00 00 00
  $  REQ050:7B0 03 22 4C C3 00 00 00 00       $  ANS050:7B8 03 22 4C C3 00 00 00 00
  $  REQ051:7B0 03 22 4C C4 00 00 00 00       $  ANS051:7B8 03 22 4C C4 00 00 00 00
  $  REQ052:7B0 03 22 4C C5 00 00 00 00       $  ANS052:7B8 03 22 4C C5 00 00 00 00
  $  REQ053:7B0 03 22 4C C6 00 00 00 00       $  ANS053:7B8 03 22 4C C6 00 00 00 00
  $  REQ054:7B0 03 22 4C C7 00 00 00 00       $  ANS054:7B8 03 22 4C C7 00 00 00 00
  $  REQ055:7B0 03 22 4C AA 00 00 00 00       $  ANS055:7B8 03 22 4C AA 00 00 00 00
  $  REQ056:7B0 03 22 4C C8 00 00 00 00       $  ANS056:7B8 03 22 4C C8 00 00 00 00
  $  REQ057:7B0 03 22 4C C9 00 00 00 00       $  ANS057:7B8 03 22 4C C9 00 00 00 00
  $  REQ058:7B0 03 22 4C CA 00 00 00 00       $  ANS058:7B8 03 22 4C CA 00 00 00 00
  $  REQ059:7B0 03 22 4C AB 00 00 00 00       $  ANS059:7B8 03 22 4C AB 00 00 00 00
  $  REQ060:7B0 03 22 4C AC 00 00 00 00       $  ANS060:7B8 03 22 4C AC 00 00 00 00
  $  REQ061:7B0 03 22 4C AD 00 00 00 00       $  ANS061:7B8 03 22 4C AD 00 00 00 00
  $  REQ062:7B0 03 22 4C CB 00 00 00 00       $  ANS062:7B8 03 22 4C CB 00 00 00 00
  $  REQ063:7B0 03 22 4C CC 00 00 00 00       $  ANS063:7B8 03 22 4C CC 00 00 00 00
  $  REQ064:7B0 03 22 4C CE 00 00 00 00       $  ANS064:7B8 03 22 4C CE 00 00 00 00
  $  REQ065:7B0 03 22 4C CF 00 00 00 00       $  ANS065:7B8 03 22 4C CF 00 00 00 00
  $  REQ066:7B0 03 22 4C D1 00 00 00 00       $  ANS066:7B8 03 22 4C D1 00 00 00 00
  $  REQ067:7B0 03 22 4C D2 00 00 00 00       $  ANS067:7B8 03 22 4C D2 00 00 00 00
  $  REQ068:7B0 03 22 4C D3 00 00 00 00       $  ANS068:7B8 03 22 4C D3 00 00 00 00
  $  REQ069:7B0 03 22 4C A2 00 00 00 00       $  ANS069:7B8 03 22 4C A2 00 00 00 00
  $  REQ070:7B0 03 22 4C E4 00 00 00 00       $  ANS070:7B8 03 22 4C E4 00 00 00 00
  $  REQ071:7B0 03 22 4C A4 00 00 00 00       $  ANS071:7B8 03 22 4C A4 00 00 00 00
  $  REQ072:7B0 03 22 4C E1 00 00 00 00       $  ANS072:7B8 03 22 4C E1 00 00 00 00
  $  REQ073:7B0 03 22 4C E2 00 00 00 00       $  ANS073:7B8 03 22 4C E2 00 00 00 00
  $  REQ074:7B0 03 22 4C E3 00 00 00 00       $  ANS074:7B8 03 22 4C E3 00 00 00 00
  $  REQ075:7B0 03 22 4C D4 00 00 00 00       $  ANS075:7B8 03 22 4C D4 00 00 00 00
  $  REQ076:7B0 03 22 4C D5 00 00 00 00       $  ANS076:7B8 03 22 4C D5 00 00 00 00
  $  REQ077:7B0 03 22 4C D6 00 00 00 00       $  ANS077:7B8 03 22 4C D6 00 00 00 00
  $  REQ078:7B0 03 22 4C AE 00 00 00 00       $  ANS078:7B8 03 22 4C AE 00 00 00 00
  $  REQ079:7B0 03 22 4C AF 00 00 00 00       $  ANS079:7B8 03 22 4C AF 00 00 00 00
  $  REQ080:7B0 03 22 4C B0 00 00 00 00       $  ANS080:7B8 03 22 4C B0 00 00 00 00
  $  REQ081:7B0 03 22 4C D7 00 00 00 00       $  ANS081:7B8 03 22 4C D7 00 00 00 00
  $  REQ082:7B0 03 22 4C EC 00 00 00 00       $  ANS082:7B8 03 22 4C EC 00 00 00 00
  $  REQ083:7B0 03 22 4C D8 00 00 00 00       $  ANS083:7B8 03 22 4C D8 00 00 00 00
  $  REQ084:7B0 03 22 4C D9 00 00 00 00       $  ANS084:7B8 03 22 4C D9 00 00 00 00
  $  REQ085:7B0 03 22 4C DA 00 00 00 00       $  ANS085:7B8 03 22 4C DA 00 00 00 00
  $  REQ086:7B0 03 22 4C E5 00 00 00 00       $  ANS086:7B8 03 22 4C E5 00 00 00 00
  $  REQ087:7B0 03 22 4C E6 00 00 00 00       $  ANS087:7B8 03 22 4C E6 00 00 00 00
  $  REQ088:7B0 03 22 4C E7 00 00 00 00       $  ANS088:7B8 03 22 4C E7 00 00 00 00
  $  REQ089:7B0 03 22 4C E8 00 00 00 00       $  ANS089:7B8 03 22 4C E8 00 00 00 00
  $  REQ090:7B0 03 22 4C E9 00 00 00 00       $  ANS090:7B8 03 22 4C E9 00 00 00 00
  $  REQ091:7B0 03 22 4C EA 00 00 00 00       $  ANS091:7B8 03 22 4C EA 00 00 00 00
  $  REQ092:7B0 03 22 4C EB 00 00 00 00       $  ANS092:7B8 03 22 4C EB 00 00 00 00

  $  000.ECU(电子控制器)供电电压                                                                  $    $  V        $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.车速                                                                                     $    $  km/h     $    $  ANS001.BYTE004  $  if((x1*0x100+x2)<0x1fff)y=INT((x1*256+x2)*0.05625);else y=@0008;
  $  002.电动系统准备状态                                                                         $    $  /        $    $  ANS002.BYTE004  $  switxh(x)0x00:y=@0190;0x01:y=@0191;default:y=@0162;
  $  003.定速巡航控制状态                                                                         $    $  /        $    $  ANS003.BYTE004  $  switxh(x)0x0:y=@0eaa;0x1:y=@0eab;0x2:y=@0eac;0x3:y=@0ae1;0x4:y=@02fc;0x5:y=@0ead;0x6:y=@0eae;0x7:y=@0eaf;
  $  004.巡航开关状态                                                                             $    $  /        $    $  ANS004.BYTE004  $  switxh(x)0x0:y=@0000;0x1:y=@0001;
  $  005.巡航控制设置的速度值                                                                     $    $  km/h     $    $  ANS005.BYTE004  $  if(x==0xff)y=@0132;else y=x;
  $  006.碰撞输出状态                                                                             $    $  /        $    $  ANS006.BYTE004  $  switxh(x)0x0:y=@0209;0x1:y=@0e8b;0x2:y=@0e8c;0x3:y=@0e8d;0x4:y=@0e8e;0x5:y=@0209;0x6:y=@0209;0x7:y=@0209;
  $  007.ESC(电子稳定控制单元)信号提示ABS(防抱刹车系统)是否被激活                                 $    $  /        $    $  ANS007.BYTE004  $  switxh(x)0x0:y=@001d;0x1:y=@001c;
  $  008.ESC(电子稳定控制单元)信号提示TCS(牵引力控制系统)是否被激活                               $    $  /        $    $  ANS008.BYTE004  $  switxh(x)0x0:y=@0e9c;0x1:y=@0e9d;
  $  009.主缸压力                                                                                 $    $  bar      $    $  ANS009.BYTE004  $  if(x==0xff)y=@0132;else y=x;
  $  010.IPU(集成动力控制器)_TDcDcDCDC(DC-DC转换控制器)温度                                       $    $  degC     $    $  ANS010.BYTE004  $  y=x-40;
  $  011.DCDC(DC-DC转换控制器)故障等级                                                            $    $  /        $    $  ANS011.BYTE004  $  switxh(x)0x00:y=@01ac;0x01:y=@0405;0x02:y=@1016;0x03:y=@1017;default:y=@0162;
  $  012.DCDC(DC-DC转换控制器)工作使能状态                                                        $    $  /        $    $  ANS012.BYTE004  $  switxh(x)0x00:y=@0190;0x01:y=@0191;default:y=@0162;
  $  013.DCDC(DC-DC转换控制器)低压侧输出电流                                                      $    $  A        $    $  ANS013.BYTE004  $  y=x1*0x100+x2;
  $  014.IPU(集成动力控制器)过温降级标志位                                                        $    $  /        $    $  ANS014.BYTE004  $  switxh(x)0x00:y=@1014;0x01:y=@0b50;default:y=@0162;
  $  015.外部能量状态_CP信号                                                                      $    $  /        $    $  ANS015.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@1015;0x02:y=@03f0;0x03:y=@03f1;0x07:y=@03f2;default:y=@0162;
  $  016.外部线缆连接状态_CC信号                                                                  $    $  /        $    $  ANS016.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@01c4;default:y=@0162;
  $  017.快充CC1连接状态                                                                          $    $  /        $    $  ANS017.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@01c4;default:y=@0162;
  $  018.快充CC2连接状态                                                                          $    $  /        $    $  ANS018.BYTE004  $  switxh(x)0x00:y=@01c3;0x01:y=@01c4;default:y=@0162;
  $  019.BMS(电池管理系统)充电故障等级                                                            $    $  /        $    $  ANS019.BYTE004  $  switxh(x)0x00:y=@0408;0x01:y=@08c9;0x02:y=@0433;0x03:y=@0434;0x04:y=@08ca;0x05:y=@08cb;0x06:y=@08cc;default:y=@0209;
  $  020.BMS(电池管理系统)放电故障等级                                                            $    $  /        $    $  ANS020.BYTE004  $  switxh(x)0x00:y=@0408;0x01:y=@08c9;0x02:y=@0433;0x03:y=@0434;0x04:y=@08ca;0x05:y=@08cb;0x06:y=@08cc;default:y=@0209;
  $  021.档位信号                                                                                 $    $  /        $    $  ANS021.BYTE004  $  switxh(x)0x00:y=@0209;0x01:y=@0228;0x02:y=@083a;0x03:y=@0227;0x04:y=@0209;0x05:y=@0209;0x06:y=@0209;0x07:y=@0132;default:y=@0162;
  $  022.P档开关状态                                                                              $    $  /        $    $  ANS022.BYTE004  $  switxh(x)0x00:y=@01b2;0x01:y=@01b1;0x02:y=@0209;0x03:y=@0132;default:y=@0162;
  $  023.EPB(电子驻车制动系统)系统状态                                                            $    $  /        $    $  ANS023.BYTE004  $  switxh(x)0x00:y=@0018;0x01:y=@03f5;0x02:y=@1019;0x03:y=@0209;default:y=@0162;
  $  024.PEPS(无钥匙进入一键式启动单元)电源模式                                                   $    $  /        $    $  ANS024.BYTE004  $  switxh(x)0x00:y=@0415;0x01:y=@0416;0x02:y=@0417;0x03:y=@101a;0x04:y=@0494;0x05:y=@101a;default:y=@0162;
  $  025.目标回馈扭矩                                                                             $    $  Nm       $    $  ANS025.BYTE004  $  y=x1*0x100+x2-32768;
  $  026.目标回馈扭矩状态                                                                         $    $  /        $    $  ANS026.BYTE004  $  switxh(x)0x00:y=@1018;0x01:y=@010f;0x02:y=@01b0;default:y=@0162;
  $  027.加速踏板1信号                                                                            $    $  /        $    $  ANS027.BYTE004  $  y=x*0.02;
  $  028.加速踏板2信号                                                                            $    $  /        $    $  ANS028.BYTE004  $  y=x*0.02;
  $  029.制动踏板1信号                                                                            $    $  /        $    $  ANS029.BYTE004  $  switxh(x)0x00:y=@0495;0x01:y=@0496;default:y=@0162;
  $  030.制动踏板2信号                                                                            $    $  /        $    $  ANS030.BYTE004  $  switxh(x)0x00:y=@0495;0x01:y=@0496;default:y=@0162;
  $  031.档位                                                                                     $    $  /        $    $  ANS031.BYTE004  $  switxh(x)0x02:y=@04a7;0x03:y=@04a8;0x04:y=@04a9;0x05:y=@04aa;0x07:y=@101b;default:y=@0162;
  $  032.VCU(整车控制器)发出的EPB(电子驻车制动系统)锁止请求                                       $    $  /        $    $  ANS032.BYTE004  $  switxh(x)0x00:y=@03fd;0x01:y=@043d;default:y=@0162;
  $  033.提示油门开度信号是否有效                                                                 $    $  /        $    $  ANS033.BYTE004  $  switxh(x)0x00:y=@010f;0x01:y=@0132;default:y=@0162;
  $  034.空调冷却风扇PWM(脉宽调制)                                                                $    $  %        $    $  ANS034.BYTE004  $  y=x;
  $  035.电机常规扭矩最小值限制                                                                   $    $  Nm       $    $  ANS035.BYTE004  $  y=x1*0x100+x2-4000;
  $  036.电机峰值扭矩最大值限制                                                                   $    $  Nm       $    $  ANS036.BYTE004  $  y=x1*0x100+x2-4000;
  $  037.电机峰值扭矩最小值限制                                                                   $    $  Nm       $    $  ANS037.BYTE004  $  y=x1*0x100+x2-4000;
  $  038.踏板扭矩请求                                                                             $    $  Nm       $    $  ANS038.BYTE004  $  y=x1*0x100+x2-4000;
  $  039.VCU(整车控制器)的高压互锁状态                                                            $    $  /        $    $  ANS039.BYTE004  $  switxh(x)0x00:y=@010f;0x01:y=@01b0;default:y=@0162;
  $  040.电机转速                                                                                 $    $  rpm      $    $  ANS040.BYTE004  $  if((x1*0x100+x2)==0xFFFE)y=@0421;else if((x1*0x100+x2)==0xFFFF)y=@0132;else y=(x1*0x100+x2)-14000;
  $  041.IPU(集成动力控制器)故障等级                                                              $    $  /        $    $  ANS041.BYTE004  $  switxh(x)0x00:y=@01ac;0x01:y=@0405;0x02:y=@04a4;0x03:y=@04a1;0x0F:y=@0132;default:y=@0162;
  $  042.电机工作状态模式                                                                         $    $  /        $    $  ANS042.BYTE004  $  switxh(x)0x00:y=@0318;0x01:y=@03e1;0x02:y=@0949;0x03:y=@097d;0x04:y=@0425;0x05:y=@05c4;0x06:y=@03e8;0x07:y=@01b0;default:y=@0162;
;  $  043.VCU(整车控制器)发出的电机工作状态模式请求                                                $    $  /        $    $  ANS043.BYTE0-3  $  switxh(x)0x00:y=@0318;0x01:y=@03e1;0x02:y=@0949;0x03:y=@097d;0x04:y=@0425;0x05:y=@05c4;0x06:y=@03e8;0x07:y=@04a1;default:y=@0220;
  $  044.IPU(集成动力控制器)实际扭矩                                                              $    $  Nm       $    $  ANS044.BYTE004  $  if((x1*0x100+x2)==0xFFFE)y=@0421;else if((x1*0x100+x2)==0xFFFF)y=@0132;else y=(x1*0x100+x2)*0.1-1200;
  $  045.电机进水口实际温度                                                                       $    $  degC     $    $  ANS045.BYTE004  $  y=x-40;
  $  046.VCU(整车控制器)发出的P档锁止请求                                                         $    $  /        $    $  ANS046.BYTE004  $  switxh(x)0x00:y=@0543;0x01:y=@010a;0x02:y=@010b;0x03:y=@0132;default:y=@0162;
  $  047.VCU(整车控制器)发出的当前档位信息                                                        $    $  /        $    $  ANS047.BYTE004  $  switxh(x)0x00:y=@042a;0x01:y=@04a7;0x02:y=@04aa;0x03:y=@04a8;0x04:y=@04a9;0x1E:y=@0421;0x1F:y=@0132;default:y=@0162;
  $  048.VCU(整车控制器)发出的电机扭矩请求                                                        $    $  Nm       $    $  ANS048.BYTE004  $  if((x1*0x100+x2)==0xFFFF)y=@0132;else y=(x1*0x100+x2)*0.1-1200;
  $  049.VCU(整车控制器)发出的电机最大扭矩                                                        $    $  Nm       $    $  ANS049.BYTE004  $  if((x1*0x100+x2)==0x3FF)y=@0132;else y=(x1*0x100+x2)*0.5;
  $  050.VCU(整车控制器)发出的电机最小扭矩                                                        $    $  Nm       $    $  ANS050.BYTE004  $  if((x1*0x100+x2)==0x3FF)y=@0132;else y=(x1*0x100+x2)*0.5-511;
  $  051.VCU(整车控制器)发出的DCDC(DC-DC转换控制器)使能请求                                       $    $  /        $    $  ANS051.BYTE004  $  switxh(x)0x00:y=@0430;0x01:y=@09a3;default:y=@0162;
  $  052.VCU(整车控制器)发出的DCDC(DC-DC转换控制器)低压侧电压                                     $    $  V        $    $  ANS052.BYTE004  $  if(x==0xFF)y=@0132;else y=x*0.025+10.6;
  $  053.VCU(整车控制器)控制BMSH(电池管理系统)高压主回路的通断                                    $    $  /        $    $  ANS053.BYTE004  $  if(x==0)y=@0430;else if(x==1)y=@0987;else if(x==2)y=@0988;else if(x==3)y=@04a1;else if(x>=4 && x<=7)y=@0209;else y=@0162;
  $  054.整车条件是否允许充电                                                                     $    $  /        $    $  ANS054.BYTE004  $  switxh(x)0x00:y=@0e5b;0x01:y=@0422;0x02:y=@0209;0x03:y=@0209;
  $  055.BMS(电池管理系统)状态                                                                    $    $  /        $    $  ANS055.BYTE004  $  switxh(x)0x00:y=@0408;0x01:y=@0318;0x02:y=@0fe8;0x03:y=@09a8;0x04:y=@0fe9;0x05:y=@0fea;0x06:y=@0feb;0x07:y=@0fec;0x08:y=@0fed;0x09:y=@0fee;0x0A:y=@0fef;0x0B:y=@09ac;0x0C:y=@03ec;0x0D:y=@0426;0x0E:y=@0589;0x0F:y=@04a1;0x10:y=@03ee;default:y=@0209;
  $  056.高压电池包电流                                                                           $    $  A        $    $  ANS056.BYTE004  $  if((x1*0x100+x2)==0xFFFF)y=@0132;else if((x1*0x100+x2)==0xFFFE)y=@0421;else if((x1*0x100+x2)>0x2711 && (x1*0x100+x2)<0x3FFD)y=@0209;else y=(x1*0x100+x2)*0.1-500;
  $  057.高压电池包内部电压                                                                       $    $  V        $    $  ANS057.BYTE004  $  if((x1*0x100+x2)==0x3FF)y=@0132;else if((x1*0x100+x2)==0x3FE)y=@0421;else if((x1*0x100+x2)>=0x259 && (x1*0x100+x2)<=0x3FD)y=@0209;else y=(x1*0x100+x2)*0.1;
  $  058.电池电量                                                                                 $    $  %        $    $  ANS058.BYTE004  $  if((x1*0x100+x2)==0x3FF)y=@0132;else if((x1*0x100+x2)==0x3FE)y=@0421;else if((x1*0x100+x2)>=0x3E9 && (x1*0x100+x2)<=0x3FD)y=@0209;else y=(x1*0x100+x2)*0.1;
  $  059.OBC(车载充电机)状态请求                                                                  $    $  /        $    $  ANS059.BYTE004  $  switxh(x)0x00:y=@0209;0x01:y=@0318;0x02:y=@0209;0x03:y=@0b73;0x04:y=@03d6;0x05:y=@05e4;0x06:y=@0b74;0x07:y=@0ff3;0x08:y=@0b76;0x09:y=@03d9;0x0A:y=@068b;0x0B:y=@0b77;0x0C:y=@0ff4;0x0D:y=@08e9;0x0E:y=@08ea;0x0F:y=@0132;
  $  060.OBC(车载充电机)故障等级                                                                  $    $  /        $    $  ANS060.BYTE004  $  switxh(x)0x00:y=@01ac;0x01:y=@0405;0x02:y=@04a4;0x03:y=@04a1;
  $  061.PCU(P档锁控制单元) P档锁止状态                                                           $    $  /        $    $  ANS061.BYTE004  $  switxh(x)0x00:y=@0543;0x01:y=@03ff;0x02:y=@0ff1;0x03:y=@0400;0x04:y=@0401;0x05:y=@0ff2;0x06:y=@04bb;0x07:y=@0404;
  $  062.空调冷却风扇请求                                                                         $    $  %        $    $  ANS062.BYTE004  $  if(x==0xFF)y=@0132;else y=x*0.1;
  $  063.前除霜请求状态                                                                           $    $  /        $    $  ANS063.BYTE004  $  switxh(x)0x00:y=@03fd;0x01:y=@0ff0;
  $  064.空调实际电功率                                                                           $    $  kW       $    $  ANS064.BYTE004  $  if(x==0xFF)y=@0132;else y=x*0.1;
  $  065.空调电功率请求                                                                           $    $  kW       $    $  ANS065.BYTE004  $  if(x==0xFF)y=@0132;else y=x*0.1;
  $  066.ABS(防抱刹车系统)提示车速信号是否有效                                                    $    $  /        $    $  ANS066.BYTE004  $  switxh(x)0x00:y=@0169;0x01:y=@0132;
  $  067.ESC(电子稳定控制单元)信号提示系统向VCU(整车控制器)要求需减扭到的扭距（车轮端扭矩）       $    $  Nm       $    $  ANS067.BYTE004  $  if((x1*0x100+x2)>0x2EE1 && (x1*0x100+x2)<0xFFFF)y=@0132;else y=(x1*0x100+x2)-6000;
  $  068.ESC(电子稳定控制单元)指示发动机减扭请求是否激活                                          $    $  /        $    $  ANS068.BYTE004  $  switxh(x)0x00:y=@001d;0x01:y=@001c;
  $  069.ESC(电子稳定控制单元)信号提示系统向VCU(整车控制器)要求增扭到要求的扭距(车轮端扭矩)       $    $  Nm       $    $  ANS069.BYTE004  $  if((x1*0x100+x2)>0x2EE1 && (x1*0x100+x2)<0xFFFF)y=@0132;else y=(x1*0x100+x2)-6000;
  $  070.ESC(电子稳定控制单元)指示VCU(整车控制器)增扭请求是否激活                                 $    $  /        $    $  ANS070.BYTE004  $  switxh(x)0x00:y=@001d;0x01:y=@001c;
  $  071.VLC的VCU(整车控制器)净扭矩请求（车轮端扭矩）                                             $    $  Nm       $    $  ANS071.BYTE004  $  if((x1*0x100+x2)>0x2EE1 && (x1*0x100+x2)<0xFFFF)y=@0132;else y=(x1*0x100+x2)-6000;
  $  072.VLC的VCU(整车控制器)净扭矩请求是否激活                                                   $    $  /        $    $  ANS072.BYTE004  $  switxh(x)0x00:y=@001d;0x01:y=@001c;
  $  073.加速踏板实际开度                                                                         $    $  %        $    $  ANS073.BYTE004  $  if(x==0xFE)y=@0421;else if(x>=0xFB && x<=0xFF)y=@0132;else y=x*0.4;
  $  074.ESC(电子稳定控制单元)发送的制动踏板状态                                                  $    $  /        $    $  ANS074.BYTE004  $  switxh(x)0x00:y=@0495;0x01:y=@0496;default:y=@0162;
  $  075.电机系统冷却水泵占空比                                                                   $    $  %        $    $  ANS075.BYTE004  $  y=x;
  $  076.高速风扇使能状态                                                                         $    $  /        $    $  ANS076.BYTE004  $  switxh(x)0x00:y=@0190;0x01:y=@0191;default:y=@0162;
  $  077.低速风扇使能状态                                                                         $    $  /        $    $  ANS077.BYTE004  $  switxh(x)0x00:y=@0190;0x01:y=@0191;default:y=@0162;
  $  078.上下电逻辑状态                                                                           $    $  /        $    $  ANS078.BYTE004  $  switxh(x)0:y=@043e;5:y=@0ffe;10:y=@0fff;15:y=@1000;20:y=@1001;25:y=@1002;30:y=@1003;31:y=@1004;35:y=@1005;40:y=@1006;45:y=@1007;50:y=@1008;55:y=@1009;60:y=@0d02;61:y=@0453;62:y=@100a;63:y=@100b;
  $  079.VCU(整车控制器)内部电机扭矩请求                                                          $    $  Nm       $    $  ANS079.BYTE004  $  y=x1*0x100+x2-1200;
  $  080.扭矩模式管理                                                                             $    $  /        $    $  ANS080.BYTE004  $  switxh(x)2:y=@043a;4:y=@043b;6:y=@0435;7:y=@043c;
  $  081.BCM(车身控制模块)驾驶模式请求                                                            $    $  /        $    $  ANS081.BYTE004  $  switxh(x)0x00:y=@0188;0x02:y=@0ff5;
  $  082.VCU(整车控制器)内部当前系统故障等级                                                      $    $  /        $    $  ANS082.BYTE004  $  switxh(x)0x0:y=@01ac;0x1:y=@0ff6;0x3:y=@05a3;0x5:y=@0ff7;0x6:y=@0ff8;0x7:y=@0ff9;0x9:y=@0ffa;0x11:y=@0ffb;0x13:y=@0ffc;0x15:y=@0ffd;
  $  083.VCU(整车控制器)低压供电电源保持                                                          $    $  /        $    $  ANS083.BYTE004  $  switxh(x)0x00:y=@1010;0x01:y=@1011;
  $  084.高压电源使能                                                                             $    $  /        $    $  ANS084.BYTE004  $  switxh(x)0x00:y=@1012;0x01:y=@1013;
  $  085.电机常规扭矩最大值限制                                                                   $    $  Nm       $    $  ANS085.BYTE004  $  y=x1*0x100+x2-4000;
  $  086.高压互锁状态(VCU(整车控制器)/BMS(电池管理系统)检测)                                      $    $  /        $    $  ANS086.BYTE004  $  switxh(x)0x00:y=@012a;0x01:y=@0129;
  $  087.VCU(整车控制器)真空系统状态                                                              $    $  /        $    $  ANS087.BYTE004  $  switxh(x)0x00:y=@100c;0x01:y=@100d;0x02:y=@100e;0x03:y=@100f;default:y=@0209;
  $  088.真空助力器前腔中的真空度                                                                 $    $  kPa      $    $  ANS088.BYTE004  $  if(x==0xFF)y=@0132;else y=x*0.2-108;
  $  089.VCU(整车控制器)请求点亮双闪灯                                                            $    $  /        $    $  ANS089.BYTE004  $  switxh(x)0x00:y=@001d;0x01:y=@001c;
  $  090.VCU(整车控制器) 请求点亮乌龟灯                                                           $    $  /        $    $  ANS090.BYTE004  $  switxh(x)0x00:y=@010e;0x01:y=@0170;
  $  091.VCU(整车控制器)请求点亮系统故障灯                                                        $    $  /        $    $  ANS091.BYTE004  $  switxh(x)0x00:y=@02ea;0x01:y=@02e9;
  $  092.电动空调(ACCM(空调压缩机模块)/PTC)功率允许值                                             $    $  kW       $    $  ANS092.BYTE004  $  if(x==0xFF)y=@0132;else y=x*0.1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
