
    车型ID：0a74

    模拟：协议模拟-->0a74

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B8

进入命令:

  $~  REQ000:7B0 02 10 01 00 00 00 00 00       $~  ANS000:7B8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B0 02 3E 00 00 00 00 00 00       $!  ANS000:7B8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7B0 03 19 02 09 00 00 00 00       $#  ANS000:7B8 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/55000000


  $#  01.读故障码库
  $#  REQ000:7B0 02 19 0A 00 00 00 00 00       $#  ANS000:7B8 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/55000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B0 04 14 FF FF FF 00 00 00       $$  ANS000:7B8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B0 03 22 F1 12 00 00 00 00       $%  ANS000:7B8 03 22 F1 12 00 00 00 00
  $%  REQ001:7B0 03 22 F1 90 00 00 00 00       $%  ANS001:7B8 03 22 F1 90 00 00 00 00
  $%  REQ002:7B0 03 22 F1 13 00 00 00 00       $%  ANS002:7B8 03 22 F1 13 00 00 00 00
  $%  REQ003:7B0 03 22 F1 97 00 00 00 00       $%  ANS003:7B8 03 22 F1 97 00 00 00 00
  $%  REQ004:7B0 03 22 F1 87 00 00 00 00       $%  ANS004:7B8 03 22 F1 87 00 00 00 00
  $%  REQ005:7B0 03 22 F1 8B 00 00 00 00       $%  ANS005:7B8 03 22 F1 8B 00 00 00 00
  $%  REQ006:7B0 03 22 F1 9D 00 00 00 00       $%  ANS006:7B8 03 22 F1 9D 00 00 00 00
  $%  REQ007:7B0 03 22 F1 99 00 00 00 00       $%  ANS007:7B8 03 22 F1 99 00 00 00 00
  $%  REQ008:7B0 03 22 F1 93 00 00 00 00       $%  ANS008:7B8 03 22 F1 93 00 00 00 00
  $%  REQ009:7B0 03 22 F1 95 00 00 00 00       $%  ANS009:7B8 03 22 F1 95 00 00 00 00
  $%  REQ010:7B0 03 22 F1 82 00 00 00 00       $%  ANS010:7B8 03 22 F1 82 00 00 00 00
  $%  REQ011:7B0 03 22 F1 8A 00 00 00 00       $%  ANS011:7B8 03 22 F1 8A 00 00 00 00
  $%  REQ012:7B0 03 22 F1 98 00 00 00 00       $%  ANS012:7B8 03 22 F1 98 00 00 00 00

  $%  000:车辆名称:                               $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:车辆VIN码:                              $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  002:诊断协议版本:                           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d%d%d%d],x1,x2,x3,x4);
  $%  003:ECU(电子控制器)控制器名称:              $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:零件BOM号:                              $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:ECU(电子控制器)制造日期:                $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  006:ECU(电子控制器)装配日期:                $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  007:ECU(电子控制器)软件刷新日期:            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  008:供应商ECU(电子控制器)硬件版本号:        $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  009:供应商ECU(电子控制器)软件版本号:        $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  010:标定版本号:                             $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  011:供应商识别号:                           $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  012:诊断仪序列号:                           $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B0 03 22 4C 75 00 00 00 00       $  ANS000:7B8 03 22 4C 75 00 00 00 00
  $  REQ001:7B0 03 22 4C 76 00 00 00 00       $  ANS001:7B8 03 22 4C 76 00 00 00 00
  $  REQ002:7B0 03 22 4C 79 00 00 00 00       $  ANS002:7B8 03 22 4C 79 00 00 00 00
  $  REQ003:7B0 03 22 4C 7A 00 00 00 00       $  ANS003:7B8 03 22 4C 7A 00 00 00 00
  $  REQ004:7B0 03 22 4C 7B 00 00 00 00       $  ANS004:7B8 03 22 4C 7B 00 00 00 00
  $  REQ005:7B0 03 22 4C 7C 00 00 00 00       $  ANS005:7B8 03 22 4C 7C 00 00 00 00
  $  REQ006:7B0 03 22 4C 7D 00 00 00 00       $  ANS006:7B8 03 22 4C 7D 00 00 00 00
  $  REQ007:7B0 03 22 4C 7E 00 00 00 00       $  ANS007:7B8 03 22 4C 7E 00 00 00 00

  $  000.快充CC1连接状态                       $    $  /     $    $  ANS000.BYTE004  $  if(x==0x00) y=@01c3; else if(x==0x01) y=@0240; else if(x==0x02) y=@0b89; else y=@0220;
  $  001.快充CC2连接状态                       $    $  /     $    $  ANS001.BYTE004  $  if(x==0x00) y=@01c3; else if(x==0x01) y=@0240; else if(x==0x02) y=@0b89; else y=@0220;
  $  002.VCU(整车控制器)检测通讯故障等级       $    $  /     $    $  ANS002.BYTE004  $  if(x==0x00) y=@01ac; else if(x==0x01) y=@08f0; else if(x==0x02) y=@08f1; else if(x==0x03) y=@08f2; else if(x==0x04) y=@0b88; else if(x==0x05) y=@0b87; else if(x==0x06) y=@08f5; else if(x==0x07) y=@08f6; else if(x==0x08) y=@08f7; else if(x==0x09) y=@08f8; else if(x==0x10) y=@08f9; else if(x==0x11) y=@08fa; else y=@0220;
  $  003.VCU(整车控制器)检测PCAN故障等级       $    $  /     $    $  ANS003.BYTE004  $  if(x==0x00) y=@01ac; else if(x==0x01) y=@08f0; else if(x==0x02) y=@08f1; else if(x==0x03) y=@08f2; else if(x==0x04) y=@0b88; else if(x==0x05) y=@0b87; else if(x==0x06) y=@08f5; else if(x==0x07) y=@08f6; else if(x==0x08) y=@08f7; else if(x==0x09) y=@08f8; else if(x==0x10) y=@08f9; else if(x==0x11) y=@08fa; else y=@0220;
  $  004.VCU(整车控制器)检测I/O故障等级        $    $  /     $    $  ANS004.BYTE004  $  if(x==0x00) y=@01ac; else if(x==0x01) y=@08f0; else if(x==0x02) y=@08f1; else if(x==0x03) y=@08f2; else if(x==0x04) y=@0b88; else if(x==0x05) y=@0b87; else if(x==0x06) y=@08f5; else if(x==0x07) y=@08f6; else if(x==0x08) y=@08f7; else if(x==0x09) y=@08f8; else if(x==0x10) y=@08f9; else if(x==0x11) y=@08fa; else y=@0220;
  $  005.VCU(整车控制器)检测VCAN故障等级       $    $  /     $    $  ANS005.BYTE004  $  if(x==0x00) y=@01ac; else if(x==0x01) y=@08f0; else if(x==0x02) y=@08f1; else if(x==0x03) y=@08f2; else if(x==0x04) y=@0b88; else if(x==0x05) y=@0b87; else if(x==0x06) y=@08f5; else if(x==0x07) y=@08f6; else if(x==0x08) y=@08f7; else if(x==0x09) y=@08f8; else if(x==0x10) y=@08f9; else if(x==0x11) y=@08fa; else y=@0220;
  $  006.VCU(整车控制器)检测整车故障等级       $    $  /     $    $  ANS006.BYTE004  $  if(x==0x00) y=@01ac; else if(x==0x01) y=@08f0; else if(x==0x02) y=@08f1; else if(x==0x03) y=@08f2; else if(x==0x04) y=@0b88; else if(x==0x05) y=@0b87; else if(x==0x06) y=@08f5; else if(x==0x07) y=@08f6; else if(x==0x08) y=@08f7; else if(x==0x09) y=@08f8; else if(x==0x10) y=@08f9; else if(x==0x11) y=@08fa; else y=@0220;
  $  007.keyon信号                             $    $  /     $    $  ANS007.BYTE004  $  if(x==0x00) y=@0b84; else if(x==0x01) y=@0b85; else y=@0220;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B0 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7B0 30 00 0B 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
