
    车型ID：0ac3

    模拟：协议模拟-->0ac3

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7AD

进入命令:

  $~  REQ000:7A5 02 10 01 00 00 00 00 00       $~  ANS000:7AD 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7A5 02 3E 00 00 00 00 00 00       $!  ANS000:7AD 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7A5 03 19 02 09 00 00 00 00       $#  ANS000:7AD 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/99000000


  $#  01.读故障码库
  $#  REQ000:7A5 02 19 0A 00 00 00 00 00       $#  ANS000:7AD 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/99000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="0"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="0"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7A5 04 14 FF FF FF 00 00 00       $$  ANS000:7AD 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7A5 03 22 F1 12 00 00 00 00       $%  ANS000:7AD 03 22 F1 12 00 00 00 00
  $%  REQ001:7A5 03 22 F1 80 00 00 00 00       $%  ANS001:7AD 03 22 F1 80 00 00 00 00
  $%  REQ002:7A5 03 22 F1 87 00 00 00 00       $%  ANS002:7AD 03 22 F1 87 00 00 00 00
  $%  REQ003:7A5 03 22 F1 8A 00 00 00 00       $%  ANS003:7AD 03 22 F1 8A 00 00 00 00
  $%  REQ004:7A5 03 22 F1 8B 00 00 00 00       $%  ANS004:7AD 03 22 F1 8B 00 00 00 00
  $%  REQ005:7A5 03 22 F1 8C 00 00 00 00       $%  ANS005:7AD 03 22 F1 8C 00 00 00 00
  $%  REQ006:7A5 03 22 F1 90 00 00 00 00       $%  ANS006:7AD 03 22 F1 90 00 00 00 00
  $%  REQ007:7A5 03 22 F1 93 00 00 00 00       $%  ANS007:7AD 03 22 F1 93 00 00 00 00
  $%  REQ008:7A5 03 22 F1 95 00 00 00 00       $%  ANS008:7AD 03 22 F1 95 00 00 00 00
  $%  REQ009:7A5 03 22 F1 98 00 00 00 00       $%  ANS009:7AD 03 22 F1 98 00 00 00 00
  $%  REQ010:7A5 03 22 F1 99 00 00 00 00       $%  ANS010:7AD 03 22 F1 99 00 00 00 00
  $%  REQ011:7A5 03 22 F1 9D 00 00 00 00       $%  ANS011:7AD 03 22 F1 9D 00 00 00 00
  $%  REQ012:7A5 03 22 F1 82 00 00 00 00       $%  ANS012:7AD 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:引导程序软件识别号:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                                      $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)刷写日期:                     $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  011:ECU(电子控制器)安装日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:标定软件版本号:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7A5 03 22 DF 00 00 00 00 00       $  ANS000:7AD 03 22 DF 00 00 00 00 00
  $  REQ001:7A5 03 22 DF 01 00 00 00 00       $  ANS001:7AD 03 22 DF 01 00 00 00 00
  $  REQ002:7A5 03 22 A5 00 00 00 00 00       $  ANS002:7AD 03 22 A5 00 00 00 00 00
  $  REQ003:7A5 03 22 A5 01 00 00 00 00       $  ANS003:7AD 03 22 A5 01 00 00 00 00
  $  REQ004:7A5 03 22 A5 02 00 00 00 00       $  ANS004:7AD 03 22 A5 02 00 00 00 00
  $  REQ005:7A5 03 22 A5 E0 00 00 00 00       $  ANS005:7AD 03 22 A5 E0 00 00 00 00

  $  000.ECU(电子控制器)电源电压             $    $  V        $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.车速                                $    $  km/h     $    $  ANS001.BYTE004  $  y=INT((x1*256+x2)*0.05625);
  $  002.按钮状态PDC(倒车雷达控制系统)       $    $  /        $    $  ANS002.BYTE004  $  switxh(x) 0:y=@01b2;1:y=@01b1;2:y=@0dd3;default:y=@0209;
  $  003.按钮状态SVA                         $    $  /        $    $  ANS002.BYTE005  $  switxh(x) 0:y=@01b2;1:y=@01b1;2:y=@0dd3;default:y=@0209;
  $  004.按钮状态APA(自动泊车辅助)           $    $  /        $    $  ANS002.BYTE006  $  switxh(x) 0:y=@01b2;1:y=@01b1;2:y=@0dd3;default:y=@0209;
  $  005.左前侧边传感器直接回波              $    $  cm       $    $  ANS003.BYTE004  $  y=x1*0x100+x2;
  $  006.左前角传感器直接回波                $    $  cm       $    $  ANS003.BYTE006  $  y=x1*0x100+x2;
  $  007.左前中间传感器直接回波              $    $  cm       $    $  ANS003.BYTE008  $  y=x1*0x100+x2;
  $  008.右前中间传感器直接回波              $    $  cm       $    $  ANS003.BYTE010  $  y=x1*0x100+x2;
  $  009.右前角传感器直接回波                $    $  cm       $    $  ANS003.BYTE012  $  y=x1*0x100+x2;
  $  010.右前侧边传感器直接回波              $    $  cm       $    $  ANS003.BYTE014  $  y=x1*0x100+x2;
  $  011.左后侧边传感器直接回波              $    $  cm       $    $  ANS003.BYTE016  $  y=x1*0x100+x2;
  $  012.左后角传感器直接回波                $    $  cm       $    $  ANS003.BYTE018  $  y=x1*0x100+x2;
  $  013.左后中间传感器直接回波              $    $  cm       $    $  ANS003.BYTE020  $  y=x1*0x100+x2;
  $  014.右后角中间感器直接回波              $    $  cm       $    $  ANS003.BYTE022  $  y=x1*0x100+x2;
  $  015.右后角传感器直接回波                $    $  cm       $    $  ANS003.BYTE024  $  y=x1*0x100+x2;
  $  016.右后侧边传感器直接回波              $    $  cm       $    $  ANS003.BYTE026  $  y=x1*0x100+x2;
  $  017.左前角传感器间接回波                $    $  cm       $    $  ANS003.BYTE028  $  y=x1*0x100+x2;
  $  018.左前中间传感器间接回波              $    $  cm       $    $  ANS003.BYTE030  $  y=x1*0x100+x2;
  $  019.右前中间传感器间接回波              $    $  cm       $    $  ANS003.BYTE032  $  y=x1*0x100+x2;
  $  020.右前角传感器间接回波                $    $  cm       $    $  ANS003.BYTE034  $  y=x1*0x100+x2;
  $  021.左后角传感器间接回波                $    $  cm       $    $  ANS003.BYTE036  $  y=x1*0x100+x2;
  $  022.左后中间传感器间接回波              $    $  cm       $    $  ANS003.BYTE038  $  y=x1*0x100+x2;
  $  023.右后角中间传感器间接回波            $    $  cm       $    $  ANS003.BYTE040  $  y=x1*0x100+x2;
  $  024.右后角传感器间接回波                $    $  cm       $    $  ANS003.BYTE042  $  y=x1*0x100+x2;
  $  025.左前侧边传感器余震时间              $    $  us       $    $  ANS004.BYTE004  $  y=x1*0x100+x2;
  $  026.左前角传感器余震时间                $    $  us       $    $  ANS004.BYTE006  $  y=x1*0x100+x2;
  $  027.左前中间传感器余震时间              $    $  us       $    $  ANS004.BYTE008  $  y=x1*0x100+x2;
  $  028.右前中间传感器余震时间              $    $  us       $    $  ANS004.BYTE010  $  y=x1*0x100+x2;
  $  029.右前角传感器余震时间                $    $  us       $    $  ANS004.BYTE012  $  y=x1*0x100+x2;
  $  030.右前侧边传感器余震时间              $    $  us       $    $  ANS004.BYTE014  $  y=x1*0x100+x2;
  $  031.左后侧边传感器余震时间              $    $  us       $    $  ANS004.BYTE016  $  y=x1*0x100+x2;
  $  032.左后角传感器余震时间                $    $  us       $    $  ANS004.BYTE018  $  y=x1*0x100+x2;
  $  033.左后中间传感器余震时间              $    $  us       $    $  ANS004.BYTE020  $  y=x1*0x100+x2;
  $  034.右后角中间传感器余震时间            $    $  us       $    $  ANS004.BYTE022  $  y=x1*0x100+x2;
  $  035.右后角传感器余震时间                $    $  us       $    $  ANS004.BYTE024  $  y=x1*0x100+x2;
  $  036.右后侧边传感器余震时间              $    $  us       $    $  ANS004.BYTE026  $  y=x1*0x100+x2;
  $  037.档位信息                            $    $  /        $    $  ANS005.BYTE004  $  switxh(x) 0x00:y=@0b00;0x01:y=@011e;0x02:y=@013b;0x03:y=@061b;0x04:y=@0dd2;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7A5 30 00 00 00 00 00 00 00  $FC 
  $FC REQ001:7A5 30 00 0B 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
