
    车型ID：3c11

    模拟：协议模拟-->3c11

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E9

进入命令:

  $~  REQ000:7E1 02 10 03 00 00 00 00 00       $~  ANS000:7E9 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 00 00 00 00 00 00       $!  ANS000:7E9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 8F 00 00 00 00       $#  ANS000:7E9 03 19 02 8F 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/12000000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 81 00 00 00 00       $%  ANS000:7E9 03 22 F1 81 00 00 00 00
  $%  REQ001:7E1 03 22 F1 87 00 00 00 00       $%  ANS001:7E9 03 22 F1 87 00 00 00 00
  $%  REQ002:7E1 03 22 F1 8C 00 00 00 00       $%  ANS002:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ003:7E1 03 22 F1 90 00 00 00 00       $%  ANS003:7E9 03 22 F1 90 00 00 00 00
  $%  REQ004:7E1 03 22 F1 92 00 00 00 00       $%  ANS004:7E9 03 22 F1 92 00 00 00 00
  $%  REQ005:7E1 03 22 F1 93 00 00 00 00       $%  ANS005:7E9 03 22 F1 93 00 00 00 00
  $%  REQ006:7E1 03 22 F1 94 00 00 00 00       $%  ANS006:7E9 03 22 F1 94 00 00 00 00
  $%  REQ007:7E1 03 22 F1 95 00 00 00 00       $%  ANS007:7E9 03 22 F1 95 00 00 00 00
  $%  REQ008:7E1 03 22 F1 99 00 00 00 00       $%  ANS008:7E9 03 22 F1 99 00 00 00 00
  $%  REQ009:7E1 03 22 F1 A8 00 00 00 00       $%  ANS009:7E9 03 22 F1 A8 00 00 00 00
  $%  REQ010:7E1 03 22 F1 88 00 00 00 00       $%  ANS010:7E9 03 22 F1 88 00 00 00 00
  $%  REQ011:7E1 03 22 F1 89 00 00 00 00       $%  ANS011:7E9 03 22 F1 89 00 00 00 00
  $%  REQ012:7E1 03 22 F1 8B 00 00 00 00       $%  ANS012:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ013:7E1 03 22 F1 8E 00 00 00 00       $%  ANS013:7E9 03 22 F1 8E 00 00 00 00
  $%  REQ014:7E1 03 22 F1 91 00 00 00 00       $%  ANS014:7E9 03 22 F1 91 00 00 00 00
  $%  REQ015:7E1 03 22 F1 97 00 00 00 00       $%  ANS015:7E9 03 22 F1 97 00 00 00 00
  $%  REQ016:7E1 03 22 F1 9D 00 00 00 00       $%  ANS016:7E9 03 22 F1 9D 00 00 00 00

  $%  000:应用软件识别号:                           $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  001:车辆组装零件号:                           $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  002:电控单元(ECU)序列号:                      $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  003:车辆识别码(VIN码):                        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  004:系统供应商电控单元(ECU)硬件号:            $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  005:电控单元(ECU)硬件版本号:                  $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  006:系统供应商电控单元(ECU)软件号:            $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:电控单元(ECU)软件版本号:                  $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:重编程日期:                               $%    $%  ANS008.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  009:车辆特征代码:                             $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  010:车辆制造商电控单元(ECU)软件号:            $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  011:车辆制造商电控单元(ECU)软件版本号:        $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  012:电控单元(ECU)制造日期:                    $%    $%  ANS012.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  013:车辆制造商套件装配零件编号:               $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  014:车辆制造商硬件号:                         $%    $%  ANS014.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  015:系统名称或发动机类型:                     $%    $%  ANS015.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  016:电控单元(ECU)安装日期:                    $%    $%  ANS016.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 FE 10 00 00 00 00       $  ANS000:7E9 03 22 FE 10 00 00 00 00
  $  REQ001:7E1 03 22 FE 11 00 00 00 00       $  ANS001:7E9 03 22 FE 11 00 00 00 00
  $  REQ002:7E1 03 22 FE D1 00 00 00 00       $  ANS002:7E9 03 22 FE D1 00 00 00 00
  $  REQ003:7E1 03 22 FE D2 00 00 00 00       $  ANS003:7E9 03 22 FE D2 00 00 00 00
  $  REQ004:7E1 03 22 FE 15 00 00 00 00       $  ANS004:7E9 03 22 FE 15 00 00 00 00

  $  000.发动机转速                                                           $    $  1/min     $    $  ANS000.BYTE008  $  y=0.25*(x1*0x100+x2);
  $  001.由TCU(变速器控制单元)计算的车速                                      $    $  km/h      $    $  ANS000.BYTE010  $  y=x;
  $  002.节气门位置                                                           $    $  %         $    $  ANS000.BYTE011  $  y=x/2.55;
  $  003.主轮速度                                                             $    $  1/min     $    $  ANS000.BYTE012  $  y=0.25*(x1*0x100+x2);
  $  004.输出转速                                                             $    $  1/min     $    $  ANS000.BYTE014  $  y=0.25*(x1*0x100+x2);
  $  005.离合器打滑(仅采用正值)                                               $    $            $    $  ANS000.BYTE017  $  y=0.25*(x1*0x100+x2)-512;
  $  006.EDS1(电子差速锁1)的PWM(脉宽调制)占空比                               $    $  %         $    $  ANS000.BYTE024  $  y=0.3922*x;
  $  007.EDS2(电子差速锁2)的PWM(脉宽调制)占空比                               $    $  %         $    $  ANS000.BYTE025  $  y=0.3922*x;
  $  008.EDS3(电子差速锁3)的PWM(脉宽调制)占空比                               $    $  %         $    $  ANS000.BYTE026  $  y=0.3922*x;
  $  009.机油温度                                                             $    $  degC      $    $  ANS000.BYTE037  $  y=x-40;
  $  010.档位速比                                                             $    $            $    $  ANS000.BYTE038  $  y=0.001*(x1*0x100+x2);
  $  011.操纵杆位置                                                           $    $            $    $  ANS000.BYTE040  $  y=x;
  $  012.EOL(下线测试)离合器自适应错误                                        $    $            $    $  ANS000.BYTE041  $  y=x;
  $  013.要更新的离合器电流值                                                 $    $  mA        $    $  ANS000.BYTE043  $  y=(x1*0x100+x2)*0.01;
  $  014.发动机扭矩                                                           $    $  Nm        $    $  ANS001.BYTE011  $  y=2*x-150;
  $  015.制动故障状态                                                         $    $            $    $  ANS002.BYTE008  $  y=(x1*0x100+x2);
  $  016.发动机冷却液温度                                                     $    $  degC      $    $  ANS002.BYTE014  $  y=x-48;
  $  017.ABS(防抱死刹车系统)信号故障                                          $    $            $    $  ANS002.BYTE015  $  y=HEX(x1,x2,x3,x4);
  $  018.CAN上丢失ABS(防抱死刹车系统)标示符                                   $    $            $    $  ANS002.BYTE019  $  y=x;
  $  019.EMS(发动机管理系统)信号故障                                          $    $            $    $  ANS002.BYTE020  $  y=HEX(x1,x2,x3,x4);
  $  020.CAN上丢失EMS(发动机管理系统)标示符                                   $    $            $    $  ANS002.BYTE024  $  y=x;
  $  021.HCU(液压控制单元)系统信号故障                                        $    $            $    $  ANS002.BYTE025  $  y=HEX(x1,x2);
  $  022.CAN上丢失HCU(液压控制单元)标示符                                     $    $            $    $  ANS002.BYTE027  $  y=x;
  $  023.电机控制系统(MCU) (微型控制单元) 系统信号故障                        $    $            $    $  ANS002.BYTE028  $  y=HEX(x1,x2);
  $  024.CAN上丢失电机控制系统(MCU) (微型控制单元) 标示符                     $    $            $    $  ANS002.BYTE030  $  y=x;
  $  025.CAN上丢失TCU(变速器控制单元)传输标示符                               $    $            $    $  ANS002.BYTE031  $  y=x;
  $  026.主动错误反应(1/2)                                                    $    $            $    $  ANS002.BYTE032  $  HEX(x1,x2,x3,x4);
  $  027.主动错误反应(2/2)                                                    $    $            $    $  ANS002.BYTE036  $  HEX(x1,x2,x3,x4);
  $  028.轮1压力调节器的指定电流                                              $    $  mA        $    $  ANS002.BYTE040  $  y=0.1*(x1*0x100+x2);
  $  029.轮2压力调节器的指定电流                                              $    $  mA        $    $  ANS002.BYTE042  $  y=0.1*(x1*0x100+x2);
  $  030.离合器压力调节器的指令电流                                           $    $  mA        $    $  ANS002.BYTE044  $  y=0.1*(x1*0x100+x2);
  $  031.目标比                                                               $    $            $    $  ANS002.BYTE047  $  y=0.001*(x1*0x100+x2);
  $  032.梯度比                                                               $    $            $    $  ANS002.BYTE049  $  y=0.001*(x1*0x100+x2);
  $  033.由TCU(变速器控制单元)计算的发动机扭矩                                $    $  Nm        $    $  ANS002.BYTE051  $  y=x1*0x100+x2;
  $  034.从轮速度                                                             $    $  1/min     $    $  ANS002.BYTE053  $  y=0.25*(x1*0x100+x2);
  $  035.轮1压力调节器的实际电流                                              $    $  mA        $    $  ANS002.BYTE055  $  y=0.1*(x1*0x100+x2);
  $  036.轮2压力调节器的实际电流                                              $    $  mA        $    $  ANS002.BYTE057  $  y=0.1*(x1*0x100+x2);
  $  037.离合器压力调节器的实际电流                                           $    $  mA        $    $  ANS002.BYTE059  $  y=0.1*(x1*0x100+x2);
  $  038.指令的离合器压力                                                     $    $  bar       $    $  ANS002.BYTE061  $  y=0.01*(x1*0x100+x2);
  $  039.指令的轮2压力                                                        $    $  bar       $    $  ANS002.BYTE063  $  y=0.01*(x1*0x100+x2);
  $  040.测量的轮2压力                                                        $    $  bar       $    $  ANS002.BYTE065  $  y=0.01*(x1*0x100+x2);
  $  041.测量的高侧电流                                                       $    $  mA        $    $  ANS002.BYTE067  $  y=0.01*(x1*0x100+x2);
  $  042.位置传感器-单线状态                                                  $    $            $    $  ANS003.BYTE008  $  y=x1*0x100+x2;
  $  043.ZF复位计数器                                                         $    $            $    $  ANS003.BYTE010  $  y=x1*0x100+x2;
  $  044.SV复位计数器                                                         $    $            $    $  ANS003.BYTE012  $  y=x1*0x100+x2;
  $  045.TRAP 复位计数器                                                      $    $            $    $  ANS003.BYTE014  $  y=x1*0x100+x2;
  $  046.TSK 复位计数器                                                       $    $            $    $  ANS003.BYTE016  $  y=x1*0x100+x2;
  $  047.热模式诊断状态                                                       $    $            $    $  ANS003.BYTE018  $  y=x1*0x100+x2;
  $  048.传感器信号状态                                                       $    $            $    $  ANS003.BYTE020  $  y=x1*0x100+x2;
  $  049.基于输出转速的车速                                                   $    $  km/h      $    $  ANS003.BYTE022  $  y=0.01*(x1*0x100+x2);
  $  050.非驱动轮的平均转速                                                   $    $  km/h      $    $  ANS003.BYTE024  $  y=0.01*(x1*0x100+x2);
  $  051.高侧电压                                                             $    $  V         $    $  ANS003.BYTE026  $  y=0.1*x;
  $  052.点火电压                                                             $    $  V         $    $  ANS003.BYTE027  $  y=0.1*x;
  $  053.传感器电源电压(5V)                                                   $    $  V         $    $  ANS003.BYTE028  $  y=0.1*x;
  $  054.传感器电源电压(8.4V)                                                 $    $  V         $    $  ANS003.BYTE029  $  y=0.1*x;
  $  055.里程                                                                 $    $  km        $    $  ANS003.BYTE030  $  y=(x1<<24)+(x2<<16)+(x3<<8)+x4;
  $  056.电瓶电压                                                             $    $  V         $    $  ANS003.BYTE034  $  y=0.1*x;
  $  057.外部WTD复位计数器                                                    $    $            $    $  ANS003.BYTE035  $  y=x1*0x100+x2;
  $  058.内部WTD复位计数器                                                    $    $            $    $  ANS003.BYTE037  $  y=x1*0x100+x2;
  $  059.TCU(变速器控制单元)冻结帧的杆位置                                    $    $            $    $  ANS003.BYTE039  $  y=x;
  $  060.离合器状态                                                           $    $            $    $  ANS003.BYTE040  $  y=x;
  $  061.离合器压力期望值                                                     $    $  bar       $    $  ANS003.BYTE041  $  y=0.1*x;
  $  062.自学习值有效指示                                                     $    $            $    $  ANS004.BYTE008  $  y=x1*0x100+x2;
  $  063.最后一次驾驶周期中倒档离合器在点火开关关闭时的温度                   $    $  degC      $    $  ANS004.BYTE010  $  y=x1*0x100+x2;
  $  064.最后一次驾驶周期中前进档离合器在点火开关关闭时的温度                 $    $  degC      $    $  ANS004.BYTE012  $  y=x1*0x100+x2;
  $  065.车速和次级速度之间的修正因数，以补偿车轮半径的误差。                 $    $            $    $  ANS004.BYTE086  $  y=0.01*(x1*0x100+x2);
  $  066.左侧驱动轮上ABS(防抱死刹车系统)传感器原始信号的修正因数              $    $            $    $  ANS004.BYTE088  $  y=0.01*(x1*0x100+x2);
  $  067.左侧非驱动轮上ABS(防抱死刹车系统)传感器原始信号的修正因数            $    $            $    $  ANS004.BYTE090  $  y=0.01*(x1*0x100+x2);
  $  068.右侧非驱动轮上ABS(防抱死刹车系统)传感器原始信号的修正因数            $    $            $    $  ANS004.BYTE092  $  y=0.01*(x1*0x100+x2);
  $  069.主速度传感器尖峰个数                                                 $    $            $    $  ANS004.BYTE094  $  y=x;
  $  070.从速度传感器尖峰个数                                                 $    $            $    $  ANS004.BYTE095  $  y=x;
  $  071.最后驾驶周期的FC96状态                                               $    $            $    $  ANS004.BYTE096  $  y=x;
  $  072.发动机关闭后最后里程计数                                             $    $  公里      $    $  ANS004.BYTE34564  $  y=(x1<<24)+(x2<<16)+(x3<<8)+x4;
  $  073.点火开关关闭前怠速停止重启管理器低检测的变换器比率的最后已知值       $    $            $    $  ANS004.BYTE38566  $  y=0.001*(x1*0x100+x2);
  $  074.变化器静止转换中的减速计时器因素的最后已知值                         $    $            $    $  ANS004.BYTE40568  $  y=0.001*(x1*0x100+x2);
  $  075.未限制比率                                                           $    $            $    $  ANS004.BYTE42570  $  y=0.001*(x1*0x100+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
