
    车型ID：3c32

    模拟：协议模拟-->3c32

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~702

进入命令:

  $~  REQ000:712 02 10 01 00 00 00 00 00       $~  ANS000:702 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:712 02 3E 00 00 00 00 00 00       $!  ANS000:702 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:712 03 19 02 09 00 00 00 00       $#  ANS000:702 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/2f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:712 04 14 FF FF FF 00 00 00       $$  ANS000:702 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:712 03 22 F1 82 00 00 00 00       $%  ANS000:702 03 22 F1 82 00 00 00 00
  $%  REQ001:712 03 22 F1 8A 00 00 00 00       $%  ANS001:702 03 22 F1 8A 00 00 00 00
  $%  REQ002:712 03 22 F1 90 00 00 00 00       $%  ANS002:702 03 22 F1 90 00 00 00 00
  $%  REQ003:712 03 22 F1 93 00 00 00 00       $%  ANS003:702 03 22 F1 93 00 00 00 00
  $%  REQ004:712 03 22 F1 95 00 00 00 00       $%  ANS004:702 03 22 F1 95 00 00 00 00
  $%  REQ005:712 03 22 F1 9B 00 00 00 00       $%  ANS005:702 03 22 F1 9B 00 00 00 00
  $%  REQ006:712 03 22 F1 9D 00 00 00 00       $%  ANS006:702 03 22 F1 9D 00 00 00 00
  $%  REQ007:712 03 22 F1 97 00 00 00 00       $%  ANS007:702 03 22 F1 97 00 00 00 00

  $%  000:应用数据识别数据识别符:                   $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  001:系统供应商标识:                           $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:车辆识别码:                               $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27);
  $%  003:系统供应商电控单元(ECU)硬件版本号:        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2);
  $%  004:系统供应商电控单元(ECU)软件版本号:        $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2);
  $%  005:标定日期信息:                             $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  006:电控单元(ECU)安装日期数据识别符:          $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  007:系统名称或发动机类型数据识别符:           $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.系统速度和状态信息
  $  00.系统速度和状态信息
  $  REQ000:712 03 22 30 07 00 00 00 00       $  ANS000:702 03 22 30 07 00 00 00 00

  $  000.左前轮速-未过滤                                     $    $  km/h     $    $  ANS000.BYTE004  $  y=0.0078125*(x1*0x100+x2);
  $  001.右前轮速-未处理                                     $    $  km/h     $    $  ANS000.BYTE006  $  y=0.0078125*(x1*0x100+x2);
  $  002.左后轮速-未处理                                     $    $  km/h     $    $  ANS000.BYTE008  $  y=0.0078125*(x1*0x100+x2);
  $  003.右后轮速-未处理                                     $    $  km/h     $    $  ANS000.BYTE010  $  y=0.0078125*(x1*0x100+x2);
  $  004.车速过滤值                                          $    $  km/h     $    $  ANS000.BYTE012  $  y=0.015625*(x1*0x100+x2);
  $  005.恶劣路况参数                                        $    $  G        $    $  ANS000.BYTE014  $  y=0.00392*x;
  $  006.左前轮速电气状态                                    $    $           $    $  ANS000.BYTE015  $  if(((x>>7)&1)) y=@001f;else y=@0004;
  $  007.右前轮速电气状态                                    $    $           $    $  ANS000.BYTE015  $  if(((x>>6)&1)) y=@001f;else y=@0004;
  $  008.左后轮速电气状态                                    $    $           $    $  ANS000.BYTE015  $  if(((x>>5)&1)) y=@001f;else y=@0004;
  $  009.右后轮速电气状态                                    $    $           $    $  ANS000.BYTE015  $  if(((x>>4)&1)) y=@001f;else y=@0004;
  $  010.驾驶员指定的牵引力控制系统(TCS)禁用开关             $    $           $    $  ANS000.BYTE015  $  if(((x>>3)&1)) y=@0288;else y=@0289;
  $  011.全轮驱动开关状态                                    $    $           $    $  ANS000.BYTE015  $  if(((x>>2)&1)) y=@0286;else y=@0287;
  $  012.ABS(防抱死刹车系统)激活                             $    $           $    $  ANS000.BYTE015  $  if(((x>>1)&1)) y=@0284;else y=@0285;
  $  013.ABS(防抱死刹车系统)制动开关(仅基于制动传感器)       $    $           $    $  ANS000.BYTE015  $  if(((x>>0)&1)) y=@0284;else y=@0285;
  $  014.系统电压                                            $    $  V        $    $  ANS000.BYTE016  $  y=(x1*0x100+x2)*1.0/1024;
  $  015.电瓶电压                                            $    $  V        $    $  ANS000.BYTE018  $  y=(x1*0x100+x2)*1.0/1024;
  $  016.系统状态操作                                        $    $  num      $    $  ANS000.BYTE022  $  y=x;

  $)  01.电源,马达及电磁阀信息
  $  01.电源,马达及电磁阀信息
  $  REQ000:712 03 22 30 08 00 00 00 00       $  ANS000:702 03 22 30 08 00 00 00 00

  $  000.泵马达电流                                $    $  amps     $    $  ANS000.BYTE004  $  y=(x1*0x100+x2)*1.0/64;
  $  001.电瓶电压                                  $    $  V        $    $  ANS000.BYTE008  $  y=(x1*0x100+x2)*1.0/1024;
  $  002.泵电压交叉反馈                            $    $  V        $    $  ANS000.BYTE010  $  y=(x1*0x100+x2)*1.0/1024;
  $  003.系统电压                                  $    $  V        $    $  ANS000.BYTE012  $  y=(x1*0x100+x2)*1.0/1024;
  $  004.马达驱动温度                              $    $  degC     $    $  ANS000.BYTE014  $  y=x1*0x100+x2;
  $  005.右后ABS(防抱死刹车系统)释放阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>7)&1)) y=@00b3;else y=@00b4;
  $  006.右后ABS(防抱死刹车系统)锁住阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>6)&1)) y=@00b3;else y=@00b4;
  $  007.左后ABS(防抱死刹车系统)释放阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>5)&1)) y=@00b3;else y=@00b4;
  $  008.左后ABS(防抱死刹车系统)锁住阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>4)&1)) y=@00b3;else y=@00b4;
  $  009.右前ABS(防抱死刹车系统)释放阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>3)&1)) y=@00b3;else y=@00b4;
  $  010.右前ABS(防抱死刹车系统)锁住阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>2)&1)) y=@00b3;else y=@00b4;
  $  011.左前ABS(防抱死刹车系统)释放阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>1)&1)) y=@00b3;else y=@00b4;
  $  012.左前ABS(防抱死刹车系统)锁住阀被激活       $    $           $    $  ANS000.BYTE016  $  if(((x>>0)&1)) y=@00b3;else y=@00b4;
  $  013.主填充电磁阀激活状态                      $    $           $    $  ANS000.BYTE017  $  if(((x>>7)&1)) y=@00b3;else y=@00b4;
  $  014.副填充电磁阀激活状态                      $    $           $    $  ANS000.BYTE017  $  if(((x>>6)&1)) y=@00b3;else y=@00b4;
  $  015.主ISO 电磁阀激活状态                      $    $           $    $  ANS000.BYTE017  $  if(((x>>5)&1)) y=@00b3;else y=@00b4;
  $  016.副ISO电磁阀激活状态                       $    $           $    $  ANS000.BYTE017  $  if(((x>>4)&1)) y=@00b3;else y=@00b4;
  $  017.泵启用指令                                $    $           $    $  ANS000.BYTE017  $  if(((x>>1)&1)) y=@00b3;else y=@00b4;

  $)  02.主缸压力传感器信息
  $  02.主缸压力传感器信息
  $  REQ000:712 03 22 30 10 00 00 00 00       $  ANS000:702 03 22 30 10 00 00 00 00

  $  000.总泵压力传感器1输入              $    $  V       $    $  ANS000.BYTE004  $  y=0.000244141*(x1*0x100+x2);
  $  001.总泵压力传感器1输入-发动机       $    $  psi     $    $  ANS000.BYTE006  $  y=x1*0x100+x2;
  $  002.总泵压力传感器1偏差              $    $  psi     $    $  ANS000.BYTE008  $  y=0.125*(x1*0x100+x2);
  $  003.总泵压力传感器1输入              $    $  V       $    $  ANS000.BYTE010  $  y=0.000244141*(x1*0x100+x2);
  $  004.总泵压力传感器1输入-发动机       $    $  psi     $    $  ANS000.BYTE012  $  y=x1*0x100+x2;
  $  005.总泵压力传感器1偏差              $    $  psi     $    $  ANS000.BYTE014  $  y=0.125*(x1*0x100+x2);
  $  006.居中的总泵压力                   $    $  psi     $    $  ANS000.BYTE016  $  y=0.125*(x1*0x100+x2);
  $  007.总泵制动开关                     $    $          $    $  ANS000.BYTE018  $  if(((x>>7)&1)) y=@00b3;else y=@00b4;
  $  008.总泵制动开关打开                 $    $          $    $  ANS000.BYTE018  $  if(((x>>6)&1)) y=@0044;else y=@0045;
  $  009.总泵制动开关关闭                 $    $          $    $  ANS000.BYTE018  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  010.总泵强制动开关                   $    $          $    $  ANS000.BYTE018  $  if(((x>>2)&1)) y=@00b3;else y=@00b4;
  $  011.总泵压力传感器电源输出           $    $  V       $    $  ANS000.BYTE019  $  y=0.000244141*(x1*0x100+x2);

  $)  03.系统转向信息
  $  03.系统转向信息
  $  REQ000:712 03 22 30 14 00 00 00 00       $  ANS000:702 03 22 30 14 00 00 00 00

  $  000.串行转向角                 $    $  deg         $    $  ANS000.BYTE004  $  y=0.5*(x1*0x100+x2);
  $  001.串行转向率                 $    $  deg/sec     $    $  ANS000.BYTE006  $  y=x1*0x100+x2;
  $  002.方向盘角度居中             $    $  deg         $    $  ANS000.BYTE008  $  y=0.5*(x1*0x100+x2);
  $  003.方向盘角度率过滤值         $    $  deg/sec     $    $  ANS000.BYTE010  $  y=0.125*(x1*0x100+x2);
  $  004.转向角居中                 $    $              $    $  ANS000.BYTE014  $  if(((x>>7)&1)) y=@0044;else y=@0045;
  $  005.反向检查                   $    $              $    $  ANS000.BYTE014  $  if(((x>>6)&1)) y=@0044;else y=@0045;
  $  006.转向传感器偏差失败         $    $              $    $  ANS000.BYTE014  $  switxh((x>>4)&3) 0:y=@0004;1:y=@028a;2:y=@028b;default:y=@0153;
  $  007.VSE_失败                   $    $              $    $  ANS000.BYTE014  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  008.VSE信息有效                $    $              $    $  ANS000.BYTE014  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  009.车辆VSE激活                $    $              $    $  ANS000.BYTE014  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  010.Msg_保护故障               $    $              $    $  ANS000.BYTE015  $  if(((x>>7)&1)) y=@0044;else y=@0045;
  $  011.串行转向传感器失败         $    $              $    $  ANS000.BYTE015  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  012.串行转向角有效性故障       $    $              $    $  ANS000.BYTE015  $  if(((x>>4)&1)) y=@0044;else y=@0045;
  $  013.Msg_旋转计数故障           $    $              $    $  ANS000.BYTE015  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  014.串行转向角正常             $    $              $    $  ANS000.BYTE015  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  015.估计的转向角有效           $    $              $    $  ANS000.BYTE016  $  if(((x>>7)&1)) y=@0044;else y=@0045;
  $  016.转向置中故障               $    $              $    $  ANS000.BYTE016  $  switxh((x>>5)&3) 0:y=@0004;1:y=@028a;2:y=@028b;default:y=@0153;
  $  017.转向传感器故障             $    $              $    $  ANS000.BYTE016  $  switxh((x>>3)&3) 0:y=@0004;1:y=@028a;2:y=@028b;default:y=@0153;
  $  018.串行转向率有效性故障       $    $              $    $  ANS000.BYTE016  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  019.串行转向率正常             $    $              $    $  ANS000.BYTE016  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  020.方向盘偏差                 $    $  degrees     $    $  ANS000.BYTE017  $  y=0.25*(x1*0x100+x2);
  $  021.方向盘角度估计值           $    $  degrees     $    $  ANS000.BYTE019  $  y=0.25*(x1*0x100+x2);

  $)  04.系统横摆率信息
  $  04.系统横摆率信息
  $  REQ000:712 03 22 30 13 00 00 00 00       $  ANS000:702 03 22 30 13 00 00 00 00

  $  000.车辆横摆率－工程单元       $    $  deg/sec     $    $  ANS000.BYTE004  $  y=0.00390625*(x1*0x100+x2);
  $  001.横摆率过滤值               $    $  deg/sec     $    $  ANS000.BYTE006  $  y=0.58*(x1*0x100+x2);
  $  002.横摆率错误                 $    $  deg/sec     $    $  ANS000.BYTE008  $  y=0.00390625*(x1*0x100+x2);
  $  003.横摆加速度                 $    $  deg/sec     $    $  ANS000.BYTE010  $  y=0.0625*(x1*0x100+x2);
  $  004.横摆率偏差                 $    $  deg/sec     $    $  ANS000.BYTE012  $  y=0.5*x;
  $  005.横摆率估计值               $    $  deg/sec     $    $  ANS000.BYTE013  $  y=0.5*(x1*0x100+x2);
  $  006.横摆率置中                 $    $  deg/sec     $    $  ANS000.BYTE015  $  y=0.5*(x1*0x100+x2);
  $  007.横摆率已置中               $    $              $    $  ANS000.BYTE017  $  if(((x>>7)&1)) y=@0044;else y=@0045;
  $  008.估计横摆率有效             $    $              $    $  ANS000.BYTE017  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  009.车辆停止                   $    $              $    $  ANS000.BYTE017  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  010.VSE_失败                   $    $              $    $  ANS000.BYTE017  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  011.VSE信息有效                $    $              $    $  ANS000.BYTE017  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  012.车辆VSE激活                $    $              $    $  ANS000.BYTE017  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  013.横摆传感器错误             $    $              $    $  ANS000.BYTE018  $  if(((x>>6)&1)) y=@0044;else y=@0045;
  $  014.横摆加速度故障             $    $              $    $  ANS000.BYTE018  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  015.横摆率偏差故障             $    $              $    $  ANS000.BYTE018  $  if(((x>>4)&1)) y=@0044;else y=@0045;
  $  016.横摆传感器状态             $    $              $    $  ANS000.BYTE018  $  switxh((x>>2)&3) 0:y=@028c;1:y=@001f;2:y=@028d;3:y=@028e;default:y=@0153;
  $  017.横摆率故障                 $    $              $    $  ANS000.BYTE018  $  switxh(x&3) 0:y=@0004;1:y=@028a;2:y=@028b;default:y=@0153;

  $)  05.系统横向加速信息
  $  05.系统横向加速信息
  $  REQ000:712 03 22 30 12 00 00 00 00       $  ANS000:702 03 22 30 12 00 00 00 00

  $  000.横向加速输入值         $    $  g's     $    $  ANS000.BYTE004  $  y=0.00012207*(x1*0x100+x2);
  $  001.横向加速度过滤值       $    $  g's     $    $  ANS000.BYTE006  $  y=0.0078125*(x1*0x100+x2);
  $  002.置中的横向加速度       $    $  g's     $    $  ANS000.BYTE008  $  y=0.0078125*(x1*0x100+x2);
  $  003.横向加速度偏差         $    $  g's     $    $  ANS000.BYTE010  $  y=0.0078125*x;
  $  004.车辆CG横向加速度       $    $  g's     $    $  ANS000.BYTE011  $  y=0.000061035*(x1*0x100+x2);
  $  005.横向加速度失败         $    $          $    $  ANS000.BYTE013  $  switxh((x>>6)&3) 0:y=@0004;1:y=@028a;2:y=@028b;default:y=@0153;
  $  006.横向加速度错误         $    $          $    $  ANS000.BYTE013  $  if(((x>>4)&1)) y=@00ec;else y=@0004;
  $  007.车辆停止               $    $          $    $  ANS000.BYTE013  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  008.VSE_失败               $    $          $    $  ANS000.BYTE013  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  009.VSE信息有效            $    $          $    $  ANS000.BYTE013  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  010.车辆VSE激活            $    $          $    $  ANS000.BYTE013  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  011.横向加速度故障         $    $          $    $  ANS000.BYTE014  $  if(((x>>7)&1)) y=@0044;else y=@0045;
  $  012.横向停止故障           $    $          $    $  ANS000.BYTE014  $  if(((x>>6)&1)) y=@0044;else y=@0045;
  $  013.横向偏差故障           $    $          $    $  ANS000.BYTE014  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  014.传感器可信性故障       $    $          $    $  ANS000.BYTE014  $  switxh((x>>1)&3) 0:y=@0004;1:y=@028a;2:y=@028b;default:y=@0153;
  $  015.传感器可信性故障       $    $          $    $  ANS000.BYTE014  $  if(((x>>0)&1)) y=@0044;else y=@0045;

  $)  06.系统纵向加速信息
  $  06.系统纵向加速信息
  $  REQ000:712 03 22 30 19 00 00 00 00       $  ANS000:702 03 22 30 19 00 00 00 00

  $  000.纵向加速度输入值       $    $  g        $    $  ANS000.BYTE006  $  y=0.000488281*(x1*0x100+x2);
  $  001.偏差的加速计信号       $    $  g        $    $  ANS000.BYTE008  $  y=0.000488281*(x1*0x100+x2);
  $  002.未过滤的车速           $    $  km/h     $    $  ANS000.BYTE010  $  y=0.015625*(x1*0x100+x2);
  $  003.加速计车速             $    $  km/h     $    $  ANS000.BYTE012  $  y=0.015625*(x1*0x100+x2);
  $  004.无效的加速计信号       $    $           $    $  ANS000.BYTE014  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  005.车速加速未决           $    $           $    $  ANS000.BYTE014  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  006.车辆加速               $    $           $    $  ANS000.BYTE014  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  007.反向器检查             $    $           $    $  ANS000.BYTE014  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  008.加速恢复状态           $    $           $    $  ANS000.BYTE014  $  if(((x>>4)&1)) y=@0044;else y=@0045;

  $)  07.电子制动控制模块(EBCM)内部传感器信息
  $  07.电子制动控制模块(EBCM)内部传感器信息
  $  REQ000:712 03 22 30 1A 00 00 00 00       $  ANS000:702 03 22 30 1A 00 00 00 00

  $  000.传感器输入电压(未过滤)          $    $  V         $    $  ANS000.BYTE004  $  y=0.000244140625*(x1*0x100+x2);
  $  001.电子控制器(ECU)_X_轴_加速       $    $  g's       $    $  ANS000.BYTE006  $  y=0.00012207*(x1*0x100+x2);
  $  002.电子控制器(ECU)_Y_轴_加速       $    $  g's       $    $  ANS000.BYTE008  $  y=0.00012207*(x1*0x100+x2);
  $  003.电子控制器(ECU)_Z_轴_加速       $    $  g's       $    $  ANS000.BYTE010  $  y=0.00012207*(x1*0x100+x2);
  $  004.横向加速－工程单元              $    $  g's       $    $  ANS000.BYTE012  $  y=0.000061035*(x1*0x100+x2);
  $  005.纵向加速－工程单元              $    $  g's       $    $  ANS000.BYTE014  $  y=0.000061035*(x1*0x100+x2);
  $  006.横摆率传感器输入(未过滤)        $    $  deg/s     $    $  ANS000.BYTE016  $  y=0.00390625*(x1*0x100+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:712 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
