
    车型ID：000e

    模拟：协议模拟-->000e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7AA

进入命令:

  $~  REQ000:72A 02 10 01 00 00 00 00 00       $~  ANS000:7AA 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:72A 02 3E 80 00 00 00 00 00       $!  ANS000:7AA 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:72A 03 19 02 09 00 00 00 00       $#  ANS000:7AA 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/0d000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:72A 04 14 FF FF FF 00 00 00       $$  ANS000:7AA 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:72A 03 22 F1 12 00 00 00 00       $%  ANS000:7AA 03 22 F1 12 00 00 00 00
  $%  REQ001:72A 03 22 F1 13 00 00 00 00       $%  ANS001:7AA 03 22 F1 13 00 00 00 00
  $%  REQ002:72A 03 22 F1 80 00 00 00 00       $%  ANS002:7AA 03 22 F1 80 00 00 00 00
  $%  REQ003:72A 03 22 F1 87 00 00 00 00       $%  ANS003:7AA 03 22 F1 87 00 00 00 00
  $%  REQ004:72A 03 22 F1 8A 00 00 00 00       $%  ANS004:7AA 03 22 F1 8A 00 00 00 00
  $%  REQ005:72A 03 22 F1 8C 00 00 00 00       $%  ANS005:7AA 03 22 F1 8C 00 00 00 00
  $%  REQ006:72A 03 22 F1 90 00 00 00 00       $%  ANS006:7AA 03 22 F1 90 00 00 00 00
  $%  REQ007:72A 03 22 F1 93 00 00 00 00       $%  ANS007:7AA 03 22 F1 93 00 00 00 00
  $%  REQ008:72A 03 22 F1 95 00 00 00 00       $%  ANS008:7AA 03 22 F1 95 00 00 00 00
  $%  REQ009:72A 03 22 F1 97 00 00 00 00       $%  ANS009:7AA 03 22 F1 97 00 00 00 00
  $%  REQ010:72A 03 22 F0 10 00 00 00 00       $%  ANS010:7AA 03 22 F0 10 00 00 00 00

  $%  000:车辆名称:                       $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:诊断版本:                       $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  002:引导软件识别号:                 $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  003:零部件号:                       $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  004:系统供应商编号:                 $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:ECU序列号:                      $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6);
  $%  006:车辆识别号:                     $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:系统供应商ECU硬件版本号:        $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  008:系统供应商ECU软件版本号:        $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21);
  $%  009:系统名称或引擎类型:             $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:下线配置编码:                   $%    $%  ANS010.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:72A 03 22 CF 01 00 00 00 00       $  ANS000:7AA 03 22 CF 01 00 00 00 00
  $  REQ001:72A 03 22 CF 00 00 00 00 00       $  ANS001:7AA 03 22 CF 00 00 00 00 00
  $  REQ002:72A 03 22 2B 80 00 00 00 00       $  ANS002:7AA 03 22 2B 80 00 00 00 00
  $  REQ003:72A 03 22 2B 81 00 00 00 00       $  ANS003:7AA 03 22 2B 81 00 00 00 00
  $  REQ004:72A 03 22 2B 82 00 00 00 00       $  ANS004:7AA 03 22 2B 82 00 00 00 00
  $  REQ005:72A 03 22 2B 83 00 00 00 00       $  ANS005:7AA 03 22 2B 83 00 00 00 00
  $  REQ006:72A 03 22 2B 84 00 00 00 00       $  ANS006:7AA 03 22 2B 84 00 00 00 00
  $  REQ007:72A 03 22 2B 85 00 00 00 00       $  ANS007:7AA 03 22 2B 85 00 00 00 00
  $  REQ008:72A 03 22 2B 86 00 00 00 00       $  ANS008:7AA 03 22 2B 86 00 00 00 00
  $  REQ009:72A 03 22 2B 87 00 00 00 00       $  ANS009:7AA 03 22 2B 87 00 00 00 00
  $  REQ010:72A 03 22 2B 88 00 00 00 00       $  ANS010:7AA 03 22 2B 88 00 00 00 00
  $  REQ011:72A 03 22 2B B0 00 00 00 00       $  ANS011:7AA 03 22 2B B0 00 00 00 00
  $  REQ012:72A 03 22 2B B1 00 00 00 00       $  ANS012:7AA 03 22 2B B1 00 00 00 00

  $  000.车速                         $    $  km/h     $    $  ANS000.BYTE004  $  y = SPRINTF([%d], (x1*256+x2)*0.05625);
  $  001.ECU 电源电压                 $    $  v        $    $  ANS001.BYTE004  $  y = SPRINTF([%.2f], x1*0.10);
  $  002.当前校准里程                 $    $  m        $    $  ANS002.BYTE004  $  y = SPRINTF([%d], (x1*256*256*256+x2*256*256+x3*256+x4));
  $  003.当前初始校准状态             $    $           $    $  ANS002.BYTE008  $  if(x1==0) y=@0120;else if(x1==1) y=@0121;else if(x1==2) y=@0122;else if(x1==3) y=@001e;else if(x1==4) y=@0123;else if(x1==5) y=@0124;else y=@0003;
  $  004.最后校准状态                 $    $           $    $  ANS002.BYTE009  $  if(x1==0) y=@010f;else if(x1==1) y=@0110;else if(x1==2) y=@0111;else if(x1==3) y=@0112;else if(x1==4) y=@0113;else if(x1==5) y=@0114;else if(x1==6) y=@0115;else if(x1==7) y=@0116;else if(x1==8) y=@0117;else if(x1==9) y=@0118;else if(x1==10) y=@0119;else if(x1==11) y=@011a;else if(x1==12) y=@011b;else if(x1==13) y=@011c;else if(x1==14) y=@011d;else if(x1==15) y=@011e;else if(x1==255) y=@011f;else y=@0003;
  $  005.时间戳年份                   $    $           $    $  ANS002.BYTE010  $  y = SPRINTF([%d], x1+2000);
  $  006.时间戳月份                   $    $           $    $  ANS002.BYTE011  $  y = SPRINTF([%d], x1);
  $  007.时间戳日                     $    $           $    $  ANS002.BYTE012  $  y = SPRINTF([%d], x1);
  $  008.时间戳时                     $    $           $    $  ANS002.BYTE013  $  y = SPRINTF([%d], x1);
  $  009.时间戳分                     $    $           $    $  ANS002.BYTE014  $  y = SPRINTF([%d], x1);
  $  010.时间戳秒                     $    $           $    $  ANS002.BYTE015  $  y = SPRINTF([%d], x1);
  $  011.相机高度                     $    $  mm       $    $  ANS003.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  012.滚动角度                     $    $  deg      $    $  ANS003.BYTE006  $  y = SPRINTF([%.2f], 20-(x1*256+x2)*0.001);
  $  013.俯仰角                       $    $  deg      $    $  ANS003.BYTE008  $  y = SPRINTF([%.2f], 20-(x1*256+x2)*0.001);
  $  014.偏航角                       $    $  deg      $    $  ANS003.BYTE010  $  y = SPRINTF([%.2f], 20-(x1*256+x2)*0.001);
  $  015.相机高度质量                 $    $           $    $  ANS003.BYTE012  $  y = SPRINTF([%.2f], (x1*256+x2)*0.0001);
  $  016.滚动角度质量                 $    $           $    $  ANS003.BYTE014  $  y = SPRINTF([%.2f], (x1*256+x2)*0.0001);
  $  017.俯仰角质量                   $    $           $    $  ANS003.BYTE016  $  y = SPRINTF([%.2f], (x1*256+x2)*0.0001);
  $  018.偏航角度质量                 $    $           $    $  ANS003.BYTE018  $  y = SPRINTF([%.2f], (x1*256+x2)*0.0001);
  $  019.初始在线校准行程距离         $    $  m        $    $  ANS004.BYTE004  $  y = SPRINTF([%d], (x1*256*256+x2*256+x3));
  $  020.第二个校准状态               $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@010f;else if(x1==1) y=@0110;else if(x1==2) y=@0111;else if(x1==3) y=@0112;else if(x1==4) y=@0113;else if(x1==5) y=@0114;else if(x1==6) y=@0115;else if(x1==7) y=@0116;else if(x1==8) y=@0117;else if(x1==9) y=@0118;else if(x1==10) y=@0119;else if(x1==11) y=@011a;else if(x1==12) y=@011b;else if(x1==13) y=@011c;else if(x1==14) y=@011d;else if(x1==15) y=@011e;else if(x1==255) y=@011f;else y=@0003;
  $  021.第三个校准状态               $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@010f;else if(x1==1) y=@0110;else if(x1==2) y=@0111;else if(x1==3) y=@0112;else if(x1==4) y=@0113;else if(x1==5) y=@0114;else if(x1==6) y=@0115;else if(x1==7) y=@0116;else if(x1==8) y=@0117;else if(x1==9) y=@0118;else if(x1==10) y=@0119;else if(x1==11) y=@011a;else if(x1==12) y=@011b;else if(x1==13) y=@011c;else if(x1==14) y=@011d;else if(x1==15) y=@011e;else if(x1==255) y=@011f;else y=@0003;
  $  022.第四个校准状态               $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@010f;else if(x1==1) y=@0110;else if(x1==2) y=@0111;else if(x1==3) y=@0112;else if(x1==4) y=@0113;else if(x1==5) y=@0114;else if(x1==6) y=@0115;else if(x1==7) y=@0116;else if(x1==8) y=@0117;else if(x1==9) y=@0118;else if(x1==10) y=@0119;else if(x1==11) y=@011a;else if(x1==12) y=@011b;else if(x1==13) y=@011c;else if(x1==14) y=@011d;else if(x1==15) y=@011e;else if(x1==255) y=@011f;else y=@0003;
  $  023.初始在线校准运行             $    $           $    $  ANS006.BYTE004  $  if(x1==0) y=@010d;else if(x1==1) y=@010e;else y=@0003;
  $  024.x-左上校准标记的坐标         $    $  mm       $    $  ANS007.BYTE004  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  025.y-左上校准标记的坐标         $    $  mm       $    $  ANS007.BYTE006  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25-4000);
  $  026.z-左上校准标记的坐标         $    $  mm       $    $  ANS007.BYTE008  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  027.x右上校准标记的坐标          $    $  mm       $    $  ANS007.BYTE010  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  028.y-右上校准标记的坐标         $    $  mm       $    $  ANS007.BYTE012  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25-4000);
  $  029.z-右上校准标记的坐标         $    $  mm       $    $  ANS007.BYTE014  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  030.x-左下校准标记的坐标         $    $  mm       $    $  ANS007.BYTE016  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  031.y-左下校准标记的坐标         $    $  mm       $    $  ANS007.BYTE018  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25-4000);
  $  032.z-左下校准标记的坐标         $    $  mm       $    $  ANS007.BYTE020  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  033.x-右下校准标记的坐标         $    $  mm       $    $  ANS007.BYTE022  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  034.y-右下校准标记的坐标         $    $  mm       $    $  ANS007.BYTE024  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25-4000);
  $  035.z-右下校准标记的坐标         $    $  mm       $    $  ANS007.BYTE026  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  036.车辆横向位置前轴             $    $  mm       $    $  ANS008.BYTE004  $  y = SPRINTF([%.2f], (x1*256+x2)*0.10-400);
  $  037.车辆横向位置后轴             $    $  mm       $    $  ANS008.BYTE006  $  y = SPRINTF([%.2f], (x1*256+x2)*0.10-400);
  $  038.车身高度轮舱边缘左前方       $    $  mm       $    $  ANS009.BYTE004  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  039.车身高度轮毂边缘右前方       $    $  mm       $    $  ANS009.BYTE006  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  040.车身高度轮舱边缘左后方       $    $  mm       $    $  ANS009.BYTE008  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  041.车身高度轮毂边缘右后方       $    $  mm       $    $  ANS009.BYTE010  $  y = SPRINTF([%.2f], (x1*256+x2)*0.25);
  $  042.校准板到前轴的距离           $    $  mm       $    $  ANS010.BYTE004  $  y = SPRINTF([%.2f], (x1*256+x2));
  $  043.编程计数器                   $    $           $    $  ANS011.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  044.编程尝试计数器               $    $           $    $  ANS012.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:72A 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
