
    车型ID：0012

    模拟：协议模拟-->0012

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~785

进入命令:

  $~  REQ000:705 02 10 01 00 00 00 00 00       $~  ANS000:785 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:705 02 3E 80 00 00 00 00 00       $!  ANS000:785 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:705 03 19 02 09 00 00 00 00       $#  ANS000:785 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/11000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:705 04 14 FF FF FF 00 00 00       $$  ANS000:785 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:705 03 22 F1 87 00 00 00 00       $%  ANS000:785 03 22 F1 87 00 00 00 00
  $%  REQ001:705 03 22 F1 8A 00 00 00 00       $%  ANS001:785 03 22 F1 8A 00 00 00 00
  $%  REQ002:705 03 22 F1 97 00 00 00 00       $%  ANS002:785 03 22 F1 97 00 00 00 00
  $%  REQ003:705 03 22 F1 93 00 00 00 00       $%  ANS003:785 03 22 F1 93 00 00 00 00
  $%  REQ004:705 03 22 F1 95 00 00 00 00       $%  ANS004:785 03 22 F1 95 00 00 00 00
  $%  REQ005:705 03 22 F1 8C 00 00 00 00       $%  ANS005:785 03 22 F1 8C 00 00 00 00
  $%  REQ006:705 03 22 F1 90 00 00 00 00       $%  ANS006:785 03 22 F1 90 00 00 00 00
  $%  REQ007:705 03 22 F1 80 00 00 00 00       $%  ANS007:785 03 22 F1 80 00 00 00 00

  $%  000:零件号:                                              $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  001:系统供应商识别符:                                    $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:系统名称:                                            $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:系统供应商硬件版本号:                                $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:系统供应商软件版本号:                                $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21);
  $%  005:ECU序列号:                                           $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  006:车架号(VIN):                                         $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:系统供应商ECU Bootloader(引导加载程序)版本号:        $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:705 03 22 19 00 00 00 00 00       $  ANS000:785 03 22 19 00 00 00 00 00
  $  REQ001:705 03 22 19 01 00 00 00 00       $  ANS001:785 03 22 19 01 00 00 00 00
  $  REQ002:705 03 22 19 02 00 00 00 00       $  ANS002:785 03 22 19 02 00 00 00 00
  $  REQ003:705 03 22 19 04 00 00 00 00       $  ANS003:785 03 22 19 04 00 00 00 00
  $  REQ004:705 03 22 19 05 00 00 00 00       $  ANS004:785 03 22 19 05 00 00 00 00
  $  REQ005:705 03 22 19 06 00 00 00 00       $  ANS005:785 03 22 19 06 00 00 00 00
  $  REQ006:705 03 22 19 07 00 00 00 00       $  ANS006:785 03 22 19 07 00 00 00 00
  $  REQ007:705 03 22 19 08 00 00 00 00       $  ANS007:785 03 22 19 08 00 00 00 00
  $  REQ008:705 03 22 19 09 00 00 00 00       $  ANS008:785 03 22 19 09 00 00 00 00
  $  REQ009:705 03 22 19 14 00 00 00 00       $  ANS009:785 03 22 19 14 00 00 00 00

  $  000.座椅前部电机位置计数                   $    $        $    $  ANS000.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  001.座椅后部电机位置计数                   $    $        $    $  ANS000.BYTE006  $  y = SPRINTF([%d], (x1*256+x2));
  $  002.滑道电机位置计数                       $    $        $    $  ANS000.BYTE008  $  y = SPRINTF([%d], (x1*256+x2));
  $  003.靠背电机位置计数                       $    $        $    $  ANS000.BYTE010  $  y = SPRINTF([%d], (x1*256+x2));
  $  004.左后视镜上下电机位置计数               $    $        $    $  ANS000.BYTE012  $  y = SPRINTF([%d], (x1*256+x2));
  $  005.右后视镜上下电机位置计数               $    $        $    $  ANS000.BYTE014  $  y = SPRINTF([%d], (x1*256+x2));
  $  006.左后视镜左右电机位置计数               $    $        $    $  ANS000.BYTE016  $  y = SPRINTF([%d], (x1*256+x2));
  $  007.右后视镜左右电机位置计数               $    $        $    $  ANS000.BYTE018  $  y = SPRINTF([%d], (x1*256+x2));
  $  008.座椅滑道电机                           $    $        $    $  ANS001.BYTE004  $  if(((x1>>7)&1)) y=@00a0;else y=@004a;
  $  009.座椅靠背电机                           $    $        $    $  ANS001.BYTE004  $  if(((x1>>6)&1)) y=@00a0;else y=@004a;
  $  010.座椅前部电机                           $    $        $    $  ANS001.BYTE004  $  if(((x1>>5)&1)) y=@00a0;else y=@004a;
  $  011.座椅后部电机                           $    $        $    $  ANS001.BYTE004  $  if(((x1>>4)&1)) y=@00a0;else y=@004a;
  $  012.左后视镜上下电机                       $    $        $    $  ANS001.BYTE004  $  if(((x1>>3)&1)) y=@00a0;else y=@004a;
  $  013.右后视镜上下电机                       $    $        $    $  ANS001.BYTE004  $  if(((x1>>2)&1)) y=@00a0;else y=@004a;
  $  014.左后视镜左右电机                       $    $        $    $  ANS001.BYTE004  $  if(((x1>>1)&1)) y=@00a0;else y=@004a;
  $  015.右后视镜左右电机                       $    $        $    $  ANS001.BYTE004  $  if(((x1>>0)&1)) y=@00a0;else y=@004a;
  $  016.滑道向前开关状态                       $    $        $    $  ANS002.BYTE004  $  if(((x1>>7)&1)) y=@00a0;else y=@004a;
  $  017.滑道向后开关状态                       $    $        $    $  ANS002.BYTE004  $  if(((x1>>6)&1)) y=@00a0;else y=@004a;
  $  018.座椅前部向上开关状态                   $    $        $    $  ANS002.BYTE004  $  if(((x1>>5)&1)) y=@00a0;else y=@004a;
  $  019.座椅前部向下开关状态                   $    $        $    $  ANS002.BYTE004  $  if(((x1>>4)&1)) y=@00a0;else y=@004a;
  $  020.座椅后部向上开关状态                   $    $        $    $  ANS002.BYTE004  $  if(((x1>>3)&1)) y=@00a0;else y=@004a;
  $  021.座椅后部向下开关状态                   $    $        $    $  ANS002.BYTE004  $  if(((x1>>2)&1)) y=@00a0;else y=@004a;
  $  022.靠背向前开关状态                       $    $        $    $  ANS002.BYTE004  $  if(((x1>>1)&1)) y=@00a0;else y=@004a;
  $  023.靠背向后开关状态                       $    $        $    $  ANS002.BYTE004  $  if(((x1>>0)&1)) y=@00a0;else y=@004a;
  $  024.左后视镜向上开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>7)&1)) y=@00a0;else y=@004a;
  $  025.左后视镜向下开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>6)&1)) y=@00a0;else y=@004a;
  $  026.右后视镜向上开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>5)&1)) y=@00a0;else y=@004a;
  $  027.右后视镜向下开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>4)&1)) y=@00a0;else y=@004a;
  $  028.左后视镜向左开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>3)&1)) y=@00a0;else y=@004a;
  $  029.左后视镜向右开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>2)&1)) y=@00a0;else y=@004a;
  $  030.右后视镜向左开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>1)&1)) y=@00a0;else y=@004a;
  $  031.右后视镜向右开关状态                   $    $        $    $  ANS002.BYTE005  $  if(((x1>>0)&1)) y=@00a0;else y=@004a;
  $  032.座椅个性化设置（记忆被钥匙调取）       $    $        $    $  ANS002.BYTE007  $  switxh((x1>>6)&0x03) 0x00: y=@0011; 0x01: y=@00a1; 0x02: y=@00a2; 0x03: y=@00a1;
  $  033.座椅个性化设置（座椅迎宾功能）         $    $        $    $  ANS002.BYTE007  $  if(((x1>>5)&1)) y=@00e1;else y=@002b;
  $  034.霍尔传感器的电压值                     $    $  V     $    $  ANS003.BYTE004  $  y = SPRINTF([%.1f], x1*0.0784);
  $  035.倒车档左后视镜上下位置计数             $    $        $    $  ANS004.BYTE026  $  y = SPRINTF([%d], (x1*256+x2));
  $  036.倒车档右后视镜上下位置计数             $    $        $    $  ANS004.BYTE024  $  y = SPRINTF([%d], (x1*256+x2));
  $  037.倒车档左后视镜左右位置计数             $    $        $    $  ANS004.BYTE022  $  y = SPRINTF([%d], (x1*256+x2));
  $  038.倒车档右后视镜左右位置计数             $    $        $    $  ANS004.BYTE020  $  y = SPRINTF([%d], (x1*256+x2));
  $  039.左后视镜上下位置计数                   $    $        $    $  ANS004.BYTE018  $  y = SPRINTF([%d], (x1*256+x2));
  $  040.右后视镜上下位置计数                   $    $        $    $  ANS004.BYTE016  $  y = SPRINTF([%d], (x1*256+x2));
  $  041.左后视镜左右位置计数                   $    $        $    $  ANS004.BYTE014  $  y = SPRINTF([%d], (x1*256+x2));
  $  042.右后视镜左右位置计数                   $    $        $    $  ANS004.BYTE012  $  y = SPRINTF([%d], (x1*256+x2));
  $  043.座椅前部上下位置计数                   $    $        $    $  ANS004.BYTE010  $  y = SPRINTF([%d], (x1*256+x2));
  $  044.座椅后部上下位置计数                   $    $        $    $  ANS004.BYTE008  $  y = SPRINTF([%d], (x1*256+x2));
  $  045.靠背前后位置计数                       $    $        $    $  ANS004.BYTE006  $  y = SPRINTF([%d], (x1*256+x2));
  $  046.滑道前后位置计数                       $    $        $    $  ANS004.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  047.倒车档左后视镜上下位置计数             $    $        $    $  ANS005.BYTE026  $  y = SPRINTF([%d], (x1*256+x2));
  $  048.倒车档右后视镜上下位置计数             $    $        $    $  ANS005.BYTE024  $  y = SPRINTF([%d], (x1*256+x2));
  $  049.倒车档左后视镜左右位置计数             $    $        $    $  ANS005.BYTE022  $  y = SPRINTF([%d], (x1*256+x2));
  $  050.倒车档右后视镜左右位置计数             $    $        $    $  ANS005.BYTE020  $  y = SPRINTF([%d], (x1*256+x2));
  $  051.左后视镜上下位置计数                   $    $        $    $  ANS005.BYTE018  $  y = SPRINTF([%d], (x1*256+x2));
  $  052.右后视镜上下位置计数                   $    $        $    $  ANS005.BYTE016  $  y = SPRINTF([%d], (x1*256+x2));
  $  053.左后视镜左右位置计数                   $    $        $    $  ANS005.BYTE014  $  y = SPRINTF([%d], (x1*256+x2));
  $  054.右后视镜左右位置计数                   $    $        $    $  ANS005.BYTE012  $  y = SPRINTF([%d], (x1*256+x2));
  $  055.座椅前部上下位置计数                   $    $        $    $  ANS005.BYTE010  $  y = SPRINTF([%d], (x1*256+x2));
  $  056.座椅后部上下位置计数                   $    $        $    $  ANS005.BYTE008  $  y = SPRINTF([%d], (x1*256+x2));
  $  057.靠背前后位置计数                       $    $        $    $  ANS005.BYTE006  $  y = SPRINTF([%d], (x1*256+x2));
  $  058.滑道前后位置计数                       $    $        $    $  ANS005.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  059.倒车档左后视镜上下位置计数             $    $        $    $  ANS006.BYTE026  $  y = SPRINTF([%d], (x1*256+x2));
  $  060.倒车档右后视镜上下位置计数             $    $        $    $  ANS006.BYTE024  $  y = SPRINTF([%d], (x1*256+x2));
  $  061.倒车档左后视镜左右位置计数             $    $        $    $  ANS006.BYTE022  $  y = SPRINTF([%d], (x1*256+x2));
  $  062.倒车档右后视镜左右位置计数             $    $        $    $  ANS006.BYTE020  $  y = SPRINTF([%d], (x1*256+x2));
  $  063.左后视镜上下位置计数                   $    $        $    $  ANS006.BYTE018  $  y = SPRINTF([%d], (x1*256+x2));
  $  064.右后视镜上下位置计数                   $    $        $    $  ANS006.BYTE016  $  y = SPRINTF([%d], (x1*256+x2));
  $  065.左后视镜左右位置计数                   $    $        $    $  ANS006.BYTE014  $  y = SPRINTF([%d], (x1*256+x2));
  $  066.右后视镜左右位置计数                   $    $        $    $  ANS006.BYTE012  $  y = SPRINTF([%d], (x1*256+x2));
  $  067.座椅前部上下位置计数                   $    $        $    $  ANS006.BYTE010  $  y = SPRINTF([%d], (x1*256+x2));
  $  068.座椅后部上下位置计数                   $    $        $    $  ANS006.BYTE008  $  y = SPRINTF([%d], (x1*256+x2));
  $  069.靠背前后位置计数                       $    $        $    $  ANS006.BYTE006  $  y = SPRINTF([%d], (x1*256+x2));
  $  070.滑道前后位置计数                       $    $        $    $  ANS006.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  071.倒车档左后视镜上下位置计数             $    $        $    $  ANS007.BYTE026  $  y = SPRINTF([%d], (x1*256+x2));
  $  072.倒车档右后视镜上下位置计数             $    $        $    $  ANS007.BYTE024  $  y = SPRINTF([%d], (x1*256+x2));
  $  073.倒车档左后视镜左右位置计数             $    $        $    $  ANS007.BYTE022  $  y = SPRINTF([%d], (x1*256+x2));
  $  074.倒车档右后视镜左右位置计数             $    $        $    $  ANS007.BYTE020  $  y = SPRINTF([%d], (x1*256+x2));
  $  075.左后视镜上下位置计数                   $    $        $    $  ANS007.BYTE018  $  y = SPRINTF([%d], (x1*256+x2));
  $  076.右后视镜上下位置计数                   $    $        $    $  ANS007.BYTE016  $  y = SPRINTF([%d], (x1*256+x2));
  $  077.左后视镜左右位置计数                   $    $        $    $  ANS007.BYTE014  $  y = SPRINTF([%d], (x1*256+x2));
  $  078.右后视镜左右位置计数                   $    $        $    $  ANS007.BYTE012  $  y = SPRINTF([%d], (x1*256+x2));
  $  079.座椅前部上下位置计数                   $    $        $    $  ANS007.BYTE010  $  y = SPRINTF([%d], (x1*256+x2));
  $  080.座椅后部上下位置计数                   $    $        $    $  ANS007.BYTE008  $  y = SPRINTF([%d], (x1*256+x2));
  $  081.靠背前后位置计数                       $    $        $    $  ANS007.BYTE006  $  y = SPRINTF([%d], (x1*256+x2));
  $  082.滑道前后位置计数                       $    $        $    $  ANS007.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  083.倒车档左后视镜上下位置计数             $    $        $    $  ANS008.BYTE026  $  y = SPRINTF([%d], (x1*256+x2));
  $  084.倒车档右后视镜上下位置计数             $    $        $    $  ANS008.BYTE024  $  y = SPRINTF([%d], (x1*256+x2));
  $  085.倒车档左后视镜左右位置计数             $    $        $    $  ANS008.BYTE022  $  y = SPRINTF([%d], (x1*256+x2));
  $  086.倒车档右后视镜左右位置计数             $    $        $    $  ANS008.BYTE020  $  y = SPRINTF([%d], (x1*256+x2));
  $  087.左后视镜上下位置计数                   $    $        $    $  ANS008.BYTE018  $  y = SPRINTF([%d], (x1*256+x2));
  $  088.右后视镜上下位置计数                   $    $        $    $  ANS008.BYTE016  $  y = SPRINTF([%d], (x1*256+x2));
  $  089.左后视镜左右位置计数                   $    $        $    $  ANS008.BYTE014  $  y = SPRINTF([%d], (x1*256+x2));
  $  090.右后视镜左右位置计数                   $    $        $    $  ANS008.BYTE012  $  y = SPRINTF([%d], (x1*256+x2));
  $  091.座椅前部上下位置计数                   $    $        $    $  ANS008.BYTE010  $  y = SPRINTF([%d], (x1*256+x2));
  $  092.座椅后部上下位置计数                   $    $        $    $  ANS008.BYTE008  $  y = SPRINTF([%d], (x1*256+x2));
  $  093.靠背前后位置计数                       $    $        $    $  ANS008.BYTE006  $  y = SPRINTF([%d], (x1*256+x2));
  $  094.滑道前后位置计数                       $    $        $    $  ANS008.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  095.车速                                   $    $        $    $  ANS009.BYTE005  $  y = SPRINTF([%.1f], (x1*256+x2)*0.015625);
  $  096.门开状态                               $    $        $    $  ANS009.BYTE004  $  switxh((x1>>6)&0x03) 0x00: y=@0095; 0x01: y=@0096; 0x02: y=@0097; 0x03: y=@0098;
  $  097.钥匙号检测                             $    $        $    $  ANS009.BYTE004  $  switxh((x1>>3)&0x07) 0x00: y=@0099; 0x01: y=@009a; 0x02: y=@009b; 0x03: y=@009c; 0x04: y=@009d; 0x05: y=@009e; 0x06: y=@009f; 0x07: y=@0047;
  $  098.车锁状态                               $    $        $    $  ANS009.BYTE004  $  switxh(x1&0x07) 0x00: y=@008f; 0x01: y=@0090; 0x02: y=@0091; 0x03: y=@0092; 0x04: y=@0093; 0x05: y=@001e; 0x06: y=@001e; 0x07: y=@0094;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:705 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
