a20867     $*     P0867 完全空档状态（D档范围无控制压力）D档无驱动力
a20868     $*     P0868 正常/非正常转换最小压力故障
a20813     $*     P0813 倒车灯对地短路/开路
a20962     $*     P0962 线性电磁阀(SLT)对地短路/开路
a20963     $*     P0963 线性电磁阀(SLT) B+短路
a20965     $*     P0965 空档状态（在D档范围）值卡住(SLC1 卡住)
a20966     $*     P0966 线性电磁阀(SLC1)对地短路/开路
a20967     $*     P0967 线性电磁阀(SLC1) B+ 短路
a20970     $*     P0970 线性电磁阀(SLC2)对地短路/开路
a20971     $*     P0971 线性电磁阀(SLC2) B+ 短路
a20973     $*     P0973 S1 电磁阀接地短路
a20974     $*     P0974 S1 电磁阀 B+短路/开路
a20976     $*     P0976 S2 电磁阀 B+ 接地短路
a20977     $*     P0977 S2 电磁阀 B+短路/开路 接地短路
a20601     $*     P0601 快闪存储器内部检查总数
a20603     $*     P0603 非易失性存储器读/写错误
a20604     $*     P0604 随机存取存储器读/写错误
a20797     $*     P0797 正常/非正常转换 SLC2最大压力
a20798     $*     P0798 线性反馈当前卡住(SLC2)
a20777     $*     P0777 正常/非正常转换 SLC1最大压力
a20778     $*     P0778 线性反馈当前卡住(SLC1)
a20741     $*     P0741 锁定关闭控制 卡住(SLU 关闭 卡住)
a20742     $*     P0742 锁定关闭控制 卡住(SLU 打开 卡住)
a20748     $*     P0748 线性反馈当前卡住(SLT)
a20720     $*     P0720 旋转传感器输出电气故障
a20722     $*     P0722 旋转传感器输出无脉冲
a20729     $*     P0729 齿轮比-第六齿轮
a20731     $*     P0731 齿轮比-第一齿轮
a20732     $*     P0732 齿轮比-第二齿轮
a20733     $*     P0733 齿轮比-第三齿轮
a20734     $*     P0734 齿轮比-第四齿轮
a20735     $*     P0735 齿轮比-第五齿轮
a20702     $*     P0702 线性电磁阀驱动器故障
a20705     $*     P0705 选择器位置开关电气故障
a20707     $*     P0707 选择器位置开关无信号（对地短路）
a20708     $*     P0708 选择器位置开关停止运行(B+ 短路)
a20711     $*     P0711 机油温度传感器卡住
a20712     $*     P0712 机油温度传感器对地短路
a20713     $*     P0713 机油温度传感器 B+短路/开路
a20715     $*     P0715 旋转传感器输入电气故障
a20717     $*     P0717 旋转传感器输入无脉冲
a20562     $*     P0562 电池电压低
a20563     $*     P0563 电池电压高
a21100     $*     P1100 齿轮比-第一齿轮与发动机制动
a21101     $*     P1101 齿轮比-第一齿轮与发动机制动 卡在第四齿轮
a21102     $*     P1102 齿轮比-第一齿轮与发动机制动 卡在第二第三齿轮
a21103     $*     P1103 齿轮比-第二齿轮卡滞
a21104     $*     P1104 齿轮比-第三齿轮卡滞
a21105     $*     P1105 齿轮比-第四齿轮卡滞
a21106     $*     P1106 齿轮比-第五齿轮卡滞
a21107     $*     P1107 齿轮比-第六齿轮卡滞
a22806     $*     P2806 空档位置学习未执行
a22763     $*     P2763 线性电磁阀(SLU) B+短路
a22764     $*     P2764 线性电磁阀(SLU) 对地短路/开路
a22759     $*     P2759 线性反馈当前卡住(SLU)
a22720     $*     P2720 线性电磁阀(SLC3)对地短路/开路
a22721     $*     P2721 线性电磁阀(SLC3) B+ 短路
a22724     $*     P2724 正常/非正常转换 SLB1最大压力
a22725     $*     P2725 线性反馈当前卡住(SLB1)
a22729     $*     P2729 线性电磁阀(SLB1) 对地短路/开路
a22730     $*     P2730 线性电磁阀(SLB1) B+短路
a22715     $*     P2715 正常/非正常转换 SLC3最大压力
a22716     $*     P2716 线性反馈当前卡住(SLC3)
a22719     $*     P2719 空档状态（在R档范围）值卡住(SLC3 卡住)
a2c037     $*     U0037 CAN总线关闭 计数器超限运转
a2c140     $*     U0140 与车身控制模块失去通讯
a2c122     $*     U0122 与电子稳定系统失去通讯
a2c100     $*     U0100 与EMS 失去通讯
920261     $*     P0261 1缸喷油器对地短路
920262     $*     P0262 1缸喷油器对电源短路
920264     $*     P0264 2缸喷油器对地短路
920265     $*     P0265 2缸喷油器对电源短路
920267     $*     P0267 3缸喷油器对地短路
920268     $*     P0268 3缸喷油器对电源短路
920270     $*     P0270 4缸喷油器对地短路
920271     $*     P0271 4缸喷油器对电源短路
920201     $*     P0201 1缸喷油器开路
920202     $*     P0202 2缸喷油器开路
920203     $*     P0203 3缸喷油器开路
920204     $*     P0204 4缸喷油器开路
920373     $*     P0373 曲轴齿不合理信号
920340     $*     P0340 进气凸轮轴位置同步信号不合理
920341     $*     P0341 进气凸轮轴位置相对曲轴同步信号不合理
920351     $*     P0351 1、4缸点火线圈开路
920353     $*     P0353 3、2缸点火线圈开路
920325     $*     P0325 爆震传感器故障
920335     $*     P0335 曲轴传感器电气故障
920336     $*     P0336 曲轴传感器信号不合理
920300     $*     P0300 多次失火
920301     $*     P0301 失火0(1 缸)
920302     $*     P0302 失火3(2 缸)
920303     $*     P0303 失火1(3 缸)
920304     $*     P0304 失火2(4 缸)
920315     $*     P0315 飞轮自适应周期时间处于极限
920318     $*     P0318 在坏路上检测出有失火
920075     $*     P0075 可变气门控制电磁阀开路故障
920076     $*     P0076 可变气门控制电磁阀对地短路故障
920077     $*     P0077 可变气门控制电磁阀对电源短路故障
920031     $*     P0031 上游氧传感器加热器控制电路开路或对地短路
920032     $*     P0032 上游氧传感器加热器控制电路对电源短路
920037     $*     P0037 下游氧传感器加热器控制电路开路或对地短路
920038     $*     P0038 下游氧传感器加热器控制电路对电源短路
920011     $*     P0011 在稳定工况下凸轮轴位置偏移
920016     $*     P0016 曲轴位置和进气凸轮轴位置相关性不合理
920171     $*     P0171 燃油系统诊断过稀
920172     $*     P0172 燃油系统诊断过浓
920141     $*     P0141 下游氧传感器加热器故障
920122     $*     P0122 节气门位置传感器1电压过低
920123     $*     P0123 节气门位置传感器1电压过高
920130     $*     P0130 上游氧传感器电路开路
920131     $*     P0131 上游氧传感器电路对地短路
920132     $*     P0132 上游氧传感器电路对电源短路
920133     $*     P0133 上游氧传感器转换时间响应慢
920134     $*     P0134 上游氧传感器准备超时
920135     $*     P0135 上游氧传感器电路开路
920136     $*     P0136 下游氧传感器电路开路
920137     $*     P0137 下游氧传感器电路对地短路
920138     $*     P0138 下游氧传感器电路对电源短路
920106     $*     P0106 环境压力失真
920107     $*     P0107 进气岐管压力传感器电路对地短路
920108     $*     P0108 进气岐管压力传感器电路对电源短路
920112     $*     P0112 进气温度传感器电路对地短路
920113     $*     P0113 进气温度传感器电路对电源短路或开路
920117     $*     P0117 发动机冷却液温度传感器对地短路
920118     $*     P0118 发动机冷却液温度传感器对电源短路或线路开路
920119     $*     P0119 发动机冷却液温度传感器信号梯度故障
920685     $*     P0685 主继电器电路开路
920686     $*     P0686 主继电器电路对地短路
920687     $*     P0687 主继电器电路对电源短路
920691     $*     P0691 冷却风扇继电器1线路开路或对地短路
920692     $*     P0692 冷却风扇继电器1线路对电源短路
920693     $*     P0693 冷却风扇继电器2线路开路或对地短路
920694     $*     P0694 冷却风扇继电器2线路对电源短路
920642     $*     P0642 传感器电源电压1电路电压低
920643     $*     P0643 传感器电源电压1电路电压高
920645     $*     P0645 空调压缩机继电器线路开路
920646     $*     P0646 空调压缩机继电器线路对地短路
920647     $*     P0647 空调压缩机继电器线路对电源短路
920652     $*     P0652 传感器电源电压2电路电压低
920653     $*     P0653 传感器电源电压2电路电压高
920627     $*     P0627 油泵继电器线路开路
920628     $*     P0628 油泵继电器线路对地短路
920629     $*     P0629 油泵继电器线路对电源短路
920600     $*     P0600 SPI总线通信诊断
920487     $*     P0487 EGR阀执行器电路开路
920489     $*     P0489 EGR阀执行器电路对地短路
920490     $*     P0490 EGR阀执行器电路对电源短路
920444     $*     P0444 碳罐控制阀电路开路
920458     $*     P0458 碳罐控制阀电路对地短路
920459     $*     P0459 碳罐控制阀电路对电源短路
920420     $*     P0420 催化剂转化效率过低
920405     $*     P0405 EGR阀位置传感器电压低
920406     $*     P0406 EGR阀位置传感器电压高
920562     $*     P0562 电源电压过低
920563     $*     P0563 电源电压过高
920537     $*     P0537 空调蒸发温度传感器接地短路
920538     $*     P0538 空调蒸发温度传感器对电源短路或线路断路
920500     $*     P0500 车速传感器信号不合理
920505     $*     P0505 怠速调节器SPI通讯
920506     $*     P0506 发动机怠速转速低于预期
920507     $*     P0507 发动机怠速转速超出预期
920508     $*     P0508 怠速调节器开路
920509     $*     P0509 怠速调节器短路/温度过高
922300     $*     P2300 1、4缸点火线圈对地短路
922301     $*     P2301 1、4缸点火线圈对电源短路
922306     $*     P2306 3、2缸点火线圈对地短路
922307     $*     P2307 3、2缸点火线圈对电源短路
910261     $*     P0261 一缸喷油器控制电路对地短路
910262     $*     P0262 一缸喷油器控制电路对电源短路
910264     $*     P0264 二缸喷油器控制电路对地短路
910265     $*     P0265 二缸喷油器控制电路对电源短路
910267     $*     P0267 三缸喷油器控制电路对地短路
910268     $*     P0268 三缸喷油器控制电路对电源短路
910270     $*     P0270 四缸喷油器控制电路对地短路
910271     $*     P0271 四缸喷油器控制电路对电源短路
910201     $*     P0201 一缸喷油器控制电路开路
910202     $*     P0202 二缸喷油器控制电路开路
910203     $*     P0203 三缸喷油器控制电路开路
910204     $*     P0204 四缸喷油器控制电路开路
910340     $*     P0340 相位传感器安装位置不当
910341     $*     P0341 相位传感器信号不合理
910342     $*     P0342 相位传感器信号电路对地短路
910343     $*     P0343 相位传感器信号电路对电源短路
910321     $*     P0321 曲轴上止点齿缺信号不合理
910322     $*     P0322 转速传感器信号故障
910327     $*     P0327 爆震传感器信号电路电压过低
910328     $*     P0328 爆震传感器信号电路电压过高
910300     $*     P0300 多缸发生失火
910301     $*     P0301 一缸发生失火
910302     $*     P0302 二缸发生失火
910303     $*     P0303 三缸发生失火
910304     $*     P0304 四缸发生失火
910053     $*     P0053 上游氧传感器加热内阻不合理
910054     $*     P0054 下游氧传感器加热内阻不合理
910030     $*     P0030 上游氧传感器加热控制电路故障
910031     $*     P0031 上游氧传感器加热控制电路电压过低
910032     $*     P0032 上游氧传感器加热控制电路电压过高
910036     $*     P0036 下游氧传感器加热控制电路故障
910037     $*     P0037 下游氧传感器加热控制电路电压过低
910038     $*     P0038 下游氧传感器加热控制电路电压过高
910170     $*     P0170 下线检测空然比闭环控制自学习不合理
910171     $*     P0171 下线检测空然比闭环控制自学习过稀
910172     $*     P0172 下线检测空然比闭环控制自学习过浓
910140     $*     P0140 下游氧传感器电路信号故障
910122     $*     P0122 节气门位置传感器电路电压超低限值
910123     $*     P0123 节气门位置传感器电路电压超高限值
910130     $*     P0130 上游氧传感器信号不合理
910131     $*     P0131 上游氧传感器信号低电压
910132     $*     P0132 上游氧传感器信号电路电压过高
910133     $*     P0133 上游氧传感器老化
910134     $*     P0134 上游氧传感器电路信号电路故障
910136     $*     P0136 下游氧传感器信号不合理
910137     $*     P0137 下游氧传感器信号低电压
910138     $*     P0138 下游氧传感器信号电路电压过高
910105     $*     P0105 进气压力传感器信号无波动（结冰）
910106     $*     P0106 进气压力传感器/大气压力传感器不合理
910107     $*     P0107 进气压力传感器对地短路
910108     $*     P0108 进气压力传感器对电源短路
910112     $*     P0112 进气温度传感器信号电路电压过低
910113     $*     P0113 进气温度传感器信号电路电压过高
910117     $*     P0117 发动机冷却液温度传感器电路电压过低
910118     $*     P0118 发动机冷却液温度传感器电路电压过高
910691     $*     P0691 冷却风扇继电器控制电路电压过低（低速）
910692     $*     P0692 冷却风扇继电器控制电路电压过高（低速）
910694     $*     P0694 冷却风扇继电器控制电路电压过高（高速）
910645     $*     P0645 A/C压缩机继电器控制电路开路
910646     $*     P0646 A/C压缩机继电器控制电路电压过低
910647     $*     P0647 A/C压缩机继电器控制电路电压过高
910650     $*     P0650 MIL灯驱动级电路故障
910627     $*     P0627 油泵继电器控制电路开路
910628     $*     P0628 油泵继电器控制电路电压过低
910629     $*     P0629 油泵继电器控制电路电压过高
910602     $*     P0602 电子控制单元编码故障
910480     $*     P0480 冷却风扇继电器控制电路开路（低速）
910481     $*     P0481 冷却风扇继电器控制电路开路（高速）
910444     $*     P0444 碳罐控制阀控制电路开路
910458     $*     P0458 碳罐控制阀控制电路电压过低
910459     $*     P0459 碳罐控制阀控制电路电压过高
910420     $*     P0420 三元催化器储氧能力老化（排放超限）
910560     $*     P0560 系统蓄电池电压信号不合理
910562     $*     P0562 系统蓄电池电压过低
910563     $*     P0563 系统蓄电池电压过高
910537     $*     P0537 空调蒸发器温度传感器电路电压过低
910538     $*     P0538 空调蒸发器温度传感器电路电压过高
910501     $*     P0501 车速传感器信号故障
910506     $*     P0506 怠速控制转速低于目标怠速
910507     $*     P0507 怠速控制转速高于目标怠速
910508     $*     P0508 步进电机驱动引脚对地短路
910509     $*     P0509 步进电机驱动引脚对电源短路
910511     $*     P0511 步进电机驱动控制电路故障
912270     $*     P2270 下游氧传感器老化
912271     $*     P2271 下游氧传感器老化
912187     $*     P2187 空然比闭环控制自学习值超上限（低负荷区）
912188     $*     P2188 空然比闭环控制自学习值超下限（低负荷区）
912195     $*     P2195 上游氧传感器老化
912196     $*     P2196 上游氧传感器老化
912177     $*     P2177 空然比闭环控制自学习值超上限（中负荷区）
912178     $*     P2178 空然比闭环控制自学习值超下限（中负荷区）
468080     $*     B0080 驾驶员侧外围加速度传感器有缺陷或信号可靠性故障
468081     $*     B0081 乘员侧外围加速度传感器连接错误或初始化故障
468082     $*     B0082 乘员侧外围加速度传感器有缺陷或信号可靠性故障
468060     $*     B0060 乘员安全带预紧器对电源短路
468064     $*     B0064 驾驶员安全带预紧器阻值过低
468065     $*     B0065 驾驶员安全带预紧器开路（阻值过大）
468066     $*     B0066 驾驶员安全带预紧器对地短路或交叉连接
468067     $*     B0067 驾驶员安全带预紧器对电源短路
468077     $*     B0077 驾驶员侧外围加速度传感器性能故障或交叉连接
468078     $*     B0078 乘员侧外围加速度传感器性能故障或交叉连接
468079     $*     B0079 驾驶员侧外围加速度传感器不正确或初始化故障
468040     $*     B0040 驾驶员侧气囊阻值过低
468041     $*     B0041 驾驶员侧气囊开路（阻值过大）
468045     $*     B0045 驾驶员侧气囊对地短路或交叉连接
468046     $*     B0046 驾驶员侧气囊对电源短路
468048     $*     B0048 碰撞输出对地短路或开路
468049     $*     B0049 碰撞输出对电源短路
468051     $*     B0051 前气囊和前安全带预紧器已引爆
468052     $*     B0052 安全气囊控制器达到最大使用限度并无法继续使用
468057     $*     B0057 乘员安全带预紧器阻值过低
468058     $*     B0058 乘员安全带预紧器开路（阻值过大）
468059     $*     B0059 乘员安全带预紧器对地短路或交叉连接
468022     $*     B0022 驾驶员安全气囊阻值过低
468024     $*     B0024 驾驶员安全气囊对地短路或交叉连接
468025     $*     B0025 驾驶员安全气囊对电源短路
468026     $*     B0026 驾驶员安全气囊开路（阻值过大）
468028     $*     B0028 乘员侧气囊阻值过低
468029     $*     B0029 乘员侧气囊开路（阻值过大）
468030     $*     B0030 乘员侧气囊对地短路或交叉连接
468032     $*     B0032 乘员侧气囊对电源短路
468034     $*     B0034 侧气囊已引爆
468016     $*     B0016 乘员安全气囊阻值过低
468017     $*     B0017 乘员安全气囊开路（阻值过大）
468018     $*     B0018 乘员安全气囊对地短路或交叉连接
468019     $*     B0019 乘员安全气囊对电源短路
468671     $*     B0671 系统故障灯对地短路或开路
468673     $*     B0673 系统故障灯对电源短路
469327     $*     B1327 电源电压过低
469328     $*     B1328 电源电压过高
469022     $*     B1022 驾驶员气帘开路（阻值过大）
469023     $*     B1023 驾驶员气帘阻值过低
469024     $*     B1024 驾驶员气帘对地短路或交叉连接
469025     $*     B1025 驾驶员气帘对电源短路
469027     $*     B1027 乘员气帘开路（阻值过大）
469028     $*     B1028 乘员气帘阻值过低
469029     $*     B1029 乘员气帘对地短路或交叉连接
46902a     $*     B102A 乘员气帘对电源短路
469000     $*     B1000 ECU内部故障
469001     $*     B1001 配置错误 (没有配置，但是安装)
45904a     $*     B104A 左转向灯开路
45904b     $*     B104B 右转向灯故障
45904c     $*     B104C 报警灯输入开关短路
459121     $*     B1121 驾驶员侧窗输出触点卡滞故障
459122     $*     B1122 右前窗输出输出触点卡滞故障
459123     $*     B1123 左后窗输出输出触点卡滞故障
459124     $*     B1124 右后窗输出输出触点卡滞故障
459101     $*     B1101 前雨刮慢档输出与地短路或断路
459103     $*     B1103 前雨刮快档输出与地短路或断路
459105     $*     B1105 无法检测到前雨刮复位停止信号
459701     $*     B1701 防盗天线故障
459702     $*     B1702 车身控制单元检测不到有效钥匙
459705     $*     B1705 车身控制单元与防盗基站通信中断
459706     $*     B1706 发动机控制单元无效请求致使车身控制单元处于保护状态
459707     $*     B1707 没有检测到发动机控制单元的防盗请求
45c001     $*     U0001 高速CAN总线Bus Off
45c155     $*     U0155 组合仪表控制单元网络节点丢失
45c121     $*     U0121 ABS控制单元网络 节点丢失
45c100     $*     U0100 发动机控制单元网络节点丢失
45d001     $*     U1001 高速CAN初始化错误
45d600     $*     U1600 EEPROM(电可擦除只读存储器)通讯错误
45d601     $*     U1601 EEPROM(电可擦除只读存储器) 校验码错误
45d562     $*     U1562 过压故障
45d563     $*     U1563 欠压故障
45d501     $*     U1501 组合仪表冗余数据出错
520882     $*     P0882 电池或高端电压太低
520883     $*     P0883 电池或高端电压太高
520868     $*     P0868 压力预紧调节故障
520840     $*     P0840 从动锥轮压力传感器
52080a     $*     P080A 下线离合器自适应未完成
520811     $*     P0811 离合器（前进或后退）打滑
520960     $*     P0960 主动锥轮压力调节器断路
520962     $*     P0962 EDS1主动锥轮压力调节器接地
520963     $*     P0963 主动锥轮压力调节器短路
520964     $*     P0964 从动锥轮压力调节器断路
520966     $*     P0966 从动锥轮压力调节器接地
520967     $*     P0967 从动锥轮压力调节器短路
520944     $*     P0944 夹紧力不足(VSM)
520955     $*     P0955 手动加减档信号故障
520930     $*     P0930 起动锁接地
520931     $*     P0931 起动锁短路或断路
520900     $*     P0900 离合器压力调节器断路
520902     $*     P0902 离合器压力调节器接地
520903     $*     P0903 离合器压力调节器短路
520218     $*     P0218 变速箱油温太高
520219     $*     P0219 动力系统超过转速范围
520301     $*     U0301 车辆配置错误
520641     $*     P0641 压力传感器电源故障
520651     $*     P0651 驾驶模式传感器和速度传感器电源故障
520658     $*     P0658 压力调节器断路或接地
520659     $*     P0659 压力调节器短路
520602     $*     P0602 ROM内部编码校验和
520603     $*     P0603 EEPROM(电可擦除只读存储器)故障(校验和)
520604     $*     P0604 RAM内部数据检查故障
520605     $*     P0605 ROM内部数据校验和
520720     $*     P0720 从动锥轮转速传感器故障
520721     $*     P0721 从动锥轮转速与真实转速不符
520727     $*     P0727 从ECU到TCU(变速箱控制器)的硬线发动机转速信号传递与真实转速不符
520730     $*     P0730 传动比控制故障
520701     $*     P0701 两个故同时出现要求压力调节器断电TCU(变速箱控制器)采取措施
520702     $*     P0702 TCU(变速箱控制器)内部检测系统故障（点火期间）
520705     $*     P0705 驾驶模式传感器多线错误
520706     $*     P0706 驾驶模式传感器单线错误
520710     $*     P0710 油温传感器故障
520571     $*     P0571 刹车信号错误
521761     $*     P1761 压力调节器电流故障
521762     $*     P1762 电流值被固定，不能改变
521763     $*     P1763 起动锁接地或断路
521764     $*     P1764 起动锁短路
521765     $*     P1765 从动锥轮压力太低
521766     $*     P1766 从动锥轮压力太高
521767     $*     P1767 变速箱油温超出范围
521768     $*     P1768 倒车灯接地
521769     $*     P1769 倒车灯短路或断路
521770     $*     P1770 发动机转速过低
521773     $*     P1773 冬季模式信号错误
521774     $*     P1774 下线离合器自适应学习错误
521775     $*     P1775 无效或无XCU生产数据
521776     $*     P1776 主板故障-内部硬件问题
521777     $*     P1777 巡航错误
522787     $*     P2787 离合器温度太高
522765     $*     P2765 主动锥轮转速传感器故障
522766     $*     P2766 主动锥轮转速与真实转速不符
52c001     $*     U0001 CAN总线故障
52c121     $*     U0121 CAN总线上ABS通讯故障
52c100     $*     U0100 ECUCAN通讯故障
52c415     $*     U0415 ABS功能错误
52d012     $*     U1012 CAN总线上发动机转速信号错误
52d013     $*     U1013 CAN总线上加速踏板信号错误
52d014     $*     U1014 CAN总线上发动机扭矩信号错误
52d016     $*     U1016 CAN总线上左前轮速（信号）错误
52d017     $*     U1017 CAN总线上右前轮速（信号）错误
52d018     $*     U1018 CAN总线上左后轮速（信号）错误
52d019     $*     U1019 CAN总线上右后轮速（信号）错误
3f0882     $*     P0882 电池或高端电压太低
3f0883     $*     P0883 电瓶或高压侧电压太高
3f0868     $*     P0868 压力预紧调节故障
3f0840     $*     P0840 从动锥轮压力传感器
3f080a     $*     P080A 下线离合器自适应未完成
3f0810     $*     P0810 下线自适应更新未完成
3f0811     $*     P0811 离合器(前进或后退)打滑
3f0960     $*     P0960 EDS1主动锥轮压力调节器断路
3f0962     $*     P0962 EDS1主动锥轮压力调节器接地
3f0963     $*     P0963 EDS1主动锥轮压力调节器短路
3f0964     $*     P0964 EDS2从动锥轮压力调节器断路
3f0966     $*     P0966 EDS2从动锥轮压力调节器接地
3f0967     $*     P0967 EDS2从动锥轮压力调节器短路
3f0944     $*     P0944 夹紧力不足 (VSM)
3f0955     $*     P0955 手动加减档信号故障
3f0930     $*     P0930 换档锁接地
3f0931     $*     P0931 换档锁接地或者开路
3f0900     $*     P0900 EDS3离合器压力调节器断路
3f0902     $*     P0902 EDS3离合器压力调节器接地
3f0903     $*     P0903 EDS3离合器压力调节器短路
3f0218     $*     P0218 变速箱油温太高
3f0219     $*     P0219 动力总成速度超限
3f0641     $*     P0641 压力传感器电源故障
3f0651     $*     P0651 驾驶模式传感器和速度传感器电源故障
3f0658     $*     P0658 压力调节器断路或接地
3f0659     $*     P0659 压力调节器短路
3f0602     $*     P0602 ROM内部编码校验和
3f0603     $*     P0603 EEPROM(电可擦除只读存储器)故障(校验和)
3f0604     $*     P0604 RAM内部数据检查故障
3f0605     $*     P0605 ROM内部数据校验和
3f0782     $*     P0782 冬季驾驶模式故障
3f0783     $*     P0783 巡航控制故障
3f0720     $*     P0720 从动锥轮转速传感器故障
3f0721     $*     P0721 从动锥轮转速与真实转速不符
3f0727     $*     P0727 从 ECU 到 TCU(变速箱控制器) 的硬线发动机转速信号传递与真实转速不符
3f0730     $*     P0730 传动比控制故障
3f0701     $*     P0701 两个故障同时出现要求压力调节器断电 TCU(变速箱控制器) 采取措施
3f0702     $*     P0702 TCU(变速箱控制器)内部测统故障(点火期间)
3f0705     $*     P0705 前进模式传感器多线错误
3f0706     $*     P0706 驾驶模式传感器单线错误
3f0710     $*     P0710 油温传感器故障
3f0571     $*     P0571 制动信号故障
3f1761     $*     P1761 压力调节器电流故障
3f1762     $*     P1762 电流值被固定,不能改变
3f1763     $*     P1763 起动锁接地或断路
3f1764     $*     P1764 起动锁短路
3f1765     $*     P1765 从动锥轮压力太低 TCU(变速箱控制器) 采取措施
3f1766     $*     P1766 从动锥轮压力太高
3f1767     $*     P1767 变速箱油温超出范围
3f1768     $*     P1768 倒车灯接地
3f1769     $*     P1769 倒车灯短路或断路
3f1770     $*     P1770 发动机转速太低
3f1773     $*     P1773 冬季模式信号错误
3f1774     $*     P1774 下线(EOL)离合器自适应故障
3f1775     $*     P1775 变速器控制单元有无效生产数据
3f1776     $*     P1776 一般内部硬件故障
3f1777     $*     P1777 巡航控制支持故障
3f2787     $*     P2787 离合器温度太高
3f2765     $*     P2765 主动锥轮转速传感器故障
3f2766     $*     P2766 主动锥轮转速与真实转速不符
3fc301     $*     U0301 车辆配置错误(如用其它车上的ECU)
3fc001     $*     U0001 CAN 总线故障
3fc121     $*     U0121 ABS CAN通讯故障
3fc100     $*     U0100 ECU CAN通讯故障
3fc415     $*     U0415 防抱死制动系统功能故障
3fd012     $*     U1012 CAN总线上发动机转速信号错误
3fd013     $*     U1013 CAN总线上加速踏板信号错误
3fd014     $*     U1014 CAN总线上发动机扭矩信号错误
3fd016     $*     U1016 CAN轮速故障-左前
3fd017     $*     U1017 CAN轮速故障-右前
3fd018     $*     U1018 CAN轮速故障-左后
3fd019     $*     U1019 CAN轮速故障-右后
3e0882     $*     P0882 蓄电池或者高边电压太低
3e0883     $*     P0883 蓄电池或者高边电压太高
3e0868     $*     P0868 操作准备超时
3e0840     $*     P0840 第二压力传感器故障
3e080a     $*     P080A 离合器自适应未完成
3e0811     $*     P0811 离合器滑动（前向或换向）
3e0962     $*     P0962 EDS1(齿轮1） SCG
3e0966     $*     P0966 EDS2(齿轮2） SCG
3e0955     $*     P0955 提示模式信号错误
3e0902     $*     P0902 EDS3（离合器） SCG
3e0218     $*     P0218 机油温度高
3e0219     $*     P0219 动力传动系统速度超出范围
3e0641     $*     P0641 压力传感器供电故障
3e0651     $*     P0651 DMS和速度传感器供电故障
3e0658     $*     P0658 高边SCG或者OC
3e0659     $*     P0659 高边SCB
3e0602     $*     P0602 软件兼容性
3e0603     $*     P0603 EEPROM(电可擦除只读存储器)故障（校验和）
3e0604     $*     P0604 内部RAM数据检查失败
3e0605     $*     P0605 在ROM数据区中的校验和
3e0720     $*     P0720 齿轮2速度传感器故障
3e0721     $*     P0721 齿轮2速度不可信
3e0727     $*     P0727 硬线发动机速度不可信
3e0730     $*     P0730 比率控制故障
3e0701     $*     P0701 要求高边开的双故障
3e0702     $*     P0702 看门狗测试失败
3e0705     $*     P0705 驱动模式的传感器多线错误
3e0710     $*     P0710 机油温度传感器故障
3e0571     $*     P0571 制动信号故障
3e1762     $*     P1762 当前粘滞
3e1765     $*     P1765 齿轮2压力太低
3e1766     $*     P1766 齿轮2压力太高
3e1767     $*     P1767 临界油温度
3e1768     $*     P1768 背景灯SCG
3e1769     $*     P1769 背景灯SCG或者OC
3e1770     $*     P1770 发动机速度太低
3e1774     $*     P1774 离合器自适应错误
3e1775     $*     P1775 无效或者无XCU生产数据
3e1776     $*     P1776 电路板故障-内部硬件问题
3e2787     $*     P2787 离合器温度太高
3e2765     $*     P2765 齿轮1速度传感器故障
3e2766     $*     P2766 齿轮1速度不可信
3ec301     $*     U0301 车辆配置不匹配
3ec001     $*     U0001 CAN总线关闭
3ec121     $*     U0121 CAN线ABS通讯失败
3ec100     $*     U0100 CAN线ECU通讯失败
3ec415     $*     U0415 ABS故障错误
3ed012     $*     U1012 CAN线发动机速度信号错误
3ed013     $*     U1013 CAN线加速踏板信号错误
3ed014     $*     U1014 CAN线发动机扭矩信号错误
3ed016     $*     U1016 CAN线左前车轮速度故障
3ed017     $*     U1017 CAN线右前车轮速度故障
3ed018     $*     U1018 CAN线左后车轮速度故障
3ed019     $*     U1019 CAN线右后车轮速度故障
3d0831     $*     P0831 离合器开关线路信号常低(短接到电源或断路)
3d0832     $*     P0832 离合器开关线路信号常高(短接到地)
3d0261     $*     P0261 1缸喷嘴线路低电压故障
3d0262     $*     P0262 1缸喷嘴线路高电压故障
3d0264     $*     P0264 2缸喷嘴线路低电压故障
3d0265     $*     P0265 2缸喷嘴线路高电压故障
3d0267     $*     P0267 3缸喷嘴线路低电压故障
3d0268     $*     P0268 3缸喷嘴线路高电压故障
3d0270     $*     P0270 4缸喷嘴线路低电压故障
3d0271     $*     P0271 4缸喷嘴线路高电压故障
3d0222     $*     P0222 电子节气门位置传感器2#线路低电压
3d0223     $*     P0223 电子节气门位置传感器2#线路高电压
3d0230     $*     P0230 油泵继电器故障
3d0366     $*     P0366 排气VCP目标轮－CAM传感器故障
3d0340     $*     P0340 进气VCP凸轮轴位置传感器状态诊断
3d0341     $*     P0341 凸轮轴位置传感器线路合理性故障
3d0351     $*     P0351 1缸点火线圈故障
3d0352     $*     P0352 2缸点火线圈故障
3d0353     $*     P0353 3缸点火线圈故障
3d0354     $*     P0354 4缸点火线圈故障
3d0324     $*     P0324 爆震控制系统故障
3d0325     $*     P0325 爆震传感器故障
3d0335     $*     P0335 曲轴位置传感器线路无信号
3d0336     $*     P0336 曲轴位置传感器线路信号干扰
3d0300     $*     P0300 单缸或多缸失火
3d0080     $*     P0080 排气VCP液压控制阀线圈高电压
3d0068     $*     P0068 电子节气门空气流量错误
3d0076     $*     P0076 进气VCP液压控制阀线圈低电压或断路
3d0077     $*     P0077 进气VCP液压控制阀线圈高电压
3d0079     $*     P0079 排气VCP液压控制阀线圈低电压或断路
3d0026     $*     P0026 进气VCP液压控制阀钳住
3d0027     $*     P0027 排气VCP液压控制阀钳住
3d0031     $*     P0031 前氧传感器加热器短路到低电压
3d0032     $*     P0032 前氧传感器加热器短路到高电压
3d0037     $*     P0037 后氧传感器加热器短路到低电压
3d0038     $*     P0038 后氧传感器加热器短路到高电压
3d0011     $*     P0011 进气VCP相位响应滞后
3d0012     $*     P0012 进气VCP凸轮轴相位误差大
3d0014     $*     P0014 排气VCP相位响应滞后
3d0015     $*     P0015 排气VCP凸轮轴相位误差大
3d0016     $*     P0016 进气VCP凸轮齿学习偏差超出范围
3d0017     $*     P0017 排气VCP凸轮齿学习偏差超出范围
3d0171     $*     P0171 非怠速工况燃油系统过稀
3d0172     $*     P0172 非怠速工况燃油系统过浓
3d0140     $*     P0140 后氧传感器断路
3d0122     $*     P0122 电子节气门位置传感器1#线路低电压
3d0123     $*     P0123 电子节气门位置传感器1#线路高电压
3d0131     $*     P0131 前氧传感器短路到低电压
3d0132     $*     P0132 前氧传感器短路到高电压
3d0133     $*     P0133 前氧传感器响应过慢
3d0134     $*     P0134 前氧传感器断路
3d0137     $*     P0137 后氧传感器短路到低电压
3d0138     $*     P0138 后氧传感器短路到高电压
3d0105     $*     P0105 进气压力传感器信号钳住
3d0106     $*     P0106 进气压力/油门位置合理性故障
3d0107     $*     P0107 进气压力传感器线路低电压或断路
3d0108     $*     P0108 进气压力传感器线路高电压
3d0112     $*     P0112 进气温度传感器线路低电压
3d0113     $*     P0113 进气温度传感器线路高电压或断路
3d0117     $*     P0117 冷却液温度传感器线路低电压
3d0118     $*     P0118 冷却液温度传感器线路高电压或断路
3d0685     $*     P0685 主继电器故障
3d0660     $*     P0660 可变进气管容积电磁阀1电路输出故障
3d0641     $*     P0641 ETC参考电压A#幅值故障
3d0646     $*     P0646 空调离合器继电器线路短路到低电压或断路
3d0647     $*     P0647 空调离合器继电器线路短路到高电压
3d0650     $*     P0650 故障指示灯故障
3d0651     $*     P0651 ETC参考电压B#幅值故障
3d0602     $*     P0602 ECM编程错误(软件版本不匹配)
3d0604     $*     P0604 RAM错误
3d0606     $*     P0606 ECM处理器故障
3d060a     $*     P060A ECM处理器故障
3d0480     $*     P0480 低速风扇故障
3d0481     $*     P0481 高速风扇故障
3d0458     $*     P0458 碳罐电磁阀线路短路到低电压或断路
3d0459     $*     P0459 碳罐电磁阀线路短路到高电压
3d0420     $*     P0420 催化转化器转化效率低
3d0562     $*     P0562 系统电压低
3d0563     $*     P0563 系统电压高
3d0571     $*     P0571 制动时制动灯的开关状态没有发生改变
3d0537     $*     P0537 空调蒸发温度传感器线路低电压
3d0538     $*     P0538 空调蒸发温度传感器线路高电压或断路
3d0502     $*     P0502 车速传感器无信号
3d0504     $*     P0504 制动开关相关性故障
3d0506     $*     P0506 怠速转速过低
3d0507     $*     P0507 怠速转速过高
3d1336     $*     P1336 58齿齿轮误差未学习
3d1167     $*     P1167 前氧减速断油时过浓
3d1171     $*     P1171 前氧加速加浓时过稀
3d1516     $*     P1516 ETC驱动稳态诊断错误
3d2a01     $*     P2A01 后氧减速断油时过浓
3d2187     $*     P2187 怠速工况燃油系统过稀
3d2188     $*     P2188 怠速工况燃油系统过浓
3d2122     $*     P2122 电子油门踏板位置传感器1#线路低电压
3d2123     $*     P2123 电子油门踏板位置传感器1#线路高电压
3d2127     $*     P2127 电子油门踏板位置传感器2#线路低电压
3d2128     $*     P2128 电子油门踏板位置传感器2#线路高电压
3d2135     $*     P2135 电子节气门位置传感器1#、2#线路相关性故障
3d2138     $*     P2138 电子油门踏板位置传感器1#、2#线路相关性故障
3d2101     $*     P2101 ETC驱动二阶诊断错误
3d2104     $*     P2104 发动机强制怠速
3d2105     $*     P2105 发动机强制停机
3d2106     $*     P2106 发动机性能限制
3d2110     $*     P2110 发动机功率管理
3d2119     $*     P2119 电子节气门回位故障
3d8010     $*     B0010 碰撞断油信号合理性故障(8010)
3c0101     $*     P0101 空气流量计线路不良
3c0102     $*     P0102 进气流量计信号太低
3c0103     $*     P0103 进气流量计信号太高
3c0106     $*     P0106 进气压力感知器线路调整或性能有问题
3c0405     $*     P0405 废气再循环（EGR）感知器A电压过低
3b0a0f     $*     P0a0f 发动机堵转或启动电机故障
3b0261     $*     P0261 一缸喷油器控制电路对地短路
3b0262     $*     P0262 一缸喷油器控制电路对电源短路
3b0264     $*     P0264 二缸喷油器控制电路对地短路
3b0265     $*     P0265 二缸喷油器控制电路对电源短路
3b0267     $*     P0267 三缸喷油器控制电路对地短路
3b0268     $*     P0268 三缸喷油器控制电路对电源短路
3b0270     $*     P0270 四缸喷油器控制电路对地短路
3b0271     $*     P0271 四缸喷油器控制电路对电源短路
3b0222     $*     P0222 电子节气门位置传感器2信号电路电压过低
3b0223     $*     P0223 电子节气门位置传感器2信号电路电压过高
3b0201     $*     P0201 一缸喷油器控制电路开路
3b0202     $*     P0202 二缸喷油器控制电路开路
3b0203     $*     P0203 三缸喷油器控制电路开路
3b0204     $*     P0204 四缸喷油器控制电路开路
3b0219     $*     P0219 发动机转速超过最高转速限制
3b0341     $*     P0341 相位传感器信号不合理
3b0322     $*     P0322 转速传感器信号故障
3b0324     $*     P0324 爆震信号处理芯片及其电路故障
3b0327     $*     P0327 爆震传感器信号电路电压过低
3b0328     $*     P0328 爆震传感器信号电路电压过高
3b0300     $*     P0300 多缸发生失火
3b0301     $*     P0301 一缸发生失火
3b0302     $*     P0302 二缸发生失火
3b0303     $*     P0303 三缸发生失火
3b0304     $*     P0304 四缸发生失火
3b0075     $*     P0075 可变进气升程控制电路开路
3b0076     $*     P0076 可变进气升程控制电路对地短路
3b0077     $*     P0077 可变进气升程控制电路对电源短路
3b0053     $*     P0053 上游氧传感器加热内阻不合理
3b0054     $*     P0054 下游氧传感器加热内阻不合理
3b0030     $*     P0030 上游氧传感器加热控制电路故障
3b0031     $*     P0031 上游氧传感器加热控制电路电压过低
3b0032     $*     P0032 上游氧传感器加热控制电路电压过高
3b0036     $*     P0036 下游氧传感器加热控制电路故障
3b0037     $*     P0037 下游氧传感器加热控制电路电压过低
3b0038     $*     P0038 下游氧传感器加热控制电路电压过高
3b0000     $*     P0000 故障码无定义
3b0170     $*     P0170 下线检测空燃比闭环控制自学习不合理
3b0171     $*     P0171 下线检测空燃比闭环控制自学习过稀
3b0172     $*     P0172 下线检测空燃比闭环控制自学习过浓
3b0140     $*     P0140 下游氧传感器电路信号故障
3b0121     $*     P0121 电子节气门位置传感器1信号不合理
3b0122     $*     P0122 电子节气门位置传感器1信号电路电压过低
3b0123     $*     P0123 电子节气门位置传感器1信号电路电压过高
3b0130     $*     P0130 上游氧传感器信号不合理
3b0131     $*     P0131 上游氧传感器信号低电压
3b0132     $*     P0132 上游氧传感器信号电路电压过高
3b0133     $*     P0133 上游氧传感器老化
3b0134     $*     P0134 上游氧传感器电路信号电路故障
3b0136     $*     P0136 下游氧传感器信号不合理
3b0137     $*     P0137 下游氧传感器信号低电压
3b0138     $*     P0138 下游氧传感器信号电路电压过高
3b0105     $*     P0105 进气压力传感器信号无波动(结冰)
3b0106     $*     P0106 进气压力传感器/大气压力传感器不合理
3b0107     $*     P0107 进气压力传感器对地短路
3b0108     $*     P0108 进气压力传感器对电源短路
3b0112     $*     P0112 进气温度传感器信号电路电压过低
3b0113     $*     P0113 进气温度传感器信号电路电压过高
3b0117     $*     P0117 发动机冷却液温度传感器电路电压过低
3b0118     $*     P0118 发动机冷却液温度传感器电路电压过高
3b0688     $*     P0688 主继电器输出电压不合理
3b0691     $*     P0691 冷却风扇继电器控制电路电压过低(低速)
3b0692     $*     P0692 冷却风扇继电器控制电路电压过高(低速)
3b0693     $*     P0693 冷却风扇继电器控制电路电压过低(高速)
3b0694     $*     P0694 冷却风扇继电器控制电路电压过高(高速)
3b0645     $*     P0645 A/C压缩机继电器控制电路开路
3b0646     $*     P0646 A/C压缩机继电器控制电路电压过低
3b0647     $*     P0647 A/C压缩机继电器控制电路电压过高
3b0627     $*     P0627 油泵继电器控制电路开路
3b0628     $*     P0628 油泵继电器控制电路电压过低
3b0629     $*     P0629 油泵继电器控制电路电压过高
3b0604     $*     P0604 电子控制单元RAM故障
3b0605     $*     P0605 电子控制单元ROM故障
3b0606     $*     P0606 电子节气门安全监控功能故障
3b0704     $*     P0704 离合器踏板开关信号不合理
3b0480     $*     P0480 冷却风扇继电器控制电路开路(低速)
3b0481     $*     P0481 冷却风扇继电器控制电路开路(高速)
3b0489     $*     P0489 EGR阀驱动电路电压过低
3b0490     $*     P0490 EGR阀驱动电路电压过高
3b0444     $*     P0444 碳罐控制阀控制电路开路
3b0458     $*     P0458 碳罐控制阀控制电路电压过低
3b0459     $*     P0459 碳罐控制阀控制电路电压过高
3b0420     $*     P0420 三元催化器储氧能力老化(排放超限)
3b0400     $*     P0400 EGR阀位置传感器电路故障
3b0403     $*     P0403 EGR阀驱动电路故障
3b0404     $*     P0404 EGR阀体机械偏差故障
3b0405     $*     P0405 EGR阀位置传感器电路电压过低
3b0406     $*     P0406 EGR阀位置传感器电路电压过高
3b0409     $*     P0409 EGR阀位置传感器零位检查
3b0560     $*     P0560 系统蓄电池电压信号不合理
3b0562     $*     P0562 系统蓄电池电压过低
3b0563     $*     P0563 系统蓄电池电压过高
3b0571     $*     P0571 刹车开关信号电路故障或相关性不同步
3b0501     $*     P0501 车速传感器信号故障
3b0506     $*     P0506 怠速控制转速低于目标怠速
3b0507     $*     P0507 怠速控制转速高于目标怠速
3b1336     $*     P1336 电子节气门安全监控扭矩限制作用
3b1615     $*     P1615 ECM状态未知
3b1618     $*     P1618 下线刷写密钥匙失败
3b1564     $*     P1564 系统电压不满足电子节气门自学习条件
3b1565     $*     P1565 电子节气门下限位置初始化自学习故障
3b1568     $*     P1568 电子节气门回位阻力过大
3b1579     $*     P1579 电子节气门自学习条件不满足
3b1545     $*     P1545 电子节气门实际位置与目标位置偏差超限
3b1559     $*     P1559 电子节气门自学习过程故障
3b2270     $*     P2270 下游氧传感器老化
3b2271     $*     P2271 下游氧传感器老化
3b2187     $*     P2187 空燃比闭环控制自学习值超下限(中负荷区)
3b2188     $*     P2188 空燃比闭环控制自学习值超上限(低负荷区)
3b2195     $*     P2195 上游氧传感器老化
3b2196     $*     P2196 上游氧传感器老化
3b2177     $*     P2177 空燃比闭环控制自学习值超上限(中负荷区)
3b2122     $*     P2122 电子油门踏板位置传感器1信号电压过低
3b2123     $*     P2123 电子油门踏板位置传感器1信号电压过高
3b2127     $*     P2127 电子油门踏板位置传感器2信号电压过低
3b2128     $*     P2128 电子油门踏板位置传感器2信号电压过高
3b2138     $*     P2138 电子油门踏板位置传感器信号不合理
3b2106     $*     P2106 电子节气门驱动级故障
3b3093     $*     P3093 ECM未进行防盗匹配
3b3094     $*     P3094 防盗器的认证回复不正确，防盗认证失败
3b3095     $*     P3095 为收到防盗器的认证回复
3bc001     $*     U0001 CAN通讯相关诊断
3bc146     $*     U0146 ECU与网关失去通讯
3bc447     $*     U0447 安全气囊信息有误
3bc427     $*     U0427 碰撞发生后断油
3bc415     $*     U0415 ECU与ABS通讯不正常
3a8048     $*     B0048 碰撞输出对地短路或开路
3a8049     $*     B0049 碰撞输出对电源短路
3a8052     $*     B0052 安全气囊控制器达到最大使用限度并无法继续使用
3a8022     $*     B0022 驾驶员安全气囊阻值过低
3a8024     $*     B0024 驾驶员安全气囊对地短路或交叉连接
3a8025     $*     B0025 驾驶员安全气囊对电源短路
3a8026     $*     B0026 驾驶员安全气囊开路（阻值过大）
3a8016     $*     B0016 乘员安全气囊阻值过低
3a8017     $*     B0017 乘员安全气囊开路（阻值过大）
3a8018     $*     B0018 乘员安全气囊对地短路或交叉连接
3a8019     $*     B0019 乘员安全气囊对电源短路
3a8671     $*     B0671 系统故障灯对地短路或开路
3a8673     $*     B0673 系统故障灯对电源短路
3a9327     $*     B1327 电源电压过低
3a9328     $*     B1328 电源电压过高
3a9000     $*     B1000 内部故障
3a9001     $*     B1001 配置错误 (没有配置，但是安装)
388080     $*     B0080 驾驶员侧外围加速度传感器有缺陷或信号可靠性故障
388081     $*     B0081 乘员侧外围加速度传感器连接错误或初始化故障
388082     $*     B0082 乘员侧外围加速度传感器有缺陷或信号可靠性故障
388060     $*     B0060 乘员安全带预紧器对电源短路
388064     $*     B0064 驾驶员安全带预紧器阻值过低
388065     $*     B0065 驾驶员安全带预紧器开路（阻值过大）
388066     $*     B0066 驾驶员安全带预紧器对地短路或交叉连接
388067     $*     B0067 驾驶员安全带预紧器对电源短路
388077     $*     B0077 驾驶员侧外围加速度传感器性能故障或交叉连接
388078     $*     B0078 乘员侧外围加速度传感器性能故障或交叉连接
388079     $*     B0079 驾驶员侧外围加速度传感器不正确或初始化故障
388040     $*     B0040 驾驶员侧气囊阻值过低
388041     $*     B0041 驾驶员侧气囊开路（阻值过大）
388045     $*     B0045 驾驶员侧气囊对地短路或交叉连接
388046     $*     B0046 驾驶员侧气囊对电源短路
388048     $*     B0048 碰撞输出对地短路或开路
388049     $*     B0049 碰撞输出对电源短路
388051     $*     B0051 前气囊和前安全带预紧器已引爆
388052     $*     B0052 安全气囊控制器达到最大使用限度并无法继续使用
388057     $*     B0057 乘员安全带预紧器阻值过低
388058     $*     B0058 乘员安全带预紧器开路（阻值过大）
388059     $*     B0059 乘员安全带预紧器对地短路或交叉连接
388022     $*     B0022 驾驶员安全气囊阻值过低
388024     $*     B0024 驾驶员安全气囊对地短路或交叉连接
388025     $*     B0025 驾驶员安全气囊对电源短路
388026     $*     B0026 驾驶员安全气囊开路（阻值过大）
388028     $*     B0028 乘员侧气囊阻值过低
388029     $*     B0029 乘员侧气囊开路（阻值过大）
388030     $*     B0030 乘员侧气囊对地短路或交叉连接
388032     $*     B0032 乘员侧气囊对电源短路
388034     $*     B0034 侧气囊已引爆
388016     $*     B0016 乘员安全气囊阻值过低
388017     $*     B0017 乘员安全气囊开路（阻值过大）
388018     $*     B0018 乘员安全气囊对地短路或交叉连接
388019     $*     B0019 乘员安全气囊对电源短路
388671     $*     B0671 系统故障灯对地短路或开路
388673     $*     B0673 系统故障灯对电源短路
389327     $*     B1327 电源电压过低
389328     $*     B1328 电源电压过高
389022     $*     B1022 驾驶员气帘开路（阻值过大）
389023     $*     B1023 驾驶员气帘阻值过低
389024     $*     B1024 驾驶员气帘对地短路或交叉连接
389025     $*     B1025 驾驶员气帘对电源短路
389027     $*     B1027 乘员气帘开路（阻值过大）
389028     $*     B1028 乘员气帘阻值过低
389029     $*     B1029 乘员气帘对地短路或交叉连接
38902a     $*     B102A 乘员气帘对电源短路
389000     $*     B1000 内部故障
389001     $*     B1001 配置错误 (没有配置，但是安装)
370261     $*     P0261 一缸喷油器控制电路电压过低
370262     $*     P0262 一缸喷油器控制电路电压过高
370264     $*     P0264 二缸喷油器控制电路电压过低
370265     $*     P0265 二缸喷油器控制电路电压过高
370267     $*     P0267 三缸喷油器控制电路电压过低
370268     $*     P0268 三缸喷油器控制电路电压过高
370270     $*     P0270 四缸喷油器控制电路电压过低
370271     $*     P0271 四缸喷油器控制电路电压过高
370243     $*     P0243 废气控制阀驱动电路故障
370245     $*     P0245 废气控制阀驱动电路电压过低
370246     $*     P0246 废气控制阀驱动电路电压过高
370221     $*     P0221 电子节气门位置传感器2信号不合理
370222     $*     P0222 电子节气门位置传感器2信号电路电压过低
370223     $*     P0223 电子节气门位置传感器2信号电路电压过高
370234     $*     P0234 涡轮控制增压过度
370237     $*     P0237 涡轮增压压力传感器信号电压过低
370238     $*     P0238 涡轮增压压力传感器信号电压过高
370201     $*     P0201 一缸喷油器控制电路开路
370202     $*     P0202 二缸喷油器控制电路开路
370203     $*     P0203 三缸喷油器控制电路开路
370204     $*     P0204 四缸喷油器控制电路开路
370219     $*     P0219 发动机超转速
370341     $*     P0341 进气凸轮轴相位传感器信号不合理
370322     $*     P0322 转速传感器故障
370327     $*     P0327 爆震传感器电路故障
370300     $*     P0300 多缸失火发生
370301     $*     P0301 一缸发生失火
370302     $*     P0302 二缸发生失火
370303     $*     P0303 三缸发生失火
370304     $*     P0304 四缸发生失火
37006d     $*     P006D 环境压力传感器信号电压过低
370053     $*     P0053 上游氧传感器加热内阻不合理
370054     $*     P0054 下游氧传感器加热内阻不合理
370030     $*     P0030 上游氧传感器加热控制电路断路
370031     $*     P0031 上游氧传感器加热控制电路对地短路
370032     $*     P0032 上游氧传感器加热控制电路对电源短路
370036     $*     P0036 下游氧传感器加热控制电路断路
370037     $*     P0037 下游氧传感器加热控制电路对地短路
370038     $*     P0038 下游氧传感器加热控制电路对电源短路
37000a     $*     P000A 进气VVT(可变正时气门)运行故障（卡死）
370010     $*     P0010 进气VVT(可变正时气门)电路断路
370012     $*     P0012 进气凸轮轴锁死位置运行不合理故障
370016     $*     P0016 进气凸轮轴位置跳动
370170     $*     P0170 下线检测空燃比闭环控制自学习不合理
370171     $*     P0171 下线检测空燃比闭环控制自学习过稀
370172     $*     P0172 下线检测空燃比闭环控制自学习过浓
370140     $*     P0140 下游氧传感器电路信号故障
370121     $*     P0121 电子节气门位置传感器1信号不合理
370122     $*     P0122 电子节气门位置传感器1信号电路电压过低
370123     $*     P0123 电子节气门位置传感器1信号电路电压过高
370130     $*     P0130 上游氧传感器信号不合理
370131     $*     P0131 上游氧传感器信号电路电压过低
370132     $*     P0132 上游氧传感器信号电路电压过高
370133     $*     P0133 上游氧传感器老化
370134     $*     P0134 上游氧传感器电路信号故障
370136     $*     P0136 下游氧传感器信号不合理
370137     $*     P0137 下游氧传感器信号电路电压过低
370138     $*     P0138 下游氧传感器信号电路电压过高
370105     $*     P0105 进气压力传感器信号无变化
370106     $*     P0106 进气压力传感器不合理
370107     $*     P0107 进气压力传感器电路电压过低
370108     $*     P0108 进气压力传感器电路电压过高
370111     $*     P0111 进气岐管温度传感器信号不合理故障
370112     $*     P0112 进气岐管温度传感器电路电压过低
370113     $*     P0113 进气岐管温度传感器电路电压过高
370116     $*     P0116 发动机冷却液温度传感器信号不合理故障
370117     $*     P0117 发动机冷却液温度传感器电路电压过低
370118     $*     P0118 发动机冷却液温度传感器电路电压过高
370688     $*     P0688 主继电器输出电压信号故障
370691     $*     P0691 冷却风扇继电器控制电路对地短路（低速）
370692     $*     P0692 冷却风扇继电器控制电路对电源短路（低速）
370693     $*     P0693 冷却风扇继电器控制电路对地短路（高速）
370694     $*     P0694 冷却风扇继电器控制电路对电源短路（高速）
370645     $*     P0645 A/C压缩机继电器控制电路开路
370646     $*     P0646 A/C压缩机继电器控制电路对地短路
370647     $*     P0647 A/C压缩机继电器控制电路对电源短路
370627     $*     P0627 油泵继电器控制电路开路
370628     $*     P0628 油泵继电器控制电路对地短路或开路
370629     $*     P0629 油泵继电器控制电路对电源短路
370601     $*     P0601 下线配置EEPROM(电可擦除只读存储器)的checksum计算故障
370604     $*     P0604 电子控制单元RAM故障
370605     $*     P0605 电子控制单元ROM故障
370606     $*     P0606 电子节气门安全监控功能故障（监控模块询问故障）
370704     $*     P0704 离合器踏板开关信号不正确
370480     $*     P0480 冷却风扇继电器控制电路开路（低速）
370481     $*     P0481 冷却风扇继电器控制电路开路（高速）
370444     $*     P0444 碳罐控制阀控制电路开路
370458     $*     P0458 碳罐控制阀控制电路电压过低
370459     $*     P0459 碳罐控制阀控制电路电压过高
370420     $*     P0420 三元催化器储氧能力老化
370560     $*     P0560 系统蓄电池电压信号不合理
370562     $*     P0562 系统蓄电池电压过低
370563     $*     P0563 系统蓄电池电压过高
370571     $*     P0571 刹车灯开关信号电路故障
370557     $*     P0557 刹车真空压力传感器信号电压过低
370558     $*     P0558 刹车真空压力传感器信号电压过高
370500     $*     P0500 车速传感器信号故障
370506     $*     P0506 怠速控制转速低于目标怠速
370507     $*     P0507 怠速控制转速高于目标怠速
371336     $*     P1336 电子节气门安全监控扭矩限制作用
371683     $*     P1683 安全气囊信号不合理
371610     $*     P1610 ECM未学习SecretKey
371611     $*     P1611 PIN码输入错误
371612     $*     P1612 ECM未收到IMMO或PEPS的认证请求
371613     $*     P1613 ECM未收到IMMO的认证请求或最后一次请求繁忙
371479     $*     P1479 刹车真空压力传感器信号不合理
371427     $*     P1427 刹车真空助力泵控制电路电压偏高
371428     $*     P1428 刹车真空助力泵控制电路电压偏低
371429     $*     P1429 刹车真空助力泵控制电路电压开路
371564     $*     P1564 系统电压不满足电子节气门自学习条件
371565     $*     P1565 电子节气门机械下止点初次自学习故障
371568     $*     P1568 电子节气门弹簧检查故障
371579     $*     P1579 电子节气门自学习条件不满足
371545     $*     P1545 电子节气门PID位置控制故障
371559     $*     P1559 电子节气门机械下止点再次自学习故障
371523     $*     P1523 碰撞断油功能激活
372270     $*     P2270 下游氧传感器老化- 信号持续偏稀
372271     $*     P2271 下游氧传感器老化- 信号持续偏浓
372088     $*     P2088 进气VVT(可变正时气门)电路对地短路
372089     $*     P2089 进气VVT(可变正时气门)电路对电源短路
372187     $*     P2187 空燃比闭环控制自学习值超上限（低负荷区）
372188     $*     P2188 空燃比闭环控制自学习值超下限（低负荷区）
372195     $*     P2195 上游氧传感器老化－信号持续偏浓
372196     $*     P2196 上游氧传感器老化－信号持续偏稀
372177     $*     P2177 空燃比闭环控制自学习值超上限
372178     $*     P2178 空燃比闭环控制自学习值超下限
372122     $*     P2122 电子油门踏板位置传感器1信号电压过低
372123     $*     P2123 电子油门踏板位置传感器1信号电压过高
372127     $*     P2127 电子油门踏板位置传感器2信号电压过低
372128     $*     P2128 电子油门踏板位置传感器2信号电压过高
372138     $*     P2138 电子油门踏板位置传感器信号不合理
372106     $*     P2106 负荷监控故障
37c001     $*     U0001 CAN通讯相关诊断
37c140     $*     U0140 与BCM通讯丢失或信号异常
37c151     $*     U0151 与ACU通讯中断
37c122     $*     U0122 ECU与ABS通讯不正常
360a59     $*     P0A59 发电机故障
360831     $*     P0831 离合器位置开关线路低电压
360832     $*     P0832 离合器位置开关线路高电压
360299     $*     P0299 涡轮增压不足
360261     $*     P0261 1缸喷嘴线路低电压故障
360262     $*     P0262 1缸喷嘴线路高电压故障
360264     $*     P0264 2缸喷嘴线路低电压故障
360265     $*     P0265 2缸喷嘴线路高电压故障
360267     $*     P0267 3缸喷嘴线路低电压故障
360268     $*     P0268 3缸喷嘴线路高电压故障
360270     $*     P0270 4缸喷嘴线路低电压故障
360271     $*     P0271 4缸喷嘴线路高电压故障
360245     $*     P0245 涡轮控制阀线圈低电压或断路
360246     $*     P0246 涡轮控制阀线圈高电压
360222     $*     P0222 电子节气门位置传感器2#线路低电压
360223     $*     P0223 电子节气门位置传感器2#线路高电压
360230     $*     P0230 油泵继电器故障
360234     $*     P0234 涡轮增压过量
360236     $*     P0236 增压压力与大气压合理性故障
360237     $*     P0237 增压压力传感器线路低电压或断开
360238     $*     P0238 增压压力传感器线路高电压
36023d     $*     P023D 增压压力与进气压力合理性故障
360351     $*     P0351 1(4)缸点火线圈故障
360352     $*     P0352 2(3)缸点火线圈故障
360353     $*     P0353 3缸点火线圈故障
360354     $*     P0354 4缸点火线圈故障
360324     $*     P0324 爆震控制系统故障
360325     $*     P0325 爆震传感器故障
360335     $*     P0335 曲轴位置传感器线路无信号
360336     $*     P0336 曲轴位置传感器线路信号干扰
360300     $*     P0300 单缸或多缸失火
360072     $*     P0072 环境温度传感器线路低电压
360073     $*     P0073 环境温度传感器线路高电压或断路
360034     $*     P0034 涡轮旁通电磁阀控制线路低电压或断路
360035     $*     P0035 涡轮旁通电磁阀控制线路高电压
360171     $*     P0171 非怠速工况燃油系统过稀
360172     $*     P0172 非怠速工况燃油系统过浓
360140     $*     P0140 后氧传感器断路
360141     $*     P0141 后氧传感器加热器故障
360122     $*     P0122 电子节气门位置传感器1#线路低电压
360123     $*     P0123 电子节气门位置传感器1#线路高电压
360131     $*     P0131 前氧传感器短路到低电压
360132     $*     P0132 前氧传感器短路到高电压
360133     $*     P0133 前氧传感器响应过慢
360134     $*     P0134 前氧传感器断路
360135     $*     P0135 前氧传感器加热器故障
360137     $*     P0137 后氧传感器短路到低电压
360138     $*     P0138 后氧传感器短路到高电压
360106     $*     P0106 进气压力/油门位置合理性故障
360107     $*     P0107 进气压力传感器线路低电压或断路
360108     $*     P0108 进气压力传感器线路高电压
360112     $*     P0112 进气温度传感器线路低电压
360113     $*     P0113 进气温度传感器线路高电压或断路
360117     $*     P0117 冷却液温度传感器线路低电压
360118     $*     P0118 冷却液温度传感器线路高电压或断路
360685     $*     P0685 主继电器故障
360641     $*     P0641 ETC参考电压A#幅值故障
360646     $*     P0646 空调离合器继电器线路短路到低电压或断路
360647     $*     P0647 空调离合器继电器线路短路到高电压
360651     $*     P0651 ETC参考电压B#幅值故障
360633     $*     P0633 防盗器未学习故障
360601     $*     P0601 ROM错误
360602     $*     P0602 ECM编程错误(软件版本不匹配)
360604     $*     P0604 RAM错误
360606     $*     P0606 ECM处理器故障
36060a     $*     P060A COND_ETC_SOH主CPU
360616     $*     P0616 起动电机继电器低电压
360617     $*     P0617 起动电机继电器高电压
360700     $*     P0700 TCU(变速箱控制器)故障
360480     $*     P0480 低速风扇故障
360481     $*     P0481 高速风扇故障
360458     $*     P0458 碳罐电磁阀线路短路到低电压或断路
360459     $*     P0459 碳罐电磁阀线路短路到高电压
360420     $*     P0420 催化转化器转化效率低
360562     $*     P0562 电池电压过高
360563     $*     P0563 电池电压过低
360564     $*     P0564 巡航控制输入线路故障
360565     $*     P0565 巡航“On/Off”信号嵌住
360566     $*     P0566 巡航“Cancel”信号嵌住
360567     $*     P0567 巡航“Resume”信号嵌住
360568     $*     P0568 巡航“Set”信号嵌住
360571     $*     P0571 制动时制动灯的开关状态没有发生改变
360551     $*     P0551 动力转向开关线路电压范围/性能故障
360532     $*     P0532 空调压力传感器线路低电压或断路
360533     $*     P0533 空调压力传感器线路高电压
360502     $*     P0502 车速传感器无信号
360504     $*     P0504 制动开关相关性故障
360506     $*     P0506 怠速转速过低
360507     $*     P0507 怠速转速过高
361336     $*     P1336 齿讯未学习
361167     $*     P1167 前氧减速断油时过浓
361171     $*     P1171 前氧加速加浓时过稀
361516     $*     P1516 ETC驱动稳态诊断错误
362228     $*     P2228 大气压压力传感器短路到低电压或断路
362229     $*     P2229 大气压压力传感器短路到高电压
362122     $*     P2122 电子油门踏板位置传感器1#线路低电压
362123     $*     P2123 电子油门踏板位置传感器1#线路高电压
362127     $*     P2127 电子油门踏板位置传感器2#线路低电压
362128     $*     P2128 电子油门踏板位置传感器2#线路高电压
362135     $*     P2135 电子节气门位置传感器1#、2#线路相关性故障
362138     $*     P2138 电子油门踏板位置传感器1#、2#线路相关性故障
362101     $*     P2101 ETC驱动二阶诊断错误
362104     $*     P2104 发动机强制怠速
362105     $*     P2105 发动机强制停机
362106     $*     P2106 发动机性能限制
362110     $*     P2110 发动机功率管理
362119     $*     P2119 电子节气门回位故障
362610     $*     P2610 LPC重置故障
368010     $*     B0010 碰撞断油信号合理性故障
36c248     $*     U0248 PEPS与车辆动态控制模块通信丢失
36c073     $*     U0073 CAN总线关闭
36c001     $*     U0001 CAN通讯故障
36c167     $*     U0167 防盗器无响应
36c155     $*     U0155 ECM与车辆动态控制模块通信丢失
36c121     $*     U0121 ECM与ABS控制模块通讯丢失
36c101     $*     U0101 ECM与TCM通讯丢失
36c426     $*     U0426 防盗器认证失败
350882     $*     P0882 电池或高端电压太低
350883     $*     P0883 电池或高端电压太高
350868     $*     P0868 压力预紧调节故障
350840     $*     P0840 从动锥轮压力传感器
35080a     $*     P080A 下线离合器自适应未完成
350811     $*     P0811 离合器（前进或后退）打滑
350960     $*     P0960 主动锥轮压力调节器断路
350962     $*     P0962 EDS1主动锥轮压力调节器接地
350963     $*     P0963 主动锥轮压力调节器短路
350964     $*     P0964 从动锥轮压力调节器断路
350966     $*     P0966 从动锥轮压力调节器接地
350967     $*     P0967 从动锥轮压力调节器短路
350944     $*     P0944 夹紧力不足(VSM)
350955     $*     P0955 手动加减档信号故障
350930     $*     P0930 起动锁接地
350931     $*     P0931 起动锁短路或断路
350900     $*     P0900 离合器压力调节器断路
350902     $*     P0902 离合器压力调节器接地
350903     $*     P0903 离合器压力调节器短路
350218     $*     P0218 变速箱油温太高
350219     $*     P0219 动力系统超过转速范围
350641     $*     P0641 压力传感器电源故障
350651     $*     P0651 驾驶模式传感器和速度传感器电源故障
350658     $*     P0658 压力调节器断路或接地
350659     $*     P0659 压力调节器短路
350602     $*     P0602 ROM内部编码校验和
350603     $*     P0603 EEPROM(电可擦除只读存储器) 故障 (校验和)
350604     $*     P0604 RAM内部数据检查故障
350605     $*     P0605 ROM内部数据校验和
350720     $*     P0720 从动锥轮转速传感器故障
350721     $*     P0721 从动锥轮转速与真实转速不符
350727     $*     P0727 从ECU到TCU(变速箱控制器)的硬线发动机转速信号传递与真实转速不符
350730     $*     P0730 传动比控制故障
350701     $*     P0701 两个故同时出现要求压力调节器断电TCU(变速箱控制器)采取措施
350702     $*     P0702 TCU(变速箱控制器)内部检测系统故障（点火期间）
350705     $*     P0705 驾驶模式传感器多线错误
350706     $*     P0706 驾驶模式传感器单线错误
350710     $*     P0710 油温传感器故障
350571     $*     P0571 刹车信号错误
351761     $*     P1761 压力调节器电流故障
351762     $*     P1762 电流值被固定，不能改变
351763     $*     P1763 起动锁接地或断路
351764     $*     P1764 起动锁短路
351765     $*     P1765 从动锥轮压力太低
351766     $*     P1766 从动锥轮压力太高
351767     $*     P1767 变速箱油温超出范围
351768     $*     P1768 倒车灯接地
351769     $*     P1769 倒车灯短路或断路
351770     $*     P1770 发动机转速过低
351773     $*     P1773 冬季模式信号错误
351774     $*     P1774 下线离合器自适应学习错误
351775     $*     P1775 无效或无XCU生产数据
351776     $*     P1776 主板故障 - 内部硬件问题
351777     $*     P1777 巡航错误
352787     $*     P2787 离合器温度太高
352765     $*     P2765 主动锥轮转速传感器故障
352766     $*     P2766 主动锥轮转速与真实转速不符
35c301     $*     U0301 车辆配置错误
35c001     $*     U0001 CAN总线故障
35c121     $*     U0121 CAN总线上ABS通讯故障
35c100     $*     U0100 ECU CAN通讯故障
35c415     $*     U0415 ABS 功能错误
35d012     $*     U1012 CAN总线上发动机转速信号错误
35d013     $*     U1013 CAN总线上加速踏板信号错误
35d014     $*     U1014 CAN总线上发动机扭矩信号错误
35d016     $*     U1016 CAN总线上左前轮速（信号）错误
35d017     $*     U1017 CAN总线上右前轮速（信号）错误
35d018     $*     U1018 CAN总线上左后轮速（信号）错误
35d019     $*     U1019 CAN总线上右后轮速（信号）错误
349200     $*     B1200 燃油传感器电阻值输出溢出
34c001     $*     U0001 CAN总线关闭
34c100     $*     U0100 高速Can所有节点掉线
34d600     $*     U1600 组合仪表里程数据出错
34d610     $*     U1610 通信错误
34d562     $*     U1562 过高电压故障
34d563     $*     U1563 过低电压故障
34d511     $*     U1511 与发动机控制单元失去通信
34d513     $*     U1513 与变速器控制单元失去通信
34d515     $*     U1515 与ABS控制单元失去通信
34d517     $*     U1517 与车身控制单元失去通信
34d519     $*     U1519 与倒车雷达失去通信
330b0a     $*     P0B0A EMOP电压过低
330b0b     $*     P0B0B EMOP电压过高
330867     $*     P0867 完全空档
330966     $*     P0966 线性压力控制电磁阀（SLC1）控制电压接地短路/断路
330967     $*     P0967 线性压力控制电磁阀（SLC1）控制电压接电源短路
330970     $*     P0970 线性压力控制电磁阀（SLC2）控制电压接地短路/断路
330971     $*     P0971 线性压力控制电磁阀（SLC2）控制电压接电源短路
330973     $*     P0973 换档电磁阀(S1)控制电压接地短路
330974     $*     P0974 换档电磁阀(S1)控制电压接电源短路/断路
330c01     $*     P0C01 EMOP油温过高
330c11     $*     P0C11 液压电子油泵控制功能失效
330601     $*     P0601 TCU(变速箱控制器)内部控制模块checksum错误
330603     $*     P0603 TCU(变速箱控制器)非易失性存储器故障
330604     $*     P0604 TCU(变速箱控制器)随机存储器故障
330796     $*     P0796 线性压力控制电磁阀（SLC2）MIN压出力故障（SLC2或者S1故障）
330797     $*     P0797 线性压力控制电磁阀（SLC2）MAX压出力故障
330798     $*     P0798 线性压力控制电磁阀（SLC2）卡住
330761     $*     P0761 换档电磁阀(S1)MAX压出力故障（S1或者 SLC2故障）
330776     $*     P0776 线性压力控制电磁阀（SLC1）MIN压出力故障
330777     $*     P0777 线性压力控制电磁阀（SLC1）MAX压出力故障
330778     $*     P0778 线性压力控制电磁阀（SLC1）卡住
330741     $*     P0741 液力变矩器解锁故障（S1或者SLU故障）
330742     $*     P0742 液力变矩器锁止故障
330751     $*     P0751 换档电磁阀(S1)MIN压出力故障
330720     $*     P0720 输出转速传感器对电源、地短路
330722     $*     P0722 输出转速传感器无信号
330705     $*     P0705 变速箱档位传感器对地短路/断路
330706     $*     P0706 变速箱档位传感器对电源短路
330711     $*     P0711 变速器油温传感器卡滞
330712     $*     P0712 变速器油温传感器欠压
330713     $*     P0713 变速器油温传感器过压
330715     $*     P0715 输入转速传感器对电源、地短路
330717     $*     P0717 输入转速传感器无信号
330562     $*     P0562 系统电压过低
330563     $*     P0563 系统电压过高
331100     $*     P1100 引擎制动失效
332798     $*     P2798 EMOP对地短路
332799     $*     P2799 EMOP对电源短路
332763     $*     P2763 液力变矩器离合器压力控制电磁阀（SLU）控制接电源短路
332764     $*     P2764 液力变矩器离合器压力控制电磁阀（SLU）控制接地短路/断路
332759     $*     P2759 液力离矩器离合器压力控制电磁阀（SLU）卡住
332723     $*     P2723 线性压力控制电磁阀（SLB1）MIN压出力故障
332724     $*     P2724 线性压力控制电磁阀（SLB1）MAX压出力故障
332725     $*     P2725 线性压力控制电磁阀（SLB1）卡住
332729     $*     P2729 线性压力控制电磁阀（SLB1）控制电压接地短路/断路
332730     $*     P2730 线性压力控制电磁阀（SLB1）控制电压接电源短路
3390e1     $*     B10E1 安全带指示灯故障
3390e3     $*     B10E3 通用蜂鸣器故障（预留）
339086     $*     B1086 电压过低
339087     $*     B1087 电压过高
339088     $*     B1088 内部故障（替换SDM）
339089     $*     B1089 回路搭接
339091     $*     B1091 警告灯故障
339093     $*     B1093 碰撞输出故障
339095     $*     B1095 碰撞安全带预紧
339098     $*     B1098 前方碰撞
339041     $*     B1041 乘员安全带预紧器低电阻
339046     $*     B1046 驾驶员安全气囊高电阻
339048     $*     B1048 乘客安全气囊高电阻
339051     $*     B1051 驾驶员安全带预紧器高电阻
339052     $*     B1052 乘员安全带预紧器高电阻
339024     $*     B1024 驾驶员安全气囊对电源短路
339026     $*     B1026 乘客安全气囊对电源短路
339028     $*     B1028 驾驶员安全带预紧器对电源短路
339029     $*     B1029 乘员安全带预紧器对电源短路
339035     $*     B1035 驾驶员安全气囊低电阻
339037     $*     B1037 乘客安全气囊低电阻
339039     $*     B1039 驾驶员安全带预紧器低电阻
339013     $*     B1013 驾驶员安全气囊对地短路
339015     $*     B1015 乘客安全气囊对地短路
339017     $*     B1017 驾驶员安全带预紧器对地短路
339018     $*     B1018 乘员安全带预紧器对地短路
33901a     $*     B101A 驾驶员安全气囊无效配置
33901c     $*     B101C 乘客安全气囊无效配置
33901e     $*     B101E 驾驶员安全带预紧器无效配置
33901f     $*     B101F 乘员安全带无效配置
33c037     $*     U0037 CAN总线故障
33c122     $*     U0122 与ESP(车身稳定系统)丢失通信
33c100     $*     U0100 与EMS丢失通信
320230     $*     P0230 油泵控制电路故障
320201     $*     P0201 喷油器 1 控制电路故障
320202     $*     P0202 喷油器 4 控制电路故障
320203     $*     P0203 喷油器 2 控制电路故障
320204     $*     P0204 喷油器 3 控制电路故障
320351     $*     P0351 点火线圈1#输出故障
320352     $*     P0352 点火线圈2#输出故障
320325     $*     P0325 爆震控制系统故障
320327     $*     P0327 爆震传感器故障
320336     $*     P0336 曲轴位置传感器线路干扰信号
320337     $*     P0337 曲轴位置传感器无信号
320300     $*     P0300 失火
320140     $*     P0140 后氧传感器开路
320141     $*     P0141 后氧传感器加热故障
320122     $*     P0122 节气门位置传感器电路低电压或电路开路
320123     $*     P0123 节气门位置传感器电路高电压
320131     $*     P0131 氧传感器电路低电压
320132     $*     P0132 氧传感器电路高电压
320133     $*     P0133 前氧传感器反馈故障
320134     $*     P0134 氧传感器开路
320135     $*     P0135 氧传感器加热故障
320137     $*     P0137 后氧传感器对地短路
320138     $*     P0138 后氧传感器对电源短路
320107     $*     P0107 进气压力传感器电路低电压或电路开路
320108     $*     P0108 进气压力传感器电路高电压
320112     $*     P0112 进气温度传感器电路低电压
320113     $*     P0113 进气温度传感器电路高电压/电路开路
320117     $*     P0117 水温传感器电路低电压
320118     $*     P0118 水温传感器电路高电压或电路开路
320685     $*     P0685 主继电器故障
320630     $*     P0630 未写入VIN信息
320601     $*     P0601 ECU 校验码错误
320480     $*     P0480 风扇控制电路故障
320443     $*     P0443 碳罐控制阀控制故障
320420     $*     P0420 催化器效率低于限值
320562     $*     P0562 系统电压高
320563     $*     P0563 系统电压低
320502     $*     P0502 车速传感器无信号
320506     $*     P0506 怠速控制转速偏离目标转速低
320507     $*     P0507 怠速控制转速偏离目标转速高
321336     $*     P1336 齿轮未学习
321167     $*     P1167 前氧传感器减速过浓
321171     $*     P1171 前氧传感器加速过稀
321545     $*     P1545 空调离合器线路输出故障
322a01     $*     P2a01 后氧传感器反馈故障
310230     $*     P0230 油泵控制电路故障
310201     $*     P0201 喷油器 1 控制电路故障
310202     $*     P0202 喷油器 2 控制电路故障
310203     $*     P0203 喷油器 3 控制电路故障
310204     $*     P0204 喷油器 4 控制电路故障
310340     $*     P0340 相位传感器故障
310342     $*     P0342 相位传感器电路低电压
310343     $*     P0343 相位传感器电路高电压
310351     $*     P0351 点火线圈1#输出故障
310352     $*     P0352 点火线圈2#输出故障
310324     $*     P0324 爆震零测试诊断/爆震偏移量诊断/爆震测试脉冲诊断故障
310325     $*     P0325 爆震控制系统故障
310327     $*     P0327 爆震传感器故障
310335     $*     P0335 曲轴位置传感器信号故障
310336     $*     P0336 曲轴位置传感器线路干扰信号
310337     $*     P0337 曲轴位置传感器无信号
310300     $*     P0300 失火
310170     $*     P0170 λ 闭环控制自学习值乘法/除法/加法部分超限
310171     $*     P0171 λ 闭环控制自学习值乘法/除法/加法部分超上限
310172     $*     P0172 λ 闭环控制自学习值乘法/除法/加法部分超下限
310140     $*     P0140 后氧传感器开路
310141     $*     P0141 后氧传感器加热故障
310120     $*     P0120 节气门位置传感器电路故障
310122     $*     P0122 节气门位置传感器电路低电压或电路开路
310123     $*     P0123 节气门位置传感器电路高电压
310130     $*     P0130 氧传感器合理故障
310131     $*     P0131 氧传感器电路低电压
310132     $*     P0132 氧传感器电路高电压
310133     $*     P0133 前氧传感器反馈故障
310134     $*     P0134 氧传感器开路
310135     $*     P0135 氧传感器加热故障
310137     $*     P0137 后氧传感器对地短路
310138     $*     P0138 后氧传感器对电源短路
310105     $*     P0105 进气压力传感器信号故障
310106     $*     P0106 进气压力传感器合理故障
310107     $*     P0107 进气压力传感器电路低电压或电路开路
310108     $*     P0108 进气压力传感器电路高电压
310110     $*     P0110 进气温度传感器信号故障
310111     $*     P0111 进气温度传感器故障
310112     $*     P0112 进气温度传感器电路低电压
310113     $*     P0113 进气温度传感器电路高电压/电路开路
310115     $*     P0115 水温传感器信号故障
310116     $*     P0116 水温传感器故障
310117     $*     P0117 水温传感器电路低电压
310118     $*     P0118 水温传感器电路高电压或电路开路
310685     $*     P0685 主继电器故障
310645     $*     P0645 空调压缩机继电器控制电路故障
310646     $*     P0646 空调压缩机继电器控制电路低电压
310647     $*     P0647 空调压缩机继电器控制电路高电压
310601     $*     P0601 ECU 校验码错误
310602     $*     P0602 诊断数据识别码未编程
310480     $*     P0480 风扇控制电路故障
310443     $*     P0443 碳罐控制阀控制故障
310444     $*     P0444 碳罐控制阀控制电路低电压
310445     $*     P0445 碳罐控制阀控制电路高电压
310420     $*     P0420 催化器效率低于限值
310560     $*     P0560 动力故障
310562     $*     P0562 系统电压高
310563     $*     P0563 系统电压低
310530     $*     P0530 空调压力诊断信号故障
310531     $*     P0531 空调压力诊断
310532     $*     P0532 空调压力诊断电路低电压
310533     $*     P0533 空调压力诊断电路高电压或电路开路
310502     $*     P0502 车速传感器无信号
310505     $*     P0505 怠速控制转速偏离目标转速故障
310506     $*     P0506 怠速控制转速偏离目标转速低
310507     $*     P0507 怠速控制转速偏离目标转速高
310508     $*     P0508 步进电机控制电路低电压
310509     $*     P0509 步进电机控制电路高电压
310511     $*     P0511 步进电机控制电路故障
311336     $*     P1336 齿轮误差未学习
311167     $*     P1167 前氧传感器减速过浓
311171     $*     P1171 前氧传感器加速过稀
311651     $*     P1651 SVS 灯控制电路故障
311545     $*     P1545 空调离合器线路输出故障
000ae0     $*     P0AE0 混合动力电池负极接触器控制电路高
000ae1     $*     P0AE1 混合动力电池预充电接触器电路
000ae2     $*     P0AE2 混合动力电池预充电接触器电路卡在关闭位置
000ae3     $*     P0AE3 混合动力电池预充电接触器电路卡在接通位置
000ae4     $*     P0AE4 混合动力电池预充电接触器控制电路
000ae5     $*     P0AE5 混合动力电池预充电接触器控制电路范围/性能
000ae6     $*     P0AE6 混合动力电池预充电接触器控制电路低
000ae7     $*     P0AE7 混合动力电池预充电接触器控制电路高
000ae8     $*     P0AE8 混合动力电池温度传感器 D 电路
000ae9     $*     P0AE9 混合动力电池温度传感器 D 电路范围/性能
000aea     $*     P0AEA 混合动力电池温度传感器 D 电路低
000aeb     $*     P0AEB 混合动力电池温度传感器 D 电路高
000aec     $*     P0AEC 混合动力电池温度传感器 D 电路间歇故障/不稳定
000aed     $*     P0AED 驱动马达逆变器温度传感器 A 电路
000aee     $*     P0AEE 驱动马达逆变器温度传感器 A 电路范围/性能
000aef     $*     P0AEF 驱动马达逆变器温度传感器 A 电路低
000af0     $*     P0AF0 驱动马达逆变器温度传感器 A 电路高
000af1     $*     P0AF1 驱动马达反相器温度传感器 A 电路间歇性故障/不稳定
000af2     $*     P0AF2 驱动马达逆变器温度传感器 B 电路
000af3     $*     P0AF3 驱动马达逆变器温度传感器 B 电路范围/性能
000af4     $*     P0AF4 驱动马达逆变器温度传感器 B 电路低
000af5     $*     P0AF5 驱动马达逆变器温度传感器 B 电路高
000af6     $*     P0AF6 驱动马达逆变器温度传感器 B 电路间歇性故障/不稳定
000af7     $*     P0AF7 14 伏电源模块内部温度过高
000af8     $*     P0AF8 混合动力电池系统电压
000af9     $*     P0AF9 混合动力电池系统电压不稳定
000afa     $*     P0AFA 混合动力电池系统电压过低
000afb     $*     P0AFB 混合动力电池系统电压过高
000ac0     $*     P0AC0 混合动力电池组电流传感器电路范围/性能
000ac1     $*     P0AC1 混合动力电池组电流传感器电路低
000ac2     $*     P0AC2 混合动力电池组电流传感器电路高
000ac3     $*     P0AC3 混合动力电池组电流传感器电路间歇故障/不稳定
000ac4     $*     P0AC4 混合动力总成控制模块请求故障指示灯照明
000ac5     $*     P0AC5 混合动力电池温度传感器 B 电路
000ac6     $*     P0AC6 混合动力电池温度传感器 B 电路范围/性能
000ac7     $*     P0AC7 混合动力电池温度传感器 B 电路低
000ac8     $*     P0AC8 混合动力电池温度传感器 B 电路高
000ac9     $*     P0AC9 混合动力电池温度传感器 B 电路间歇故障/不稳定
000aca     $*     P0ACA 混合动力电池温度传感器 C 电路
000acb     $*     P0ACB 混合动力电池温度传感器 C 电路范围/性能
000acc     $*     P0ACC 混合动力电池温度传感器 C 电路低
000acd     $*     P0ACD 混合动力电池温度传感器 C 电路高
000ace     $*     P0ACE 混合动力电池温度传感器 C 电路间歇故障/不稳定
000acf     $*     P0ACF 混合动力电池组冷却风扇 3 控制电路
000ad0     $*     P0AD0 混合动力电池组冷却风扇 3 性能故障/卡在关闭位置
000ad1     $*     P0AD1 混合动力电池组冷却风扇 3 卡在接通位置
000ad2     $*     P0AD2 混合动力电池组冷却风扇 3 控制电路低
000ad3     $*     P0AD3 混合动力电池组冷却风扇 3 控制电路高
000ad4     $*     P0AD4 混合动力电池组气流系统气流不足
000ad5     $*     P0AD5 混合动力电池组气流阀 A 控制电路/开路
000ad6     $*     P0AD6 混合动力电池组气流阀 A 控制电路范围/性能
000ad7     $*     P0AD7 混合动力电池组气流阀 A 控制电路低
000ad8     $*     P0AD8 混合动力电池组气流阀 A 控制电路高
000ad9     $*     P0AD9 混合动力电池正极接触器控制电路/开路
000ada     $*     P0ADA 混合动力电池正极接触器控制电路范围/性能
000adb     $*     P0ADB 混合动力电池正极接触器控制电路低
000adc     $*     P0ADC 混合动力电池正极接触器控制电路高
000add     $*     P0ADD 混合动力电池负极接触器控制电路/开路
000ade     $*     P0ADE 混合动力电池负极接触器控制电路范围/性能
000adf     $*     P0ADF 混合动力电池负极接触器控制电路低
000aa0     $*     P0AA0 混合动力电池正极接触器电路
000aa1     $*     P0AA1 混合动力电池正极接触器电路卡在关闭位置
000aa2     $*     P0AA2 混合动力电池正极接触器电路卡在打开位置
000aa3     $*     P0AA3 混合动力电池负极接触器电路
000aa4     $*     P0AA4 混合动力电池负极接触器电路卡在关闭位置
000aa5     $*     P0AA5 混合动力电池负极接触器电路卡在打开位置
000aa6     $*     P0AA6 混合动力电池电压系统隔离故障
000aa7     $*     P0AA7 混合动力电池电压绝缘传感器电路
000aa8     $*     P0AA8 混合动力电池电压绝缘传感器电路范围/性能
000aa9     $*     P0AA9 混合动力电池电压绝缘传感器电路低
000aaa     $*     P0AAA 混合动力电池电压绝缘传感器电路高
000aab     $*     P0AAB 混合动力电池电压绝缘传感器电路间歇性故障/不稳定
000aac     $*     P0AAC 混合动力电池组空气温度传感器 A 电路
000aad     $*     P0AAD 混合动力电池组空气温度传感器 A 电路范围/性能
000aae     $*     P0AAE 混合动力电池组空气温度传感器 A 电路低
000aaf     $*     P0AAF 混合动力电池组空气温度传感器 A 电路高
000ab0     $*     P0AB0 混合动力电池组空气温度传感器 A 电路间歇性故障/不稳定
000ab1     $*     P0AB1 混合动力电池组空气温度传感器 B 电路
000ab2     $*     P0AB2 混合动力电池组空气温度传感器 B 电路范围/性能
000ab3     $*     P0AB3 混合动力电池组空气温度传感器 B 电路低
000ab4     $*     P0AB4 混合动力电池组空气温度传感器 B 电路高
000ab5     $*     P0AB5 混合动力电池组空气温度传感器 B 电路间歇性故障/不稳定
000ab6     $*     P0AB6 发动机支架 B 控制电路/开路
000ab7     $*     P0AB7 发动机支架 B 控制电路低
000ab8     $*     P0AB8 发动机支架 B 控制电路高
000ab9     $*     P0AB9 混合动力系统性能
000aba     $*     P0ABA 混合动力电池组电压感知电路
000abb     $*     P0ABB 混合动力电池组电压感知电路范围/性能
000abc     $*     P0ABC 混合动力电池组电压感知电路低
000abd     $*     P0ABD 混合动力电池组电压感知电路高
000abe     $*     P0ABE 混合动力电池组电压感知电路间歇故障/不稳定
000abf     $*     P0ABF 混合动力电池组电流传感器电路
000a80     $*     P0A80 更换混合动力电池组
000a81     $*     P0A81 混合动力电池组冷却风扇 1 控制电路/开路
000a82     $*     P0A82 混合动力电池组冷却风扇 1 性能或卡在关闭位置
000a83     $*     P0A83 混合动力电池组冷却风扇 1 卡在接通位置
000a84     $*     P0A84 混合动力电池组冷却风扇 1 控制电路低
000a85     $*     P0A85 混合动力电池组冷却风扇 1 控制电路高
000a86     $*     P0A86 14 伏电源模块电流传感器电路
000a87     $*     P0A87 14 伏电源模块电流传感器电路范围/性能
000a88     $*     P0A88 14 伏电源模块电流传感器电路低
000a89     $*     P0A89 14 伏电源模块电流传感器电路高
000a8a     $*     P0A8A 14 伏电源模块电流传感器电路间歇性故障
000a8b     $*     P0A8B 14 伏电源模块系统电压
000a8c     $*     P0A8C 14 伏电源模块系统电压不稳定
000a8d     $*     P0A8D 14 伏电源模块系统电压低
000a8e     $*     P0A8E 14 伏电源模块系统电压高
000a8f     $*     P0A8F 14 伏电源模块系统性能
000a90     $*     P0A90 驱动马达 A 性能
000a91     $*     P0A91 驱动马达 B 性能
000a92     $*     P0A92 混合动力发电机性能
000a93     $*     P0A93 逆变器冷却系统性能
000a94     $*     P0A94 直流/直流转换器性能
000a95     $*     P0A95 高电压保险丝
000a96     $*     P0A96 混合动力电池组冷却风扇 2 控制电路
000a97     $*     P0A97 混合动力电池组冷却风扇 2 性能或卡在关闭位置
000a98     $*     P0A98 混合动力电池组冷却风扇 2 卡在接通位置
000a99     $*     P0A99 混合动力电池组冷却风扇 2 控制电路低
000a9a     $*     P0A9A 混合动力电池组冷却风扇 2 控制电路高
000a9b     $*     P0A9B 混合动力电池温度传感器 A 电路
000a9c     $*     P0A9C 混合动力电池温度传感器 A 电路范围/性能
000a9d     $*     P0A9D 混合动力电池温度传感器 A 电路低
000a9e     $*     P0A9E 混合动力电池温度传感器 A 电路高
000a9f     $*     P0A9F 混合动力电池温度传感器 A 电路间歇性故障/不稳定
000a60     $*     P0A60 驱动马达 A 相位 V 电流
000a61     $*     P0A61 驱动马达 A 相位 V 电流低
000a62     $*     P0A62 驱动马达 A 相位 V 电流高
000a63     $*     P0A63 驱动马达 A 相位 W 电流
000a64     $*     P0A64 驱动马达 A 相位 W 电流低
000a65     $*     P0A65 驱动马达 A 相位 W 电流高
000a66     $*     P0A66 驱动马达 B 相位 U 电流
000a67     $*     P0A67 驱动马达 B 相位 U 电流低
000a68     $*     P0A68 驱动马达 B 相位 U 电流高
000a69     $*     P0A69 驱动马达 B 相位 V 电流
000a6a     $*     P0A6A 驱动马达 B 相位 V 电流低
000a6b     $*     P0A6B 驱动马达 B 相位 V 电流高
000a6c     $*     P0A6C 驱动马达 B 相位 W 电流
000a6d     $*     P0A6D 驱动马达 B 相位 W 电流低
000a6e     $*     P0A6E 驱动马达 B 相位 W 电流高
000a6f     $*     P0A6F 发电机相位 U 电流
000a70     $*     P0A70 发电机相位 U 电流低
000a71     $*     P0A71 发电机相位 U 电流高
000a72     $*     P0A72 发电机相位 V 电流
000a73     $*     P0A73 发电机相位 V 电流低
000a74     $*     P0A74 发电机相位 V 电流高
000a75     $*     P0A75 发电机相位 W 电流
000a76     $*     P0A76 发电机相位 W 电流低
000a77     $*     P0A77 发电机相位 W 电流高
000a78     $*     P0A78 驱动马达 A 逆变器性能
000a79     $*     P0A79 驱动马达 B 逆变器性能
000a7a     $*     P0A7A 发电机逆变器性能
000a7b     $*     P0A7B 电池能量控制模块请求故障指示灯照明
000a7c     $*     P0A7C 马达电子系统温度过高
000a7d     $*     P0A7D 混合动力电池组充电状态低
000a7e     $*     P0A7E 混合动力电池组温度过高
000a7f     $*     P0A7F 混合动力电池组恶化
000a40     $*     P0A40 驱动马达 A 位置传感器电路范围/性能
000a41     $*     P0A41 驱动马达 A 位置传感器电路低
000a42     $*     P0A42 驱动马达 A 位置传感器电路高
000a43     $*     P0A43 驱动马达 A 位置传感器电路间歇性故障
000a44     $*     P0A44 驱动马达 A 位置传感器电路超速
000a45     $*     P0A45 驱动马达 B 位置传感器电路
000a46     $*     P0A46 驱动马达 B 位置传感器电路范围/性能
000a47     $*     P0A47 驱动马达 B 位置传感器电路低
000a48     $*     P0A48 驱动马达 B 位置传感器电路高
000a49     $*     P0A49 驱动马达 B 位置传感器电路间歇性故障
000a4a     $*     P0A4A 驱动马达 B 位置传感器电路超速
000a4b     $*     P0A4B 发电机位置传感器电路
000a4c     $*     P0A4C 发电机位置传感器电路范围/性能
000a4d     $*     P0A4D 发电机位置传感器电路低
000a4e     $*     P0A4E 发电机位置传感器电路高
000a4f     $*     P0A4F 发电机位置传感器电路间歇性故障
000a50     $*     P0A50 发电机位置传感器电路超速
000a51     $*     P0A51 驱动马达 A 电流传感器电路
000a52     $*     P0A52 驱动马达 A 电流传感器电路范围/性能
000a53     $*     P0A53 驱动马达 A 电流传感器电路低
000a54     $*     P0A54 驱动马达 A 电流传感器电路高
000a55     $*     P0A55 驱动马达 B 电流传感器电路
000a56     $*     P0A56 驱动马达 B 电流传感器电路范围/性能
000a57     $*     P0A57 驱动马达 B 电流传感器电路低
000a58     $*     P0A58 驱动马达 B 电流传感器电路高
000a59     $*     P0A59 发电机电流传感器电路
000a5a     $*     P0A5A 发电机电流传感器电路范围/性能
000a5b     $*     P0A5B 发电机电流传感器电路低
000a5c     $*     P0A5C 发电机电流传感器电路高
000a5d     $*     P0A5D 驱动马达 A 相位 U 电流
000a5e     $*     P0A5E 驱动马达 A 相位 U 电流低
000a5f     $*     P0A5F 驱动马达 A 相位 U 电流高
000a20     $*     P0A20 马达扭矩传感器电路高
000a21     $*     P0A21 马达扭矩传感器电路间歇性故障
000a22     $*     P0A22 发电机扭矩传感器电路
000a23     $*     P0A23 发电机扭矩传感器电路范围/性能
000a24     $*     P0A24 发电机扭矩传感器电路低
000a25     $*     P0A25 发电机扭矩传感器电路高
000a26     $*     P0A26 发电机扭矩传感器电路间歇性故障
000a27     $*     P0A27 混合动力电池电源切断电路
000a28     $*     P0A28 混合动力电池电源切断电路低
000a29     $*     P0A29 混合动力电池电源切断电路高
000a2a     $*     P0A2A 驱动马达 A 温度传感器电路
000a2b     $*     P0A2B 驱动马达 A 温度传感器电路范围/性能
000a2c     $*     P0A2C 驱动马达 A 温度传感器电路低
000a2d     $*     P0A2D 驱动马达 A 温度传感器电路高
000a2e     $*     P0A2E 驱动马达 A 温度传感器电路间歇性故障
000a2f     $*     P0A2F 驱动马达 A 温度过高
000a30     $*     P0A30 驱动马达 B 温度传感器电路
000a31     $*     P0A31 驱动马达 B 温度传感器电路范围/性能
000a32     $*     P0A32 驱动马达 B 温度传感器电路低
000a33     $*     P0A33 驱动马达 B 温度传感器电路高
000a34     $*     P0A34 驱动马达 B 温度传感器电路间歇性故障
000a35     $*     P0A35 驱动马达 B 温度过高
000a36     $*     P0A36 发电机温度传感器电路
000a37     $*     P0A37 发电机温度传感器电路范围/性能
000a38     $*     P0A38 发电机温度传感器电路低
000a39     $*     P0A39 发电机温度传感器电路高
000a3a     $*     P0A3A 发电机温度传感器电路间歇性故障
000a3b     $*     P0A3B 发电机温度过高
000a3c     $*     P0A3C 驱动马达 A 逆变器温度过高
000a3d     $*     P0A3D 驱动马达 B 逆变器温度过高
000a3e     $*     P0A3E 发电机逆变器温度过高
000a3f     $*     P0A3F 驱动马达 A 位置传感器电路
000a00     $*     P0A00 马达电子系统冷却液温度传感器电路
000a01     $*     P0A01 马达电子系统冷却液温度传感器电路范围/性能
000a02     $*     P0A02 马达电子系统冷却液温度传感器电路低
000a03     $*     P0A03 马达电子系统冷却液温度传感器电路高
000a04     $*     P0A04 马达电子系统冷却液温度传感器电路间歇性故障
000a05     $*     P0A05 马达电子系统冷却液泵控制电路/开路
000a06     $*     P0A06 马达电子系统冷却液泵控制电路低
000a07     $*     P0A07 马达电子系统冷却液泵控制电路高
000a08     $*     P0A08 直流/直流电压转换器状态电路
000a09     $*     P0A09 直流/直流电压转换器状态电路低
000a0a     $*     P0A0A 高压系统互锁电路
000a0b     $*     P0A0B 高压系统互锁电路性能
000a0c     $*     P0A0C 高压系统互锁电路低
000a0d     $*     P0A0D 高压系统互锁电路高
000a0e     $*     P0A0E 高压系统互锁电路间歇性故障
000a0f     $*     P0A0F 发动机无法启动
000a10     $*     P0A10 直流/直流电压转换器状态电路高
000a11     $*     P0A11 直流/直流电压转换器启用电路/开路
000a12     $*     P0A12 直流/直流电压转换器启用电路低
000a13     $*     P0A13 直流/直流电压转换器启用电路高
000a14     $*     P0A14 发动机支架 A 控制电路/开路
000a15     $*     P0A15 发动机支架 A 控制电路低
000a16     $*     P0A16 发动机支架 A 控制电路高
000a17     $*     P0A17 马达扭矩传感器电路
000a18     $*     P0A18 马达扭矩传感器电路范围/性能
000a19     $*     P0A19 马达扭矩传感器电路低
000a1a     $*     P0A1A 发电机控制模块
000a1b     $*     P0A1B 驱动马达 A 控制模块
000a1c     $*     P0A1C 驱动马达 B 控制模块
000a1d     $*     P0A1D 混合动力总成控制模块
000a1e     $*     P0A1E 起动机/发电机控制模块
000a1f     $*     P0A1F 电池能量控制模块
000be0     $*     P0BE0 驱动马达逆变器温度传感器 'F' 电路
000be1     $*     P0BE1 驱动马达逆变器温度传感器 'F' 电路范围/性能
000be2     $*     P0BE2 驱动马达逆变器温度传感器 'F' 电路低
000be3     $*     P0BE3 驱动马达逆变器温度传感器 'F' 电路高
000be4     $*     P0BE4 驱动马达逆变器温度传感器 'F' 电路间歇故障/不稳定
000be5     $*     P0BE5 驱动马达 'A' 相位 U 电流传感器电路
000be6     $*     P0BE6 驱动马达 'A' 相位 U 电流传感器电路范围/性能
000be7     $*     P0BE7 驱动马达 'A' 相位 U 电流传感器电路低
000be8     $*     P0BE8 驱动马达 'A' 相位 U 电流传感器电路高
000be9     $*     P0BE9 驱动马达 'A' 相位 V 电流传感器电路
000bea     $*     P0BEA 驱动马达 'A' 相位 V 电流传感器电路范围/性能
000beb     $*     P0BEB 驱动马达 'A' 相位 V 电流传感器电路低
000bec     $*     P0BEC 驱动马达 'A' 相位 V 电流传感器电路高
000bed     $*     P0BED 驱动马达 'A' 相位 W 电流传感器电路
000bee     $*     P0BEE 驱动马达 'A' 相位 W 电流传感器电路范围/性能
000bef     $*     P0BEF 驱动马达 'A' 相位 W 电流传感器电路低
000bf0     $*     P0BF0 驱动马达 'A' 相位 W 电流传感器电路高
000bf1     $*     P0BF1 驱动马达 'B' 相位 U 电流传感器电路
000bf2     $*     P0BF2 驱动马达 'B' 相位 U 电流传感器电路范围/性能
000bf3     $*     P0BF3 驱动马达 'B' 相位 U 电流传感器电路低
000bf4     $*     P0BF4 驱动马达 'B' 相位 U 电流传感器电路高
000bf5     $*     P0BF5 驱动马达 'B' 相位 V 电流传感器电路
000bf6     $*     P0BF6 驱动马达 'B' 相位 V 电流传感器电路范围/性能
000bf7     $*     P0BF7 驱动马达 'B' 相位 V 电流传感器电路低
000bf8     $*     P0BF8 驱动马达 'B' 相位 V 电流传感器电路高
000bf9     $*     P0BF9 驱动马达 'B' 相位 W 电流传感器电路
000bfa     $*     P0BFA 驱动马达 'B' 相位 W 电流传感器电路范围/性能
000bfb     $*     P0BFB 驱动马达 'B' 相位 W 电流传感器电路低
000bfc     $*     P0BFC 驱动马达 'B' 相位 W 电流传感器电路高
000bfd     $*     P0BFD 驱动马达 'A' 相位 U - V - W电流传感器相关性
000bfe     $*     P0BFE 驱动马达 'B' 相位 U - V - W电流传感器相关性
000bff     $*     P0BFF 驱动马达 'A' 电流
000bc0     $*     P0BC0 混合动力电池组冷却风扇供应电压电路低
000bc1     $*     P0BC1 混合动力电池组冷却风扇供应电压电路高
000bc2     $*     P0BC2 混合动力电池温度传感器 'E' 电路
000bc3     $*     P0BC3 混合动力电池温度传感器 'E' 电路范围/性能
000bc4     $*     P0BC4 混合动力电池温度传感器 'E' 电路低
000bc5     $*     P0BC5 混合动力电池温度传感器 'E' 电路高
000bc6     $*     P0BC6 混合动力电池温度传感器 'E' 电路间歇故障/不稳定
000bc7     $*     P0BC7 混合动力电池组冷却风扇感知电路/开路
000bc8     $*     P0BC8 混合动力电池组冷却风扇感知电路范围/性能
000bc9     $*     P0BC9 混合动力电池组冷却风扇感知电路低
000bca     $*     P0BCA 混合动力电池组冷却风扇感知电路高
000bcb     $*     P0BCB 混合动力电池组冷却风扇感知电路间歇性故障/不稳定
000bcc     $*     P0BCC 发电机逆变器温度传感器电路
000bcd     $*     P0BCD 发电机逆变器温度传感器电路范围/性能
000bce     $*     P0BCE 发电机逆变器温度传感器电路低
000bcf     $*     P0BCF 发电机逆变器温度传感器电路高
000bd0     $*     P0BD0 发电机逆变器温度传感器电路间歇性故障/不稳定
000bd1     $*     P0BD1 驱动马达逆变器温度传感器 'C' 电路
000bd2     $*     P0BD2 驱动马达逆变器温度传感器 'C' 电路范围/性能
000bd3     $*     P0BD3 驱动马达逆变器温度传感器 'C' 电路低
000bd4     $*     P0BD4 驱动马达逆变器温度传感器 'C' 电路高
000bd5     $*     P0BD5 驱动马达逆变器温度传感器 'C' 电路间歇故障/不稳定
000bd6     $*     P0BD6 驱动马达逆变器温度传感器 'D' 电路
000bd7     $*     P0BD7 驱动马达逆变器温度传感器 'D' 电路范围/性能
000bd8     $*     P0BD8 驱动马达逆变器温度传感器 'D' 电路低
000bd9     $*     P0BD9 驱动马达逆变器温度传感器 'D' 电路高
000bda     $*     P0BDA 驱动马达逆变器温度传感器 'D' 电路间歇故障/不稳定
000bdb     $*     P0BDB 驱动马达逆变器温度传感器 'E' 电路
000bdc     $*     P0BDC 驱动马达逆变器温度传感器 'E' 电路范围/性能
000bdd     $*     P0BDD 驱动马达逆变器温度传感器 'E' 电路低
000bde     $*     P0BDE 驱动马达逆变器温度传感器 'E' 电路高
000bdf     $*     P0BDF 驱动马达逆变器温度传感器 'E' 电路间歇故障/不稳定
000ba0     $*     P0BA0 混合动力电池电压传感器 'U' 电路范围/性能
000ba1     $*     P0BA1 混合动力电池电压传感器 'U' 电路低
000ba2     $*     P0BA2 混合动力电池电压传感器 'U' 电路高
000ba3     $*     P0BA3 混合动力电池电压传感器 'U' 电路间歇故障/不稳定
000ba4     $*     P0BA4 混合动力电池电压传感器 'V' 电路
000ba5     $*     P0BA5 混合动力电池电压传感器 'V' 电路范围/性能
000ba6     $*     P0BA6 混合动力电池电压传感器 'V' 电路低
000ba7     $*     P0BA7 混合动力电池电压传感器 'V' 电路高
000ba8     $*     P0BA8 混合动力电池电压传感器 'V' 电路间歇故障/不稳定
000ba9     $*     P0BA9 混合动力电池电压传感器 'W' 电路
000baa     $*     P0BAA 混合动力电池电压传感器 'W' 电路范围/性能
000bab     $*     P0BAB 混合动力电池电压传感器 'W' 电路低
000bac     $*     P0BAC 混合动力电池电压传感器 'W' 电路高
000bad     $*     P0BAD 混合动力电池电压传感器 'W' 电路间歇故障/不稳定
000bae     $*     P0BAE 混合动力电池电压传感器 'X' 电路
000baf     $*     P0BAF 混合动力电池电压传感器 'X' 电路范围/性能
000bb0     $*     P0BB0 混合动力电池电压传感器 'X' 电路低
000bb1     $*     P0BB1 混合动力电池电压传感器 'X' 电路高
000bb2     $*     P0BB2 混合动力电池电压传感器 'X' 电路间歇故障/不稳定
000bb3     $*     P0BB3 混合动力电池电压传感器 'Y' 电路
000bb4     $*     P0BB4 混合动力电池电压传感器 'Y' 电路范围/性能
000bb5     $*     P0BB5 混合动力电池电压传感器 'Y' 电路低
000bb6     $*     P0BB6 混合动力电池电压传感器 'Y' 电路高
000bb7     $*     P0BB7 混合动力电池电压传感器 'Y' 电路间歇故障/不稳定
000bb8     $*     P0BB8 混合动力电池电压传感器 'Z' 电路
000bb9     $*     P0BB9 混合动力电池电压传感器 'Z' 电路范围/性能
000bba     $*     P0BBA 混合动力电池电压传感器 'Z' 电路低
000bbb     $*     P0BBB 混合动力电池电压传感器 'Z' 电路高
000bbc     $*     P0BBC 混合动力电池电压传感器 'Z' 电路间歇故障/不稳定
000bbd     $*     P0BBD 混合动力电池组电压变化超过极限
000bbe     $*     P0BBE 混合动力电池组电压变化
000bbf     $*     P0BBF 混合动力电池组冷却风扇供应电压电路/开路
000b80     $*     P0B80 混合动力电池电压传感器 'N' 电路间歇故障/不稳定
000b81     $*     P0B81 混合动力电池电压传感器 'O' 电路
000b82     $*     P0B82 混合动力电池电压传感器 'O' 电路范围/性能
000b83     $*     P0B83 混合动力电池电压传感器 'O' 电路低
000b84     $*     P0B84 混合动力电池电压传感器 'O' 电路高
000b85     $*     P0B85 混合动力电池电压传感器 'O' 电路间歇故障/不稳定
000b86     $*     P0B86 混合动力电池电压传感器 'P' 电路
000b87     $*     P0B87 混合动力电池电压传感器 'P' 电路范围/性能
000b88     $*     P0B88 混合动力电池电压传感器 'P' 电路低
000b89     $*     P0B89 混合动力电池电压传感器 'P' 电路高
000b8a     $*     P0B8A 混合动力电池电压传感器 'P' 电路间歇故障/不稳定
000b8b     $*     P0B8B 混合动力电池电压传感器 'Q' 电路
000b8c     $*     P0B8C 混合动力电池电压传感器 'Q' 电路范围/性能
000b8d     $*     P0B8D 混合动力电池电压传感器 'Q' 电路低
000b8e     $*     P0B8E 混合动力电池电压传感器 'Q' 电路高
000b8f     $*     P0B8F 混合动力电池电压传感器 'Q' 电路间歇故障/不稳定
000b90     $*     P0B90 混合动力电池电压传感器 'R' 电路
000b91     $*     P0B91 混合动力电池电压传感器 'R' 电路范围/性能
000b92     $*     P0B92 混合动力电池电压传感器 'R' 电路低
000b93     $*     P0B93 混合动力电池电压传感器 'R' 电路高
000b94     $*     P0B94 混合动力电池电压传感器 'R' 电路间歇故障/不稳定
000b95     $*     P0B95 混合动力电池电压传感器 'S' 电路
000b96     $*     P0B96 混合动力电池电压传感器 'S' 电路范围/性能
000b97     $*     P0B97 混合动力电池电压传感器 'S' 电路低
000b98     $*     P0B98 混合动力电池电压传感器 'S' 电路高
000b99     $*     P0B99 混合动力电池电压传感器 'S' 电路间歇故障/不稳定
000b9a     $*     P0B9A 混合动力电池电压传感器 'T' 电路
000b9b     $*     P0B9B 混合动力电池电压传感器 'T' 电路范围/性能
000b9c     $*     P0B9C 混合动力电池电压传感器 'T' 电路低
000b9d     $*     P0B9D 混合动力电池电压传感器 'T' 电路高
000b9e     $*     P0B9E 混合动力电池电压传感器 'T' 电路间歇故障/不稳定
000b9f     $*     P0B9F 混合动力电池电压传感器 'U' 电路
000b60     $*     P0B60 混合动力电池电压传感器 'H' 电路电压低
000b61     $*     P0B61 混合动力电池电压传感器 'H' 电路高
000b62     $*     P0B62 混合动力电池电压传感器 'H' 电路间歇故障/不稳定
000b63     $*     P0B63 混合动力电池电压传感器 'I' 电路
000b64     $*     P0B64 混合动力电池电压传感器 'I' 电路范围/性能
000b65     $*     P0B65 混合动力电池电压传感器 'I' 电路低
000b66     $*     P0B66 混合动力电池电压传感器 'I' 电路高
000b67     $*     P0B67 混合动力电池电压传感器 'I' 电路间歇故障/不稳定
000b68     $*     P0B68 混合动力电池电压传感器 'J' 电路
000b69     $*     P0B69 混合动力电池电压传感器 'J' 电路范围/性能
000b6a     $*     P0B6A 混合动力电池电压传感器 'J' 电路低
000b6b     $*     P0B6B 混合动力电池电压传感器 'J' 电路高
000b6c     $*     P0B6C 混合动力电池电压传感器 'J' 电路间歇故障/不稳定
000b6d     $*     P0B6D 混合动力电池电压传感器 'K' 电路
000b6e     $*     P0B6E 混合动力电池电压传感器 'K' 电路范围/性能
000b6f     $*     P0B6F 混合动力电池电压传感器 'K' 电路低
000b70     $*     P0B70 混合动力电池电压传感器 'K' 电路高
000b71     $*     P0B71 混合动力电池电压传感器 'K' 电路间歇故障/不稳定
000b72     $*     P0B72 混合动力电池电压传感器 'L' 电路
000b73     $*     P0B73 混合动力电池电压传感器 'L' 电路范围/性能
000b74     $*     P0B74 混合动力电池电压传感器 'L' 电路低
000b75     $*     P0B75 混合动力电池电压传感器 'L' 电路高
000b76     $*     P0B76 混合动力电池电压传感器 'L' 电路间歇故障/不稳定
000b77     $*     P0B77 混合动力电池电压传感器 'M' 电路
000b78     $*     P0B78 混合动力电池电压传感器 'M' 电路范围/性能
000b79     $*     P0B79 混合动力电池电压传感器 'M' 电路低
000b7a     $*     P0B7A 混合动力电池电压传感器 'M' 电路高
000b7b     $*     P0B7B 混合动力电池电压传感器 'M' 电路间歇故障/不稳定
000b7c     $*     P0B7C 混合动力电池电压传感器 'N' 电路
000b7d     $*     P0B7D 混合动力电池电压传感器 'N' 电路范围/性能
000b7e     $*     P0B7E 混合动力电池电压传感器 'N' 电路低
000b7f     $*     P0B7F 混合动力电池电压传感器 'N' 电路高
000b40     $*     P0B40 混合动力电池电压传感器 'B' 电路
000b41     $*     P0B41 混合动力电池电压传感器 'B' 电路范围/性能
000b42     $*     P0B42 混合动力电池电压传感器 'B' 电路低
000b43     $*     P0B43 混合动力电池电压传感器 'B' 电路高
000b44     $*     P0B44 混合动力电池电压传感器 'B' 电路间歇故障/不稳定
000b45     $*     P0B45 混合动力电池电压传感器 'C' 电路
000b46     $*     P0B46 混合动力电池电压传感器 'C' 电路范围/性能
000b47     $*     P0B47 混合动力电池电压传感器 'C' 电路低
000b48     $*     P0B48 混合动力电池电压传感器 'C' 电路高
000b49     $*     P0B49 混合动力电池电压传感器 'C' 电路间歇故障/不稳定
000b4a     $*     P0B4A 混合动力电池电压传感器 'D' 电路
000b4b     $*     P0B4B 混合动力电池电压传感器 'D' 电路范围/性能
000b4c     $*     P0B4C 混合动力电池电压传感器 'D' 电路低
000b4d     $*     P0B4D 混合动力电池电压传感器 'D' 电路高
000b4e     $*     P0B4E 混合动力电池电压传感器 'D' 电路间歇故障/不稳定
000b4f     $*     P0B4F 混合动力电池电压传感器 'E' 电路
000b50     $*     P0B50 混合动力电池电压传感器 'E' 电路范围/性能
000b51     $*     P0B51 混合动力电池电压传感器 'E' 电路低
000b52     $*     P0B52 混合动力电池电压传感器 'E' 电路高
000b53     $*     P0B53 混合动力电池电压传感器 'E' 电路间歇故障/不稳定
000b54     $*     P0B54 混合动力电池电压传感器 'F' 电路
000b55     $*     P0B55 混合动力电池电压传感器 'F' 电路范围/性能
000b56     $*     P0B56 混合动力电池电压传感器 'F' 电路低
000b57     $*     P0B57 混合动力电池电压传感器 'F' 电路高
000b58     $*     P0B58 混合动力电池电压传感器 'F' 电路间歇故障/不稳定
000b59     $*     P0B59 混合动力电池电压传感器 'G' 电路
000b5a     $*     P0B5A 混合动力电池电压传感器 'G' 电路范围/性能
000b5b     $*     P0B5B 混合动力电池电压传感器 'G' 电路低
000b5c     $*     P0B5C 混合动力电池电压传感器 'G' 电路高
000b5d     $*     P0B5D 混合动力电池电压传感器 'G' 电路间歇故障/不稳定
000b5e     $*     P0B5E 混合动力电池电压传感器 'H' 电路
000b5f     $*     P0B5F 混合动力电池电压传感器 'H' 电路范围/性能
000b20     $*     P0B20 混合动力电池组电压传感器 'D' 电路低
000b21     $*     P0B21 混合动力电池组电压传感器 'D' 电路高
000b22     $*     P0B22 混合动力电池组电压传感器 'D' 电路间歇故障/不稳定
000b23     $*     P0B23 混合动力电池 'A' 电压
000b24     $*     P0B24 混合动力电池 'A' 电压不稳定
000b25     $*     P0B25 混合动力电池 'A' 电压低
000b26     $*     P0B26 混合动力电池 'A' 电压高
000b27     $*     P0B27 混合动力电池 'B' 电压
000b28     $*     P0B28 混合动力电池 'B' 电压不稳定
000b29     $*     P0B29 混合动力电池 'B' 电压低
000b2a     $*     P0B2A 混合动力电池 'B' 电压高
000b2b     $*     P0B2B 混合动力电池 'C' 电压
000b2c     $*     P0B2C 混合动力电池 'C' 电压不稳定
000b2d     $*     P0B2D 混合动力电池 'C' 电压低
000b2e     $*     P0B2E 混合动力电池 'C' 电压高
000b2f     $*     P0B2F 混合动力电池 'D' 电压
000b30     $*     P0B30 混合动力电池 'D' 电压不稳定
000b31     $*     P0B31 混合动力电池 'D' 电压低
000b32     $*     P0B32 混合动力电池 'D' 电压高
000b33     $*     P0B33 高压服务断开电路
000b34     $*     P0B34 高压服务断开电路性能故障
000b35     $*     P0B35 高压服务断开电路低
000b36     $*     P0B36 高压服务断开电路高
000b37     $*     P0B37 高压服务断开电路开路
000b38     $*     P0B38 马达电子冷却液泵 'B' 控制电路/开路
000b39     $*     P0B39 马达电子冷却液泵 'B' 控制电路低
000b3a     $*     P0B3A 马达电子冷却液泵 'B' 控制电路高
000b3b     $*     P0B3B 混合动力电池电压传感器 'A' 电路
000b3c     $*     P0B3C 混合动力电池电压传感器 'A' 电路范围/性能
000b3d     $*     P0B3D 混合动力电池电压传感器 'A' 电路低
000b3e     $*     P0B3E 混合动力电池电压传感器 'A' 电路高
000b3f     $*     P0B3F 混合动力电池电压传感器 'A' 电路间歇故障/不稳定
000b00     $*     P0B00 辅助变速器液泵马达相位 U 电流
000b01     $*     P0B01 辅助变速器液泵马达相位 U 电流低
000b02     $*     P0B02 辅助变速器液泵马达相位 U 电流高
000b03     $*     P0B03 辅助变速器液泵马达相位 V 电流
000b04     $*     P0B04 辅助变速器液泵马达相位 V 电流低
000b05     $*     P0B05 辅助变速器液泵马达相位 V 电流高
000b06     $*     P0B06 辅助变速器液泵马达相位 W 电流
000b07     $*     P0B07 辅助变速器液泵马达相位 W 电流低
000b08     $*     P0B08 辅助变速器液泵马达相位 W 电流高
000b09     $*     P0B09 辅助变速器液泵马达电源电压电路/开路
000b0a     $*     P0B0A 辅助变速器液泵马达电源电压电路低
000b0b     $*     P0B0B 辅助变速器液泵马达电源电压电路高
000b0c     $*     P0B0C 辅助变速器液泵液压泄漏
000b0d     $*     P0B0D 辅助变速器液泵马达控制模块
000b0e     $*     P0B0E 混合动力电池组电流传感器 'B' 电路
000b0f     $*     P0B0F 混合动力电池组电流传感器 'B' 电路范围/性能
000b10     $*     P0B10 混合动力电池组电流传感器 'B' 电路低
000b11     $*     P0B11 混合动力电池组电流传感器 'B' 电路高
000b12     $*     P0B12 混合动力电池组电流传感器 'B' 电路间歇故障
000b13     $*     P0B13 混合动力电池组电流传感器 'A'/'B' 相关性
000b14     $*     P0B14 混合动力电池组电压传感器 'B' 电路
000b15     $*     P0B15 混合动力电池组电压传感器 'B' 电路范围/性能
000b16     $*     P0B16 混合动力电池组电压传感器 'B' 电路低
000b17     $*     P0B17 混合动力电池组电压传感器 'B' 电路高
000b18     $*     P0B18 混合动力电池组电压传感器 'B' 电路间歇故障/不稳定
000b19     $*     P0B19 混合动力电池组电压传感器 'C' 电路
000b1a     $*     P0B1A 混合动力电池组电压传感器 'C' 电路范围/性能
000b1b     $*     P0B1B 混合动力电池组电压传感器 'C' 电路低
000b1c     $*     P0B1C 混合动力电池组电压传感器 'C' 电路高
000b1d     $*     P0B1D 混合动力电池组电压传感器 'C' 电路间歇故障/不稳定
000b1e     $*     P0B1E 混合动力电池组电压传感器 'D' 电路
000b1f     $*     P0B1F 混合动力电池组电压传感器 'D' 电路范围/性能
000880     $*     P0880 变速箱控制模块电源输入信号
000881     $*     P0881 变速箱控制模块电源输入信号范围/性能
000882     $*     P0882 变速箱控制模块电源输入信号低
000883     $*     P0883 变速箱控制模块电源输入信号高
000884     $*     P0884 变速箱控制模块电源输入信号间歇性故障
000885     $*     P0885 变速箱控制模块电源继电器控制电路/开路
000886     $*     P0886 变速箱控制模块电源继电器控制电路低
000887     $*     P0887 变速箱控制模块电源继电器控制电路高
000888     $*     P0888 变速箱控制模块电源继电器感应电路
000889     $*     P0889 变速箱控制模块电源继电器感应电路范围/性能
00088a     $*     P088A 传动液滤清器磨损
00088b     $*     P088B 传动液滤清器严重磨损
000890     $*     P0890 变速箱控制模块电源继电器感应电路低
000891     $*     P0891 变速箱控制模块电源继电器感应电路高
000892     $*     P0892 变速箱控制模块电源继电器感应电路间歇性故障
000893     $*     P0893 多个齿轮啮合
000894     $*     P0894 变速器部件打滑
000895     $*     P0895 换档时间过短
000896     $*     P0896 换档时间过长
000897     $*     P0897 传动液劣化
000898     $*     P0898 变速箱控制系统故障指示灯请求电路低
000899     $*     P0899 变速箱控制系统故障指示灯请求电路高
000860     $*     P0860 换挡模块 A 通信电路
000861     $*     P0861 换挡模块 A 通信电路低
000862     $*     P0862 换挡模块 A 通信电路高
000863     $*     P0863 变速箱控制模块通信电路
000864     $*     P0864 变速箱控制模块通信电路范围/性能
000865     $*     P0865 变速箱控制模块通信电路低
000866     $*     P0866 变速箱控制模块通信电路高
000867     $*     P0867 传动液压力
000868     $*     P0868 传动液压力低
000869     $*     P0869 传动液压力高
000870     $*     P0870 传动液压力传感器/开关 C 电路
000871     $*     P0871 传动液压力传感器/开关 C 电路范围/性能
000872     $*     P0872 传动液压力传感器/开关 C 电路低
000873     $*     P0873 传动液压力传感器/开关 C 电路高
000874     $*     P0874 传动液压力传感器/开关 C 电路间歇性故障
000875     $*     P0875 传动液压力传感器/开关 D 电路
000876     $*     P0876 传动液压力传感器/开关 D 电路范围/性能
000877     $*     P0877 传动液压力传感器/开关 D 电路低
000878     $*     P0878 传动液压力传感器/开关 D 电路高
000879     $*     P0879 传动液压力传感器/开关 D 电路间歇性故障
000840     $*     P0840 传动液压力传感器/开关 A 电路
000841     $*     P0841 传动液压力传感器/开关 A 电路范围/性能
000842     $*     P0842 传动液压力传感器/开关 A 电路低
000843     $*     P0843 传动液压力传感器/开关 A 电路高
000844     $*     P0844 传动液压力传感器/开关 A 电路间歇性故障
000845     $*     P0845 传动液压力传感器/开关 B 电路
000846     $*     P0846 传动液压力传感器/开关 B 电路范围/性能
000847     $*     P0847 传动液压力传感器/开关 B 电路低
000848     $*     P0848 传动液压力传感器/开关 B 电路高
000849     $*     P0849 传动液压力传感器/开关 B 电路间歇性故障
00084a     $*     P084A 传动机液压力传感器/开关 H 电路
00084b     $*     P084B 传动机液压力传感器/开关 H 电路范围/性能
00084c     $*     P084C 传动液压力传感器/开关 H 电路低
00084d     $*     P084D 传动液压力传感器/开关 H 电路高
00084e     $*     P084E 传动液压力传感器/开关 H 电路间歇性故障
00084f     $*     P084F 驻车/空档开关输出电路
000850     $*     P0850 驻车/空档开关输入电路
000851     $*     P0851 驻车/空档开关输入电路低
000852     $*     P0852 驻车/空档开关输入电路高
000853     $*     P0853 驱动开关输入电路
000854     $*     P0854 驱动开关输入电路低
000855     $*     P0855 行驶开关输入电路高
000856     $*     P0856 牵引力控制输入信号
000857     $*     P0857 牵引力控制输入信号范围/性能
000858     $*     P0858 牵引力控制输入信号低
000859     $*     P0859 牵引力控制输入信号高
00085a     $*     P085A 换挡模块 B 通信电路
00085b     $*     P085B 换挡模块 B 通信电路低
00085c     $*     P085C 换挡模块 B 通信电路高
00085d     $*     P085D 换挡控制模块 'A' 性能
00085e     $*     P085E 换挡控制模块 'B' 性能
000820     $*     P0820 换档杆 X - Y 位置传感器电路
000821     $*     P0821 换档杆 X 位置电路
000822     $*     P0822 换档杆 Y 位置电路
000823     $*     P0823 换档杆 X 位置电路间歇性故障
000824     $*     P0824 换档杆 Y 位置电路间歇性故障
000825     $*     P0825 换档杆推/拉开关 (换挡预测)
000826     $*     P0826 升挡及降挡开关电路
000827     $*     P0827 升挡及降挡开关电路低
000828     $*     P0828 升挡及降挡开关电路高
000829     $*     P0829 5 - 6 换档
00082a     $*     P082A 换挡杆 X 位置电路范围/性能
00082b     $*     P082B 换挡杆 X 位置电路低
00082c     $*     P082C 换挡杆 X 位置电路高
00082d     $*     P082D 换挡杆 Y 位置电路范围/性能
00082e     $*     P082E 换挡杆 Y 位置电路低
00082f     $*     P082F 换挡杆 Y 位置电路高
000830     $*     P0830 离合器踏板开关 A 电路
000831     $*     P0831 离合器踏板开关 A 电路低
000832     $*     P0832 离合器踏板开关 A 电路高
000833     $*     P0833 离合器踏板开关 B 电路
000834     $*     P0834 离合器踏板开关 B 电路低
000835     $*     P0835 离合器踏板开关 B 电路高
000836     $*     P0836 四轮驱动 (4WD) 开关电路
000837     $*     P0837 四轮驱动 (4WD) 开关电路范围/性能
000838     $*     P0838 四轮驱动 (4WD) 开关电路低
000839     $*     P0839 四轮驱动 (4WD) 开关电路高
00083a     $*     P083A 传动液压力传感器/开关 G 电路
00083b     $*     P083B 传动液压力传感器/开关 G 电路范围/性能
00083c     $*     P083C 传动液压力传感器/开关 G 电路低
00083d     $*     P083D 传动液压力传感器/开关 G 电路高
00083e     $*     P083E 传动液压力传感器/开关 G 电路间歇性故障
00083f     $*     P083F 离合器踏板开关 A/B 相互关系
000800     $*     P0800 分动箱控制系统 (故障指示灯请求)
000801     $*     P0801 倒车抑制控制电路
000802     $*     P0802 变速器控制系统故障指示灯请求电路/开路
000803     $*     P0803 升档/跳档电磁阀控制电路
000804     $*     P0804 升档/跳档指示灯控制电路
000805     $*     P0805 离合器位置传感器电路
000806     $*     P0806 离合器位置传感器电路范围/性能
000807     $*     P0807 离合器位置传感器电路偏低
000808     $*     P0808 离合器位置传感器电路高
000809     $*     P0809 离合器位置传感器电路间歇性故障
00080a     $*     P080A 离合器位置未学习
00080b     $*     P080B 升档/跳档电磁阀控制电路范围/性能
00080c     $*     P080C 升档/跳档电磁阀控制电路低
00080d     $*     P080D 升档/跳档电磁阀控制电路高
000810     $*     P0810 离合器位置控制错误
000811     $*     P0811 离合器 A 过度打滑
000812     $*     P0812 倒车输入电路
000813     $*     P0813 倒车输出电路
000814     $*     P0814 变速范围显示电路
000815     $*     P0815 升挡开关电路
000816     $*     P0816 降挡开关电路
000817     $*     P0817 起动器禁用电路/开路
000818     $*     P0818 传动系断开开关输入电路
000819     $*     P0819 升挡及降挡开关与变速箱范围信号关系
00081a     $*     P081A 起动器禁用电路低
00081b     $*     P081B 起动器禁用电路高
00081c     $*     P081C 驻车输入电路
00081d     $*     P081D 空档输入电路
00081e     $*     P081E 离合器 B 过度打滑
000980     $*     P0980 换档电磁阀 C 控制电路高
000981     $*     P0981 换档电磁阀 D 控制电路范围/性能
000982     $*     P0982 换档电磁阀 D 控制电路低
000983     $*     P0983 换档电磁阀 D 控制电路高
000984     $*     P0984 换档电磁阀 E 控制电路范围/性能
000985     $*     P0985 换档电磁阀 E 控制电路低
000986     $*     P0986 换档电磁阀 E 控制电路高
000987     $*     P0987 变速器液压传感器/开关 E 电路
000988     $*     P0988 变速器液压传感器/开关 E 电路范围/性能
000989     $*     P0989 变速器液压传感器/开关 E 电路低
000990     $*     P0990 变速器液压传感器/开关 E 电路高
000991     $*     P0991 变速器液压传感器/开关 E 电路间歇性故障
000992     $*     P0992 变速器液压传感器/开关 F 电路
000993     $*     P0993 变速器液压传感器/开关 F 电路范围/性能
000994     $*     P0994 变速器液压传感器/开关 F 电路低
000995     $*     P0995 变速器液压传感器/开关 F 电路高
000996     $*     P0996 变速器液压传感器/开关 F 电路间歇性故障
000997     $*     P0997 换档电磁阀 F 控制电路范围/性能
000998     $*     P0998 换档电磁阀 F 控制电路低
000999     $*     P0999 换档电磁阀 F 控制电路高
00099a     $*     P099A 换档电磁阀 G 控制电路范围/性能
00099b     $*     P099B 换档电磁阀 G 控制电路低
00099c     $*     P099C 换档电磁阀 G 控制电路高
00099d     $*     P099D 换档电磁阀 H 控制电路范围/性能
00099e     $*     P099E 换档电磁阀 H 控制电路低
00099f     $*     P099F 换档电磁阀 H 控制电路高
000960     $*     P0960 压力控制电磁阀 A 控制电路/开路
000961     $*     P0961 压力控制电磁阀 A 控制电路范围/性能
000962     $*     P0962 压力控制电磁阀 A 控制电路低
000963     $*     P0963 压力控制电磁阀 A 控制电路高
000964     $*     P0964 压力控制电磁阀 B 控制电路/开路
000965     $*     P0965 压力控制电磁阀 B 控制电路范围/性能
000966     $*     P0966 压力控制电磁阀 B 控制电路低
000967     $*     P0967 压力控制电磁阀 B 控制电路高
000968     $*     P0968 压力控制电磁阀 C 控制电路/开路
000969     $*     P0969 压力控制电磁阀 C 控制电路范围/性能
000970     $*     P0970 压力控制电磁阀 C 控制电路低
000971     $*     P0971 压力控制电磁阀 C 控制电路高
000972     $*     P0972 换档电磁阀 A 控制电路范围/性能
000973     $*     P0973 换档电磁阀 A 控制电路低
000974     $*     P0974 换档电磁阀 A 控制电路高
000975     $*     P0975 换档电磁阀 B 控制电路范围/性能
000976     $*     P0976 换档电磁阀 B 控制电路低
000977     $*     P0977 换档电磁阀 B 控制电路高
000978     $*     P0978 换档电磁阀 C 控制电路范围/性能
000979     $*     P0979 换档电磁阀 C 控制电路低
000940     $*     P0940 液压机油温度传感器电路高
000941     $*     P0941 液压机油温度传感器电路间歇性故障
000942     $*     P0942 液压装置
000943     $*     P0943 液压单元循环周期过短
000944     $*     P0944 液压单元压力损失
000945     $*     P0945 液压泵继电器电路/开路
000946     $*     P0946 液压泵继电器电路范围/性能
000947     $*     P0947 液压泵继电器电路低
000948     $*     P0948 液压泵继电器电路高
000949     $*     P0949 自动换档手动自适应学习未完成
000950     $*     P0950 自动换档手动控制电路
000951     $*     P0951 自动换档手动控制电路范围/性能
000952     $*     P0952 自动换档手动控制电路低
000953     $*     P0953 自动换档手动控制电路高
000954     $*     P0954 自动换档手动控制电路间歇性故障
000955     $*     P0955 自动换档手动模式电路
000956     $*     P0956 自动换档手动模式电路范围/性能
000957     $*     P0957 自动换档手动模式电路低
000958     $*     P0958 自动换档手动模式电路高
000959     $*     P0959 自动换档手动模式电路间歇性故障
000920     $*     P0920 换挡前推执行器电路/开路
000921     $*     P0921 换挡前推执行器电路范围/性能
000922     $*     P0922 换挡前推执行器电路低
000923     $*     P0923 换挡前推执行器电路高
000924     $*     P0924 换挡后拉执行器电路/开路
000925     $*     P0925 换挡后拉执行器电路范围/性能
000926     $*     P0926 换挡后拉执行器电路低
000927     $*     P0927 换挡后拉执行器电路高
000928     $*     P0928 换档锁止电磁阀控制电路/开路
000929     $*     P0929 换档锁止电磁阀控制电路范围/性能
00092a     $*     P092A 换挡锁止电磁阀/执行器控制 'B'/开路
00092b     $*     P092B 换挡锁定电磁阀/执行器控制电路 'B' 范围/性能
00092c     $*     P092C 换挡锁定电磁阀/执行器控制电路 'B' 低
00092d     $*     P092D 换挡锁定电磁阀/执行器控制电路 'B' 高
000930     $*     P0930 换档锁止电磁阀控制电路低
000931     $*     P0931 换档锁止电磁阀控制电路高
000932     $*     P0932 液压传感器电路
000933     $*     P0933 液压传感器范围/性能
000934     $*     P0934 液压传感器电路低
000935     $*     P0935 液压传感器电路高
000936     $*     P0936 液压传感器电路间歇性故障
000937     $*     P0937 液压机油温度传感器电路
000938     $*     P0938 液压机油温度传感器范围/性能
000939     $*     P0939 液压机油温度传感器电路低
000900     $*     P0900 离合器执行器电路/开路
000901     $*     P0901 离合器执行器电路范围/性能
000902     $*     P0902 离合器执行器电路低
000903     $*     P0903 离合器执行器电路高
000904     $*     P0904 车门选择位置电路
000905     $*     P0905 车门选择位置电路范围/性能
000906     $*     P0906 车门选择位置电路低
000907     $*     P0907 车门选择位置电路高
000908     $*     P0908 车门选择位置电路间歇性故障
000909     $*     P0909 车门选择控制错误
000910     $*     P0910 车门选择执行器电路/开路
000911     $*     P0911 车门选择执行器电路范围/性能
000912     $*     P0912 车门选择执行器电路低
000913     $*     P0913 车门选择执行器电路高
000914     $*     P0914 换档位置电路
000915     $*     P0915 换挡位置电路范围/性能
000916     $*     P0916 换挡位置电路低
000917     $*     P0917 换挡位置电路高
000918     $*     P0918 换挡位置电路间歇性故障
000919     $*     P0919 换挡位置控制错误
000fff     $*     P0FFF 正时参考高分辨率信号 A  不稳定脉冲
000c80     $*     P0C80 混合动力电池温度传感器 'G' 电路间歇故障/不稳定
000c81     $*     P0C81 混合动力电池温度传感器 'H' 电路
000c82     $*     P0C82 混合动力电池温度传感器 'H' 电路范围/性能
000c83     $*     P0C83 混合动力电池温度传感器 'H' 电路低
000c84     $*     P0C84 混合动力电池温度传感器 'H' 电路高
000c85     $*     P0C85 混合动力电池温度传感器 'H' 电路间歇故障/不稳定
000c86     $*     P0C86 混合动力电池温度传感器 'F'/'G' 相关性
000c87     $*     P0C87 混合动力电池温度传感器 'G'/'H' 相关性
000c60     $*     P0C60 驱动马达 'B' 位置传感器电路 'B' 范围/性能
000c61     $*     P0C61 驱动马达 'B' 位置传感器电路 'B' 低
000c62     $*     P0C62 驱动马达 'B' 位置传感器电路 'B' 高
000c63     $*     P0C63 驱动马达 'B' 位置传感器电路 'B' 间歇故障/不稳定
000c64     $*     P0C64 发电机位置传感器电路 'A'
000c65     $*     P0C65 发电机位置传感器电路 'A' 范围/性能
000c66     $*     P0C66 发电机位置传感器电路 'A' 低
000c67     $*     P0C67 发电机位置传感器电路 'A' 高
000c68     $*     P0C68 发电机位置传感器电路 'A' 间歇故障/不稳定
000c69     $*     P0C69 发电机位置传感器电路 'B'
000c6a     $*     P0C6A 发电机位置传感器电路 'B' 范围/性能
000c6b     $*     P0C6B 发电机位置传感器电路 'B' 低
000c6c     $*     P0C6C 发电机位置传感器电路 'B' 高
000c6d     $*     P0C6D 发电机位置传感器电路 'B' 间歇故障/不稳定
000c6e     $*     P0C6E 混合动力电池温度传感器 'A'/'B' 相关性
000c6f     $*     P0C6F 混合动力电池温度传感器  'B'/'C' 相关性
000c70     $*     P0C70 混合动力电池温度传感器 'C'/'D' 相关性
000c71     $*     P0C71 混合动力电池温度传感器 'D'/'E' 相关性
000c72     $*     P0C72 混合动力电池温度传感器 'E'/'F' 相关性
000c73     $*     P0C73 马达电子设备冷却液泵 'A' 控制性能
000c74     $*     P0C74 马达电子设备冷却液泵 'B' 控制性能
000c75     $*     P0C75 混合动力电池系统放电时间过短
000c76     $*     P0C76 混合动力电池系统放电时间过长
000c77     $*     P0C77 混合动力电池系统预充电时间过短
000c78     $*     P0C78 混合动力电池系统预充电时间过长
000c79     $*     P0C79 驱动马达 'A' 逆变器电压过高
000c7a     $*     P0C7A 驱动马达 'B' 逆变器电压过高
000c7b     $*     P0C7B 发电机逆变器电压过高
000c7c     $*     P0C7C 混合动力电池温度传感器 'G' 电路
000c7d     $*     P0C7D 混合动力电池温度传感器 'G' 电路范围/性能
000c7e     $*     P0C7E 混合动力电池温度传感器 'G' 电路低
000c7f     $*     P0C7F 混合动力电池温度传感器 'G' 电路高
000c40     $*     P0C40 直流/直流电压转换器温度传感器 'B' 电路高
000c41     $*     P0C41 直流/直流电压转换器温度传感器 'B' 电路间歇故障/不稳定
000c42     $*     P0C42 混合动力电池组冷却液温度传感器电路
000c43     $*     P0C43 混合动力电池组冷却液温度传感器电路范围/性能
000c44     $*     P0C44 混合动力电池组冷却液温度传感器电路低
000c45     $*     P0C45 混合动力电池组冷却液温度传感器电路高
000c46     $*     P0C46 混合动力电池组冷却液温度传感器电路间歇性故障/不稳定
000c47     $*     P0C47 混合动力电池组冷却液泵控制电路/开路
000c48     $*     P0C48 混合动力电池组冷却液泵控制电路低
000c49     $*     P0C49 混合动力电池组冷却液泵控制电路高
000c4a     $*     P0C4A 混合动力电池组冷却液泵控制性能
000c4b     $*     P0C4B 混合动力电池组冷却液泵电压供应电路/开路
000c4c     $*     P0C4C 混合动力电池组冷却液泵电压供应电路低
000c4d     $*     P0C4D 混合动力电池组冷却液泵电压供应电路高
000c4e     $*     P0C4E 驱动马达 'A' 位置超出学习极限
000c4f     $*     P0C4F 驱动马达 'B' 位置超出学习极限
000c50     $*     P0C50 驱动马达 'A' 位置传感器电路 'A'
000c51     $*     P0C51 驱动马达 'A' 位置传感器电路 'A' 范围/性能
000c52     $*     P0C52 驱动马达 'A' 位置传感器电路 'A' 低
000c53     $*     P0C53 驱动马达 'A' 位置传感器电路 'A' 高
000c54     $*     P0C54 驱动马达 'A' 位置传感器电路 'A' 间歇故障/不稳定
000c55     $*     P0C55 驱动马达 'B' 位置传感器电路 'A'
000c56     $*     P0C56 驱动马达 'B' 位置传感器电路 'A' 范围/性能
000c57     $*     P0C57 驱动马达 'B' 位置传感器电路 'A' 低
000c58     $*     P0C58 驱动马达 'B' 位置传感器电路 'A' 高
000c59     $*     P0C59 驱动马达 'B' 位置传感器电路 'A' 间歇故障/不稳定
000c5a     $*     P0C5A 驱动马达 'A' 位置传感器电路 'B'
000c5b     $*     P0C5B 驱动马达 'A' 位置传感器电路 'B' 范围/性能
000c5c     $*     P0C5C 驱动马达 'A' 位置传感器电路 'B' 低
000c5d     $*     P0C5D 驱动马达 'A' 位置传感器电路 'B' 高
000c5e     $*     P0C5E 驱动马达 'A' 位置传感器电路 'B' 间歇故障/不稳定
000c5f     $*     P0C5F 驱动马达 'B' 位置传感器电路 'B'
000c20     $*     P0C20 辅助变速器液泵相位 U - V - W电路/开路
000c21     $*     P0C21 辅助变速器液泵相位 U - V - W电路低
000c22     $*     P0C22 辅助变速器液泵相位 U - V - W电路高
000c23     $*     P0C23 辅助变速器液泵控制模块电路/开路
000c24     $*     P0C24 辅助变速器液泵控制模块电路低
000c25     $*     P0C25 辅助变速器液泵控制模块电路高
000c26     $*     P0C26 辅助变速器液泵马达电流
000c27     $*     P0C27 辅助变速器液泵马达电流低
000c28     $*     P0C28 辅助变速器液泵马达电流高
000c29     $*     P0C29 辅助变速器液泵驱动电路性能
000c2a     $*     P0C2A 辅助变速器液泵马达失速
000c2b     $*     P0C2B 辅助变速器液泵控制模块反馈信号
000c2c     $*     P0C2C 辅助变速器液泵控制模块反馈信号范围/性能
000c2d     $*     P0C2D 辅助变速器液泵控制模块反馈信号低
000c2e     $*     P0C2E 辅助变速器液泵控制模块反馈信号高
000c2f     $*     P0C2F 内部控制模块驱动马达/发电机 - 发动机转速传感器性能
000c30     $*     P0C30 混合动力电池组充电状态高
000c31     $*     P0C31 逆变器 'B' 冷却系统性能
000c32     $*     P0C32 混合动力电池冷却系统性能
000c33     $*     P0C33 混合动力电池温度传感器 'F' 电路
000c34     $*     P0C34 混合动力电池温度传感器 'F' 电路范围/性能
000c35     $*     P0C35 混合动力电池温度传感器 'F' 电路低
000c36     $*     P0C36 混合动力电池温度传感器 'F' 电路高
000c37     $*     P0C37 混合动力电池温度传感器 'F' 电路间歇故障/不稳定
000c38     $*     P0C38 直流/直流电压转换器温度传感器 'A' 电路
000c39     $*     P0C39 直流/直流电压转换器温度传感器 'A' 电路范围/性能
000c3a     $*     P0C3A 直流/直流电压转换器温度传感器 'A' 电路低
000c3b     $*     P0C3B 直流/直流电压转换器温度传感器 'A' 电路高
000c3c     $*     P0C3C 直流/直流流电压转换器温度传感器 'A' 电路间歇故障/不稳定
000c3d     $*     P0C3D 直流/直流电压转换器温度传感器 'B' 电路
000c3e     $*     P0C3E 直流/直流电压转换器温度传感器 'B' 电路范围/性能
000c3f     $*     P0C3F 直流/直流电压转换器温度传感器 'B' 电路低
000c00     $*     P0C00 驱动马达 'A' 电流过低
000c01     $*     P0C01 驱动马达 'A' 电流过高
000c02     $*     P0C02 驱动马达 'B' 电流
000c03     $*     P0C03 驱动马达 'B' 电流过低
000c04     $*     P0C04 驱动马达 'B' 电流过高
000c05     $*     P0C05 驱动马达 'A' 相位 U - V - W电路/开路
000c06     $*     P0C06 驱动马达 'A' 相位 U - V - W电路低
000c07     $*     P0C07 驱动马达 'A' 相位 U - V - W电路高
000c08     $*     P0C08 驱动马达 'B' 相位 U - V - W电路/开路
000c09     $*     P0C09 驱动马达 'B' 相位 U - V - W电路低
000c0a     $*     P0C0A 驱动马达 'B' 相位 U - V - W电路高
000c0b     $*     P0C0B 驱动马达 'A' 逆变器电源电路/开路
000c0c     $*     P0C0C 驱动马达 'A' 逆变器电源电路低
000c0d     $*     P0C0D 驱动马达 'A' 逆变器电源电路高
000c0e     $*     P0C0E 驱动马达 'B' 逆变器电源电路/开路
000c0f     $*     P0C0F 驱动马达 'B' 逆变器电源电路低
000c10     $*     P0C10 驱动马达 'B' 逆变器电源电路高
000c11     $*     P0C11 驱动马达 'A' 逆变器相位 U 温度过高
000c12     $*     P0C12 驱动马达 'A' 逆变器相位 V 温度过高
000c13     $*     P0C13 驱动马达 'A' 逆变器相位 W 温度过高
000c14     $*     P0C14 驱动马达 'B' 逆变器相位 U 温度过高
000c15     $*     P0C15 驱动马达 'B' 逆变器相位 V 温度过高
000c16     $*     P0C16 驱动马达 'B' 逆变器相位 W 温度过高
000c17     $*     P0C17 驱动马达 'A' 位置传感器未学习
000c18     $*     P0C18 驱动马达 'B' 位置传感器未学习
000c19     $*     P0C19 驱动马达 'A' 输送扭矩性能
000c1a     $*     P0C1A 驱动马达 'B' 输送扭矩性能
000c1b     $*     P0C1B 辅助变速器液泵控制模块内部温度过高
000c1c     $*     P0C1C 辅助变速器液泵控制模块内部温度传感器电路
000c1d     $*     P0C1D 辅助变速器液泵控制模块内部温度传感器电路范围/性能
000c1e     $*     P0C1E 辅助变速器液泵控制模块内部温度传感器电路低
000c1f     $*     P0C1F 辅助变速器液泵控制模块内部温度传感器电路高
000d11     $*     P0D11 燃油蒸发排放系统净化流量传感器电路间歇故障
0002e0     $*     P02E0 柴油进气气流控制电路/开路
0002e1     $*     P02E1 柴油进气气流控制性能
0002e2     $*     P02E2 柴油进气气流控制电路低
0002e3     $*     P02E3 柴油进气气流控制电路高
0002e4     $*     P02E4 柴油进气气流控制卡滞在打开位置
0002e5     $*     P02E5 柴油进气气流控制卡滞在关闭位置
0002e6     $*     P02E6 柴油进气气流位置传感器电路
0002e7     $*     P02E7 柴油进气气流位置传感器电路范围/性能
0002e8     $*     P02E8 柴油进气气流位置传感器电路低
0002e9     $*     P02E9 柴油进气气流位置传感器电路高
0002ea     $*     P02EA 柴油进气气流位置传感器电路间歇性故障/不稳定
0002eb     $*     P02EB 柴油进气气流控制马达电流范围/性能
0002ec     $*     P02EC 柴油进气气流控制系统 - 检测到高气流
0002ed     $*     P02ED 柴油进气气流控制系统 - 检测到低气流
0002ee     $*     P02EE 汽缸 1 喷油嘴电路范围/性能
0002ef     $*     P02EF 汽缸 2 喷油嘴电路范围/性能
0002f0     $*     P02F0 汽缸 3 喷油嘴电路范围/性能
0002f1     $*     P02F1 汽缸 4 喷油嘴电路范围/性能
0002f2     $*     P02F2 汽缸 5 喷油嘴电路范围/性能
0002f3     $*     P02F3 汽缸 6 喷油嘴电路范围/性能
0002f4     $*     P02F4 汽缸 7 喷油嘴电路范围/性能
0002f5     $*     P02F5 汽缸 8 喷油嘴电路范围/性能
0002f6     $*     P02F6 汽缸 9 喷油嘴电路范围/性能
0002f7     $*     P02F7 汽缸 10 喷油嘴电路范围/性能
0002f8     $*     P02F8 汽缸 11 喷油嘴电路范围/性能
0002f9     $*     P02F9 汽缸 12 喷油嘴电路范围/性能
0002fa     $*     P02FA 柴油进气气流位置传感器最低/最高停止性能
0002c0     $*     P02C0 汽缸 10 - 喷油嘴受限
0002c1     $*     P02C1 汽缸 10 - 喷油嘴泄漏
0002c2     $*     P02C2 汽缸 11 - 最大极限时的燃油修正
0002c3     $*     P02C3 汽缸 11 - 最小极限时的燃油修正
0002c4     $*     P02C4 汽缸 11 - 喷油嘴受限
0002c5     $*     P02C5 汽缸 11 - 喷油嘴泄漏
0002c6     $*     P02C6 汽缸 12 - 最大极限时的燃油修正
0002c7     $*     P02C7 汽缸 12 - 最小极限时的燃油修正
0002c8     $*     P02C8 汽缸 12 - 喷油嘴受限
0002c9     $*     P02C9 汽缸 12 - 喷油嘴泄漏
0002ca     $*     P02CA 涡轮增压器/机械 增压器 B 过增压条件
0002cb     $*     P02CB 涡轮增压器/机械增压器 B 增压不足条件
0002cc     $*     P02CC 汽缸 1 燃油喷油嘴在最小极限时的偏移学习
0002cd     $*     P02CD 汽缸 1 燃油喷油嘴在最大极限时的偏移学习
0002ce     $*     P02CE 汽缸 2 燃油喷油嘴在最小极限时的偏移学习
0002cf     $*     P02CF 汽缸 2 燃油喷油嘴在最大极限时的偏移学习
0002d0     $*     P02D0 汽缸 3 燃油喷油嘴在最小极限时的偏移学习
0002d1     $*     P02D1 汽缸 3 燃油喷油嘴在最大极限时的偏移学习
0002d2     $*     P02D2 汽缸 4 燃油油喷油嘴在最小极限时的偏移学习
0002d3     $*     P02D3 汽缸 4 燃油油喷油嘴在最大极限时的偏移学习
0002d4     $*     P02D4 汽缸 5 燃油喷油嘴在最小极限时的偏移学习
0002d5     $*     P02D5 汽缸 5 燃油喷油嘴在最大极限时的偏移学习
0002d6     $*     P02D6 汽缸 6 燃油喷油嘴在最小极限时的偏移学习
0002d7     $*     P02D7 汽缸 6 燃油喷油嘴在最大极限时的偏移学习
0002d8     $*     P02D8 汽缸 7 燃油喷油嘴在最小极限时的偏移学习
0002d9     $*     P02D9 汽缸 7 燃油喷油嘴在最大极限时的偏移学习
0002da     $*     P02DA 汽缸 8 燃油喷油嘴在最小极限时的偏移学习
0002db     $*     P02DB 汽缸 8 燃油喷油嘴在最大极限时的偏移学习
0002dc     $*     P02DC 汽缸 9 燃油喷油嘴在最小极限时的偏移学习
0002dd     $*     P02DD 汽缸 9 燃油喷油嘴在最大极限时的偏移学习
0002de     $*     P02DE 汽缸 10 燃油喷油嘴在最小极限时的偏移学习
0002df     $*     P02DF 汽缸 10 燃油喷油嘴在最大极限时的偏移学习
0002a0     $*     P02A0 汽缸 2 - 喷油嘴受限
0002a1     $*     P02A1 汽缸 2 - 喷油嘴泄漏
0002a2     $*     P02A2 汽缸 3 - 最大极限时的燃油修正
0002a3     $*     P02A3 汽缸 3 - 最小极限时的燃油修正
0002a4     $*     P02A4 汽缸 3 - 喷油嘴受限
0002a5     $*     P02A5 汽缸 3 - 喷油嘴泄漏
0002a6     $*     P02A6 汽缸 4 - 最大极限时的燃油修正
0002a7     $*     P02A7 汽缸 4 - 最小极限时的燃油修正
0002a8     $*     P02A8 汽缸 4 - 喷油嘴受限
0002a9     $*     P02A9 汽缸 4 - 喷油嘴泄漏
0002aa     $*     P02AA 汽缸 5 - 最大极限时的燃油修正
0002ab     $*     P02AB 汽缸 5 - 最小极限时的燃油修正
0002ac     $*     P02AC 汽缸 5 - 喷油嘴受限
0002ad     $*     P02AD 汽缸 5 - 喷油嘴泄漏
0002ae     $*     P02AE 汽缸 6 - 最大极限时的燃油修正
0002af     $*     P02AF 汽缸 6 - 最小极限时的燃油修正
0002b0     $*     P02B0 汽缸 6 - 喷油嘴受限
0002b1     $*     P02B1 汽缸 6 - 喷油嘴泄漏
0002b2     $*     P02B2 汽缸 7 - 最大极限时的燃油修正
0002b3     $*     P02B3 汽缸 7 - 最小极限时的燃油修正
0002b4     $*     P02B4 汽缸 7 - 喷油嘴受限
0002b5     $*     P02B5 汽缸 7 - 喷油嘴泄漏
0002b6     $*     P02B6 汽缸 8 - 最大极限时的燃油修正
0002b7     $*     P02B7 汽缸 8 - 最小极限时的燃油修正
0002b8     $*     P02B8 汽缸 8 - 喷油嘴受限
0002b9     $*     P02B9 汽缸 8 - 喷油嘴泄漏
0002ba     $*     P02BA 汽缸 9 - 最大极限时的燃油修正
0002bb     $*     P02BB 汽缸 9 - 最小极限时的燃油修正
0002bc     $*     P02BC 汽缸 9 - 喷油嘴受限
0002bd     $*     P02BD 汽缸 9 - 喷油嘴泄漏
0002be     $*     P02BE 汽缸 10 - 最大极限时的燃油修正
0002bf     $*     P02BF 汽缸 10 - 最小极限时的燃油修正
000280     $*     P0280 汽缸 7 喷油嘴电路高
000281     $*     P0281 汽缸 7 贡献/平衡
000282     $*     P0282 汽缸 8 喷油嘴电路低
000283     $*     P0283 汽缸 8 喷油嘴电路高
000284     $*     P0284 汽缸 8 贡献/平衡
000285     $*     P0285 汽缸 9 喷油嘴电路低
000286     $*     P0286 汽缸 9 喷油嘴电路高
000287     $*     P0287 汽缸 9 贡献/平衡
000288     $*     P0288 汽缸 10 喷油嘴电路低
000289     $*     P0289 汽缸 10 喷油嘴电路高
000290     $*     P0290 汽缸 10 贡献/平衡
000291     $*     P0291 汽缸 11 喷油嘴电路低
000292     $*     P0292 汽缸 11 喷油嘴电路高
000293     $*     P0293 汽缸 11 贡献/平衡
000294     $*     P0294 汽缸 12 喷油嘴电路低
000295     $*     P0295 汽缸 12 喷油嘴电路高
000296     $*     P0296 汽缸 12 贡献/平衡
000297     $*     P0297 汽车超速条件
000298     $*     P0298 发动机机油温度过高
000299     $*     P0299 涡轮增压器/机械增压器增压不足
00029a     $*     P029A 汽缸 1 - 最大极限时的燃油修正
00029b     $*     P029B 汽缸 1 - 最小极限时的燃油修正
00029c     $*     P029C 汽缸 1 - 喷油嘴受限
00029d     $*     P029D 汽缸 1 - 喷油嘴泄漏
00029e     $*     P029E 汽缸 2 - 最大极限时的燃油修正
00029f     $*     P029F 汽缸 2 - 最小极限时的燃油修正
000260     $*     P0260 喷油泵燃油计量控制 B 间歇性故障 (凸轮/转子/喷油嘴)
000261     $*     P0261 汽缸 1 喷油嘴电路低
000262     $*     P0262 汽缸 1 喷油嘴电路高
000263     $*     P0263 汽缸 1 贡献/平衡
000264     $*     P0264 汽缸 2 喷油嘴电路低
000265     $*     P0265 汽缸 2 喷油嘴电路高
000266     $*     P0266 汽缸 2 贡献/平衡
000267     $*     P0267 汽缸 3 喷油嘴电路低
000268     $*     P0268 汽缸 3 喷油嘴电路高
000269     $*     P0269 汽缸 3 贡献/平衡
000270     $*     P0270 汽缸 4 喷油嘴电路低
000271     $*     P0271 汽缸 4 喷油嘴电路高
000272     $*     P0272 汽缸 4 贡献/平衡
000273     $*     P0273 汽缸 5 喷油嘴电路低
000274     $*     P0274 汽缸 5 喷油嘴电路高
000275     $*     P0275 汽缸 5 贡献/平衡
000276     $*     P0276 汽缸 6 喷油嘴电路低
000277     $*     P0277 汽缸 6 喷油嘴电路高
000278     $*     P0278 汽缸 6 贡献/平衡
000279     $*     P0279 汽缸 7 喷油嘴电路低
000240     $*     P0240 涡轮增压器/机械增压器增压传感器 B 电路范围/性能
000241     $*     P0241 涡轮增压器/机械增压器增压传感器 B 电路低
000242     $*     P0242 涡轮增压器/机械增压器增压传感器 B 电路高
000243     $*     P0243 涡轮增压器/机械增压器排气泄压阀电磁阀 A
000244     $*     P0244 涡轮增压器/机械增压器排气泄压阀电磁阀 A 范围/性能
000245     $*     P0245 涡轮增压器/机械增压器排气泄压阀电磁阀 A 低
000246     $*     P0246 涡轮增压器/机械增压器排气泄压阀电磁阀 A 高
000247     $*     P0247 涡轮增压器/机械增压器排气泄压阀电磁阀 B
000248     $*     P0248 涡轮增压器/机械增压器排气泄压阀电磁阀 B 范围/性能
000249     $*     P0249 涡轮增压器/机械增压器排气泄压阀电磁阀 B 低
00024a     $*     P024A 增压空气冷却器旁通控制 A 范围/性能
00024b     $*     P024B 增压空气冷却器旁通控制 A 卡住
00024c     $*     P024C 增压空气冷却器旁通位置传感器 A 电路
00024d     $*     P024D 增压空气冷却器旁通位置传感器 A 电路范围/性能
00024e     $*     P024E 增压空气冷却器旁通位置传感器 A 电路低
00024f     $*     P024F 增压空气冷却器旁通位置传感器 A 电路高
000250     $*     P0250 涡轮增压器/机械增压器排气泄压阀电磁阀 B 高
000251     $*     P0251 喷油泵燃油计量控制 A (凸轮/转子/喷油嘴)
000252     $*     P0252 喷油泵燃油计量控制 A 范围/性能 (凸轮/转子/喷油嘴)
000253     $*     P0253 喷油泵燃油计量控制 A 低 (凸轮/转子/喷油嘴)
000254     $*     P0254 喷油泵燃油计量控制 A 高 (凸轮/转子/喷油嘴)
000255     $*     P0255 喷油泵燃油计量控制 A 间歇性故障 (凸轮/转子/喷油嘴)
000256     $*     P0256 喷油泵燃油计量控制 B (凸轮/转子/喷油嘴)
000257     $*     P0257 喷油泵燃油计量控制 B 范围/性能 (凸轮/转子/喷油嘴)
000258     $*     P0258 喷油泵燃油计量控制 B 低 (凸轮/转子/喷油嘴)
000259     $*     P0259 喷油泵燃油计量控制 B 高 (凸轮/转子/喷油嘴)
00025a     $*     P025A 燃油泵模块控制电路/开路
00025b     $*     P025B 燃油泵模块控制电路范围/性能
00025c     $*     P025C 燃油泵模块控制电路低
00025d     $*     P025D 燃油泵模块控制电路高
000220     $*     P0220 节气门/踏板位置传感器/开关 B 电路
000221     $*     P0221 节气门/踏板位置传感器/开关 B 电路范围/性能
000222     $*     P0222 节气门/踏板位置传感器/开关 B 电路低
000223     $*     P0223 节气门/踏板位置传感器/开关 B 电路高
000224     $*     P0224 节气门/踏板位置传感器/开关 B 电路间歇性故障
000225     $*     P0225 节气门/踏板位置传感器/开关 C 电路
000226     $*     P0226 节气门/踏板位置传感器/开关 C 电路范围/性能
000227     $*     P0227 节气门/踏板位置传感器/开关 C 电路低
000228     $*     P0228 节气门/踏板位置传感器/开关 C 电路高
000229     $*     P0229 节气门/踏板位置传感器/开关 C 电路间歇性故障
00022a     $*     P022A 增压空气冷却器旁通控制 A 电路/开路
00022b     $*     P022B 增压空气冷却器旁通控制 A 电路低
00022c     $*     P022C 增压空气冷却器旁通控制 A 电路高
00022d     $*     P022D 增压空气冷却器旁通控制 B 电路/开路
00022e     $*     P022E 增压空气冷却器旁通控制 B 电路低
00022f     $*     P022F 增压空气冷却器旁通控制 B 电路高
000230     $*     P0230 燃油泵主电路
000231     $*     P0231 燃油泵次级电路低
000232     $*     P0232 燃油泵次级电路高
000233     $*     P0233 燃油泵次级电路间歇性故障
000234     $*     P0234 涡轮增压器/机械增压器过增压条件
000235     $*     P0235 涡轮增压器/机械增压器增压传感器 A 电路
000236     $*     P0236 涡轮增压器/机械增压器增压传感器 A 电路范围/性能
000237     $*     P0237 涡轮增压器/机械增压器增压传感器 A 电路低
000238     $*     P0238 涡轮增压器/机械增压器增压传感器 A 电路高
000239     $*     P0239 涡轮增压器/机械增压器增压传感器 B 电路
00023a     $*     P023A 增压空气冷却器冷却液泵控制电路/开路
00023b     $*     P023B 增压空气冷却器冷却液泵控制电路低
00023c     $*     P023C 增压空气冷却器冷却液泵控制电路高
00023d     $*     P023D 歧管绝对压力计 涡轮增压器/机械增压器增压传感器 A 相互关系
00023e     $*     P023E 歧管绝对压力计 涡轮增压器/机械增压器增压传感器 B 相互关系
00023f     $*     P023F 燃油泵二次电路/开路
000200     $*     P0200 喷油嘴电路/开路
000201     $*     P0201 喷油嘴电路/开路 汽缸 1
000202     $*     P0202 喷油嘴电路/开路 汽缸 2
000203     $*     P0203 喷油嘴电路/开路 汽缸 3
000204     $*     P0204 喷油嘴电路/开路 汽缸 4
000205     $*     P0205 喷油嘴电路/开路 汽缸 5
000206     $*     P0206 喷油嘴电路/开路 汽缸 6
000207     $*     P0207 喷油嘴电路/开路 汽缸 7
000208     $*     P0208 喷油嘴电路/开路 汽缸 8
000209     $*     P0209 喷油嘴电路/开路 汽缸 9
00020a     $*     P020A 汽缸 1 喷油正时
00020b     $*     P020B 汽缸 2 喷油正时
00020c     $*     P020C 汽缸 3 喷油正时
00020d     $*     P020D 汽缸 4 喷油正时
00020e     $*     P020E 汽缸 5 喷油正时
00020f     $*     P020F 汽缸 6 喷油正时
000210     $*     P0210 喷油嘴电路/开路 汽缸 10
000211     $*     P0211 喷油嘴电路/开路 汽缸 11
000212     $*     P0212 喷油嘴电路/开路 汽缸 12
000213     $*     P0213 冷启动起动喷油嘴 1
000214     $*     P0214 冷启动起动喷油嘴 2
000215     $*     P0215 发动机关断电磁阀
000216     $*     P0216 喷油嘴/喷油正时控制电路
000217     $*     P0217 发动机冷却液温度过高条件
000218     $*     P0218 传动液温度过高条件
000219     $*     P0219 发动机超速状态
00021a     $*     P021A 汽缸 7 喷油正时
00021b     $*     P021B 汽缸 8 喷油正时
00021c     $*     P021C 汽缸 9 喷油正时
00021d     $*     P021D 汽缸 10 喷油正时
00021e     $*     P021E 汽缸 11 喷油正时
00021f     $*     P021F 汽缸 12 喷油正时
000380     $*     P0380 预热塞/加热器电路 A
000381     $*     P0381 预热塞/加热器指示灯电路
000382     $*     P0382 预热塞/加热器电路 B
000383     $*     P0383 预热塞控制模块控制电路低
000384     $*     P0384 预热塞控制模块控制电路高
000385     $*     P0385 曲轴位置传感器 B 电路
000386     $*     P0386 曲轴位置传感器 B 电路范围/性能
000387     $*     P0387 曲轴位置传感器 B 电路低
000388     $*     P0388 曲轴位置传感器 B 电路高
000389     $*     P0389 曲轴位置传感器 B 电路间歇性故障
000390     $*     P0390 凸轮轴位置传感器 B 电路 缸组 2
000391     $*     P0391 凸轮轴位置传感器 B 电路范围/性能 缸组 2
000392     $*     P0392 凸轮轴位置传感器 B 电路低 缸组 2
000393     $*     P0393 凸轮轴位置传感器 B 电路高 缸组 2
000394     $*     P0394 凸轮轴位置传感器 B 电路间歇性故障 缸组 2
000360     $*     P0360 点火线圈 J 主/副电路
000361     $*     P0361 点火线圈 K 主/副电路
000362     $*     P0362 点火线圈 L 主/副电路
000363     $*     P0363 失火检测到供油停止
000365     $*     P0365 凸轮轴位置传感器 B 电路 缸组 1
000366     $*     P0366 凸轮轴位置传感器 B 电路范围/性能 缸组 1
000367     $*     P0367 凸轮轴位置传感器 B 电路低 缸组 1
000368     $*     P0368 凸轮轴位置传感器 B 电路高 缸组 1
000369     $*     P0369 凸轮轴位置传感器 B 电路间歇性故障 缸组 1
000370     $*     P0370 正时参考高分辨率信号 A
000371     $*     P0371 正时参考高分辨率信号 A 脉冲过多
000372     $*     P0372 正时参考高分辨率信号 A 脉冲过少
000373     $*     P0373 正时参考高分辨率信号 A 间歇性故障/不稳定脉冲
000374     $*     P0374 正时参考高分辨率信号 A 无脉冲
000375     $*     P0375 正时参考高分辨率信号 B
000376     $*     P0376 正时参考高分辨率信号 B 脉冲过多
000377     $*     P0377 正时参考高分辨率信号 B 脉冲过少
000378     $*     P0378 正时参考高分别率信号 B 间歇性故障/不稳定脉冲
000379     $*     P0379 正时参考高分辨率信号 B 无脉冲
000340     $*     P0340 凸轮轴位置传感器 A 电路 缸组 1 或单一传感器
000341     $*     P0341 凸轮轴位置传感器 A 电路范围/性能 缸组 1 或单一传感器
000342     $*     P0342 凸轮轴位置传感器 A 电路低 缸组 1 或单一传感器
000343     $*     P0343 凸轮轴位置传感器 A 电路高 缸组 1 或单一传感器
000344     $*     P0344 凸轮轴位置传感器 A 电路间歇性故障 缸组 1 或单一传感器
000345     $*     P0345 凸轮轴位置传感器 A 电路 缸组 2
000346     $*     P0346 凸轮轴位置传感器 A 电路范围/性能 缸组 2
000347     $*     P0347 凸轮轴位置传感器 A 电路低 缸组 2
000348     $*     P0348 凸轮轴位置传感器 A 电路高 缸组 2
000349     $*     P0349 凸轮轴位置传感器 A 电路间歇性故障 缸组 2
000350     $*     P0350 点火线圈主/副电路
000351     $*     P0351 点火线圈 A 主/副电路
000352     $*     P0352 点火线圈 B 主/副电路
000353     $*     P0353 点火线圈 C 主/副电路
000354     $*     P0354 点火线圈 D 主/副电路
000355     $*     P0355 点火线圈 E 主/副电路
000356     $*     P0356 点火线圈 F 主/副电路
000357     $*     P0357 点火线圈 G 主/副电路
000358     $*     P0358 点火线圈 H 主/副电路
000359     $*     P0359 点火线圈 I 主/副电路
000320     $*     P0320 点火/分电器发动机速度输入电路
000321     $*     P0321 点火/分电器发动机速度输入电路范围/性能
000322     $*     P0322 点火/分电器发动机速度输入电路无信号
000323     $*     P0323 点火/分电器发动机速度输入电路间歇性故障
000324     $*     P0324 爆震控制系统错误
000325     $*     P0325 爆震传感器 1 电路 缸组 1 或单一传感器
000326     $*     P0326 爆震传感器 1 电路范围/性能 缸组 1 或单一传感器
000327     $*     P0327 爆震传感器 1 电路低 缸组 1 或单一传感器
000328     $*     P0328 爆震传感器 1 电路高 缸组 1 或单一传感器
000329     $*     P0329 爆震传感器 1 电路间歇性故障 缸组 1 或单一传感器
00032a     $*     P032A 爆震传感器 3 电路
00032b     $*     P032B 爆震传感器 3 电路范围/性能
00032c     $*     P032C 爆震传感器 3 电路低
00032d     $*     P032D 爆震传感器 3 电路高
00032e     $*     P032E 爆震传感器 3 电路间歇性故障
000330     $*     P0330 爆震传感器 2 电路 缸组 2
000331     $*     P0331 爆震传感器 2 电路范围/性能 缸组 2
000332     $*     P0332 爆震传感器 2 电路低 缸组 2
000333     $*     P0333 爆震传感器 2 电路高 缸组 2
000334     $*     P0334 爆震传感器 2 电路间歇性故障 缸组 2
000335     $*     P0335 曲轴位置传感器 A 电路
000336     $*     P0336 曲轴位置传感器 A 电路范围/性能
000337     $*     P0337 曲轴位置传感器 A 电路低
000338     $*     P0338 曲轴位置传感器 A 电路高
000339     $*     P0339 曲轴位置传感器 A 电路间歇性故障
00033a     $*     P033A 爆震传感器 4 电路 缸组 2
00033b     $*     P033B 爆震传感器 4 电路范围/性能 缸组 2
00033c     $*     P033C 爆震传感器 4 电路低 缸组 2
00033d     $*     P033D 爆震传感器 4 电路高 缸组 2
00033e     $*     P033E 爆震传感器 4 电路电压间歇性故障 缸组 2
000300     $*     P0300 任一缸/多缸检测到失火
000301     $*     P0301 检测到汽缸 1 失火
000302     $*     P0302 检测到汽缸 2 失火
000303     $*     P0303 检测到汽缸 3 失火
000304     $*     P0304 检测到汽缸 4 失火
000305     $*     P0305 检测到汽缸 5 失火
000306     $*     P0306 检测到汽缸 6 失火
000307     $*     P0307 检测到汽缸 7 失火
000308     $*     P0308 检测到汽缸 8 失火
000309     $*     P0309 检测到汽缸 9 失火
000310     $*     P0310 检测到汽缸 10 失火
000311     $*     P0311 检测到汽缸 11 失火
000312     $*     P0312 检测到汽缸 12 失火
000313     $*     P0313 检测到低燃油失火
000314     $*     P0314 单缸失火 (汽缸没有指定)
000315     $*     P0315 曲轴位置系统变化未被学习
000316     $*     P0316 发动机启动时检测到失火 (第一次 1000 转)
000317     $*     P0317 不存在不平坦道路硬件
000318     $*     P0318 不平坦道路传感器 A 信号电路
000319     $*     P0319 不平坦道路传感器 B 信号电路
0000a0     $*     P00A0 增压空气冷却器温度传感器电路缸组 2
0000a1     $*     P00A1 增压空气冷却器温度传感器电路范围/性能 缸组 2
0000a2     $*     P00A2 增压空气冷却器温度传感器电路低 缸组 2
0000a3     $*     P00A3 增压空气冷却器温度传感器电路高 缸组 2
0000a4     $*     P00A4 增压空气冷却器温度传感器电路间歇性故障/不稳定 缸组 2
0000a5     $*     P00A5 进气温度传感器 2 电路 缸组 2
0000a6     $*     P00A6 进气温度传感器 2 电路范围/性能 缸组 2
0000a7     $*     P00A7 进气温度传感器 2 电路低 缸组 2
0000a8     $*     P00A8 进气温度传感器 2 电路高 缸组 2
0000a9     $*     P00A9 进气温度传感器 2 电路间歇性故障/不稳定 缸组 2
0000aa     $*     P00AA 进气温度传感器 1 电路 缸组 2
0000ab     $*     P00AB 进气温度传感器 1 电路范围/性能 缸组 2
0000ac     $*     P00AC 进气温度传感器 1 电路低 缸组 2
0000ad     $*     P00AD 进气温度传感器 1 电路高 缸组 2
0000ae     $*     P00AE 进气温度传感器 1 电路间歇性故障 缸组 2
0000af     $*     P00AF 涡轮增压器/机械增压器增压控制 'A' 模组性能
0000b0     $*     P00B0 涡轮增压器/机械增压器增压控制 'B' 模组性能
0000b1     $*     P00B1 散热器冷却液温度传感器电路
0000b2     $*     P00B2 散热器冷却液温度传感器电路范围/性能
0000b3     $*     P00B3 散热器冷却液温度传感器电路低
0000b4     $*     P00B4 散热器冷却液温度传感器电路高
0000b5     $*     P00B5 散热器冷却液温度传感器电路间歇性故障/不稳定
0000b6     $*     P00B6 散热器冷却液温度/发动机冷却液温度相互关系
0000b7     $*     P00B7 发动机冷却液流量低/性能
0000b8     $*     P00B8 歧管绝对压力－空气流量质量或体积相互关系
0000b9     $*     P00B9 低压燃油系统压力–过低, 环境温度低 缸组 2
0000ba     $*     P00BA 低燃油压力 - 被迫限制功率
0000bb     $*     P00BB 燃油喷油嘴流量不足 - 被迫限制功率
0000bc     $*     P00BC 气流质量或体积 'A' 电路范围/性能 - 气流过低
0000bd     $*     P00BD 气流质量或体积 A 电路范围/性能 - 气流过高
0000be     $*     P00BE 气流质量或体积 B 电路范围/性能 - 气流过低
0000bf     $*     P00BF 气流质量或体积 B 电路范围/性能 - 气流过高
000080     $*     P0080 排气阀控制电磁阀电路高 缸组 1
000081     $*     P0081 进气阀控制电磁阀电路 缸组 2
000082     $*     P0082 进气阀控制电磁阀电路低 缸组 2
000083     $*     P0083 进气阀控制电磁阀电路高 缸组 2
000084     $*     P0084 排气阀控制电磁阀电路 缸组 2
000085     $*     P0085 排气阀控制电磁阀电路低 缸组 2
000086     $*     P0086 排气阀控制电磁阀电路高 缸组 2
000087     $*     P0087 燃油轨/系统压力太低
000088     $*     P0088 燃油轨/系统压力太高
000089     $*     P0089 燃油压力调节器 1 性能
00008a     $*     P008A 低压燃油系统压力过低
00008b     $*     P008B 低压燃油系统压力过高
00008c     $*     P008C 燃油冷却器泵控制电路/开路
00008d     $*     P008D 燃油冷却器泵控制电路低
00008e     $*     P008E 燃油冷却器泵控制电路高
00008f     $*     P008F 发动机冷却液温度/燃油温度相互关系
000090     $*     P0090 燃油压力调节器 1 控制电路
000091     $*     P0091 燃油压力调节器 1 控制电路低
000092     $*     P0092 燃油压力调节器 1 控制电路高
000093     $*     P0093 检测到燃油系统泄漏 严重泄漏
000094     $*     P0094 检测到燃油系统泄漏 轻微泄漏
000095     $*     P0095 进气温度传感器 2 电路 缸组 1
000096     $*     P0096 进气温度传感器 2 电路范围/性能 缸组 1
000097     $*     P0097 进气温度传感器 2 电路低 缸组 1
000098     $*     P0098 进气温度传感器 2 电路高 缸组 1
000099     $*     P0099 进气温度传感器 2 电路间歇性故障/不稳定 缸组 1
00009a     $*     P009A 进气温度/周边气温相互关系
00009b     $*     P009B 燃油压力减压控制电路/开路
00009c     $*     P009C 燃油压力减压控制电路低
00009d     $*     P009D 燃油压力减压控制电路高
00009e     $*     P009E 燃油压力减压控制器性能故障/卡滞在关闭位置
00009f     $*     P009F 燃油压力泄压控制卡滞在接通位置
000060     $*     P0060 热氧传感器加热器电阻 缸组 2, 传感器 2
000061     $*     P0061 热氧传感器加热器电阻 缸组 2, 传感器 3
000062     $*     P0062 热氧传感器加热器控制电路 缸组 2, 传感器 3
000063     $*     P0063 热氧传感器加热器控制电路低 缸组 2, 传感器 3
000064     $*     P0064 热氧传感器加热器控制电路高 缸组 2, 传感器 3
000065     $*     P0065 空气辅助喷油嘴控制范围/性能
000066     $*     P0066 空气辅助喷油嘴控制电路或电路低
000067     $*     P0067 空气辅助喷油嘴控制电路高
000068     $*     P0068 歧管绝对压力/质量空气流量节气门位置关联
000069     $*     P0069 歧管绝对压力/大气压力关联
00006a     $*     P006A 歧管绝对压力计 - 空气流量质量或体积相互关系
00006b     $*     P006B 歧管绝对压力计 - 排气压力相互关系
00006c     $*     P006C 歧管绝对压力计 - 涡轮增压器/机械增压器入口压力相互关系
00006d     $*     P006D 气压表压力 - 涡轮增压器/机械增压器入口压力相互关系
00006e     $*     P006E 涡轮增压器/机械增压器增压控制 'A' 电源电路电压低
00006f     $*     P006F 涡轮增压器/机械增压器增压控制 'A' 电源电路电压高
000070     $*     P0070 环境空气温度传感器电路
000071     $*     P0071 环境空气温度传感器范围/性能
000072     $*     P0072 环境空气温度传感器电路低
000073     $*     P0073 环境空气温度传感器电路高
000074     $*     P0074 环境空气温度传感器电路间歇性故障
000075     $*     P0075 进气阀控制电磁阀电路 缸组 1
000076     $*     P0076 进气阀控制电磁阀电路低 缸组 1
000077     $*     P0077 进气阀控制电磁阀电路高 缸组 1
000078     $*     P0078 排气阀控制电磁阀电路 缸组 1
000079     $*     P0079 排气阀控制电磁阀电路低 缸组 1
00007a     $*     P007A 增压空气冷却器温度传感器电路缸组 1
00007b     $*     P007B 增压空气冷却器温度传感器电路范围/性能 缸组 1
00007c     $*     P007C 增压空气冷却器温度传感器电路低 缸组 1
00007d     $*     P007D 增压空气冷却器温度传感器电路高 缸组 1
00007e     $*     P007E 增压空气冷却器温度传感器电路间歇性故障/不稳定 缸组 1
00007f     $*     P007F 增压空气冷却器温度传感器电路 缸组 1/缸组 2 相互关系
000040     $*     P0040 氧传感器信号互换 缸组 1, 传感器 1/缸组 2, 传感器 1
000041     $*     P0041 氧传感器信号互换 缸组 1, 传感器 2/缸组 2, 传感器 2
000042     $*     P0042 热氧传感器加热器控制电路 缸组 1, 传感器 3
000043     $*     P0043 热氧传感器加热器控制电路低 缸组 1, 传感器 3
000044     $*     P0044 热氧传感器加热器控制电路高 缸组 1, 传感器 3
000045     $*     P0045 涡轮增压器/机械增压器增压控制电磁阀 A 电路/开路
000046     $*     P0046 涡轮增压器/机械增压器增压控制电磁阀 A 电路
000047     $*     P0047 涡轮增压器/机械增压器增压控制电磁阀 A 电路低
000048     $*     P0048 涡轮增压器/机械增压器增压控制电磁阀 A 电路高
000049     $*     P0049 涡轮增压器/机械增压器涡轮超速
00004a     $*     P004A 涡轮增压器/机械增压器增压控制电磁阀 B 电路/开路
00004b     $*     P004B 涡轮增压器/机械增压器增压控制电磁阀 B 电路
00004c     $*     P004C 涡轮增压器/机械增压器增压控制电磁阀 B 电路低
00004d     $*     P004D 涡轮增压器/机械增压器增压控制电磁阀 B 电路高
00004e     $*     P004E 涡轮增压器/机械增压器增压控制电磁阀 A 电路间歇性故障/不稳定
00004f     $*     P004F 涡轮增压器/机械增压器增压控制电磁阀 B 电路间歇性故障/不稳定
000050     $*     P0050 热氧传感器加热器控制电路 缸组 2, 传感器 1
000051     $*     P0051 热氧传感器加热器控制电路低 缸组 2, 传感器 1
000052     $*     P0052 热氧传感器加热器控制电路高 缸组 2, 传感器 1
000053     $*     P0053 热氧传感器加热器电阻 缸组 1, 传感器 1
000054     $*     P0054 热氧传感器加热器电阻 缸组 1, 传感器 2
000055     $*     P0055 热氧传感器加热器电阻 缸组 1, 传感器 3
000056     $*     P0056 热氧传感器加热器控制电路 缸组 2, 传感器 2
000057     $*     P0057 热氧传感器加热器控制电路低 缸组 2, 传感器 2
000058     $*     P0058 热氧传感器加热器控制电路高 缸组 2, 传感器 2
000059     $*     P0059 热氧传感器加热器电阻 缸组 2, 传感器 1
00005a     $*     P005A 'B' 凸轮轴外形控制性能故障/卡滞在关闭位置 缸组 1
00005b     $*     P005B 'B' 凸轮轴外形控制卡滞在接通位置 缸组 1
00005c     $*     P005C 'B' 凸轮轴外形控制性能故障/卡滞在关闭位置 缸组 2
00005d     $*     P005D 'B' 凸轮轴外形控制卡滞在接通位置 缸组 2
00005e     $*     P005E 涡轮增压器/机械增压器增压控制 'B' 电源电路电压低
00005f     $*     P005F 涡轮增压器/机械增压器增压控制 'B' 电源电路电压高
000020     $*     P0020 A 凸轮轴位置执行器电路/开路 缸组 2
000021     $*     P0021 A 凸轮轴位置正时超前或系统性能 缸组 2
000022     $*     P0022 A 凸轮轴位置正时过度延迟 缸组 2
000023     $*     P0023 B 凸轮轴位置执行器电路/开路 缸组 2
000024     $*     P0024 B 凸轮轴位置正时超前或系统性能 缸组 2
000025     $*     P0025 B 凸轮轴位置正时过度延迟 缸组 2
000026     $*     P0026 进气阀控制电磁阀电路范围/性能 缸组 1
000027     $*     P0027 排气阀控制电磁阀电路范围/性能 缸组 1
000028     $*     P0028 进气阀控制电磁阀电路范围/性能 缸组 2
000029     $*     P0029 排气阀控制电磁阀电路范围/性能 缸组 2
00002a     $*     P002A 'B' 凸轮轴外形控制电路/开路 缸组 1
00002b     $*     P002B 'B' 凸轮轴外形控制电路/低 缸组 1
00002c     $*     P002C 'B' 凸轮轴外形控制电路/高 缸组 1
00002d     $*     P002D 'B' 凸轮轴外形控制电路/开路 缸组 2
00002e     $*     P002E 'B' 凸轮轴外形控制电路/低 缸组 2
00002f     $*     P002F 'B' 凸轮轴外形控制电路/高 缸组 2
000030     $*     P0030 热氧传感器加热器控制电路 缸组 1, 传感器 1
000031     $*     P0031 热氧传感器加热器控制电路低 缸组 1, 传感器 1
000032     $*     P0032 热氧传感器加热器控制电路高 缸组 1, 传感器 1
000033     $*     P0033 涡轮增压器/机械增压器旁通阀控制电路
000034     $*     P0034 涡轮增压器/机械增压器旁通阀控制电路低
000035     $*     P0035 涡轮增压器/机械增压器旁通阀控制电路高
000036     $*     P0036 热氧传感器加热器控制电路 缸组 1, 传感器 2
000037     $*     P0037 热氧传感器加热器控制电路低 缸组 1, 传感器 2
000038     $*     P0038 热氧传感器加热器控制电路高 缸组 1, 传感器 2
000039     $*     P0039 涡轮增压器/机械增压器旁通阀控制电路范围/性能
00003a     $*     P003A 涡轮增压器/机械增压器增压控制 'A' 位置超出学习极限
00003b     $*     P003B 涡轮增压器/机械增压器增压控制 'B' 位置超出学习极限
00003c     $*     P003C 'A' 凸轮轴外形控制性能故障/卡滞在关闭位置 缸组 1
00003d     $*     P003D 'A' 凸轮轴外形控制卡滞在接通位置 缸组 1
00003e     $*     P003E 'A' 凸轮轴外形控制性能故障/卡滞在关闭位置 缸组 2
00003f     $*     P003F 'A' 凸轮轴外形控制卡滞在接通位置 缸组 2
000001     $*     P0001 燃油量调节器控制电路/开路
000002     $*     P0002 燃油量调节器控制电路范围/性能
000003     $*     P0003 燃油量调节器控制电路偏低
000004     $*     P0004 燃油量调节器控制电路偏高
000005     $*     P0005 燃油切断阀 A 控制电路/开路
000006     $*     P0006 燃油切断阀 A 控制电路偏低
000007     $*     P0007 燃油切断阀 A 控制电路偏高
000008     $*     P0008 发动机固定系统性能 缸组 1
000009     $*     P0009 发动机固定系统性能 缸组 2
00000a     $*     P000A A 凸轮轴位置响应慢 缸组 1
00000b     $*     P000B B 凸轮轴位置响应慢 缸组 1
00000c     $*     P000C A 凸轮轴位置响应慢 缸组 2
00000d     $*     P000D B 凸轮轴位置响应慢 缸组 2
00000e     $*     P000E 燃油量调节器控制超出学习极限
00000f     $*     P000F 燃油系统压力过高减压阀被激活
000010     $*     P0010 A 凸轮轴位置执行器电路/开路 缸组 1
000011     $*     P0011 A 凸轮轴位置正时超前或系统性能 缸组 1
000012     $*     P0012 A 凸轮轴位置正时过度延迟 缸组 1
000013     $*     P0013 B 凸轮轴位置执行器电路/开路 缸组 1
000014     $*     P0014 B 凸轮轴位置正时超前或系统性能 缸组 1
000015     $*     P0015 B 凸轮轴位置正时过度延迟 缸组 1
000016     $*     P0016 曲轴位置凸轮轴位置相互关系 缸组 1, 传感器 A
000017     $*     P0017 曲轴位置凸轮轴位置相互关系 缸组 1, 传感器 B
000018     $*     P0018 曲轴位置凸轮轴位置相互关系 缸组 2, 传感器 A
000019     $*     P0019 曲轴位置凸轮轴位置相互关系 缸组 2, 传感器 B
00001a     $*     P001A 'A' 凸轮轴外形控制电路/开路 缸组 1
00001b     $*     P001B 'A' 凸轮轴外形控制电路/低 缸组 1
00001c     $*     P001C 'A' 凸轮轴外形控制电路/高 缸组 1
00001d     $*     P001D 'A' 凸轮轴外形控制电路/开路 缸组 2
00001e     $*     P001E 'A' 凸轮轴外形控制电路/低 缸组 2
00001f     $*     P001F 'A' 凸轮轴外形控制电路/高 缸组 2
000180     $*     P0180 燃油温度传感器 A 电路
000181     $*     P0181 燃油温度传感器 A 电路范围/性能
000182     $*     P0182 燃油温度传感器 A 电路低
000183     $*     P0183 燃油温度传感器 A 电路高
000184     $*     P0184 燃油温度传感器 A 电路间歇性故障
000185     $*     P0185 燃油温度传感器 B 电路
000186     $*     P0186 燃油温度传感器 B 电路范围/性能
000187     $*     P0187 燃油温度传感器 B 电路低
000188     $*     P0188 燃油温度传感器 B 电路高
000189     $*     P0189 燃油温度传感器 B 电路间歇性故障
00018a     $*     P018A 燃油压力传感器 B 电路
00018b     $*     P018B 燃油压力传感器 B 电路范围/性能
00018c     $*     P018C 燃油压力传感器 B 电路低
00018d     $*     P018D 燃油压力传感器 B 电路高
00018e     $*     P018E 燃油压力传感器 B 电路间歇性故障/不稳定
00018f     $*     P018F 燃油系统压力过高减压阀频繁激活
000190     $*     P0190 燃油轨压力传感器 A 电路
000191     $*     P0191 燃油轨压力传感器 A 范围/性能
000192     $*     P0192 燃油轨压力传感器 A 电路低
000193     $*     P0193 燃油轨压力传感器 A 电路高
000194     $*     P0194 燃油轨压力传感器 A 间歇性故障/不稳定
000195     $*     P0195 发动机机油温度传感器
000196     $*     P0196 发动机机油温度传感器范围/性能
000197     $*     P0197 发动机机油温度传感器低
000198     $*     P0198 发动机机油温度传感器高
000199     $*     P0199 发动机机油温度传感器间歇性故障
000160     $*     P0160 氧传感器电路未检测到激活 缸组 2, 传感器 2
000161     $*     P0161 氧传感器加热器电路 缸组 2, 传感器 2
000162     $*     P0162 氧传感器电路 缸组 2, 传感器 3
000163     $*     P0163 氧传感器电路电压低 缸组 2, 传感器 3
000164     $*     P0164 氧传感器电路电压高 缸组 2, 传感器 3
000165     $*     P0165 氧传感器电路响应慢 缸组 2, 传感器 3
000166     $*     P0166 氧传感器电路未检测到激活 缸组 2, 传感器 3
000167     $*     P0167 氧传感器加热器电路 缸组 2, 传感器 3
000168     $*     P0168 燃油温度过高
000169     $*     P0169 燃油成分不正确
000170     $*     P0170 燃油修正缸组 1
000171     $*     P0171 系统过稀缸组 1
000172     $*     P0172 系统过浓缸组 1
000173     $*     P0173 燃油修正缸组 2
000174     $*     P0174 系统过稀缸组 2
000175     $*     P0175 系统过浓缸组 2
000176     $*     P0176 燃油成分传感器电路
000177     $*     P0177 燃油成分传感器电路范围/性能
000178     $*     P0178 燃油成分传感器电路低
000179     $*     P0179 燃油成分传感器电路高
000140     $*     P0140 氧传感器电路未检测到激活 缸组 1, 传感器 2
000141     $*     P0141 氧传感器加热器电路 缸组 1, 传感器 2
000142     $*     P0142 氧传感器电路 缸组 1, 传感器 3
000143     $*     P0143 氧传感器电路电压低 缸组 1, 传感器 3
000144     $*     P0144 氧传感器电路电压高 缸组 1, 传感器 3
000145     $*     P0145 氧传感器电路响应慢 缸组 1, 传感器 3
000146     $*     P0146 氧传感器电路未检测到激活 缸组 1, 传感器 3
000147     $*     P0147 氧传感器加热器电路 缸组 1, 传感器 3
000148     $*     P0148 燃油输送错误
000149     $*     P0149 燃油正时错误
00014a     $*     P014A 氧传感器延迟响应 - 浓至稀 缸组 2, 传感器 2
00014b     $*     P014B 氧传感器延迟响应 - 稀至浓 缸组 2, 传感器 2
00014c     $*     P014C 氧传感器响应慢 - 浓至稀 缸组 1, 传感器 1
00014d     $*     P014D 氧传感器响应慢 - 稀至浓 缸组 1, 传感器 1
00014e     $*     P014E 氧传感器响应慢 - 浓至稀 缸组 2, 传感器 1
00014f     $*     P014F 氧传感器响应慢 - 稀至浓 缸组 2, 传感器 1
000150     $*     P0150 氧传感器电路 缸组 2, 传感器 1
000151     $*     P0151 氧传感器电路电压低 缸组 2, 传感器 1
000152     $*     P0152 氧传感器电路电压高 缸组 2, 传感器 1
000153     $*     P0153 氧传感器电路响应慢 缸组 2, 传感器 1
000154     $*     P0154 氧传感器电路未检测到激活 缸组 2, 传感器 1
000155     $*     P0155 氧传感器加热器电路 缸组 2, 传感器 1
000156     $*     P0156 氧传感器电路 缸组 2, 传感器 2
000157     $*     P0157 氧传感器电路电压低 缸组 2, 传感器 2
000158     $*     P0158 氧传感器电路电压高 缸组 2, 传感器 2
000159     $*     P0159 氧传感器电路响应慢 缸组 2, 传感器 2
00015a     $*     P015A 氧传感器延迟响应 - 浓至稀 缸组 1, 传感器 1
00015b     $*     P015B 氧传感器延迟响应 - 稀至浓 缸组 1, 传感器 1
00015c     $*     P015C 氧传感器延迟响应 - 浓至稀 缸组 2, 传感器 1
00015d     $*     P015D 氧传感器延迟响应 - 稀至浓 缸组 2, 传感器 1
000120     $*     P0120 节气门/踏板位置传感器/开关 A 电路
000121     $*     P0121 节气门/踏板位置传感器/开关 A 电路范围/性能
000122     $*     P0122 节气门/踏板位置传感器/开关 A 电路低
000123     $*     P0123 节气门/踏板位置传感器/开关 A 电路高
000124     $*     P0124 节气门/踏板位置传感器/开关 A 电路间歇性故障
000125     $*     P0125 闭环燃油控制时冷却液温度过低
000126     $*     P0126 冷却液温度不足以支持稳定运转
000127     $*     P0127 进气温度过高
000128     $*     P0128 冷却液恒温器 (冷却液温度低于恒温器调节温度)
000129     $*     P0129 大气压力过低
00012a     $*     P012A 涡轮增压器/机械增压器入口压力传感器电路
00012b     $*     P012B 涡轮增压器/机械增压器入口压力传感器电路范围/性能
00012c     $*     P012C 涡轮增压器/机械增压器入口压力传感器电路低
00012d     $*     P012D 涡轮增压器/机械增压器入口压力传感器电路高
00012e     $*     P012E 涡轮增压器/机械增压器入口压力传感器电路间歇性故障/不稳定
000130     $*     P0130 氧传感器电路 缸组 1, 传感器 1
000131     $*     P0131 氧传感器电路电压低 缸组 1, 传感器 1
000132     $*     P0132 氧传感器电路电压高 缸组 1, 传感器 1
000133     $*     P0133 氧传感器电路响应慢 缸组 1, 传感器 1
000134     $*     P0134 氧传感器电路未检测到激活 缸组 1, 传感器 1
000135     $*     P0135 氧传感器加热器电路 缸组 1, 传感器 1
000136     $*     P0136 氧传感器电路 缸组 1, 传感器 2
000137     $*     P0137 氧传感器电路电压低 缸组 1, 传感器 2
000138     $*     P0138 氧传感器电路电压高 缸组 1, 传感器 2
000139     $*     P0139 氧传感器电路响应慢 缸组 1, 传感器 2
00013a     $*     P013A 氧传感器响应慢 - 浓至稀 缸组 1, 传感器 2
00013b     $*     P013B 氧传感器响应慢 - 稀至浓 缸组 1, 传感器 2
00013c     $*     P013C 氧传感器响应慢 - 浓至稀 缸组 2, 传感器 2
00013d     $*     P013D 氧传感器响应慢 - 稀至浓 缸组 2, 传感器 2
00013e     $*     P013E 氧传感器延迟响应 - 浓至稀 缸组 2, 传感器 2
00013f     $*     P013F 氧传感器延迟响应 - 稀至浓 缸组 1, 传感器 2
000100     $*     P0100 气流质量或体积 A 电路
000101     $*     P0101 气流质量或体积 A 电路范围/性能
000102     $*     P0102 气流质量或体积 A 电路低
000103     $*     P0103 气流质量或体积 A 电路高
000104     $*     P0104 气流质量或体积 A 电路间歇性故障
000105     $*     P0105 歧管绝对压力/大气压力电路
000106     $*     P0106 歧管绝对压力/大气压力电路范围/性能
000107     $*     P0107 歧管绝对压力/大气压力电路低
000108     $*     P0108 歧管绝对压力/大气压力电路高
000109     $*     P0109 歧管绝对压力/大气压力电路间歇性故障
00010a     $*     P010A 气流质量或体积 B 电路
00010b     $*     P010B 气流质量或体积 B 电路范围/性能
00010c     $*     P010C 气流质量或体积 B 电路低
00010d     $*     P010D 气流质量或体积 B 电路高
00010e     $*     P010E 气流质量或体积 B 电路间歇性故障/不稳定
00010f     $*     P010F 气流质量或体积传感器 A/B  相互关系
000110     $*     P0110 进气温度传感器 1 电路
000111     $*     P0111 进气温度传感器 1 电路范围/性能
000112     $*     P0112 进气温度传感器 1 电路低
000113     $*     P0113 进气温度传感器 1 电路高
000114     $*     P0114 进气温度传感器 1 电路间歇性故障
000115     $*     P0115 发动机冷却液温度传感器 1 电路
000116     $*     P0116 发动机冷却液温度传感器 1 电路范围/性能
000117     $*     P0117 发动机冷却液温度传感器 1 电路低
000118     $*     P0118 发动机冷却液温度传感器 1 电路高
000119     $*     P0119 发动机冷却液温度传感器 1 电路间歇性故障
00011a     $*     P011A 发动机冷却液温度传感器 1/2 相互关系
00011b     $*     P011B 发动机冷却液温度/进气温度相互关系
00011c     $*     P011C 充气温度/进气温度相互关系 缸组 1
00011d     $*     P011D 充气温度/进气温度相互关系 缸组 2
0006c0     $*     P06C0 汽缸 8 预热塞电路范围/性能
0006c1     $*     P06C1 汽缸 9 预热塞电路范围/性能
0006c2     $*     P06C2 汽缸 10 预热塞电路范围/性能
0006c3     $*     P06C3 汽缸 11 预热塞电路范围/性能
0006c4     $*     P06C4 汽缸 12 预热塞电路范围/性能
0006c5     $*     P06C5 汽缸 1 预热塞不正确
0006c6     $*     P06C6 汽缸 2 预热塞不正确
0006c7     $*     P06C7 汽缸 3 预热塞不正确
0006c8     $*     P06C8 汽缸 4 预热塞不正确
0006c9     $*     P06C9 汽缸 5 预热塞不正确
0006ca     $*     P06CA 汽缸 6 预热塞不正确
0006cb     $*     P06CB 汽缸 7 预热塞不正确
0006cc     $*     P06CC 汽缸 8 预热塞不正确
0006cd     $*     P06CD 汽缸 9 预热塞不正确
0006ce     $*     P06CE 汽缸 10 预热塞不正确
0006cf     $*     P06CF 汽缸 11 预热塞不正确
0006d0     $*     P06D0 汽缸 12 预热塞不正确
0006d1     $*     P06D1 内部控制模块点火线圈控制性能
0006a0     $*     P06A0 可变空调压缩机控制电路
0006a1     $*     P06A1 可变空调压缩机控制电路低
0006a2     $*     P06A2 可变空调压缩机控制电路高
0006a3     $*     P06A3 传感器参考电压 'D' 电路/开路
0006a4     $*     P06A4 传感器参考电压 'D' 电路低
0006a5     $*     P06A5 传感器参考电压 'D' 电路高
0006a6     $*     P06A6 传感器参考电压 'A' 电路范围/性能
0006a7     $*     P06A7 传感器参考电压 'B' 电路范围/性能
0006a8     $*     P06A8 传感器参考电压 'C' 电路范围/性能
0006a9     $*     P06A9 传感器参考电压 'D' 电路范围/性能
0006aa     $*     P06AA 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器 'B' 过高
0006ab     $*     P06AB 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器 'B' 电路
0006ac     $*     P06AC 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器 'B' 范围/性能
0006ad     $*     P06AD 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器 'B' 电路低
0006ae     $*     P06AE 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器 'B' 电路高
0006af     $*     P06AF 扭矩管理系统 - 强迫发动机熄火
0006b0     $*     P06B0 传感器电源 'A' 电路/开路
0006b1     $*     P06B1 传感器电源 'A' 电路低
0006b2     $*     P06B2 传感器电源 'A' 电路高
0006b3     $*     P06B3 传感器电源 'B' 电路/开路
0006b4     $*     P06B4 传感器电源 'B' 电路低
0006b5     $*     P06B5 传感器电源 'B' 电路高
0006b6     $*     P06B6 内部控制模块爆震传感器处理器 1 性能
0006b7     $*     P06B7 内部控制模块爆震传感器处理器 2 性能
0006b8     $*     P06B8 内部控制模块非易失性随机存取存储器 (NVRAM) 错误
0006b9     $*     P06B9 汽缸 1 预热塞电路范围/性能
0006ba     $*     P06BA 汽缸 2 预热塞电路范围/性能
0006bb     $*     P06BB 汽缸 3 预热塞电路范围/性能
0006bc     $*     P06BC 汽缸 4 预热塞电路范围/性能
0006bd     $*     P06BD 汽缸 5 预热塞电路范围/性能
0006be     $*     P06BE 汽缸 6 预热塞电路范围/性能
0006bf     $*     P06BF 汽缸 7  预热塞电路范围/性能
000680     $*     P0680 汽缸 10 预热塞电路/开路
000681     $*     P0681 汽缸 11 预热塞电路/开路
000682     $*     P0682 汽缸 12 预热塞电路/开路
000683     $*     P0683 预热塞控制模块到动力总成控制模块通信电路
000684     $*     P0684 预热塞控制模块到动力总成控制模块通信电路范围/性能
000685     $*     P0685 发动机控制模块/动力控制模块电源继电器控制电路/开路
000686     $*     P0686 发动机控制模块/动力控制模块电源继电器控制电路低
000687     $*     P0687 发动机控制模块/动力控制模块电源继电器控制电路高
000688     $*     P0688 发动机控制模块/动力控制模块电源继电器感应电路/开路
000689     $*     P0689 发动机控制模块/动力控制模块电源继电器感应电路低
00068a     $*     P068A 发动机控制模块/动力控制模块电源继电器断电过早
00068b     $*     P068B 发动机控制模块/动力控制模块电源继电器断电过迟
00068c     $*     P068C 预热塞 7 控制电路低
00068d     $*     P068D 预热塞 7 控制电路高
00068e     $*     P068E 预热塞 8 控制电路低
00068f     $*     P068F 预热塞 8 控制电路高
000690     $*     P0690 发动机控制模块/动力控制模块电源继电器感应电路高
000691     $*     P0691 风扇 1 控制电路低
000692     $*     P0692 风扇 1 控制电路高
000693     $*     P0693 风扇 2 控制电路低
000694     $*     P0694 风扇 2 控制电路高
000695     $*     P0695 风扇 3 控制电路低
000696     $*     P0696 风扇 3 控制电路高
000697     $*     P0697 传感器参考电压 C 电路/开路
000698     $*     P0698 传感器参考电压 C 电路低
000699     $*     P0699 传感器参考电压 C 电路高
00069a     $*     P069A 预热塞 9 控制电路低
00069b     $*     P069B 预热塞 9 控制电路高
00069c     $*     P069C 预热塞 10 控制电路低
00069d     $*     P069D 预热塞 10 控制电路高
00069e     $*     P069E 燃油泵控制模块要求故障指示灯亮
00069f     $*     P069F 节气门执行器控制灯控制电路
000660     $*     P0660 进气歧管调节阀控制电路/开路 缸组 1a
000661     $*     P0661 进气歧管调节阀控制电路低 缸组 1a
000662     $*     P0662 进气歧管调节阀控制电路高 缸组 1a
000663     $*     P0663 进气歧管调节阀控制电路/开路 缸组 2a
000664     $*     P0664 进气歧管调节阀控制电路低 缸组 2a
000665     $*     P0665 进气歧管调节阀控制电路高 缸组 2a
000666     $*     P0666 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器电路
000667     $*     P0667 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器范围/性能
000668     $*     P0668 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器电路低
000669     $*     P0669 动力控制模块/发动机控制模块/变速箱控制模块内部温度传感器电路高
00066a     $*     P066A 预热塞 1 控制电路低
00066b     $*     P066B 预热塞 1 控制电路高
00066c     $*     P066C 预热塞 2 控制电路低
00066d     $*     P066D 预热塞 2 控制电路高
00066e     $*     P066E 预热塞 3 控制电路低
00066f     $*     P066F 预热塞 3 控制电路高
000670     $*     P0670 预热塞控制模块控制电路/开路
000671     $*     P0671 汽缸 1 预热塞电路/开路
000672     $*     P0672 汽缸 2 预热塞电路/开路
000673     $*     P0673 汽缸 3 预热塞电路/开路
000674     $*     P0674 汽缸 4 预热塞电路/开路
000675     $*     P0675 汽缸 5 预热塞电路/开路
000676     $*     P0676 汽缸 6 预热塞电路/开路
000677     $*     P0677 汽缸 7 预热塞电路/开路
000678     $*     P0678 汽缸 8 预热塞电路/开路
000679     $*     P0679 汽缸 9 预热塞电路/开路
00067a     $*     P067A 预热塞 4 控制电路低
00067b     $*     P067B 预热塞 4 控制电路高
00067c     $*     P067C 预热塞 5 控制电路低
00067d     $*     P067D 预热塞 5 控制电路高
00067e     $*     P067E 预热塞 6 控制电路低
00067f     $*     P067F 预热塞 6 控制电路高
000640     $*     P0640 进气加热器控制电路
000641     $*     P0641 传感器参考电压 A 电路/开路
000642     $*     P0642 传感器参考电压 A 电路低
000643     $*     P0643 传感器参考电压 A 电路高
000644     $*     P0644 驱动器显示串行通信电路
000645     $*     P0645 空调离合器继电器控制电路
000646     $*     P0646 空调离合器继电器控制电路低
000647     $*     P0647 空调离合器继电器控制电路高
000648     $*     P0648 防盗器指示灯控制电路
000649     $*     P0649 速度控制灯控制电路
00064a     $*     P064A 燃油泵控制模块
00064b     $*     P064B 动力输出控制模块
00064c     $*     P064C 预热塞控制模块
00064d     $*     P064D 内部控制模块氧传感器处理器性能
00064e     $*     P064E 内部控制模块氧传感器处理器性能
00064f     $*     P064F 检测到未经授权的软件/标定
000650     $*     P0650 故障指示灯 (MIL) 控制电路
000651     $*     P0651 传感器参考电压 B 电路/开路
000652     $*     P0652 传感器参考电压 B 电路低
000653     $*     P0653 传感器参考电压 B 电路高
000654     $*     P0654 发动机转速输出电路
000655     $*     P0655 发动机过热警告灯输出控制电路
000656     $*     P0656 燃油液位输出电路
000657     $*     P0657 执行器电源电压 A 电路/开路
000658     $*     P0658 执行器电源电压 A 电路低
000659     $*     P0659 执行器电源电压 A 电路高
00065a     $*     P065A 发电机系统性能
00065b     $*     P065B 发电机控制电路范围/性能
00065c     $*     P065C 发电机机械性能
00065d     $*     P065D 还原剂系统故障灯控制电路
00065e     $*     P065E 进气歧管调节阀性能
00065f     $*     P065F 进气歧管调节阀性能
000620     $*     P0620 发电机控制电路
000621     $*     P0621 发电机灯/L 端子电路
000622     $*     P0622 发电机磁场/F 端子电路
000623     $*     P0623 发电机灯控制电路
000624     $*     P0624 燃油盖灯控制电路
000625     $*     P0625 发电机磁场/F 端子电路低
000626     $*     P0626 发电机磁场/F 端子电路高
000627     $*     P0627 燃油泵 A 控制电路/开路
000628     $*     P0628 燃油泵 A 控制电路低
000629     $*     P0629 燃油泵 A 控制电路高
00062a     $*     P062A 燃油泵 A 控制电路范围/性能
00062b     $*     P062B 内部控制模块燃油喷油嘴控制性能
00062c     $*     P062C 内部控制模块车速性能
00062d     $*     P062D 燃油喷油嘴驱动电路性能缸组 1
00062e     $*     P062E 燃油喷油嘴驱动电路性能缸组 2
00062f     $*     P062F 内部控制模块 EEPROM(电可擦除只读存储器) 错误
000630     $*     P0630 VIN 未编程或不兼容的发动机控制模块/动力控制模块
000631     $*     P0631 VIN 未编程或不兼容的变速箱控制模块
000632     $*     P0632 里程表未编程的发动机控制模块/动力控制模块
000633     $*     P0633 防盗器钥匙未编程的发动机控制模块/动力控制模块
000634     $*     P0634 动力控制模块/发动机控制模块/变速器控制模块内部温度过高
000635     $*     P0635 动力转向控制电路
000636     $*     P0636 动力转向控制电路低
000637     $*     P0637 动力转向控制电路高
000638     $*     P0638 节气门执行器控制范围/性能 缸组 1
000639     $*     P0639 节气门执行器控制范围/性能 缸组 2
00063a     $*     P063A 发电机电压感应电路
00063b     $*     P063B 发电机电压感应电路范围/性能
00063c     $*     P063C 发电机电压感应电路低
00063d     $*     P063D 发电机电压感应电路高
00063e     $*     P063E 没有自动配置节气门输入
00063f     $*     P063F 没有自动配置发动机冷却液温度输入
000600     $*     P0600 串行通信链路
000601     $*     P0601 内部控制模块存储器校验和错误
000602     $*     P0602 控制模块编程错误
000603     $*     P0603 内部控制模块活性存储器 (KAM) 错误
000604     $*     P0604 内部控制模块随机存取存储器 (RAM) 错误
000605     $*     P0605 内部控制模块只读存储器 (ROM) 错误
000606     $*     P0606 发动机控制模块/动力系统控制模块处理器
000607     $*     P0607 控制模块性能
000608     $*     P0608 控制模块车速传感器输出 A
000609     $*     P0609 控制模块车速传感器输出 B
00060a     $*     P060A 内部控制模块监视处理器性能
00060b     $*     P060B 内部控制模块 A/D 处理性能
00060c     $*     P060C 内部控制模块主处理器性能
00060d     $*     P060D 内部控制模块加速踏板位置性能
00060e     $*     P060E 内部控制模块节气门位置性能
00060f     $*     P060F 内部控制模块冷却液温度性能
000610     $*     P0610 控制模块车辆选择错误
000611     $*     P0611 燃油喷油嘴控制模块性能
000612     $*     P0612 燃油喷油嘴控制模块继电器控制
000613     $*     P0613 变速箱控制模块处理器
000614     $*     P0614 发动机控制模块/变速箱控制模块不兼容
000615     $*     P0615 起动器继电器电路
000616     $*     P0616 起动器继电器电路低
000617     $*     P0617 起动器继电器电路高
000618     $*     P0618 备用燃油控制模块活性存储器错误
000619     $*     P0619 备用燃油控制模块随机存取存储器/只读存储器错误
00061a     $*     P061A 内部控制模块扭矩性能
00061b     $*     P061B 内部控制模块扭矩计算性能
00061c     $*     P061C 内部控制模块发动机转速性能
00061d     $*     P061D 内部控制模块发动机空气质量性能
00061e     $*     P061E 内部控制模块制动信号性能
00061f     $*     P061F 内部控制模块节气门执行器控制器性能
0007a0     $*     P07A0 检测到变速箱摩擦组件 'G' 打滑
0007a1     $*     P07A1 检测到变速箱摩擦组件 'H' 打滑
0007a2     $*     P07A2 变速箱摩擦组件 'A' 性能故障/卡滞在关闭位置
0007a3     $*     P07A3 变速箱摩擦组件 'A' 卡滞在接通位置
0007a4     $*     P07A4 变速箱摩擦组件 'B' 性能故障/卡滞在关闭位置
0007a5     $*     P07A5 变速箱摩擦组件 'B' 卡滞在接通位置
0007a6     $*     P07A6 变速箱摩擦组件 'C' 性能故障/卡滞在关闭位置
0007a7     $*     P07A7 变速箱摩擦组件 'C' 卡滞在接通位置
0007a8     $*     P07A8 变速箱摩擦组件 'D' 性能故障/卡滞在关闭位置
0007a9     $*     P07A9 变速箱摩擦组件 'D' 卡滞在接通位置
0007aa     $*     P07AA 变速箱摩擦组件 'E' 性能故障/卡滞在关闭位置
0007ab     $*     P07AB 变速箱摩擦组件 'E' 卡滞在接通位置
0007ac     $*     P07AC 变速箱摩擦组件 'F' 性能故障/卡滞在关闭位置
0007ad     $*     P07AD 变速箱摩擦组件 'F' 卡滞在接通位置
0007ae     $*     P07AE 变速箱摩擦组件 'G' 性能故障/卡滞在关闭位置
0007af     $*     P07AF 变速箱摩擦组件 'G' 卡滞在接通位置
0007b0     $*     P07B0 变速箱摩擦组件 'H' 性能故障/卡滞在关闭位置
0007b1     $*     P07B1 变速箱摩擦组件 'H' 卡滞在接通位置
0007b2     $*     P07B2 变速箱驻车位置传感器/开关 'A' 电路/开路
0007b3     $*     P07B3 变速箱驻车位置传感器/开关 'A' 电路低
0007b4     $*     P07B4 变速箱驻车位置传感器/开关 'A' 电路高
0007b5     $*     P07B5 变速箱驻车位置传感器/开关 'A' 性能低
0007b6     $*     P07B6 变速箱驻车位置传感器/开关 'A' 性能高
0007b7     $*     P07B7 变速箱驻车位置传感器/开关 'A' 电路间歇性故障/不稳定
0007b8     $*     P07B8 变速箱驻车位置传感器/开关 'B' 电路/开路
0007b9     $*     P07B9 变速箱驻车位置传感器/开关 'B' 电路低
0007ba     $*     P07BA 变速箱驻车位置传感器/开关 'B' 电路高
0007bb     $*     P07BB 变速箱驻车位置传感器/开关 'B' 性能低
0007bc     $*     P07BC 变速箱驻车位置传感器/开关 'B' 性能高
0007bd     $*     P07BD 变速箱驻车位置传感器/开关 'B' 电路间歇性故障/不稳定
0007be     $*     P07BE 变速箱驻车位置传感器/开关 'A'/'B' 相互关系
000780     $*     P0780 换档错误
000781     $*     P0781 1 - 2 换档
000782     $*     P0782 2 - 3 换档
000783     $*     P0783 3 - 4 换档
000784     $*     P0784 4 - 5 换档
000785     $*     P0785 换档/正时电磁阀
000786     $*     P0786 换档/正时电磁阀范围/性能
000787     $*     P0787 换档/正时电磁阀低
000788     $*     P0788 换档/正时电磁阀高
000789     $*     P0789 换档/正时电磁阀间歇性故障
00078a     $*     P078A 换档正时电磁阀 'B'
00078b     $*     P078B 换档正时电磁阀 'B' 范围/性能
00078c     $*     P078C 换档正时电磁阀 'B' 低
00078d     $*     P078D 换档正时电磁阀 'B' 高
00078e     $*     P078E 换档正时电磁阀 'B' 间歇性故障
000790     $*     P0790 正常/性能开关电路
000791     $*     P0791 中间轴转速传感器 A 电路
000792     $*     P0792 中间轴转速传感器 A 电路范围/性能
000793     $*     P0793 中间轴转速传感器 A 电路无信号
000794     $*     P0794 中间轴转速传感器 A 电路间歇性故障
000795     $*     P0795 压力控制电磁阀 C
000796     $*     P0796 压力控制电磁阀 C 性能故障/卡滞在关闭位置
000797     $*     P0797 压力控制电磁阀 C 卡滞在开启位置
000798     $*     P0798 压力控制电磁阀 C 电气故障
000799     $*     P0799 压力控制电磁阀 C 间歇性故障
00079a     $*     P079A 检测到变速箱摩擦组件 'A' 打滑
00079b     $*     P079B 检测到变速箱摩擦组件 'B' 打滑
00079c     $*     P079C 检测到变速箱摩擦组件 'C' 打滑
00079d     $*     P079D 检测到变速箱摩擦组件 'D' 打滑
00079e     $*     P079E 检测到变速箱摩擦组件 'E' 打滑
00079f     $*     P079F 检测到变速箱摩擦组件 'F' 打滑
000760     $*     P0760 换档电磁阀 C
000761     $*     P0761 换档电磁阀 C 性能故障/卡滞在关闭位置
000762     $*     P0762 换档电磁阀 C 卡滞在接通位置
000763     $*     P0763 换档电磁阀 C 电气故障
000764     $*     P0764 换档电磁阀 C 间歇性故障
000765     $*     P0765 换档电磁阀 D
000766     $*     P0766 换档电磁阀 D 性能故障/卡滞在关闭位置
000767     $*     P0767 换档电磁阀 D 卡滞在接通位置
000768     $*     P0768 换档电磁阀 D 电气故障
000769     $*     P0769 换档电磁阀 D 间歇性故障
00076a     $*     P076A 换档电磁阀 H
00076b     $*     P076B 换档电磁阀 H 性能故障/卡滞在关闭位置
00076c     $*     P076C 换档电磁阀 H 卡滞在接通位置
00076d     $*     P076D 换档电磁阀 H 电气故障
00076e     $*     P076E 换档电磁阀 H 间歇性故障
00076f     $*     P076F 档位 7 传动比不正确
000770     $*     P0770 换档电磁阀 E
000771     $*     P0771 换档电磁阀 E 性能故障/卡滞在关闭位置
000772     $*     P0772 换档电磁阀 E 卡滞在接通位置
000773     $*     P0773 换档电磁阀 E 电气故障
000774     $*     P0774 换档电磁阀 E 间歇性故障
000775     $*     P0775 压力控制电磁阀 B
000776     $*     P0776 压力控制电磁阀 B 性能故障/卡滞在关闭位置
000777     $*     P0777 压力控制电磁阀 B 卡滞在接通位置
000778     $*     P0778 压力控制电磁阀 B 电气故障
000779     $*     P0779 压力控制电磁阀 B 间歇性故障
00077a     $*     P077A 输出转速传感器电路 - 方向信号丢失
00077b     $*     P077B 输出转速传感器电路 - 方向错误
000740     $*     P0740 液力变矩器离合器电路/开路
000741     $*     P0741 液力变矩器离合器电路性能故障/卡滞在关闭位置
000742     $*     P0742 液力变矩器离合器电路卡滞在接通位置
000743     $*     P0743 液力变矩器离合器电路
000744     $*     P0744 液力变矩器离合器电路间歇性故障
000745     $*     P0745 压力控制电磁阀 A
000746     $*     P0746 压力控制电磁阀 A 性能故障/卡滞在关闭位置
000747     $*     P0747 压力控制电磁阀 A 卡滞在接通位置
000748     $*     P0748 压力控制电磁阀 A 电气故障
000749     $*     P0749 压力控制电磁阀 A 间歇性故障
00074a     $*     P074A 不能啮合档位 2
00074b     $*     P074B 不能啮合档位 3
00074c     $*     P074C 不能啮合档位 4
00074d     $*     P074D 不能啮合档位 5
00074e     $*     P074E 不能啮合档位 6
00074f     $*     P074F 不能啮合档位 7
000750     $*     P0750 换档电磁阀 A
000751     $*     P0751 换档电磁阀 A 性能故障/卡滞在关闭位置
000752     $*     P0752 换档电磁阀 A 卡滞在接通位置
000753     $*     P0753 换档电磁阀 A 电气故障
000754     $*     P0754 换档电磁阀 A 间歇性故障
000755     $*     P0755 换档电磁阀 B
000756     $*     P0756 换档电磁阀 B 性能故障/卡滞在关闭位置
000757     $*     P0757 换档电磁阀 B 卡滞在接通位置
000758     $*     P0758 换档电磁阀 B 电气故障
000759     $*     P0759 换档电磁阀 B 间歇性故障
00075a     $*     P075A 换档电磁阀 G
00075b     $*     P075B 换档电磁阀 G 性能故障/卡滞在关闭位置
00075c     $*     P075C 换档电磁阀 G 卡滞在接通位置
00075d     $*     P075D 换档电磁阀 G 电气故障
00075e     $*     P075E 换档电磁阀 G 间歇性故障
000720     $*     P0720 输出转速传感器电路
000721     $*     P0721 输出转速传感器电路范围/性能
000722     $*     P0722 输出转速传感器电路无信号
000723     $*     P0723 输出转速传感器电路间歇性故障
000724     $*     P0724 制动器开关 B 电路高
000725     $*     P0725 发动机转速输入电路
000726     $*     P0726 发动机转速输入电路范围/性能
000727     $*     P0727 发动机转速输入电路无信号
000728     $*     P0728 发动机转速输入电路间歇性故障
000729     $*     P0729 6 档传动比不正确
00072a     $*     P072A 卡滞在空档
00072b     $*     P072B 卡滞在倒档
00072c     $*     P072C 卡滞在档位 1
00072d     $*     P072D 卡滞在档位 2
00072e     $*     P072E 卡滞在档位 3
00072f     $*     P072F 卡滞在档位 4
000730     $*     P0730 传动比不正确
000731     $*     P0731 1 档传动比不正确
000732     $*     P0732 2 档传动比不正确
000733     $*     P0733 3 档传动比不正确
000734     $*     P0734 4 档传动比不正确
000735     $*     P0735 5 档传动比不正确
000736     $*     P0736 倒车档传动比有误
000737     $*     P0737 变速箱控制模块发动机转速输出电路
000738     $*     P0738 变速箱控制模块发动机转速输出电路低
000739     $*     P0739 变速箱控制模块发动机转速输出电路高
00073a     $*     P073A 卡滞在档位 5
00073b     $*     P073B 卡滞在档位 6
00073c     $*     P073C 卡滞在档位 7
00073d     $*     P073D 不能啮合空档
00073e     $*     P073E 不能啮合倒档
00073f     $*     P073F 不能啮合档位 1
000700     $*     P0700 变速箱控制系统 (故障指示灯请求)
000701     $*     P0701 变速箱控制系统范围/性能
000702     $*     P0702 变速箱控制系统电路
000703     $*     P0703 制动器开关 B 电路
000704     $*     P0704 离合器开关输入电路
000705     $*     P0705 变速箱档位传感器 A 电路 (PRNDL 输入)
000706     $*     P0706 变速箱档位传感器 A 电路范围/性能
000707     $*     P0707 变速箱档位传感器 A 电路低
000708     $*     P0708 变速箱档位传感器 A 电路高
000709     $*     P0709 变速箱档位传感器 A 电路间歇性故障
00070a     $*     P070A 变速箱液位传感器电路
00070b     $*     P070B 变速箱液位传感器电路范围/性能
00070c     $*     P070C 变速箱液位传感器电路低
00070d     $*     P070D 变速箱液位传感器电路高
00070e     $*     P070E 变速箱液位传感器电路间歇性故障/不稳定
00070f     $*     P070F 变速箱液位过低
000710     $*     P0710 传动液温度传感器 A 电路
000711     $*     P0711 传动液温度传感器 A 电路范围/性能
000712     $*     P0712 传动液温度传感器 A 电路低
000713     $*     P0713 传动液温度传感器 A 电路高
000714     $*     P0714 传动液温度传感器 A 电路间歇性故障
000715     $*     P0715 输入/涡轮速度传感器 A 电路
000716     $*     P0716 输入/涡轮速度传感器 A 电路范围/性能
000717     $*     P0717 输入/涡轮速度传感器 A 电路无信号
000718     $*     P0718 输入/涡轮速度传感器 A 电路间歇性故障
000719     $*     P0719 制动器开关 B 电路低
00071a     $*     P071A 变速箱模式开关 A 电路
00071b     $*     P071B 变速箱模式开关 A 电路低
00071c     $*     P071C 变速箱模式开关 B 电路高
00071d     $*     P071D 变速箱模式开关 B 电路
00071e     $*     P071E 变速箱模式开关 B 电路低
00071f     $*     P071F 变速箱模式开关 B 电路高
0004a0     $*     P04A0 排气压力控制阀 'B' 范围/性能
0004a1     $*     P04A1 排气压力控制阀 'B' 低
0004a2     $*     P04A2 排气压力控制阀 'B' 高
0004a3     $*     P04A3 排气压力控制阀 'B' 间歇性故障
0004a4     $*     P04A4 排气压力控制阀 'B' 卡滞在打开位置
0004a5     $*     P04A5 排气压力控制阀 'B' 卡滞在关闭位置
0004a6     $*     P04A6 排气压力控制阀 'B' 位置传感器/开关电路
0004a7     $*     P04A7 排气压力控制阀 'B' 位置传感器/开关电路范围/性能
0004a8     $*     P04A8 排气压力控制阀 'B' 位置传感器/开关电路低
0004a9     $*     P04A9 排气压力控制阀 'B' 位置传感器/开关电路高
0004aa     $*     P04AA 排气压力控制阀 'B' 位置传感器/开关电路间歇性故障/不稳定
000480     $*     P0480 风扇 1 控制电路
000481     $*     P0481 风扇 2 控制电路
000482     $*     P0482 风扇 3 控制电路
000483     $*     P0483 风扇合理性检查
000484     $*     P0484 风扇电路电流过大
000485     $*     P0485 风扇电源/接地电路
000486     $*     P0486 废气再循环传感器 B 电路
000487     $*     P0487 废气再循环节气门控制电路 A /开路
000488     $*     P0488 废气再循环节气门控制电路 A 范围/性能
000489     $*     P0489 废气再循环控制电路 A 低
00048a     $*     P048A 排气压力控制阀 'A' 卡滞在关闭位置
00048b     $*     P048B 排气压力控制阀位置传感器/开关电路
00048c     $*     P048C 排气压力控制阀位置传感器/开关电路范围/性能
00048d     $*     P048D 排气压力控制阀位置传感器/开关电路低
00048e     $*     P048E 排气压力控制阀位置传感器/开关电路高
00048f     $*     P048F 排气压力控制阀位置传感器/开关电路间歇性故障/不稳定
000490     $*     P0490 废气再循环控制电路 A 高
000491     $*     P0491 二次空气喷射系统流量不足 缸组 1
000492     $*     P0492 二次空气喷射系统流量不足 缸组 2
000493     $*     P0493 风扇速度过快
000494     $*     P0494 风扇速度低
000495     $*     P0495 风扇速度高
000496     $*     P0496 蒸发排放系统高净化流
000497     $*     P0497 蒸发排放系统低净化流
000498     $*     P0498 蒸发排放系统通风阀控制电路低
000499     $*     P0499 蒸发排放系统通风阀控制电路高
00049a     $*     P049A 废气再循环 'B' 流量
00049b     $*     P049B 检测到废气再循环 'B' 流量不足
00049c     $*     P049C 检测到废气再循环 'B' 流量过大
00049d     $*     P049D 废气再循环 'A' 控制位置超过学习极限
00049e     $*     P049E 废气再循环 'B' 控制位置超过学习极限
00049f     $*     P049F 排气压力控制阀 'B'
000460     $*     P0460 燃油液位传感器 A 电路
000461     $*     P0461 燃油液位传感器 A 电路范围/性能
000462     $*     P0462 燃油液位传感器 A 电路低
000463     $*     P0463 燃油液位传感器 A 电路高
000464     $*     P0464 燃油液位传感器 A 电路间歇性故障
000465     $*     P0465 蒸发排放系统净化流传感器电路
000466     $*     P0466 蒸发排放系统净化流传感器电路范围/性能
000467     $*     P0467 蒸发排放系统净化流传感器电路低
000468     $*     P0468 蒸发排放系统净化流传感器电路高
000469     $*     P0469 蒸发排放系统净化流传感器电路间歇性故障
00046a     $*     P046A 催化剂温度传感器 1/2 相互关系
00046b     $*     P046B 催化剂温度传感器 1/2 相互关系
00046c     $*     P046C 废气再循环传感器 'A' 电路范围/性能
00046d     $*     P046D 废气再循环传感器 'A' 电路间歇性故障/不稳定
00046e     $*     P046E 废气再循环传感器 'B' 电路范围/性能
00046f     $*     P046F 废气再循环传感器 'B' 电路间歇性故障/不稳定
000470     $*     P0470 排气压力传感器 A 电路
000471     $*     P0471 排气压力传感器 A 电路范围//性能
000472     $*     P0472 排气压力传感器 A 电路低
000473     $*     P0473 排气压力传感器 A 电路高
000474     $*     P0474 排气压力传感器 A 电路间歇性故障/不稳定
000475     $*     P0475 排气压力控制阀
000476     $*     P0476 排气压力控制阀范围/性能
000477     $*     P0477 排气压力控制阀低
000478     $*     P0478 排气压力控制阀高
000479     $*     P0479 排气压力控制阀间歇性故障
00047a     $*     P047A 排气压力传感器 B 电路
00047b     $*     P047B 排气压力传感器 B 电路范围/性能
00047c     $*     P047C 排气压力传感器 B 电路低
00047d     $*     P047D 排气压力传感器 B 电路高
00047e     $*     P047E 排气压力传感器 B 电路间歇性故障/不稳定
00047f     $*     P047F 排气压力控制阀 'A' 卡滞在打开位置
000440     $*     P0440 蒸发排放系统
000441     $*     P0441 蒸发排放系统清洗流不正确
000442     $*     P0442 检测到蒸发排放系统泄漏 (少量泄漏)
000443     $*     P0443 蒸发排放系统净化控制阀电路
000444     $*     P0444 蒸发排放系统净化控制阀电路开路
000445     $*     P0445 蒸发排放系统净化控制阀电路短路
000446     $*     P0446 蒸发排放系统通风控制电路
000447     $*     P0447 蒸发排放系统通风控制电路开路
000448     $*     P0448 蒸发排放系统通风控制电路短路
000449     $*     P0449 蒸发排放系统通风阀/电磁阀电路
00044a     $*     P044A 废气再循环传感器 'C' 电路
00044b     $*     P044B 废气再循环传感器 'C' 电路范围/性能
00044c     $*     P044C 废气再循环传感器 'C' 电路低
00044d     $*     P044D 废气再循环传感器 'C' 电路高
00044e     $*     P044E 废气再循环传感器 'C' 电路间歇性故障/不稳定
00044f     $*     P044F 二次空气喷射系统开关阀 'A' 电路高
000450     $*     P0450 蒸发排放系统压力传感器/开关
000451     $*     P0451 蒸发排放系统压力传感器/开关范围/性能
000452     $*     P0452 蒸发排放系统压力传感器/开关低
000453     $*     P0453 蒸发排放系统压力传感器/开关高
000454     $*     P0454 蒸发排放系统压力传感器/开关间歇性故障
000455     $*     P0455 检测到蒸发排放系统泄漏 (大量泄漏)
000456     $*     P0456 检测到蒸发排放系统泄漏 (泄漏非常少)
000457     $*     P0457 检测到蒸发排放系统泄漏 (燃油盖松动/关闭)
000458     $*     P0458 燃蒸发排放系统净化控制阀电路低
000459     $*     P0459 燃蒸发排放系统净化控制阀电路高
00045a     $*     P045A 废气再循环 'B' 控制电路
00045b     $*     P045B 废气再循环 'B' 控制电路范围/性能
00045c     $*     P045C 废气再循环 'B' 控制电路低
00045d     $*     P045D 废气再循环 'B' 控制电路高
00045e     $*     P045E 废气再循环 'B' 控制卡滞在打开位置
00045f     $*     P045F 废气再循环 'B' 控制卡滞在关闭位置
000420     $*     P0420 催化剂系统效率低于阈值 缸组 1
000421     $*     P0421 预热催化剂效率低于阈值 缸组 1
000422     $*     P0422 主催化剂效率低于阈值 缸组 1
000423     $*     P0423 加热式催化剂效率低于阈值 缸组 1
000424     $*     P0424 加热式催化剂温度低于阈值 缸组 1
000425     $*     P0425 催化剂温度传感器电路 缸组 1, 传感器 1
000426     $*     P0426 催化剂温度传感器电路范围/性能 缸组 1, 传感器 1
000427     $*     P0427 催化剂温度传感器电路低 缸组 1, 传感器 1
000428     $*     P0428 催化剂温度传感器电路高 缸组 1, 传感器 1
000429     $*     P0429 催化剂加热器控制电路缸组 1
00042a     $*     P042A 催化剂温度传感器电路 缸组 1, 传感器 2
00042b     $*     P042B 催化剂温度传感器电路范围/性能 缸组 1, 传感器 2
00042c     $*     P042C 催化剂温度传感器电路低 缸组 1, 传感器 2
00042d     $*     P042D 催化剂温度传感器电路高 缸组 1, 传感器 2
00042e     $*     P042E 废气再循环 'A' 控制卡滞在打开位置
00042f     $*     P042F 废气再循环传感器 'A' 控制卡滞在关闭位置
000430     $*     P0430 催化剂系统效率低于阈值 缸组 2
000431     $*     P0431 预热催化剂效率低于阈值 缸组 2
000432     $*     P0432 主催化剂效率低于阈值 缸组 2
000433     $*     P0433 加热式催化剂效率低于阈值 缸组 2
000434     $*     P0434 加热式催化剂温度低于阈值 缸组 2
000435     $*     P0435 催化剂温度传感器电路 缸组 2, 传感器 1
000436     $*     P0436 催化剂温度传感器电路范围/性能 缸组 2, 传感器 1
000437     $*     P0437 催化剂温度传感器电路低 缸组 2, 传感器 1
000438     $*     P0438 催化剂温度传感器电路高 缸组 2, 传感器 1
000439     $*     P0439 催化剂加热器控制电路 缸组 2
00043a     $*     P043A 催化剂温度传感器电路 缸组 2, 传感器 2
00043b     $*     P043B 催化剂温度传感器电路范围/性能 缸组 2, 传感器 2
00043c     $*     P043C 催化剂温度传感器电路低 缸组 2, 传感器 2
00043d     $*     P043D 催化剂温度传感器电路高 缸组 2, 传感器 2
00043e     $*     P043E 蒸发排放系统泄漏检测到参考限流孔流量低
00043f     $*     P043F 蒸发排放系统泄漏检测到参考限流孔流量高
000400     $*     P0400 废气再循环流量
000401     $*     P0401 检测到废气再循环流量不足
000402     $*     P0402 检测到废气再循环被流量过大
000403     $*     P0403 废气再循环控制电路
000404     $*     P0404 废气再循环控制电路范围/性能
000405     $*     P0405 废气再循环传感器 A 电路低
000406     $*     P0406 废气再循环传感器 A 电路高
000407     $*     P0407 废气再循环传感器 B 电路低
000408     $*     P0408 废气再循环传感器 B 电路高
000409     $*     P0409 废气再循环传感器 A 电路
00040a     $*     P040A 废气再循环温度传感器 A 电路
00040b     $*     P040B 废气再循环温度传感器 A 电路范围/性能
00040c     $*     P040C 废气再循环温度传感器 A 电路低
00040d     $*     P040D 废气再循环温度传感器 A 电路高
00040e     $*     P040E 废气再循环温度传感器 A 电路间歇性故障/不稳定
00040f     $*     P040F 废气再循环温度传感器 A/B 相互关系
000410     $*     P0410 二次空气喷射系统
000411     $*     P0411 检测到二次空气喷射系统流量错误
000412     $*     P0412 二次空气喷射系统开关阀 A 电路
000413     $*     P0413 二次空气喷射系统开关阀 A 电路开路
000414     $*     P0414 二次空气喷射系统开关阀 A 电路短路
000415     $*     P0415 二次空气喷射系统开关阀 B 电路
000416     $*     P0416 二次空气喷射系统开关阀 B 电路开路
000417     $*     P0417 二次空气喷射系统开关阀 B 电路短路
000418     $*     P0418 二次空气喷射系统控制 A 电路
000419     $*     P0419 二次空气喷射系统控制 B 电路
00041a     $*     P041A 废气再循环温度传感器 B 电路
00041b     $*     P041B 废气再循环温度传感器 B 电路范围/性能
00041c     $*     P041C 废气再循环温度传感器 B 电路低
00041d     $*     P041D 废气再循环温度传感器 B 电路高
00041e     $*     P041E 废气再循环温度传感器 B 电路间歇性故障/不稳定
00041f     $*     P041F 二次空气喷射系统开关阀 A 电路低
000580     $*     P0580 巡航控制多功能输入 A 电路低
000581     $*     P0581 巡航控制多功能输入 A 电路高
000582     $*     P0582 巡航控制真空控制电路/开路
000583     $*     P0583 巡航控制真空控制电路低
000584     $*     P0584 巡航控制真空控制电路高
000585     $*     P0585 巡航控制多功能输入 A/B 相互关系
000586     $*     P0586 巡航控制通风控制电路/开路
000587     $*     P0587 巡航控制通风控制电路低
000588     $*     P0588 巡航控制通风控制电路高
000589     $*     P0589 巡航控制多功能输入 B 电路
000590     $*     P0590 巡航控制多功能输入 B 电路卡滞
000591     $*     P0591 巡航控制多功能输入 B 电路范围/性能
000592     $*     P0592 巡航控制多功能输入 B 电路低
000593     $*     P0593 巡航控制多功能输入 B 电路高
000594     $*     P0594 巡航控制伺服控制电路/开路
000595     $*     P0595 巡航控制伺服控制电路低
000596     $*     P0596 巡航控制伺服控制电路高
000597     $*     P0597 恒温器加热器控制电路/开路
000598     $*     P0598 恒温器加热器控制电路低
000599     $*     P0599 恒温器加热器控制电路高
000560     $*     P0560 系统电压
000561     $*     P0561 系统电压不稳定
000562     $*     P0562 系统电压低
000563     $*     P0563 系统电压高
000564     $*     P0564 巡航控制多功能输入 A 电路
000565     $*     P0565 巡航控制接通讯号
000566     $*     P0566 巡航控制器关闭信号
000567     $*     P0567 巡航控制器恢复信号
000568     $*     P0568 巡航控制器设定信号
000569     $*     P0569 巡航控制滑行信号
00056a     $*     P056A 巡航控制增加距离信号
00056b     $*     P056B 巡航控制减少距离信号
000570     $*     P0570 巡航控制器加速信号
000571     $*     P0571 制动开关 A 电路
000572     $*     P0572 制动器开关 A 电路低
000573     $*     P0573 制动开关 A 电路高
000574     $*     P0574 巡航控制系统车速过高
000575     $*     P0575 巡航控制输入电路
000576     $*     P0576 巡航控制输入电路低
000577     $*     P0577 巡航控制输入电路高
000578     $*     P0578 巡航控制多功能输入 A 电路卡滞
000579     $*     P0579 巡航控制多功能输入 A 电路范围/性能
000540     $*     P0540 进气空气加热器 A 电路
000541     $*     P0541 进气空气加热器 A 电路低
000542     $*     P0542 进气空气加热器 A 电路高
000543     $*     P0543 进气空气加热器 A 电路开路
000544     $*     P0544 废气温度传感器电路 缸组 1, 传感器 1
000545     $*     P0545 废气温度传感器电路低 缸组 1, 传感器 1
000546     $*     P0546 废气温度传感器电路高 缸组 1, 传感器 1
000547     $*     P0547 废气温度传感器电路 缸组 2, 传感器 1
000548     $*     P0548 废气温度传感器电路低 缸组 2, 传感器 1
000549     $*     P0549 废气温度传感器电路高 缸组 2, 传感器 1
00054a     $*     P054A 冷启动 'B' 凸轮轴位置正时过度提前 缸组 1
00054b     $*     P054B 冷启动 'B' 凸轮轴位置正时过度延迟 缸组 1
00054c     $*     P054C 冷启动 'B' 凸轮轴位置正时过度提前 缸组 2
00054d     $*     P054D 冷启动 'B' 凸轮轴位置正时过度延迟 缸组 2
000550     $*     P0550 动力转向压力传感器/开关电路
000551     $*     P0551 动力转向压力传感器/开关电路范围/性能
000552     $*     P0552 动力转向压力传感器/开关电路低
000553     $*     P0553 动力转向压力传感器/开关电路高
000554     $*     P0554 动力转向压力传感器/开关电路间歇性故障
000555     $*     P0555 制动加力器压力传感器电路
000556     $*     P0556 制动加力器压力传感器电路范围/性能
000557     $*     P0557 制动加力器压力传感器电路低
000558     $*     P0558 制动加力器压力传感器电路高
000559     $*     P0559 制动加力器压力传感器电路间歇性故障
000520     $*     P0520 发动机机油压力传感器/开关电路
000521     $*     P0521 发动机机油压力传感器/开关范围/性能
000522     $*     P0522 发动机机油压力传感器/开关低
000523     $*     P0523 发动机机油压力传感器/开关高
000524     $*     P0524 发动机机油压力过低
000525     $*     P0525 巡航控制伺服控制电路范围/性能
000526     $*     P0526 风扇速度传感器电路
000527     $*     P0527 风扇速度传感器电路范围/性能
000528     $*     P0528 风扇速度传感器电路无信号
000529     $*     P0529 风扇速度传感器电路间歇性故障
00052a     $*     P052A 冷启动 'A' 凸轮轴位置正时过度提前 缸组 1
00052b     $*     P052B 冷启动 'A' 凸轮轴位置正时过度延迟 缸组 1
00052c     $*     P052C 冷启动 'A' 凸轮轴位置正时过度提前 缸组 2
00052d     $*     P052D 冷启动 'A' 凸轮轴位置正时过度延迟 缸组 2
00052e     $*     P052E 曲轴箱强制通风调节器阀性能
000530     $*     P0530 空调冷媒压力传感器 A 电路
000531     $*     P0531 空调冷媒压力传感器 A 电路范围/性能
000532     $*     P0532 空调冷媒压力传感器 A 电路低
000533     $*     P0533 空调冷媒压力传感器 A 电路高
000534     $*     P0534 空调冷媒加注损失
000535     $*     P0535 空调蒸发器温度传感器电路
000536     $*     P0536 空调蒸发器温度传感器电路范围/性能
000537     $*     P0537 空调蒸发器温度传感器电路低
000538     $*     P0538 空调蒸发器温度传感器电路高
000539     $*     P0539 空调蒸发器温度传感器电路间歇性故障
00053a     $*     P053A 曲轴箱强制通风加热器控制电路/开路
00053b     $*     P053B 曲轴箱强制通风加热器控制电路低
00053c     $*     P053C 曲轴箱强制通风加热器控制电路高
000500     $*     P0500 车速传感器 A
000501     $*     P0501 车速传感器 A 范围/性能
000502     $*     P0502 车速传感器 A 电路低
000503     $*     P0503 车速传感器 A 间歇性故障/不稳定/高
000504     $*     P0504 制动器开关 A/B 相互关系
000505     $*     P0505 怠速空气控制系统
000506     $*     P0506 怠速空气控制系统转速低于预期值
000507     $*     P0507 怠速空气控制系统转速高于预期值
000508     $*     P0508 怠速空气控制系统电路低
000509     $*     P0509 怠速空气控制系统电路高
00050a     $*     P050A 冷起动怠速空气控制系统性能
00050b     $*     P050B 冷起动点火正时性能
00050c     $*     P050C 冷起动发动机冷却液温度性能
00050d     $*     P050D 冷起动怠速不稳定
00050e     $*     P050E 冷启动发动机排气温度过低
00050f     $*     P050F 煞车辅助真空过低
000510     $*     P0510 关闭节气门位置开关
000511     $*     P0511 怠速空气控制电路
000512     $*     P0512 启动器请求电路
000513     $*     P0513 防盗钥匙不正确
000514     $*     P0514 电瓶温度传感器电路范围/性能
000515     $*     P0515 电瓶温度传感器电路
000516     $*     P0516 电瓶温度传感器电路低
000517     $*     P0517 电瓶温度传感器电路高
000518     $*     P0518 怠速空气控制电路间歇性故障
000519     $*     P0519 怠速空气控制系统性能
00051a     $*     P051A 曲轴箱压力传感器电路
00051b     $*     P051B 曲轴箱压力传感器电路范围/性能
00051c     $*     P051C 曲轴箱压力传感器电路低
00051d     $*     P051D 曲轴箱压力传感器电路高
00051e     $*     P051E 曲轴箱压力传感器电路间歇性故障/不稳定
00051f     $*     P051F 曲轴箱强制通风过滤器受限
001297     $*     P1297 节气门前空气泄露
001336     $*     P1336 电子节气门安全监控扭矩限制作用
001000     $*     P1000 空气流量计信号超下限
001001     $*     P1001 空气流量计信号超上限
001677     $*     P1677 检测灯(SVS)控制电路电压过高
001678     $*     P1678 检测灯(SVS)控制电路电压过低
001679     $*     P1679 检测灯(SVS)控制电路故障
001648     $*     P1648 CAN-BUS
001651     $*     P1651 SVS灯驱动级电路对地短路
001604     $*     P1604 电子节气门增益调节自学习故障
001610     $*     P1610 SecretKey与SecurityCode未编程错误
001611     $*     P1611 SecurityCode接收错误
001612     $*     P1612 Challenge请求失败
001613     $*     P1613 IMMOCode请求失败
001614     $*     P1614 Transponder校验错误
001564     $*     P1564 系统电压不满足电子节气门自学习条件
001565     $*     P1565 电子节气门下限位置初始化自学习故障
001568     $*     P1568 电子节气门回位阻力过大
001579     $*     P1579 电子节气门自学习条件不满足
001545     $*     P1545 电子节气门实际位置与目标位置偏差超限
001558     $*     P1558 电子节气门开启阻力过大
001559     $*     P1559 电子节气门自学习过程故障
002a00     $*     P2A00 氧传感器电路范围/性能 缸组 1 传感器 1
002a01     $*     P2A01 氧传感器电路范围/性能缸组 1 传感器 2
002a02     $*     P2A02 氧传感器电路范围/性能 缸组 1 传感器 3
002a03     $*     P2A03 氧传感器电路范围/性能 缸组 2 传感器 1
002a04     $*     P2A04 氧传感器电路范围/性能 缸组 2 传感器 2
002a05     $*     P2A05 氧传感器电路范围/性能 缸组 2 传感器 3
002a06     $*     P2A06 氧传感器负电压 缸组 1 传感器 1
002a07     $*     P2A07 氧传感器负电压 缸组 1 传感器 2
002a08     $*     P2A08 氧传感器负电压 缸组 1 传感器 3
002a09     $*     P2A09 氧传感器负电压 缸组 2 传感器 1
002a10     $*     P2A10 氧传感器负电压 缸组 2 传感器 2
002a11     $*     P2A11 氧传感器负电压 缸组 2 传感器 3
002ba7     $*     P2BA7 氮氧化合物超标 - 空试剂箱
002ba8     $*     P2BA8 氮氧化合物超标 - 试剂给量过程中断
002ba9     $*     P2BA9 氮氧化合物超标 - 试剂质量不足
002baa     $*     P2BAA 氮氧化合物超标 - 试剂消耗量低
002bab     $*     P2BAB 氮氧化合物超标 - 废气再循环系统流量不正确
002bac     $*     P2BAC 氮氧化合物超标 - 废气再循环系统关闭
002bad     $*     P2BAD 氮氧化合物超标 - 根本故障原因未知
002bae     $*     P2BAE 氮氧化合物超标 - 氮氧化合物监控系统
002840     $*     P2840 挂档叉 'D' 位置电路
002841     $*     P2841 挂档叉 'D' 位置电路范围/性能
002842     $*     P2842 挂档叉 'D' 位置电路低
002843     $*     P2843 挂档叉 'D' 位置电路高
002844     $*     P2844 挂档叉 'D' 位置电路间歇性故障
002845     $*     P2845 挂档叉 'A' 位置传感器错误, 指示空档
002846     $*     P2846 挂档叉 'B' 位置传感器错误, 指示空档
002847     $*     P2847 挂档叉 'C' 位置传感器错误, 指示空档
002848     $*     P2848 挂档叉 'D' 位置传感器错误, 指示空档
002849     $*     P2849 挂档叉 'A' 卡滞
00284a     $*     P284A 挂档叉 'B' 卡滞
00284b     $*     P284B 挂档叉 'C' 卡滞
00284c     $*     P284C 挂档叉 'D' 卡滞
00284d     $*     P284D 挂档叉 'A' 未请求的移动
00284e     $*     P284E 挂档叉 'B' 未请求的移动
00284f     $*     P284F 挂档叉 'C' 未请求的移动
002850     $*     P2850 挂档叉 'D' 未请求的移动
002851     $*     P2851 挂档叉位置传感器 'A'/'B' 相互性
002852     $*     P2852 挂档叉位置传感器 'C'/'D' 相互性
002853     $*     P2853 离合器 'A' 压力释放性能
002854     $*     P2854 离合器 'B' 压力释放性能
002855     $*     P2855 离合器 'A' 压力增加性能
002856     $*     P2856 离合器 'B' 压力增加性能
002857     $*     P2857 离合器 'A' 压力接合性能
002858     $*     P2858 离合器 'B' 压力接合性能
002859     $*     P2859 离合器 'A' 压力分离性能
00285a     $*     P285A 离合器 'B' 压力分离性能
002820     $*     P2820 压力控制电磁阀 J 性能/卡在断开位置
002821     $*     P2821 压力控制电磁阀 J 卡在接通位置
002822     $*     P2822 压力控制电磁阀 J 电气故障
002823     $*     P2823 压力控制电磁阀 J 间歇性故障
002824     $*     P2824 压力控制电磁阀 J 控制电路/开路
002825     $*     P2825 压力控制电磁阀 J 控制电路范围/性能
002826     $*     P2826 压力控制电磁阀 J 控制电路低
002827     $*     P2827 压力控制电磁阀 J 控制电路高
002828     $*     P2828 压力控制电磁阀 K
002829     $*     P2829 压力控制电磁阀 K 性能/卡在断开位置
00282a     $*     P282A 压力控制电磁阀 K 卡在接通位置
00282b     $*     P282B 压力控制电磁阀 K 电气故障
00282c     $*     P282C 压力控制电磁阀 K 间歇性故障
00282d     $*     P282D 压力控制电磁阀 K 控制电路/开路
00282e     $*     P282E 压力控制电磁阀 K 控制电路范围/性能
00282f     $*     P282F 压力控制电磁阀 K 控制电路低
002830     $*     P2830 压力控制电磁阀 K 控制电路高
002831     $*     P2831 挂档叉 'A' 位置电路
002832     $*     P2832 挂档叉 A 位置电路范围/性能
002833     $*     P2833 挂档叉 'A' 位置电路低
002834     $*     P2834 挂档叉 'A' 位置电路高
002835     $*     P2835 挂档叉 'A' 位置电路间歇性故障
002836     $*     P2836 挂档叉 'B' 位置电路
002837     $*     P2837 挂档叉 'B' 位置电路范围/性能
002838     $*     P2838 挂档叉 'B' 位置电路低
002839     $*     P2839 挂档叉 'B' 位置电路高
00283a     $*     P283A 挂档叉 'B' 位置电路间歇性故障
00283b     $*     P283B 挂档叉 'C' 位置电路
00283c     $*     P283C 挂档叉 'C' 位置电路范围/性能
00283d     $*     P283D 挂挡叉 'C' 位置电路低
00283e     $*     P283E 挂挡叉 'C' 位置电路高
00283f     $*     P283F 挂档叉 'C' 位置电路间歇性故障
002800     $*     P2800 变速器档位传感器 B 电路 (PRNDL输入)
002801     $*     P2801 变速器档位传感器 B 电路范围/性能
002802     $*     P2802 变速旗范围传感器 B 电路低
002803     $*     P2803 变速器范围传感器 B 电路高
002804     $*     P2804 变速器范围传感器 B 间歇性故障
002805     $*     P2805 变速器范围传感器 A/B 相关性
002806     $*     P2806 变速器范围传感器校准
002807     $*     P2807 压力控制电磁阀 G
002808     $*     P2808 压力控制电磁阀 G 性能故障/卡在断开位置
002809     $*     P2809 压力控制电磁阀 G 卡在接通位置
00280a     $*     P280A 变速器范围传感器 'A' 电路未学习
00280b     $*     P280B 变速器范围传感器 'B' 电路未学习
002810     $*     P2810 压力控制电磁阀 G 电气故障
002811     $*     P2811 压力控制电磁阀 G 间歇性故障
002812     $*     P2812 压力控制电磁阀 G 控制电路/开路
002813     $*     P2813 压力控制电磁阀 G 控制电路范围/性能
002814     $*     P2814 压力控制电磁阀 G 控制电路低
002815     $*     P2815 压力控制电磁阀 G 控制电路高
002816     $*     P2816 压力控制电磁阀 H
002817     $*     P2817 压力控制电磁阀 H 性能故障/卡在断开位置
002818     $*     P2818 压力控制电磁阀 H 卡在接通位置
002819     $*     P2819 压力控制电磁阀 H 电气故障
00281a     $*     P281A 压力控制电磁阀 H 间歇性故障
00281b     $*     P281B 压力控制电磁阀 H 控制电路/开路
00281c     $*     P281C 压力控制电磁阀 H 控制电路范围/性能
00281d     $*     P281D 压力控制电磁阀 H 控制电路低
00281e     $*     P281E 压力控制电磁阀 H 控制电路高
00281f     $*     P281F 压力控制电磁阀 J
002280     $*     P2280 空气滤清器与空气流量（MAF）传感器之间空气流量限制/空气泄漏
002281     $*     P2281 空气流量（MAF）传感器与节气门体之间空气泄漏
002282     $*     P2282 节气门体与进气阀之间空气泄漏。
002283     $*     P2283 喷油嘴控制压力传感器电路
002284     $*     P2284 喷油嘴控制压力传感器电路范围/性能
002285     $*     P2285 喷油嘴控制压力传感器电路低
002286     $*     P2286 喷油嘴控制压力传感器电路高
002287     $*     P2287 喷油器控制压力传感器电路间歇性故障
002288     $*     P2288 喷油嘴控制压力过高
002289     $*     P2289 喷油嘴控制压力过高 - 发动机关闭
00228a     $*     P228A 燃油压力调节器 1 - 强制关闭发动机
00228b     $*     P228B 燃油压力调节器 2 - 强制关闭发动机
00228c     $*     P228C 燃油压力调节器 1 超出控制极限 - 压力过低
00228d     $*     P228D 燃油压力调节器 1 超出控制极限 - 压力过高
00228e     $*     P228E 燃油压力调节器 1 超出学习极限 - 过低
00228f     $*     P228F 燃油压力调节器 1 超出学习极限 - 过高
002290     $*     P2290 喷油嘴控制压力过低
002291     $*     P2291 喷油嘴控制压力过低 - 发动机启动
002292     $*     P2292 喷油嘴控制压力不稳定
002293     $*     P2293 燃油压力调节器 2 性能
002294     $*     P2294 燃油压力调节器 2 控制电路
002295     $*     P2295 燃油压力调节器 2 控制电路低
002296     $*     P2296 燃油压力调节器 2 控制电路高
002297     $*     P2297 减速期间氧传感器超出范围 缸组 1, 传感器 1
002298     $*     P2298 减速期间氧传感器超出范围 缸组 2, 传感器 1
002299     $*     P2299 剎车踏板位置/油门踏板位置不兼容
00229a     $*     P229A 燃油压力调节器 2 超出控制极限 - 压力过低
00229b     $*     P229B 燃油压力调节器 2 超出控制极限 - 压力过高
00229c     $*     P229C 燃油压力调节器 2 超出学习极限 - 过低
00229d     $*     P229D 燃油压力调节器 2 超出学习极限 - 过高
002260     $*     P2260 二次空气喷射系统控制 B 电路高
002261     $*     P2261 涡轮增压器/超级增压器旁通阀 - 机械故障
002262     $*     P2262 涡轮增压器/超级增压器未检测到增压压力 - 机械故障
002263     $*     P2263 涡轮增压器/超级增压器增压系统性能
002264     $*     P2264 燃油含水率传感器电路
002265     $*     P2265 燃油含水率传感器电路范围/性能
002266     $*     P2266 燃油含水率传感器电路低
002267     $*     P2267 燃油含水率传感器电路高
002268     $*     P2268 燃油含水率传感器电路间歇性故障
002269     $*     P2269 燃油含水状态
00226a     $*     P226A 燃油含水率指示灯控制电路
00226b     $*     P226B 涡轮增压器/超级增压器增压压力过高 - 机械故障
002270     $*     P2270 氧传感器信号卡在低浓度 缸组 1, 传感器 2
002271     $*     P2271 氧传感器传感器信号卡在高浓度 缸组 1, 传感器 2
002272     $*     P2272 氧传感器信号卡在低浓度 缸组 2, 传感器 2
002273     $*     P2273 氧传感器传感器信号卡在高浓度 缸组 2, 传感器 2
002274     $*     P2274 氧传感器信号卡在低浓度 缸组 1, 传感器 3
002275     $*     P2275 氧传感器传感器信号卡在高浓度 缸组 1, 传感器 3
002276     $*     P2276 氧传感器信号卡在低浓度 缸组 2, 传感器 3
002277     $*     P2277 氧传感器传感器信号卡在高浓度 缸组 2, 传感器 3
002278     $*     P2278 氧气传感器信号交换 缸组 1, 传感器3/缸组 2, 传感器 3
002279     $*     P2279 进气空气系统泄漏
002240     $*     P2240 氧传感器正极电流控制电路/开路 缸组 2, 传感器 1
002241     $*     P2241 氧传感器正极电流控制电路低 缸组 2, 传感器 1
002242     $*     P2242 氧传感器正极电流控制电路高 缸组 2, 传感器 1
002243     $*     P2243 氧传感器参考电压电路/开路 缸组 1, 传感器 1
002244     $*     P2244 氧传感器参考电压电路性能 缸组 1, 传感器 1
002245     $*     P2245 氧传感器参考电压电路低 缸组 1, 传感器 1
002246     $*     P2246 氧传感器参考电压电路高 缸组 1, 传感器 1
002247     $*     P2247 氧传感器参考电压电路/开路 缸组 2, 传感器 1
002248     $*     P2248 氧传感器参考电压电路性能 缸组 2, 传感器 1
002249     $*     P2249 氧传感器参考电压电路低 缸组 2, 传感器 1
002250     $*     P2250 氧传感器参考电压电路高 缸组 2, 传感器 1
002251     $*     P2251 氧传感器负极电流控制电路/开路 缸组 1, 传感器 1
002252     $*     P2252 氧传感器负极电流控制电路低 缸组 1, 传感器 1
002253     $*     P2253 氧传感器负极电流控制电路高 缸组 1, 传感器 1
002254     $*     P2254 氧传感器负极电流控制电路/开路 缸组 2, 传感器 1
002255     $*     P2255 氧传感器负极电流控制电路低 缸组 2, 传感器 1
002256     $*     P2256 氧传感器负极电流控制电路高 缸组 2, 传感器 1
002257     $*     P2257 二次空气喷射系统控制 A 电路低
002258     $*     P2258 二次空气喷射系统控制 A 电路高
002259     $*     P2259 二次空气喷射系统控制 B 电路低
002220     $*     P2220 氮氧化物传感器加热器控制电路高 缸组 2
002221     $*     P2221 氮氧化物传感器加热器感知电路 缸组 2
002222     $*     P2222 氮氧化物传感器加热器感知电路范围/性能 缸组 2
002223     $*     P2223 氮氧化物传感器加热器感知电路低 缸组 2
002224     $*     P2224 氮氧化物传感器加热器感知电路高 缸组 2
002225     $*     P2225 氮氧化物传感器加热器感知电路间歇性故障 缸组 2
002226     $*     P2226 大气压力电路
002227     $*     P2227 大气压力电路范围/性能
002228     $*     P2228 大气压力电路低
002229     $*     P2229 大气压力电路高
00222a     $*     P222A 大气压力传感器 'B' 电路
00222b     $*     P222B 大气压力传感器 'B' 电路范围/性能
00222c     $*     P222C 大气压力传感器 'B' 电路低
00222d     $*     P222D 大气压力传感器 'B' 电路高
00222e     $*     P222E 大气压力传感器 'B' 电路间歇故障/不稳定
00222f     $*     P222F 大气压力传感器 A/B 相关性
002230     $*     P2230 大气压力电路间歇性故障
002231     $*     P2231 氧传感器信号对加热电路短路 缸组 1, 传感器 1
002232     $*     P2232 氧传感器信号对加热电路短路 缸组 1, 传感器 2
002233     $*     P2233 氧传感器信号对加热电路短路 缸组 1, 传感器 3
002234     $*     P2234 氧传感器信号对加热电路短路 缸组 2, 传感器 1
002235     $*     P2235 氧传感器信号对加热电路短路 缸组 2, 传感器 2
002236     $*     P2236 氧传感器信号对加热电路短路 缸组 2, 传感器 3
002237     $*     P2237 氧传感器正极电流控制电路/开路 缸组 1, 传感器 1
002238     $*     P2238 氧传感器正极电流控制电路低 缸组 1, 传感器 1
002239     $*     P2239 氧传感器正极电流控制电路高 缸组 1, 传感器 1
002200     $*     P2200 氮氧化物传感器电路 缸组 1
002201     $*     P2201 氮氧化物传感器电路范围/性能 缸组 1
002202     $*     P2202 氮氧化物传感器电路低 缸组 1
002203     $*     P2203 氮氧化物传感器电路高 缸组 1
002204     $*     P2204 氮氧化物传感器电路间歇性故障 缸组 1
002205     $*     P2205 氮氧化物传感器加热器控制电路/开路 缸组 1
002206     $*     P2206 氮氧化物传感器加热器控制电路低 缸组 1
002207     $*     P2207 氮氧化物传感器加热器控制电路高 缸组 1
002208     $*     P2208 氮氧化物传感器加热器感知电路 缸组 1
002209     $*     P2209 氮氧化物传感器加热器感知电路范围/性能 缸组 1
002210     $*     P2210 氮氧化物传感器加热器感知电路低 缸组 1
002211     $*     P2211 氮氧化物传感器加热器感知电路高 缸组 1
002212     $*     P2212 氮氧化物传感器加热器感知电路间歇性故障 缸组 1
002213     $*     P2213 氮氧化物传感器电路 缸组 2
002214     $*     P2214 氮氧化物传感器电路范围/性能 缸组 2
002215     $*     P2215 氮氧化物传感器电路低 缸组 2
002216     $*     P2216 氮氧化物传感器电路高 缸组 2
002217     $*     P2217 氮氧化物传感器电路间歇性故障 缸组 2
002218     $*     P2218 氮氧化物传感器加热器控制电路/开路 缸组 2
002219     $*     P2219 氮氧化物传感器加热器控制电路低 缸组 2
002340     $*     P2340 气缸 5 超过爆震阈值
002341     $*     P2341 气缸 6 超过爆震阈值
002342     $*     P2342 气缸 7  超过爆震阈值
002343     $*     P2343 气缸 8 超过爆震阈值
002344     $*     P2344 气缸 9 超过爆震阈值
002345     $*     P2345 气缸 10 超过爆震阈值
002346     $*     P2346 气缸 11 超过爆震阈值
002347     $*     P2347 气缸 12 超过爆震阈值
002320     $*     P2320 点火线圈 G 次级电路
002321     $*     P2321 点火线圈 H 主控制电路低
002322     $*     P2322 点火线圈 H 主控制电路高
002323     $*     P2323 点火线圈 H 次级电路
002324     $*     P2324 点火线圈 I 主控制电路低
002325     $*     P2325 点火线圈 I 主控制电路高
002326     $*     P2326 点火线圈 I 次级电路
002327     $*     P2327 点火线圈 J 主控制电路低
002328     $*     P2328 点火线圈 J 主控制电路高
002329     $*     P2329 点火线圈 J 次级电路
002330     $*     P2330 点火线圈 K 主控制电路低
002331     $*     P2331 点火线圈 K 主控制电路高
002332     $*     P2332 点火线圈 K 次级电路
002333     $*     P2333 点火线圈 L 主控制电路低
002334     $*     P2334 点火线圈 L 主控制电路高
002335     $*     P2335 点火线圈 L 次级电路
002336     $*     P2336 气缸 1 超过爆震阈值
002337     $*     P2337 气缸 2 超过爆震阈值
002338     $*     P2338 气缸 3 超过爆震阈值
002339     $*     P2339 气缸 4 超过爆震阈值
002300     $*     P2300 点火线圈 A 主控制电路低
002301     $*     P2301 点火线圈 A 主控制电路高
002302     $*     P2302 点火线圈 A 次级电路
002303     $*     P2303 点火线圈 B 主控制电路低
002304     $*     P2304 点火线圈 B 主控制电路高
002305     $*     P2305 点火线圈 B 次级电路
002306     $*     P2306 点火线圈 C 主控制电路低
002307     $*     P2307 点火线圈 C 主控制电路高
002308     $*     P2308 点火线圈 C 次级电路
002309     $*     P2309 点火线圈 D 主控制电路低
002310     $*     P2310 点火线圈 D 主控制电路高
002311     $*     P2311 点火线圈 D 次级电路
002312     $*     P2312 点火线圈 E 主控制电路低
002313     $*     P2313 点火线圈 E 主控制电路高
002314     $*     P2314 点火线圈 E 次级电路
002315     $*     P2315 点火线圈 F 主控制电路低
002316     $*     P2316 点火线圈 F 主控制电路高
002317     $*     P2317 点火线圈 F 次级电路
002318     $*     P2318 点火线圈 G 主控制电路低
002319     $*     P2319 点火线圈 G 主控制电路高
0020e0     $*     P20E0 排气后处理燃油压力传感器电路高
0020e1     $*     P20E1 排气后处理燃油压力传感器电路间歇故障/不稳定
0020e2     $*     P20E2 排气温度传感器  1/2  相关性 - 缸组 1
0020e3     $*     P20E3 排气温度传感器 1/3 相关性 - 缸组 1
0020e4     $*     P20E4 排气温度传感器 2/3 相关性 - 缸组 1
0020e5     $*     P20E5 排气温度传感器  1/2  相关性 - 缸组 2
0020e6     $*     P20E6 还原剂喷射空气压力过低
0020e7     $*     P20E7 还原剂喷射空气压力过高
0020e8     $*     P20E8 还原剂压力过低
0020e9     $*     P20E9 还原剂压力过高
0020ea     $*     P20EA 还原剂控制模块电源继电器断电执行 - 过早
0020eb     $*     P20EB 还原剂控制模块电源继电器断电执行 - 过迟
0020ec     $*     P20EC 选择性催化还原氮氧化合物催化剂 - 温度过高 (缸组 1)
0020ed     $*     P20ED 选择性催化还原氮氧化合物预催化剂 - 温度过高 (缸组 1)
0020ee     $*     P20EE 选择性催化还原氮氧化合物催化剂效率低于阈值 (缸组 1)
0020ef     $*     P20EF 选择性催化还原氮氧化合物预催化剂效率低于阈值 (缸组 1)
0020f0     $*     P20F0 选择性催化还原氮氧化合物催化剂 - 温度过高 (缸组 2)
0020f1     $*     P20F1 选择性催化还原氮氧化合物预催化剂 - 温度过高 (缸组 2)
0020f2     $*     P20F2 选择性催化还原氮氧化合物催化剂效率低于阈值 (缸组 2)
0020f3     $*     P20F3 选择性催化还原氮氧化合物预催化剂效率低于阈值 (缸组 2)
0020f4     $*     P20F4 还原剂消耗过低
0020f5     $*     P20F5 还原剂消耗过高
0020f6     $*     P20F6 还原剂喷油阀卡在打开位置 (缸组 1, 单元 1)
0020f7     $*     P20F7 还原剂喷油阀卡在打开位置 (缸组 1, 单元 1)
0020c0     $*     P20C0 还原剂加热器 'B' 控制电路高
0020c1     $*     P20C1 还原剂加热器 'C' 控制电路/开路
0020c2     $*     P20C2 还原剂加热器 'C' 控制电路性能
0020c3     $*     P20C3 还原剂加热器 'C' 控制电路低
0020c4     $*     P20C4 还原剂加热器 'C' 控制电路高
0020c5     $*     P20C5 还原剂加热器 'D' 控制电路/开路
0020c6     $*     P20C6 还原剂加热器 'D' 控制电路性能
0020c7     $*     P20C7 还原剂加热器 'D' 控制电路低
0020c8     $*     P20C8 还原剂加热器 'D' 控制电路高
0020c9     $*     P20C9 还原剂控制模块请求故障指示灯照明
0020ca     $*     P20CA 还原剂喷射空气压力泄漏
0020cb     $*     P20CB 排气后处理燃油喷油嘴 'A' 控制电路开路
0020cc     $*     P20CC 排气后处理燃油喷油嘴 'A' 控制电路性能
0020cd     $*     P20CD 排气后处理燃油喷油嘴 'A' 控制电路低
0020ce     $*     P20CE 排气后处理燃油喷油嘴 'A' 控制电路高
0020cf     $*     P20CF 排气后处理燃油喷油嘴 'A' 卡在打开位置
0020d0     $*     P20D0 排气后处理燃油喷油嘴 'A' 卡在关闭位置
0020d1     $*     P20D1 排气后处理燃油喷油嘴 'B' 控制电路/开路
0020d2     $*     P20D2 排气后处理燃油喷油嘴 'B' 控制电路性能
0020d3     $*     P20D3 排气后处理燃油喷油嘴 'B' 控制电路低
0020d4     $*     P20D4 排气后处理燃油喷油嘴 'B' 控制电路高
0020d5     $*     P20D5 排气后处理燃油喷油嘴 'B' 卡在打开位置
0020d6     $*     P20D6 排气后处理燃油喷油嘴 'B' 卡在关闭位置
0020d7     $*     P20D7 排气后处理燃油供应控制电路/开路
0020d8     $*     P20D8 排气后处理燃油供应控制电路性能
0020d9     $*     P20D9 排气后处理燃油供应控制电路低
0020da     $*     P20DA 排气后处理燃油供应控制电路高
0020db     $*     P20DB 排气后处理燃油供应控制卡在打开位置
0020dc     $*     P20DC 排气后处理燃油供应控制卡在关闭位置
0020dd     $*     P20DD 排气后处理燃油压力传感器电路
0020de     $*     P20DE 排气后处理燃油压力传感器电路范围/性能
0020df     $*     P20DF 排气后处理燃油压力传感器电路低
0020a0     $*     P20A0 还原剂净化控制阀电路/开路
0020a1     $*     P20A1 还原剂净化控制阀性能
0020a2     $*     P20A2 还原剂净化控制阀电路低
0020a3     $*     P20A3 还原剂净化控制阀电路高
0020a4     $*     P20A4 还原剂净化控制阀卡在打开位置
0020a5     $*     P20A5 还原剂净化控制阀卡在关闭位置
0020a6     $*     P20A6 还原剂喷射空气压力控制阀电路/开路
0020a7     $*     P20A7 还原剂喷射空气压力控制阀性能
0020a8     $*     P20A8 还原剂喷射空气压力控制阀电路低
0020a9     $*     P20A9 还原剂喷射空气压力控制阀电路高
0020aa     $*     P20AA 还原剂喷射空气压力控制阀卡在打开位置
0020ab     $*     P20AB 还原剂喷射空气压力控制阀卡在关闭位置
0020ac     $*     P20AC 还原剂计量装置温度传感器电路
0020ad     $*     P20AD 还原剂计量装置温度传感器电路范围/性能
0020ae     $*     P20AE 还原剂计量装置温度传感器电路低
0020af     $*     P20AF 还原剂计量装置温度传感器电路高
0020b0     $*     P20B0 还原剂计量装置温度传感器电路间歇故障/不稳定
0020b1     $*     P20B1 还原剂加热器冷却液控制阀电路/开路
0020b2     $*     P20B2 还原剂加热器冷却液控制阀性能
0020b3     $*     P20B3 还原剂加热器冷却液控制阀电路低
0020b4     $*     P20B4 还原剂加热器冷却液控制阀电路高
0020b5     $*     P20B5 还原剂计量装置加热器控制电路/开路
0020b6     $*     P20B6 还原剂计量装置加热器控制电路性能
0020b7     $*     P20B7 还原剂计量装置加热器控制电路低
0020b8     $*     P20B8 还原剂计量装置加热器控制电路高
0020b9     $*     P20B9 还原剂加热器 'A' 控制电路/开路
0020ba     $*     P20BA 还原剂加热器 'A' 控制电路性能
0020bb     $*     P20BB 还原剂加热器 'A' 控制电路低
0020bc     $*     P20BC 还原剂加热器 'A' 控制电路高
0020bd     $*     P20BD 还原剂加热器 'B' 控制电路/开路
0020be     $*     P20BE 还原剂加热器 'B' 控制电路性能
0020bf     $*     P20BF 还原剂加热器 'B' 控制电路低
002080     $*     P2080 排气温度传感器电路范围/性能 缸组 1, 传感器 1
002081     $*     P2081 排气温度传感器电路间歇性故障 缸组 1, 传感器 1
002082     $*     P2082 排气温度传感器电路范围/性能 缸组 2, 传感器 1
002083     $*     P2083 排气温度传感器电路间歇性故障 缸组 2, 传感器 1
002084     $*     P2084 排气温度传感器电路范围/性能 缸组 1, 传感器 2
002085     $*     P2085 排气温度传感器电路间歇性故障 缸组 1, 传感器 2
002086     $*     P2086 排气温度传感器电路范围/性能 缸组 2, 传感器 2
002087     $*     P2087 排气温度传感器电路间歇性故障 缸组 2, 传感器 2
002088     $*     P2088 A 凸轮轴位置执行器控制电路低 缸组 1
002089     $*     P2089 A 凸轮轴位置执行器控制电路高 缸组 1
00208a     $*     P208A 还原剂泵控制电路/开路
00208b     $*     P208B 还原剂泵控制范围/性能
00208c     $*     P208C 还原剂泵控制电路低
00208d     $*     P208D 还原剂泵控制电路高
00208e     $*     P208E 还原剂喷油阀卡在关闭位置
00208f     $*     P208F 还原剂喷油阀卡在关闭位置
002090     $*     P2090 B 凸轮轴位置执行器控制电路低 (缸组 1)
002091     $*     P2091 B 凸轮轴位置执行器控制电路高 (缸组 1)
002092     $*     P2092 A 凸轮轴位置执行器控制电路低 (缸组 2)
002093     $*     P2093 A 凸轮轴位置执行器控制电路高 (缸组 2)
002094     $*     P2094 B 凸轮轴位置执行器控制电路低 (缸组 2)
002095     $*     P2095 B 凸轮轴位置执行器控制电路高 (缸组 2)
002096     $*     P2096 后催化剂燃油修正系统过稀 缸组 1
002097     $*     P2097 后催化剂燃油修正系统过浓 缸组 1
002098     $*     P2098 后催化剂燃油修正系统过稀 缸组 2
002099     $*     P2099 后催化剂燃油修正系统过浓 缸组 2
00209a     $*     P209A 还原剂喷射空气压力传感器 'B' 电路
00209b     $*     P209B 还原剂喷射空气压力传感器 'B' 电路范围/性能
00209c     $*     P209C 还原剂喷射空气压力传感器 'B' 电路低
00209d     $*     P209D 还原剂喷射空气压力传感器 'B' 电路高
00209e     $*     P209E 还原剂喷射空气压力传感器 'A'/'B' 相关性
00209f     $*     P209F 还原剂箱加热器控制电路性能
002060     $*     P2060 还原剂喷射空气泵控制电路低
002061     $*     P2061 还原剂喷射空气泵控制电路高
002062     $*     P2062 还原剂/再生供应控制电路/开路
002063     $*     P2063 还原剂供应控制电路低
002064     $*     P2064 还原剂供应控制电路高
002065     $*     P2065 燃油液位传感器 B 电路
002066     $*     P2066 燃油液位传感器 B 电路范围/性能
002067     $*     P2067 燃油液位传感器 B 电路低
002068     $*     P2068 燃油液位传感器 B 电路高
002069     $*     P2069 燃油液位传感器 B 电路间歇性故障
00206a     $*     P206A 还原剂品质传感器电路
00206b     $*     P206B 还原剂品质传感器电路范围/性能
00206c     $*     P206C 还原剂品质传感器电路低
00206d     $*     P206D 还原剂品质传感器电路高
00206e     $*     P206E 进气歧管调谐（IMT）阀门卡在打开位置, 缸组 2
00206f     $*     P206F 进气歧管调谐（IMT）阀门卡在关闭位置, 缸组 2
002070     $*     P2070 进气歧管调谐（IMT）阀门卡在打开位置
002071     $*     P2071 进气歧管调谐（IMT）阀门卡在关闭位置
002072     $*     P2072 节气门执行器控制系统被冰堵住
002073     $*     P2073 歧管绝对压力/质量空气流量 - 节气门位置怠速时的相关性
002074     $*     P2074 歧管绝对压力/质量空气流量 - 节气门位置较高负载时的相关性
002075     $*     P2075 进气歧管调谐（IMT）阀门位置传感器/开关电路 缸组 1
002076     $*     P2076 进气歧管调谐（IMT）阀门传感器/开关电路范围/性能 缸组 1
002077     $*     P2077 进气歧管调谐（IMT）阀门位置传感器/开关电路低 缸组 1
002078     $*     P2078 进气歧管调谐（IMT）阀门位置传感器/开关电路高 缸组 1
002079     $*     P2079 进气歧管调谐（IMT）阀门位置传感器/开关电路间歇性故障 缸组 1
00207a     $*     P207A 进气歧管调谐（IMT）阀门位置传感器/开关电路 缸组 2
00207b     $*     P207B 进气歧管调谐（IMT）阀门位置传感器/开关电路范围/性能 缸组 2
00207c     $*     P207C 进气歧管调谐（IMT）阀门位置传感器/开关电路低 缸组 2
00207d     $*     P207D 进气歧管调谐（IMT）阀门位置传感器/开关电路高 缸组 2
00207e     $*     P207E 进气歧管调谐（IMT）阀门位置传感器/开关电路间歇故障 缸组 2
002040     $*     P2040 还原剂喷射空气压力传感器电路高
002041     $*     P2041 还原剂喷射空气压力传感器电路间歇性故障
002042     $*     P2042 还原剂温度传感器电路
002043     $*     P2043 还原剂温度传感器电路范围/性能
002044     $*     P2044 还原剂温度传感器电路低
002045     $*     P2045 还原剂温度传感器电路高
002046     $*     P2046 还原剂温度传感器电路间歇性故障
002047     $*     P2047 还原剂喷油嘴电路/开路 缸组 1, 单元 1
002048     $*     P2048 还原剂喷油嘴电路低 缸组 1, 单元 1
002049     $*     P2049 还原剂喷油嘴电路高 缸组 1, 单元 1
00204a     $*     P204A 还原剂压力传感器电路
00204b     $*     P204B 还原剂压力传感器电路范围/性能
00204c     $*     P204C 还原剂压力传感器电路低
00204d     $*     P204D 还原剂压力传感器电路高
00204e     $*     P204E 还原剂压力传感器电路间歇故障/不稳定
00204f     $*     P204F 还原剂系统性能 缸组 1
002050     $*     P2050 还原剂喷油嘴电路/开路 缸组 2, 单元1
002051     $*     P2051 还原剂喷油嘴电路低 缸组 2, 单元 1
002052     $*     P2052 还原剂喷油嘴电路高 缸组 2, 单元 1
002053     $*     P2053 还原剂喷油嘴电路/开路 缸组 1, 单元 2
002054     $*     P2054 还原剂喷油嘴电路低 缸组 1, 单元 2
002055     $*     P2055 还原剂喷油嘴电路高 缸组 1, 单元 2
002056     $*     P2056 还原剂喷油嘴电路/开路 缸组 2, 单元 2
002057     $*     P2057 还原剂喷油嘴电路低 缸组 2, 单元 2
002058     $*     P2058 还原剂喷油嘴电路高 缸组 2, 单元 2
002059     $*     P2059 还原剂喷射空气泵控制电路/开路
00205a     $*     P205A 还原剂箱温度传感器电路
00205b     $*     P205B 还原剂箱温度传感器电路范围/性能
00205c     $*     P205C 还原剂箱温度传感器电路低
00205d     $*     P205D 还原剂箱温度传感器电路高
00205e     $*     P205E 还原剂箱温度传感器电路间歇故障/不稳定
00205f     $*     P205F 还原剂系统性能 缸组 2
002020     $*     P2020 进气歧管流道位置传感器/开关电路范围/性能 (缸组 2)
002021     $*     P2021 进气歧管流道位置传感器/开关电路低 (缸组 2)
002022     $*     P2022 进气歧管流道位置传感器/开关电路高 (缸组 2)
002023     $*     P2023 进气歧管流道位置传感器/开关电路间歇性故障 (缸组 2)
002024     $*     P2024 燃油蒸气排放系统 (EVAP) 燃油蒸气温度传感器电路
002025     $*     P2025 燃油蒸气排放系统 (EVAP) 燃油蒸气温度传感器电路性能
002026     $*     P2026 燃油蒸气排放系统 (EVAP) 燃油蒸气温度传感器电路电压偏低
002027     $*     P2027 燃油蒸气排放系统 (EVAP) 燃油蒸气温度传感器电路电压偏高
002028     $*     P2028 燃油蒸气排放系统 (EVAP) 燃油蒸气温度传感器电路间歇性故障
002029     $*     P2029 烧燃油的加热器被禁用
00202a     $*     P202A 还原剂箱加热器控制电路/开路
00202b     $*     P202B 还原剂箱加热器控制电路低
00202c     $*     P202C 还原剂箱加热器控制电路高
00202d     $*     P202D 还原剂泄漏
00202e     $*     P202E 还原剂喷油阀电路范围/性能 (缸组 1,单元1)
00202f     $*     P202F 还原剂/再生供应控制电路范围/性能
002030     $*     P2030 烧燃油的加热器性能
002031     $*     P2031 排气温度传感器电路 缸组 1, 传感器 2
002032     $*     P2032 排气温度传感器电路低 缸组 1, 传感器 2
002033     $*     P2033 排气温度传感器电路高 缸组 1, 传感器 2
002034     $*     P2034 排气温度传感器电路 缸组 2, 传感器 2
002035     $*     P2035 排气温度传感器电路低 缸组 2, 传感器 2
002036     $*     P2036 排气温度传感器电路高 缸组 2, 传感器 2
002037     $*     P2037 还原剂喷射空气压力传感器电路
002038     $*     P2038 还原剂喷射空气压力传感器电路范围/性能
002039     $*     P2039 还原剂喷射空气压力传感器电路低
00203a     $*     P203A 还原剂液位传感器电路
00203b     $*     P203B 还原剂液位传感器电路范围/性能
00203c     $*     P203C 还原剂液位传感器电路低
00203d     $*     P203D 还原剂液位传感器电路高
00203e     $*     P203E 还原剂液位传感器电路间歇故障/不稳定
00203f     $*     P203F 还原剂液位低
002000     $*     P2000 氮氧化物捕集器效率低于阈值 (缸组 1)
002001     $*     P2001 氮氧化物捕集器效率低于阈值 (缸组 2)
002002     $*     P2002 柴油颗粒滤清器 (DPF) 效率低于阈值 (缸组 1)
002003     $*     P2003 柴油微粒滤清器效率低于阈值 (缸组 2)
002004     $*     P2004 进气歧管流道控制卡在打开位置 (缸组 1)
002005     $*     P2005 进气歧管流道控制卡在打开位置 (缸组 2)
002006     $*     P2006 进气歧管流道控制卡在关闭位置 (缸组 1)
002007     $*     P2007 进气歧管流道控制卡在关闭位置 (缸组 2)
002008     $*     P2008 进气歧管流道控制电路/开路 (缸组 1)
002009     $*     P2009 进气歧管流道控制电路低 (缸组 1)
00200a     $*     P200A 进气歧管流道性能
00200b     $*     P200B 进气歧管流道性能
00200c     $*     P200C 柴油微粒滤清器温度过高
00200d     $*     P200D 柴油微粒滤清器温度过高
00200e     $*     P200E 催化系统温度过高
00200f     $*     P200F 催化系统温度过高
002010     $*     P2010 进气歧管流道控制电路高 (缸组 1)
002011     $*     P2011 进气歧管流道控制电路/开路 (缸组 2)
002012     $*     P2012 进气歧管流道控制电路低 (缸组 2)
002013     $*     P2013 进气歧管流道控制电路高 (缸组 2)
002014     $*     P2014 进气歧管流道位置传感器/开关电路 (缸组 1)
002015     $*     P2015 进气歧管流道位置传感器/开关电路范围/性能 (缸组 1)
002016     $*     P2016 进气歧管流道位置传感器/开关电路低 (缸组 1)
002017     $*     P2017 进气歧管流道位置传感器/开关电路高 (缸组 1)
002018     $*     P2018 进气歧管流道位置传感器/开关电路间歇性故障 (缸组 1)
002019     $*     P2019 进气歧管流道位置传感器/开关电路 (缸组 2)
00201a     $*     P201A 还原剂喷油阀电路范围/性能
002180     $*     P2180 关闭怠速时系统过浓 缸组 2
002181     $*     P2181 冷却系统性能
002182     $*     P2182 发动机冷却液温度传感器 2 电路
002183     $*     P2183 发动机冷却液温度传感器 2 电路范围/性能
002184     $*     P2184 发动机冷却液温度传感器 2 电路低
002185     $*     P2185 发动机冷却液温度传感器 2 电路高
002186     $*     P2186 发动机冷却液温度传感器 2 电路间歇性故障/不稳定
002187     $*     P2187 怠速时系统过稀 缸组 1
002188     $*     P2188 怠速时系统过浓 缸组 1
002189     $*     P2189 怠速时系统过稀 缸组 2
002190     $*     P2190 怠速时系统过浓 缸组 2
002191     $*     P2191 较高负载时系统过稀 缸组 1
002192     $*     P2192 较高负载时系统过浓 缸组 1
002193     $*     P2193 较高负载时系统过稀 缸组 2
002194     $*     P2194 较高负载时系统过浓 缸组 2
002195     $*     P2195 氧传感器信号存在偏差/卡在低浓度 缸组 1, 传感器 1
002196     $*     P2196 氧传感器信号存在偏差/卡在高浓度 缸组 1, 传感器 1
002197     $*     P2197 氧传感器信号存在偏差/卡在低浓度 缸组 2, 传感器 1
002198     $*     P2198 氧传感器信号存在偏差/卡在高浓度 缸组 2, 传感器 1
002199     $*     P2199 进气温度传感器 1/2 相关性
002160     $*     P2160 车速传感器 B 电路低
002161     $*     P2161 车速传感器 B 间歇性故障/不稳定
002162     $*     P2162 车速传感器 A/B 相关性
002163     $*     P2163 节气门/踏板位置传感器 A 最大停止位置性能
002164     $*     P2164 节气门/踏板位置传感器 B 最大停止位置性能
002165     $*     P2165 节气门/踏板位置传感器 C 最大停止位置性能
002166     $*     P2166 节气门/踏板位置传感器 D 最大停止位置性能
002167     $*     P2167 节气门/踏板位置传感器 E 最大停止位置性能
002168     $*     P2168 节气门/踏板位置传感器 F 最大停止位置性能
002169     $*     P2169 排气压力调节器通风电磁阀控制电路/开路
00216a     $*     P216A 燃油喷油嘴 'E' 组电源电压电路开路
00216b     $*     P216B 燃油喷油嘴 'E' 组电源电压电路低
00216c     $*     P216C 燃油喷油嘴 'E' 组电源电压电路高
00216d     $*     P216D 燃油喷油嘴 'F' 组电源电压电路/开路
00216e     $*     P216E 燃油喷油嘴 'F' 组电源电压电路低
00216f     $*     P216F 燃油喷油嘴 'F' 组电源电压电路高
002170     $*     P2170 排气压力调节器通风电磁阀控制电路低
002171     $*     P2171 排气压力调节器通风电磁阀控制电路高
002172     $*     P2172 节气门执行器控制系统检测到突然的高空气流量
002173     $*     P2173 节气门执行器控制系统检测到高空气流量
002174     $*     P2174 节气门执行器控制系统检测到突然的低空气流量
002175     $*     P2175 节气门执行器控制系统检测到低空气流量
002176     $*     P2176 节气门执行器控制系统怠速位置未学习
002177     $*     P2177 关闭怠速时系统过稀 缸组 1
002178     $*     P2178 关闭怠速时系统过浓 缸组 1
002179     $*     P2179 关闭怠速时系统过稀 缸组 2
00217a     $*     P217A 燃油喷油嘴 'G' 组电源电压电路开路
00217b     $*     P217B 燃油喷油嘴 'G' 组电源电压电路低
00217c     $*     P217C 燃油喷油嘴 'G' 组电源电压电路高
00217d     $*     P217D 燃油喷油嘴 'F' 组电源电压电路/开路
00217e     $*     P217E 燃油喷油嘴 'H' 组电源电压电路低
00217f     $*     P217F 燃油喷油嘴 'H' 组电源电压电路高
002140     $*     P2140 节气门位置传感器/开关 E/F 电压相关性
002141     $*     P2141 废气再循环节气门控制电路 A 低
002142     $*     P2142 废气再循环节气门控制电路 A 高
002143     $*     P2143 废气再循环通风控制电路/开路
002144     $*     P2144 废气再循环通风控制电路低
002145     $*     P2145 废气再循环通风控制电路高
002146     $*     P2146 燃油喷油嘴 A 组电源电压电路/开路
002147     $*     P2147 燃油喷油嘴 A 组电源电压电路低
002148     $*     P2148 燃油喷油嘴 A 组电源电压电路高
002149     $*     P2149 燃油喷油嘴 B 组电源电压电路/开路
002150     $*     P2150 燃油喷油嘴 B 组电源电压电路低
002151     $*     P2151 燃油喷油嘴 B 组电源电压电路高
002152     $*     P2152 燃油喷油嘴 C 组电源电压电路/开路
002153     $*     P2153 燃油喷油嘴 C 组电源电压电路低
002154     $*     P2154 燃油喷油嘴 C 组电源电压电路高
002155     $*     P2155 燃油喷油嘴 D 组电源电压电路/开路
002156     $*     P2156 燃油喷油嘴 D 组电源电压电路低
002157     $*     P2157 燃油喷油嘴 D 组电源电压电路高
002158     $*     P2158 车速传感器 B
002159     $*     P2159 车速传感器 B 范围/性能
00215a     $*     P215A 车辆速度/车轮速度相关性
00215b     $*     P215B 车辆速度/输出轴速度相关性
00215c     $*     P215C 输出轴速度 - 车轮速度相关性
002120     $*     P2120 节气门/踏板位置传感器/开关 D 电路
002121     $*     P2121 节气门/踏板位置传感器/开关 D 电路范围/性能
002122     $*     P2122 节气门/踏板位置传感器/开关 D 电路低
002123     $*     P2123 节气门/踏板位置传感器/开关 D 电路高
002124     $*     P2124 节气门/踏板位置传感器/开关 D 电路间歇性故障
002125     $*     P2125 节气门/踏板位置传感器/开关 E 电路
002126     $*     P2126 节气门/踏板位置传感器/开关 E 电路范围/性能
002127     $*     P2127 节气门/踏板位置传感器/开关 E 电路低
002128     $*     P2128 节气门/踏板位置传感器/开关 E 电路高
002129     $*     P2129 节气门/踏板位置传感器/开关 E 电路间歇性故障
00212a     $*     P212A 节气门位置传感器/开关 'G' 电路
00212b     $*     P212B 节气门位置传感器/开关 'G' 电路范围/性能
00212c     $*     P212C 节气门位置传感器/开关 'G' 电路低
00212d     $*     P212D 节气门位置传感器/开关 'G' 电路高
00212e     $*     P212E 节气门位置传感器/开关 'G' 电路间歇性故障
002130     $*     P2130 节气门/踏板位置传感器/开关 F 电路
002131     $*     P2131 节气门/踏板位置传感器/开关 F 电路范围/性能
002132     $*     P2132 节气门/踏板位置传感器/开关 F 电路低
002133     $*     P2133 节气门/踏板位置传感器/开关 F 电路高
002134     $*     P2134 节气门/踏板位置传感器/开关 F 电路间歇性故障
002135     $*     P2135 节气门/踏板位置传感器/开关 A/B 电压相关性
002136     $*     P2136 节气门位置传感器/开关 A/C电压相关性
002137     $*     P2137 节气门位置传感器/开关 B/C 电压相关性
002138     $*     P2138 节气门位置传感器/开关 D/E 电压相关性
002139     $*     P2139 节气门位置传感器/开关 D/F 电压相关性
00213a     $*     P213A 废气再循环节气门控制电路 B /开路
00213b     $*     P213B 废气再循环节气门控制电路 B 范围/性能
00213c     $*     P213C 废气再循环节气门控制电路 B 低
00213d     $*     P213D 废气再循环节气门控制电路 B 高
00213e     $*     P213E 燃油喷射系统故障 - 强制关闭发动机
00213f     $*     P213F 燃油泵系统故障 - 强制关闭发动机
002100     $*     P2100 节气门制动器控制马达电路/开路
002101     $*     P2101 节气门制动器控制马达电路范围/性能
002102     $*     P2102 节气门制动器控制马达电路低
002103     $*     P2103 节气门制动器控制马达电路高
002104     $*     P2104 节气门执行器控制系统强制怠速
002105     $*     P2105 节气门执行器控制系统强制关闭发动机
002106     $*     P2106 节气门执行器控制系统强制限制功率
002107     $*     P2107 节气门执行器控制模块处理器
002108     $*     P2108 节气门执行器控制模块性能
002109     $*     P2109 节气门/踏板位置传感器 A 最小停止位置性能
00210a     $*     P210A 油门执行器 'B' 控制马达电路/开路
00210b     $*     P210B 节气门执行器 'B' 控制马达电路范围/性能
00210c     $*     P210C 节气门执行器 'B' 控制马达电路低
00210d     $*     P210D 节气门执行器 'B' 控制马达电路高
00210e     $*     P210E 节气门/踏板位置传感器/开关 'C'/'F' 电压相关性
002110     $*     P2110 节气门执行器控制系统强制限制转速
002111     $*     P2111 节气门执行器控制系统卡在开启位置
002112     $*     P2112 节气门执行器控制系统卡在关闭位置
002113     $*     P2113 节气门/踏板位置传感器 B 最小停止位置性能
002114     $*     P2114 节气门/踏板位置传感器 C 最小停止位置性能
002115     $*     P2115 节气门/踏板位置传感器 D 最小停止位置性能
002116     $*     P2116 节气门/踏板位置传感器 E 最小停止位置性能
002117     $*     P2117 节气门/踏板位置传感器 F 最小停止位置性能
002118     $*     P2118 节气门制动器控制马达电流范围/性能
002119     $*     P2119 节气门执行器控制节气门体范围/性能
0026a0     $*     P26A0 排气后处理预热塞性能
0026a1     $*     P26A1 排气后处理预热塞电路低
0026a2     $*     P26A2 排气后处理预热塞电路高
002680     $*     P2680 冷却液除气阀控制电路高
002681     $*     P2681 发动机冷却液旁通阀控制电路/开路
002682     $*     P2682 发动机冷却液旁通阀控制电路低
002683     $*     P2683 发动机冷却液旁通阀控制电路高
002684     $*     P2684 执行器电源电压 C 电路/开路
002685     $*     P2685 执行器电源电压 C 电路低
002686     $*     P2686 执行器电源电压 C 电路高
002687     $*     P2687 燃油供应加热器控制电路/开路
002688     $*     P2688 燃油供应加热器控制电路低
002689     $*     P2689 燃油供应加热器控制电路高
00268a     $*     P268A 燃油喷油嘴校准未学习/编程
00268b     $*     P268B 高压燃油泵校准未学习/编程
00268c     $*     P268C 气缸 1 喷油嘴数据不兼容
00268d     $*     P268D 气缸 2 喷油嘴数据不兼容
00268e     $*     P268E 气缸 3 喷油嘴数据不兼容
00268f     $*     P268F 气缸 4 喷油嘴数据不兼容
002690     $*     P2690 气缸 5 喷油嘴数据不兼容
002691     $*     P2691 气缸 6 喷油嘴数据不兼容
002692     $*     P2692 气缸 7 喷油嘴数据不兼容
002693     $*     P2693 气缸 8 喷油嘴数据不兼容
002694     $*     P2694 气缸 9 喷油嘴数据不兼容
002695     $*     P2695 汽缸 10 喷油嘴数据不兼容
002696     $*     P2696 喷油嘴数据不兼容
002697     $*     P2697 排气后处理燃油喷油嘴 'A' 电路/开路
002698     $*     P2698 排气后处理燃油喷油嘴 'A' 性能
002699     $*     P2699 排气后处理燃油喷油嘴 'A' 电路低
00269a     $*     P269A 排气后处理燃油喷油嘴 'A' 电路高
00269b     $*     P269B 排气后处理预热塞控制电路/开路
00269c     $*     P269C 排气后处理预热塞控制性能
00269d     $*     P269D 排气后处理预热塞控制电路低
00269e     $*     P269E 排气后处理预热塞控制电路高
00269f     $*     P269F 排气后处理预热塞电路/开路
002660     $*     P2660 B 摇臂作动器控制电路/开路 缸组 2
002661     $*     P2661 B 摇臂作动器控制系统性能故障或卡在关闭位置 缸组 2
002662     $*     P2662 B 摇臂作动器控制系统卡滞在接通位置 缸组 2
002663     $*     P2663 B 摇臂作动器控制电路电压偏低 缸组 2
002664     $*     P2664 B 摇臂作动器控制电路电压偏高 缸组 2
002665     $*     P2665 燃油切断阀 B 控制电路/开路
002666     $*     P2666 燃油切断阀 B 控制电路低
002667     $*     P2667 燃油切断阀 B 控制电路高
002668     $*     P2668 燃油模式指示灯控制电路
002669     $*     P2669 执行器电源电压 B 电路/开路
00266a     $*     P266A A 摇臂作动器位置传感器电路 缸组 2
00266b     $*     P266B A 摇臂作动器位置传感器电路范围/性能, 缸组 2
00266c     $*     P266C A 摇臂作动器位置传感器电路电压低 缸组 2
00266d     $*     P266D A 摇臂作动器位置传感器电路电压高 缸组 2
00266e     $*     P266E A 摇臂作动器位置传感器电路间歇故障/不稳定 缸组 2
002670     $*     P2670 执行器电源电压 B 电路低
002671     $*     P2671 执行器电源电压 B 电路高
002672     $*     P2672 喷油泵正时偏差
002673     $*     P2673 喷油泵正时校准未学习
002674     $*     P2674 喷油泵燃油校准未学习
002675     $*     P2675 空气滤清器入口控制电路/开路
002676     $*     P2676 空气滤清器进口控制电路低
002677     $*     P2677 空气滤清器进口控制电路高
002678     $*     P2678 冷却液排气阀控制电路/开路
002679     $*     P2679 冷却液排气阀控制电路低
00267a     $*     P267A B 摇臂作动器位置传感器电路 缸组 2
00267b     $*     P267B B 摇臂作动器位置传感器电路范围/性能 缸组 2
00267c     $*     P267C B 摇臂作动器位置传感器电路电压低 缸组 2
00267d     $*     P267D B 摇臂作动器位置传感器电路电压高 缸组 2
00267e     $*     P267E B 摇臂作动器位置传感器电路间歇故障/不稳定 缸组 2
002640     $*     P2640 扭矩管理反馈信号 A 高
002641     $*     P2641 扭矩管理反馈信号 B
002642     $*     P2642 扭矩管理反馈信号 B 范围/性能
002643     $*     P2643 扭矩管理反馈信号 B 低
002644     $*     P2644 扭矩管理反馈信号 B 高
002645     $*     P2645 A 摇臂作动器控制电路/开路 缸组 1
002646     $*     P2646 A 摇臂作动器控制系统性能故障或卡在关闭位置 缸组 1
002647     $*     P2647 A 摇臂作动器控制系统卡在接通位置 缸组 1
002648     $*     P2648 A 摇臂作动器控制电路电压偏低 缸组 1
002649     $*     P2649 A 摇臂作动器控制电路电压偏高 缸组 1
00264a     $*     P264A A 摇臂作动器位置传感器电路 缸组 1
00264b     $*     P264B A 摇臂作动器位置传感器电路范围/性能 缸组 1
00264c     $*     P264C A 摇臂作动器位置传感器电路电压低 缸组 1
00264d     $*     P264D A 摇臂作动器位置传感器电路电压高 缸组 1
00264e     $*     P265E A 摇臂作动器位置传感器电路间歇故障/不稳定 缸组 1
002650     $*     P2650 B 摇臂作动器控制电路/开路 缸组 1
002651     $*     P2651 B 摇臂作动器控制系统性能故障或卡在关闭位置 缸组 1
002652     $*     P2652 B 摇臂作动器控制系统 卡在接通位置 缸组 1
002653     $*     P2653 B 摇臂作动器控制电路电压偏低 缸组 1
002654     $*     P2654 B 摇臂作动器控制电路电压偏高 缸组 1
002655     $*     P2655 A 摇臂作动器控制电路/开路 缸组 2
002656     $*     P2656 A 摇臂作动器控制系统性能故障或卡在关闭位置 缸组 2
002657     $*     P2657 A 摇臂作动器控制系统卡滞在接通位置 缸组 2
002658     $*     P2658 A 摇臂作动器控制电路电压偏低 缸组 2
002659     $*     P2659 A 摇臂作动器控制电路电压偏高 缸组 2
00265a     $*     P265A B 摇臂作动器位置传感器电路 缸组 1
00265b     $*     P265B B 摇臂作动器位置传感器电路范围/性能 缸组 1
00265c     $*     P265C B 摇臂作动器位置传感器电路电压低 缸组 1
00265d     $*     P265D B 摇臂作动器位置传感器电路电压高 缸组 1
00265e     $*     P265E B 摇臂作动器位置传感器电路间歇故障/不稳定 缸组 1
002620     $*     P2620 节气门位置输出电路/开路
002621     $*     P2621 节气门位置输出电路低
002622     $*     P2622 节气门位置输出电路高
002623     $*     P2623 喷油嘴控制压力调节器电路/开路
002624     $*     P2624 喷油嘴控制压力调节器电路低
002625     $*     P2625 喷油嘴控制压力调节器电路高
002626     $*     P2626 氧传感器泵送电流修正电路/开路 缸组 1, 传感器 1
002627     $*     P2627 氧传感器泵送电流修正电路低 缸组 1, 传感器 1
002628     $*     P2628 氧传感器泵送电流修正电路高 缸组 1, 传感器 1
002629     $*     P2629 氧传感器泵送电流修正电路/开路 缸组 2, 传感器 1
002630     $*     P2630 氧传感器泵送电流修正电路低 缸组 2, 传感器 1
002631     $*     P2631 氧传感器泵送电流修正电路高 缸组 2, 传感器 1
002632     $*     P2632 燃油泵 B 控制电路/开路
002633     $*     P2633 燃油泵 B 控制电路低
002634     $*     P2634 燃油泵 B 控制电路高
002635     $*     P2635 燃油泵 A 低流量/性能
002636     $*     P2636 燃油泵 B 低流量/性能
002637     $*     P2637 扭矩管理反馈信号 A
002638     $*     P2638 扭矩管理反馈信号 A 范围/性能
002639     $*     P2639 扭矩管理反馈信号 A 低
002600     $*     P2600 冷却液泵控制电路/开路
002601     $*     P2601 冷却液泵控制电路范围/性能
002602     $*     P2602 冷却液泵控制电路低
002603     $*     P2603 冷却液泵控制电路高
002604     $*     P2604 进气加热器 A 电路范围/性能
002605     $*     P2605 进气加热器 A 电路/开路
002606     $*     P2606 进气加热器 B 电路范围/性能
002607     $*     P2607 进气加热器 B 电路低
002608     $*     P2608 进气加热器 B 电路高
002609     $*     P2609 进气加热器系统性能
00260a     $*     P260A 动力输出控制电路/开路
00260b     $*     P260B 动力输出控制电路低
00260c     $*     P260C 动力输出控制电路高
00260d     $*     P260D 动力输出啮合灯控制电路
00260f     $*     P260F 蒸发系统监测处理器性能
002610     $*     P2610 发动机控制模块/动力系统控制模块内部发动机关闭定时器性能
002611     $*     P2611 空调制冷剂分配阀控制电路/开路
002612     $*     P2612 空调制冷剂分配阀控制电路低
002613     $*     P2613 空调制冷剂分配阀控制电路高
002614     $*     P2614 凸轮轴位置信号输出电路/开路
002615     $*     P2615 凸轮轴位置信号输出电路低
002616     $*     P2616 凸轮轴位置信号输出电路高
002617     $*     P2617 曲轴位置信号输出电路/开路
002618     $*     P2618 曲轴位置信号输出电路低
002619     $*     P2619 曲轴位置信号输出电路高
00261a     $*     P261A 冷却液泵 'B' 控制电路/开路
00261b     $*     P261B 冷却液泵 'B' 控制电路范围/性能
00261c     $*     P261C 冷却液泵 'B' 控制电路低
00261d     $*     P261D 冷却液泵 'B' 控制电路高
0027a0     $*     P27A0 四轮驱动 (4WD) 范围信号电路电压高
002780     $*     P2780 降档开关电路低
002781     $*     P2781 降档开关电路高
002782     $*     P2782 降档开关电路间歇性故障/不稳定
002783     $*     P2783 液力变矩器温度过高
002784     $*     P2784 输入/涡轮速度传感器 A/B 相关性
002785     $*     P2785 离合器执行器温度过高
002786     $*     P2786 换档执行器温度过高
002787     $*     P2787 离合器温度过高
002788     $*     P2788 自动换档手动自适应学习到达极限
002789     $*     P2789 离合器自适应学习到达极限
00278a     $*     P278A 降档开关电路
00278b     $*     P278B 降档开关电路范围/性能
00278c     $*     P278C 降档开关电路低
00278d     $*     P278D 降档开关电路高
00278e     $*     P278E 降档开关电路间歇性故障/不稳定
00278f     $*     P278F 离合器 B 自适应学习达到极限
002790     $*     P2790 门选择方向电路
002791     $*     P2791 门选择方向电路低
002792     $*     P2792 门选择方向电路高
002793     $*     P2793 换挡方向电路
002794     $*     P2794 换挡方向电路低
002795     $*     P2795 换挡方向电路高
002796     $*     P2796 辅助变速器液泵控制电路/开路
002797     $*     P2797 辅助变速器液泵性能
002798     $*     P2798 辅助变速器液泵控制电路低
002799     $*     P2799 辅助变速器液泵控制电路高
00279a     $*     P279A 分动箱高档齿轮比不正确
00279b     $*     P279B 分动箱低档齿轮比不正确
00279c     $*     P279C 分动箱空档齿轮比不正确
00279d     $*     P279D 四轮驱动 (4WD) 范围信号电路
00279e     $*     P279E 四轮驱动 (4WD) 范围信号电路范围/性能
00279f     $*     P279F 四轮驱动 (4WD) 范围信号电路电压低
002760     $*     P2760 液力变矩器离合器压力控制电磁阀控制电路间歇性故障
002761     $*     P2761 液力变矩器离合器压力控制电磁阀控制电路/开路
002762     $*     P2762 液力变矩器离合器压力控制电磁阀控制电路范围/性能
002763     $*     P2763 液力变矩器离合器压力控制电磁阀控制电路高
002764     $*     P2764 液力变矩器离合器压力控制电磁阀控制电路低
002765     $*     P2765 输入/涡轮速度传感器 B 电路
002766     $*     P2766 输入/涡轮速度传感器 B 电路范围/性能
002767     $*     P2767 输入/涡轮速度传感器 B 电路无信号
002768     $*     P2768 输入/涡轮速度传感器 B 电路间歇性故障
002769     $*     P2769 液力变矩器离合器电路低
002770     $*     P2770 液力变矩器离合器电路高
002771     $*     P2771 四轮驱动 (4WD) 低速开关电路
002772     $*     P2772 四轮驱动 (4WD) 低速开关电路范围/性能
002773     $*     P2773 四轮驱动 (4WD) 低速开关电路低
002774     $*     P2774 四轮驱动 (4WD) 低速开关电路高
002775     $*     P2775 升档开关电路范围/性能
002776     $*     P2776 升档开关电路低
002777     $*     P2777 升档开关电路高
002778     $*     P2778 升档开关电路间歇性故障/不稳定
002779     $*     P2779 升档开关电路范围/性能
002740     $*     P2740 传动液温度传感器 B 电路
002741     $*     P2741 传动液温度传感器 B 电路范围/性能
002742     $*     P2742 传动液温度传感器 B 电路低
002743     $*     P2743 传动液温度传感器 B 电路高
002744     $*     P2744 传动液温度传感器 B 电路间歇性故障
002745     $*     P2745 中间轴速度传感器 B 电路
002746     $*     P2746 中间轴速度传感器 B 电路范围/性能
002747     $*     P2747 中间轴速度传感器 B 电路无信号
002748     $*     P2748 中间轴速度传感器 B 电路间歇性故障
002749     $*     P2749 中间轴速度传感器 C 电路
002750     $*     P2750 中间轴速度传感器 C 电路范围/性能
002751     $*     P2751 中间轴速度传感器 C 电路无信号
002752     $*     P2752 中间轴速度传感器 C 电路间歇性故障
002753     $*     P2753 传动液冷却器控制电路/开路
002754     $*     P2754 传动液冷却器控制电路低
002755     $*     P2755 传动液冷却器控制电路高
002756     $*     P2756 液力变矩器离合器压力控制电磁阀
002757     $*     P2757 液力变矩器离合器压力控制电磁阀控制电路性能/卡在断开位置
002758     $*     P2758 液力变矩器离合器压力控制电磁阀控制电路卡在接通位置
002759     $*     P2759 液力变矩器离合器压力控制电磁阀控制电路电气故障
002720     $*     P2720 压力控制电磁阀 D 控制电路低
002721     $*     P2721 压力控制电磁阀 D 控制电路高
002722     $*     P2722 压力控制电磁阀 E
002723     $*     P2723 压力控制电磁阀 E 性能/卡在断开位置
002724     $*     P2724 压力控制电磁阀 E 卡在接通位置
002725     $*     P2725 压力控制电磁阀 E 电气故障
002726     $*     P2726 压力控制电磁阀 E 间歇性故障
002727     $*     P2727 压力控制电磁阀 E 控制电路/开路
002728     $*     P2728 压力控制电磁阀 E 控制电路范围/性能
002729     $*     P2729 压力控制电磁阀 E 控制电路低
002730     $*     P2730 压力控制电磁阀 E 控制电路高
002731     $*     P2731 压力控制电磁阀 F
002732     $*     P2732 压力控制电磁阀 F 性能/卡在断开位置
002733     $*     P2733 压力控制电磁阀 F 卡在接通位置
002734     $*     P2734 压力控制电磁阀 F 电气故障
002735     $*     P2735 压力控制电磁阀 F 间歇性故障
002736     $*     P2736 压力控制电磁阀 F 控制电路/开路
002737     $*     P2737 压力控制电磁阀 F 控制电路范围/性能
002738     $*     P2738 压力控制电磁阀 F 控制电路低
002739     $*     P2739 压力控制电磁阀 F 控制电路高
00273a     $*     P273A 变速器摩擦组件 G 应用时间范围/性能
00273b     $*     P273B 变速器摩擦组件 H 应用时间范围/性能
002700     $*     P2700 变速器摩擦组件 A 应用时间范围/性能
002701     $*     P2700 变速器摩擦组件 B 应用时间范围/性能
002702     $*     P2702 变速器摩擦组件 C 应用时间范围/性能
002703     $*     P2703 变速器摩擦组件 D 应用时间范围/性能
002704     $*     P2704 变速器摩擦组件 E 应用时间范围/性能
002705     $*     P2705 变速器摩擦组件 F 应用时间范围/性能
002706     $*     P2706 换挡电磁阀 F
002707     $*     P2707 换档电磁阀 F 性能/卡在断开位置
002708     $*     P2708 换档电磁阀 F 卡在接通位置
002709     $*     P2709 换档电磁阀 F 电气故障
002710     $*     P2710 换档电磁阀 F 间歇性故障
002711     $*     P2711 意外的机械性档位脱离
002712     $*     P2712 液压动力装置泄露
002713     $*     P2713 压力控制电磁阀 D
002714     $*     P2714 压力控制电磁阀 D 性能/卡在断开位置
002715     $*     P2715 压力控制电磁阀 D 卡在接通位置
002716     $*     P2716 压力控制电磁阀 D 电气故障
002717     $*     P2717 压力控制电磁阀 D 间歇性故障
002718     $*     P2718 压力控制电磁阀 D 控制电路/开路
002719     $*     P2719 压力控制电磁阀 D 控制电路范围/性能
002480     $*     P2480 排气温度传感器电路/开路 (缸组 1, 传感器 5)
002481     $*     P2481 排气温度传感器电路低 (缸组 1, 传感器 5)
002482     $*     P2482 排气温度传感器电路高 (缸组 1, 传感器 5)
002483     $*     P2483 排气温度传感器电路范围/性能 (缸组 1, 传感器 5)
002484     $*     P2484 排气温度传感器电路间歇故障/不稳定 (缸组 1, 传感器 5)
002485     $*     P2485 排气温度传感器电路开路 (缸组 2, 传感器 5)
002486     $*     P2486 排气温度传感器电路低 (缸组 2, 传感器 5)
002487     $*     P2487 排气温度传感器电路高 (缸组 2, 传感器 5)
002488     $*     P2488 排气温度传感器电路范围/性能 (缸组 2, 传感器 5)
002489     $*     P2489 排气温度传感器电路间歇故障/不稳定 (缸组 2, 传感器 5)
002460     $*     P2460 柴油颗粒滤清器压力传感 'B' 电路低
002461     $*     P2461 柴油颗粒滤清器压力传感 'B' 电路高
002462     $*     P2462 柴油颗粒滤清器压力传感 'B' 电路间歇故障/不稳定
002463     $*     P2463 柴油颗粒滤清器限制 - 烟尘积累
002464     $*     P2464 柴油颗粒滤清器压差过低 (缸组 2)
002465     $*     P2465 柴油颗粒滤清器压差过高 (缸组 2)
002466     $*     P2466 排气温度传感器电路 (缸组 2, 传感器 3)
002467     $*     P2467 排气温度传感器电路范围/性能 (缸组 2, 传感器 3)
002468     $*     P2468 排气温度传感器电路低 (缸组 2, 传感器 3)
002469     $*     P2469 排气温度传感器电路高 (缸组 2, 传感器 3)
00246a     $*     P246A 排气温度传感器电路间歇故障/不稳定 (缸组 2, 传感器 3)
00246b     $*     P246B 柴油颗粒过滤器再生的车辆条件不正确
00246c     $*     P246C 柴油颗粒过滤器限制 - 强制功率限制
00246d     $*     P246D 柴油微粒滤清器压力传感器 'A'/'B' 相关性
00246e     $*     P246E 排气温度传感器电路 (缸组 1, 传感器4)
00246f     $*     P246F 排气温度传感器电路范围/性能 (缸组 1, 传感器4)
002470     $*     P2470 排气温度传感器电路低 (缸组 1, 传感器4)
002471     $*     P2471 排气温度传感器电路高 (缸组 1, 传感器4)
002472     $*     P2472 排气温度传感器电路间歇故障/不稳定 (缸组 1, 传感器4)
002473     $*     P2473 排气温度传感器电路 (缸组 2, 传感器4)
002474     $*     P2474 排气温度传感器电路范围/性能 (缸组 2, 传感器4)
002475     $*     P2475 排气温度传感器电路低 (缸组 2, 传感器4)
002476     $*     P2476 排气温度传感器电路高 (缸组 2, 传感器4)
002477     $*     P2477 排气温度传感器电路间歇故障/不稳定 (缸组 2, 传感器4)
002478     $*     P2478 排气温度超出范围 (缸组 1, 传感器 1)
002479     $*     P2479 排气温度超出范围 (缸组 1, 传感器 2)
00247a     $*     P247A 排气温度超出范围 (缸组 1, 传感器 3)
00247b     $*     P247B 排气温度超出范围 (缸组 1, 传感器4)
00247c     $*     P247C 排气温度超出范围 (缸组 2, 传感器 1)
00247d     $*     P247D 排气温度超出范围 (缸组 2, 传感器 2)
00247e     $*     P247E 排气温度超出范围 (缸组 2, 传感器 3)
00247f     $*     P247F 排气温度超出范围 (缸组 2, 传感器4)
002440     $*     P2440 二次空气喷射系统开关阀卡在打开位置 缸组 1
002441     $*     P2441 二次空气喷射系统开关阀卡在关闭位置 缸组 1
002442     $*     P2442 二次空气喷射系统开关阀卡在打开位置 缸组 2
002443     $*     P2443 二次空气喷射系统开关阀卡在关闭位置 缸组 2
002444     $*     P2444 二次空气喷射系统泵卡在接通位置 缸组 1
002445     $*     P2445 二次空气喷射系统泵卡在关闭位置 缸组 1
002446     $*     P2446 二次空气喷射系统泵卡滞接通位置 缸组 2
002447     $*     P2447 二次空气喷射系统泵卡在关闭位置 缸组 2
002448     $*     P2448 二次空气喷射系统气流过高 缸组 1
002449     $*     P2449 二次空气喷射系统气流过高 缸组 2
00244a     $*     P244A 柴油颗粒滤清器压力差过低 缸组 1
00244b     $*     P244B 柴油颗粒滤清器压力差过高 缸组 1
00244c     $*     P244C 颗粒过滤器再生排气温度过低 缸组 1
00244d     $*     P244D 颗粒过滤器再生排气温度过高 缸组 1
00244e     $*     P244E 颗粒过滤器再生排气温度过低 缸组 2
00244f     $*     P244F 颗粒过滤器再生排气温度过高 缸组 2
002450     $*     P2450 燃油蒸发排放控制系统开关阀性能/卡在打开位置
002451     $*     P2451 燃油蒸发排放控制系统开关阀卡在关闭位置
002452     $*     P2452 柴油颗粒过滤器压差传感器电路
002453     $*     P2453 柴油颗粒过滤器压差传感器电路范围/性能
002454     $*     P2454 柴油颗粒过滤器压差传感器电路低
002455     $*     P2455 柴油颗粒过滤器压差传感器电路高
002456     $*     P2456 柴油颗粒过滤器压差传感器电路间歇性故障/不稳定
002457     $*     P2457 废气再循环冷却器系统性能
002458     $*     P2458 柴油颗粒过滤器再生持续时间
002459     $*     P2459 柴油颗粒过滤器再生频率
00245a     $*     P245A 废气再循环冷卻器旁通控制电路/开路
00245c     $*     P245C 废气再循环冷却器旁通控制电路低
00245d     $*     P245D 废气再循环冷却器旁通控制电路高
002420     $*     P2420 燃油蒸发排放控制系统开关阀控制电路高
002421     $*     P2421 燃油蒸发排放控制系统通风阀卡在打开位置
002422     $*     P2422 燃油蒸发排放控制系统通风阀卡在关闭位置
002423     $*     P2423 碳氢化合物吸收催化剂效率低于阈值 (缸组 1)
002424     $*     P2424 碳氢化合物吸收催化剂效率低于阈值 (缸组 2)
002425     $*     P2425 废气再循环冷却阀控制电路/开路
002426     $*     P2426 废气再循环冷却阀控制电路低
002427     $*     P2427 废气再循环冷却阀控制电路高
002428     $*     P2428 排气温度过高 缸组 1
002429     $*     P2429 排气温度过高 缸组 2
00242a     $*     P242A 排气温度传感器电路 缸组 1, 传感器 3
00242b     $*     P242B 排气温度传感器电路范围/性能 缸组 1, 传感器 3
00242c     $*     P242C 排气温度传感器电路低 缸组 1, 传感器 3
00242d     $*     P242D 排气温度传感器电路高 缸组 1, 传感器 3
00242e     $*     P242E 排气温度传感器电路间歇故障/不稳定 缸组 1, 传感器 3
00242f     $*     P242F 柴油颗粒滤清器限制 - 烟尘积累
002430     $*     P2430 二次空气喷射系统空气流量/压力传感器电路 缸组 1
002431     $*     P2431 二次空气喷射系统空气流量/压力传感器电路范围/性能 缸组 1
002432     $*     P2432 二次空气喷射系统空气流量/压力传感器电路低 缸组 1
002433     $*     P2433 二次空气喷射系统空气流量/压力传感器电路高 缸组 1
002434     $*     P2434 二次空气注射系统空气流量/压力传感器电路间歇性故障/不稳定 缸组 1
002435     $*     P2435 二次空气喷射系统空气流量/压力传感器电路 缸组 2
002436     $*     P2436 二次空气喷射系统空气流量/压力传感器电路范围/性能 缸组 2
002437     $*     P2437 二次空气喷射系统空气流量/压力传感器电路低 缸组 2
002438     $*     P2438 二次空气喷射系统空气流量/压力传感器电路高 缸组 2
002439     $*     P2439 二次空气注射系统空气流量/压力传感器电路间歇性故障/不稳定 缸组 2
002400     $*     P2400 燃油蒸发排放系统泄漏检测泵控制电路/开路
002401     $*     P2401 燃油蒸发排放系统泄漏检测泵控制电路低
002402     $*     P2402 燃油蒸发排放系统泄漏检测泵控制电路高
002403     $*     P2403 燃油蒸发排放系统泄漏检测泵感知电路/开路
002404     $*     P2404 燃油蒸发排放系统泄漏检测泵感知电路范围/性能
002405     $*     P2405 燃油蒸发排放系统泄漏检测泵感知电路低
002406     $*     P2406 燃油蒸发排放系统泄漏检测泵感知电路高
002407     $*     P2407 燃油蒸发排放系统泄漏检测泵感知电路间歇性故障/不稳定
002408     $*     P2408 油箱盖传感器/开关电路
002409     $*     P2409 油箱盖传感器/开关电路范围/性能
00240a     $*     P240A 燃油蒸发排放系统泄漏侦测泵加热器控制电路/开路
00240b     $*     P240B 燃油蒸发排放系统泄漏侦测泵加热器控制电路低
00240c     $*     P240C 燃油蒸发排放系统泄漏侦测泵加热器控制电路高
002410     $*     P2410 油箱盖传感器/开关电路低
002411     $*     P2411 油箱盖传感器/开关电路高
002412     $*     P2412 油箱盖传感器/开关电路间歇性故障/不稳定
002413     $*     P2413 废气再循环系统性能
002414     $*     P2414 氧传感器传感器排气样品错误 缸组 1, 传感器 1
002415     $*     P2415 氧传感器传感器排气样品错误 缸组 2, 传感器 1
002416     $*     P2416 氧气传感器信号交换 缸组 1 传感器 2/缸组 1, 传感器 3
002417     $*     P2417 氧气传感器信号交换 缸组 2传感器 2/缸组 2, 传感器 3
002418     $*     P2418 燃油蒸发排放控制系统开关阀控制电路/开路
002419     $*     P2419 燃油蒸发排放控制系统开关阀控制电路低
002580     $*     P2580 涡轮增压器速度传感器电路低
002581     $*     P2581 涡轮增压器速度传感器电路高
002582     $*     P2582 涡轮增压器速度传感器间歇性故障
002583     $*     P2583 定速巡航控制前方距离范围传感器
002584     $*     P2584 燃油添加剂控制模块请求故障指示灯照明
002585     $*     P2585 燃油添加剂控制模块警告灯请求
002586     $*     P2586 涡轮增压器增压控制位置传感器 B 电路
002587     $*     P2587 涡轮增压器增压控制位置传感器 B 电路范围/性能
002588     $*     P2588 涡轮增压器增压控制位置传感器 B 电路低
002589     $*     P2589 涡轮增压器增压控制位置传感器 B 电路高
00258a     $*     P258A 真空泵控制电路/开路
00258b     $*     P258B 真空泵控制范围/性能
00258c     $*     P258C 真空泵控制电路低
00258d     $*     P258D 真空泵控制电路高
00258e     $*     P258E 动力输出启动开关性能
00258f     $*     P258F 扭矩管理请求输出信号
002590     $*     P2590 涡轮增压器增压控制位置传感器 B 电路间歇性故障/不稳定
002591     $*     P2591 定速巡航控制前方距离范围传感器
002592     $*     P2592 定速巡航控制前方距离范围传感器
002560     $*     P2560 发动机冷却液液位低
002561     $*     P2561 空调控制模块请求故障指示灯照明
002562     $*     P2562 涡轮增压器增压控制位置传感器 A 电路
002563     $*     P2563 涡轮增压器增压控制位置传感器 A 电路范围/性能
002564     $*     P2564 涡轮增压器增压控制位置传感器 A 电路低
002565     $*     P2565 涡轮增压器增压控制位置传感器 A 电路高
002566     $*     P2566 涡轮增压器增压控制位置传感器 A 电路间歇性故障/不稳定
002567     $*     P2567 直接臭氧减少催化剂温度传感器电路
002568     $*     P2568 直接臭氧减少催化剂温度传感器电路范围/性能
002569     $*     P2569 直接臭氧减少催化剂温度传感器电路低
00256a     $*     P256A 发动机怠速速度选择器传感器/开关电路/开路
00256b     $*     P256B 发动机怠速速度选择器传感器/开关电路范围/性能
00256c     $*     P256C 发动机怠速速度选择器传感器/开关电路低
00256d     $*     P256D 发动机怠速速度选择器传感器/开关电路高
00256e     $*     P256E 发动机怠速速度选择器传感器/开关电路间歇性故障/不稳定
002570     $*     P2570 直接臭氧减少催化剂温度传感器电路高
002571     $*     P2571 直接臭氧减少催化剂温度传感器电路间歇性故障/不稳定
002572     $*     P2572 直接臭氧减少催化剂劣化传感器电路
002573     $*     P2573 直接臭氧减少催化剂劣化传感器电路范围/性能
002574     $*     P2574 直接臭氧减少催化剂劣化传感器电路低
002575     $*     P2575 直接臭氧减少催化剂劣化传感器电路高
002576     $*     P2576 直接臭氧减少催化剂劣化传感器电路间歇性故障/不稳定
002577     $*     P2577 直接臭氧减少催化剂效率低于阈值
002578     $*     P2578 涡轮增压器速度传感器电路
002579     $*     P2579 涡轮增压器速度传感器电路范围/性能
00257a     $*     P257A 真空罐控制电路开路
00257b     $*     P257B 真空罐控制电路低
00257c     $*     P257C 真空罐控制电路高
00257d     $*     P257D 发动机罩开关电路范围/性能
00257e     $*     P257E 发动机罩开关电路低
00257f     $*     P257F 发动机罩开关电路高
002540     $*     P2540 低压燃油系统传感器电路范围/性能
002541     $*     P2541 低压燃油系统传感器电路低
002542     $*     P2542 低压燃油系统传感器电路高
002543     $*     P2543 低压燃油系统传感器电路间歇性故障
002544     $*     P2544 扭矩管理请求输入信号 A
002545     $*     P2545 扭矩管理请求输入信号 A 范围/性能
002546     $*     P2546 扭矩管理请求输入信号 A 低
002547     $*     P2547 扭矩管理请求输入信号 A 高
002548     $*     P2548 扭矩管理请求输入信号 B
002549     $*     P2549 扭矩管理请求输入信号 B 范围/性能
00254a     $*     P254A 动力输出速度选择器传感器/开关 1 电路/开路
00254b     $*     P254B 动力输出速度选择器传感器/开关 1 电路范围/性能
00254c     $*     P254C 动力输出速度选择器传感器/开关 1 电路低
00254d     $*     P254D 动力输出速度选择器传感器/开关 1 电路高
00254e     $*     P254E 动力输出速度选择器传感器/开关 1 电路间歇性故障/不稳定
00254f     $*     P254F 发动机罩开关电路
002550     $*     P2550 扭矩管理请求输入信号 B 低
002551     $*     P2551 扭矩管理请求输入信号 B 高
002552     $*     P2552 节气门/燃油禁止电路
002553     $*     P2553 节气门/燃油禁止电路范围/性能
002554     $*     P2554 节气门/燃油禁止电路低
002555     $*     P2555 节气门/燃油禁止电路高
002556     $*     P2556 发动机冷却液液位传感器/开关电路
002557     $*     P2557 发动机冷却液液位传感器/开关电路范围/性能
002558     $*     P2558 发动机冷却液液位传感器/开关电路低
002559     $*     P2559 发动机冷却液液位传感器/开关电路高
00255a     $*     P255A 动力输出速度选择器传感器/开关 2 电路/开路
00255b     $*     P255B 动力输出速度选择器传感器/开关 2 电路范围/性能
00255c     $*     P255C 动力输出速度选择器传感器/开关 2 电路低
00255d     $*     P255D 动力输出速度选择器传感器/开关 2 电路高
00255e     $*     P255E 动力输出速度选择器传感器/开关 2 电路间歇性故障/不稳定
002520     $*     P2520 空调请求 A 电路低
002521     $*     P2521 空调请求 A 电路高
002522     $*     P2522 空调请求 B 电路
002523     $*     P2523 空调请求 B 电路低
002524     $*     P2524 空调请求 B 电路高
002525     $*     P2525 真空罐压力传感器电路
002526     $*     P2526 真空罐压力传感器电路范围/性能
002527     $*     P2527 真空罐压力传感器电路低
002528     $*     P2528 真空罐压力传感器电路高
002529     $*     P2529 真空罐压力传感器电路间歇性故障
00252a     $*     P252A 发动机机油质量传感器电路
00252b     $*     P252B 发动机机油质量传感器电路范围/性能
00252c     $*     P252C 发动机机油质量传感器电路低
00252d     $*     P252D 发动机机油质量传感器电路高
00252e     $*     P252E 发动机机油质量传感器电路间歇性故障/不稳定
00252f     $*     P252F 发动机机油液位过高
002530     $*     P2530 点火开关运行位置电路
002531     $*     P2531 点火开关运行位置电路低
002532     $*     P2532 点火开关运行位置电路高
002533     $*     P2533 点火开关运行/启动位置电路
002534     $*     P2534 点火开关运行/启动位置电路低
002535     $*     P2535 点火开关运行/启动位置电路高
002536     $*     P2536 点火开关附件位置电路
002537     $*     P2537 点火开关附件位置电路低
002538     $*     P2538 点火开关附件位置电路高
002539     $*     P2539 低压燃油系统传感器电路
00253a     $*     P253A 动力输出感知电路/开路
00253b     $*     P253B 动力输出感知电路范围/性能
00253c     $*     P253C 动力输出感知电路低
00253d     $*     P253D 动力输出感知电路高
00253e     $*     P253E 动力输出感知电路间歇性故障/不稳定
00253f     $*     P253F 发动机机油劣化
002500     $*     P2500 发电机指示灯/L 端子电路低
002501     $*     P2501 发电机指示灯/L 端子电路高
002502     $*     P2502 充电系统电压
002503     $*     P2503 充电系统电压低
002504     $*     P2504 充电系统电压高
002505     $*     P2505 发动机控制模块/动力系统控制模块动力输入信号
002506     $*     P2506 发动机控制模块/动力系统控制模块动力输入信号范围/性能
002507     $*     P2507 发动机控制模块/动力系统控制模块动力输入信号低
002508     $*     P2508 发动机控制模块/动力系统控制模块动力输入信号高
002509     $*     P2509 发动机控制模块/动力系统控制模块动力输入信号间歇性故障
00250a     $*     P250A 发动机机油液位传感器电路
00250b     $*     P250B 发动机机油液位传感器电路范围/性能
00250c     $*     P250C 发动机机油液位传感器电路低
00250d     $*     P250D 发动机机油液位传感器电路高
00250e     $*     P250E 发动机机油液位传感器电路间歇性故障/不稳定
00250f     $*     P250F 发动机机油液位过低
002510     $*     P2510 发动机控制模块/动力系统控制模块电源继电器感知电路范围/性能
002511     $*     P2511 发动机控制模块/动力系统控制模块电源继电器感知电路间歇性故障
002512     $*     P2512 事件数据记录器请求电路/开路
002513     $*     P2513 事件数据记录器请求电路低
002514     $*     P2514 事件数据记录器请求电路高
002515     $*     P2515 空调制冷剂压力传感器 B 电路
002516     $*     P2516 空调制冷剂压力传感器 B 电路范围/性能
002517     $*     P2517 空调制冷剂压力传感器 B 电路低
002518     $*     P2518 空调制冷剂压力传感器 B 电路高
002519     $*     P2519 空调请求 A 电路
00251a     $*     P251A 动力输出启动开关电路/开路
00251b     $*     P251B 动力输出启动开关电路低
00251c     $*     P251C 动力输出启动开关电路高
00251d     $*     P251D 动力输出发动机关闭电路/开路
00251e     $*     P251E 动力输出发动机关闭电路低
00251f     $*     P251F 动力输出发动机关闭电路高
003480     $*     P3480 气缸 10 排气阀控制电路高
003481     $*     P3481 气缸 11 停缸系统/进气阀控制电路/开路
003482     $*     P3482 气缸 11 停缸系统/进气阀控制电路性能
003483     $*     P3483 气缸 11 停缸系统/进气阀控制电路低
003484     $*     P3484 气缸 11 停缸系统/进气阀控制电路高
003485     $*     P3485 气缸 11 排气阀控制电路/开路
003486     $*     P3486 气缸 11 排气阀控制电路性能
003487     $*     P3487 气缸 11 排气阀控制电路低
003488     $*     P3488 气缸 11 排气阀控制电路高
003489     $*     P3489 气缸 12 停缸系统/进气阀控制电路/开路
003490     $*     P3490 气缸 12 停缸系统/进气阀控制电路性能
003491     $*     P3491 气缸 12 停缸系统/进气阀控制电路低
003492     $*     P3492 气缸 12 停缸系统/进气阀控制电路高
003493     $*     P3493 气缸 12 排气阀控制电路/开路
003494     $*     P3494 气缸 12 排气阀控制电路性能
003495     $*     P3495 气缸 12 排气阀控制电路低
003496     $*     P3496 气缸 12 排气阀控制电路高
003497     $*     P3497 气缸停缸系统 缸组 2
003460     $*     P3460 气缸 8 停缸系统/进气阀控制电路高
003461     $*     P3461 气缸 8 排气阀控制电路/开路
003462     $*     P3462 气缸 8 排气阀控制电路性能
003463     $*     P3463 气缸 8 排气阀控制电路低
003464     $*     P3464 气缸 8 排气阀控制电路高
003465     $*     P3465 气缸 9 停缸系统/进气阀控制电路/开路
003466     $*     P3466 气缸 9 停缸系统/进气阀控制电路性能
003467     $*     P3467 气缸 9 停缸系统/进气阀控制电路低
003468     $*     P3468 气缸 9 停缸系统/进气阀控制电路高
003469     $*     P3469 气缸 9 排气阀控制电路/开路
003470     $*     P3470 气缸 9 排气阀控制电路性能
003471     $*     P3471 气缸 9 排气阀控制电路低
003472     $*     P3472 气缸 9 排气阀控制电路高
003473     $*     P3473 气缸 10 停缸系统/进气阀控制电路/开路
003474     $*     P3474 气缸 10 停缸系统/进气阀控制电路性能
003475     $*     P3475 气缸 10 停缸系统/进气阀控制电路低
003476     $*     P3476 气缸 10 停缸系统/进气阀控制电路高
003477     $*     P3477 气缸 10 排气阀控制电路/开路
003478     $*     P3478 气缸 10 排气阀控制电路性能
003479     $*     P3479 气缸 10 排气阀控制电路低
003440     $*     P3440 气缸 5 排气阀控制电路高
003441     $*     P3441 气缸 6 停缸系统/进气阀控制电路/开路
003442     $*     P3442 气缸 6 停缸系统/进气阀控制电路性能
003443     $*     P3443 气缸 6 停缸系统/进气阀控制电路低
003444     $*     P3444 气缸 6 停缸系统/进气阀控制电路高
003445     $*     P3445 气缸 6 排气阀控制电路/开路
003446     $*     P3446 气缸 6 排气阀控制电路性能
003447     $*     P3447 气缸 6 排气阀控制电路低
003448     $*     P3448 气缸 6 排气阀控制电路高
003449     $*     P3449 气缸 7 停缸系统/进气阀控制电路/开路
003450     $*     P3450 气缸 7 停缸系统/进气阀控制电路性能
003451     $*     P3451 气缸 7 停缸系统/进气阀控制电路低
003452     $*     P3452 气缸 7 停缸系统/进气阀控制电路高
003453     $*     P3453 气缸 7 排气阀控制电路/开路
003454     $*     P3454 气缸 7 排气阀控制电路性能
003455     $*     P3455 气缸 7 排气阀控制电路低
003456     $*     P3456 气缸 7 排气阀控制电路高
003457     $*     P3457 气缸 8 停缸系统/进气阀控制电路/开路
003458     $*     P3458 气缸 8 停缸系统/进气阀控制电路性能
003459     $*     P3459 气缸 8 停缸系统/进气阀控制电路低
003420     $*     P3420 气缸 3 停缸系统/进气阀控制电路高
003421     $*     P3421 气缸 3 排气阀控制电路/开路
003422     $*     P3422 气缸 3 排气阀控制电路性能
003423     $*     P3423 气缸 3 排气阀控制电路低
003424     $*     P3424 气缸 3 排气阀控制电路高
003425     $*     P3425 气缸 4 停缸系统/进气阀控制电路/开路
003426     $*     P3426 气缸 4 停缸系统/进气阀控制电路性能
003427     $*     P3427 气缸 4 停缸系统/进气阀控制电路低
003428     $*     P3428 气缸 4 停缸系统/进气阀控制电路高
003429     $*     P3429 气缸 4 排气阀控制电路/开路
003430     $*     P3430 气缸 4 排气阀控制电路性能
003431     $*     P3431 气缸 4 排气阀控制电路低
003432     $*     P3432 气缸 4 排气阀控制电路高
003433     $*     P3433 气缸 5 停缸系统/进气阀控制电路/开路
003434     $*     P3434 气缸 5 停缸系统/进气阀控制电路性能
003435     $*     P3435 气缸 5 停缸系统/进气阀控制电路低
003436     $*     P3436 气缸 5 停缸系统/进气阀控制电路高
003437     $*     P3437 气缸 5 排气阀控制电路/开路
003438     $*     P3438 气缸 5 排气阀控制电路性能
003439     $*     P3439 气缸 5 排气阀控制电路低
003400     $*     P3400 气缸停缸系统 缸组 1
003401     $*     P3401 气缸 1 停缸系统/进气阀控制电路/开路
003402     $*     P3402 气缸 1 停缸系统/进气阀控制电路性能
003403     $*     P3403 气缸 1 停缸系统/进气阀控制电路低
003404     $*     P3404 气缸 1 停缸系统/进气阀控制电路高
003405     $*     P3405 气缸 1 排气阀控制电路/开路
003406     $*     P3406 气缸 1 排气阀控制电路性能
003407     $*     P3407 气缸 1 排气阀控制电路低
003408     $*     P3408 气缸 1 排气阀控制电路高
003409     $*     P3409 气缸 2 停缸系统/进气阀控制电路/开路
003410     $*     P3410 气缸 2 停缸系统/进气阀控制电路性能
003411     $*     P3411 气缸 2 停缸系统/进气阀控制电路低
003412     $*     P3412 气缸 2 停缸系统/进气阀控制电路高
003413     $*     P3413 气缸 2 排气阀控制电路/开路
003414     $*     P3414 气缸 2 排气阀控制电路性能
003415     $*     P3415 气缸 2 排气阀控制电路低
003416     $*     P3416 气缸 2 排气阀控制电路高
003417     $*     P3417 气缸 3 停缸系统/进气阀控制电路/开路
003418     $*     P3418 气缸 3 停缸系统/进气阀控制电路性能
003419     $*     P3419 气缸 3 停缸系统/进气阀控制电路低
004081     $*     C0081 ABS 故障指示灯
004082     $*     C0082 制动系统故障指示灯
004083     $*     C0083 胎压监测故障指示灯
004084     $*     C0084 牵引力控制运行指示灯
004085     $*     C0085 牵引力控制禁用指示灯
004086     $*     C0086 车辆动态指示灯
004089     $*     C0089 牵引力控制系统禁用开关
00408a     $*     C008A 牵引力控制系统模式控制
004061     $*     C0061 横向加速度传感器
004062     $*     C0062 纵向加速度传感器
004063     $*     C0063 偏航率传感器
004064     $*     C0064 滚转率传感器
004069     $*     C0069 偏航率/纵向传感器
00406a     $*     C006A 多轴加速度传感器
00406b     $*     C006B 稳定系统运行太长
00406c     $*     C006C 稳定系统
004071     $*     C0071 2/4 轮驱动状态输入
004072     $*     C0072 制动温度过高
004073     $*     C0073 传递的驱动扭矩
004074     $*     C0074 请求的驱动扭矩
004075     $*     C0075 延长的制动踏板行程, 输出至动力总成模块 (PCM)
004076     $*     C0076 牵引力控制的脉宽调制
004077     $*     C0077 轮胎压力低
004078     $*     C0078 轮胎直径
004079     $*     C0079 可变作用力转向
004040     $*     C0040 制动踏板开关 A
004041     $*     C0041 制动踏板开关 B
004042     $*     C0042 制动踏板位置传感器电路 A
004043     $*     C0043 制动踏板位置传感器电路 B
004044     $*     C0044 制动压力传感器 A
004045     $*     C0045 制动压力传感器 B
004046     $*     C0046 制动压力传感器 A/B
004047     $*     C0047 制动助力器压力传感器
004048     $*     C0048 制动助力器行程传感器
004049     $*     C0049 制动液
00404a     $*     C004A 制动片磨损传感器
004051     $*     C0051 方向盘位置传感器
004052     $*     C0052 方向盘位置传感器信号 A
004053     $*     C0053 方向盘位置传感器信号 B
004054     $*     C0054 方向盘位置传感器信号 C
004055     $*     C0055 方向盘位置传感器信号 D
004020     $*     C0020 ABS 泵电机控制
004021     $*     C0021 制动助力器性能
004022     $*     C0022 制动助力器电磁阀
004023     $*     C0023 停止灯控制
004030     $*     C0030 左前音轮
004031     $*     C0031 左前轮速度传感器
004032     $*     C0032 左前轮速度传感器电源
004033     $*     C0033 右前音轮
004034     $*     C0034 右前轮速度传感器
004035     $*     C0035 右前轮速度传感器电源
004036     $*     C0036 左后音轮
004037     $*     C0037 左后轮速度传感器
004038     $*     C0038 左后轮速度传感器电源
004039     $*     C0039 右后音轮
00403a     $*     C003A 右后轮速度传感器
00403b     $*     C003B 右后轮速度传感器电源
00403c     $*     C003C 后音轮
00403d     $*     C003D 后轮速度传感器
00403e     $*     C003E 后轮速度传感器电源
004001     $*     C0001 牵引力控制系统控制通道 A 阀 1
004002     $*     C0002 牵引力控制系统控制通道 A 阀 2
004003     $*     C0003 牵引力控制系统控制通道 B 阀 1
004004     $*     C0004 牵引力控制系统控制通道 B 阀 2
004010     $*     C0010 左前入口控制
004011     $*     C0011 左前出口控制
004012     $*     C0012 左前液压释放过长
004014     $*     C0014 右前入口控制
004015     $*     C0015 右前出口控制
004016     $*     C0016 右前液压释放过长
004018     $*     C0018 左后入口控制
004019     $*     C0019 左后出口控制
00401a     $*     C001A 左后液压释放过长
00401c     $*     C001C 右后入口控制
00401d     $*     C001D 右后出口控制
00401e     $*     C001E 右后液压释放过长
0080c0     $*     B00C0 乘客座椅乘员分类传感器 A
0080c1     $*     B00C1 乘客座椅乘员分类传感器 B
0080c2     $*     B00C2 乘客座椅乘员分类传感器 C
0080c3     $*     B00C3 乘客座椅乘员分类传感器 D
0080c4     $*     B00C4 乘客座椅乘员分类传感器 E
0080c5     $*     B00C5 乘客座椅导轨位置限制器传感器
0080c6     $*     B00C6 乘客座座椅斜倚位置限制器传感器
0080c7     $*     B00C7 乘客座椅乘员位置传感器 A
0080c8     $*     B00C8 乘客座椅乘员位置传感器 B
0080c9     $*     B00C9 乘客座椅乘员位置传感器 C
0080ca     $*     B00CA 乘客座椅乘员位置传感器 D
0080cb     $*     B00CB 乘客座椅乘员位置传感器 E
0080d0     $*     B00D0 驾驶员座椅安全带指示灯
0080d1     $*     B00D1 乘客座椅安全带指示灯
0080d2     $*     B00D2 乘员保护系统故障指示灯 1
0080d3     $*     B00D3 乘员保护系统故障指示灯 2
0080d4     $*     B00D4 乘员保护系统故障声响指示灯
0080d5     $*     B00D5 乘员保护系统乘客座禁用指示灯
0080df     $*     B00DF 乘客座乘员保护系统禁用开关
0080a0     $*     B00A0 乘员分类系统
0080a1     $*     B00A1 乘员位置系统
0080b0     $*     B00B0 驾驶员座椅乘员分类传感器 A
0080b1     $*     B00B1 驾驶员座椅乘员分类传感器 B
0080b2     $*     B00B2 驾驶员座椅乘员分类传感器 C
0080b3     $*     B00B3 驾驶员座椅乘员分类传感器 D
0080b4     $*     B00B4 驾驶员座椅乘员分类传感器 E
0080b5     $*     B00B5 驾驶员座椅导轨位置限制器传感器
0080b6     $*     B00B6 驾驶员座椅斜倚位置限制器传感器
0080b7     $*     B00B7 驾驶员座椅乘员位置传感器 A
0080b8     $*     B00B8 驾驶员座椅乘员位置传感器 B
0080b9     $*     B00B9 驾驶员座椅乘员位置传感器 C
0080ba     $*     B00BA 驾驶员座椅乘员位置传感器 D
0080bb     $*     B00BB 驾驶员座椅乘员位置传感器 E
008080     $*     B0080 驾驶员座椅安全带负载限制器展开控制
008081     $*     B0081 第 1 排座椅安全带中央负载限制器展开控制
008082     $*     B0082 乘客座椅安全带负载限制器展开控制
008083     $*     B0083 第 2 排左侧座椅安全带负载限制器展开控制
008084     $*     B0084 第 2 排座椅安全带中央负载限制器展开控制
008085     $*     B0085 第 2 排右侧座椅安全带负载限制器展开控制
008086     $*     B0086 第 3 排左侧座椅安全带负载限制器展开控制
008087     $*     B0087 第 3 排座椅安全带中央负载限制器展开控制
008088     $*     B0088 第 3 排右侧座椅安全带负载限制器展开控制
008090     $*     B0090 左侧正面乘员保护系统传感器
008091     $*     B0091 左侧侧面乘员保护系统传感器 1
008092     $*     B0092 左侧侧面乘员保护系统传感器 2
008093     $*     B0093 左侧侧面乘员保护系统传感器 3
008094     $*     B0094 中央正面乘员保护系统传感器
008095     $*     B0095 右侧正面乘员保护系统传感器
008096     $*     B0096 右侧侧面乘员保护系统传感器 1
008097     $*     B0097 右侧侧面乘员保护系统传感器 2
008098     $*     B0098 右侧侧面乘员保护系统传感器 3
008099     $*     B0099 翻滚传感器
008060     $*     B0060 驾驶员座椅安全带张力传感器
008061     $*     B0061 乘客座椅安全带张力传感器
008070     $*     B0070 驾驶员座椅安全带预紧器展开控制
008071     $*     B0071 第 1 排座椅安全带中央预紧器展开控制
008072     $*     B0072 乘客座椅安全带预紧器展开控制
008073     $*     B0073 第 2 排左侧座椅安全带预紧器展开控制
008074     $*     B0074 第 2 排座椅安全带中央预紧器展开控制
008075     $*     B0075 第 2 排右侧座椅安全带预紧器展开控制
008076     $*     B0076 第 3 排左侧座椅安全带预紧器展开控制
008077     $*     B0077 第 3 排座椅安全带中央预紧器展开控制
008078     $*     B0078 第 3 排右侧座椅安全带预紧器展开控制
008079     $*     B0079 驾驶员座椅安全带预紧器 B 展开控制
00807a     $*     B007A 乘客座椅安全带预紧器 B 展开控制
008040     $*     B0040 第 3 排左侧安全气囊展开控制
008041     $*     B0041 第 3 排左侧正面 (安全气囊) 第 1 阶段展开控制
008042     $*     B0042 第 3 排左侧正面 (安全气囊) 第 2 阶段展开控制
008043     $*     B0043 第 3 排左侧正面 (安全气囊) 第 3 阶段展开控制
008048     $*     B0048 第 3 排右侧安全气囊展开控制
008049     $*     B0049 第 3 排右侧正面 (安全气囊) 第 1 阶段展开控制
00804a     $*     B004A 第 3 排右侧正面 (安全气囊) 第 2 阶段展开控制
00804b     $*     B004B 第 3 排右侧正面 (安全气囊) 第 3 阶段展开控制
008050     $*     B0050 驾驶员安全带传感器
008051     $*     B0051 第 1 排座椅安全带中央传感器
008052     $*     B0052 乘客座椅安全带传感器
008053     $*     B0053 第 2 排左侧座椅安全带传感器
008054     $*     B0054 第 2 排座椅安全带中央传感器
008055     $*     B0055 第 2 排右侧座椅安全带传感器
008056     $*     B0056 第 3 排左侧座椅安全带传感器
008057     $*     B0057 第 3 排座椅安全带中央传感器
008058     $*     B0058 第 3 排右侧座椅安全带传感器
008020     $*     B0020 左侧安全气囊展开控制
008021     $*     B0021 左侧气帘展开控制 1
008022     $*     B0022 左侧气帘展开控制 2
008028     $*     B0028 右侧安全气囊展开控制
008029     $*     B0029 右侧气帘展开控制 1
00802a     $*     B002A 右侧气帘展开控制 2
008030     $*     B0030 第 2 排左侧安全气囊展开控制
008031     $*     B0031 第 2 排左侧正面 (安全气囊) 第 1 阶段展开控制
008032     $*     B0032 第 2 排左侧正面 (安全气囊) 第 2 阶段展开控制
008033     $*     B0033 第 2 排左侧正面 (安全气囊) 第 3 阶段展开控制
008038     $*     B0038 第 2 排右侧安全气囊展开控制
008039     $*     B0039 第 2 排右侧正面 (安全气囊) 第 1 阶段展开控制
00803a     $*     B003A 第 2 排右侧正面 (安全气囊) 第 2 阶段展开控制
00803b     $*     B003B 第 2 排右侧正面 (安全气囊) 第 3 阶段展开控制
008001     $*     B0001 驾驶员正面 (安全气囊) 第 1 阶段展开控制
008002     $*     B0002 驾驶员正面 (安全气囊) 第 2 阶段展开控制
008003     $*     B0003 驾驶员正面 (安全气囊) 第 3 阶段展开控制
008004     $*     B0004 驾驶员膝垫展开控制
008005     $*     B0005 可溃式转向柱展开控制
008010     $*     B0010 乘客正面 (安全气囊) 第 1 阶段展开控制
008011     $*     B0011 乘客正面 (安全气囊) 第 2 阶段展开控制
008012     $*     B0012 乘客正面 (安全气囊) 第 3 阶段展开控制
008013     $*     B0013 乘客膝垫展开控制
00c286     $*     U0286 与散热器防干扰装置失去通信
00c287     $*     U0287 与变速器液泵模块失去通信
00c288     $*     U0288 与直流转交流换流器控制模块 'A' 失去通信
00c289     $*     U0289 与直流转交流换流器控制模块 'B' 失去通信
00c291     $*     U0291 与换挡模块 B 失去通信
00c292     $*     U0292 与驱动电机控制模块 B 失去通信
00c293     $*     U0293 与混合动力总成控制模块失去通信
00c294     $*     U0294 与动力总成控制监测模块失去通信
00c295     $*     U0295 与交流转交流换流器控制模块失去通信
00c296     $*     U0296 与交流转直流换流器控制模块 A 失去通信
00c297     $*     U0297 与交流转直流换流器控制模块 B 失去通信
00c298     $*     U0298 与直流换直流换流器控制模块 A 失去通信
00c299     $*     U0299 与直流转直流换流器控制模块 B 失去通信
00c29a     $*     U029A 与混合动力电池组传感器模块失去通信
00c29b     $*     U029B 与驱动电机控制模块 'C' 失去通信
00c29c     $*     U029C 与驱动电机控制模块 'D' 失去通信
00c29d     $*     U029D 与氮氧化合物传感器 'A' 失去通信
00c29e     $*     U029E 与氮氧化合物传感器 'B' 失去通信
00c260     $*     U0260 与座椅控制开关模块 'A' 失去通信
00c261     $*     U0261 与座椅控制开关模块 'B' 失去通信
00c262     $*     U0262 与音频放大器 'B' 失去通信
00c263     $*     U0263 与语言识别模块失去通信
00c264     $*     U0264 与后摄像头模块失去通信
00c240     $*     U0240 与诱捕控制模块 B 失去通信
00c241     $*     U0241 与大灯控制模块 A 失去通信
00c242     $*     U0242 与大灯控制模块 B 失去通信
00c243     $*     U0243 与驻车辅助控制模块 B 失去通信
00c244     $*     U0244 与脚踏板控制模块 A 失去通信
00c245     $*     U0245 与前部娱乐控制模块失去通信
00c246     $*     U0246 与座椅控制模块 E 失去通信
00c247     $*     U0247 与座椅控制模块 F 失去通信
00c248     $*     U0248 与遥控附件模块失去通信
00c249     $*     U0249 与后部 B 娱乐控制模块失去通信
00c24a     $*     U024A 与内部照明控制模块失去通信
00c250     $*     U0250 与撞击分类系统模块失去通信
00c251     $*     U0251 与脚踏板控制模块 B 失去通信
00c252     $*     U0252 与后部 B 照明控制模块失去通信
00c253     $*     U0253 与辅助通讯协议界面模块失去通信
00c254     $*     U0254 与遥控启动模块失去通信
00c255     $*     U0255 与前显示界面模块失去通信
00c256     $*     U0256 与前控制界面模块 'A' 失去通信
00c257     $*     U0257 与前控制/显示界面模块失去通信
00c258     $*     U0258 与无线电收发机失去通信
00c259     $*     U0259 与特殊用途车辆控制模块 'A' 失去通信
00c25a     $*     U025A 与特殊用途车辆控制模块 'B' 失去通信
00c25b     $*     U025B 与特殊用途车辆控制模块 'C' 失去通信
00c25c     $*     U025C 与特殊用途车辆控制模块 'D' 失去通信
00c25d     $*     U025D 与前控制界面模块 'B' 失去通信
00c220     $*     U0220 与车门开关 F 失去通信
00c221     $*     U0221 与车门开关 G 失去通信
00c222     $*     U0222 与车门车窗电机 A 失去通信
00c223     $*     U0223 与车门车窗电机 B 失去通信
00c224     $*     U0224 与车门车窗电机 C 失去通信
00c225     $*     U0225 与车门车窗电机 D 失去通信
00c226     $*     U0226 与车门车窗电机 E 失去通信
00c227     $*     U0227 与车门车窗电机 F 失去通信
00c228     $*     U0228 与车门车窗电机 G 失去通信
00c229     $*     U0229 与加热方向盘模块失去通信
00c230     $*     U0230 与后板控制模块失去通信
00c231     $*     U0231 与雨量感知模块失去通信
00c232     $*     U0232 与左侧侧面障碍物探测控制模块失去通信
00c233     $*     U0233 与右侧侧面障碍物探测控制模块失去通信
00c234     $*     U0234 与便利召回模块失去通信
00c235     $*     U0235 与巡航控制前方距离范围传感器失去通信
00c236     $*     U0236 与转向柱锁模块失去通信
00c237     $*     U0237 与数字音频控制模块 C 失去通信
00c238     $*     U0238 与数字音频控制模块 D 失去通信
00c239     $*     U0239 与诱捕控制模块 A 失去通信
00c23a     $*     U023A 与图像处理模块 A 失去通信
00c23b     $*     U023B 与图像处理模块 B 失去通信
00c23c     $*     U023C 与图像处理模块 C 失去通信
00c23d     $*     U023E 与巡航控制前方距离范围传感器失去通信
00c23e     $*     U023E 与巡航控制前方距离范围传感器失去通信
00c200     $*     U0200 与车门控制模块 B 失去通信
00c201     $*     U0201 与车门控制模块 C 失去通信
00c202     $*     U0202 与车门控制模块 D 失去通信
00c203     $*     U0203 与车门控制模块 E 失去通信
00c204     $*     U0204 与车门控制模块 F 失去通信
00c205     $*     U0205 与车门控制模块 G 失去通信
00c206     $*     U0206 与折叠车顶控制模块失去通信
00c207     $*     U0207 与可移动车顶控制模块失去通信
00c208     $*     U0208 与座椅控制模块 A 失去通信
00c209     $*     U0209 与座椅控制模块 B 失去通信
00c210     $*     U0210 与座椅控制模块 C 失去通信
00c211     $*     U0211 与座椅控制模块 D 失去通信
00c212     $*     U0212 与转向柱控制模块失去通信
00c213     $*     U0213 与后视镜控制模块 A 失去通信
00c214     $*     U0214 与遥控功能启动装置失去通信
00c215     $*     U0215 与车门开关 A 失去通信
00c216     $*     U0216 与车门开关 B 失去通信
00c217     $*     U0217 与车门开关 C 失去通信
00c218     $*     U0218 与车门开关 D 失去通信
00c219     $*     U0219 与车门开关 E 失去通信
00c320     $*     U0320 软件与动力转向控制模块不兼容
00c321     $*     U0321 软件与悬挂控制模块不相容
00c322     $*     U0322 软件与车身控制模块不兼容
00c323     $*     U0323 软件与仪表盘控制模块不兼容
00c324     $*     U0324 软件与暖通空调控制模块不兼容
00c325     $*     U0325 软件与辅助加热器控制模块不兼容
00c326     $*     U0326 软件与车辆防盗系统控制模块不兼容
00c327     $*     U0327 软件与车辆安全控制模块不兼容
00c328     $*     U0328 软件与转向角传感器模块不兼容
00c329     $*     U0329 软件与转向柱控制模块不兼容
00c330     $*     U0330 软件与胎压监测模块不兼容
00c331     $*     U0331 软件与车身控制模块 A 不兼容
00c332     $*     U0332 软件与多轴加速传感器模块不兼容
00c333     $*     U0333 软件与换挡控制模块 B 不兼容
00c334     $*     U0334 软件与无线电不兼容
00c335     $*     U0335 软件与混合动力电池组传感器模块不兼容
00c336     $*     U0336 软件与乘员保护装置控制模块不兼容
00c300     $*     U0300 内部控制模块软件不兼容
00c301     $*     U0301 软件与发动机控制模块/动力系统控制模块不兼容
00c302     $*     U0302 软件与变速器控制模块不兼容
00c303     $*     U0303 软件与分动箱控制模块不兼容
00c304     $*     U0304 软件与换挡控制模块 A 不兼容
00c305     $*     U0305 软件与巡航控制模块不兼容
00c306     $*     U0306 软件与燃油喷油嘴控制模块不兼容
00c307     $*     U0307 软件与预热塞控制模块不兼容
00c308     $*     U0308 软件与节气门执行器控制模块不兼容
00c309     $*     U0309 软件与替代燃油控制模块不兼容
00c310     $*     U0310 软件与燃油泵控制模块不兼容
00c311     $*     U0311 软件与驱动电机控制模块不兼容
00c312     $*     U0312 软件与电池能量控制模块 A 不兼容
00c313     $*     U0313 软件与电池能量控制模块 B 不兼容
00c314     $*     U0314 软件与四轮驱动离合器控制模块不兼容
00c315     $*     U0315 软件与防抱死剎车系统控制模块不兼容
00c316     $*     U0316 软件与车辆动态控制模块不兼容
00c317     $*     U0317 软件与驻车剎车控制模块不兼容
00c318     $*     U0318 软件与制动系统控制模块不兼容
00c319     $*     U0319 软件与转向力控制模块不兼容
00c060     $*     U0060 车辆通信总线 D (-) 开路
00c061     $*     U0061 车辆通信总线 D (-) 低
00c062     $*     U0062 车辆通信总线 D (-) 高
00c063     $*     U0063 车辆通信总线 D (-) 与总线 D (+) 短路
00c064     $*     U0064 车辆通信总线 E
00c065     $*     U0065 车辆通信总线 E 性能
00c066     $*     U0066 车辆通信总线 E (+) 开路
00c067     $*     U0067 车辆通信总线 E (+) 低
00c068     $*     U0068 车辆通信总线 E (+) 高
00c069     $*     U0069 车辆通信总线 E (-) 开路
00c070     $*     U0070 车辆通信总线 E (-) 低
00c071     $*     U0071 车辆通信总线 E (-) 高
00c072     $*     U0072 车辆通信总线 E (-) 与总线 E (+) 短路
00c073     $*     U0073 控制模块通讯总线 'A' 关闭
00c074     $*     U0074 控制模块通讯总线 'B' 关闭
00c040     $*     U0040 车辆通信总线 B (+) 低
00c041     $*     U0041 车辆通信总线 B (+) 高
00c042     $*     U0042 车辆通信总线 B (-) 开路
00c043     $*     U0043 车辆通信总线 B (-) 低
00c044     $*     U0044 车辆通信总线 B (-) 高
00c045     $*     U0045 车辆通信总线 B (-) 与总线 B (+) 短路
00c046     $*     U0046 车辆通信总线 C
00c047     $*     U0047 车辆通信总线 C 性能
00c048     $*     U0048 车辆通信总线 C (+) 开路
00c049     $*     U0049 车辆通信总线 C (+) 低
00c050     $*     U0050 车辆通信总线 C (+) 高
00c051     $*     U0051 车辆通信总线 C (-) 开路
00c052     $*     U0052 车辆通信总线 C (-) 低
00c053     $*     U0053 车辆通信总线 C (-) 高
00c054     $*     U0054 车辆通信总线 C (-) 与总线 C (+) 短路
00c055     $*     U0055 车辆通信总线 D
00c056     $*     U0056 车辆通信总线 D 性能
00c057     $*     U0057 车辆通信总线 D (+) 开路
00c058     $*     U0058 车辆通信总线 D (+) 低
00c059     $*     U0059 车辆通信总线 D (+) 高
00c020     $*     U0020 低速 CAN 通信总线性能
00c021     $*     U0021 低速 CAN 通信总线 (+) 开路
00c022     $*     U0022 低速 CAN 通信总线 (+) 低
00c023     $*     U0023 低速 CAN 通信总线 (+) 高
00c024     $*     U0024 低速 CAN 通信总线 (-) 开路
00c025     $*     U0025 低速 CAN 通信总线 (-) 低
00c026     $*     U0026 低速 CAN 通信总线 (-) 高
00c027     $*     U0027 低速 CAN 通讯总线 (-) 与总线 (+) 短路
00c028     $*     U0028 车辆通信总线 A
00c029     $*     U0029 车辆通信总线 A 性能
00c030     $*     U0030 车辆通信总线 A (+) 开路
00c031     $*     U0031 车辆通信总线 A (+) 低
00c032     $*     U0032 车辆通信总线 A (+) 高
00c033     $*     U0033 车辆通信总线 A (-) 开路
00c034     $*     U0034 车辆通信总线 A (-) 低
00c035     $*     U0035 车辆通信总线 A (-) 高
00c036     $*     U0036 车辆通讯总线 A (-) 与总线 A (+) 短路
00c037     $*     U0037 车辆通信总线 B
00c038     $*     U0038 车辆通信总线 B 性能
00c039     $*     U0039 车辆通信总线 B (+) 开路
00c001     $*     U0001 高速 CAN 通信总线
00c002     $*     U0002 高速 CAN 通信总线性能
00c003     $*     U0003 高速 CAN 通信总线 (+) 开路
00c004     $*     U0004 高速 CAN 通讯总线 (+) 低
00c005     $*     U0005 高速 CAN 通信总线 (+) 高
00c006     $*     U0006 高速 CAN 通信总线 (-) 开路
00c007     $*     U0007 高速 CAN 通信总线 (-) 低
00c008     $*     U0008 高速 CAN 通信总线 (-) 电压高
00c009     $*     U0009 高速 CAN 通信总线 (-) 与总线 (+) 短路
00c010     $*     U0010 中速 CAN 通信总线
00c011     $*     U0011 中速 CAN 通信总线性能
00c012     $*     U0012 中速 CAN 通信总线 (+) 开路
00c013     $*     U0013 中速 CAN 通信总线 (+) 低
00c014     $*     U0014 中速 CAN 通信总线 (+) 高
00c015     $*     U0015 中速 CAN 通信总线 (-) 开路
00c016     $*     U0016 中速 CAN 通信总线 (-) 低
00c017     $*     U0017 中速 CAN 通信总线 (-) 高
00c018     $*     U0018 中速 CAN 通信总线 (-) 与总线 (+) 短路
00c019     $*     U0019 低速 CAN 通信总线
00c180     $*     U0180 与自动照明控制模块失去通信
00c181     $*     U0181 与大灯水平控制模块失去通信
00c182     $*     U0182 与前部照明控制模块失去通信
00c183     $*     U0183 与后部照明控制模块 A 失去通信
00c184     $*     U0184 与无线电失去通信
00c185     $*     U0185 与天线控制模块失去通信
00c186     $*     U0186 与音频放大器失去通信
00c187     $*     U0187 与数字光盘播放器/换片机模块 A 失去通信
00c188     $*     U0188 与数字光盘播放器/换片机模块 B 失去通信
00c189     $*     U0189 与数字光盘播放器/换片机模块 C 失去通信
00c190     $*     U0190 与数字光盘播放器/换片机模块 D 失去通信
00c191     $*     U0191 与电视机失去通信
00c192     $*     U0192 与个人计算机失去通信
00c193     $*     U0193 与数字音频控制模块 A 失去通信
00c194     $*     U0194 与数字音频控制模块 B 失去通信
00c195     $*     U0195 与付费娱乐接收器模块失去通信
00c196     $*     U0196 与后部娱乐控制模块 A 失去通信
00c197     $*     U0197 与电话控制模块失去通信
00c198     $*     U0198 与车载资通讯控制模块失去通信
00c199     $*     U0199 与车门控制模块 A 失去通信
00c160     $*     U0160 与声音警告控制模块失去通信
00c161     $*     U0161 与罗盘模块失去通信
00c162     $*     U0162 与导航显示模块失去通信
00c163     $*     U0163 与导航控制模块失去通信
00c164     $*     U0164 与暖通空调控制模块失去通信
00c165     $*     U0165 与后部暖通空调控制模块失去通信
00c166     $*     U0166 与辅助加热器控制模块失去通信
00c167     $*     U0167 与车辆防盗控制模块失去通信
00c168     $*     U0168 与车辆安全控制模块失去通信
00c169     $*     U0169 与天窗控制模块失去通信
00c16a     $*     U016A 与全球定位系统模块失去通信
00c170     $*     U0170 与乘员保护系统传感器 A 失去通信
00c171     $*     U0171 与乘员保护系统传感器 B 失去通信
00c172     $*     U0172 与乘员保护系统传感器 C 失去通信
00c173     $*     U0173 与乘员保护系统传感器 D 失去通信
00c174     $*     U0174 与乘员保护系统传感器 E 失去通信
00c175     $*     U0175 与乘员保护系统传感器 F 失去通信
00c176     $*     U0176 与乘员保护系统传感器 G 失去通信
00c177     $*     U0177 与乘员保护系统传感器 H 失去通信
00c178     $*     U0178 与乘员保护系统传感器 I 失去通信
00c179     $*     U0179 与乘员保护系统传感器 J 失去通信
00c17a     $*     U017A 与乘员保护系统传感器 K 失去通信
00c17b     $*     U017B 与乘员保护系统传感器 L 失去通信
00c17c     $*     U017C 与乘员保护系统传感器 M 失去通信
00c17d     $*     U017D 与乘员保护系统传感器 N 失去通信
00c17e     $*     U017E 与座椅安全带预紧器模块 'A' 失去通信
00c17f     $*     U017F 与座椅安全带预紧器模块 'B' 失去通信
00c140     $*     U0140 与车身控制模块失去通信
00c141     $*     U0141 与车身控制模块 A 失去通信
00c142     $*     U0142 与车身控制模块 B 失去通信
00c143     $*     U0143 与车身控制模块 C 失去通信
00c144     $*     U0144 与车身控制模块 D 失去通信
00c145     $*     U0145 与车身控制模块 E 失去通信
00c146     $*     U0146 与网关 A 失去通信
00c147     $*     U0147 与网关 B 失去通信
00c148     $*     U0148 与网关 C 失去通信
00c149     $*     U0149 与网关 D 失去通信
00c150     $*     U0150 与网关 E 失去通信
00c151     $*     U0151 与乘员保护系统控制模块失去通信
00c152     $*     U0152 与左侧侧面乘员保护系统控制模块失去通信
00c153     $*     U0153 与右侧侧面乘员保护系统控制模块失去通信
00c154     $*     U0154 与乘员保护系统乘员分类系统模块失去通信
00c155     $*     U0155 与仪表盘 (IPC) 控制模块失去通信
00c156     $*     U0156 与信息中心 A 失去通信
00c157     $*     U0157 与信息中心 B 失去通信
00c158     $*     U0158 与平视显示器失去通信
00c159     $*     U0159 与驻车辅助控制模块 A 失去通信
00c120     $*     U0120 与起动机/发电机控制模块失去通信
00c121     $*     U0121 与防抱死刹车系统 (ABS) 控制模块失去通信
00c122     $*     U0122 与车辆动态控制模块失去通信
00c123     $*     U0123 与偏航率传感器模块失去通信
00c124     $*     U0124 与横向加速度传感器模块失去通信
00c125     $*     U0125 与多轴加速传感器模块失去通信
00c126     $*     U0126 与转向角传感器模块失去通信
00c127     $*     U0127 与胎压监测器模块失去通信
00c128     $*     U0128 与驻车制动控制模块失去通信
00c129     $*     U0129 与制动系统控制模块失去通信
00c130     $*     U0130 与转向力控制模块失去通信
00c131     $*     U0131 与动力转向控制模块失去通信
00c132     $*     U0132 与悬架控制模块失去通信
00c133     $*     U0133 与侧倾主动控制模块失去通信
00c134     $*     U0134 与后部动力转向控制模块失去通信
00c135     $*     U0135 与前部差速器控制模块失去通信
00c136     $*     U0136 与后部差速器控制模块失去通信
00c137     $*     U0137 与挂车制动器控制模块失去通信
00c138     $*     U0138 与全地形控制模块失去通信
00c100     $*     U0100 与发动机控制模块/动力总成控制模块 A 失去通信
00c101     $*     U0101 与变速器控制模块失去通信
00c102     $*     U0102 与分动箱控制模块失去通信
00c103     $*     U0103 与换挡控制模块 A 失去通信
00c104     $*     U0104 与巡航控制模块失去通信
00c105     $*     U0105 与燃油喷油嘴控制模块失去通信
00c106     $*     U0106 与预热塞控制模块失去通信
00c107     $*     U0107 与节气门执行器控制模块失去通信
00c108     $*     U0108 与替代燃油控制模块失去通信
00c109     $*     U0109 与燃油泵控制模块失去通信
00c10a     $*     U010A 与废气再循环控制模块 'A' 失去通信
00c10b     $*     U010B 与废气再循环控制模块 'B' 失去通信
00c10c     $*     U010C 与涡轮增压器/超级增压器控制模块 'A' 失去通信
00c10d     $*     U010D 与涡轮增压器/超级增压器控制模块 'B' 失去通信
00c10e     $*     U010E 与还原剂控制模块失去通信
00c10f     $*     U010F 与空调控制模块失去通信
00c110     $*     U0110 与驱动电机控制模块 A 失去通信
00c111     $*     U0111 与电池能量控制模块 A 失去通信
00c112     $*     U0112 与电池能量控制模块 B 失去通信
00c113     $*     U0113 与排放临界控制信息失去通信
00c114     $*     U0114 与四轮驱动离合器控制模块失去通信
00c115     $*     U0115 与发动机控制模块/动力总成控制模块 B 失去通信
00c116     $*     U0116 与冷却液温度控制模块失去通信
00c117     $*     U0117 与电动动力输出控制模块失去通信
00c118     $*     U0118 与燃油添加剂控制模块失去通信
00c119     $*     U0119 与燃料电池控制模块失去通信
00c11a     $*     U011A 与废气传感器模块失去通信
00c11b     $*     U011B 与摇臂控制模块 'A' 失去通信
00c11c     $*     U011C 与摇臂控制模块 'B' 失去通信
00c11d     $*     U011D 与全轮驱动控制模块失去通信
00c481     $*     U0481 收到来自自动灯光控制模块的数据无效
00c482     $*     U0482 收到来自大灯水平控制模块的数据无效
00c483     $*     U0483 收到来自前照明控制模块的数据无效
00c484     $*     U0484 收到来自后灯光控制模块 A 的数据无效
00c485     $*     U0485 收到来自无线电的数据无效
00c486     $*     U0486 收到来自无线电控制模块的数据无效
00c487     $*     U0487 收到来自音频放大器的数据无效
00c488     $*     U0488 收到来自数字光盘播放器/换片机模块 A 的数据无效
00c489     $*     U0489 收到来自数字光盘播放器/换片机模块 B 的数据无效
00c48a     $*     U048A 收到来自数字光盘播放器/转换器模块 C 的数据无效
00c491     $*     U0491 收到来自数字光盘播放器/换片机模块 D 的数据无效
00c492     $*     U0492 收到来自电视机的数据无效
00c493     $*     U0493 收到来自个人计算机的数据无效
00c494     $*     U0494 收到来自数字音频控制模块 A 的数据无效
00c495     $*     U0495 收到来自数字音频控制模块 B 的数据无效
00c496     $*     U0496 收到来自付费娱乐接收器模块的数据无效
00c497     $*     U0497 收到来自后娱乐控制模块 A 的数据无效
00c498     $*     U0498 收到来自电话控制模块的数据无效
00c499     $*     U0499 收到来自车载资控制模块的数据无效
00c49a     $*     U049A 收到来自车门控制模块 A 的数据无效
00c461     $*     U0461 收到来自声音警告控制模块的数据无效
00c462     $*     U0462 收到来自罗盘模块的数据无效
00c463     $*     U0463 收到来自导航显示模块的数据无效
00c464     $*     U0464 收到来自导航控制模块的数据无效
00c465     $*     U0465 收到来自电气动力输出控制模块的数据无效
00c466     $*     U0466 收到来自后暖通空调控制模块的数据无效
00c467     $*     U0467 收到来自燃油添加剂控制模块的数据无效
00c468     $*     U0468 收到来自燃料电池控制模块的数据无效
00c469     $*     U0469 收到来自起动机/发电机控制模块的数据无效
00c46a     $*     U046A 收到来自天窗控制模块的数据无效
00c46b     $*     U046B 收到来自全球定位系统控制模块的数据无效
00c471     $*     U0471 收到来自乘员保护系统传感器 A 的数据无效
00c472     $*     U0472 收到来自乘员保护系统传感器 B 的数据无效
00c473     $*     U0473 收到来自乘员保护系统传感器 C 的数据无效
00c474     $*     U0474 收到来自乘员保护系统传感器 D 的数据无效
00c475     $*     U0475 收到来自乘员保护系统传感器 E 的数据无效
00c476     $*     U0476 收到来自乘员保护系统传感器 F 的数据无效
00c477     $*     U0477 收到来自乘员保护系统传感器 G 的数据无效
00c478     $*     U0478 收到来自乘员保护系统传感器 H 的数据无效
00c479     $*     U0479 收到来自乘员保护系统传感器 I 的数据无效
00c47a     $*     U047A 收到来自乘员保护系统传感器 J 的数据无效
00c47b     $*     U047B 收到来自乘员保护系统传感器 K 的数据无效
00c47c     $*     U047C 收到来自乘员保护系统传感器 L 的数据无效
00c47d     $*     U047D 收到来自乘员保护系统传感器 M 的数据无效
00c47e     $*     U047E 收到来自乘员保护系统传感器 N 的数据无效
00c47f     $*     U047F 收到来自座椅安全带预紧器模块 'A' 的数据无效
00c441     $*     U0441 收到来自排放临界控制信息的数据无效
00c442     $*     U0442 收到来自发动机控制模块/动力总成控制模块 B 的数据无效
00c443     $*     U0443 收到来自车身控制模块 B 的数据无效
00c444     $*     U0444 收到来自车身控制模块 C 的数据无效
00c445     $*     U0445 收到来自车身控制模块 D 的数据无效
00c446     $*     U0446 收到来自车身控制模块 E 的数据无效
00c447     $*     U0447 收到来自网关 A 的数据无效
00c448     $*     U0448 收到来自网关 B 的数据无效
00c449     $*     U0449 收到来自网关 C 的数据无效
00c44a     $*     U044A 收到来自网关 D 的数据无效
00c451     $*     U0451 收到来自网关 E 的数据无效
00c452     $*     U0452 收到来自乘员保护控制模块的数据无效
00c453     $*     U0453 收到来自左侧侧面乘员保护系统控制模块的数据无效
00c454     $*     U0454 收到来自右侧侧面乘员保护系统控制模块的数据无效
00c455     $*     U0455 收到来自乘员保护系统乘员分类系统模块的数据无效
00c456     $*     U0456 收到来自冷却液温度控制模块的数据无效
00c457     $*     U0457 收到来自信息中心 A 的数据无效
00c458     $*     U0458 收到来自信息中心 B 的数据无效
00c459     $*     U0459 收到来自平视显示器的数据无效
00c45a     $*     U045A 收到来自驻车辅助控制模块 A 的数据无效
00c420     $*     U0420 收到来自动力转向控制模块的数据无效
00c421     $*     U0421 收到来自悬挂控制模块的数据无效
00c422     $*     U0422 收到来自车身控制模块的数据无效
00c423     $*     U0423 收到来自仪表板控制模块的数据无效
00c424     $*     U0424 收到来自暖通空调控制模块的数据无效
00c425     $*     U0425 由辅助加热器控制模块获得的数据无效
00c426     $*     U0426 由车辆防盗系统控制模块获得的数据无效
00c427     $*     U0427 由车辆保安控制模块获得的数据无效
00c428     $*     U0428 收到来自转向角传感器模块的数据无效
00c429     $*     U0429 收到来自转向柱控制模块的数据无效
00c430     $*     U0430 收到来自胎压监测模块的数据无效
00c431     $*     U0431 收到来自车身控制模块 A 的数据无效
00c432     $*     U0432 收到来自多轴加速传感器模块的数据无效
00c433     $*     U0433 收到来自巡航控制前面距离范围传感器的数据无效
00c434     $*     U0434 收到来自侧倾主动控制模块的数据无效
00c435     $*     U0435 收到来自后动力转向控制模块的数据无效
00c436     $*     U0436 收到来自前差速器控制模块的数据无效
00c437     $*     U0437 收到来自后差速器控制模块的数据无效
00c438     $*     U0438 收到来自拖车制动器控制模块的数据无效
00c439     $*     U0439 收到来自所有地形控制模块的数据无效
00c43a     $*     U043A 收到来自悬挂控制模块 'B' 的数据无效
00c43b     $*     U043B 收到来自巡航控制前面距离范围左传感器的数据无效
00c43c     $*     U043C 收到来自巡航控制前面距离范围右传感器的数据无效
00c400     $*     U0400 收到无效数据
00c401     $*     U0401 收到来自发动机控制模块/动力总成控制模块 A 的数据无效
00c402     $*     U0402 收到来自变速器控制模块的数据无效
00c403     $*     U0403 收到来自变速器控制模块的数据无效
00c404     $*     U0404 收到来自变速器控制模块 A 的数据无效
00c405     $*     U0405 收到来自巡航控制模块的数据无效
00c406     $*     U0406 收到来自燃油喷油嘴控制模块获得的数据无效
00c407     $*     U0407 收到来自预热塞控制模块的数据无效
00c408     $*     U0408 收到来自节气门执行器控制模块的数据无效
00c409     $*     U0409 收到来自替代燃油控制模块的数据无效
00c40a     $*     U040A 收到来自数字光盘播放器/换片机模块 C 的数据无效
00c40b     $*     U040B 收到来自废气再循环控制模块 'A' 的数据无效
00c40c     $*     U040C 收到废气再循环控制模块 'B' 的数据无效
00c40d     $*     U040D 收到来自涡轮增压器/超级增压器控制模块  'A' 的数据无效
00c40e     $*     U040E 收到来自涡轮增压器/超级增压器控制模块 'B' 的数据无效
00c40f     $*     U040F 收到来自还原剂控制模块的数据无效
00c410     $*     U0410 收到来自燃油泵控制模块的数据无效
00c411     $*     U0411 收到来自驱动电机控制模块 A 的数据无效
00c412     $*     U0412 收到来自电池能量控制模块 A 的数据无效
00c413     $*     U0413 收到来自电池能量控制模块 B 的数据无效
00c414     $*     U0414 收到来自四轮驱动离合器控制模块的数据无效
00c415     $*     U0415 收到来自防抱死刹车系统 (ABS) 控制模块的数据无效
00c416     $*     U0416 收到来自车辆动态控制模块的数据无效
00c417     $*     U0417 收到来自驻车制动控制模块的数据无效
00c418     $*     U0418 收到来自制动系统控制模块的数据无效
00c419     $*     U0419 收到来自转向力控制模块的数据无效
00c41b     $*     U041B 收到来自废气传感器模块的数据无效
00c41c     $*     U041C 收到来自摇臂控制模块 'A' 的数据无效
00c41d     $*     U041D 收到来自摇臂控制模块 'B' 的数据无效
00c41e     $*     U041E 收到来自全轮驱动控制模块的数据无效
00c587     $*     U0587 收到来自散热器防干扰装置的数据无效
00c588     $*     U0588 收到来自变速箱机液泵模块获得的数据无效
00c589     $*     U0589 收到来自直流转交流换流器控制模块 'A' 的数据无效
00c58a     $*     U058A 收到来自直流转交流换流器控制模块 B 的数据无效
00c592     $*     U0592 收到来自换挡模块 B 的数据无效
00c593     $*     U0593 收到来自驱动电机控制模块 B 的数据无效
00c594     $*     U0594 收到来自混合动力总成控制模块的数据无效
00c595     $*     U0595 收到来自动力总成控制监测模块的数据无效
00c596     $*     U0596 收到来自交流转交流换流器控制模块的数据无效
00c597     $*     U0597 收到来自交流转直流换流器控制模块 A 的数据无效
00c598     $*     U0598 收到来自交流转直流换流器控制模块 B 的数据无效
00c599     $*     U0599 收到来自直流转直流换流器控制模块 A 的数据无效
00c59a     $*     U059A 收到来自直流至直流转换器控制模块 B 获得的数据无效
00c59b     $*     U059B 收到来自混合动力电池组传感器模块的数据无效
00c59c     $*     U059C 收到来自驱动电机控制模块 C 的数据无效
00c59d     $*     U059D 收到来自驱动电机控制模块 D 的数据无效
00c59e     $*     U059E 收到来自氮氧化合物传感器 'A' 的数据无效
00c59f     $*     U059F 收到来自氮氧化合物传感器 'B' 的数据无效
00c561     $*     U0561 收到来自座椅控制开关模块 'A' 的数据无效
00c562     $*     U0562 收到来自座椅控制开关模块 'B' 的数据无效
00c563     $*     U0563 收到来自音频放大器 B 的数据无效
00c564     $*     U0564 收到来自语音识别模块的数据无效
00c565     $*     U0565 收到来自后摄像头模块的数据无效
00c541     $*     U0541 收到来自诱捕控制模块 B 的数据无效
00c542     $*     U0542 收到来自大灯控制模块 A 的数据无效
00c543     $*     U0543 收到来自大灯控制模块 B 的数据无效
00c544     $*     U0544 收到来自驻车辅助控制模块 B 的数据无效
00c545     $*     U0545 收到来自踏板控制模块的数据无效
00c546     $*     U0546 收到来自前娱乐控制模块的数据无效
00c547     $*     U0547 收到来自座椅控制模块 E 的数据无效
00c548     $*     U0548 收到来自座椅控制模块 F 的数据无效
00c549     $*     U0549 收到来自遥控附件模块的数据无效
00c54a     $*     U054A 收到来自后娱乐控制模块 B 的数据无效
00c54b     $*     U054B 收到来自内部照明控制模块的数据无效
00c551     $*     U0551 收到来自撞击分类系统模块的数据无效
00c552     $*     U0552 收到来自踏板控制模块 B 的数据无效
00c553     $*     U0553 收到来自后照明控制模块B 的数据无效
00c554     $*     U0554 收到来自附件协议接口模块的数据无效
00c555     $*     U0555 收到来自遥控启动模块的数据无效
00c556     $*     U0556 收到来自前显示界面模块的数据无效
00c557     $*     U0557 收到来自前控制器界面模块 'A' 的数据无效
00c558     $*     U0558 收到来自前控制器/显示界面模块的数据无效
00c559     $*     U0559 收到来自无线电收发机的数据无效
00c55a     $*     U055A 收到来自专用车辆控制模块 A 获得的数据无效
00c55b     $*     U055B 收到来自特殊用途车辆控制模块 B 的数据无效
00c55c     $*     U055C 收到来自特殊用途车辆控制模块 C 的数据无效
00c55d     $*     U055D 收到来自特殊用途车辆控制模块 D 的数据无效
00c55e     $*     U055E 收到来自前控制器界面模块 'B' 的数据无效
00c521     $*     U0521 收到来自车门开关 F 的数据无效
00c522     $*     U0522 收到来自车门开关 G 的数据无效
00c523     $*     U0523 收到来自车门车窗电机 A 的数据无效
00c524     $*     U0524 收到来自车门车窗电机 B 的数据无效
00c525     $*     U0525 收到来自车门车窗电机 C 的数据无效
00c526     $*     U0526 收到来自车门车窗电机 D 的数据无效
00c527     $*     U0527 收到来自车门车窗电机 E 的数据无效
00c528     $*     U0528 收到来自车门车窗电机 F 的数据无效
00c529     $*     U0529 收到来自车门车窗电机 G 的数据无效
00c52a     $*     U052A 收到来自加热方向盘模块的数据无效
00c531     $*     U0531 收到来自后板模块的数据无效
00c532     $*     U0532 收到来自雨量感知模块的数据无效
00c533     $*     U0533 收到来自左侧侧面障碍物探测控制模块的数据无效
00c534     $*     U0534 收到来自右侧侧面障碍物探测控制模块的数据无效
00c535     $*     U0535 收到来自方便召回模块的数据无效
00c536     $*     U0536 收到来自侧向加速传感器模块的数据无效
00c537     $*     U0537 收到来自转向柱锁模块的数据无效
00c538     $*     U0538 收到来自数字音频控制模块 C 的数据无效
00c539     $*     U0539 收到来自数字音频控制模块 D 的数据无效
00c53a     $*     U053A 收到来自诱捕控制模块 A 的数据无效
00c53b     $*     U053B 收到来自图像处理模块 A 的数据无效
00c53c     $*     U053C 收到来自图像处理模块 B 的数据无效
00c53d     $*     U053D 收到来自图像处理模块 C 的数据无效
00c501     $*     U0501 收到来自车门控制模块 B 的数据无效
00c502     $*     U0502 收到来自车门控制模块 C 的数据无效
00c503     $*     U0503 收到来自车门控制模块 D 的数据无效
00c504     $*     U0504 收到来自车门控制模块 E 的数据无效
00c505     $*     U0505 收到来自车门控制模块 F 的数据无效
00c506     $*     U0506 收到来自车门控制模块 G 的数据无效
00c507     $*     U0507 收到来自折叠车顶控制模块的数据无效
00c508     $*     U0508 收到来自可移动车顶控制模块的数据无效
00c509     $*     U0509 收到来自座椅控制模块 A 的数据无效
00c50a     $*     U050A 收到来自座椅控制模块 B 的数据无效
00c511     $*     U0511 收到来自座椅控制模块 C 的数据无效
00c512     $*     U0512 收到来自座椅控制模块 D 的数据无效
00c513     $*     U0513 收到来自偏航率传感器模块的数据无效
00c514     $*     U0514 收到来自后视镜控制模块 A 的数据无效
00c515     $*     U0515 收到来自遥控功能启动装置的数据无效
00c516     $*     U0516 收到来自车门开关 A 的数据无效
00c517     $*     U0517 收到来自车门开关 B 的数据无效
00c518     $*     U0518 收到来自车门开关 C 的数据无效
00c519     $*     U0519 收到来自车门开关 D 的数据无效
00c51a     $*     U051A 收到来自车门开关 E 的数据无效
00f000     $*     U3000 控制模块
00f001     $*     U3001 控制模块关闭不当
00f002     $*     U3002 车辆识别码
00f003     $*     U3003 电池电压
00f004     $*     U3004 辅助设备电源继电器
00f005     $*     U3005 维持辅助设备供电r
00f006     $*     U3006 控制模块输入电源 A
00f007     $*     U3007 控制模块输入电源 B
00f008     $*     U3008 控制模块接地 A
00f009     $*     U3009 控制模块接地 B
00f00a     $*     U300A 点火开关
00f00b     $*     U300B 点火输入附件/接通/起动
00f00c     $*     U300C 点火输入关闭/接通/起动
00f00d     $*     U300D 点火输入接通/起动
00f00e     $*     U300E 点火输入接通
00f00f     $*     U300F 点火输入附件
00f010     $*     U3010 点火输入启动
00f011     $*     U3011 点火输入关闭
120827     $*     P0827 升降档开关电路电压低
120828     $*     P0828 升降档开关电路电压高
120980     $*     P0980 换档电磁阀C控制电路电压高
120982     $*     P0982 换档电磁阀D控制电路电压低
120983     $*     P0983 换档电磁阀D控制电路电压高
120985     $*     P0985 换档电磁阀E控制电路电压低
120986     $*     P0986 换档电磁阀E控制电路电压高
120962     $*     P0962 压力控制电磁阀A控制电路电压低
120963     $*     P0963 压力控制电磁阀A控制电路电压高
120966     $*     P0966 压力控制电磁阀B控制电路电压低
120967     $*     P0967 压力控制电磁阀B控制电路电压高
120970     $*     P0970 压力控制电磁阀C控制电路电压低
120971     $*     P0971 压力控制电磁阀C控制电路电压高
120973     $*     P0973 换档电磁阀A控制电路电压低
120974     $*     P0974 换档电磁阀A控制电路电压高
120976     $*     P0976 换档电磁阀B控制电路电压低
120977     $*     P0977 换档电磁阀B控制电路电压高
120979     $*     P0979 换档电磁阀C控制电路电压低
120601     $*     P0601 内部控制模块存储器校验和错误
120603     $*     P0603 内部控制模块保持记忆体(KAM)错误
120604     $*     P0604 内部控制模块随机存取存储器(RAM)错误
120780     $*     P0780 换档错误
120762     $*     P0762 换档电磁阀C卡在开启
120741     $*     P0741 液力变矩器离合器电路性能或卡在关闭
120742     $*     P0742 液力变矩器离合器电路卡在开启
120720     $*     P0720 输出速度传感器电路
120722     $*     P0722 输出速度传感器电路无信号
120730     $*     P0730 制造商控制的变速器(错误传动比)
120731     $*     P0731 1档错误比
120732     $*     P0732 2档错误比
120733     $*     P0733 3档错误比
120734     $*     P0734 4档错误比
120735     $*     P0735 5档错误比
120736     $*     P0736 倒档错误比
120705     $*     P0705 变速范围传感器电路故障(PRNDM输入)
120711     $*     P0711 传动液温传感器A电路性范围/性能
120712     $*     P0712 传动液温传感器A电路电压低
120713     $*     P0713 传动液温传感器A电路电压高
120715     $*     P0715 输入速度传感器A电路
120717     $*     P0717 输入速度传感器A电路无信号
120562     $*     P0562 系统电压低
120563     $*     P0563 系统电压高
12c001     $*     U0001 高速CAN通讯总线
12c122     $*     U0122 与ESP(车身稳定系统)通讯丢失
12c100     $*     U0100 与EMS通讯丢失
110a59     $*     P0A59 发电机故障
110831     $*     P0831 离合器位置开关线路低电压
110832     $*     P0832 离合器位置开关线路高电压
110299     $*     P0299 涡轮增压不足
110261     $*     P0261 1缸喷嘴线路低电压故障
110262     $*     P0262 1缸喷嘴线路高电压故障
110264     $*     P0264 2缸喷嘴线路低电压故障
110265     $*     P0265 2缸喷嘴线路高电压故障
110267     $*     P0267 3缸喷嘴线路低电压故障
110268     $*     P0268 3缸喷嘴线路高电压故障
110270     $*     P0270 4缸喷嘴线路低电压故障
110271     $*     P0271 4缸喷嘴线路高电压故障
110245     $*     P0245 涡轮控制阀线圈低电压或断路
110246     $*     P0246 涡轮控制阀线圈高电压
110222     $*     P0222 电子节气门位置传感器2#线路低电压
110223     $*     P0223 电子节气门位置传感器2#线路高电压
110230     $*     P0230 油泵继电器故障
110234     $*     P0234 涡轮增压过量
110236     $*     P0236 增压压力与大气压合理性故障
110237     $*     P0237 增压压力传感器线路低电压或断开
110238     $*     P0238 增压压力传感器线路高电压
11023d     $*     P023D 增压压力与进气压力合理性故障
110351     $*     P0351 1(4)缸点火线圈故障
110352     $*     P0352 2(3)缸点火线圈故障
110353     $*     P0353 3缸点火线圈故障
110354     $*     P0354 4缸点火线圈故障
110324     $*     P0324 爆震控制系统故障
110325     $*     P0325 爆震传感器故障
110335     $*     P0335 曲轴位置传感器线路无信号
110336     $*     P0336 曲轴位置传感器线路信号干扰
110300     $*     P0300 单缸或多缸失火
110072     $*     P0072 环境温度传感器线路低电压
110073     $*     P0073 环境温度传感器线路高电压或断路
110034     $*     P0034 涡轮旁通电磁阀控制线路低电压或断路
110035     $*     P0035 涡轮旁通电磁阀控制线路高电压
110171     $*     P0171 非怠速工况燃油系统过稀
110172     $*     P0172 非怠速工况燃油系统过浓
110140     $*     P0140 后氧传感器断路
110141     $*     P0141 后氧传感器加热器故障
110122     $*     P0122 电子节气门位置传感器1#线路低电压
110123     $*     P0123 电子节气门位置传感器1#线路高电压
110131     $*     P0131 前氧传感器短路到低电压
110132     $*     P0132 前氧传感器短路到高电压
110133     $*     P0133 前氧传感器响应过慢
110134     $*     P0134 前氧传感器断路
110135     $*     P0135 前氧传感器加热器故障
110137     $*     P0137 后氧传感器短路到低电压
110138     $*     P0138 后氧传感器短路到高电压
110106     $*     P0106 进气压力/油门位置合理性故障
110107     $*     P0107 进气压力传感器线路低电压或断路
110108     $*     P0108 进气压力传感器线路高电压
110112     $*     P0112 进气温度传感器线路低电压
110113     $*     P0113 进气温度传感器线路高电压或断路
110117     $*     P0117 冷却液温度传感器线路低电压
110118     $*     P0118 冷却液温度传感器线路高电压或断路
110685     $*     P0685 主继电器故障
110641     $*     P0641 ETC参考电压A#幅值故障
110646     $*     P0646 空调离合器继电器线路短路到低电压或断路
110647     $*     P0647 空调离合器继电器线路短路到高电压
110651     $*     P0651 ETC参考电压B#幅值故障
110633     $*     P0633 防盗器未学习故障
110601     $*     P0601 ROM错误
110602     $*     P0602 ECM编程错误(软件版本不匹配)
110604     $*     P0604 RAM错误
110606     $*     P0606 ECM处理器故障
11060a     $*     P060A 内部控制模块监视处理器性能
110616     $*     P0616 起动电机继电器低电压
110617     $*     P0617 起动电机继电器高电压
110700     $*     P0700 TCU(变速箱控制器)故障
110480     $*     P0480 低速风扇故障
110481     $*     P0481 高速风扇故障
110458     $*     P0458 碳罐电磁阀线路短路到低电压或断路
110459     $*     P0459 碳罐电磁阀线路短路到高电压
110420     $*     P0420 催化转化器转化效率低
110562     $*     P0562 电池电压过高
110563     $*     P0563 电池电压过低
110564     $*     P0564 巡航控制输入线路故障
110565     $*     P0565 巡航“On/Off”信号嵌住
110566     $*     P0566 巡航“Cancel”信号嵌住
110567     $*     P0567 巡航“Resume”信号嵌住
110568     $*     P0568 巡航“Set”信号嵌住
110571     $*     P0571 制动时制动灯的开关状态没有发生改变
110551     $*     P0551 动力转向开关线路电压范围/性能故障
110532     $*     P0532 空调压力传感器线路低电压或断路
110533     $*     P0533 空调压力传感器线路高电压
110502     $*     P0502 车速传感器无信号
110504     $*     P0504 制动开关相关性故障
110506     $*     P0506 怠速转速过低
110507     $*     P0507 怠速转速过高
111336     $*     P1336 齿讯未学习
111167     $*     P1167 前氧减速断油时过浓
111171     $*     P1171 前氧加速加浓时过稀
111516     $*     P1516 ETC驱动稳态诊断错误
112228     $*     P2228 大气压压力传感器短路到低电压或断路
112229     $*     P2229 大气压压力传感器短路到高电压
112122     $*     P2122 电子油门踏板位置传感器1#线路低电压
112123     $*     P2123 电子油门踏板位置传感器1#线路高电压
112127     $*     P2127 电子油门踏板位置传感器2#线路低电压
112128     $*     P2128 电子油门踏板位置传感器2#线路高电压
112135     $*     P2135 电子节气门位置传感器1#、2#线路相关性故障
112138     $*     P2138 电子油门踏板位置传感器1#、2#线路相关性故障
112101     $*     P2101 ETC驱动二阶诊断错误
112104     $*     P2104 发动机强制怠速
112105     $*     P2105 发动机强制停机
112106     $*     P2106 发动机性能限制
112110     $*     P2110 发动机功率管理
112119     $*     P2119 电子节气门回位故障
112610     $*     P2610 LPC重置故障
118010     $*     B0010 碰撞断油信号合理性故障
11c248     $*     U0248 PEPS与车辆动态控制模块通信丢失
11c073     $*     U0073 CAN总线关闭
11c001     $*     U0001 CAN通讯故障
11c167     $*     U0167 防盗器无响应
11c155     $*     U0155 ECM与车辆动态控制模块通信丢失
11c121     $*     U0121 ECM与ABS控制模块通讯丢失
11c101     $*     U0101 ECM与TCM通讯丢失
11c426     $*     U0426 防盗器认证失败
ec0187     $*     U2C0187 EWP与BMS(电池管理系统)通讯丢失故障 
ec0017     $*     U2C0017 EWP检蓄电池电压过高故障 
ec0016     $*     U2C0016 EWP检蓄电池电压过低故障 
ec0088     $*     U2C0088 EWP BUS OFF(总线关闭) 
3d9001     $*     B1001 配置错误 (没有配置，但是安装) 
3d9000     $*     B1000 内部故障 
3d9327     $*     B1327 电源电压过低 
3d9328     $*     B1328 电源电压过高 
3d8671     $*     B0671 系统故障灯对地短路或开路 
3d8673     $*     B0673 系统故障灯对电源短路 
3d8049     $*     B0049 碰撞输出对电源短路 
3d8048     $*     B0048 碰撞输出对地短路或开路 
3d8052     $*     B0052 安全气囊控制器达到最大使用限度并无法继续使用 
3d8017     $*     B0017 乘员安全气囊开路（阻值过大） 
3d8016     $*     B0016 乘员安全气囊阻值过低 
3d8019     $*     B0019 乘员安全气囊对电源短路 
3d8018     $*     B0018 乘员安全气囊对地短路或交叉连接 
3d8022     $*     B0022 驾驶员安全气囊阻值过低 
3d8025     $*     B0025 驾驶员安全气囊对电源短路 
3d8024     $*     B0024 驾驶员安全气囊对地短路或交叉连接 
3d8026     $*     B0026 驾驶员安全气囊开路（阻值过大） 
18471c     $*     P18471C 水泵温度传感器1对地/电源短路故障 
184098     $*     P184098 水泵电机控制电路过温 
184313     $*     P184313 水泵电机开路故障 
184219     $*     P184219 水泵电机过流故障 
18481c     $*     P18481C 水泵温度传感器2对地/电源短路故障 
c24500     $*     U024500 报文(0x5E7)HUM_EVENT_COMMAND_3超时 
c15500     $*     U015500 ICM(仪表系统)_GENERAL_STATUS消息超时 
c15900     $*     U015900 PAS(泊车服务系统)_GENERAL_STATUS消息超时 
c14000     $*     U014000 BCM(车身控制模块)_GENERAL_STATUS 消息超时 
c12600     $*     U012600 SASEPS(转角传感器/电动助力转向)_STEERING_ANGLE 消息超时 
c12200     $*     U012200 ESP(电控稳定系统)_WHEEL_SPEED_FRONT_FOR_PEPS(无钥匙启动系统) 消息超时 
c10100     $*     U010100 TCU(变速箱系统)_GENERAL_STATUS消息超时 
c10000     $*     U010000 报文(0x280) EMS_GENERAL_STATUS超时 
d00587     $*     U100587 网络管理Limphome(跛行) 
d00700     $*     U100700 CAN总线关闭 
db0500     $*     U1B0500 BCM(车身控制模块)_GENERAL_STATUS_2消息超时 
db0400     $*     U1B0400 ESP(电控稳定系统)_WHEEL_SPEED_REAR_FOR_PEPS(无钥匙启动系统)消息超时 
db0700     $*     U1B0700 BCM(车身控制模块)_GENERAL_STATUS_3消息超时 
db0600     $*     U1B0600 ESP(电控稳定系统)_GENERAL_STATUS_YAW_SENSOR2消息超时 
db0100     $*     U1B0100 EMS(发动机管理系统)_ENGINE_SPEED_AND_TORQUE消息超时 
db0300     $*     U1B0300 ESP(电控稳定系统)_GENERAL_STATUS_YAW_SENSOR消息超时 
db0200     $*     U1B0200 EMS(发动机管理系统)_GENERAL_STATUS消息超时 
db0900     $*     U1B0900 ESP(电控稳定系统)_WSPEED_REAR_FOR_ACC消息超时 
db0800     $*     U1B0800 ESP(电控稳定系统)_WSPEED_FRONT_FOR_ACC 消息超时 
911717     $*     B111717 系统电压过高 
911716     $*     B111716 系统电压过低 
9a151c     $*     B1A151C BSD左报警灯驱动故障 
9a141c     $*     B1A141C LDW指示灯驱动故障 
9a161c     $*     B1A161C BSD右报警灯驱动故障 
9a1102     $*     B1A1102 LDW 系统开关信号失效 
9a1133     $*     B1A1133 AVM(全景环视影像控制模块)按键故障 
9a1054     $*     B1A1054 标定程序没有完成 
9a1002     $*     B1A1002 BSD 系统开关信号失效 
9a1302     $*     B1A1302 触屏信号失效 
9a1202     $*     B1A1202 LDW灵敏度信号失效 
9a1233     $*     B1A1233 LDW按键故障 
9a0551     $*     B1A0551 软件不兼容 
9a0502     $*     B1A0502 油门踏板信号失效 
9a0402     $*     B1A0402 方向盘转角信号失效 
9a0498     $*     B1A0498 控制器温度过高 
9a0745     $*     B1A0745 程序存储区域故障 
9a0702     $*     B1A0702 横向加速度信号失效 
9a0644     $*     B1A0644 数据存储区域故障 
9a0602     $*     B1A0602 偏航角速率信号失效 
9a0102     $*     B1A0102 档位信号失效 
9a0002     $*     B1A0002 整车速度失效 
9a0302     $*     B1A0302 刹车状态信号失效 
9a0317     $*     B1A0317 通讯电压过高 
9a0316     $*     B1A0316 通讯电压过低 
9a0214     $*     B1A0214 CAN线束故障 
9a0d02     $*     B1A0D02 里程数信号失效 
9a0d15     $*     B1A0D15 视频输出短接到电源 
9a0c02     $*     B1A0C02 后雷达系统信号失效 
9a0c1c     $*     B1A0C1C 右摄像头电源故障 
9a0c31     $*     B1A0C31 右摄像头没有信号 
9a0f02     $*     B1A0F02 后轮速信号失效 
9a0e00     $*     B1A0E00 整车配置信息错误 
9a0e02     $*     B1A0E02 前轮速信号失效 
9a0902     $*     B1A0902 前雨刮信号失效 
9a091c     $*     B1A091C 前摄像头电源故障 
9a0931     $*     B1A0931 前摄像头没有信号 
9a0849     $*     B1A0849 内部电子故障 
9a0802     $*     B1A0802 纵向加速度信号失效 
9a0b02     $*     B1A0B02 前雷达系统信号失效 
9a0b1c     $*     B1A0B1C 左摄像头电源故障 
9a0b31     $*     B1A0B31 左摄像头没有信号 
9a0a02     $*     B1A0A02 日期显示信号失效 
9a0a1c     $*     B1A0A1C 后摄像头电源故障 
9a0a31     $*     B1A0A31 后摄像头没有信号 
d00c00     $*     U100C00 APA_CONTROL_REQ报文丢失 
d00a00     $*     U100A00 MPC_REQUEST报文丢失 
df9681     $*     U1F9681 LKS_TORQUE_REQ信号值超出范围 
df9685     $*     U1F9685 LKA扭矩请求的变化率超范围 
df9786     $*     U1F9786 APA_EPS_CONTROL_REQ信号无效 
df9386     $*     U1F9386 ICM_GENERAL_STATUS报文值无效 
df9300     $*     U1F9300 ICM_GENERAL_STATUS报文超时 
df9086     $*     U1F9086 ESPABS_GENERAL_STATUS(车速无效） 
df9100     $*     U1F9100 报文(0x280) EMS_GENERAL_STATUS= 0x3 
c12100     $*     U012100 报文(0x318)ESPABS_GENERAL_STATUS超时 
c07300     $*     U007300 高速CAN通信故障 
f00316     $*     U300316 蓄电池电压过低 
f00317     $*     U300317 蓄电池电压过高 
531700     $*     C131700 SAS未标定 
561500     $*     C161500 SAS电路故障 
564113     $*     C164113 电机断路 
564101     $*     C164101 电机短路 
54121c     $*     C14121C 电机位置传感器供电故障 
541019     $*     C141019 电机电流过载 
54101d     $*     C14101D 电机电流差值 
54111c     $*     C14111C 扭矩传感器供电故障 
544996     $*     C144996 ECU硬件故障 
54524c     $*     C14524C 电源切断开关诊断故障 
54504c     $*     C14504C 数据闪存错误 
545013     $*     C145013 运行复位 
54514c     $*     C14514C 软件离散冗余错误 
546519     $*     C146519 电机电流传感器故障 
546198     $*     C146198 EPS热保护 
547893     $*     C147893 电机位置传感器故障 
547993     $*     C147993 转矩传感器信号故障 
54fe00     $*     C14FE00 IGN 信号故障 
