
    车型ID：3c40

    模拟：协议模拟-->3c40

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04
  $~  REQ001:82 11 F1 10 81 15       $~  ANS001:82 11 F1 10 81 15

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 00 00 9E       $#  ANS000:84 11 F1 18 00 00 00 9E

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/3c400000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 00 00 99       $$  ANS000:83 11 F1 14 00 00 99

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 90 2E       $%  ANS000:82 11 F1 1A 90 2E
  $%  REQ001:82 11 F1 1A 92 30       $%  ANS001:82 11 F1 1A 92 30
  $%  REQ002:82 11 F1 1A 94 32       $%  ANS002:82 11 F1 1A 94 32
  $%  REQ003:82 11 F1 1A 96 34       $%  ANS003:82 11 F1 1A 96 34
  $%  REQ004:82 11 F1 1A 97 35       $%  ANS004:82 11 F1 1A 97 35
  $%  REQ005:82 11 F1 1A 98 36       $%  ANS005:82 11 F1 1A 98 36
  $%  REQ006:82 11 F1 1A 99 37       $%  ANS006:82 11 F1 1A 99 37
  $%  REQ007:82 11 F1 1A 9A 38       $%  ANS007:82 11 F1 1A 9A 38
  $%  REQ008:82 11 F1 1A 9B 39       $%  ANS008:82 11 F1 1A 9B 39
  $%  REQ009:82 11 F1 1A 9C 3A       $%  ANS009:82 11 F1 1A 9C 3A
  $%  REQ010:82 11 F1 1A 9D 3B       $%  ANS010:82 11 F1 1A 9D 3B
  $%  REQ011:82 11 F1 1A 9F 3D       $%  ANS011:82 11 F1 1A 9F 3D

  $%  000:车辆识别码(VIN):                       $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:电控单元(ECU)基本硬件编号:             $%    $%  ANS001.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  002:电控单元(ECU)软件编号:                 $%    $%  ANS002.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:定型编号:                              $%    $%  ANS003.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:系统名称或发动机类型:                  $%    $%  ANS004.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  005:维修店代码或诊断仪序列号:              $%    $%  ANS005.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  006:编程日期:                              $%    $%  ANS006.BYTE005  $%  HEX(x1,x2,x3,x4);
  $%  007:电控单元(ECU)诊断数据标识(DDI):        $%    $%  ANS007.BYTE005  $%  HEX(x1,x2);
  $%  008:电控单元(ECU)代码版本号:               $%    $%  ANS008.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  009:电控单元(ECU)Rom版本号:                $%    $%  ANS009.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:CAN数据字典版本号:                     $%    $%  ANS010.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:博世零件代码号:                        $%    $%  ANS011.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.动态数据流
  $  00.动态数据流
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.故障码个数                               $    $              $    $  ANS000.BYTE005  $  y=x;
  $  001.电瓶电压                                 $    $  V           $    $  ANS000.BYTE036  $  y=x*0.06836;
  $  002.发动机转速                               $    $  rpm         $    $  ANS000.BYTE037  $  y=x1*64+x2*0.25;
  $  003.目标怠速(无补偿)                         $    $  rpm         $    $  ANS000.BYTE039  $  y=x*10;
  $  004.目标怠速(有补偿)                         $    $  rpm         $    $  ANS000.BYTE040  $  y=x*10;
  $  005.车速                                     $    $  km/h        $    $  ANS000.BYTE041  $  y=x;
  $  006.车辆加速度                               $    $  m/s^2       $    $  ANS000.BYTE042  $  if((x>=0)&&(x<=127)) y=x*0.217;else y=(x-256)*0.217;
  $  007.发动机冷却剂温度传感器电压               $    $  V           $    $  ANS000.BYTE043  $  y=x/256*5.0;
  $  008.发动机冷却剂温度                         $    $  degC        $    $  ANS000.BYTE044  $  y=x-40;
  $  009.进气温度传感器电压                       $    $  V           $    $  ANS000.BYTE045  $  y=x/256*5.0;
  $  010.进气温度                                 $    $  degC        $    $  ANS000.BYTE046  $  y=x-40;
  $  011.环境温度                                 $    $  degC        $    $  ANS000.BYTE047  $  y=x-40;
  $  012.空调蒸发器A/D值                          $    $  V           $    $  ANS000.BYTE048  $  y=x/256*5.0;
  $  013.发动机机油温度                           $    $  degC        $    $  ANS000.BYTE050  $  y=x-60;
  $  014.进气量                                   $    $  kg/h        $    $  ANS000.BYTE051  $  y=(x1*256+x2)*0.10;
  $  015.实际进气歧管压力传感器电压               $    $  V           $    $  ANS000.BYTE056  $  y=x/256*5;
  $  016.实际进气歧管压力                         $    $  hpa         $    $  ANS000.BYTE057  $  y=x*10;
  $  017.踏板位置传感器1电压                      $    $  V           $    $  ANS000.BYTE058  $  y=x/256*5;
  $  018.踏板位置传感器2电压                      $    $  V           $    $  ANS000.BYTE059  $  y=x/256*5;
  $  019.加速踏板开度                             $    $  %PED        $    $  ANS000.BYTE060  $  y=x/256*100;
  $  020.节气门电位器1 电压                       $    $  V           $    $  ANS000.BYTE061  $  y=x/256*5;
  $  021.节气门电位器2 电压                       $    $  V           $    $  ANS000.BYTE062  $  y=x/256*5;
  $  022.期望节气门角度                           $    $  %DK         $    $  ANS000.BYTE063  $  y=x/256*100;
  $  023.节气门开度                               $    $  %DK         $    $  ANS000.BYTE064  $  y=x/256*100;
  $  024.节气门电机PWM控制信号                    $    $  %           $    $  ANS000.BYTE065  $  y=x/256*100;
  $  025.用于学习步长的学习时间计数器             $    $              $    $  ANS000.BYTE066  $  y=x;
  $  026.平均喷油脉宽                             $    $  ms          $    $  ANS000.BYTE069  $  y=x/10;
  $  027.充电时间                                 $    $  ms          $    $  ANS000.BYTE070  $  y=x/10;
  $  028.1缸点火提前角                            $    $  Gard kw     $    $  ANS000.BYTE071  $  y=x*0.5-64;
  $  029.燃油容积流量(升/小时)                    $    $  L/H         $    $  ANS000.BYTE072  $  y=(x1*256+x2)/65536*140.625;
  $  030.爆震传感器信号1                          $    $  V           $    $  ANS000.BYTE074  $  y=(x1*256+x2)/1024*5;
  $  031.爆震传感器信号2                          $    $  V           $    $  ANS000.BYTE076  $  y=(x1*256+x2)/1024*5;
  $  032.1缸推迟点火爆震控制                      $    $  Grad kw     $    $  ANS000.BYTE078  $  y=0-x/255*191.25;
  $  033.2缸推迟点火爆震控制                      $    $  Grad kw     $    $  ANS000.BYTE079  $  y=0-x/255*191.25;
  $  034.3缸推迟点火爆震控制                      $    $  Grad kw     $    $  ANS000.BYTE080  $  y=0-x/255*191.25;
  $  035.4缸推迟点火爆震控制                      $    $  Grad kw     $    $  ANS000.BYTE081  $  y=0-x/255*191.25;
  $  036.1组氧传感器积分值(短期修正)              $    $              $    $  ANS000.BYTE084  $  y=x/255*2;
  $  037.1组氧传感器电压(传感器1)                 $    $  V           $    $  ANS000.BYTE086  $  y=x/255*5;
  $  038.1组氧传感器电压(传感器2)                 $    $  V           $    $  ANS000.BYTE087  $  y=x/255*5;
  $  039.1组氧传感器积分值(长期修正)              $    $              $    $  ANS000.BYTE090  $  y=x/255*2;
  $  040.最终长期修正系数1                        $    $  %           $    $  ANS000.BYTE091  $  y=(x1*256+x2-32768)/21.33;
  $  041.混合气加法自学习值(小负荷)               $    $  %           $    $  ANS000.BYTE093  $  if(x1*256+x2>=32768) y=(x1*256+x2-65536)*3072/65536;else y=(x1*256+x2)*3072/65536;
  $  042.模型进气温度                             $    $  degC        $    $  ANS000.BYTE095  $  y=x*0.75-48;
  $  043.发动机相对负荷                           $    $  %           $    $  ANS000.BYTE096  $  y=x*0.75;
  $  044.怠速扭矩自学习                           $    $  %           $    $  ANS000.BYTE097  $  if(x>=0&&x<=127) y=x/128*100;else y=(x-256)/128*100;
  $  045.怠速转速控制目标扭矩修正                 $    $  %           $    $  ANS000.BYTE098  $  if(x>=0&&x<=127) y=x/128*100;else y=(x-256)/128*100;
  $  046.炭罐控制阀占空比                         $    $  %           $    $  ANS000.BYTE099  $  y=x/256*100;
  $  047.炭罐控制的相对喷油量                     $    $  %           $    $  ANS000.BYTE100  $  if(x>=0&&x<=127) y=x*12;else y=(x-256)*12;
  $  048.炭罐净化率                               $    $              $    $  ANS000.BYTE101  $  y=x/256*0.5;
  $  049.炭罐负荷                                 $    $              $    $  ANS000.BYTE102  $  if(x>=0&&x<=127) y=x/2;else y=(x-256)/2;
  $  050.运行里程                                 $    $  km          $    $  ANS000.BYTE103  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  051.运行时间                                 $    $  min         $    $  ANS000.BYTE107  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  052.车速故障后的运行时间                     $    $  min         $    $  ANS000.BYTE111  $  y=(x1*256+x2)*6;
  $  053.进气阀开度(相对于LWOT(节气门全开))       $    $  Grad kw     $    $  ANS000.BYTE117  $  if(x>=0&&x<=127) y=x*2;else y=(x-256)*2;
  $  054.排气阀开度(相对于LWOT(节气门全开))       $    $  Grad kw     $    $  ANS000.BYTE118  $  if(x>=0&&x<=127) y=x*2;else y=(x-256)*2;
  $  055.凸轮轴重叠角                             $    $  Grad kw     $    $  ANS000.BYTE119  $  if(x>=0&&x<=127) y=x*2;else y=(x-256)*2;
  $  056.进气凸轮轴重叠系数                       $    $              $    $  ANS000.BYTE120  $  y=x/256;
  $  057.排气凸轮轴重叠系数                       $    $              $    $  ANS000.BYTE121  $  y=x/256;
  $  058.进气凸轮轴PWM 控制                       $    $  %           $    $  ANS000.BYTE122  $  y=x*100/256;
  $  059.排气凸轮轴PWM 控制                       $    $  %           $    $  ANS000.BYTE123  $  y=x*100/256;
  $  060.车速故障后的行驶里程                     $    $  km          $    $  ANS000.BYTE124  $  y=(x1*256+x2)*6;

  $)  01.编程状态
  $  01.编程状态
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.激活安全进入                  $    $       $    $  ANS000.BYTE022  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.变量字已编程                  $    $       $    $  ANS000.BYTE022  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  002.CAN车辆配置已编程             $    $       $    $  ANS000.BYTE022  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  003.车辆识别码(VIN码)已编程       $    $       $    $  ANS000.BYTE022  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  004.动力总成数据已编程            $    $       $    $  ANS000.BYTE022  $  if(((x>>4)&1)) y=@0044;else y=@0045;

  $)  02.发动机冷却系统
  $  02.发动机冷却系统
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.冷却扇#1       $    $       $    $  ANS000.BYTE024  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.冷却扇#2       $    $       $    $  ANS000.BYTE024  $  if(((x>>1)&1)) y=@0044;else y=@0045;

  $)  03.发动机稳态工况
  $  03.发动机稳态工况
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.点火接线端15开启             $    $       $    $  ANS000.BYTE025  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.主继电器工作                 $    $       $    $  ANS000.BYTE025  $  if(((x>>1)&1)) y=@01bf;else y=@01c0;
  $  002.燃油泵继电器工作             $    $       $    $  ANS000.BYTE025  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  003.转速信号状态                 $    $       $    $  ANS000.BYTE025  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  004.达到怠速转速                 $    $       $    $  ANS000.BYTE025  $  if(((x>>4)&1)) y=@0044;else y=@0045;
  $  005.同步条件                     $    $       $    $  ANS000.BYTE025  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  006.达到发动机工作温度           $    $       $    $  ANS000.BYTE025  $  if(((x>>6)&1)) y=@0044;else y=@0045;
  $  007.车辆行驶(收到速度脉冲)       $    $       $    $  ANS000.BYTE025  $  if(((x>>7)&1)) y=@0044;else y=@0045;

  $)  04.发动机动态工况
  $  04.发动机动态工况
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.节气门处于怠速位置         $    $       $    $  ANS000.BYTE026  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.节气门处于全负荷位置       $    $       $    $  ANS000.BYTE026  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  002.激活减速断油               $    $       $    $  ANS000.BYTE026  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  003.激活加速加浓               $    $       $    $  ANS000.BYTE026  $  if(((x>>4)&1)) y=@0044;else y=@0045;

  $)  05.排放控制
  $  05.排放控制
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.λ控制激活                   $    $       $    $  ANS000.BYTE027  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.炭罐控制阀激活               $    $       $    $  ANS000.BYTE027  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  002.减速断油激活                 $    $       $    $  ANS000.BYTE027  $  if(((x>>3)&1)) y=@0044;else y=@0045;
  $  003.催化转换器保护加浓激活       $    $       $    $  ANS000.BYTE027  $  if(((x>>4)&1)) y=@0044;else y=@0045;
  $  004.混合气自学习条件激活         $    $       $    $  ANS000.BYTE027  $  if(((x>>5)&1)) y=@0044;else y=@0045;

  $)  06.氧传感器
  $  06.氧传感器
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.氧传感器1信号浓         $    $       $    $  ANS000.BYTE028  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.氧传感器2信号稀         $    $       $    $  ANS000.BYTE028  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  002.氧传感器1加热激活       $    $       $    $  ANS000.BYTE028  $  if(((x>>4)&1)) y=@0044;else y=@0045;
  $  003.氧传感器2加热激活       $    $       $    $  ANS000.BYTE028  $  if(((x>>5)&1)) y=@0044;else y=@0045;

  $)  07.发动机怠速
  $  07.发动机怠速
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.踏板位置确认怠速       $    $       $    $  ANS000.BYTE029  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.电气负载1              $    $       $    $  ANS000.BYTE029  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  002.电气负载2              $    $       $    $  ANS000.BYTE029  $  if(((x>>2)&1)) y=@0044;else y=@0045;

  $)  08.系统维修指示灯(SVS)/故障指示灯(MIL)
  $  08.系统维修指示灯(SVS)/故障指示灯(MIL)
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.故障指示灯MIL激活                   $    $       $    $  ANS000.BYTE030  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.发动机系统故障指示灯(MIL)闪烁       $    $       $    $  ANS000.BYTE030  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  002.车辆立即检修指示灯SVS 激活          $    $       $    $  ANS000.BYTE030  $  if(((x>>4)&1)) y=@0044;else y=@0045;
  $  003.系统维修指示灯(SVS) 闪烁            $    $       $    $  ANS000.BYTE030  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  004.系统维修指示灯(SVS) 存在故障        $    $       $    $  ANS000.BYTE030  $  if(((x>>6)&1)) y=@0044;else y=@0045;

  $)  09.发动机紧急工况
  $  09.发动机紧急工况
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.节气门位置未知或错误       $    $       $    $  ANS000.BYTE031  $  if(((x>>0)&1)) y=@0044;else y=@0045;

  $)  10.空调
  $  10.空调
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.空调开启                             $    $       $    $  ANS000.BYTE032  $  if(((x>>0)&1)) y=@0044;else y=@0045;
  $  001.空调请求激活                         $    $       $    $  ANS000.BYTE032  $  if(((x>>1)&1)) y=@0044;else y=@0045;
  $  002.空调压缩机开                         $    $       $    $  ANS000.BYTE032  $  if(((x>>2)&1)) y=@0044;else y=@0045;
  $  003.怠速转速因空调而增加                 $    $       $    $  ANS000.BYTE032  $  if(((x>>5)&1)) y=@0044;else y=@0045;
  $  004.全负荷时关闭空调压缩机(无延迟)       $    $       $    $  ANS000.BYTE032  $  if(((x>>6)&1)) y=@0044;else y=@0045;

  $)  11.自动挡(AT)/扭矩请求
  $  11.自动挡(AT)/扭矩请求
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.AT转换离合器激活       $    $       $    $  ANS000.BYTE033  $  if(((x>>3)&1)) y=@0044;else y=@0045;

;******************************************************************************************************************************************************

