
    车型ID：170f

    模拟：协议模拟-->170f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00
  $~  REQ001:7E0 02 10 03 00 00 00 00 00       $~  ANS001:7E8 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:

  $@  REQ000:7E0 02 10 01 00 00 00 00 00       $@  ANS000:7E8 02 10 01 00 00 00 00 00


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 02 19 FF 00 00 00 00 00       $#  ANS000:7E8 02 19 FF 00 00 00 00 00

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a3090000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 92 00 00 00 00       $%  ANS000:7E8 03 22 F1 92 00 00 00 00
  $%  REQ001:7E0 03 22 F1 94 00 00 00 00       $%  ANS001:7E8 03 22 F1 94 00 00 00 00
  $%  REQ002:7E0 03 22 F1 95 00 00 00 00       $%  ANS002:7E8 03 22 F1 95 00 00 00 00
  $%  REQ003:7E0 03 22 F1 99 00 00 00 00       $%  ANS003:7E8 03 22 F1 99 00 00 00 00
  $%  REQ004:7E0 03 22 F1 8B 00 00 00 00       $%  ANS004:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E0 03 22 F1 90 00 00 00 00       $%  ANS005:7E8 03 22 F1 90 00 00 00 00

  $%  000:硬件编号:                       $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  001:软件编号:                       $%    $%  ANS001.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  002:软件版本:                       $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%.2d.%.2d],(x1*256+x2)/10000,((x1*256+x2)%10000)/100,(x1*256+x2)%100);
  $%  003:软件日期:                       $%    $%  ANS002.BYTE006  $%  y=SPRINTF([20%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  004:修改次数:                       $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  005:编程日期:                       $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $%  006:ECU生产日期:                    $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $%  007:学习到的VIN(车辆识别码):        $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00
  $  REQ001:7E0 03 22 F1 06 00 00 00 00       $  ANS001:7E8 03 22 F1 06 00 00 00 00

  $  000.发动机转速                                       $    $  rpm          $    $  ANS000.BYTE036  $  y = x1*64+x2*64.00/255;
  $  001.电源电压                                         $    $  V            $    $  ANS000.BYTE035  $  y = x1*0.1;
  $  002.目标怠速(有补偿)                                 $    $  rpm          $    $  ANS000.BYTE039  $  y = x1*10;
  $  003.进气压力                                         $    $  kPa          $    $  ANS000.BYTE046  $  y=x1;
  $  004.冷却液温度                                       $    $  degree C     $    $  ANS000.BYTE042  $  y=x1-40;
  $  005.节气门开度                                       $    $  %            $    $  ANS000.BYTE055  $  y=(x1*256+x2)*0.1;
  $  006.节气门目标开度                                   $    $  %            $    $  ANS000.BYTE049  $  y=(x1*256+x2)*0.1;
  $  007.充磁时间                                         $    $  毫秒         $    $  ANS000.BYTE063  $  y = x1*0.1;
  $  008.喷油脉宽                                         $    $  毫秒         $    $  ANS000.BYTE064  $  y = x1*0.1;
  $  009.进气流量                                         $    $  kg/h         $    $  ANS000.BYTE047  $  y=(x1*256+x2)*0.1;
  $  010.车速                                             $    $  km/h         $    $  ANS000.BYTE040  $  y=x1;
  $  011.运行里程                                         $    $  km           $    $  ANS000.BYTE092  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  012.运行时间                                         $    $  分           $    $  ANS000.BYTE096  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  013.进气温度                                         $    $  degree C     $    $  ANS000.BYTE044  $  y=x1-40;
  $  014.大气压力值                                       $    $  kPa          $    $  ANS000.BYTE120  $  y=x1;
  $  015.点火提前角                                       $    $  °           $    $  ANS000.BYTE065  $  y = x1-50;
  $  016.空燃比                                           $    $  %            $    $  ANS000.BYTE128  $  y = x1*0.1;
  $  017.爆震传感器1                                      $    $               $    $  ANS000.BYTE069  $  y =(x1*256+x2);
  $  018.1组氧传感器电压,传感器1(氧传感器1)               $    $  V            $    $  ANS000.BYTE081  $  y = x1*1.0/255;
  $  019.1组氧传感器电压,传感器2(氧传感器2)               $    $  V            $    $  ANS000.BYTE082  $  y = x1*1.0/255;
  $  020.1组氧传感器积分值(短期修正)                      $    $               $    $  ANS000.BYTE079  $  y = x1*2.0/255;
  $  021.1组氧传感器积分值(长期修正)                      $    $               $    $  ANS000.BYTE085  $  y = x1*2.0/255;
  $  022.1缸推迟点火爆震控制                              $    $  °           $    $  ANS000.BYTE073  $  y = x1*0.1;
  $  023.2缸推迟点火爆震控制                              $    $  °           $    $  ANS000.BYTE074  $  y = x1*0.1;
  $  024.3缸推迟点火爆震控制                              $    $  °           $    $  ANS000.BYTE075  $  y = x1*0.1;
  $  025.4缸推迟点火爆震控制                              $    $  °           $    $  ANS000.BYTE076  $  y = x1*0.1;
  $  026.无极风扇占空比                                   $    $  %            $    $  ANS000.BYTE102  $  y = x1*100.0/255;
  $  027.制动助力器压力                                   $    $  kPa          $    $  ANS000.BYTE112  $  y=x1;
  $  028.故障里程                                         $    $  km           $    $  ANS000.BYTE134  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  029.燃油位置输出                                     $    $  L            $    $  ANS000.BYTE138  $  y=x1;
  $  030.EGR(废气再循环)开度                              $    $  %            $    $  ANS000.BYTE139  $  y=(x1*256+x2)*0.1;
  $  031.EGR(废气再循环)阀位置传感器                      $    $  V            $    $  ANS000.BYTE141  $  y = x1*5.0/255;
  $  032.节气门电机PWM(脉宽调制)                          $    $  %            $    $  ANS000.BYTE058  $  y = x1*100.0/255;
  $  033.碳罐阀占空比                                     $    $  %            $    $  ANS000.BYTE062  $  y = x1*100.0/255;
  $  034.发电机励磁开度                                   $    $  %            $    $  ANS000.BYTE144  $  y = x1*100.0/255;
  $  035.发电机目标电压                                   $    $  V            $    $  ANS000.BYTE145  $  y = x1*0.1;
  $  036.发电机励磁电流限值                               $    $  A            $    $  ANS000.BYTE146  $  y = x1*0.1;
  $  037.发电机实发电压                                   $    $  V            $    $  ANS000.BYTE148  $  y = x1*0.1;
  $  038.发电机励磁电流                                   $    $  A            $    $  ANS000.BYTE149  $  y = x1*0.1;
  $  039.发电机负载响应时间                               $    $  秒           $    $  ANS000.BYTE150  $  y=x1;
  $  040.冷却液温度传感器                                 $    $  V            $    $  ANS000.BYTE041  $  y = x1*5.0/255;
  $  041.进气温度传感器                                   $    $  V            $    $  ANS000.BYTE043  $  y = x1*5.0/255;
  $  042.进气压力传感器                                   $    $  V            $    $  ANS000.BYTE045  $  y = x1*5.0/255;
  $  043.节气门位置传感器1                                $    $  V            $    $  ANS000.BYTE051  $  y = x1*5.0/255;
  $  044.节气门位置传感器2                                $    $  V            $    $  ANS000.BYTE053  $  y = x1*5.0/255;
  $  045.发动机启动前条件-发动机是否禁止启动              $    $               $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0185;else y=@0186;
  $  046.发动机启动前条件-发动机启动命令                  $    $               $    $  ANS000.BYTE018  $  switxh(x1&0x07)0x02:y=@011a; 0x03: y=@011a;0x04:y=@08a8; 0x05: y=@08a8;default:y=@0003;
  $  047.发动机启动前条件-低压BMS(电池管理系统)状态       $    $               $    $  ANS000.BYTE018  $  switxh(x1&0x18)0x08: y=@002b;0x18: y=@0003;default:y=@002a;
  $  048.发动机启动前条件-发动机启动超时次数              $    $               $    $  ANS000.BYTE018  $  switxh(x1&0x70)0x00:y=@0078; 0x10: y=@0078;0x20:y=@08a6; 0x30: y=@08a6;0x40:y=@08a7; 0x50: y=@08a7;default:y=@0003;
  $  049.整车信息-真空泵控制回路1#                        $    $               $    $  ANS000.BYTE020  $  switxh(x1&0x07)0x00:y=@0606; 0x01: y=@0606;0x04:y=@0078; 0x05: y=@0078;default:y=@0003;
  $  050.整车信息-真空泵控制回路2#                        $    $               $    $  ANS000.BYTE020  $  if((x1&0x1F)<0x08)y=@0606;else if((x1&0x1F)<0x10)y=@0214;else if((x1&0x1F)<0x18)y=@0078;else y=@0003;
  $  051.整车信息-真空泵泄露状态                          $    $               $    $  ANS000.BYTE020  $  switxh(x1&0x70)0x00:y=@0606; 0x10: y=@0606;0x20:y=@08a9; 0x30: y=@08a9;0x40:y=@049a; 0x50: y=@049a;default:y=@0078;
  $  052.发动机防盗解锁-ECU发送码验证结果                 $    $               $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0191;else y=@0192;
  $  053.发动机防盗解锁-IKey发送码验证结果                $    $               $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0191;else y=@0192;
  $  054.发动机防盗解锁-ECU新旧状态                       $    $               $    $  ANS000.BYTE022  $  if(x1&0x04)y=@00ef;else y=@00ee;
  $  055.发动机冷却系统-风扇类型                          $    $               $    $  ANS000.BYTE023  $  if((x1&0x0F)<0x04)y=@0194;else if((x1&0x0F)<0x08)y=@0193;else y=@0001;
  $  056.发动机稳态工况-点火电源开启                      $    $               $    $  ANS000.BYTE024  $  if(x1&0x01)y=@0185;else y=@0186;
  $  057.发动机稳态工况-主继电器工作                      $    $               $    $  ANS000.BYTE024  $  if(x1&0x02)y=@0185;else y=@0186;
  $  058.发动机稳态工况-燃油泵状态                        $    $               $    $  ANS000.BYTE024  $  if(x1&0x04)y=@001d;else y=@001e;
  $  059.发动机动态工况-节气门处于怠速位置                $    $               $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0185;else y=@0186;
  $  060.发动机动态工况-节气门处于部分打开位置            $    $               $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0185;else y=@0186;
  $  061.发动机动态工况-节气门处于全开位置                $    $               $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0185;else y=@0186;
  $  062.发动机动态工况-激活减速断油                      $    $               $    $  ANS000.BYTE025  $  if(x1&0x08)y=@00f2;else y=@0181;
  $  063.发动机动态工况-激活加速加浓                      $    $               $    $  ANS000.BYTE025  $  if(x1&0x10)y=@00f2;else y=@0181;
  $  064.发动机动态工况-是否D档(前进挡)                   $    $               $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0185;else y=@0186;
  $  065.发动机动态工况-是否R档(后退挡)                   $    $               $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0185;else y=@0186;
  $  066.发动机动态工况-是否N档(空挡)                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0185;else y=@0186;
  $  067.排放控制-氧传感器1信号                           $    $               $    $  ANS000.BYTE027  $  if(x1&0x01)y=@017f;else y=@0180;
  $  068.排放控制-氧传感器2信号                           $    $               $    $  ANS000.BYTE027  $  if(x1&0x02)y=@017f;else y=@0180;
  $  069.排放控制-氧传感器1加热                           $    $               $    $  ANS000.BYTE027  $  if(x1&0x10)y=@0183;else y=@0184;
  $  070.排放控制-氧传感器2加热                           $    $               $    $  ANS000.BYTE027  $  if(x1&0x20)y=@0183;else y=@0184;
  $  071.发动机怠速-制动踏板状态                          $    $               $    $  ANS000.BYTE028  $  if(x1&0x02)y=@0118;else y=@0182;
  $  072.发动机怠速-是否有空调请求                        $    $               $    $  ANS000.BYTE028  $  if(x1&0x04)y=@0185;else y=@0186;
  $  073.发动机怠速-动力转向开关                          $    $               $    $  ANS000.BYTE028  $  if(x1&0x10)y=@001d;else y=@001e;
  $  074.发动机怠速-真空泵状态                            $    $               $    $  ANS000.BYTE028  $  if(x1&0x40)y=@001d;else y=@001e;
  $  075.指示灯SVS/MIL-MIL(故障指示灯)激活                $    $               $    $  ANS000.BYTE029  $  if(x1&0x01)y=@00f2;else y=@0181;
  $  076.指示灯SVS/MIL-MIL(故障指示灯)闪烁                $    $               $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0185;else y=@0186;
  $  077.指示灯SVS/MIL-SVS(系统维修指示灯)激活            $    $               $    $  ANS000.BYTE029  $  if(x1&0x10)y=@00f2;else y=@0181;
  $  078.指示灯SVS/MIL-SVS(系统维修指示灯)闪烁            $    $               $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0185;else y=@0186;
  $  079.空调系统-空调请求激活                            $    $               $    $  ANS000.BYTE031  $  if(x1&0x02)y=@00f2;else y=@0181;
  $  080.空调系统-空调压缩机开                            $    $               $    $  ANS000.BYTE031  $  if(x1&0x04)y=@0185;else y=@0186;
  $  081.空调系统-怠速转速因空调而增加                    $    $               $    $  ANS000.BYTE031  $  if(x1&0x20)y=@0185;else y=@0186;
  $  082.空调系统-全负荷时关闭空调压缩机                  $    $               $    $  ANS000.BYTE031  $  if(x1&0x40)y=@0185;else y=@0186;
  $  083.空调系统-空调中压开关开                          $    $               $    $  ANS000.BYTE031  $  if(x1&0x80)y=@0185;else y=@0186;
  $  084.发动机状态-刹车开关激活                          $    $               $    $  ANS000.BYTE034  $  if(x1&0x01)y=@00f2;else y=@0181;
  $  085.发动机状态-刹车灯激活                            $    $               $    $  ANS000.BYTE034  $  if(x1&0x02)y=@00f2;else y=@0181;
  $  086.发动机状态-防盗锁定状态                          $    $               $    $  ANS000.BYTE034  $  if(x1&0x20)y=@000a;else y=@0459;
  $  087.发动机状态-燃油反馈状态                          $    $               $    $  ANS000.BYTE034  $  if(x1&0x40)y=@0189;else y=@018a;
  $  088.发动机状态-可变气门升程阀状态(VVL阀)             $    $               $    $  ANS000.BYTE034  $  if(x1&0x80)y=@001d;else y=@001e;
  $  089.真空泵工作时间                                   $    $  H            $    $  ANS001.BYTE004  $  y =(x1*256+x2);

  $)  01.诊断实际检测率(IUPR)
  $  01.诊断实际检测率(IUPR)
  $  REQ000:7E0 03 22 F1 04 00 00 00 00       $  ANS000:7E8 03 22 F1 04 00 00 00 00

  $  000.一般监测条件满足次数                     $    $  次     $    $  ANS000.BYTE004  $  y =(x1*256+x2);
  $  001.点火循环次数                             $    $  次     $    $  ANS000.BYTE006  $  y =(x1*256+x2);
  $  002.三元催化器监测完成次数                   $    $  次     $    $  ANS000.BYTE008  $  y =(x1*256+x2);
  $  003.三元催化器监测条件满足次数               $    $  次     $    $  ANS000.BYTE010  $  y =(x1*256+x2);
  $  004.前氧传感器监测完成次数                   $    $  次     $    $  ANS000.BYTE012  $  y =(x1*256+x2);
  $  005.前氧传感器监测条件满足次数               $    $  次     $    $  ANS000.BYTE014  $  y =(x1*256+x2);
  $  006.VVT(可变气门正时)监测完成次数            $    $  次     $    $  ANS000.BYTE016  $  y =(x1*256+x2);
  $  007.VVT(可变气门正时)监测条件满足次数        $    $  次     $    $  ANS000.BYTE018  $  y =(x1*256+x2);
  $  008.EVAP(燃油蒸发系统)监测完成次数           $    $  次     $    $  ANS000.BYTE020  $  y =(x1*256+x2);
  $  009.EVAP(燃油蒸发系统)监测条件满足次数       $    $  次     $    $  ANS000.BYTE022  $  y =(x1*256+x2);
  $  010.后氧传感器监测完成次数                   $    $  次     $    $  ANS000.BYTE024  $  y =(x1*256+x2);
  $  011.后氧传感器监测条件满足次数               $    $  次     $    $  ANS000.BYTE026  $  y =(x1*256+x2);
  $  012.增压系统监测完成次数                     $    $  次     $    $  ANS000.BYTE028  $  y =(x1*256+x2);
  $  013.增压系统监测条件满足次数                 $    $  次     $    $  ANS000.BYTE030  $  y =(x1*256+x2);
  $  014.燃油系统监测完成次数                     $    $  次     $    $  ANS000.BYTE032  $  y =(x1*256+x2);
  $  015.燃油系统监测条件满足次数                 $    $  次     $    $  ANS000.BYTE034  $  y =(x1*256+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
