
    车型ID：3b1e

    模拟：协议模拟-->3b1e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~729

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 03 19 02 09 00 00 00 00       $#  ANS000:729 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/ee000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 04 14 FF FF FF 00 00 00       $$  ANS000:729 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 F1 93 00 00 00 00       $%  ANS000:729 03 22 F1 93 00 00 00 00
  $%  REQ001:721 03 22 F1 94 00 00 00 00       $%  ANS001:729 03 22 F1 94 00 00 00 00
  $%  REQ002:721 03 22 F1 95 00 00 00 00       $%  ANS002:729 03 22 F1 95 00 00 00 00
  $%  REQ003:721 03 22 60 03 00 00 00 00       $%  ANS003:729 03 22 60 03 00 00 00 00

  $%  000:硬件版本:          $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:          $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:          $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:          $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:          $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:          $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:路由版本号:        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%d.%d.%d.%d],x1,x1,x1,x2);
  $%  007:日期:              $%    $%  ANS003.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  008:修改次数:          $%    $%  ANS003.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.BCM(车身控制系统)相关数据流
  $  00.BCM(车身控制系统)相关数据流
  $  REQ000:721 03 22 80 10 00 00 00 00       $  ANS000:729 03 22 80 10 00 00 00 00

  $  000.左前门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@001d;else y=@001e;
  $  001.右前门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@001d;else y=@001e;
  $  002.左后门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@001d;else y=@001e;
  $  003.右后门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@001d;else y=@001e;
  $  004.后背门开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@001d;else y=@001e;
  $  005.前舱盖状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x20) y=@001d;else y=@001e;
  $  006.左前门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x40) y=@000a;else y=@0009;
  $  007.左后门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x80) y=@000a;else y=@0009;
  $  008.右前门锁状态                      $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@000a;else y=@0009;
  $  009.右后门锁状态                      $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@000a;else y=@0009;
  $  010.行李箱解锁开关状态                $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@000a;else y=@0009;
  $  011.硬线中控锁闭锁开关状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@000b;else y=@0003;
  $  012.硬线中控锁解锁开关状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@000b;else y=@0003;
  $  013.碰撞信号状态(PWM(脉宽调制))       $    $       $    $  ANS000.BYTE005  $  switxh(x1&0x60)0x00: y=@00a8;0x20: y=@00a9;0x40: y=@00aa;0x60: y=@007b;default: y=@0001;
  $  014.门锁保护状态                      $    $       $    $  ANS000.BYTE006  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@00ab;0x02: y=@00ac;0x03: y=@00ad;default: y=@0001;
  $  015.12V制动信号状态                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@0002;else y=@0003;
  $  016.0V制动灯开关状态                  $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@0002;else y=@0003;
  $  017.启动信号1状态                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@000b;else y=@009d;
  $  018.启动信号2状态                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@000b;else y=@009d;
  $  019.ACC电状态                         $    $       $    $  ANS000.BYTE006  $  if(x1&0x40) y=@0010;else y=@0012;
  $  020.IG1(点火1)电状态                  $    $       $    $  ANS000.BYTE006  $  if(x1&0x80) y=@0010;else y=@0012;
  $  021.IG2(点火2)电状态                  $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0010;else y=@0012;
  $  022.IG3(点火3)电状态                  $    $       $    $  ANS000.BYTE007  $  if(x1&0x02) y=@0010;else y=@0012;
  $  023.IG4(点火4)电状态                  $    $       $    $  ANS000.BYTE007  $  if(x1&0x04) y=@0010;else y=@0012;
  $  024.自复位告警开关状态                $    $       $    $  ANS000.BYTE007  $  if(x1&0x08) y=@000b;else y=@0003;
  $  025.左转向灯开关状态                  $    $       $    $  ANS000.BYTE008  $  if(x1&0x02) y=@0002;else y=@0003;
  $  026.右转向灯开关状态                  $    $       $    $  ANS000.BYTE008  $  if(x1&0x04) y=@0002;else y=@0003;
  $  027.AUTO(自动)灯光开关状态            $    $       $    $  ANS000.BYTE008  $  if(x1&0x08) y=@0002;else y=@0003;
  $  028.主驾安全带未系信号检测            $    $       $    $  ANS000.BYTE008  $  if(x1&0x20) y=@02ee;else y=@02ef;
  $  029.喇叭开关状态                      $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@000b;else y=@0003;
  $  030.交流充电枪电锁状态                $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02db;else y=@02dc;
  $  031.前雨刮HI(高速)档状态              $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0002;else y=@0003;
  $  032.前雨刮复位状态                    $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0002;else y=@0003;
  $  033.转向轴锁配置情况                  $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@00b0;else y=@00b3;
  $  034.车型                              $    $       $    $  ANS000.BYTE010  $  switxh(x1)0x00: y=@034b;0x01: y=@034c;0x02: y=@034d;0x03: y=@034e;0x04: y=@034f;0x05: y=@0350;0x06: y=@0351;0x07: y=@0352;0x08: y=@0353;0x09: y=@0354;0x0A: y=@0355;0x0B: y=@0356;0x0C: y=@0357;0x0D: y=@0358;0x0E: y=@0359;0x0F: y=@035a;0x10: y=@0359;0x11: y=@035b;0x12: y=@0359;0x13: y=@035c;0x14: y=@035d;0x15: y=@0359;0x16: y=@035e;0x17: y=@035f;0x18: y=@0360;0x19: y=@0361;0x1A: y=@0362;0x1B: y=@0363;0x1C: y=@0364;0x1D: y=@0365;0x1E: y=@0366;0x1F: y=@0367;0x20: y=@0368;0x21: y=@0369;0x22: y=@036a;0x23: y=@036b;0x24: y=@036c;0x25: y=@036d;0x26: y=@0541;0x27: y=@036f;0x28: y=@0370;0x29: y=@0371;0x2A: y=@0372;0x2B: y=@0373;0x2C: y=@0374;0x2D: y=@0359;0x2E: y=@0375;0x2F: y=@0376;0x30: y=@0377;0x31: y=@0378;0x32: y=@0379;0x33: y=@037a;0x34: y=@0359;0x35: y=@0359;0x36: y=@037b;0x37: y=@0359;0x38: y=@0359;0x39: y=@0359;0x3A: y=@037c;0x3B: y=@0359;0x3C: y=@0359;0x3D: y=@0359;0x3E: y=@037d;0x3F: y=@0359;0x40: y=@0359;0x41: y=@0359;0x42: y=@037e;0x43: y=@0359;0x44: y=@037f;0x45: y=@0380;0x46: y=@0381;0x47: y=@0359;0x48: y=@0359;0x49: y=@0382;0x4A: y=@0359;0x4B: y=@028f;0x4C: y=@0383;0x4D: y=@0384;0x4E: y=@0385;0x4F: y=@0386;0x50: y=@0387;0x51: y=@0359;0x52: y=@0388;0x53: y=@0389;0x54: y=@038a;0x55: y=@038b;0x56: y=@0359;0x57: y=@038c;0x58: y=@038d;0x59: y=@0359;0x5A: y=@0359;0x5B: y=@0359;0x5C: y=@038e;0x5D: y=@038f;0x5E: y=@0390;0x5F: y=@0391;0x60: y=@0291;0x61: y=@0392;0x62: y=@0290;0x63: y=@0393;0x64: y=@0588;0x65: y=@0589;0x66: y=@058a;0x67: y=@058b;0x68: y=@058c;0x69: y=@058d;0x6A: y=@0293;0x6B: y=@0359;0x6C: y=@0359;0x6D: y=@058e;0x6E: y=@058f;0x6F: y=@0590;0x70: y=@0591;0x71: y=@0592;0x72: y=@0593;0x73: y=@0594;0x74: y=@0595;0x75: y=@0596;0x76: y=@0597;0x77: y=@0598;0x78: y=@0599;0x79: y=@059a;default: y=@0001;

  $)  01.胎压相关数据流
  $  01.胎压相关数据流
  $  REQ000:721 03 22 30 00 00 00 00 00       $  ANS000:729 03 22 30 00 00 00 00 00
  $  REQ001:721 03 22 30 01 00 00 00 00       $  ANS001:729 03 22 30 01 00 00 00 00
  $  REQ002:721 03 22 30 02 00 00 00 00       $  ANS002:729 03 22 30 02 00 00 00 00
  $  REQ003:721 03 22 30 03 00 00 00 00       $  ANS003:729 03 22 30 03 00 00 00 00
  $  REQ004:721 03 22 30 04 00 00 00 00       $  ANS004:729 03 22 30 04 00 00 00 00
  $  REQ005:721 03 22 30 05 00 00 00 00       $  ANS005:729 03 22 30 05 00 00 00 00
  $  REQ006:721 03 22 30 06 00 00 00 00       $  ANS006:729 03 22 30 06 00 00 00 00
  $  REQ007:721 03 22 30 07 00 00 00 00       $  ANS007:729 03 22 30 07 00 00 00 00
  $  REQ008:721 03 22 30 08 00 00 00 00       $  ANS008:729 03 22 30 08 00 00 00 00

  $  000.左前轮ID                   $    $          $    $  ANS000.BYTE004  $  HEX(x1,x2,x3,x4);
  $  001.左前轮信号状态             $    $          $    $  ANS000.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0x02: y=@00f0;0xFF: y=@0200;default: y=@0001;
  $  002.左前轮漏气状态             $    $          $    $  ANS000.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;0x03: y=@00f0;default: y=@0001;
  $  003.左前轮压力状态             $    $          $    $  ANS000.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;0x0C: y=@00f0;default: y=@0001;
  $  004.左前轮温度状态             $    $          $    $  ANS000.BYTE009  $  switxh(x1&0x30)0x00: y=@0078;0x10: y=@031b;0x20: y=@031c;0x30: y=@00f0;default: y=@0001;
  $  005.左前轮压力值               $    $  kPa     $    $  ANS000.BYTE010  $  y=(x2*256+x1);
  $  006.左前轮温度值               $    $  ℃      $    $  ANS000.BYTE012  $  y=SPRINTF([%.1f],(x2*256+x1)*0.1-40);
  $  007.右前轮ID                   $    $          $    $  ANS001.BYTE004  $  HEX(x1,x2,x3,x4);
  $  008.右前轮信号状态             $    $          $    $  ANS001.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0x02: y=@00f0;0xFF: y=@0200;default: y=@0001;
  $  009.右前轮漏气状态             $    $          $    $  ANS001.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;0x03: y=@00f0;default: y=@0001;
  $  010.右前轮压力状态             $    $          $    $  ANS001.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;0x0C: y=@00f0;default: y=@0001;
  $  011.右前轮温度状态             $    $          $    $  ANS001.BYTE009  $  switxh(x1&0x30)0x00: y=@0078;0x10: y=@031b;0x20: y=@031c;0x30: y=@00f0;default: y=@0001;
  $  012.右前轮压力值               $    $  kPa     $    $  ANS001.BYTE010  $  y=(x2*256+x1);
  $  013.右前轮温度值               $    $  ℃      $    $  ANS001.BYTE012  $  y=SPRINTF([%.1f],(x2*256+x1)*0.1-40);
  $  014.左后轮ID                   $    $          $    $  ANS002.BYTE004  $  HEX(x1,x2,x3,x4);
  $  015.左后轮信号状态             $    $          $    $  ANS002.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0x02: y=@00f0;0xFF: y=@0200;default: y=@0001;
  $  016.左后轮漏气状态             $    $          $    $  ANS002.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;0x03: y=@00f0;default: y=@0001;
  $  017.左后轮压力状态             $    $          $    $  ANS002.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;0x0C: y=@00f0;default: y=@0001;
  $  018.左后轮温度状态             $    $          $    $  ANS002.BYTE009  $  switxh(x1&0x30)0x00: y=@0078;0x10: y=@031b;0x20: y=@031c;0x30: y=@00f0;default: y=@0001;
  $  019.左后轮压力值               $    $  kPa     $    $  ANS002.BYTE010  $  y=(x2*256+x1);
  $  020.左后轮温度值               $    $  ℃      $    $  ANS002.BYTE012  $  y=SPRINTF([%.1f],(x2*256+x1)*0.1-40);
  $  021.右后轮ID                   $    $          $    $  ANS003.BYTE004  $  HEX(x1,x2,x3,x4);
  $  022.右后轮信号状态             $    $          $    $  ANS003.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0x02: y=@00f0;0xFF: y=@0200;default: y=@0001;
  $  023.右后轮漏气状态             $    $          $    $  ANS003.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;0x03: y=@00f0;default: y=@0001;
  $  024.右后轮压力状态             $    $          $    $  ANS003.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;0x0C: y=@00f0;default: y=@0001;
  $  025.右后轮温度状态             $    $          $    $  ANS003.BYTE009  $  switxh(x1&0x30)0x00: y=@0078;0x10: y=@031b;0x20: y=@031c;0x30: y=@00f0;default: y=@0001;
  $  026.右后轮压力值               $    $  kPa     $    $  ANS003.BYTE010  $  y=(x2*256+x1);
  $  027.右后轮温度值               $    $  ℃      $    $  ANS003.BYTE012  $  y=SPRINTF([%.1f],(x2*256+x1)*0.1-40);
  $  028.前轴标准压力               $    $  kpa     $    $  ANS004.BYTE004  $  y=(x2*256+x1);
  $  029.后轴标准压力               $    $  kpa     $    $  ANS005.BYTE004  $  y=(x2*256+x1);
  $  030.国标/欧标                  $    $          $    $  ANS006.BYTE004  $  switxh(x1)0x00: y=@00d1;0x01: y=@00d4;default: y=@0001;
  $  031.自定位功能                 $    $          $    $  ANS007.BYTE004  $  switxh(x1)0x00: y=@0328;0x01: y=@0329;default: y=@0001;
  $  032.自定位全局状态             $    $          $    $  ANS008.BYTE004  $  switxh(x1)0x00: y=@0320;0x01: y=@0321;0x02: y=@0322;0x03: y=@0323;0x04: y=@0548;0x05: y=@0325;0x06: y=@0326;0x07: y=@0327;default: y=@0001;
  $  033.左前轮自定位学习状态       $    $          $    $  ANS008.BYTE005  $  switxh(x1)0x00: y=@031d;0x01: y=@031e;0x02: y=@031f;default: y=@0001;
  $  034.右前轮自定位学习状态       $    $          $    $  ANS008.BYTE006  $  switxh(x1)0x00: y=@031d;0x01: y=@031e;0x02: y=@031f;default: y=@0001;
  $  035.左后轮自定位学习状态       $    $          $    $  ANS008.BYTE006  $  switxh(x1)0x00: y=@031d;0x01: y=@031e;0x02: y=@031f;default: y=@0001;
  $  036.右后轮自定位学习状态       $    $          $    $  ANS008.BYTE007  $  switxh(x1)0x00: y=@031d;0x01: y=@031e;0x02: y=@031f;default: y=@0001;

  $)  02.驻车辅助系统相关数据流
  $  02.驻车辅助系统相关数据流
  $  REQ000:721 03 22 90 00 00 00 00 00       $  ANS000:729 03 22 90 00 00 00 00 00

  $  000.驻车辅助系统配置类型       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@053a;else if(x1==1) y=@007b;else if(x1==2) y=@053b;else if(x1==3) y=@053c;else if(x1==4) y=@053d;else if(x1==5) y=@053e;else if(x1==6) y=@053f;else if(x1==7) y=@007b;else if(x1==8) y=@0540;else if((x1>=9)&&(x1<=15)) y=@007b;else y=@0001;

  $)  03.空调控制器相关数据流
  $  03.空调控制器相关数据流
  $  REQ000:721 03 22 40 00 00 00 00 00       $  ANS000:729 03 22 40 00 00 00 00 00
  $  REQ001:721 03 22 40 01 00 00 00 00       $  ANS001:729 03 22 40 01 00 00 00 00
  $  REQ002:721 03 22 40 03 00 00 00 00       $  ANS002:729 03 22 40 03 00 00 00 00
  $  REQ003:721 03 22 40 04 00 00 00 00       $  ANS003:729 03 22 40 04 00 00 00 00
  $  REQ004:721 03 22 40 05 00 00 00 00       $  ANS004:729 03 22 40 05 00 00 00 00
  $  REQ005:721 03 22 40 06 00 00 00 00       $  ANS005:729 03 22 40 06 00 00 00 00
  $  REQ006:721 03 22 40 07 00 00 00 00       $  ANS006:729 03 22 40 07 00 00 00 00

  $  000.风速                                        $    $  级       $    $  ANS000.BYTE004  $  y=x1&0x0F;
  $  001.模式                                        $    $           $    $  ANS000.BYTE004  $  switxh(x1&0xF0)0x00: y=@006d;0x10: y=@006e;0x20: y=@006f;0x30: y=@0070;0x40: y=@0071;0x50: y=@0072;0x60: y=@0585;0x70: y=@0586;default: y=@0001;
  $  002.模式电机位置百分比                          $    $           $    $  ANS000.BYTE005  $  y=x1;
  $  003.车外温度                                    $    $           $    $  ANS000.BYTE006  $  if((x1>=88)&&(x1<=178)) y=x1-128;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  004.车内温度                                    $    $           $    $  ANS000.BYTE007  $  if((x1>=88)&&(x1<=207)) y=x1-128;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  005.内外循环电机位置百分比                      $    $           $    $  ANS000.BYTE010  $  y=x1;
  $  006.实际蒸发器温度                              $    $  ℃       $    $  ANS001.BYTE004  $  if((x1>=0)&&(x1<=60)) y=x1-20;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  007.主驾目标通道温度                            $    $  ℃       $    $  ANS001.BYTE005  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  008.主驾吹面通道温度                            $    $  ℃       $    $  ANS001.BYTE006  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  009.主驾吹脚通道温度                            $    $  ℃       $    $  ANS001.BYTE007  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  010.BMS(电池管理系统)允许空调高压放电状态       $    $           $    $  ANS001.BYTE009  $  switxh(x1&0x03)0x00: y=@0003;0x01: y=@0196;0x02: y=@0195;default: y=@0001;
  $  011.空调高压模块状态                            $    $           $    $  ANS001.BYTE009  $  switxh(x1&0x1C)0x00: y=@02c9;0x04: y=@02ca;0x08: y=@02cb;0x0C: y=@02cc;default: y=@0001;
  $  012.电动压缩机状态                              $    $           $    $  ANS001.BYTE009  $  if(x1&0x20) y=@0044;else y=@003f;
  $  013.电动压缩机需求占空比                        $    $  %        $    $  ANS001.BYTE010  $  y=x1;
  $  014.电池热管理需求                              $    $           $    $  ANS002.BYTE004  $  if(x1==0) y=@0060;else if(x1==1) y=@02d0;else if(x1==2) y=@02d1;else if(x1==3) y=@02d2;else if(x1==4) y=@02d3;else if(x1==5) y=@02d4;else if(x1==6) y=@02d5;else if(x1==7) y=@004c;else y=@0001;
  $  015.电池热管理实际响应状态                      $    $           $    $  ANS002.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@02d0;else if(x1==2) y=@02d1;else if(x1==3) y=@004b;else if(x1==4) y=@007b;else if(x1==5) y=@007b;else if(x1==6) y=@02d5;else if(x1==7) y=@004c;else y=@0001;
  $  016.板换端电子膨胀阀位置                        $    $  %        $    $  ANS002.BYTE005  $  y=x1;
  $  017.板换出口侧冷却液温度信息                    $    $  ℃       $    $  ANS002.BYTE006  $  if((x1>=0)&&(x1<=90)) y=x1-20;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else y=@0001;
  $  018.压力信息                                    $    $           $    $  ANS003.BYTE007  $  if(x1==0) y=@03c3;else if(x1==1) y=@02df;else if(x1==2) y=@03c4;else if(x1==3) y=@03c5;else y=@0001;
  $  019.空调风扇占空比需求（无级）                  $    $  %        $    $  ANS003.BYTE009  $  y=x1;
  $  020.压力值                                      $    $           $    $  ANS003.BYTE010  $  y=SPRINTF([%.2f],(x2*256+x1)*0.01);
  $  021.副驾吹面通道温度                            $    $  ℃       $    $  ANS004.BYTE006  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==216) y=@0003;else y=@0001;
  $  022.副驾吹脚通道温度                            $    $  ℃       $    $  ANS004.BYTE007  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==216) y=@0003;else y=@0001;
  $  023.主驾冷暖电机位置百分比                      $    $  %        $    $  ANS004.BYTE008  $  y=x1;
  $  024.副驾冷暖电机位置百分比                      $    $  %        $    $  ANS004.BYTE009  $  y=x1;
  $  025.除霜电机位置百分比                          $    $           $    $  ANS004.BYTE010  $  y=x1;
  $  026.副驾目标通道温度                            $    $           $    $  ANS004.BYTE011  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  027.风加热主驾PTC(辅助加热)状态                 $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@004d;else if(x1==1) y=@004e;else y=@0001;
  $  028.风加热主驾PTC(辅助加热)占空比               $    $  %        $    $  ANS005.BYTE005  $  y=x1;
  $  029.风加热副驾PTC(辅助加热)状态                 $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@004d;else if(x1==1) y=@004e;else y=@0001;
  $  030.风加热副驾PTC(辅助加热)占空比               $    $  %        $    $  ANS005.BYTE007  $  y=x1;
  $  031.电磁阀状态                                  $    $           $    $  ANS005.BYTE008  $  if(x1==0) y=@002a;else if(x1==1) y=@002b;else y=@0001;
  $  032.板换出口冷媒压力                            $    $           $    $  ANS005.BYTE009  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=65534)) y=SPRINTF([%.3f],(x2*256+x1)*0.001);else if((x2*256+x1)==65535) y=@0003;else y=@0001;
  $  033.板换出口冷媒温度                            $    $  ℃       $    $  ANS006.BYTE004  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=32763)) y=SPRINTF([%.1f],(x2*256+x1)*0.1-40);else if((x2*256+x1)==32764) y=@01e4;else if((x2*256+x1)==32765) y=@01e3;else if(((x2*256+x1)>=32766)&&((x2*256+x1)<=65535)) y=SPRINTF([%.1f],((x2*256+x1)-65535)*0.1-40);else y=@0001;
  $  034.热管理水泵启停命令                          $    $           $    $  ANS006.BYTE006  $  if(x1==0) y=@004d;else if(x1==1) y=@004e;else y=@0001;
  $  035.玻璃温度信号                                $    $  ℃       $    $  ANS006.BYTE007  $  if((x1>=0)&&(x1<=254)) y=x1*0.5-40;else if(x1==255) y=@0587;else y=@0001;
  $  036.玻璃湿度信号                                $    $  %        $    $  ANS006.BYTE008  $  if((x1>=0)&&(x1<=200)) y=x1*0.5;else if(x1==255) y=@0587;else y=@0001;
  $  037.右侧阳光值                                  $    $  w/m2     $    $  ANS006.BYTE009  $  if((x1>=0)&&(x1<=254)) y=x1*5;else if(x1==255) y=@0587;else y=@0001;
  $  038.左侧阳光值                                  $    $  w/m2     $    $  ANS006.BYTE010  $  if((x1>=0)&&(x1<=254)) y=x1*5;else if(x1==255) y=@0587;else y=@0001;

  $)  04.BCM(车身控制系统)相关历史数据流-报警记录
  $  04.BCM(车身控制系统)相关历史数据流-报警记录
  $  REQ000:721 03 22 8A 00 00 00 00 00       $  ANS000:729 03 22 8A 00 00 00 00 00

  $  000.报警记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  001.报警记录1-主驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.报警记录1-副驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.报警记录1-左后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.报警记录1-右后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.报警记录1-行李箱盖                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.报警记录1-IG1(点火1)电               $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.报警记录1-蓄电池掉电触发             $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  008.报警记录1-主驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  009.报警记录1-左后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  010.报警记录1-副驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  011.报警记录1-右后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  012.报警记录1-前舱盖                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  013.报警记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  014.报警记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  015.报警记录2-主驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  016.报警记录2-副驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  017.报警记录2-左后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  018.报警记录2-右后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  019.报警记录2-行李箱盖                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  020.报警记录2-IG1(点火1)电               $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  021.报警记录2-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  022.报警记录2-主驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.报警记录2-左后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.报警记录2-副驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.报警记录2-右后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  026.报警记录2-前舱盖                     $    $       $    $  ANS000.BYTE010  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  027.报警记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  028.报警记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  029.报警记录3-主驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  030.报警记录3-副驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  031.报警记录3-左后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  032.报警记录3-右后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  033.报警记录3-行李箱盖                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  034.报警记录3-IG1(点火1)电               $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  035.报警记录3-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  036.报警记录3-主驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  037.报警记录3-左后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  038.报警记录3-副驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  039.报警记录3-右后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  040.报警记录3-前舱盖                     $    $       $    $  ANS000.BYTE014  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  041.报警记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  042.报警记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  043.报警记录4-主驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  044.报警记录4-副驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  045.报警记录4-左后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  046.报警记录4-右后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  047.报警记录4-行李箱盖                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  048.报警记录4-IG1(点火1)电               $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  049.报警记录4-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  050.报警记录4-主驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  051.报警记录4-左后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  052.报警记录4-副驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  053.报警记录4-右后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  054.报警记录4-前舱盖                     $    $       $    $  ANS000.BYTE018  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  055.报警记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  056.报警记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  057.报警记录5-主驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  058.报警记录5-副驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  059.报警记录5-左后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  060.报警记录5-右后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  061.报警记录5-行李箱盖                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  062.报警记录5-IG1(点火1)电               $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  063.报警记录5-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  064.报警记录5-主驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  065.报警记录5-左后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  066.报警记录5-副驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  067.报警记录5-右后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  068.报警记录5-前舱盖                     $    $       $    $  ANS000.BYTE022  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  069.报警记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  070.报警记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  071.报警记录6-主驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  072.报警记录6-副驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  073.报警记录6-左后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  074.报警记录6-右后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  075.报警记录6-行李箱盖                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  076.报警记录6-IG1(点火1)电               $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  077.报警记录6-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  078.报警记录6-主驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  079.报警记录6-左后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  080.报警记录6-副驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  081.报警记录6-右后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  082.报警记录6-前舱盖                     $    $       $    $  ANS000.BYTE026  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  083.报警记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  084.报警记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  085.报警记录7-主驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  086.报警记录7-副驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  087.报警记录7-左后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  088.报警记录7-右后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  089.报警记录7-行李箱盖                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  090.报警记录7-IG1(点火1)电               $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  091.报警记录7-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  092.报警记录7-主驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  093.报警记录7-左后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  094.报警记录7-副驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  095.报警记录7-右后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  096.报警记录7-前舱盖                     $    $       $    $  ANS000.BYTE030  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  097.报警记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  098.报警记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  099.报警记录8-主驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  100.报警记录8-副驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  101.报警记录8-左后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  102.报警记录8-右后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  103.报警记录8-行李箱盖                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  104.报警记录8-IG1(点火1)电               $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  105.报警记录8-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  106.报警记录8-主驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  107.报警记录8-左后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  108.报警记录8-副驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  109.报警记录8-右后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  110.报警记录8-前舱盖                     $    $       $    $  ANS000.BYTE034  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  111.报警记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.BCM(车身控制系统)相关历史数据流-闭锁记录
  $  05.BCM(车身控制系统)相关历史数据流-闭锁记录
  $  REQ000:721 03 22 8A 01 00 00 00 00       $  ANS000:729 03 22 8A 01 00 00 00 00

  $  000.闭锁记录1-记录有效性               $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  001.闭锁记录1-副驶中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.闭锁记录1-主驾中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.闭锁记录1-遥控                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.闭锁记录1-超速                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.闭锁记录1-自动返回防盗             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.闭锁记录1-左前门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.闭锁记录1-右前门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  008.闭锁记录1-后背门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  009.闭锁记录1-远程控制                 $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  010.闭锁记录1-自动设定防盗             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  011.闭锁记录1-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  012.闭锁记录1-数据索引                 $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013.闭锁记录2-记录有效性               $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  014.闭锁记录2-副驶中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  015.闭锁记录2-主驾中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  016.闭锁记录2-遥控                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  017.闭锁记录2-超速                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  018.闭锁记录2-自动返回防盗             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  019.闭锁记录2-左前门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  020.闭锁记录2-右前门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  021.闭锁记录2-后背门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  022.闭锁记录2-远程控制                 $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.闭锁记录2-自动设定防盗             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.闭锁记录2-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.闭锁记录2-数据索引                 $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026.闭锁记录3-记录有效性               $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  027.闭锁记录3-副驶中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  028.闭锁记录3-主驾中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  029.闭锁记录3-遥控                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  030.闭锁记录3-超速                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  031.闭锁记录3-自动返回防盗             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  032.闭锁记录3-左前门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  033.闭锁记录3-右前门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  034.闭锁记录3-后背门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  035.闭锁记录3-远程控制                 $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  036.闭锁记录3-自动设定防盗             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  037.闭锁记录3-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  038.闭锁记录3-数据索引                 $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039.闭锁记录4-记录有效性               $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  040.闭锁记录4-副驶中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  041.闭锁记录4-主驾中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  042.闭锁记录4-遥控                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  043.闭锁记录4-超速                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  044.闭锁记录4-自动返回防盗             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  045.闭锁记录4-左前门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  046.闭锁记录4-右前门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  047.闭锁记录4-后背门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  048.闭锁记录4-远程控制                 $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  049.闭锁记录4-自动设定防盗             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  050.闭锁记录4-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  051.闭锁记录4-数据索引                 $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052.闭锁记录5-记录有效性               $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  053.闭锁记录5-副驶中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  054.闭锁记录5-主驾中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  055.闭锁记录5-遥控                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  056.闭锁记录5-超速                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  057.闭锁记录5-自动返回防盗             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  058.闭锁记录5-左前门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  059.闭锁记录5-右前门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  060.闭锁记录5-后背门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  061.闭锁记录5-远程控制                 $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  062.闭锁记录5-自动设定防盗             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  063.闭锁记录5-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  064.闭锁记录5-数据索引                 $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065.闭锁记录6-记录有效性               $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  066.闭锁记录6-副驶中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  067.闭锁记录6-主驾中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  068.闭锁记录6-遥控                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  069.闭锁记录6-超速                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  070.闭锁记录6-自动返回防盗             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  071.闭锁记录6-左前门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  072.闭锁记录6-右前门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  073.闭锁记录6-后背门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  074.闭锁记录6-远程控制                 $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  075.闭锁记录6-自动设定防盗             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  076.闭锁记录6-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  077.闭锁记录6-数据索引                 $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078.闭锁记录7-记录有效性               $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  079.闭锁记录7-副驶中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  080.闭锁记录7-主驾中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  081.闭锁记录7-遥控                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  082.闭锁记录7-超速                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  083.闭锁记录7-自动返回防盗             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  084.闭锁记录7-左前门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  085.闭锁记录7-右前门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  086.闭锁记录7-后背门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  087.闭锁记录7-远程控制                 $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  088.闭锁记录7-自动设定防盗             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  089.闭锁记录7-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  090.闭锁记录7-数据索引                 $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091.闭锁记录8-记录有效性               $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  092.闭锁记录8-副驶中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  093.闭锁记录8-主驾中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  094.闭锁记录8-遥控                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  095.闭锁记录8-超速                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  096.闭锁记录8-自动返回防盗             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  097.闭锁记录8-左前门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  098.闭锁记录8-右前门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  099.闭锁记录8-后背门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  100.闭锁记录8-远程控制                 $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  101.闭锁记录8-自动设定防盗             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  102.闭锁记录8-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  103.闭锁记录8-数据索引                 $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.BCM(车身控制系统)相关历史数据流-解锁记录
  $  06.BCM(车身控制系统)相关历史数据流-解锁记录
  $  REQ000:721 03 22 8A 02 00 00 00 00       $  ANS000:729 03 22 8A 02 00 00 00 00

  $  000.解锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  001.解锁记录1-副驶中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.解锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.解锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.解锁记录1-退电                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.解锁记录1-碰撞信号             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.解锁记录1-钥匙在车内           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.解锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  008.解锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  009.解锁记录1-锁定防止             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  010.解锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  011.解锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  012.解锁记录1-硬线碰撞信号         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  013.解锁记录1-CAN线碰撞信号        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  014.解锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  015.解锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  016.解锁记录2-副驶中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  017.解锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  018.解锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  019.解锁记录2-退电                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  020.解锁记录2-碰撞信号             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  021.解锁记录2-钥匙在车内           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  022.解锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  023.解锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  024.解锁记录2-锁定防止             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  025.解锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  026.解锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  027.解锁记录2-硬线碰撞信号         $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  028.解锁记录2-CAN线碰撞信号        $    $       $    $  ANS000.BYTE010  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  029.解锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  030.解锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  031.解锁记录3-副驶中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  032.解锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  033.解锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  034.解锁记录3-退电                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  035.解锁记录3-碰撞信号             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  036.解锁记录3-钥匙在车内           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  037.解锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  038.解锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  039.解锁记录3-锁定防止             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  040.解锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  041.解锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  042.解锁记录3-硬线碰撞信号         $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  043.解锁记录3-CAN线碰撞信号        $    $       $    $  ANS000.BYTE014  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  044.解锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  045.解锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  046.解锁记录4-副驶中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  047.解锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  048.解锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  049.解锁记录4-退电                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  050.解锁记录4-碰撞信号             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  051.解锁记录4-钥匙在车内           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  052.解锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  053.解锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  054.解锁记录4-锁定防止             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  055.解锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  056.解锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  057.解锁记录4-硬线碰撞信号         $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  058.解锁记录4-CAN线碰撞信号        $    $       $    $  ANS000.BYTE018  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  059.解锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  060.解锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  061.解锁记录5-副驶中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  062.解锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  063.解锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  064.解锁记录5-退电                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  065.解锁记录5-碰撞信号             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  066.解锁记录5-钥匙在车内           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  067.解锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  068.解锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  069.解锁记录5-锁定防止             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  070.解锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  071.解锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  072.解锁记录5-硬线碰撞信号         $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  073.解锁记录5-CAN线碰撞信号        $    $       $    $  ANS000.BYTE022  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  074.解锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  075.解锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  076.解锁记录6-副驶中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  077.解锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  078.解锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  079.解锁记录6-退电                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  080.解锁记录6-碰撞信号             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  081.解锁记录6-钥匙在车内           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  082.解锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  083.解锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  084.解锁记录6-锁定防止             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  085.解锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  086.解锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  087.解锁记录6-硬线碰撞信号         $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  088.解锁记录6-CAN线碰撞信号        $    $       $    $  ANS000.BYTE026  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  089.解锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  090.解锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  091.解锁记录7-副驶中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  092.解锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  093.解锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  094.解锁记录7-退电                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  095.解锁记录7-碰撞信号             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  096.解锁记录7-钥匙在车内           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  097.解锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  098.解锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  099.解锁记录7-锁定防止             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  100.解锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  101.解锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  102.解锁记录7-硬线碰撞信号         $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  103.解锁记录7-CAN线碰撞信号        $    $       $    $  ANS000.BYTE030  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  104.解锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  105.解锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  106.解锁记录8-副驶中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  107.解锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  108.解锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  109.解锁记录8-退电                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  110.解锁记录8-碰撞信号             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  111.解锁记录8-钥匙在车内           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  112.解锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  113.解锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  114.解锁记录8-锁定防止             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  115.解锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  116.解锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  117.解锁记录8-硬线碰撞信号         $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  118.解锁记录8-CAN线碰撞信号        $    $       $    $  ANS000.BYTE034  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  119.解锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  07.BCM(车身控制系统)相关历史数据流-行李箱解锁记录
  $  07.BCM(车身控制系统)相关历史数据流-行李箱解锁记录
  $  REQ000:721 03 22 8A 03 00 00 00 00       $  ANS000:729 03 22 8A 03 00 00 00 00

  $  000.行李箱解锁记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  001.行李箱解锁记录1-遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.行李箱解锁记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007.行李箱解锁记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  008.行李箱解锁记录2-遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  009.行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  010.行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  011.行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  012.行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  013.行李箱解锁记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014.行李箱解锁记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  015.行李箱解锁记录3-遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  016.行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  017.行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  018.行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  019.行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  020.行李箱解锁记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021.行李箱解锁记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  022.行李箱解锁记录4-遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  026.行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  027.行李箱解锁记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028.行李箱解锁记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  029.行李箱解锁记录5-遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  030.行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  031.行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  032.行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  033.行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  034.行李箱解锁记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035.行李箱解锁记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  036.行李箱解锁记录6-遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  037.行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  038.行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  039.行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  040.行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  041.行李箱解锁记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042.行李箱解锁记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  043.行李箱解锁记录7-遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  044.行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  045.行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  046.行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  047.行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  048.行李箱解锁记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049.行李箱解锁记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  050.行李箱解锁记录8-遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  051.行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  052.行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  053.行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  054.行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  055.行李箱解锁记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  08.BCM(车身控制系统)相关历史数据流-启动失败记录
  $  08.BCM(车身控制系统)相关历史数据流-启动失败记录
  $  REQ000:721 03 22 8A 04 00 00 00 00       $  ANS000:729 03 22 8A 04 00 00 00 00

  $  000.启动失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  001.启动失败记录1-启动失败原因       $    $       $    $  ANS000.BYTE005  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  002.启动失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.启动失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  004.启动失败记录2-启动失败原因       $    $       $    $  ANS000.BYTE009  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  005.启动失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.启动失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  007.启动失败记录3-启动失败原因       $    $       $    $  ANS000.BYTE013  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  008.启动失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.启动失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  010.启动失败记录4-启动失败原因       $    $       $    $  ANS000.BYTE017  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  011.启动失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.启动失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  013.启动失败记录5-启动失败原因       $    $       $    $  ANS000.BYTE021  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  014.启动失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.启动失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  016.启动失败记录6-启动失败原因       $    $       $    $  ANS000.BYTE025  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  017.启动失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.启动失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  019.启动失败记录7-启动失败原因       $    $       $    $  ANS000.BYTE029  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  020.启动失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.启动失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  022.启动失败记录8-启动失败原因       $    $       $    $  ANS000.BYTE033  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  023.启动失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  09.BCM(车身控制系统)相关历史数据流-退电失败记录
  $  09.BCM(车身控制系统)相关历史数据流-退电失败记录
  $  REQ000:721 03 22 8A 05 00 00 00 00       $  ANS000:729 03 22 8A 05 00 00 00 00

  $  000.退电失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  001.退电失败记录1-退电失败原因       $    $       $    $  ANS000.BYTE005  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  002.退电失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.退电失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  004.退电失败记录2-退电失败原因       $    $       $    $  ANS000.BYTE009  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  005.退电失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.退电失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  007.退电失败记录3-退电失败原因       $    $       $    $  ANS000.BYTE013  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  008.退电失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.退电失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  010.退电失败记录4-退电失败原因       $    $       $    $  ANS000.BYTE017  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  011.退电失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.退电失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  013.退电失败记录5-退电失败原因       $    $       $    $  ANS000.BYTE021  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  014.退电失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.退电失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  016.退电失败记录6-退电失败原因       $    $       $    $  ANS000.BYTE025  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  017.退电失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.退电失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  019.退电失败记录7-退电失败原因       $    $       $    $  ANS000.BYTE029  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  020.退电失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.退电失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  022.退电失败记录8-退电失败原因       $    $       $    $  ANS000.BYTE033  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  023.退电失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  10.BCM(车身控制系统)相关历史数据流-遥控升降窗
  $  10.BCM(车身控制系统)相关历史数据流-遥控升降窗
  $  REQ000:721 03 22 8A 06 00 00 00 00       $  ANS000:729 03 22 8A 06 00 00 00 00
  $  REQ001:721 03 22 8A 07 00 00 00 00       $  ANS001:729 03 22 8A 07 00 00 00 00

  $  000.遥控升降窗命令/数据标识          $    $       $    $  ANS000.BYTE004  $  if(x1==23) y=@02e9;else y=@02ea;
  $  001.遥控降窗                         $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@02e8;else if(x1==0) y=@0003;else y=@0001;
  $  002.遥控升窗                         $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@02e7;else if(x1==0) y=@0003;else y=@0001;
  $  003.发生事件点/月                    $    $       $    $  ANS000.BYTE006  $  y=SPRINTF([%02d%s],x1,@0198);
  $  004.发生事件点/日                    $    $       $    $  ANS000.BYTE007  $  y=SPRINTF([%02d%s],x1,@0199);
  $  005.发生事件点/时                    $    $       $    $  ANS000.BYTE008  $  y=SPRINTF([%02d%s],x1,@02ab);
  $  006.发生事件点/分                    $    $       $    $  ANS000.BYTE009  $  y=SPRINTF([%02d%s],x1,@0212);
  $  007.数据索引                         $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  008.数据标识                         $    $       $    $  ANS001.BYTE004  $  if(x1==34) y=@02aa;else y=@0092;
  $  009.IG3(点火3)继电器断开原因         $    $       $    $  ANS001.BYTE005  $  if(x1==1) y=@02ac;else if(x1==0) y=@0003;else if(x1==2) y=@02ad;else if(x1==3) y=@02ae;else if(x1==4) y=@02af;else if(x1==5) y=@02b0;else if(x1==6) y=@02b1;else if(x1==7) y=@02b2;else if(x1==8) y=@02b3;else if(x1==9) y=@02b4;else if(x1==10) y=@02b5;else if(x1==11) y=@02b6;else if(x1==12) y=@02b7;else if(x1==13) y=@02b8;else if(x1==14) y=@02b9;else if(x1==15) y=@02ba;else if(x1==16) y=@02bb;else if(x1==17) y=@02bc;else if(x1==18) y=@02bd;else if(x1==19) y=@02be;else if(x1==20) y=@02bf;else y=@0001;
  $  010.IG3(点火3)继电器断开时间点       $    $       $    $  ANS001.BYTE006  $  y=SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0198,x2,@0199,x3,@02ab,x4,@0212);
  $  011.数据索引                         $    $       $    $  ANS001.BYTE010  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:721 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
