
    车型ID：3be7

    模拟：协议模拟-->3be7

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 03 19 02 09 00 00 00 00       $#  ANS000:7E8 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/90000000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 80 00 00 00 00       $%  ANS000:7E8 03 22 F1 80 00 00 00 00
  $%  REQ001:7E0 03 22 F1 92 00 00 00 00       $%  ANS001:7E8 03 22 F1 92 00 00 00 00
  $%  REQ002:7E0 03 22 F1 93 00 00 00 00       $%  ANS002:7E8 03 22 F1 93 00 00 00 00
  $%  REQ003:7E0 03 22 F1 94 00 00 00 00       $%  ANS003:7E8 03 22 F1 94 00 00 00 00
  $%  REQ004:7E0 03 22 F1 95 00 00 00 00       $%  ANS004:7E8 03 22 F1 95 00 00 00 00
  $%  REQ005:7E0 03 22 F1 99 00 00 00 00       $%  ANS005:7E8 03 22 F1 99 00 00 00 00
  $%  REQ006:7E0 03 22 F1 90 00 00 00 00       $%  ANS006:7E8 03 22 F1 90 00 00 00 00

  $%  000:引导程序软件版本号/日期(年):        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%02d%s%02d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  001:软件版本:                           $%    $%  ANS000.BYTE007  $%  y=SPRINTF([%d.%d.%d.],x1,x2,x3);
  $%  002:日期:                               $%    $%  ANS000.BYTE010  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  003:硬件编号:                           $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  004:硬件版本:                           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  005:硬件日期:                           $%    $%  ANS002.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  006:软件编号:                           $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  007:软件版本:                           $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  008:软件日期:                           $%    $%  ANS004.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  009:修改次数:                           $%    $%  ANS004.BYTE009  $%  y=x1;
  $%  010:编程日期:                           $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  011:学习到的VIN(车辆识别码):            $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000.发动机出水口目标温度                        $    $  ℃       $    $  ANS000.BYTE175  $  y=SPRINTF([%d],x1-40);
  $  001.发动机转速                                  $    $  rpm      $    $  ANS000.BYTE036  $  y=SPRINTF([%d],(x1*256+x2)/4);
  $  002.电源电压                                    $    $  V        $    $  ANS000.BYTE035  $  y=SPRINTF([%.1f],x1/10);
  $  003.目标怠速(有补偿)                            $    $  rpm      $    $  ANS000.BYTE039  $  y=SPRINTF([%d],x1*10);
  $  004.进气压力                                    $    $  kpa      $    $  ANS000.BYTE046  $  y=x1;
  $  005.冷却液温度                                  $    $  ℃       $    $  ANS000.BYTE042  $  y=SPRINTF([%d],x1-40);
  $  006.目标油压                                    $    $  bar      $    $  ANS000.BYTE108  $  y=x1;
  $  007.实际油压                                    $    $  bar      $    $  ANS000.BYTE110  $  y=x1;
  $  008.油压调节阀占空比                            $    $  %        $    $  ANS000.BYTE111  $  y=SPRINTF([%.1f],x1*100/255);
  $  009.节气门开度                                  $    $  %        $    $  ANS000.BYTE055  $  y=SPRINTF([%.1f],(x1*256+x2)/10);
  $  010.节气门目标开度                              $    $  %        $    $  ANS000.BYTE049  $  y=SPRINTF([%.1f],(x1*256+x2)/10);
  $  011.充磁时间                                    $    $  ms       $    $  ANS000.BYTE063  $  y=SPRINTF([%.1f],x1/10);
  $  012.进气相位原始值                              $    $  °       $    $  ANS000.BYTE131  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  013.喷油脉宽                                    $    $  ms       $    $  ANS000.BYTE064  $  y=SPRINTF([%.1f],x1/10);
  $  014.进气流量                                    $    $  Kg/h     $    $  ANS000.BYTE047  $  y=SPRINTF([%.1f],(x1*256+x2)/10);
  $  015.目标怠速(无补偿)                            $    $  rpm      $    $  ANS000.BYTE038  $  y=SPRINTF([%d],x1*10);
  $  016.车速                                        $    $  Km/h     $    $  ANS000.BYTE040  $  y=x1;
  $  017.运行里程                                    $    $  KM       $    $  ANS000.BYTE092  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  018.运行时间                                    $    $  Min      $    $  ANS000.BYTE096  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  019.进气温度                                    $    $  ℃       $    $  ANS000.BYTE044  $  y=SPRINTF([%d],x1-40);
  $  020.增压气体温度                                $    $  ℃       $    $  ANS000.BYTE117  $  y=SPRINTF([%d],x1-40);
  $  021.目标增压压力                                $    $  kpa      $    $  ANS000.BYTE113  $  y=x1;
  $  022.实际增压压力                                $    $  kpa      $    $  ANS000.BYTE115  $  y=x1;
  $  023.目标进气相位                                $    $  °       $    $  ANS000.BYTE126  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  024.进气相位                                    $    $  °       $    $  ANS000.BYTE124  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  025.大气压力值                                  $    $  kpa      $    $  ANS000.BYTE120  $  y=x1;
  $  026.海拔校正                                    $    $  %        $    $  ANS000.BYTE121  $  y=SPRINTF([%.1f],x1*100/255);
  $  027.制动助力器压力                              $    $  kpa      $    $  ANS000.BYTE112  $  y=x1;
  $  028.点火提前角                                  $    $  °       $    $  ANS000.BYTE065  $  y=SPRINTF([%d],x1-50);
  $  029.空燃比                                      $    $  %        $    $  ANS000.BYTE128  $  y=SPRINTF([%.1f],x1/10);
  $  030.爆震传感器1                                 $    $           $    $  ANS000.BYTE069  $  y=(x1*256+x2);
  $  031.爆震传感器2                                 $    $           $    $  ANS000.BYTE071  $  y=(x1*256+x2);
  $  032.1组氧传感器电压,传感器1(氧传感器1)          $    $  V        $    $  ANS000.BYTE081  $  y=SPRINTF([%.1f],x1/255);
  $  033.1组氧传感器电压,传感器2(氧传感器2)          $    $  V        $    $  ANS000.BYTE082  $  y=SPRINTF([%.1f],x1/255);
  $  034.1组氧传感器积分值(短期修正)                 $    $           $    $  ANS000.BYTE079  $  y=SPRINTF([%.1f],x1/128);
  $  035.1组氧传感器积分值(长期修正)                 $    $           $    $  ANS000.BYTE085  $  y=SPRINTF([%.1f],x1/128);
  $  036.1缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE073  $  y=SPRINTF([%.1f],x1/10);
  $  037.2缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE074  $  y=SPRINTF([%.1f],x1/10);
  $  038.3缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE075  $  y=SPRINTF([%.1f],x1/10);
  $  039.4缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE076  $  y=SPRINTF([%.1f],x1/10);
  $  040.发电机励磁开度                              $    $  %        $    $  ANS000.BYTE144  $  y=SPRINTF([%.1f],x1*100/255);
  $  041.发电机目标电压                              $    $  V        $    $  ANS000.BYTE145  $  y=SPRINTF([%.1f],x1/10);
  $  042.发电机励磁电流限值                          $    $  A        $    $  ANS000.BYTE146  $  y=SPRINTF([%.1f],x1/10);
  $  043.发电机实发电压                              $    $  V        $    $  ANS000.BYTE148  $  y=SPRINTF([%.1f],x1/10);
  $  044.发电机励磁电流                              $    $  A        $    $  ANS000.BYTE149  $  y=SPRINTF([%.1f],x1/10);
  $  045.发电机负载响应时间                          $    $  s        $    $  ANS000.BYTE150  $  y=x1;
  $  046.低压油压                                    $    $  bar      $    $  ANS000.BYTE158  $  y=SPRINTF([%.1f],x1/10);
  $  047.排气相位                                    $    $  °       $    $  ANS000.BYTE161  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  048.目标排气相位                                $    $  °       $    $  ANS000.BYTE163  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  049.无级风扇占空比                              $    $  %        $    $  ANS000.BYTE102  $  y=SPRINTF([%.1f],x1*100/255);
  $  050.增压压力限制阀占空比                        $    $  %        $    $  ANS000.BYTE122  $  y=SPRINTF([%.1f],x1*100/255);
  $  051.计算节气门位置                              $    $  %        $    $  ANS000.BYTE057  $  y=SPRINTF([%.1f],x1*100/255);
  $  052.节气门电机PWM(脉宽调制)                     $    $  %        $    $  ANS000.BYTE058  $  y=SPRINTF([%.1f],x1*100/255);
  $  053.碳罐阀占空比                                $    $  %        $    $  ANS000.BYTE062  $  y=SPRINTF([%.1f],x1*100/255);
  $  054.旁通气量                                    $    $           $    $  ANS000.BYTE129  $  y=(x1*256+x2);
  $  055.冷却液温度传感器                            $    $  V        $    $  ANS000.BYTE041  $  y=SPRINTF([%.1f],x1/51);
  $  056.进气温度传感器                              $    $  V        $    $  ANS000.BYTE043  $  y=SPRINTF([%.1f],x1/51);
  $  057.进气压力传感器                              $    $  V        $    $  ANS000.BYTE045  $  y=SPRINTF([%.1f],x1/51);
  $  058.节气门位置传感器1                           $    $  V        $    $  ANS000.BYTE051  $  y=SPRINTF([%.1f],(x1*256+x2)/13107);
  $  059.节气门位置传感器2                           $    $  V        $    $  ANS000.BYTE053  $  y=SPRINTF([%.1f],(x1*256+x2)/13107);
  $  060.增压压力传感器                              $    $  V        $    $  ANS000.BYTE114  $  y=SPRINTF([%.1f],x1/51);
  $  061.增压气体温度传感器                          $    $  V        $    $  ANS000.BYTE116  $  y=SPRINTF([%.1f],x1/51);
  $  062.油压传感器                                  $    $  V        $    $  ANS000.BYTE109  $  y=SPRINTF([%.1f],x1/51);
  $  063.发动机冷却系统-低速风扇是否开启             $    $           $    $  ANS000.BYTE023  $  if(x1&0x01) y=@0185;else y=@0186;
  $  064.发动机冷却系统-高速风扇是否开启             $    $           $    $  ANS000.BYTE023  $  if(x1&0x02) y=@0185;else y=@0186;
  $  065.发动机冷却系统-风扇类型                     $    $           $    $  ANS000.BYTE023  $  if(x1&0x0C) y=@0193;else y=@0194;
  $  066.发动机稳态工况-点火电源开启                 $    $           $    $  ANS000.BYTE024  $  if(x1&0x01) y=@0185;else y=@0186;
  $  067.发动机稳态工况-主继电器工作                 $    $           $    $  ANS000.BYTE024  $  if(x1&0x02) y=@0185;else y=@0186;
  $  068.发动机动态工况-节气门处于怠速位置           $    $           $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0185;else y=@0186;
  $  069.发动机动态工况-节气门处于部分打开位置       $    $           $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0185;else y=@0186;
  $  070.发动机动态工况-节气门处于全开位置           $    $           $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0185;else y=@0186;
  $  071.发动机动态工况-激活减速断油                 $    $           $    $  ANS000.BYTE025  $  if(x1&0x08) y=@00f2;else y=@0181;
  $  072.发动机动态工况-激活加速加浓                 $    $           $    $  ANS000.BYTE025  $  if(x1&0x10) y=@00f2;else y=@0181;
  $  073.发动机动态工况-是否D档(前进档)              $    $           $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0185;else y=@0186;
  $  074.发动机动态工况-是否R档(后退档)              $    $           $    $  ANS000.BYTE025  $  if(x1&0x40) y=@0185;else y=@0186;
  $  075.发动机动态工况-是否N档(空档)                $    $           $    $  ANS000.BYTE025  $  if(x1&0x80) y=@0185;else y=@0186;
  $  076.氧传感器-氧传感器1信号                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x01) y=@017f;else y=@0180;
  $  077.氧传感器-氧传感器2信号                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x02) y=@017f;else y=@0180;
  $  078.氧传感器-氧传感器1加热                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x10) y=@0183;else y=@0184;
  $  079.氧传感器-氧传感器2加热                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x20) y=@0183;else y=@0184;
  $  080.发动机怠速-制动器踏板状态                   $    $           $    $  ANS000.BYTE028  $  if(x1&0x02) y=@0118;else y=@0182;
  $  081.指示灯SVS/MIL-MIL灯激活                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x01) y=@00f2;else y=@0181;
  $  082.指示灯SVS/MIL-MIL灯闪烁                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0185;else y=@0186;
  $  083.指示灯SVS/MIL-SVS灯激活                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x10) y=@00f2;else y=@0181;
  $  084.指示灯SVS/MIL-SVS灯闪烁                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0185;else y=@0186;
  $  085.AT/扭矩请求-AT转换离合器激活                $    $           $    $  ANS000.BYTE032  $  if(x1&0x08) y=@00f2;else y=@0181;
  $  086.发动机状态-刹车开关激活                     $    $           $    $  ANS000.BYTE034  $  if(x1&0x01) y=@00f2;else y=@0181;
  $  087.发动机状态-刹车灯激活                       $    $           $    $  ANS000.BYTE034  $  if(x1&0x02) y=@00f2;else y=@0181;
  $  088.发动机状态-涡轮增压旁通阀                   $    $           $    $  ANS000.BYTE034  $  if(x1&0x10) y=@001d;else y=@001e;
  $  089.发动机状态-防盗锁定状态                     $    $           $    $  ANS000.BYTE034  $  if(x1&0x20) y=@000a;else y=@0459;
  $  090.水泵工作状态                                $    $           $    $  ANS000.BYTE176  $  if(x1==0) y=@03b5;else if(x1==1) y=@03b6;else if(x1==2) y=@03b7;else if(x1==3) y=@03b8;else if(x1==4) y=@03b9;else if(x1==5) y=@03ba;else y=@0001;
  $  091.电子水泵状态字1-水泵紧急模式状态            $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@0643;else if(x1==1) y=@0644;else if(x1==2) y=@03b1;else y=@0001;
  $  092.电子水泵状态字1-水泵过温状态                $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@0078;else if(x1==1) y=@03b2;else if(x1==2) y=@03b1;else y=@0001;
  $  093.电子水泵状态字1-水泵过流状态                $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@0078;else if(x1==1) y=@0345;else if(x1==2) y=@03b1;else y=@0001;
  $  094.电子水泵状态字1-水泵干转状态                $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@0078;else if(x1==1) y=@03bb;else if(x1==2) y=@03b1;else y=@0001;
  $  095.电子水泵状态字2-水泵电压状态                $    $           $    $  ANS000.BYTE178  $  if(x1==0) y=@0078;else if(x1==1) y=@01e8;else if(x1==2) y=@03b1;else y=@0001;
  $  096.电子水泵状态字2-水泵堵转状态                $    $           $    $  ANS000.BYTE178  $  if(x1==0) y=@0078;else if(x1==1) y=@0347;else if(x1==2) y=@03b1;else y=@0001;
  $  097.颗粒捕集器压差                              $    $  Kpa      $    $  ANS000.BYTE179  $  y=SPRINTF([%d],(x1*256+x2)*0.01-20);
  $  098.颗粒捕集器入口温度                          $    $  ℃       $    $  ANS000.BYTE181  $  y=SPRINTF([%d],(x1*256+x2)-60);
  $  099.颗粒捕集器内部累碳量                        $    $  mg       $    $  ANS000.BYTE183  $  y=(x1*256+x2);
  $  100.当前排气氧流量                              $    $  g/s      $    $  ANS000.BYTE187  $  y=(x1*256+x2);
  $  101.颗粒捕集器再生指令                          $    $           $    $  ANS000.BYTE189  $  if(x1==0) y=@03af;else if(x1==1) y=@03b0;else y=@0001;
  $  102.颗粒捕集器再生条件满足                      $    $           $    $  ANS000.BYTE190  $  if(x1==0) y=@03af;else if(x1==1) y=@03b0;else y=@0001;
  $  103.颗粒捕集器再生里程                          $    $  Km       $    $  ANS000.BYTE191  $  y=(x1*256*256+x2*256+x3);

  $IN_01  REQ000:7E0 02 01 00 00 00 00 00 00       $IN_01  ANS000:7E8 02 01 00 00 00 00 00 00

  $)  01.OBD(车载诊断系统)信息
  $  01.OBD(车载诊断系统)信息
  $  REQ000:7E0 02 01 01 00 00 00 00 00       $  ANS000:7E8 02 01 01 00 00 00 00 00
  $  REQ001:7E0 02 01 02 00 00 00 00 00       $  ANS001:7E8 02 01 02 00 00 00 00 00
  $  REQ002:7E0 02 01 03 00 00 00 00 00       $  ANS002:7E8 02 01 03 00 00 00 00 00
  $  REQ003:7E0 02 01 04 00 00 00 00 00       $  ANS003:7E8 02 01 04 00 00 00 00 00
  $  REQ004:7E0 02 01 05 00 00 00 00 00       $  ANS004:7E8 02 01 05 00 00 00 00 00
  $  REQ005:7E0 02 01 06 00 00 00 00 00       $  ANS005:7E8 02 01 06 00 00 00 00 00
  $  REQ006:7E0 02 01 07 00 00 00 00 00       $  ANS006:7E8 02 01 07 00 00 00 00 00
  $  REQ007:7E0 02 01 0B 00 00 00 00 00       $  ANS007:7E8 02 01 0B 00 00 00 00 00
  $  REQ008:7E0 02 01 0C 00 00 00 00 00       $  ANS008:7E8 02 01 0C 00 00 00 00 00
  $  REQ009:7E0 02 01 0D 00 00 00 00 00       $  ANS009:7E8 02 01 0D 00 00 00 00 00
  $  REQ010:7E0 02 01 0E 00 00 00 00 00       $  ANS010:7E8 02 01 0E 00 00 00 00 00
  $  REQ011:7E0 02 01 0F 00 00 00 00 00       $  ANS011:7E8 02 01 0F 00 00 00 00 00
  $  REQ012:7E0 02 01 10 00 00 00 00 00       $  ANS012:7E8 02 01 10 00 00 00 00 00
  $  REQ013:7E0 02 01 11 00 00 00 00 00       $  ANS013:7E8 02 01 11 00 00 00 00 00
  $  REQ014:7E0 02 01 13 00 00 00 00 00       $  ANS014:7E8 02 01 13 00 00 00 00 00
  $  REQ015:7E0 02 01 15 00 00 00 00 00       $  ANS015:7E8 02 01 15 00 00 00 00 00
  $  REQ016:7E0 02 01 1C 00 00 00 00 00       $  ANS016:7E8 02 01 1C 00 00 00 00 00
  $  REQ017:7E0 02 01 1F 00 00 00 00 00       $  ANS017:7E8 02 01 1F 00 00 00 00 00
  $  REQ018:7E0 02 01 21 00 00 00 00 00       $  ANS018:7E8 02 01 21 00 00 00 00 00
  $  REQ019:7E0 02 01 22 00 00 00 00 00       $  ANS019:7E8 02 01 22 00 00 00 00 00
  $  REQ020:7E0 02 01 23 00 00 00 00 00       $  ANS020:7E8 02 01 23 00 00 00 00 00
  $  REQ021:7E0 02 01 2C 00 00 00 00 00       $  ANS021:7E8 02 01 2C 00 00 00 00 00
  $  REQ022:7E0 02 01 2D 00 00 00 00 00       $  ANS022:7E8 02 01 2D 00 00 00 00 00
  $  REQ023:7E0 02 01 2E 00 00 00 00 00       $  ANS023:7E8 02 01 2E 00 00 00 00 00
  $  REQ024:7E0 02 01 2F 00 00 00 00 00       $  ANS024:7E8 02 01 2F 00 00 00 00 00
  $  REQ025:7E0 02 01 30 00 00 00 00 00       $  ANS025:7E8 02 01 30 00 00 00 00 00
  $  REQ026:7E0 02 01 31 00 00 00 00 00       $  ANS026:7E8 02 01 31 00 00 00 00 00
  $  REQ027:7E0 02 01 33 00 00 00 00 00       $  ANS027:7E8 02 01 33 00 00 00 00 00
  $  REQ028:7E0 02 01 34 00 00 00 00 00       $  ANS028:7E8 02 01 34 00 00 00 00 00
  $  REQ029:7E0 02 01 3C 00 00 00 00 00       $  ANS029:7E8 02 01 3C 00 00 00 00 00
  $  REQ030:7E0 02 01 41 00 00 00 00 00       $  ANS030:7E8 02 01 41 00 00 00 00 00
  $  REQ031:7E0 02 01 42 00 00 00 00 00       $  ANS031:7E8 02 01 42 00 00 00 00 00
  $  REQ032:7E0 02 01 43 00 00 00 00 00       $  ANS032:7E8 02 01 43 00 00 00 00 00
  $  REQ033:7E0 02 01 44 00 00 00 00 00       $  ANS033:7E8 02 01 44 00 00 00 00 00
  $  REQ034:7E0 02 01 45 00 00 00 00 00       $  ANS034:7E8 02 01 45 00 00 00 00 00
  $  REQ035:7E0 02 01 46 00 00 00 00 00       $  ANS035:7E8 02 01 46 00 00 00 00 00
  $  REQ036:7E0 02 01 47 00 00 00 00 00       $  ANS036:7E8 02 01 47 00 00 00 00 00
  $  REQ037:7E0 02 01 49 00 00 00 00 00       $  ANS037:7E8 02 01 49 00 00 00 00 00
  $  REQ038:7E0 02 01 4A 00 00 00 00 00       $  ANS038:7E8 02 01 4A 00 00 00 00 00
  $  REQ039:7E0 02 01 4C 00 00 00 00 00       $  ANS039:7E8 02 01 4C 00 00 00 00 00
  $  REQ040:7E0 02 01 4D 00 00 00 00 00       $  ANS040:7E8 02 01 4D 00 00 00 00 00
  $  REQ041:7E0 02 01 4E 00 00 00 00 00       $  ANS041:7E8 02 01 4E 00 00 00 00 00
  $  REQ042:7E0 02 01 51 00 00 00 00 00       $  ANS042:7E8 02 01 51 00 00 00 00 00
  $  REQ043:7E0 02 01 54 00 00 00 00 00       $  ANS043:7E8 02 01 54 00 00 00 00 00
  $  REQ044:7E0 02 01 67 00 00 00 00 00       $  ANS044:7E8 02 01 67 00 00 00 00 00
  $  REQ045:7E0 02 01 68 00 00 00 00 00       $  ANS045:7E8 02 01 68 00 00 00 00 00
  $  REQ046:7E0 02 01 69 00 00 00 00 00       $  ANS046:7E8 02 01 69 00 00 00 00 00
  $  REQ047:7E0 02 01 6B 00 00 00 00 00       $  ANS047:7E8 02 01 6B 00 00 00 00 00
  $  REQ048:7E0 02 01 7A 00 00 00 00 00       $  ANS048:7E8 02 01 7A 00 00 00 00 00
  $  REQ049:7E0 02 01 7C 00 00 00 00 00       $  ANS049:7E8 02 01 7C 00 00 00 00 00
  $  REQ050:7E0 02 01 87 00 00 00 00 00       $  ANS050:7E8 02 01 87 00 00 00 00 00
  $  REQ051:7E0 02 01 8B 00 00 00 00 00       $  ANS051:7E8 02 01 8B 00 00 00 00 00
  $  REQ052:7E0 02 01 A6 00 00 00 00 00       $  ANS052:7E8 02 01 A6 00 00 00 00 00
  $  REQ053:7E0 02 02 01 00 00 00 00 00       $  ANS053:7E8 02 02 01 00 00 00 00 00
  $  REQ054:7E0 02 02 02 00 00 00 00 00       $  ANS054:7E8 02 02 02 00 00 00 00 00
  $  REQ055:7E0 02 02 03 00 00 00 00 00       $  ANS055:7E8 02 02 03 00 00 00 00 00
  $  REQ056:7E0 02 02 04 00 00 00 00 00       $  ANS056:7E8 02 02 04 00 00 00 00 00
  $  REQ057:7E0 02 02 05 00 00 00 00 00       $  ANS057:7E8 02 02 05 00 00 00 00 00
  $  REQ058:7E0 02 02 06 00 00 00 00 00       $  ANS058:7E8 02 02 06 00 00 00 00 00
  $  REQ059:7E0 02 02 07 00 00 00 00 00       $  ANS059:7E8 02 02 07 00 00 00 00 00
  $  REQ060:7E0 02 02 0A 00 00 00 00 00       $  ANS060:7E8 02 02 0A 00 00 00 00 00
  $  REQ061:7E0 02 02 0B 00 00 00 00 00       $  ANS061:7E8 02 02 0B 00 00 00 00 00
  $  REQ062:7E0 02 02 0C 00 00 00 00 00       $  ANS062:7E8 02 02 0C 00 00 00 00 00
  $  REQ063:7E0 02 02 0D 00 00 00 00 00       $  ANS063:7E8 02 02 0D 00 00 00 00 00
  $  REQ064:7E0 02 02 0E 00 00 00 00 00       $  ANS064:7E8 02 02 0E 00 00 00 00 00
  $  REQ065:7E0 02 02 0F 00 00 00 00 00       $  ANS065:7E8 02 02 0F 00 00 00 00 00
  $  REQ066:7E0 02 02 10 00 00 00 00 00       $  ANS066:7E8 02 02 10 00 00 00 00 00
  $  REQ067:7E0 02 02 11 00 00 00 00 00       $  ANS067:7E8 02 02 11 00 00 00 00 00
  $  REQ068:7E0 02 02 13 00 00 00 00 00       $  ANS068:7E8 02 02 13 00 00 00 00 00
  $  REQ069:7E0 02 02 15 00 00 00 00 00       $  ANS069:7E8 02 02 15 00 00 00 00 00
  $  REQ070:7E0 02 02 1C 00 00 00 00 00       $  ANS070:7E8 02 02 1C 00 00 00 00 00
  $  REQ071:7E0 02 02 1F 00 00 00 00 00       $  ANS071:7E8 02 02 1F 00 00 00 00 00
  $  REQ072:7E0 02 02 23 00 00 00 00 00       $  ANS072:7E8 02 02 23 00 00 00 00 00
  $  REQ073:7E0 02 02 2E 00 00 00 00 00       $  ANS073:7E8 02 02 2E 00 00 00 00 00
  $  REQ074:7E0 02 02 2F 00 00 00 00 00       $  ANS074:7E8 02 02 2F 00 00 00 00 00
  $  REQ075:7E0 02 02 30 00 00 00 00 00       $  ANS075:7E8 02 02 30 00 00 00 00 00
  $  REQ076:7E0 02 02 31 00 00 00 00 00       $  ANS076:7E8 02 02 31 00 00 00 00 00
  $  REQ077:7E0 02 02 33 00 00 00 00 00       $  ANS077:7E8 02 02 33 00 00 00 00 00
  $  REQ078:7E0 02 02 34 00 00 00 00 00       $  ANS078:7E8 02 02 34 00 00 00 00 00
  $  REQ079:7E0 02 02 41 00 00 00 00 00       $  ANS079:7E8 02 02 41 00 00 00 00 00
  $  REQ080:7E0 02 02 42 00 00 00 00 00       $  ANS080:7E8 02 02 42 00 00 00 00 00
  $  REQ081:7E0 02 02 45 00 00 00 00 00       $  ANS081:7E8 02 02 45 00 00 00 00 00
  $  REQ082:7E0 02 02 49 00 00 00 00 00       $  ANS082:7E8 02 02 49 00 00 00 00 00
  $  REQ083:7E0 02 02 4A 00 00 00 00 00       $  ANS083:7E8 02 02 4A 00 00 00 00 00
  $  REQ084:7E0 02 02 4C 00 00 00 00 00       $  ANS084:7E8 02 02 4C 00 00 00 00 00
  $  REQ085:7E0 02 06 01 00 00 00 00 00       $  ANS085:7E8 02 06 01 00 00 00 00 00
  $  REQ086:7E0 02 06 02 00 00 00 00 00       $  ANS086:7E8 02 06 02 00 00 00 00 00
  $  REQ087:7E0 02 06 21 00 00 00 00 00       $  ANS087:7E8 02 06 21 00 00 00 00 00
  $  REQ088:7E0 02 06 35 00 00 00 00 00       $  ANS088:7E8 02 06 35 00 00 00 00 00
  $  REQ089:7E0 02 06 3B 00 00 00 00 00       $  ANS089:7E8 02 06 3B 00 00 00 00 00
  $  REQ090:7E0 02 06 3D 00 00 00 00 00       $  ANS090:7E8 02 06 3D 00 00 00 00 00
  $  REQ091:7E0 02 06 81 00 00 00 00 00       $  ANS091:7E8 02 06 81 00 00 00 00 00
  $  REQ092:7E0 02 06 A2 00 00 00 00 00       $  ANS092:7E8 02 06 A2 00 00 00 00 00
  $  REQ093:7E0 02 06 A3 00 00 00 00 00       $  ANS093:7E8 02 06 A3 00 00 00 00 00
  $  REQ094:7E0 02 06 A4 00 00 00 00 00       $  ANS094:7E8 02 06 A4 00 00 00 00 00
  $  REQ095:7E0 02 06 A5 00 00 00 00 00       $  ANS095:7E8 02 06 A5 00 00 00 00 00
  $  REQ096:7E0 02 06 B2 00 00 00 00 00       $  ANS096:7E8 02 06 B2 00 00 00 00 00
  $  REQ097:7E0 02 09 02 00 00 00 00 00       $  ANS097:7E8 02 09 02 00 00 00 00 00
  $  REQ098:7E0 02 09 04 00 00 00 00 00       $  ANS098:7E8 02 09 04 00 00 00 00 00
  $  REQ099:7E0 02 09 06 00 00 00 00 00       $  ANS099:7E8 02 09 06 00 00 00 00 00
  $  REQ100:7E0 02 09 08 00 00 00 00 00       $  ANS100:7E8 02 09 08 00 00 00 00 00
  $  REQ101:7E0 02 09 0A 00 00 00 00 00       $  ANS101:7E8 02 09 0A 00 00 00 00 00
  $  REQ102:7E0 02 09 12 00 00 00 00 00       $  ANS102:7E8 02 09 12 00 00 00 00 00

  $  000.存储的确认故障数量（故障信息清除后的监测状态）                  $    $           $    $  ANS000.BYTE003  $  y=x1&0x7F;
  $  001.模块指示的MIL(故障指示灯)状态（故障信息清除后的监测状态）       $    $           $    $  ANS000.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  002.失火监测支持（故障信息清除后的监测状态）                        $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  003.燃油系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  004.综合部件监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  005.失火监测准备（故障信息清除后的监测状态）                        $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  006.燃油系统监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  007.综合部件监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  008.催化器监测支持（故障信息清除后的监测状态）                      $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  009.加热型催化器监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  010.蒸发系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  011.二次空气系统监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  012.氧传感器监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  013.氧传感器加热监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  014.EGR/VVT监测支持（故障信息清除后的监测状态）                     $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  015.催化器监测完成（故障信息清除后的监测状态）                      $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  016.加热型催化器监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  017.蒸发系统监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  018.二次空气系统监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  019.氧传感器监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  020.氧传感器加热监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  021.EGR/VVT监测完成（故障信息清除后的监测状态）                     $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  022.造成冻结帧存储的故障代码                                        $    $           $    $  ANS001.BYTE003  $  HEX(x1,x2);
  $  023.燃油系统1状态                                                   $    $           $    $  ANS002.BYTE003  $  if(x1==0) y=@01f9;else y=@0001;if(x1==1) y=@0756;else y=@0001;if(x1==1) y=@0757;else y=@0001;if(x1==1) y=@0758;else y=@0001;if(x1==1) y=@0759;else y=@0001;if(x1==1) y=@075a;else y=@0001;
  $  024.燃油系统2状态                                                   $    $           $    $  ANS002.BYTE004  $  if(x1==0) y=@01f9;else y=@0001;if(x1==1) y=@0756;else y=@0001;if(x1==1) y=@0757;else y=@0001;if(x1==1) y=@0758;else y=@0001;if(x1==1) y=@0759;else y=@0001;if(x1==1) y=@075a;else y=@0001;
  $  025.计算负载值                                                      $    $  %        $    $  ANS003.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  026.发动机出水冷却液温度                                            $    $  ℃       $    $  ANS004.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  027.短期燃油修正-bank1                                              $    $  %        $    $  ANS005.BYTE003  $  y=SPRINTF([%.2f],x1/128-100);
  $  028.长期燃油修正-bank1                                              $    $  %        $    $  ANS006.BYTE003  $  y=SPRINTF([%.2f],x1/128-100);
  $  029.进气歧管绝对压力                                                $    $  kpa      $    $  ANS007.BYTE003  $  y=x1;
  $  030.发动机转速                                                      $    $  rpm      $    $  ANS008.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.25);
  $  031.车速                                                            $    $  Km/h     $    $  ANS009.BYTE003  $  y=x1;
  $  032.1缸点火提前角                                                   $    $  °       $    $  ANS010.BYTE003  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  033.进气温度                                                        $    $  ℃       $    $  ANS011.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  034.空气流量                                                        $    $  g/s      $    $  ANS012.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.01);
  $  035.节气门绝对位置                                                  $    $  %        $    $  ANS013.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  036.氧传感器位置 Bank 1-Sensor 1                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  037.氧传感器位置 Bank 1-Sensor 2                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  038.氧传感器位置 Bank 1-Sensor 3                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  039.氧传感器位置 Bank 1-Sensor 4                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  040.氧传感器位置 Bank 2-Sensor 1                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  041.氧传感器位置 Bank 2-Sensor 2                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  042.氧传感器位置 Bank 2-Sensor 3                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  043.氧传感器位置 Bank 2-Sensor 4                                    $    $           $    $  ANS014.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  044.开关氧传感器输出电压 Bank 1-Sensor 2                            $    $  V        $    $  ANS015.BYTE003  $  y=SPRINTF([%.3f],x1*0.005);
  $  045.短期燃油修正(Bx-Sy) Bank 1-Sensor 2                             $    $  %        $    $  ANS015.BYTE004  $  y=SPRINTF([%.2f],x1/128-100);
  $  046.OBD(车载诊断系统)类型定义                                       $    $           $    $  ANS016.BYTE003  $  if(x1==1) y=@064d;else if(x1==2) y=@0741;else if(x1==3) y=@0742;else if(x1==4) y=@0743;else if(x1==5) y=@0744;else if(x1==6) y=@0745;else if(x1==7) y=@0746;else if(x1==8) y=@0747;else if(x1==9) y=@0748;else if(x1==10) y=@0749;else if(x1==11) y=@074a;else if(x1==12) y=@074b;else if(x1==13) y=@074c;else if(x1==14) y=@065a;else if(x1==15) y=@065b;else if(x1==16) y=@065c;else if(x1==17) y=@074d;else if(x1==18) y=@065e;else if(x1==19) y=@065f;else if(x1==20) y=@0660;else if(x1==21) y=@0661;else if(x1==22) y=@065c;else if(x1==23) y=@074e;else if(x1==24) y=@074f;else if(x1==25) y=@0750;else if(x1==26) y=@0751;else if(x1==27) y=@065c;else if(x1==28) y=@0666;else if(x1==29) y=@0667;else if(x1==30) y=@0668;else if(x1==31) y=@0669;else if(x1==32) y=@066a;else if(x1==33) y=@066b;else if(x1==34) y=@066c;else if(x1==35) y=@066d;else if(x1==36) y=@066e;else if(x1==37) y=@066f;else if(x1==38) y=@0670;else if(x1==39) y=@0671;else if(x1==40) y=@0672;else if(x1==41) y=@0673;else if(x1==42) y=@0674;else if(x1==43) y=@0675;else if((x1>=44)&&(x1<=250)) y=@0752;else if((x1>=250)&&(x1<=255)) y=@0753;else y=@0001;
  $  047.当前驾驶循环发动机运行时间                                      $    $  s        $    $  ANS017.BYTE003  $  y=(x1*256+x2);
  $  048.MIL(故障指示灯)灯激活行驶里程                                   $    $  km       $    $  ANS018.BYTE003  $  y=(x1*256+x2);
  $  049.燃油系统压力（绝压）                                            $    $  kpa      $    $  ANS019.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.079);
  $  050.油轨压力                                                        $    $  kpa      $    $  ANS020.BYTE003  $  y=SPRINTF([%d],(x1*256+x2)*10);
  $  051.EGR(废气再循环)控制                                             $    $  %        $    $  ANS021.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  052.EGR(废气再循环)误差                                             $    $  %        $    $  ANS022.BYTE003  $  y=SPRINTF([%.2f],x1/128-100);
  $  053.碳罐电磁阀占空比控制                                            $    $  %        $    $  ANS023.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  054.油箱燃油量                                                      $    $  %        $    $  ANS024.BYTE003  $  y=x1;
  $  055.故障码被清除后的暖机次数                                        $    $  次       $    $  ANS025.BYTE003  $  y=x1;
  $  056.故障码被清除后的行驶里程                                        $    $  km       $    $  ANS026.BYTE003  $  y=(x1*256+x2);
  $  057.大气压力                                                        $    $  kpa      $    $  ANS027.BYTE003  $  y=(x1*256+x2);
  $  058.线氧λ值 Bank 1 - Sensor 1                                      $    $           $    $  ANS028.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.0000305);
  $  059.线氧泵电流 Bank 1 - Sensor 1                                    $    $  mA       $    $  ANS028.BYTE005  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.00390625);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.00390625);
  $  060.催化剂温度 Bank 1 - Sensor 1                                    $    $  ℃       $    $  ANS029.BYTE003  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1-40);
  $  061.失火监测支持（当前驾驶循环的监测状态）                          $    $           $    $  ANS030.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  062.燃油系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  063.综合部件监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  064.失火监测准备（当前驾驶循环的监测状态）                          $    $           $    $  ANS030.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  065.燃油系统监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  066.综合部件监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  067.催化器监测支持（当前驾驶循环的监测状态）                        $    $           $    $  ANS030.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  068.加热型催化器监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS030.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  069.蒸发系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  070.二次空气系统监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS030.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  071.氧传感器监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  072.氧传感器加热监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS030.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  073.EGR/VVT监测支持（当前驾驶循环的监测状态）                       $    $           $    $  ANS030.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  074.催化器监测完成（当前驾驶循环的监测状态）                        $    $           $    $  ANS030.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  075.加热型催化器监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS030.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  076.蒸发系统监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  077.二次空气系统监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS030.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  078.氧传感器监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS030.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  079.氧传感器加热监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS030.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  080.EGR/VVT监测完成（当前驾驶循环的监测状态）                       $    $           $    $  ANS030.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  081.控制模块电压                                                    $    $  V        $    $  ANS031.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  082.净负荷值                                                        $    $  %        $    $  ANS032.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)/255);
  $  083.指定的等价比λ                                                  $    $           $    $  ANS033.BYTE003  $  y=SPRINTF([%.7f],(x1*256+x2)*0.0000305);
  $  084.节气门相位位置                                                  $    $  %        $    $  ANS034.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)/255);
  $  085.环境温度                                                        $    $  ℃       $    $  ANS035.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  086.节气门B的绝对位置                                               $    $  %        $    $  ANS036.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  087.油门踏板位置D                                                   $    $  %        $    $  ANS037.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  088.油门踏板位置E                                                   $    $  %        $    $  ANS038.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  089.节气门电机占空比                                                $    $  %        $    $  ANS039.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  090.MIL(故障指示灯)激活后的发动机运行时间                           $    $  min      $    $  ANS040.BYTE003  $  y=(x1*256+x2);
  $  091.诊断信息被清除后的时间                                          $    $  min      $    $  ANS041.BYTE003  $  y=(x1*256+x2);
  $  092.车辆燃料类型                                                    $    $           $    $  ANS042.BYTE003  $  if(x1==1) y=@073f;else if(x1==2) y=@0740;else y=@0001;
  $  093.蒸发系统压力                                                    $    $  pa       $    $  ANS043.BYTE003  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  094.发动机出水冷却液温度支持                                        $    $           $    $  ANS044.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  095.散热器出水冷却液温度支持                                        $    $           $    $  ANS044.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  096.发动机出水冷却液温度                                            $    $  ℃       $    $  ANS044.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  097.散热器出水冷却液温度                                            $    $  ℃       $    $  ANS044.BYTE005  $  y=SPRINTF([%d],x1-40);
  $  098.进气温度bank1，传感器1支持                                      $    $           $    $  ANS045.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  099.进气温度bank1，传感器2支持                                      $    $           $    $  ANS045.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  100.进气温度bank1，传感器3支持                                      $    $           $    $  ANS045.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  101.进气温度bank2，传感器1支持                                      $    $           $    $  ANS045.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  102.进气温度bank2，传感器2支持                                      $    $           $    $  ANS045.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  103.进气温度bank2，传感器3支持                                      $    $           $    $  ANS045.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  104.进气温度bank1，传感器1                                          $    $  ℃       $    $  ANS045.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  105.进气温度bank1，传感器2                                          $    $  ℃       $    $  ANS045.BYTE005  $  y=SPRINTF([%d],x1-40);
  $  106.进气温度bank1，传感器3                                          $    $  ℃       $    $  ANS045.BYTE006  $  y=SPRINTF([%d],x1-40);
  $  107.进气温度bank2，传感器1                                          $    $  ℃       $    $  ANS045.BYTE007  $  y=SPRINTF([%d],x1-40);
  $  108.进气温度bank2，传感器2                                          $    $  ℃       $    $  ANS045.BYTE008  $  y=SPRINTF([%d],x1-40);
  $  109.进气温度bank2，传感器6                                          $    $  ℃       $    $  ANS045.BYTE009  $  y=SPRINTF([%d],x1-40);
  $  110.EGR A目标占空比控制/位置数据支持                                $    $           $    $  ANS046.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  111.EGR A实际占空比控制/位置数据支持                                $    $           $    $  ANS046.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  112.EGR A错误数据支持                                               $    $           $    $  ANS046.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  113.EGR B目标占空比控制/位置数据支持                                $    $           $    $  ANS046.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  114.EGR B实际占空比控制/位置数据支持                                $    $           $    $  ANS046.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  115.EGR B错误数据支持                                               $    $           $    $  ANS046.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  116.EGR A目标占空比/位置（1）                                       $    $  %        $    $  ANS046.BYTE004  $  y=SPRINTF([%.2f],x1/255);
  $  117.EGR A实际占空比/位置（1）                                       $    $  %        $    $  ANS046.BYTE005  $  y=SPRINTF([%.2f],x1/255);
  $  118.EGR A错误（1）                                                  $    $  %        $    $  ANS046.BYTE006  $  y=SPRINTF([%.2f],x1/128-100);
  $  119.EGR A目标占空比/位置（2）                                       $    $  %        $    $  ANS046.BYTE007  $  y=SPRINTF([%.2f],x1/255);
  $  120.EGR A实际占空比/位置（2）                                       $    $  %        $    $  ANS046.BYTE008  $  y=SPRINTF([%.2f],x1/255);
  $  121.EGR A错误（2）                                                  $    $  %        $    $  ANS046.BYTE009  $  y=SPRINTF([%.2f],x1/128-100);
  $  122.EGR(废气再循环)温度传感器A支持（bank1，sensor1）                $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  123.EGR(废气再循环)温度传感器C支持（bank1，sensor2）                $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  124.EGR(废气再循环)温度传感器B支持（bank2，sensor1）                $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  125.EGR(废气再循环)温度传感器D支持（bank2，sensor2）                $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  126.EGR(废气再循环)温度传感器A大量程支持（bank1，sensor1）          $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  127.EGR(废气再循环)温度传感器C大量程支持（bank1，sensor2）          $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  128.EGR(废气再循环)温度传感器B大量程支持（bank2，sensor1）          $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  129.EGR(废气再循环)温度传感器D大量程支持（bank2，sensor2）          $    $           $    $  ANS047.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  130.EGR(废气再循环)温度传感器A（bank1，sensor1）                    $    $  ℃       $    $  ANS047.BYTE004  $  y=SPRINTF([%d],x1*4-40);
  $  131.EGR(废气再循环)温度传感器C（bank1，sensor2）                    $    $  ℃       $    $  ANS047.BYTE005  $  y=SPRINTF([%d],x1*4-40);
  $  132.EGR(废气再循环)温度传感器B（bank2，sensor1）                    $    $  ℃       $    $  ANS047.BYTE006  $  y=SPRINTF([%d],x1*4-40);
  $  133.EGR(废气再循环)温度传感器D（bank2，sensor2）                    $    $  ℃       $    $  ANS047.BYTE007  $  y=SPRINTF([%d],x1*4-40);
  $  134.PF Bank1压差支持                                                $    $           $    $  ANS048.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  135.PF Bank1入口压力支持                                            $    $           $    $  ANS048.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  136.PF Bank1出口压力支持                                            $    $           $    $  ANS048.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  137.PF Bank1压差                                                    $    $  kpa      $    $  ANS048.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)*0.01);
  $  138.PF Bank1入口压力                                                $    $  kpa      $    $  ANS048.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)*0.01);
  $  139.PF Bank1出口压力                                                $    $  kpa      $    $  ANS048.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)*0.01);
  $  140.PF Bank1入口温度支持                                            $    $           $    $  ANS049.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  141.PF Bank1出口温度支持                                            $    $           $    $  ANS049.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  142.PF Bank2入口温度支持                                            $    $           $    $  ANS049.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  143.PF Bank2入口温度支持                                            $    $           $    $  ANS049.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  144.PF Bank2出口温度支持                                            $    $           $    $  ANS049.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  145.PF Bank1入口温度                                                $    $  ℃       $    $  ANS049.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)*0.1-40);
  $  146.PF Bank1出口温度                                                $    $  ℃       $    $  ANS049.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)*0.1-40);
  $  147.PF Bank2入口温度                                                $    $  ℃       $    $  ANS049.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)*0.1-40);
  $  148.PF Bank2出口温度                                                $    $  ℃       $    $  ANS049.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)*0.1-40);
  $  149.进气歧管绝对压力A支持                                           $    $           $    $  ANS050.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  150.进气歧管绝对压力B支持                                           $    $           $    $  ANS050.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  151.进气歧管绝对压力A                                               $    $  kpa      $    $  ANS050.BYTE004  $  y=SPRINTF([%.5f],(x1*256+x2)*0.03125);
  $  152.进气歧管绝对压力B                                               $    $  kpa      $    $  ANS050.BYTE004  $  y=SPRINTF([%.5f],(x1*256+x2)*0.03125);
  $  153.颗粒捕集器再生状态支持                                          $    $           $    $  ANS051.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  154.颗粒捕集器再生类型支持                                          $    $           $    $  ANS051.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  155.NOx 吸附再生状态支持                                            $    $           $    $  ANS051.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  156.NOx 吸附脱硫状态支持                                            $    $           $    $  ANS051.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  157.颗粒捕集器再生常规触发支持                                      $    $           $    $  ANS051.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  158.颗粒捕集器平均再生时间支持                                      $    $           $    $  ANS051.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  159.颗粒捕集器平均再生距离支持                                      $    $           $    $  ANS051.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  160.颗粒捕集器再生状态                                              $    $           $    $  ANS051.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  161.颗粒捕集器再生类型                                              $    $           $    $  ANS051.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  162.NOx 吸附再生状态                                                $    $           $    $  ANS051.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  163.NOx 吸附脱硫状态                                                $    $           $    $  ANS051.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  164.颗粒捕集器再生常规触发                                          $    $  %        $    $  ANS051.BYTE005  $  y=SPRINTF([%.2f],x1/255);
  $  165.颗粒捕集器平均再生时间                                          $    $  min      $    $  ANS051.BYTE006  $  y=(x1*256+x2);
  $  166.颗粒捕集器平均再生距离                                          $    $  km       $    $  ANS051.BYTE008  $  y=(x1*256+x2);
  $  167.车辆总里程（仪表显示值）                                        $    $  km       $    $  ANS052.BYTE003  $  y=SPRINTF([%.1f],(x1*256*256*256+x2*256*256+x3*256+x4)*0.1);
  $  168.存储的确认故障数量（故障信息清除后的监测状态）                  $    $           $    $  ANS053.BYTE003  $  y=x1&0x7F;
  $  169.模块指示的MIL(故障指示灯)状态（故障信息清除后的监测状态）       $    $           $    $  ANS053.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  170.失火监测支持（故障信息清除后的监测状态）                        $    $           $    $  ANS053.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  171.燃油系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  172.综合部件监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  173.失火监测准备（故障信息清除后的监测状态）                        $    $           $    $  ANS053.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  174.燃油系统监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  175.综合部件监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  176.催化器监测支持（故障信息清除后的监测状态）                      $    $           $    $  ANS053.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  177.加热型催化器监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS053.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  178.蒸发系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  179.二次空气系统监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS053.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  180.氧传感器监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  181.氧传感器加热监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS053.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  182.EGR/VVT监测支持（故障信息清除后的监测状态）                     $    $           $    $  ANS053.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  183.催化器监测完成（故障信息清除后的监测状态）                      $    $           $    $  ANS053.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  184.加热型催化器监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS053.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  185.蒸发系统监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  186.二次空气系统监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS053.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  187.氧传感器监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS053.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  188.氧传感器加热监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS053.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  189.EGR/VVT监测完成（故障信息清除后的监测状态）                     $    $           $    $  ANS053.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  190.造成冻结帧存储的故障代码                                        $    $           $    $  ANS054.BYTE003  $  HEX(x1,x2);
  $  191.燃油系统1状态                                                   $    $           $    $  ANS055.BYTE003  $  if(x1==0) y=@01f9;else y=@0001;if(x1==1) y=@0756;else y=@0001;if(x1==1) y=@0757;else y=@0001;if(x1==1) y=@0758;else y=@0001;if(x1==1) y=@0759;else y=@0001;if(x1==1) y=@075a;else y=@0001;
  $  192.燃油系统2状态                                                   $    $           $    $  ANS055.BYTE004  $  if(x1==0) y=@01f9;else y=@0001;if(x1==1) y=@0756;else y=@0001;if(x1==1) y=@0757;else y=@0001;if(x1==1) y=@0758;else y=@0001;if(x1==1) y=@0759;else y=@0001;if(x1==1) y=@075a;else y=@0001;
  $  193.计算负载值                                                      $    $  %        $    $  ANS056.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  194.发动机出水冷却液温度                                            $    $  ℃       $    $  ANS057.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  195.短期燃油修正-bank1                                              $    $  %        $    $  ANS058.BYTE003  $  y=SPRINTF([%.2f],x1/128-100);
  $  196.长期燃油修正-bank1                                              $    $  %        $    $  ANS059.BYTE003  $  y=SPRINTF([%.2f],x1/128-100);
  $  197.长期燃油修正-bank1                                              $    $  kpa      $    $  ANS060.BYTE003  $  y=SPRINTF([%d],x1*3);
  $  198.进气歧管绝对压力                                                $    $  kpa      $    $  ANS061.BYTE003  $  y=x1;
  $  199.发动机转速                                                      $    $  rpm      $    $  ANS062.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.25);
  $  200.车速                                                            $    $  Km/h     $    $  ANS063.BYTE003  $  y=x1;
  $  201.1缸点火提前角                                                   $    $  °       $    $  ANS064.BYTE003  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  202.进气温度                                                        $    $  ℃       $    $  ANS065.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  203.空气流量                                                        $    $  g/s      $    $  ANS066.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.01);
  $  204.节气门绝对位置                                                  $    $  %        $    $  ANS067.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  205.氧传感器位置 Bank 1-Sensor 1                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  206.氧传感器位置 Bank 1-Sensor 2                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  207.氧传感器位置 Bank 1-Sensor 3                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  208.氧传感器位置 Bank 1-Sensor 4                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  209.氧传感器位置 Bank 2-Sensor 1                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  210.氧传感器位置 Bank 2-Sensor 2                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  211.氧传感器位置 Bank 2-Sensor 3                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  212.氧传感器位置 Bank 2-Sensor 4                                    $    $           $    $  ANS068.BYTE003  $  if(x1==0) y=@026a;else if(x1==1) y=@0269;else y=@0001;
  $  213.开关氧传感器输出电压 Bank 1-Sensor 2                            $    $  V        $    $  ANS069.BYTE003  $  y=SPRINTF([%.3f],x1*0.005);
  $  214.短期燃油修正(Bx-Sy) Bank 1-Sensor 2                             $    $  %        $    $  ANS069.BYTE004  $  y=SPRINTF([%.2f],x1/128-100);
  $  215.OBD(车载诊断系统)类型定义                                       $    $           $    $  ANS070.BYTE003  $  if(x1==1) y=@064d;else if(x1==2) y=@0741;else if(x1==3) y=@0742;else if(x1==4) y=@0743;else if(x1==5) y=@0744;else if(x1==6) y=@0745;else if(x1==7) y=@0746;else if(x1==8) y=@0747;else if(x1==9) y=@0748;else if(x1==10) y=@0749;else if(x1==11) y=@074a;else if(x1==12) y=@074b;else if(x1==13) y=@074c;else if(x1==14) y=@065a;else if(x1==15) y=@065b;else if(x1==16) y=@065c;else if(x1==17) y=@074d;else if(x1==18) y=@065e;else if(x1==19) y=@065f;else if(x1==20) y=@0660;else if(x1==21) y=@0661;else if(x1==22) y=@065c;else if(x1==23) y=@074e;else if(x1==24) y=@074f;else if(x1==25) y=@0750;else if(x1==26) y=@0751;else if(x1==27) y=@065c;else if(x1==28) y=@0666;else if(x1==29) y=@0667;else if(x1==30) y=@0668;else if(x1==31) y=@0669;else if(x1==32) y=@066a;else if(x1==33) y=@066b;else if(x1==34) y=@066c;else if(x1==35) y=@066d;else if(x1==36) y=@066e;else if(x1==37) y=@066f;else if(x1==38) y=@0670;else if(x1==39) y=@0671;else if(x1==40) y=@0672;else if(x1==41) y=@0673;else if(x1==42) y=@0674;else if(x1==43) y=@0675;else if((x1>=44)&&(x1<=250)) y=@0752;else if((x1>=250)&&(x1<=255)) y=@0753;else y=@0001;
  $  216.当前驾驶循环发动机运行时间                                      $    $  s        $    $  ANS071.BYTE003  $  y=(x1*256+x2);
  $  217.油轨压力                                                        $    $  kpa      $    $  ANS072.BYTE003  $  y=SPRINTF([%d],(x1*256+x2)*10);
  $  218.碳罐电磁阀占空比控制                                            $    $  %        $    $  ANS073.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  219.油箱燃油量                                                      $    $  %        $    $  ANS074.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  220.故障码被清除后的暖机次数                                        $    $  次       $    $  ANS075.BYTE003  $  y=x1;
  $  221.故障码被清除后的行驶里程                                        $    $  km       $    $  ANS076.BYTE003  $  y=(x1*256+x2);
  $  222.大气压力                                                        $    $  kpa      $    $  ANS077.BYTE003  $  y=(x1*256+x2);
  $  223.线氧λ值 Bank 1 - Sensor 1                                      $    $           $    $  ANS078.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.0000305);
  $  224.线氧泵电流 Bank 1 - Sensor 1                                    $    $  mA       $    $  ANS078.BYTE005  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.00390625);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.00390625);
  $  225.失火监测支持（当前驾驶循环的监测状态）                          $    $           $    $  ANS079.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  226.燃油系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  227.综合部件监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  228.失火监测准备（当前驾驶循环的监测状态）                          $    $           $    $  ANS079.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  229.燃油系统监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  230.综合部件监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  231.催化器监测支持（当前驾驶循环的监测状态）                        $    $           $    $  ANS079.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  232.加热型催化器监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS079.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  233.蒸发系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  234.二次空气系统监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS079.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  235.氧传感器监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  236.氧传感器加热监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS079.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  237.EGR/VVT监测支持（当前驾驶循环的监测状态）                       $    $           $    $  ANS079.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  238.催化器监测完成（当前驾驶循环的监测状态）                        $    $           $    $  ANS079.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  239.加热型催化器监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS079.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  240.蒸发系统监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  241.二次空气系统监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS079.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  242.氧传感器监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS079.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  243.氧传感器加热监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS079.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  244.EGR/VVT监测完成（当前驾驶循环的监测状态）                       $    $           $    $  ANS079.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  245.控制模块电压                                                    $    $  V        $    $  ANS080.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  246.节气门相位位置                                                  $    $  %        $    $  ANS081.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)/255);
  $  247.油门踏板位置D                                                   $    $  %        $    $  ANS082.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  248.油门踏板位置E                                                   $    $  %        $    $  ANS083.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  249.节气门电机占空比                                                $    $  %        $    $  ANS084.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  250.过量空气系数λ                                                  $    $           $    $  ANS085.BYTE005  $  y=SPRINTF([%.6f],(x1*256+x2)*0.000030517578);
  $  251.前氧泵电流                                                      $    $  μA      $    $  ANS085.BYTE014  $  y=SPRINTF([%.2f],(x1*256+x2)*0.01);
  $  252.前氧传感器稀转浓响应时间                                        $    $  s        $    $  ANS085.BYTE023  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  253.后氧传感器                                                      $    $  V        $    $  ANS086.BYTE005  $  y=SPRINTF([%.2f],(x1*256+x2)*0.001);
  $  254.后氧传感器浓转稀响应时间                                        $    $  s        $    $  ANS086.BYTE014  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  255.后氧传感器稀转浓响应时间                                        $    $  s        $    $  ANS086.BYTE023  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  256.催化器                                                          $    $  s        $    $  ANS087.BYTE005  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  257.进气VVT（1）                                                    $    $  °       $    $  ANS088.BYTE005  $  y=SPRINTF([%.2f],(x1*256+x2)*0.0001);
  $  258.进气VVT（2）                                                    $    $  °       $    $  ANS088.BYTE014  $  y=SPRINTF([%.2f],(x1*256+x2)*0.0001);
  $  259.排气VVT（1）                                                    $    $  °       $    $  ANS088.BYTE023  $  y=SPRINTF([%.2f],(x1*256+x2)*0.0001);
  $  260.排气VVT（2）                                                    $    $  °       $    $  ANS088.BYTE032  $  y=SPRINTF([%.2f],(x1*256+x2)*0.0001);
  $  261.蒸发系统（DTESK方案）                                           $    $  s        $    $  ANS089.BYTE005  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  262.DMTL(燃油箱泄漏诊断模块)气泵电流                                $    $  mA       $    $  ANS089.BYTE014  $  y=SPRINTF([%.2f],(x1*256+x2)*0.00390625);
  $  263.蒸发系统（DMTL(燃油箱泄漏诊断模块)方案）                        $    $  s        $    $  ANS089.BYTE023  $  y=SPRINTF([%.2f],(x1*256+x2)*0.001);
  $  264.燃油系统                                                        $    $  kpa      $    $  ANS090.BYTE005  $  y=(x1*256+x2);
  $  265.燃油系统                                                        $    $           $    $  ANS091.BYTE005  $  y=(x1*256+x2);
  $  266.一缸累计失火计数                                                $    $           $    $  ANS092.BYTE005  $  y=(x1*256+x2);
  $  267.一缸当前驾驶循环失火计数                                        $    $           $    $  ANS092.BYTE014  $  y=(x1*256+x2);
  $  268.二缸累计失火计数                                                $    $           $    $  ANS093.BYTE005  $  y=(x1*256+x2);
  $  269.二缸当前驾驶循环失火计数                                        $    $           $    $  ANS093.BYTE014  $  y=(x1*256+x2);
  $  270.三缸累计失火计数                                                $    $           $    $  ANS094.BYTE005  $  y=(x1*256+x2);
  $  271.三缸当前驾驶循环失火计数                                        $    $           $    $  ANS094.BYTE014  $  y=(x1*256+x2);
  $  272.四缸累计失火计数                                                $    $           $    $  ANS095.BYTE005  $  y=(x1*256+x2);
  $  273.四缸当前驾驶循环失火计数                                        $    $           $    $  ANS095.BYTE014  $  y=(x1*256+x2);
  $  274.颗粒捕集器前后压差                                              $    $           $    $  ANS096.BYTE005  $  y=SPRINTF([%.2f],(x1*256+x2)*0.01);
  $  275.车辆识别码                                                      $    $           $    $  ANS097.BYTE003  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $  276.标定识别符                                                      $    $           $    $  ANS098.BYTE003  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $  277.校验码                                                          $    $           $    $  ANS099.BYTE003  $  HEX(x1,x2,x3,x4);
  $  278.满足OBD(车载诊断系统)监测条件计数                               $    $  cnts     $    $  ANS100.BYTE003  $  y=(x1*256+x2);
  $  279.动力系统激活周期计数                                            $    $  cnts     $    $  ANS100.BYTE005  $  y=(x1*256+x2);
  $  280.Bank1催化器监测完成计数                                         $    $  cnts     $    $  ANS100.BYTE007  $  y=(x1*256+x2);
  $  281.Bank1催化器满足条件计数                                         $    $  cnts     $    $  ANS100.BYTE009  $  y=(x1*256+x2);
  $  282.Bank2催化器监测完成计数                                         $    $  cnts     $    $  ANS100.BYTE011  $  y=(x1*256+x2);
  $  283.Bank2催化器满足条件计数                                         $    $  cnts     $    $  ANS100.BYTE013  $  y=(x1*256+x2);
  $  284.Bank1前氧传感器监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE015  $  y=(x1*256+x2);
  $  285.Bank1前氧传感器满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE017  $  y=(x1*256+x2);
  $  286.Bank2前氧传感器监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE019  $  y=(x1*256+x2);
  $  287.Bank2前氧传感器满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE021  $  y=(x1*256+x2);
  $  288.EGR/VVT监测完成计数                                             $    $  cnts     $    $  ANS100.BYTE023  $  y=(x1*256+x2);
  $  289.EGR/VVT满足条件计数                                             $    $  cnts     $    $  ANS100.BYTE025  $  y=(x1*256+x2);
  $  290.二次空气监测完成计数                                            $    $  cnts     $    $  ANS100.BYTE027  $  y=(x1*256+x2);
  $  291.二次空气满足条件计数                                            $    $  cnts     $    $  ANS100.BYTE029  $  y=(x1*256+x2);
  $  292.蒸发系统监测完成计数                                            $    $  cnts     $    $  ANS100.BYTE031  $  y=(x1*256+x2);
  $  293.蒸发系统满足条件计数                                            $    $  cnts     $    $  ANS100.BYTE033  $  y=(x1*256+x2);
  $  294.Bank1后氧传感器监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE035  $  y=(x1*256+x2);
  $  295.Bank1后氧传感器满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE037  $  y=(x1*256+x2);
  $  296.Bank2后氧传感器监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE039  $  y=(x1*256+x2);
  $  297.Bank2后氧传感器满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE041  $  y=(x1*256+x2);
  $  298.Bank1空燃比不均监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE043  $  y=(x1*256+x2);
  $  299.Bank1空燃比不均满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE045  $  y=(x1*256+x2);
  $  300.Bank2空燃比不均监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE047  $  y=(x1*256+x2);
  $  301.Bank2空燃比不均满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE049  $  y=(x1*256+x2);
  $  302.Bank1颗粒捕集器监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE051  $  y=(x1*256+x2);
  $  303.Bank1颗粒捕集器满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE053  $  y=(x1*256+x2);
  $  304.Bank2颗粒捕集器监测完成计数                                     $    $  cnts     $    $  ANS100.BYTE055  $  y=(x1*256+x2);
  $  305.Bank2颗粒捕集器满足条件计数                                     $    $  cnts     $    $  ANS100.BYTE057  $  y=(x1*256+x2);
  $  306.ECU名称                                                         $    $           $    $  ANS101.BYTE003  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $  307.发动机点火周期                                                  $    $  cnts     $    $  ANS102.BYTE003  $  y=(x1*256+x2);

  $)  02.IUPR
  $  02.IUPR
  $  REQ000:7E0 03 22 F1 04 00 00 00 00       $  ANS000:7E8 03 22 F1 04 00 00 00 00

  $  000.一般监测条件满足次数                                 $    $  次     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.点火循环次数                                         $    $  次     $    $  ANS000.BYTE006  $  y=(x1*256+x2);
  $  002.三元催化器监测完成次数                               $    $  次     $    $  ANS000.BYTE008  $  y=(x1*256+x2);
  $  003.三元催化器监测条件满足次数                           $    $  次     $    $  ANS000.BYTE010  $  y=(x1*256+x2);
  $  004.前氧传感器监测完成次数                               $    $  次     $    $  ANS000.BYTE012  $  y=(x1*256+x2);
  $  005.前氧传感器监测条件满足次数                           $    $  次     $    $  ANS000.BYTE014  $  y=(x1*256+x2);
  $  006.VVT(可变气门正时)监测完成次数                        $    $  次     $    $  ANS000.BYTE016  $  y=(x1*256+x2);
  $  007.VVT(可变气门正时)监测条件满足次数                    $    $  次     $    $  ANS000.BYTE018  $  y=(x1*256+x2);
  $  008.EVAP(燃油蒸发系统)燃油蒸发系统监测完成次数           $    $  次     $    $  ANS000.BYTE020  $  y=(x1*256+x2);
  $  009.EVAP(燃油蒸发系统)燃油蒸发系统监测条件满足次数       $    $  次     $    $  ANS000.BYTE022  $  y=(x1*256+x2);
  $  010.后氧传感器监测完成次数                               $    $  次     $    $  ANS000.BYTE024  $  y=(x1*256+x2);
  $  011.后氧传感器监测条件满足次数                           $    $  次     $    $  ANS000.BYTE026  $  y=(x1*256+x2);
  $  012.增压系统监测完成次数                                 $    $  次     $    $  ANS000.BYTE028  $  y=(x1*256+x2);
  $  013.增压系统监测条件满足次数                             $    $  次     $    $  ANS000.BYTE030  $  y=(x1*256+x2);
  $  014.燃油系统监测完成次数                                 $    $  次     $    $  ANS000.BYTE032  $  y=(x1*256+x2);
  $  015.燃油系统监测条件满足次数                             $    $  次     $    $  ANS000.BYTE034  $  y=(x1*256+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
