
    车型ID：3bed

    模拟：协议模拟-->3bed

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~78A

进入命令:

  $~  REQ000:782 02 10 01 00 00 00 00 00       $~  ANS000:78A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:782 02 3E 80 00 00 00 00 00       $!  ANS000:78A 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:782 03 19 02 FF 00 00 00 00       $#  ANS000:78A 03 19 02 FF 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/96000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:782 04 14 FF FF FF 00 00 00       $$  ANS000:78A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:782 03 22 F1 93 00 00 00 00       $%  ANS000:78A 03 22 F1 93 00 00 00 00
  $%  REQ001:782 03 22 F1 94 00 00 00 00       $%  ANS001:78A 03 22 F1 94 00 00 00 00
  $%  REQ002:782 03 22 F1 95 00 00 00 00       $%  ANS002:78A 03 22 F1 95 00 00 00 00
  $%  REQ003:782 03 22 F1 80 00 00 00 00       $%  ANS003:78A 03 22 F1 80 00 00 00 00

  $%  000:硬件版本:                           $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:                           $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:                           $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:                           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:                           $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:                           $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:引导程序软件版本号/日期(年):        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02d%s%02d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  007:软件版本:                           $%    $%  ANS003.BYTE007  $%  y=SPRINTF([%d.%d.%d.],x1,x2,x3);
  $%  008:日期:                               $%    $%  ANS003.BYTE010  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:782 03 22 20 01 00 00 00 00       $  ANS000:78A 03 22 20 01 00 00 00 00
  $  REQ001:782 03 22 20 02 00 00 00 00       $  ANS001:78A 03 22 20 02 00 00 00 00
  $  REQ002:782 03 22 20 03 00 00 00 00       $  ANS002:78A 03 22 20 03 00 00 00 00
  $  REQ003:782 03 22 20 04 00 00 00 00       $  ANS003:78A 03 22 20 04 00 00 00 00
  $  REQ004:782 03 22 20 05 00 00 00 00       $  ANS004:78A 03 22 20 05 00 00 00 00
  $  REQ005:782 03 22 20 43 00 00 00 00       $  ANS005:78A 03 22 20 43 00 00 00 00
  $  REQ006:782 03 22 FD 43 00 00 00 00       $  ANS006:78A 03 22 FD 43 00 00 00 00

  $  000.左前轮速                        $    $  km/h     $    $  ANS000.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  001.右前轮速                        $    $  km/h     $    $  ANS000.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  002.左后轮速                        $    $  km/h     $    $  ANS000.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  003.右后轮速                        $    $  km/h     $    $  ANS000.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  004.URV电压                         $    $  V        $    $  ANS001.BYTE004  $  y=SPRINTF([%.2f],x1*0.08);
  $  005.ECU电压                         $    $  V        $    $  ANS001.BYTE005  $  y=SPRINTF([%.2f],x1*0.08);
  $  006.制动踏板状态                    $    $           $    $  ANS002.BYTE004  $  if(x1&0x01) y=@040c;else y=@040d;
  $  007.左前进油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x01) y=@0400;else y=@0401;
  $  008.左前出油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x02) y=@0400;else y=@0401;
  $  009.右前进油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x04) y=@0400;else y=@0401;
  $  010.右前出油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x08) y=@0400;else y=@0401;
  $  011.左后进油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x10) y=@0400;else y=@0401;
  $  012.左后出油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x20) y=@0400;else y=@0401;
  $  013.右后进油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x40) y=@0400;else y=@0401;
  $  014.右后出油阀                      $    $           $    $  ANS002.BYTE005  $  if(x1&0x80) y=@0400;else y=@0401;
  $  015.开关阀1                         $    $           $    $  ANS002.BYTE006  $  if(x1&0x01) y=@0400;else y=@0401;
  $  016.开关阀2                         $    $           $    $  ANS002.BYTE006  $  if(x1&0x02) y=@0400;else y=@0401;
  $  017.限制阀1                         $    $           $    $  ANS002.BYTE006  $  if(x1&0x04) y=@0400;else y=@0401;
  $  018.限制阀2                         $    $           $    $  ANS002.BYTE006  $  if(x1&0x08) y=@0400;else y=@0401;
  $  019.双向阀                          $    $           $    $  ANS002.BYTE006  $  if(x1&0x10) y=@0400;else y=@0401;
  $  020.加注状态                        $    $           $    $  ANS003.BYTE004  $  switxh(x1)0x00: y=@0409;0xAA: y=@054b;0xEE: y=@054c;default: y=@0157;
  $  021.下线检测状态                    $    $           $    $  ANS004.BYTE004  $  switxh(x1)0x00: y=@0406;0xAA: y=@0407;0xEE: y=@0408;default: y=@0157;
  $  022.禁用限速检测                    $    $           $    $  ANS005.BYTE004  $  switxh(x1)0x00: y=@0404;0x01: y=@0405;default: y=@0001;
  $  023.IPB(智能集成制动)退出模式       $    $           $    $  ANS006.BYTE004  $  if(x1&0x01) y=@0549;else y=@054a;

  $)  01.OBD(车载诊断系统)信息
  $  01.OBD(车载诊断系统)信息
  $  REQ000:782 02 01 01 00 00 00 00 00       $  ANS000:78A 02 01 01 00 00 00 00 00
  $  REQ001:782 02 01 05 00 00 00 00 00       $  ANS001:78A 02 01 05 00 00 00 00 00
  $  REQ002:782 02 01 0C 00 00 00 00 00       $  ANS002:78A 02 01 0C 00 00 00 00 00
  $  REQ003:782 02 01 0D 00 00 00 00 00       $  ANS003:78A 02 01 0D 00 00 00 00 00
  $  REQ004:782 02 01 1C 00 00 00 00 00       $  ANS004:78A 02 01 1C 00 00 00 00 00
  $  REQ005:782 02 01 41 00 00 00 00 00       $  ANS005:78A 02 01 41 00 00 00 00 00
  $  REQ006:782 02 01 42 00 00 00 00 00       $  ANS006:78A 02 01 42 00 00 00 00 00
  $  REQ007:782 02 01 49 00 00 00 00 00       $  ANS007:78A 02 01 49 00 00 00 00 00
  $  REQ008:782 02 01 4A 00 00 00 00 00       $  ANS008:78A 02 01 4A 00 00 00 00 00
  $  REQ009:782 02 02 02 00 00 00 00 00       $  ANS009:78A 02 02 02 00 00 00 00 00
  $  REQ010:782 02 02 05 00 00 00 00 00       $  ANS010:78A 02 02 05 00 00 00 00 00
  $  REQ011:782 02 02 0C 00 00 00 00 00       $  ANS011:78A 02 02 0C 00 00 00 00 00
  $  REQ012:782 02 02 0D 00 00 00 00 00       $  ANS012:78A 02 02 0D 00 00 00 00 00
  $  REQ013:782 02 02 41 00 00 00 00 00       $  ANS013:78A 02 02 41 00 00 00 00 00
  $  REQ014:782 02 02 42 00 00 00 00 00       $  ANS014:78A 02 02 42 00 00 00 00 00
  $  REQ015:782 02 02 49 00 00 00 00 00       $  ANS015:78A 02 02 49 00 00 00 00 00
  $  REQ016:782 02 02 4A 00 00 00 00 00       $  ANS016:78A 02 02 4A 00 00 00 00 00
  $  REQ017:782 02 09 04 00 00 00 00 00       $  ANS017:78A 02 09 04 00 00 00 00 00
  $  REQ018:782 02 09 06 00 00 00 00 00       $  ANS018:78A 02 09 06 00 00 00 00 00
  $  REQ019:782 02 09 0A 00 00 00 00 00       $  ANS019:78A 02 09 0A 00 00 00 00 00

  $  000.存储的确认故障数量（故障信息清除后的监测状态）                  $    $           $    $  ANS000.BYTE003  $  y=x1&0x7F;
  $  001.模块指示的MIL(故障指示灯)状态（故障信息清除后的监测状态）       $    $           $    $  ANS000.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  002.失火监测支持（故障信息清除后的监测状态）                        $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  003.燃油系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  004.综合部件监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  005.失火监测准备（故障信息清除后的监测状态）                        $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  006.燃油系统监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  007.综合部件监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  008.催化器监测支持（故障信息清除后的监测状态）                      $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  009.加热型催化器监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  010.蒸发系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  011.二次空气系统监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  012.氧传感器监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  013.氧传感器加热监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  014.EGR/VVT监测支持（故障信息清除后的监测状态）                     $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  015.催化器监测完成（故障信息清除后的监测状态）                      $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  016.加热型催化器监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  017.蒸发系统监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  018.二次空气系统监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  019.氧传感器监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  020.氧传感器加热监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  021.EGR/VVT监测完成（故障信息清除后的监测状态）                     $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  022.发动机出水冷却液温度                                            $    $  ℃       $    $  ANS001.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  023.发动机转速                                                      $    $  rpm      $    $  ANS002.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.25);
  $  024.车速                                                            $    $  Km/h     $    $  ANS003.BYTE003  $  y=x1;
  $  025.OBD(车载诊断系统)类型定义                                       $    $           $    $  ANS004.BYTE003  $  if(x1==1) y=@064d;else if(x1==2) y=@064e;else if(x1==3) y=@064f;else if(x1==4) y=@0650;else if(x1==5) y=@0651;else if(x1==6) y=@0652;else if(x1==7) y=@0653;else if(x1==8) y=@0654;else if(x1==9) y=@0655;else if(x1==10) y=@0656;else if(x1==11) y=@0657;else if(x1==12) y=@0658;else if(x1==13) y=@0659;else if(x1==14) y=@065a;else if(x1==15) y=@065b;else if(x1==16) y=@065c;else if(x1==17) y=@065d;else if(x1==18) y=@065e;else if(x1==19) y=@065f;else if(x1==20) y=@0660;else if(x1==21) y=@0661;else if(x1==22) y=@065c;else if(x1==23) y=@0662;else if(x1==24) y=@0663;else if(x1==25) y=@0664;else if(x1==26) y=@0665;else if(x1==27) y=@065c;else if(x1==28) y=@0666;else if(x1==29) y=@0667;else if(x1==30) y=@0668;else if(x1==31) y=@0669;else if(x1==32) y=@066a;else if(x1==33) y=@066b;else if(x1==34) y=@066c;else if(x1==35) y=@066d;else if(x1==36) y=@066e;else if(x1==37) y=@066f;else if(x1==38) y=@0670;else if(x1==39) y=@0671;else if(x1==40) y=@0672;else if(x1==41) y=@0673;else if(x1==42) y=@0674;else if(x1==43) y=@0675;else if((x1>=44)&&(x1<=250)) y=@0676;else if((x1>=250)&&(x1<=255)) y=@0677;else y=@0001;
  $  026.失火监测支持（当前驾驶循环的监测状态）                          $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  027.燃油系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  028.综合部件监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  029.失火监测准备（当前驾驶循环的监测状态）                          $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  030.燃油系统监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  031.综合部件监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  032.催化器监测支持（当前驾驶循环的监测状态）                        $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  033.加热型催化器监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  034.蒸发系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  035.二次空气系统监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  036.氧传感器监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  037.氧传感器加热监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  038.EGR/VVT监测支持（当前驾驶循环的监测状态）                       $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  039.催化器监测完成（当前驾驶循环的监测状态）                        $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  040.加热型催化器监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  041.蒸发系统监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  042.二次空气系统监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  043.氧传感器监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  044.氧传感器加热监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  045.EGR/VVT监测完成（当前驾驶循环的监测状态）                       $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  046.控制模块电压                                                    $    $  V        $    $  ANS006.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  047.油门踏板位置D                                                   $    $  %        $    $  ANS007.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  048.油门踏板位置E                                                   $    $  %        $    $  ANS008.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  049.造成冻结帧存储的故障代码                                        $    $           $    $  ANS009.BYTE003  $  HEX(x1,x2);
  $  050.发动机出水冷却液温度                                            $    $  ℃       $    $  ANS010.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  051.发动机转速                                                      $    $  rpm      $    $  ANS011.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.25);
  $  052.车速                                                            $    $  Km/h     $    $  ANS012.BYTE003  $  y=x1;
  $  053.失火监测支持（当前驾驶循环的监测状态）                          $    $           $    $  ANS013.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  054.燃油系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  055.综合部件监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  056.失火监测准备（当前驾驶循环的监测状态）                          $    $           $    $  ANS013.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  057.燃油系统监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  058.综合部件监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  059.催化器监测支持（当前驾驶循环的监测状态）                        $    $           $    $  ANS013.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  060.加热型催化器监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS013.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  061.蒸发系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  062.二次空气系统监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS013.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  063.氧传感器监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  064.氧传感器加热监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS013.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  065.EGR/VVT监测支持（当前驾驶循环的监测状态）                       $    $           $    $  ANS013.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  066.催化器监测完成（当前驾驶循环的监测状态）                        $    $           $    $  ANS013.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  067.加热型催化器监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS013.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  068.蒸发系统监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  069.二次空气系统监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS013.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  070.氧传感器监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS013.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  071.氧传感器加热监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS013.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  072.EGR/VVT监测完成（当前驾驶循环的监测状态）                       $    $           $    $  ANS013.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  073.控制模块电压                                                    $    $  V        $    $  ANS014.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  074.油门踏板位置D                                                   $    $  %        $    $  ANS015.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  075.油门踏板位置E                                                   $    $  %        $    $  ANS016.BYTE003  $  y=SPRINTF([%.2f],x1/255);
  $  076.标定识别符                                                      $    $           $    $  ANS017.BYTE003  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $  077.校验码                                                          $    $           $    $  ANS018.BYTE003  $  HEX(x1,x2,x3,x4);
  $  078.ECU名称                                                         $    $           $    $  ANS019.BYTE003  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:782 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
