
    车型ID：3bee

    模拟：协议模拟-->3bee

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~728

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:728 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 80 00 00 00 00 00       $!  ANS000:728 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:728 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/97000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:728 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 93 00 00 00 00       $%  ANS000:728 03 22 F1 93 00 00 00 00
  $%  REQ001:720 03 22 F1 94 00 00 00 00       $%  ANS001:728 03 22 F1 94 00 00 00 00
  $%  REQ002:720 03 22 F1 95 00 00 00 00       $%  ANS002:728 03 22 F1 95 00 00 00 00
  $%  REQ003:720 03 22 F1 80 00 00 00 00       $%  ANS003:728 03 22 F1 80 00 00 00 00
  $%  REQ004:720 03 22 FF 94 00 00 00 00       $%  ANS004:728 03 22 FF 94 00 00 00 00
  $%  REQ005:720 03 22 FF 95 00 00 00 00       $%  ANS005:728 03 22 FF 95 00 00 00 00
  $%  REQ006:720 03 22 F1 00 00 00 00 00       $%  ANS006:728 03 22 F1 00 00 00 00 00
  $%  REQ007:720 03 22 F1 01 00 00 00 00       $%  ANS007:728 03 22 F1 01 00 00 00 00
  $%  REQ008:720 03 22 F1 02 00 00 00 00       $%  ANS008:728 03 22 F1 02 00 00 00 00
  $%  REQ009:720 03 22 F1 03 00 00 00 00       $%  ANS009:728 03 22 F1 03 00 00 00 00
  $%  REQ010:720 03 22 F1 04 00 00 00 00       $%  ANS010:728 03 22 F1 04 00 00 00 00
  $%  REQ011:720 03 22 F1 05 00 00 00 00       $%  ANS011:728 03 22 F1 05 00 00 00 00
  $%  REQ012:720 03 22 F1 06 00 00 00 00       $%  ANS012:728 03 22 F1 06 00 00 00 00
  $%  REQ013:720 03 22 F1 07 00 00 00 00       $%  ANS013:728 03 22 F1 07 00 00 00 00

  $%  000:硬件版本:                       $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:                       $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%d.%02d.%02d],x1+2000,x2,x3);
  $%  002:软件编号:                       $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:                       $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:                       $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  005:修改次数:                       $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:引导程序软件版本号/日期:        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  007:软件版本:                       $%    $%  ANS003.BYTE007  $%  y=SPRINTF([%d.%d],(x1%1000-x1%10)/10,x1%10);
  $%  008:次要信息:                       $%    $%  ANS003.BYTE008  $%  HEX(x1);
  $%  009:MCU型号:                        $%    $%  ANS003.BYTE009  $%  HEX(x1);
  $%  010:日期:                           $%    $%  ANS003.BYTE010  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $%  011:参数标定文件软件编码:           $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  012:参数标定文件软件版本:           $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  013:软件日期:                       $%    $%  ANS005.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  014:修改次数:                       $%    $%  ANS005.BYTE009  $%  y=x1;
  $%  015:操作系统软件编号:               $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  016:操作系统软件版本:               $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  017:软件日期:                       $%    $%  ANS007.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  018:修改次数:                       $%    $%  ANS007.BYTE009  $%  y=x1;
  $%  019:操作系统服务软件编号:           $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  020:操作系统服务软件版本:           $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  021:软件日期:                       $%    $%  ANS009.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  022:修改次数:                       $%    $%  ANS009.BYTE009  $%  y=x1;
  $%  023:片内驱动软件编号:               $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  024:片内驱动软件版本:               $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  025:软件日期:                       $%    $%  ANS011.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  026:修改次数:                       $%    $%  ANS011.BYTE009  $%  y=x1;
  $%  027:片外驱动软件编号:               $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  028:片外驱动软件版本:               $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  029:软件日期:                       $%    $%  ANS013.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  030:修改次数:                       $%    $%  ANS013.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.前大灯系统数据流
  $  00.前大灯系统数据流
  $  REQ000:720 03 22 20 02 00 00 00 00       $  ANS000:728 03 22 20 02 00 00 00 00
  $  REQ001:720 03 22 20 03 00 00 00 00       $  ANS001:728 03 22 20 03 00 00 00 00
  $  REQ002:720 03 22 20 04 00 00 00 00       $  ANS002:728 03 22 20 04 00 00 00 00
  $  REQ003:720 03 22 20 05 00 00 00 00       $  ANS003:728 03 22 20 05 00 00 00 00
  $  REQ004:720 03 22 20 07 00 00 00 00       $  ANS004:728 03 22 20 07 00 00 00 00
  $  REQ005:720 03 22 20 08 00 00 00 00       $  ANS005:728 03 22 20 08 00 00 00 00
  $  REQ006:720 03 22 20 09 00 00 00 00       $  ANS006:728 03 22 20 09 00 00 00 00

  $  000.近光灯工作时长             $    $  h     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.远光灯工作时长             $    $  h     $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  002.左前位置灯工作时长         $    $  h     $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.左昼行灯工作时长           $    $  h     $    $  ANS003.BYTE004  $  y=(x1*256+x2);
  $  004.小灯工作时长               $    $  h     $    $  ANS004.BYTE004  $  y=(x1*256+x2);
  $  005.大灯调光次数               $    $  c     $    $  ANS005.BYTE004  $  y=x1;
  $  006.大灯调光电机当前位置       $    $  %     $    $  ANS006.BYTE004  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);

  $)  01.转向告警灯系统数据流
  $  01.转向告警灯系统数据流
  $  REQ000:720 03 22 20 32 00 00 00 00       $  ANS000:728 03 22 20 32 00 00 00 00
  $  REQ001:720 03 22 20 33 00 00 00 00       $  ANS001:728 03 22 20 33 00 00 00 00
  $  REQ002:720 03 22 20 34 00 00 00 00       $  ANS002:728 03 22 20 34 00 00 00 00
  $  REQ003:720 03 22 20 35 00 00 00 00       $  ANS003:728 03 22 20 35 00 00 00 00

  $  000.左前转向灯工作时长       $    $  h     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.左后转向灯工作时长       $    $  h     $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  002.右前转向灯工作时长       $    $  h     $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.右后转向灯工作时长       $    $  h     $    $  ANS003.BYTE004  $  y=(x1*256+x2);

  $)  02.信号灯系统数据流
  $  02.信号灯系统数据流
  $  REQ000:720 03 22 20 92 00 00 00 00       $  ANS000:728 03 22 20 92 00 00 00 00
  $  REQ001:720 03 22 20 93 00 00 00 00       $  ANS001:728 03 22 20 93 00 00 00 00
  $  REQ002:720 03 22 20 94 00 00 00 00       $  ANS002:728 03 22 20 94 00 00 00 00

  $  000.后雾灯工作时长       $    $  h     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.倒车灯工作时长       $    $  h     $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  002.制动灯工作时长       $    $  h     $    $  ANS002.BYTE004  $  y=(x1*256+x2);

  $)  03.供电系统数据流
  $  03.供电系统数据流
  $  REQ000:720 03 22 22 62 00 00 00 00       $  ANS000:728 03 22 22 62 00 00 00 00
  $  REQ001:720 03 22 22 63 00 00 00 00       $  ANS001:728 03 22 22 63 00 00 00 00
  $  REQ002:720 03 22 22 64 00 00 00 00       $  ANS002:728 03 22 22 64 00 00 00 00
  $  REQ003:720 03 22 22 65 00 00 00 00       $  ANS003:728 03 22 22 65 00 00 00 00
  $  REQ004:720 03 22 22 66 00 00 00 00       $  ANS004:728 03 22 22 66 00 00 00 00

  $  000.智能充电状态                 $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@06e7;else if(x1==2) y=@06e8;else y=@0001;
  $  001.智能充电次数                 $    $       $    $  ANS001.BYTE004  $  y=x1;
  $  002.上一次智能充电失败原因       $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@007b;else if(x1==1) y=@06e2;else if(x1==2) y=@06e3;else if(x1==3) y=@06e4;else if(x1==4) y=@06e5;else if(x1==5) y=@06e6;else y=@0001;
  $  003.上一次智能充电失败时间       $    $       $    $  ANS003.BYTE004  $  y=SPRINTF([%d%s%02d%s%02d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  004.上一次退出智能充电原因       $    $       $    $  ANS004.BYTE004  $  if(x1==0) y=@007b;else if(x1==1) y=@06e2;else if(x1==2) y=@06e3;else if(x1==3) y=@06e4;else if(x1==4) y=@06ea;else if(x1==5) y=@06eb;else if(x1==6) y=@06ec;else if(x1==7) y=@06e5;else if(x1==8) y=@06e6;else if(x1==9) y=@06ed;else if(x1==10) y=@06ee;else if(x1==11) y=@06ef;else if(x1==12) y=@06f0;else if(x1==13) y=@06f1;else if(x1==14) y=@06f2;else if(x1==15) y=@06f3;else y=@0001;

  $)  04.喇叭系统数据流
  $  04.喇叭系统数据流
  $  REQ000:720 03 22 22 92 00 00 00 00       $  ANS000:728 03 22 22 92 00 00 00 00
  $  REQ001:720 03 22 22 93 00 00 00 00       $  ANS001:728 03 22 22 93 00 00 00 00

  $  000.喇叭历史工作时间1       $    $       $    $  ANS000.BYTE004  $  y=x1;
  $  001.喇叭历史工作时间2       $    $       $    $  ANS000.BYTE005  $  y=x1;
  $  002.喇叭历史工作时间3       $    $       $    $  ANS000.BYTE006  $  y=x1;
  $  003.喇叭历史工作时间4       $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  004.喇叭历史工作时间5       $    $       $    $  ANS000.BYTE008  $  y=x1;
  $  005.喇叭历史工作时间6       $    $       $    $  ANS000.BYTE009  $  y=x1;
  $  006.喇叭历史工作时间7       $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  007.喇叭历史工作时间8       $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  008.喇叭工作次数            $    $       $    $  ANS001.BYTE004  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);

  $)  05.车窗控制系统数据流
  $  05.车窗控制系统数据流
  $  REQ000:720 03 22 22 C2 00 00 00 00       $  ANS000:728 03 22 22 C2 00 00 00 00
  $  REQ001:720 03 22 22 C3 00 00 00 00       $  ANS001:728 03 22 22 C3 00 00 00 00
  $  REQ002:720 03 22 22 C4 00 00 00 00       $  ANS002:728 03 22 22 C4 00 00 00 00
  $  REQ003:720 03 22 22 C5 00 00 00 00       $  ANS003:728 03 22 22 C5 00 00 00 00
  $  REQ004:720 03 22 22 C6 00 00 00 00       $  ANS004:728 03 22 22 C6 00 00 00 00
  $  REQ005:720 03 22 22 C7 00 00 00 00       $  ANS005:728 03 22 22 C7 00 00 00 00
  $  REQ006:720 03 22 22 C8 00 00 00 00       $  ANS006:728 03 22 22 C8 00 00 00 00
  $  REQ007:720 03 22 22 CC 00 00 00 00       $  ANS007:728 03 22 22 CC 00 00 00 00
  $  REQ008:720 03 22 22 CD 00 00 00 00       $  ANS008:728 03 22 22 CD 00 00 00 00
  $  REQ009:720 03 22 22 CE 00 00 00 00       $  ANS009:728 03 22 22 CE 00 00 00 00
  $  REQ010:720 03 22 22 D2 00 00 00 00       $  ANS010:728 03 22 22 D2 00 00 00 00

  $  000.左前车窗自动上升开关信号       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  001.左前自动下降开关信号           $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  002.左前手动上升开关信号           $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  003.左前车窗手动下降开关信号       $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@06e9;else y=@0001;
  $  004.遥控降窗状态                   $    $       $    $  ANS004.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@06e0;else if(x1==2) y=@06e1;else y=@0001;
  $  005.微动开关升降窗状态             $    $       $    $  ANS005.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else if(x1==2) y=@06df;else y=@0001;
  $  006.左前车窗防夹电机耐久次数       $    $       $    $  ANS006.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=25000)) y=(x1*256+x2);else if((x1*256+x2)==65534) y=@069e;else if((x1*256+x2)==65535) y=@0000;else y=@0001;
  $  007.左后自动下降开关信号           $    $       $    $  ANS007.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  008.左后手动上升开关信号           $    $       $    $  ANS008.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  009.左后车窗手动下降开关信号       $    $       $    $  ANS009.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  010.左后车窗防夹电机耐久次数       $    $       $    $  ANS010.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=25000)) y=(x1*256+x2);else if((x1*256+x2)==65534) y=@069e;else if((x1*256+x2)==65535) y=@0000;else y=@0001;

  $)  06.口盖控制系统数据流
  $  06.口盖控制系统数据流
  $  REQ000:720 03 22 23 92 00 00 00 00       $  ANS000:728 03 22 23 92 00 00 00 00
  $  REQ001:720 03 22 23 93 00 00 00 00       $  ANS001:728 03 22 23 93 00 00 00 00

  $  000.馈电解锁发生的次数             $    $       $    $  ANS000.BYTE004  $  if((x1>=0)&&(x1<=254)) y=x1;else if(x1==255) y=@06de;else y=@0001;
  $  001.上次充电口盖馈电解锁时间       $    $       $    $  ANS001.BYTE004  $  y=SPRINTF([%d%s%02d%s%02d%s%02d%s%02d%s%02d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@02ab,x5,@0212,x6,@0213);

  $)  07.直接式胎压系统数据流
  $  07.直接式胎压系统数据流
  $  REQ000:720 03 22 33 05 00 00 00 00       $  ANS000:728 03 22 33 05 00 00 00 00
  $  REQ001:720 03 22 33 06 00 00 00 00       $  ANS001:728 03 22 33 06 00 00 00 00
  $  REQ002:720 03 22 33 07 00 00 00 00       $  ANS002:728 03 22 33 07 00 00 00 00
  $  REQ003:720 03 22 33 08 00 00 00 00       $  ANS003:728 03 22 33 08 00 00 00 00
  $  REQ004:720 03 22 33 09 00 00 00 00       $  ANS004:728 03 22 33 09 00 00 00 00
  $  REQ005:720 03 22 33 0A 00 00 00 00       $  ANS005:728 03 22 33 0A 00 00 00 00
  $  REQ006:720 03 22 33 0F 00 00 00 00       $  ANS006:728 03 22 33 0F 00 00 00 00
  $  REQ007:720 03 22 33 0E 00 00 00 00       $  ANS007:728 03 22 33 0E 00 00 00 00
  $  REQ008:720 03 22 33 10 00 00 00 00       $  ANS008:728 03 22 33 10 00 00 00 00
  $  REQ009:720 03 22 33 11 00 00 00 00       $  ANS009:728 03 22 33 11 00 00 00 00
  $  REQ010:720 03 22 33 12 00 00 00 00       $  ANS010:728 03 22 33 12 00 00 00 00
  $  REQ011:720 03 22 33 13 00 00 00 00       $  ANS011:728 03 22 33 13 00 00 00 00
  $  REQ012:720 03 22 33 14 00 00 00 00       $  ANS012:728 03 22 33 14 00 00 00 00
  $  REQ013:720 03 22 33 15 00 00 00 00       $  ANS013:728 03 22 33 15 00 00 00 00

  $  000.左前轮ID                       $    $          $    $  ANS000.BYTE004  $  HEX(x1,x2,x3,x4);
  $  001.左前轮信号状态                 $    $          $    $  ANS000.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  002.左前轮漏气状态                 $    $          $    $  ANS000.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  003.左前轮压力状态                 $    $          $    $  ANS000.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  004.左前轮压力值                   $    $  kPa     $    $  ANS000.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  005.右前轮ID                       $    $          $    $  ANS001.BYTE004  $  HEX(x1,x2,x3,x4);
  $  006.右前轮信号状态                 $    $          $    $  ANS001.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  007.右前轮漏气状态                 $    $          $    $  ANS001.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  008.右前轮压力状态                 $    $          $    $  ANS001.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  009.右前轮压力值                   $    $  kPa     $    $  ANS001.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  010.左后轮ID                       $    $          $    $  ANS002.BYTE004  $  HEX(x1,x2,x3,x4);
  $  011.左后轮信号状态                 $    $          $    $  ANS002.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  012.左后轮漏气状态                 $    $          $    $  ANS002.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  013.左后轮压力状态                 $    $          $    $  ANS002.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  014.左后轮压力值                   $    $  kPa     $    $  ANS002.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  015.右后轮ID                       $    $          $    $  ANS003.BYTE004  $  HEX(x1,x2,x3,x4);
  $  016.右后轮信号状态                 $    $          $    $  ANS003.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  017.右后轮漏气状态                 $    $          $    $  ANS003.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  018.右后轮压力状态                 $    $          $    $  ANS003.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  019.右后轮压力值                   $    $  kPa     $    $  ANS003.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  020.前轴标准压力                   $    $  kpa     $    $  ANS004.BYTE004  $  y=(x2*256+x1);
  $  021.后轴标准压力                   $    $  kpa     $    $  ANS005.BYTE004  $  y=(x2*256+x1);
  $  022.国标/欧标                      $    $          $    $  ANS006.BYTE004  $  if(x1==0) y=@00d1;else if(x1==1) y=@00d4;else y=@0001;
  $  023.自定位功能                     $    $          $    $  ANS007.BYTE004  $  if(x1==0) y=@0328;else if(x1==1) y=@0329;else y=@0001;
  $  024.自定位全局状态                 $    $          $    $  ANS008.BYTE004  $  if(x1==0) y=@0320;else if(x1==1) y=@0702;else if(x1==2) y=@0322;else if(x1==3) y=@0323;else if(x1==4) y=@0548;else if(x1==5) y=@0325;else if(x1==6) y=@03d7;else if(x1==7) y=@0326;else if(x1==8) y=@03d8;else if(x1==9) y=@0703;else y=@0001;
  $  025.左前轮自定位学习状态           $    $          $    $  ANS009.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  026.右前轮自定位学习状态           $    $          $    $  ANS010.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  027.左后轮自定位学习状态           $    $          $    $  ANS011.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  028.左后轮自定位学习状态           $    $          $    $  ANS012.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  029.RSSI(接收信号的强度指示)       $    $  dB      $    $  ANS013.BYTE004  $  y=x1;

  $)  08.电源控制系统数据流
  $  08.电源控制系统数据流
  $  REQ000:720 03 22 27 02 00 00 00 00       $  ANS000:728 03 22 27 02 00 00 00 00
  $  REQ001:720 03 22 27 03 00 00 00 00       $  ANS001:728 03 22 27 03 00 00 00 00
  $  REQ002:720 03 22 27 04 00 00 00 00       $  ANS002:728 03 22 27 04 00 00 00 00
  $  REQ003:720 03 22 27 05 00 00 00 00       $  ANS003:728 03 22 27 05 00 00 00 00
  $  REQ004:720 03 22 27 06 00 00 00 00       $  ANS004:728 03 22 27 06 00 00 00 00
  $  REQ005:720 03 22 27 07 00 00 00 00       $  ANS005:728 03 22 27 07 00 00 00 00
  $  REQ006:720 03 22 27 08 00 00 00 00       $  ANS006:728 03 22 27 08 00 00 00 00
  $  REQ007:720 03 22 27 09 00 00 00 00       $  ANS007:728 03 22 27 09 00 00 00 00
  $  REQ008:720 03 22 27 0A 00 00 00 00       $  ANS008:728 03 22 27 0A 00 00 00 00
  $  REQ009:720 03 22 27 0B 00 00 00 00       $  ANS009:728 03 22 27 0B 00 00 00 00
  $  REQ010:720 03 22 27 0C 00 00 00 00       $  ANS010:728 03 22 27 0C 00 00 00 00
  $  REQ011:720 03 22 27 0D 00 00 00 00       $  ANS011:728 03 22 27 0D 00 00 00 00
  $  REQ012:720 03 22 27 0E 00 00 00 00       $  ANS012:728 03 22 27 0E 00 00 00 00

  $  000.12V制动信号状态        $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@0002;else y=@0001;
  $  001.0V制动灯开关状态       $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@0002;else y=@0001;
  $  002.启动按钮1脚状态        $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@009d;else if(x1==1) y=@000b;else y=@0001;
  $  003.启动按钮1脚状态        $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@009d;else if(x1==1) y=@000b;else y=@0001;
  $  004.离合踏板状态           $    $       $    $  ANS004.BYTE004  $  if(x1==0) y=@0117;else if(x1==1) y=@0118;else y=@0001;
  $  005.起动机继电器状态       $    $       $    $  ANS005.BYTE004  $  if(x1==0) y=@03f3;else if(x1==1) y=@03f2;else y=@0001;
  $  006.ACC电状态              $    $       $    $  ANS006.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  007.IG1(点火1)电状态       $    $       $    $  ANS007.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  008.IG2(点火2)电状态       $    $       $    $  ANS008.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  009.IG3(点火3)电状态       $    $       $    $  ANS009.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  010.IG4(点火4)电状态       $    $       $    $  ANS010.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  011.空挡开关状态           $    $       $    $  ANS011.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@0002;else y=@0001;
  $  012.倒档开关状态           $    $       $    $  ANS012.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@0002;else y=@0001;

  $)  09.电源控制系统数据流(启动失败原因记录)
  $  09.电源控制系统数据流(启动失败原因记录)
  $  REQ000:720 03 22 27 0F 00 00 00 00       $  ANS000:728 03 22 27 0F 00 00 00 00

  $  000.启动失败原因记录/数据标识1       $    $       $    $  ANS000.BYTE004  $  if(x1==21) y=@02c8;else y=@0092;
  $  001.启动失败原因1                    $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  002.数据索引1                        $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.启动失败时间标识1                $    $       $    $  ANS000.BYTE008  $  if(x1==5) y=@06f4;else y=@0001;
  $  004.启动失败时间点1                  $    $       $    $  ANS000.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  005.数据索引_1                       $    $       $    $  ANS000.BYTE013  $  y=x1;
  $  006.数据标识2                        $    $       $    $  ANS000.BYTE014  $  if(x1==21) y=@02c8;else y=@0092;
  $  007.启动失败原因2                    $    $       $    $  ANS000.BYTE015  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  008.数据索引2                        $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  009.启动失败时间标识2                $    $       $    $  ANS000.BYTE018  $  if(x1==5) y=@06f4;else y=@0001;
  $  010.启动失败时间点2                  $    $       $    $  ANS000.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  011.数据索引_2                       $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  012.数据标识3                        $    $       $    $  ANS000.BYTE024  $  if(x1==21) y=@02c8;else y=@0092;
  $  013.启动失败原因3                    $    $       $    $  ANS000.BYTE025  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  014.数据索引3                        $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  015.启动失败时间标识3                $    $       $    $  ANS000.BYTE028  $  if(x1==5) y=@06f4;else y=@0001;
  $  016.启动失败时间点3                  $    $       $    $  ANS000.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  017.数据索引_3                       $    $       $    $  ANS000.BYTE033  $  y=x1;
  $  018.数据标识4                        $    $       $    $  ANS000.BYTE034  $  if(x1==21) y=@02c8;else y=@0092;
  $  019.启动失败原因4                    $    $       $    $  ANS000.BYTE035  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  020.数据索引4                        $    $       $    $  ANS000.BYTE037  $  y=x1;
  $  021.启动失败时间标识4                $    $       $    $  ANS000.BYTE038  $  if(x1==5) y=@06f4;else y=@0001;
  $  022.启动失败时间点4                  $    $       $    $  ANS000.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  023.数据索引_4                       $    $       $    $  ANS000.BYTE043  $  y=x1;
  $  024.数据标识5                        $    $       $    $  ANS000.BYTE044  $  if(x1==21) y=@02c8;else y=@0092;
  $  025.启动失败原因5                    $    $       $    $  ANS000.BYTE045  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  026.数据索引5                        $    $       $    $  ANS000.BYTE047  $  y=x1;
  $  027.启动失败时间标识5                $    $       $    $  ANS000.BYTE048  $  if(x1==5) y=@06f4;else y=@0001;
  $  028.启动失败时间点5                  $    $       $    $  ANS000.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  029.数据索引_5                       $    $       $    $  ANS000.BYTE053  $  y=x1;
  $  030.数据标识6                        $    $       $    $  ANS000.BYTE054  $  if(x1==21) y=@02c8;else y=@0092;
  $  031.启动失败原因6                    $    $       $    $  ANS000.BYTE055  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  032.数据索引6                        $    $       $    $  ANS000.BYTE057  $  y=x1;
  $  033.启动失败时间标识6                $    $       $    $  ANS000.BYTE058  $  if(x1==5) y=@06f4;else y=@0001;
  $  034.启动失败时间点6                  $    $       $    $  ANS000.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  035.数据索引_6                       $    $       $    $  ANS000.BYTE063  $  y=x1;
  $  036.数据标识7                        $    $       $    $  ANS000.BYTE064  $  if(x1==21) y=@02c8;else y=@0092;
  $  037.启动失败原因7                    $    $       $    $  ANS000.BYTE065  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  038.数据索引7                        $    $       $    $  ANS000.BYTE067  $  y=x1;
  $  039.启动失败时间标识7                $    $       $    $  ANS000.BYTE068  $  if(x1==5) y=@06f4;else y=@0001;
  $  040.启动失败时间点7                  $    $       $    $  ANS000.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  041.数据索引_7                       $    $       $    $  ANS000.BYTE073  $  y=x1;
  $  042.数据标识8                        $    $       $    $  ANS000.BYTE074  $  if(x1==21) y=@02c8;else y=@0092;
  $  043.启动失败原因8                    $    $       $    $  ANS000.BYTE075  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  044.数据索引8                        $    $       $    $  ANS000.BYTE077  $  y=x1;
  $  045.启动失败时间标识8                $    $       $    $  ANS000.BYTE078  $  if(x1==5) y=@06f4;else y=@0001;
  $  046.启动失败时间点8                  $    $       $    $  ANS000.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  047.数据索引_8                       $    $       $    $  ANS000.BYTE083  $  y=x1;

  $)  10.电源控制系统数据流(退电失败原因记录)
  $  10.电源控制系统数据流(退电失败原因记录)
  $  REQ000:720 03 22 27 10 00 00 00 00       $  ANS000:728 03 22 27 10 00 00 00 00

  $  000.退电失败原因记录/数据标识1       $    $       $    $  ANS000.BYTE004  $  if(x1==22) y=@02c6;else y=@0092;
  $  001.退电失败原因1                    $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  002.数据索引1                        $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.退电失败时间标识1                $    $       $    $  ANS000.BYTE008  $  if(x1==6) y=@0700;else y=@0001;
  $  004.退电失败时间点1                  $    $       $    $  ANS000.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  005.数据索引_1                       $    $       $    $  ANS000.BYTE013  $  y=x1;
  $  006.数据标识2                        $    $       $    $  ANS000.BYTE014  $  if(x1==22) y=@02c6;else y=@0092;
  $  007.退电失败原因2                    $    $       $    $  ANS000.BYTE015  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  008.数据索引2                        $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  009.退电失败时间标识2                $    $       $    $  ANS000.BYTE018  $  if(x1==6) y=@0700;else y=@0001;
  $  010.退电失败时间点2                  $    $       $    $  ANS000.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  011.数据索引_2                       $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  012.数据标识3                        $    $       $    $  ANS000.BYTE024  $  if(x1==22) y=@02c6;else y=@0092;
  $  013.退电失败原因3                    $    $       $    $  ANS000.BYTE025  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  014.数据索引3                        $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  015.退电失败时间标识3                $    $       $    $  ANS000.BYTE028  $  if(x1==6) y=@0700;else y=@0001;
  $  016.退电失败时间点3                  $    $       $    $  ANS000.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  017.数据索引_3                       $    $       $    $  ANS000.BYTE033  $  y=x1;
  $  018.数据标识4                        $    $       $    $  ANS000.BYTE034  $  if(x1==22) y=@02c6;else y=@0092;
  $  019.退电失败原因4                    $    $       $    $  ANS000.BYTE035  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  020.数据索引4                        $    $       $    $  ANS000.BYTE037  $  y=x1;
  $  021.退电失败时间标识4                $    $       $    $  ANS000.BYTE038  $  if(x1==6) y=@0700;else y=@0001;
  $  022.退电失败时间点4                  $    $       $    $  ANS000.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  023.数据索引_4                       $    $       $    $  ANS000.BYTE043  $  y=x1;
  $  024.数据标识5                        $    $       $    $  ANS000.BYTE044  $  if(x1==22) y=@02c6;else y=@0092;
  $  025.退电失败原因5                    $    $       $    $  ANS000.BYTE045  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  026.数据索引5                        $    $       $    $  ANS000.BYTE047  $  y=x1;
  $  027.退电失败时间标识5                $    $       $    $  ANS000.BYTE048  $  if(x1==6) y=@0700;else y=@0001;
  $  028.退电失败时间点5                  $    $       $    $  ANS000.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  029.数据索引_5                       $    $       $    $  ANS000.BYTE053  $  y=x1;
  $  030.数据标识6                        $    $       $    $  ANS000.BYTE054  $  if(x1==22) y=@02c6;else y=@0092;
  $  031.退电失败原因6                    $    $       $    $  ANS000.BYTE055  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  032.数据索引6                        $    $       $    $  ANS000.BYTE057  $  y=x1;
  $  033.退电失败时间标识6                $    $       $    $  ANS000.BYTE058  $  if(x1==6) y=@0700;else y=@0001;
  $  034.退电失败时间点6                  $    $       $    $  ANS000.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  035.数据索引_6                       $    $       $    $  ANS000.BYTE063  $  y=x1;
  $  036.数据标识7                        $    $       $    $  ANS000.BYTE064  $  if(x1==22) y=@02c6;else y=@0092;
  $  037.退电失败原因7                    $    $       $    $  ANS000.BYTE065  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  038.数据索引7                        $    $       $    $  ANS000.BYTE067  $  y=x1;
  $  039.退电失败时间标识7                $    $       $    $  ANS000.BYTE068  $  if(x1==6) y=@0700;else y=@0001;
  $  040.退电失败时间点7                  $    $       $    $  ANS000.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  041.数据索引_7                       $    $       $    $  ANS000.BYTE073  $  y=x1;
  $  042.数据标识8                        $    $       $    $  ANS000.BYTE074  $  if(x1==22) y=@02c6;else y=@0092;
  $  043.退电失败原因8                    $    $       $    $  ANS000.BYTE075  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  044.数据索引8                        $    $       $    $  ANS000.BYTE077  $  y=x1;
  $  045.退电失败时间标识8                $    $       $    $  ANS000.BYTE078  $  if(x1==6) y=@0700;else y=@0001;
  $  046.退电失败时间点8                  $    $       $    $  ANS000.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  047.数据索引_8                       $    $       $    $  ANS000.BYTE083  $  y=x1;

  $)  11.电源控制系统数据流(行驶过程退电命令记录)
  $  11.电源控制系统数据流(行驶过程退电命令记录)
  $  REQ000:720 03 22 27 11 00 00 00 00       $  ANS000:728 03 22 27 11 00 00 00 00

  $  000.行驶过程退电命令记录/数据标识（第1组）       $    $       $    $  ANS000.BYTE004  $  if(x1==24) y=@06ab;else y=@0092;
  $  001.启动按钮1触发（第1组）                       $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  002.启动按钮4触发（第1组）                       $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  003.遥控启动或熄灭触发（第1组）                  $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  004.远程熄火触发（第1组）                        $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  005.车速状态（事件发生）（第1组）                $    $       $    $  ANS000.BYTE005  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  006.电源模式（事件发生）（第1组）                $    $       $    $  ANS000.BYTE005  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  007.行驶过程退电命令时间点（第1组）              $    $       $    $  ANS000.BYTE006  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  008.数据索引（第1组）                            $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  009.数据标识（第2组）                            $    $       $    $  ANS000.BYTE011  $  if(x1==24) y=@06ab;else y=@0092;
  $  010.启动按钮1触发（第2组）                       $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  011.启动按钮4触发（第2组）                       $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  012.遥控启动或熄灭触发（第2组）                  $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  013.远程熄火触发（第2组）                        $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  014.车速状态（事件发生）（第2组）                $    $       $    $  ANS000.BYTE012  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  015.电源模式（事件发生）（第2组）                $    $       $    $  ANS000.BYTE012  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  016.行驶过程退电命令时间点（第2组）              $    $       $    $  ANS000.BYTE013  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  017.数据索引（第2组）                            $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  018.数据标识（第3组）                            $    $       $    $  ANS000.BYTE018  $  if(x1==24) y=@06ab;else y=@0092;
  $  019.启动按钮1触发（第3组）                       $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  020.启动按钮4触发（第3组）                       $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  021.遥控启动或熄灭触发（第3组）                  $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  022.远程熄火触发（第3组）                        $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  023.车速状态（事件发生）（第3组）                $    $       $    $  ANS000.BYTE019  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  024.电源模式（事件发生）（第3组）                $    $       $    $  ANS000.BYTE019  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  025.行驶过程退电命令时间点（第3组）              $    $       $    $  ANS000.BYTE020  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  026.数据索引（第3组）                            $    $       $    $  ANS000.BYTE024  $  y=x1;
  $  027.数据标识（第4组）                            $    $       $    $  ANS000.BYTE025  $  if(x1==24) y=@06ab;else y=@0092;
  $  028.启动按钮1触发（第4组）                       $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  029.启动按钮4触发（第4组）                       $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  030.遥控启动或熄灭触发（第4组）                  $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  031.远程熄火触发（第4组）                        $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  032.车速状态（事件发生）（第4组）                $    $       $    $  ANS000.BYTE026  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  033.电源模式（事件发生）（第4组）                $    $       $    $  ANS000.BYTE026  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  034.行驶过程退电命令时间点（第4组）              $    $       $    $  ANS000.BYTE027  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  035.数据索引（第4组）                            $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  036.数据标识（第5组）                            $    $       $    $  ANS000.BYTE032  $  if(x1==24) y=@06ab;else y=@0092;
  $  037.启动按钮1触发（第5组）                       $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  038.启动按钮4触发（第5组）                       $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  039.遥控启动或熄灭触发（第5组）                  $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  040.远程熄火触发（第5组）                        $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  041.车速状态（事件发生）（第5组）                $    $       $    $  ANS000.BYTE033  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  042.电源模式（事件发生）（第5组）                $    $       $    $  ANS000.BYTE033  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  043.行驶过程退电命令时间点（第5组）              $    $       $    $  ANS000.BYTE034  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  044.数据索引（第5组）                            $    $       $    $  ANS000.BYTE038  $  y=x1;
  $  045.数据标识（第6组）                            $    $       $    $  ANS000.BYTE039  $  if(x1==24) y=@06ab;else y=@0092;
  $  046.启动按钮1触发（第6组）                       $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  047.启动按钮4触发（第6组）                       $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  048.遥控启动或熄灭触发（第6组）                  $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  049.远程熄火触发（第6组）                        $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  050.车速状态（事件发生）（第6组）                $    $       $    $  ANS000.BYTE040  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  051.电源模式（事件发生）（第6组）                $    $       $    $  ANS000.BYTE040  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  052.行驶过程退电命令时间点（第6组）              $    $       $    $  ANS000.BYTE041  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  053.数据索引（第6组）                            $    $       $    $  ANS000.BYTE045  $  y=x1;
  $  054.数据标识（第7组）                            $    $       $    $  ANS000.BYTE046  $  if(x1==24) y=@06ab;else y=@0092;
  $  055.启动按钮1触发（第7组）                       $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  056.启动按钮4触发（第7组）                       $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  057.遥控启动或熄灭触发（第7组）                  $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  058.远程熄火触发（第7组）                        $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  059.车速状态（事件发生）（第7组）                $    $       $    $  ANS000.BYTE047  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  060.电源模式（事件发生）（第7组）                $    $       $    $  ANS000.BYTE047  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  061.行驶过程退电命令时间点（第7组）              $    $       $    $  ANS000.BYTE048  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  062.数据索引（第7组）                            $    $       $    $  ANS000.BYTE052  $  y=x1;
  $  063.数据标识（第8组）                            $    $       $    $  ANS000.BYTE053  $  if(x1==24) y=@06ab;else y=@0092;
  $  064.启动按钮1触发（第8组）                       $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  065.启动按钮4触发（第8组）                       $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  066.遥控启动或熄灭触发（第8组）                  $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  067.远程熄火触发（第8组）                        $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  068.车速状态（事件发生）（第8组）                $    $       $    $  ANS000.BYTE054  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  069.电源模式（事件发生）（第8组）                $    $       $    $  ANS000.BYTE054  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  070.行驶过程退电命令时间点（第8组）              $    $       $    $  ANS000.BYTE055  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  071.数据索引（第8组）                            $    $       $    $  ANS000.BYTE059  $  y=x1;

  $)  12.电源控制系统数据流(起动机继电器故障记录)
  $  12.电源控制系统数据流(起动机继电器故障记录)
  $  REQ000:720 03 22 27 12 00 00 00 00       $  ANS000:728 03 22 27 12 00 00 00 00

  $  000.起动机继电器故障记录/数据标识（第1组）       $    $       $    $  ANS000.BYTE004  $  if(x1==22) y=@06af;else y=@0092;
  $  001.起动机吸合故障（第1组）                      $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06ae;else y=@0003;
  $  002.起动机吸合恢复正常（第1组）                  $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06ad;else y=@0003;
  $  003.起动机断开故障（第1组）                      $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06ac;else y=@0003;
  $  004.起动机断开恢复正常（第1组）                  $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06a6;else y=@0003;
  $  005.起动机继电器故障发生时间点（第1组）          $    $       $    $  ANS000.BYTE006  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  006.数据索引（第1组）                            $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  007.数据标识（第2组）                            $    $       $    $  ANS000.BYTE011  $  if(x1==22) y=@06af;else y=@0092;
  $  008.起动机吸合故障（第2组）                      $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06ae;else y=@0003;
  $  009.起动机吸合恢复正常（第2组）                  $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06ad;else y=@0003;
  $  010.起动机断开故障（第2组）                      $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06ac;else y=@0003;
  $  011.起动机断开恢复正常（第2组）                  $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06a6;else y=@0003;
  $  012.起动机继电器故障发生时间点（第2组）          $    $       $    $  ANS000.BYTE013  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  013.数据索引（第2组）                            $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  014.数据标识（第3组）                            $    $       $    $  ANS000.BYTE018  $  if(x1==22) y=@06af;else y=@0092;
  $  015.起动机吸合故障（第3组）                      $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06ae;else y=@0003;
  $  016.起动机吸合恢复正常（第3组）                  $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06ad;else y=@0003;
  $  017.起动机断开故障（第3组）                      $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06ac;else y=@0003;
  $  018.起动机断开恢复正常（第3组）                  $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06a6;else y=@0003;
  $  019.起动机继电器故障发生时间点（第3组）          $    $       $    $  ANS000.BYTE020  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  020.数据索引（第3组）                            $    $       $    $  ANS000.BYTE024  $  y=x1;
  $  021.数据标识（第4组）                            $    $       $    $  ANS000.BYTE025  $  if(x1==22) y=@06af;else y=@0092;
  $  022.起动机吸合故障（第4组）                      $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06ae;else y=@0003;
  $  023.起动机吸合恢复正常（第4组）                  $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06ad;else y=@0003;
  $  024.起动机断开故障（第4组）                      $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06ac;else y=@0003;
  $  025.起动机断开恢复正常（第4组）                  $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06a6;else y=@0003;
  $  026.起动机继电器故障发生时间点（第4组）          $    $       $    $  ANS000.BYTE027  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  027.数据索引（第4组）                            $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  028.数据标识（第5组）                            $    $       $    $  ANS000.BYTE032  $  if(x1==22) y=@06af;else y=@0092;
  $  029.起动机吸合故障（第5组）                      $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06ae;else y=@0003;
  $  030.起动机吸合恢复正常（第5组）                  $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06ad;else y=@0003;
  $  031.起动机断开故障（第5组）                      $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06ac;else y=@0003;
  $  032.起动机断开恢复正常（第5组）                  $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06a6;else y=@0003;
  $  033.起动机继电器故障发生时间点（第5组）          $    $       $    $  ANS000.BYTE034  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  034.数据索引（第5组）                            $    $       $    $  ANS000.BYTE038  $  y=x1;
  $  035.数据标识（第6组）                            $    $       $    $  ANS000.BYTE039  $  if(x1==22) y=@06af;else y=@0092;
  $  036.起动机吸合故障（第6组）                      $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06ae;else y=@0003;
  $  037.起动机吸合恢复正常（第6组）                  $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06ad;else y=@0003;
  $  038.起动机断开故障（第6组）                      $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06ac;else y=@0003;
  $  039.起动机断开恢复正常（第6组）                  $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06a6;else y=@0003;
  $  040.起动机继电器故障发生时间点（第6组）          $    $       $    $  ANS000.BYTE041  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  041.数据索引（第6组）                            $    $       $    $  ANS000.BYTE045  $  y=x1;
  $  042.数据标识（第7组）                            $    $       $    $  ANS000.BYTE046  $  if(x1==22) y=@06af;else y=@0092;
  $  043.起动机吸合故障（第7组）                      $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06ae;else y=@0003;
  $  044.起动机吸合恢复正常（第7组）                  $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06ad;else y=@0003;
  $  045.起动机断开故障（第7组）                      $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06ac;else y=@0003;
  $  046.起动机断开恢复正常（第7组）                  $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06a6;else y=@0003;
  $  047.起动机继电器故障发生时间点（第7组）          $    $       $    $  ANS000.BYTE048  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  048.数据索引（第7组）                            $    $       $    $  ANS000.BYTE052  $  y=x1;
  $  049.数据标识（第8组）                            $    $       $    $  ANS000.BYTE053  $  if(x1==22) y=@06af;else y=@0092;
  $  050.起动机吸合故障（第8组）                      $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06ae;else y=@0003;
  $  051.起动机吸合恢复正常（第8组）                  $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06ad;else y=@0003;
  $  052.起动机断开故障（第8组）                      $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06ac;else y=@0003;
  $  053.起动机断开恢复正常（第8组）                  $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06a6;else y=@0003;
  $  054.起动机继电器故障发生时间点（第8组）          $    $       $    $  ANS000.BYTE055  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  055.数据索引（第8组）                            $    $       $    $  ANS000.BYTE059  $  y=x1;

  $)  13.电源控制系统数据流(IG继电器异常断电记录)
  $  13.电源控制系统数据流(IG继电器异常断电记录)
  $  REQ000:720 03 22 27 13 00 00 00 00       $  ANS000:728 03 22 27 13 00 00 00 00

  $  000.IG继电器异常断电记录/数据标识（第1组）       $    $       $    $  ANS000.BYTE004  $  if(x1==22) y=@06a5;else y=@0092;
  $  001.IG3(点火3)继电器异常断电（第1组）            $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06a4;else y=@0003;
  $  002.IG4(点火4)继电器异常断电（第1组）            $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06a3;else y=@0003;
  $  003.IG继电器异常断电时间点（第1组）              $    $       $    $  ANS000.BYTE006  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  004.数据索引（第1组）                            $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  005.数据标识（第2组）                            $    $       $    $  ANS000.BYTE011  $  if(x1==22) y=@06a5;else y=@0092;
  $  006.IG3(点火3)继电器异常断电（第2组）            $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06a4;else y=@0003;
  $  007.IG4(点火4)继电器异常断电（第2组）            $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06a3;else y=@0003;
  $  008.IG继电器异常断电时间点（第2组）              $    $       $    $  ANS000.BYTE013  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  009.数据索引（第2组）                            $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  010.数据标识（第3组）                            $    $       $    $  ANS000.BYTE018  $  if(x1==22) y=@06a5;else y=@0092;
  $  011.IG3(点火3)继电器异常断电（第3组）            $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06a4;else y=@0003;
  $  012.IG4(点火4)继电器异常断电（第3组）            $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06a3;else y=@0003;
  $  013.IG继电器异常断电时间点（第3组）              $    $       $    $  ANS000.BYTE020  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  014.数据索引（第3组）                            $    $       $    $  ANS000.BYTE024  $  y=x1;
  $  015.数据标识（第4组）                            $    $       $    $  ANS000.BYTE025  $  if(x1==22) y=@06a5;else y=@0092;
  $  016.IG3(点火3)继电器异常断电（第4组）            $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06a4;else y=@0003;
  $  017.IG4(点火4)继电器异常断电（第4组）            $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06a3;else y=@0003;
  $  018.IG继电器异常断电时间点（第4组）              $    $       $    $  ANS000.BYTE027  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  019.数据索引（第4组）                            $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  020.数据标识（第5组）                            $    $       $    $  ANS000.BYTE032  $  if(x1==22) y=@06a5;else y=@0092;
  $  021.IG3(点火3)继电器异常断电（第5组）            $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06a4;else y=@0003;
  $  022.IG4(点火4)继电器异常断电（第5组）            $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06a3;else y=@0003;
  $  023.IG继电器异常断电时间点（第5组）              $    $       $    $  ANS000.BYTE034  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  024.数据索引（第5组）                            $    $       $    $  ANS000.BYTE038  $  y=x1;
  $  025.数据标识（第6组）                            $    $       $    $  ANS000.BYTE039  $  if(x1==22) y=@06a5;else y=@0092;
  $  026.IG3(点火3)继电器异常断电（第6组）            $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06a4;else y=@0003;
  $  027.IG4(点火4)继电器异常断电（第6组）            $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06a3;else y=@0003;
  $  028.IG继电器异常断电时间点（第6组）              $    $       $    $  ANS000.BYTE041  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  029.数据索引（第6组）                            $    $       $    $  ANS000.BYTE045  $  y=x1;
  $  030.数据标识（第7组）                            $    $       $    $  ANS000.BYTE046  $  if(x1==22) y=@06a5;else y=@0092;
  $  031.IG3(点火3)继电器异常断电（第7组）            $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06a4;else y=@0003;
  $  032.IG4(点火4)继电器异常断电（第7组）            $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06a3;else y=@0003;
  $  033.IG继电器异常断电时间点（第7组）              $    $       $    $  ANS000.BYTE048  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  034.数据索引（第7组）                            $    $       $    $  ANS000.BYTE052  $  y=x1;
  $  035.数据标识（第8组）                            $    $       $    $  ANS000.BYTE053  $  if(x1==22) y=@06a5;else y=@0092;
  $  036.IG3(点火3)继电器异常断电（第8组）            $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06a4;else y=@0003;
  $  037.IG4(点火4)继电器异常断电（第8组）            $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06a3;else y=@0003;
  $  038.IG继电器异常断电时间点（第8组）              $    $       $    $  ANS000.BYTE055  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  039.数据索引（第8组）                            $    $       $    $  ANS000.BYTE059  $  y=x1;

  $)  14.门控及防盗系统数据流
  $  14.门控及防盗系统数据流
  $  REQ000:720 03 22 27 38 00 00 00 00       $  ANS000:728 03 22 27 38 00 00 00 00
  $  REQ001:720 03 22 27 3B 00 00 00 00       $  ANS001:728 03 22 27 3B 00 00 00 00
  $  REQ002:720 03 22 27 3C 00 00 00 00       $  ANS002:728 03 22 27 3C 00 00 00 00
  $  REQ003:720 03 22 27 3D 00 00 00 00       $  ANS003:728 03 22 27 3D 00 00 00 00
  $  REQ004:720 03 22 27 3E 00 00 00 00       $  ANS004:728 03 22 27 3E 00 00 00 00
  $  REQ005:720 03 22 27 3F 00 00 00 00       $  ANS005:728 03 22 27 3F 00 00 00 00
  $  REQ006:720 03 22 27 40 00 00 00 00       $  ANS006:728 03 22 27 40 00 00 00 00
  $  REQ007:720 03 22 27 41 00 00 00 00       $  ANS007:728 03 22 27 41 00 00 00 00
  $  REQ008:720 03 22 27 42 00 00 00 00       $  ANS008:728 03 22 27 42 00 00 00 00
  $  REQ009:720 03 22 27 43 00 00 00 00       $  ANS009:728 03 22 27 43 00 00 00 00
  $  REQ010:720 03 22 27 44 00 00 00 00       $  ANS010:728 03 22 27 44 00 00 00 00

  $  000.左后门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@0009;else if(x1==1) y=@000a;else y=@0001;
  $  001.行李箱盖开启开关状态                $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@000b;else if(x1==1) y=@009d;else y=@0001;
  $  002.前舱盖状态                          $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  003.门锁保护状态                        $    $       $    $  ANS003.BYTE005  $  if(x1==0) y=@0078;else if(x1==1) y=@00ab;else if(x1==2) y=@00ac;else if(x1==3) y=@00ad;else y=@0001;
  $  004.碰撞信号状态（PWM(脉宽调制)）       $    $       $    $  ANS004.BYTE005  $  if(x1==0) y=@00a8;else if(x1==1) y=@00a9;else if(x1==2) y=@00aa;else if(x1==3) y=@007b;else y=@0001;
  $  005.硬线中控锁闭锁开关状态              $    $       $    $  ANS005.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@000b;else y=@0001;
  $  006.硬线中控锁解锁开关状态              $    $       $    $  ANS006.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@000b;else y=@0001;
  $  007.报警触发记录/数据标识1              $    $       $    $  ANS007.BYTE004  $  if(x1==11) y=@02a9;else y=@06d4;
  $  008.报警触发原因_1                      $    $       $    $  ANS007.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  009.数据索引1                           $    $       $    $  ANS007.BYTE007  $  y=x1;
  $  010.报警触发时间标识1                   $    $       $    $  ANS007.BYTE008  $  if(x1==1) y=@009e;else y=@0003;
  $  011.报警触发时间点1                     $    $       $    $  ANS007.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  012.数据索引_1                          $    $       $    $  ANS007.BYTE013  $  y=x1;
  $  013.报警触发记录/数据标识2              $    $       $    $  ANS007.BYTE014  $  if(x1==11) y=@02a9;else y=@06d4;
  $  014.报警触发原因_2                      $    $       $    $  ANS007.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  015.数据索引2                           $    $       $    $  ANS007.BYTE017  $  y=x1;
  $  016.报警触发时间标识2                   $    $       $    $  ANS007.BYTE018  $  if(x1==1) y=@009e;else y=@0003;
  $  017.报警触发时间点2                     $    $       $    $  ANS007.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  018.数据索引_2                          $    $       $    $  ANS007.BYTE023  $  y=x1;
  $  019.报警触发记录/数据标识3              $    $       $    $  ANS007.BYTE024  $  if(x1==11) y=@02a9;else y=@06d4;
  $  020.报警触发原因_3                      $    $       $    $  ANS007.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  021.数据索引3                           $    $       $    $  ANS007.BYTE027  $  y=x1;
  $  022.报警触发时间标识3                   $    $       $    $  ANS007.BYTE028  $  if(x1==1) y=@009e;else y=@0003;
  $  023.报警触发时间点3                     $    $       $    $  ANS007.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  024.数据索引_3                          $    $       $    $  ANS007.BYTE033  $  y=x1;
  $  025.报警触发记录/数据标识4              $    $       $    $  ANS007.BYTE034  $  if(x1==11) y=@02a9;else y=@06d4;
  $  026.报警触发原因_4                      $    $       $    $  ANS007.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  027.数据索引4                           $    $       $    $  ANS007.BYTE037  $  y=x1;
  $  028.报警触发时间标识4                   $    $       $    $  ANS007.BYTE038  $  if(x1==1) y=@009e;else y=@0003;
  $  029.报警触发时间点4                     $    $       $    $  ANS007.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  030.数据索引_4                          $    $       $    $  ANS007.BYTE043  $  y=x1;
  $  031.报警触发记录/数据标识5              $    $       $    $  ANS007.BYTE044  $  if(x1==11) y=@02a9;else y=@06d4;
  $  032.报警触发原因_5                      $    $       $    $  ANS007.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  033.数据索引5                           $    $       $    $  ANS007.BYTE047  $  y=x1;
  $  034.报警触发时间标识5                   $    $       $    $  ANS007.BYTE048  $  if(x1==1) y=@009e;else y=@0003;
  $  035.报警触发时间点5                     $    $       $    $  ANS007.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  036.数据索引_5                          $    $       $    $  ANS007.BYTE053  $  y=x1;
  $  037.报警触发记录/数据标识6              $    $       $    $  ANS007.BYTE054  $  if(x1==11) y=@02a9;else y=@06d4;
  $  038.报警触发原因_6                      $    $       $    $  ANS007.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  039.数据索引6                           $    $       $    $  ANS007.BYTE057  $  y=x1;
  $  040.报警触发时间标识6                   $    $       $    $  ANS007.BYTE058  $  if(x1==1) y=@009e;else y=@0003;
  $  041.报警触发时间点6                     $    $       $    $  ANS007.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  042.数据索引_6                          $    $       $    $  ANS007.BYTE063  $  y=x1;
  $  043.报警触发记录/数据标识7              $    $       $    $  ANS007.BYTE064  $  if(x1==11) y=@02a9;else y=@06d4;
  $  044.报警触发原因_7                      $    $       $    $  ANS007.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  045.数据索引7                           $    $       $    $  ANS007.BYTE067  $  y=x1;
  $  046.报警触发时间标识7                   $    $       $    $  ANS007.BYTE068  $  if(x1==1) y=@009e;else y=@0003;
  $  047.报警触发时间点7                     $    $       $    $  ANS007.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  048.数据索引_7                          $    $       $    $  ANS007.BYTE073  $  y=x1;
  $  049.报警触发记录/数据标识8              $    $       $    $  ANS007.BYTE074  $  if(x1==11) y=@02a9;else y=@06d4;
  $  050.报警触发原因_8                      $    $       $    $  ANS007.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  051.数据索引8                           $    $       $    $  ANS007.BYTE077  $  y=x1;
  $  052.报警触发时间标识8                   $    $       $    $  ANS007.BYTE078  $  if(x1==1) y=@009e;else y=@0003;
  $  053.报警触发时间点8                     $    $       $    $  ANS007.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  054.数据索引_8                          $    $       $    $  ANS007.BYTE083  $  y=x1;
  $  055.报警触发记录/数据标识9              $    $       $    $  ANS007.BYTE084  $  if(x1==11) y=@02a9;else y=@06d4;
  $  056.报警触发原因_9                      $    $       $    $  ANS007.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  057.数据索引9                           $    $       $    $  ANS007.BYTE087  $  y=x1;
  $  058.报警触发时间标识9                   $    $       $    $  ANS007.BYTE088  $  if(x1==1) y=@009e;else y=@0003;
  $  059.报警触发时间点9                     $    $       $    $  ANS007.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  060.数据索引_9                          $    $       $    $  ANS007.BYTE093  $  y=x1;
  $  061.报警触发记录/数据标识10             $    $       $    $  ANS007.BYTE094  $  if(x1==11) y=@02a9;else y=@06d4;
  $  062.报警触发原因_10                     $    $       $    $  ANS007.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  063.数据索引10                          $    $       $    $  ANS007.BYTE097  $  y=x1;
  $  064.报警触发时间标识10                  $    $       $    $  ANS007.BYTE098  $  if(x1==1) y=@009e;else y=@0003;
  $  065.报警触发时间点10                    $    $       $    $  ANS007.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  066.数据索引_10                         $    $       $    $  ANS007.BYTE103  $  y=x1;
  $  067.闭锁触发记录/数据标识1              $    $       $    $  ANS008.BYTE004  $  if(x1==12) y=@02c5;else y=@02ea;
  $  068.闭锁触发原因_1                      $    $       $    $  ANS008.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  069.数据索引1                           $    $       $    $  ANS008.BYTE007  $  y=x1;
  $  070.闭锁触发时间标识1                   $    $       $    $  ANS008.BYTE008  $  if(x1==2) y=@06d5;else y=@0003;
  $  071.闭锁触发时间点1                     $    $       $    $  ANS008.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  072.数据索引_1                          $    $       $    $  ANS008.BYTE013  $  y=x1;
  $  073.闭锁触发记录/数据标识2              $    $       $    $  ANS008.BYTE014  $  if(x1==12) y=@02c5;else y=@02ea;
  $  074.闭锁触发原因_2                      $    $       $    $  ANS008.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  075.数据索引2                           $    $       $    $  ANS008.BYTE017  $  y=x1;
  $  076.闭锁触发时间标识2                   $    $       $    $  ANS008.BYTE018  $  if(x1==2) y=@06d5;else y=@0003;
  $  077.闭锁触发时间点2                     $    $       $    $  ANS008.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  078.数据索引_2                          $    $       $    $  ANS008.BYTE023  $  y=x1;
  $  079.闭锁触发记录/数据标识3              $    $       $    $  ANS008.BYTE024  $  if(x1==12) y=@02c5;else y=@02ea;
  $  080.闭锁触发原因_3                      $    $       $    $  ANS008.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  081.数据索引3                           $    $       $    $  ANS008.BYTE027  $  y=x1;
  $  082.闭锁触发时间标识3                   $    $       $    $  ANS008.BYTE028  $  if(x1==2) y=@06d5;else y=@0003;
  $  083.闭锁触发时间点3                     $    $       $    $  ANS008.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  084.数据索引_3                          $    $       $    $  ANS008.BYTE033  $  y=x1;
  $  085.闭锁触发记录/数据标识4              $    $       $    $  ANS008.BYTE034  $  if(x1==12) y=@02c5;else y=@02ea;
  $  086.闭锁触发原因_4                      $    $       $    $  ANS008.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  087.数据索引4                           $    $       $    $  ANS008.BYTE037  $  y=x1;
  $  088.闭锁触发时间标识4                   $    $       $    $  ANS008.BYTE038  $  if(x1==2) y=@06d5;else y=@0003;
  $  089.闭锁触发时间点4                     $    $       $    $  ANS008.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  090.数据索引_4                          $    $       $    $  ANS008.BYTE043  $  y=x1;
  $  091.闭锁触发记录/数据标识5              $    $       $    $  ANS008.BYTE044  $  if(x1==12) y=@02c5;else y=@02ea;
  $  092.闭锁触发原因_5                      $    $       $    $  ANS008.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  093.数据索引5                           $    $       $    $  ANS008.BYTE047  $  y=x1;
  $  094.闭锁触发时间标识5                   $    $       $    $  ANS008.BYTE048  $  if(x1==2) y=@06d5;else y=@0003;
  $  095.闭锁触发时间点5                     $    $       $    $  ANS008.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  096.数据索引_5                          $    $       $    $  ANS008.BYTE053  $  y=x1;
  $  097.闭锁触发记录/数据标识6              $    $       $    $  ANS008.BYTE054  $  if(x1==12) y=@02c5;else y=@02ea;
  $  098.闭锁触发原因_6                      $    $       $    $  ANS008.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  099.数据索引6                           $    $       $    $  ANS008.BYTE057  $  y=x1;
  $  100.闭锁触发时间标识6                   $    $       $    $  ANS008.BYTE058  $  if(x1==2) y=@06d5;else y=@0003;
  $  101.闭锁触发时间点6                     $    $       $    $  ANS008.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  102.数据索引_6                          $    $       $    $  ANS008.BYTE063  $  y=x1;
  $  103.闭锁触发记录/数据标识7              $    $       $    $  ANS008.BYTE064  $  if(x1==12) y=@02c5;else y=@02ea;
  $  104.闭锁触发原因_7                      $    $       $    $  ANS008.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  105.数据索引7                           $    $       $    $  ANS008.BYTE067  $  y=x1;
  $  106.闭锁触发时间标识7                   $    $       $    $  ANS008.BYTE068  $  if(x1==2) y=@06d5;else y=@0003;
  $  107.闭锁触发时间点7                     $    $       $    $  ANS008.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  108.数据索引_7                          $    $       $    $  ANS008.BYTE073  $  y=x1;
  $  109.闭锁触发记录/数据标识8              $    $       $    $  ANS008.BYTE074  $  if(x1==12) y=@02c5;else y=@02ea;
  $  110.闭锁触发原因_8                      $    $       $    $  ANS008.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  111.数据索引8                           $    $       $    $  ANS008.BYTE077  $  y=x1;
  $  112.闭锁触发时间标识8                   $    $       $    $  ANS008.BYTE078  $  if(x1==2) y=@06d5;else y=@0003;
  $  113.闭锁触发时间点8                     $    $       $    $  ANS008.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  114.数据索引_8                          $    $       $    $  ANS008.BYTE083  $  y=x1;
  $  115.闭锁触发记录/数据标识9              $    $       $    $  ANS008.BYTE084  $  if(x1==12) y=@02c5;else y=@02ea;
  $  116.闭锁触发原因_9                      $    $       $    $  ANS008.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  117.数据索引9                           $    $       $    $  ANS008.BYTE087  $  y=x1;
  $  118.闭锁触发时间标识9                   $    $       $    $  ANS008.BYTE088  $  if(x1==2) y=@06d5;else y=@0003;
  $  119.闭锁触发时间点9                     $    $       $    $  ANS008.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  120.数据索引_9                          $    $       $    $  ANS008.BYTE093  $  y=x1;
  $  121.闭锁触发记录/数据标识10             $    $       $    $  ANS008.BYTE094  $  if(x1==12) y=@02c5;else y=@02ea;
  $  122.闭锁触发原因_10                     $    $       $    $  ANS008.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  123.数据索引10                          $    $       $    $  ANS008.BYTE097  $  y=x1;
  $  124.闭锁触发时间标识10                  $    $       $    $  ANS008.BYTE098  $  if(x1==2) y=@06d5;else y=@0003;
  $  125.闭锁触发时间点10                    $    $       $    $  ANS008.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  126.数据索引_10                         $    $       $    $  ANS008.BYTE103  $  y=x1;
  $  127.解锁触发记录/数据标识1              $    $       $    $  ANS009.BYTE004  $  if(x1==13) y=@02c4;else y=@06b0;
  $  128.解锁触发原因_1                      $    $       $    $  ANS009.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  129.数据索引1                           $    $       $    $  ANS009.BYTE007  $  y=x1;
  $  130.解锁触发时间标识1                   $    $       $    $  ANS009.BYTE008  $  if(x1==3) y=@06b1;else y=@0003;
  $  131.解锁触发时间点1                     $    $       $    $  ANS009.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  132.数据索引_1                          $    $       $    $  ANS009.BYTE013  $  y=x1;
  $  133.解锁触发记录/数据标识2              $    $       $    $  ANS009.BYTE014  $  if(x1==13) y=@02c4;else y=@06b0;
  $  134.解锁触发原因_2                      $    $       $    $  ANS009.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  135.数据索引2                           $    $       $    $  ANS009.BYTE017  $  y=x1;
  $  136.解锁触发时间标识2                   $    $       $    $  ANS009.BYTE018  $  if(x1==3) y=@06b1;else y=@0003;
  $  137.解锁触发时间点2                     $    $       $    $  ANS009.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  138.数据索引_2                          $    $       $    $  ANS009.BYTE023  $  y=x1;
  $  139.解锁触发记录/数据标识3              $    $       $    $  ANS009.BYTE024  $  if(x1==13) y=@02c4;else y=@06b0;
  $  140.解锁触发原因_3                      $    $       $    $  ANS009.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  141.数据索引3                           $    $       $    $  ANS009.BYTE027  $  y=x1;
  $  142.解锁触发时间标识3                   $    $       $    $  ANS009.BYTE028  $  if(x1==3) y=@06b1;else y=@0003;
  $  143.解锁触发时间点3                     $    $       $    $  ANS009.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  144.数据索引_3                          $    $       $    $  ANS009.BYTE033  $  y=x1;
  $  145.解锁触发记录/数据标识4              $    $       $    $  ANS009.BYTE034  $  if(x1==13) y=@02c4;else y=@06b0;
  $  146.解锁触发原因_4                      $    $       $    $  ANS009.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  147.数据索引4                           $    $       $    $  ANS009.BYTE037  $  y=x1;
  $  148.解锁触发时间标识4                   $    $       $    $  ANS009.BYTE038  $  if(x1==3) y=@06b1;else y=@0003;
  $  149.解锁触发时间点4                     $    $       $    $  ANS009.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  150.数据索引_4                          $    $       $    $  ANS009.BYTE043  $  y=x1;
  $  151.解锁触发记录/数据标识5              $    $       $    $  ANS009.BYTE044  $  if(x1==13) y=@02c4;else y=@06b0;
  $  152.解锁触发原因_5                      $    $       $    $  ANS009.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  153.数据索引5                           $    $       $    $  ANS009.BYTE047  $  y=x1;
  $  154.解锁触发时间标识5                   $    $       $    $  ANS009.BYTE048  $  if(x1==3) y=@06b1;else y=@0003;
  $  155.解锁触发时间点5                     $    $       $    $  ANS009.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  156.数据索引_5                          $    $       $    $  ANS009.BYTE053  $  y=x1;
  $  157.解锁触发记录/数据标识6              $    $       $    $  ANS009.BYTE054  $  if(x1==13) y=@02c4;else y=@06b0;
  $  158.解锁触发原因_6                      $    $       $    $  ANS009.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  159.数据索引6                           $    $       $    $  ANS009.BYTE057  $  y=x1;
  $  160.解锁触发时间标识6                   $    $       $    $  ANS009.BYTE058  $  if(x1==3) y=@06b1;else y=@0003;
  $  161.解锁触发时间点6                     $    $       $    $  ANS009.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  162.数据索引_6                          $    $       $    $  ANS009.BYTE063  $  y=x1;
  $  163.解锁触发记录/数据标识7              $    $       $    $  ANS009.BYTE064  $  if(x1==13) y=@02c4;else y=@06b0;
  $  164.解锁触发原因_7                      $    $       $    $  ANS009.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  165.数据索引7                           $    $       $    $  ANS009.BYTE067  $  y=x1;
  $  166.解锁触发时间标识7                   $    $       $    $  ANS009.BYTE068  $  if(x1==3) y=@06b1;else y=@0003;
  $  167.解锁触发时间点7                     $    $       $    $  ANS009.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  168.数据索引_7                          $    $       $    $  ANS009.BYTE073  $  y=x1;
  $  169.解锁触发记录/数据标识8              $    $       $    $  ANS009.BYTE074  $  if(x1==13) y=@02c4;else y=@06b0;
  $  170.解锁触发原因_8                      $    $       $    $  ANS009.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  171.数据索引8                           $    $       $    $  ANS009.BYTE077  $  y=x1;
  $  172.解锁触发时间标识8                   $    $       $    $  ANS009.BYTE078  $  if(x1==3) y=@06b1;else y=@0003;
  $  173.解锁触发时间点8                     $    $       $    $  ANS009.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  174.数据索引_8                          $    $       $    $  ANS009.BYTE083  $  y=x1;
  $  175.解锁触发记录/数据标识9              $    $       $    $  ANS009.BYTE084  $  if(x1==13) y=@02c4;else y=@06b0;
  $  176.解锁触发原因_9                      $    $       $    $  ANS009.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  177.数据索引9                           $    $       $    $  ANS009.BYTE087  $  y=x1;
  $  178.解锁触发时间标识9                   $    $       $    $  ANS009.BYTE088  $  if(x1==3) y=@06b1;else y=@0003;
  $  179.解锁触发时间点9                     $    $       $    $  ANS009.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  180.数据索引_9                          $    $       $    $  ANS009.BYTE093  $  y=x1;
  $  181.解锁触发记录/数据标识10             $    $       $    $  ANS009.BYTE094  $  if(x1==13) y=@02c4;else y=@06b0;
  $  182.解锁触发原因_10                     $    $       $    $  ANS009.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  183.数据索引10                          $    $       $    $  ANS009.BYTE097  $  y=x1;
  $  184.解锁触发时间标识10                  $    $       $    $  ANS009.BYTE098  $  if(x1==3) y=@06b1;else y=@0003;
  $  185.解锁触发时间点10                    $    $       $    $  ANS009.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  186.数据索引_10                         $    $       $    $  ANS009.BYTE103  $  y=x1;
  $  187.行李箱解锁触发记录/数据标识1        $    $       $    $  ANS010.BYTE004  $  if(x1==14) y=@02c4;else y=@06b0;
  $  188.行李箱解锁触发原因_1                $    $       $    $  ANS010.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  189.数据索引1                           $    $       $    $  ANS010.BYTE007  $  y=x1;
  $  190.行李箱解锁触发时间标识1             $    $       $    $  ANS010.BYTE008  $  if(x1==4) y=@06c1;else y=@0003;
  $  191.行李箱解锁触发时间点1               $    $       $    $  ANS010.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  192.数据索引_1                          $    $       $    $  ANS010.BYTE013  $  y=x1;
  $  193.行李箱解锁触发记录/数据标识2        $    $       $    $  ANS010.BYTE014  $  if(x1==14) y=@02c4;else y=@06b0;
  $  194.行李箱解锁触发原因_2                $    $       $    $  ANS010.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  195.数据索引2                           $    $       $    $  ANS010.BYTE017  $  y=x1;
  $  196.行李箱解锁触发时间标识2             $    $       $    $  ANS010.BYTE018  $  if(x1==4) y=@06c1;else y=@0003;
  $  197.行李箱解锁触发时间点2               $    $       $    $  ANS010.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  198.数据索引_2                          $    $       $    $  ANS010.BYTE023  $  y=x1;
  $  199.行李箱解锁触发记录/数据标识3        $    $       $    $  ANS010.BYTE024  $  if(x1==14) y=@02c4;else y=@06b0;
  $  200.行李箱解锁触发原因_3                $    $       $    $  ANS010.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  201.数据索引3                           $    $       $    $  ANS010.BYTE027  $  y=x1;
  $  202.行李箱解锁触发时间标识3             $    $       $    $  ANS010.BYTE028  $  if(x1==4) y=@06c1;else y=@0003;
  $  203.行李箱解锁触发时间点3               $    $       $    $  ANS010.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  204.数据索引_3                          $    $       $    $  ANS010.BYTE033  $  y=x1;
  $  205.行李箱解锁触发记录/数据标识4        $    $       $    $  ANS010.BYTE034  $  if(x1==14) y=@02c4;else y=@06b0;
  $  206.行李箱解锁触发原因_4                $    $       $    $  ANS010.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  207.数据索引4                           $    $       $    $  ANS010.BYTE037  $  y=x1;
  $  208.行李箱解锁触发时间标识4             $    $       $    $  ANS010.BYTE038  $  if(x1==4) y=@06c1;else y=@0003;
  $  209.行李箱解锁触发时间点4               $    $       $    $  ANS010.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  210.数据索引_4                          $    $       $    $  ANS010.BYTE043  $  y=x1;
  $  211.行李箱解锁触发记录/数据标识5        $    $       $    $  ANS010.BYTE044  $  if(x1==14) y=@02c4;else y=@06b0;
  $  212.行李箱解锁触发原因_5                $    $       $    $  ANS010.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  213.数据索引5                           $    $       $    $  ANS010.BYTE047  $  y=x1;
  $  214.行李箱解锁触发时间标识5             $    $       $    $  ANS010.BYTE048  $  if(x1==4) y=@06c1;else y=@0003;
  $  215.行李箱解锁触发时间点5               $    $       $    $  ANS010.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  216.数据索引_5                          $    $       $    $  ANS010.BYTE053  $  y=x1;
  $  217.行李箱解锁触发记录/数据标识6        $    $       $    $  ANS010.BYTE054  $  if(x1==14) y=@02c4;else y=@06b0;
  $  218.行李箱解锁触发原因_6                $    $       $    $  ANS010.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  219.数据索引6                           $    $       $    $  ANS010.BYTE057  $  y=x1;
  $  220.行李箱解锁触发时间标识6             $    $       $    $  ANS010.BYTE058  $  if(x1==4) y=@06c1;else y=@0003;
  $  221.行李箱解锁触发时间点6               $    $       $    $  ANS010.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  222.数据索引_6                          $    $       $    $  ANS010.BYTE063  $  y=x1;
  $  223.行李箱解锁触发记录/数据标识7        $    $       $    $  ANS010.BYTE064  $  if(x1==14) y=@02c4;else y=@06b0;
  $  224.行李箱解锁触发原因_7                $    $       $    $  ANS010.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  225.数据索引7                           $    $       $    $  ANS010.BYTE067  $  y=x1;
  $  226.行李箱解锁触发时间标识7             $    $       $    $  ANS010.BYTE068  $  if(x1==4) y=@06c1;else y=@0003;
  $  227.行李箱解锁触发时间点7               $    $       $    $  ANS010.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  228.数据索引_7                          $    $       $    $  ANS010.BYTE073  $  y=x1;
  $  229.行李箱解锁触发记录/数据标识8        $    $       $    $  ANS010.BYTE074  $  if(x1==14) y=@02c4;else y=@06b0;
  $  230.行李箱解锁触发原因_8                $    $       $    $  ANS010.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  231.数据索引8                           $    $       $    $  ANS010.BYTE077  $  y=x1;
  $  232.行李箱解锁触发时间标识8             $    $       $    $  ANS010.BYTE078  $  if(x1==4) y=@06c1;else y=@0003;
  $  233.行李箱解锁触发时间点8               $    $       $    $  ANS010.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  234.数据索引_8                          $    $       $    $  ANS010.BYTE083  $  y=x1;
  $  235.行李箱解锁触发记录/数据标识9        $    $       $    $  ANS010.BYTE084  $  if(x1==14) y=@02c4;else y=@06b0;
  $  236.行李箱解锁触发原因_9                $    $       $    $  ANS010.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  237.数据索引9                           $    $       $    $  ANS010.BYTE087  $  y=x1;
  $  238.行李箱解锁触发时间标识9             $    $       $    $  ANS010.BYTE088  $  if(x1==4) y=@06c1;else y=@0003;
  $  239.行李箱解锁触发时间点9               $    $       $    $  ANS010.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  240.数据索引_9                          $    $       $    $  ANS010.BYTE093  $  y=x1;
  $  241.行李箱解锁触发记录/数据标识10       $    $       $    $  ANS010.BYTE094  $  if(x1==14) y=@02c4;else y=@06b0;
  $  242.行李箱解锁触发原因_10               $    $       $    $  ANS010.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  243.数据索引10                          $    $       $    $  ANS010.BYTE097  $  y=x1;
  $  244.行李箱解锁触发时间标识10            $    $       $    $  ANS010.BYTE098  $  if(x1==4) y=@06c1;else y=@0003;
  $  245.行李箱解锁触发时间点10              $    $       $    $  ANS010.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  246.数据索引_10                         $    $       $    $  ANS010.BYTE103  $  y=x1;

  $)  15.智能进入系统数据流
  $  15.智能进入系统数据流
  $  REQ000:720 03 22 27 92 00 00 00 00       $  ANS000:728 03 22 27 92 00 00 00 00
  $  REQ001:720 03 22 27 93 00 00 00 00       $  ANS001:728 03 22 27 93 00 00 00 00
  $  REQ002:720 03 22 27 94 00 00 00 00       $  ANS002:728 03 22 27 94 00 00 00 00
  $  REQ003:720 03 22 27 95 00 00 00 00       $  ANS003:728 03 22 27 95 00 00 00 00
  $  REQ004:720 03 22 27 96 00 00 00 00       $  ANS004:728 03 22 27 96 00 00 00 00
  $  REQ005:720 03 22 00 20 00 00 00 00       $  ANS005:728 03 22 00 20 00 00 00 00

  $  000.序列号                              $    $       $    $  ANS000.BYTE004  $  y=SPRINTF([%02X %02X %02X %02X %02X %02X],x1,x2,x3,x4,x5,x6);
  $  001.已匹配钥匙数                        $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@00e5;else if(x1==1) y=@00e6;else if(x1==2) y=@00e7;else if(x1==3) y=@00e8;else if(x1==4) y=@00e9;else y=@0001;
  $  002.钥匙新旧状态                        $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@069f;else if(x1==1) y=@06a0;else y=@0001;
  $  003.内部供电状况                        $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@00cb;else if(x1==255) y=@00cc;else y=@0001;
  $  004.读卡器是否失去通信                  $    $       $    $  ANS003.BYTE005  $  if(x1==0) y=@00c9;else if(x1==255) y=@00ca;else y=@0001;
  $  005.读卡器内部天线状态                  $    $       $    $  ANS003.BYTE006  $  if(x1==0) y=@0078;else if(x1==255) y=@0087;else y=@0001;
  $  006.钥匙状态                            $    $       $    $  ANS003.BYTE007  $  if(x1==2) y=@00cd;else if(x1==3) y=@00ce;else if(x1==4) y=@00cf;else if(x1==6) y=@00d0;else y=@0001;
  $  007.钥匙ID                              $    $       $    $  ANS003.BYTE008  $  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $  008.钥匙序号                            $    $       $    $  ANS003.BYTE012  $  HEX(x1);
  $  009.第一把钥匙序号                      $    $       $    $  ANS004.BYTE004  $  HEX(x1);
  $  010.第一把钥匙ID                        $    $       $    $  ANS004.BYTE005  $  HEX(x1,x2,x3);
  $  011.第二把钥匙序号                      $    $       $    $  ANS004.BYTE008  $  HEX(x1);
  $  012.第二把钥匙ID                        $    $       $    $  ANS004.BYTE009  $  HEX(x1,x2,x3);
  $  013.第三把钥匙序号                      $    $       $    $  ANS004.BYTE012  $  HEX(x1);
  $  014.第三把钥匙ID                        $    $       $    $  ANS004.BYTE013  $  HEX(x1,x2,x3);
  $  015.第四把钥匙序号                      $    $       $    $  ANS004.BYTE016  $  HEX(x1);
  $  016.第四把钥匙ID                        $    $       $    $  ANS004.BYTE017  $  HEX(x1,x2,x3);
  $  017.汽车标识编码(VIN(车辆识别码))       $    $       $    $  ANS005.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

  $)  16.燃油低压油泵系统数据流
  $  16.燃油低压油泵系统数据流
  $  REQ000:720 03 22 28 52 00 00 00 00       $  ANS000:728 03 22 28 52 00 00 00 00

  $  000.燃油泵控制状态       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;

  $)  17.天窗系统数据流
  $  17.天窗系统数据流
  $  REQ000:720 03 22 23 32 00 00 00 00       $  ANS000:728 03 22 23 32 00 00 00 00
  $  REQ001:720 03 22 23 33 00 00 00 00       $  ANS001:728 03 22 23 33 00 00 00 00
  $  REQ002:720 03 22 23 34 00 00 00 00       $  ANS002:728 03 22 23 34 00 00 00 00
  $  REQ003:720 03 22 23 35 00 00 00 00       $  ANS003:728 03 22 23 35 00 00 00 00
  $  REQ004:720 03 22 23 36 00 00 00 00       $  ANS004:728 03 22 23 36 00 00 00 00
  $  REQ005:720 03 22 23 3C 00 00 00 00       $  ANS005:728 03 22 23 3C 00 00 00 00

  $  000.天窗电机热保护状态         $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@06a1;else if(x1==1) y=@06a2;else y=@0001;
  $  001.天窗上倾开关信号           $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  002.天窗打开开关信号           $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  003.天窗关闭开关信号           $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  004.天窗防夹电机耐久次数       $    $       $    $  ANS004.BYTE004  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=25000)) y=(x2*256+x1);else if((x2*256+x1)==65534) y=@069e;else if((x2*256+x1)==65535) y=@0000;else y=@0001;
  $  005.天窗电机硬件版本           $    $       $    $  ANS005.BYTE004  $  if((x1>=0)&&(x1<=99)) y=SPRINTF([%.1f],x1*0.1);else if(x1==255) y=@0027;else y=@007b;

  $)  18.背门系统数据流
  $  18.背门系统数据流
  $  REQ000:720 03 22 24 B1 00 00 00 00       $  ANS000:728 03 22 24 B1 00 00 00 00
  $  REQ001:720 03 22 24 B2 00 00 00 00       $  ANS001:728 03 22 24 B2 00 00 00 00
  $  REQ002:720 03 22 24 B3 00 00 00 00       $  ANS002:728 03 22 24 B3 00 00 00 00
  $  REQ003:720 03 22 24 B4 00 00 00 00       $  ANS003:728 03 22 24 B4 00 00 00 00
  $  REQ004:720 03 22 24 B5 00 00 00 00       $  ANS004:728 03 22 24 B5 00 00 00 00
  $  REQ005:720 03 22 24 B6 00 00 00 00       $  ANS005:728 03 22 24 B6 00 00 00 00
  $  REQ006:720 03 22 24 B7 00 00 00 00       $  ANS006:728 03 22 24 B7 00 00 00 00
  $  REQ007:720 03 22 24 B8 00 00 00 00       $  ANS007:728 03 22 24 B8 00 00 00 00
  $  REQ008:720 03 22 24 B9 00 00 00 00       $  ANS008:728 03 22 24 B9 00 00 00 00
  $  REQ009:720 03 22 24 BA 00 00 00 00       $  ANS009:728 03 22 24 BA 00 00 00 00
  $  REQ010:720 03 22 24 BB 00 00 00 00       $  ANS010:728 03 22 24 BB 00 00 00 00

  $  000.车内后背门开关状态                                                             $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  001.蓝牙钥匙打开后背门指令发送给后车身控制器的时间——1（近5次中最早的一次）       $    $       $    $  ANS001.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  002.蓝牙钥匙打开后背门指令发送给后车身控制器的时间——2                            $    $       $    $  ANS002.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  003.蓝牙钥匙打开后背门指令发送给后车身控制器的时间——3                            $    $       $    $  ANS003.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  004.蓝牙钥匙打开后背门指令发送给后车身控制器的时间——4                            $    $       $    $  ANS004.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  005.蓝牙钥匙打开后背门指令发送给后车身控制器的时间——5（近5次中最晚的一次）       $    $       $    $  ANS005.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  006.云服务打开后背门指令发送给后车身控制器的时间——1（近5次中最早的一次）         $    $       $    $  ANS006.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  007.云服务打开后背门指令发送给后车身控制器的时间——2                              $    $       $    $  ANS007.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  008.云服务打开后背门指令发送给后车身控制器的时间——3                              $    $       $    $  ANS008.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  009.云服务打开后背门指令发送给后车身控制器的时间——4                              $    $       $    $  ANS009.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);
  $  010.云服务打开后背门指令发送给后车身控制器的时间——5（近5次中最晚的一次）         $    $       $    $  ANS010.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@0212,x5,@0213);

  $)  19.座椅通风加热系统数据流
  $  19.座椅通风加热系统数据流
  $  REQ000:720 03 22 23 F2 00 00 00 00       $  ANS000:728 03 22 23 F2 00 00 00 00

  $  000.主驾座椅通风加热工作状态       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@00db;else if(x1==1) y=@033d;else if(x1==2) y=@033e;else if(x1==3) y=@033f;else if(x1==4) y=@0341;else if((x1>=5)&&(x1<=7)) y=@007b;else y=@0001;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
