
    车型ID：3c0d

    模拟：协议模拟-->3c0d

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 03 19 02 09 00 00 00 00       $#  ANS000:7E8 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/ad000000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 80 00 00 00 00       $%  ANS000:7E8 03 22 F1 80 00 00 00 00
  $%  REQ001:7E0 03 22 F1 92 00 00 00 00       $%  ANS001:7E8 03 22 F1 92 00 00 00 00
  $%  REQ002:7E0 03 22 F1 93 00 00 00 00       $%  ANS002:7E8 03 22 F1 93 00 00 00 00
  $%  REQ003:7E0 03 22 F1 94 00 00 00 00       $%  ANS003:7E8 03 22 F1 94 00 00 00 00
  $%  REQ004:7E0 03 22 F1 95 00 00 00 00       $%  ANS004:7E8 03 22 F1 95 00 00 00 00
  $%  REQ005:7E0 03 22 F1 99 00 00 00 00       $%  ANS005:7E8 03 22 F1 99 00 00 00 00
  $%  REQ006:7E0 03 22 F1 90 00 00 00 00       $%  ANS006:7E8 03 22 F1 90 00 00 00 00

  $%  000:引导程序软件版本号/日期(年):        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%02d%s%02d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  001:软件版本:                           $%    $%  ANS000.BYTE007  $%  y=SPRINTF([%d.%d.%d.],x1,x2,x3);
  $%  002:日期:                               $%    $%  ANS000.BYTE010  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  003:硬件编号:                           $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  004:硬件版本:                           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  005:硬件日期:                           $%    $%  ANS002.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  006:软件编号:                           $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  007:软件版本:                           $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  008:软件日期:                           $%    $%  ANS004.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  009:修改次数:                           $%    $%  ANS004.BYTE009  $%  y=x1;
  $%  010:编程日期:                           $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  011:学习到的VIN(车辆识别码):            $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000.发动机出水口目标温度                        $    $  ℃       $    $  ANS000.BYTE175  $  y=SPRINTF([%d],x1-40);
  $  001.发动机转速                                  $    $  rpm      $    $  ANS000.BYTE036  $  y=SPRINTF([%d],(x1*256+x2)/4);
  $  002.电源电压                                    $    $  V        $    $  ANS000.BYTE035  $  y=SPRINTF([%.1f],x1/10);
  $  003.目标怠速(有补偿)                            $    $  rpm      $    $  ANS000.BYTE039  $  y=SPRINTF([%d],x1*10);
  $  004.进气压力                                    $    $  kpa      $    $  ANS000.BYTE046  $  y=x1;
  $  005.冷却液温度                                  $    $  ℃       $    $  ANS000.BYTE042  $  y=SPRINTF([%d],x1-40);
  $  006.目标油压                                    $    $  bar      $    $  ANS000.BYTE108  $  y=x1;
  $  007.实际油压                                    $    $  bar      $    $  ANS000.BYTE110  $  y=x1;
  $  008.油压调节阀占空比                            $    $  %        $    $  ANS000.BYTE111  $  y=SPRINTF([%.1f],x1*100/255);
  $  009.节气门开度                                  $    $  %        $    $  ANS000.BYTE055  $  y=SPRINTF([%.1f],(x1*256+x2)/10);
  $  010.节气门目标开度                              $    $  %        $    $  ANS000.BYTE049  $  y=SPRINTF([%.1f],(x1*256+x2)/10);
  $  011.充磁时间                                    $    $  ms       $    $  ANS000.BYTE063  $  y=SPRINTF([%.1f],x1/10);
  $  012.进气相位原始值                              $    $  °       $    $  ANS000.BYTE131  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  013.喷油脉宽                                    $    $  ms       $    $  ANS000.BYTE064  $  y=SPRINTF([%.1f],x1/10);
  $  014.进气流量                                    $    $  Kg/h     $    $  ANS000.BYTE047  $  y=SPRINTF([%.1f],(x1*256+x2)/10);
  $  015.目标怠速(无补偿)                            $    $  rpm      $    $  ANS000.BYTE038  $  y=SPRINTF([%d],x1*10);
  $  016.车速                                        $    $  Km/h     $    $  ANS000.BYTE040  $  y=x1;
  $  017.运行里程                                    $    $  KM       $    $  ANS000.BYTE092  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  018.运行时间                                    $    $  Min      $    $  ANS000.BYTE096  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  019.进气温度                                    $    $  ℃       $    $  ANS000.BYTE044  $  y=SPRINTF([%d],x1-40);
  $  020.增压气体温度                                $    $  ℃       $    $  ANS000.BYTE117  $  y=SPRINTF([%d],x1-40);
  $  021.目标增压压力                                $    $  kpa      $    $  ANS000.BYTE113  $  y=x1;
  $  022.实际增压压力                                $    $  kpa      $    $  ANS000.BYTE115  $  y=x1;
  $  023.目标进气相位                                $    $  °       $    $  ANS000.BYTE126  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  024.进气相位                                    $    $  °       $    $  ANS000.BYTE124  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  025.大气压力值                                  $    $  kpa      $    $  ANS000.BYTE120  $  y=x1;
  $  026.海拔校正                                    $    $  %        $    $  ANS000.BYTE121  $  y=SPRINTF([%.1f],x1*100/255);
  $  027.制动助力器压力                              $    $  kpa      $    $  ANS000.BYTE112  $  y=x1;
  $  028.点火提前角                                  $    $  °       $    $  ANS000.BYTE065  $  y=SPRINTF([%d],x1-50);
  $  029.空燃比                                      $    $  %        $    $  ANS000.BYTE128  $  y=SPRINTF([%.1f],x1/10);
  $  030.爆震传感器1                                 $    $           $    $  ANS000.BYTE069  $  y=(x1*256+x2);
  $  031.爆震传感器2                                 $    $           $    $  ANS000.BYTE071  $  y=(x1*256+x2);
  $  032.1组氧传感器电压,传感器1(氧传感器1)          $    $  V        $    $  ANS000.BYTE081  $  y=SPRINTF([%.1f],x1/255);
  $  033.1组氧传感器电压,传感器2(氧传感器2)          $    $  V        $    $  ANS000.BYTE082  $  y=SPRINTF([%.1f],x1/255);
  $  034.1组氧传感器积分值(短期修正)                 $    $           $    $  ANS000.BYTE079  $  y=SPRINTF([%.1f],x1/128);
  $  035.1组氧传感器积分值(长期修正)                 $    $           $    $  ANS000.BYTE085  $  y=SPRINTF([%.1f],x1/128);
  $  036.1缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE073  $  y=SPRINTF([%.1f],x1/10);
  $  037.2缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE074  $  y=SPRINTF([%.1f],x1/10);
  $  038.3缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE075  $  y=SPRINTF([%.1f],x1/10);
  $  039.4缸推迟点火爆震控制                         $    $  °       $    $  ANS000.BYTE076  $  y=SPRINTF([%.1f],x1/10);
  $  040.发电机励磁开度                              $    $  %        $    $  ANS000.BYTE144  $  y=SPRINTF([%.1f],x1*100/255);
  $  041.发电机目标电压                              $    $  V        $    $  ANS000.BYTE145  $  y=SPRINTF([%.1f],x1/10);
  $  042.发电机励磁电流限值                          $    $  A        $    $  ANS000.BYTE146  $  y=SPRINTF([%.1f],x1/10);
  $  043.发电机实发电压                              $    $  V        $    $  ANS000.BYTE148  $  y=SPRINTF([%.1f],x1/10);
  $  044.发电机励磁电流                              $    $  A        $    $  ANS000.BYTE149  $  y=SPRINTF([%.1f],x1/10);
  $  045.发电机负载响应时间                          $    $  s        $    $  ANS000.BYTE150  $  y=x1;
  $  046.低压油压                                    $    $  bar      $    $  ANS000.BYTE158  $  y=SPRINTF([%.1f],x1/10);
  $  047.排气相位                                    $    $  °       $    $  ANS000.BYTE161  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  048.目标排气相位                                $    $  °       $    $  ANS000.BYTE163  $  y=SPRINTF([%d],(x1*256+x2)-100);
  $  049.无级风扇占空比                              $    $  %        $    $  ANS000.BYTE102  $  y=SPRINTF([%.1f],x1*100/255);
  $  050.增压压力限制阀占空比                        $    $  %        $    $  ANS000.BYTE122  $  y=SPRINTF([%.1f],x1*100/255);
  $  051.计算节气门位置                              $    $  %        $    $  ANS000.BYTE057  $  y=SPRINTF([%.1f],x1*100/255);
  $  052.节气门电机PWM(脉宽调制)                     $    $  %        $    $  ANS000.BYTE058  $  y=SPRINTF([%.1f],x1*100/255);
  $  053.碳罐阀占空比                                $    $  %        $    $  ANS000.BYTE062  $  y=SPRINTF([%.1f],x1*100/255);
  $  054.旁通气量                                    $    $           $    $  ANS000.BYTE129  $  y=(x1*256+x2);
  $  055.冷却液温度传感器                            $    $  V        $    $  ANS000.BYTE041  $  y=SPRINTF([%.1f],x1/51);
  $  056.进气温度传感器                              $    $  V        $    $  ANS000.BYTE043  $  y=SPRINTF([%.1f],x1/51);
  $  057.进气压力传感器                              $    $  V        $    $  ANS000.BYTE045  $  y=SPRINTF([%.1f],x1/51);
  $  058.节气门位置传感器1                           $    $  V        $    $  ANS000.BYTE051  $  y=SPRINTF([%.1f],(x1*256+x2)/13107);
  $  059.节气门位置传感器2                           $    $  V        $    $  ANS000.BYTE053  $  y=SPRINTF([%.1f],(x1*256+x2)/13107);
  $  060.增压压力传感器                              $    $  V        $    $  ANS000.BYTE114  $  y=SPRINTF([%.1f],x1/51);
  $  061.增压气体温度传感器                          $    $  V        $    $  ANS000.BYTE116  $  y=SPRINTF([%.1f],x1/51);
  $  062.油压传感器                                  $    $  V        $    $  ANS000.BYTE109  $  y=SPRINTF([%.1f],x1/51);
  $  063.发动机冷却系统-低速风扇是否开启             $    $           $    $  ANS000.BYTE023  $  if(x1&0x01) y=@0185;else y=@0186;
  $  064.发动机冷却系统-高速风扇是否开启             $    $           $    $  ANS000.BYTE023  $  if(x1&0x02) y=@0185;else y=@0186;
  $  065.发动机冷却系统-风扇类型                     $    $           $    $  ANS000.BYTE023  $  if(x1&0x0C) y=@0193;else y=@0194;
  $  066.发动机稳态工况-点火电源开启                 $    $           $    $  ANS000.BYTE024  $  if(x1&0x01) y=@0185;else y=@0186;
  $  067.发动机稳态工况-主继电器工作                 $    $           $    $  ANS000.BYTE024  $  if(x1&0x02) y=@0185;else y=@0186;
  $  068.发动机动态工况-节气门处于怠速位置           $    $           $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0185;else y=@0186;
  $  069.发动机动态工况-节气门处于部分打开位置       $    $           $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0185;else y=@0186;
  $  070.发动机动态工况-节气门处于全开位置           $    $           $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0185;else y=@0186;
  $  071.发动机动态工况-激活减速断油                 $    $           $    $  ANS000.BYTE025  $  if(x1&0x08) y=@00f2;else y=@0181;
  $  072.发动机动态工况-激活加速加浓                 $    $           $    $  ANS000.BYTE025  $  if(x1&0x10) y=@00f2;else y=@0181;
  $  073.发动机动态工况-是否D档(前进档)              $    $           $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0185;else y=@0186;
  $  074.发动机动态工况-是否R档(后退档)              $    $           $    $  ANS000.BYTE025  $  if(x1&0x40) y=@0185;else y=@0186;
  $  075.发动机动态工况-是否N档(空档)                $    $           $    $  ANS000.BYTE025  $  if(x1&0x80) y=@0185;else y=@0186;
  $  076.氧传感器-氧传感器1信号                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x01) y=@017f;else y=@0180;
  $  077.氧传感器-氧传感器2信号                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x02) y=@017f;else y=@0180;
  $  078.氧传感器-氧传感器1加热                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x10) y=@0183;else y=@0184;
  $  079.氧传感器-氧传感器2加热                      $    $           $    $  ANS000.BYTE027  $  if(x1&0x20) y=@0183;else y=@0184;
  $  080.发动机怠速-制动器踏板状态                   $    $           $    $  ANS000.BYTE028  $  if(x1&0x02) y=@0118;else y=@0182;
  $  081.指示灯SVS/MIL-MIL灯激活                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x01) y=@00f2;else y=@0181;
  $  082.指示灯SVS/MIL-MIL灯闪烁                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0185;else y=@0186;
  $  083.指示灯SVS/MIL-SVS灯激活                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x10) y=@00f2;else y=@0181;
  $  084.指示灯SVS/MIL-SVS灯闪烁                     $    $           $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0185;else y=@0186;
  $  085.AT/扭矩请求-AT转换离合器激活                $    $           $    $  ANS000.BYTE032  $  if(x1&0x08) y=@00f2;else y=@0181;
  $  086.发动机状态-刹车开关激活                     $    $           $    $  ANS000.BYTE034  $  if(x1&0x01) y=@00f2;else y=@0181;
  $  087.发动机状态-刹车灯激活                       $    $           $    $  ANS000.BYTE034  $  if(x1&0x02) y=@00f2;else y=@0181;
  $  088.发动机状态-涡轮增压旁通阀                   $    $           $    $  ANS000.BYTE034  $  if(x1&0x10) y=@001d;else y=@001e;
  $  089.发动机状态-防盗锁定状态                     $    $           $    $  ANS000.BYTE034  $  if(x1&0x20) y=@000a;else y=@0459;
  $  090.水泵工作状态                                $    $           $    $  ANS000.BYTE176  $  if(x1==0) y=@07d6;else if(x1==1) y=@07d7;else if(x1==2) y=@07d8;else if(x1==3) y=@07d9;else if(x1==4) y=@07da;else if(x1==5) y=@07db;else y=@0001;
  $  091.电子水泵状态字1-水泵紧急模式状态            $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@03b3;else if(x1==1) y=@03b4;else if(x1==2) y=@07d5;else y=@0001;
  $  092.电子水泵状态字1-水泵过温状态                $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@0078;else if(x1==1) y=@03b2;else if(x1==2) y=@03b1;else y=@0001;
  $  093.电子水泵状态字1-水泵过流状态                $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@0078;else if(x1==1) y=@0345;else if(x1==2) y=@03b1;else y=@0001;
  $  094.电子水泵状态字1-水泵干转状态                $    $           $    $  ANS000.BYTE177  $  if(x1==0) y=@0078;else if(x1==1) y=@03bb;else if(x1==2) y=@03b1;else y=@0001;
  $  095.电子水泵状态字2-水泵电压状态                $    $           $    $  ANS000.BYTE178  $  if(x1==0) y=@0078;else if(x1==1) y=@01e8;else if(x1==2) y=@03b1;else y=@0001;
  $  096.电子水泵状态字2-水泵堵转状态                $    $           $    $  ANS000.BYTE178  $  if(x1==0) y=@0078;else if(x1==1) y=@0347;else if(x1==2) y=@03b1;else y=@0001;
  $  097.颗粒捕集器压差                              $    $  Kpa      $    $  ANS000.BYTE179  $  y=SPRINTF([%d],(x1*256+x2)*0.01-20);
  $  098.颗粒捕集器入口温度                          $    $  ℃       $    $  ANS000.BYTE181  $  y=SPRINTF([%d],(x1*256+x2)-60);
  $  099.颗粒捕集器内部累碳量                        $    $  mg       $    $  ANS000.BYTE183  $  y=(x1*256+x2);
  $  100.当前排气氧流量                              $    $  g/s      $    $  ANS000.BYTE187  $  y=(x1*256+x2);
  $  101.颗粒捕集器再生指令                          $    $           $    $  ANS000.BYTE189  $  if(x1==0) y=@0027;else if(x1==1) y=@0794;else y=@0001;
  $  102.颗粒捕集器再生条件满足                      $    $           $    $  ANS000.BYTE190  $  if(x1==0) y=@0027;else if(x1==1) y=@0794;else y=@0001;
  $  103.颗粒捕集器再生里程                          $    $  Km       $    $  ANS000.BYTE191  $  y=(x1*256*256+x2*256+x3);

  $)  01.IUPR
  $  01.IUPR
  $  REQ000:7E0 03 22 F1 04 00 00 00 00       $  ANS000:7E8 03 22 F1 04 00 00 00 00

  $  000.一般监测条件满足次数                                 $    $  次     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.点火循环次数                                         $    $  次     $    $  ANS000.BYTE006  $  y=(x1*256+x2);
  $  002.三元催化器监测完成次数                               $    $  次     $    $  ANS000.BYTE008  $  y=(x1*256+x2);
  $  003.三元催化器监测条件满足次数                           $    $  次     $    $  ANS000.BYTE010  $  y=(x1*256+x2);
  $  004.前氧传感器监测完成次数                               $    $  次     $    $  ANS000.BYTE012  $  y=(x1*256+x2);
  $  005.前氧传感器监测条件满足次数                           $    $  次     $    $  ANS000.BYTE014  $  y=(x1*256+x2);
  $  006.VVT(可变气门正时)监测完成次数                        $    $  次     $    $  ANS000.BYTE016  $  y=(x1*256+x2);
  $  007.VVT(可变气门正时)监测条件满足次数                    $    $  次     $    $  ANS000.BYTE018  $  y=(x1*256+x2);
  $  008.EVAP(燃油蒸发系统)燃油蒸发系统监测完成次数           $    $  次     $    $  ANS000.BYTE020  $  y=(x1*256+x2);
  $  009.EVAP(燃油蒸发系统)燃油蒸发系统监测条件满足次数       $    $  次     $    $  ANS000.BYTE022  $  y=(x1*256+x2);
  $  010.后氧传感器监测完成次数                               $    $  次     $    $  ANS000.BYTE024  $  y=(x1*256+x2);
  $  011.后氧传感器监测条件满足次数                           $    $  次     $    $  ANS000.BYTE026  $  y=(x1*256+x2);
  $  012.增压系统监测完成次数                                 $    $  次     $    $  ANS000.BYTE028  $  y=(x1*256+x2);
  $  013.增压系统监测条件满足次数                             $    $  次     $    $  ANS000.BYTE030  $  y=(x1*256+x2);
  $  014.燃油系统监测完成次数                                 $    $  次     $    $  ANS000.BYTE032  $  y=(x1*256+x2);
  $  015.燃油系统监测条件满足次数                             $    $  次     $    $  ANS000.BYTE034  $  y=(x1*256+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
