
    车型ID：3c35

    模拟：协议模拟-->3c35

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~728

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:728 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 80 00 00 00 00 00       $!  ANS000:728 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:728 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d0000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:728 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 93 00 00 00 00       $%  ANS000:728 03 22 F1 93 00 00 00 00
  $%  REQ001:720 03 22 F1 94 00 00 00 00       $%  ANS001:728 03 22 F1 94 00 00 00 00
  $%  REQ002:720 03 22 F1 95 00 00 00 00       $%  ANS002:728 03 22 F1 95 00 00 00 00
  $%  REQ003:720 03 22 F1 80 00 00 00 00       $%  ANS003:728 03 22 F1 80 00 00 00 00
  $%  REQ004:720 03 22 FF 94 00 00 00 00       $%  ANS004:728 03 22 FF 94 00 00 00 00
  $%  REQ005:720 03 22 FF 95 00 00 00 00       $%  ANS005:728 03 22 FF 95 00 00 00 00
  $%  REQ006:720 03 22 F1 00 00 00 00 00       $%  ANS006:728 03 22 F1 00 00 00 00 00
  $%  REQ007:720 03 22 F1 01 00 00 00 00       $%  ANS007:728 03 22 F1 01 00 00 00 00
  $%  REQ008:720 03 22 F1 02 00 00 00 00       $%  ANS008:728 03 22 F1 02 00 00 00 00
  $%  REQ009:720 03 22 F1 03 00 00 00 00       $%  ANS009:728 03 22 F1 03 00 00 00 00
  $%  REQ010:720 03 22 F1 04 00 00 00 00       $%  ANS010:728 03 22 F1 04 00 00 00 00
  $%  REQ011:720 03 22 F1 05 00 00 00 00       $%  ANS011:728 03 22 F1 05 00 00 00 00
  $%  REQ012:720 03 22 F1 06 00 00 00 00       $%  ANS012:728 03 22 F1 06 00 00 00 00
  $%  REQ013:720 03 22 F1 07 00 00 00 00       $%  ANS013:728 03 22 F1 07 00 00 00 00

  $%  000:硬件版本:                       $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:                       $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%d.%02d.%02d],x1+2000,x2,x3);
  $%  002:软件编号:                       $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:                       $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:                       $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  005:修改次数:                       $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:引导程序软件版本号/日期:        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  007:软件版本:                       $%    $%  ANS003.BYTE007  $%  y=SPRINTF([%d.%d],(x1%1000-x1%10)/10,x1%10);
  $%  008:次要信息:                       $%    $%  ANS003.BYTE008  $%  HEX(x1);
  $%  009:MCU型号:                        $%    $%  ANS003.BYTE009  $%  HEX(x1);
  $%  010:日期:                           $%    $%  ANS003.BYTE010  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $%  011:参数标定文件软件编码:           $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  012:参数标定文件软件版本:           $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  013:软件日期:                       $%    $%  ANS005.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  014:修改次数:                       $%    $%  ANS005.BYTE009  $%  y=x1;
  $%  015:操作系统软件编号:               $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  016:操作系统软件版本:               $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  017:软件日期:                       $%    $%  ANS007.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  018:修改次数:                       $%    $%  ANS007.BYTE009  $%  y=x1;
  $%  019:操作系统服务软件编号:           $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  020:操作系统服务软件版本:           $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  021:软件日期:                       $%    $%  ANS009.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  022:修改次数:                       $%    $%  ANS009.BYTE009  $%  y=x1;
  $%  023:片内驱动软件编号:               $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  024:片内驱动软件版本:               $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  025:软件日期:                       $%    $%  ANS011.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  026:修改次数:                       $%    $%  ANS011.BYTE009  $%  y=x1;
  $%  027:片外驱动软件编号:               $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  028:片外驱动软件版本:               $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  029:软件日期:                       $%    $%  ANS013.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  030:修改次数:                       $%    $%  ANS013.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.前大灯系统数据流
  $  00.前大灯系统数据流
  $  REQ000:720 03 22 20 02 00 00 00 00       $  ANS000:728 03 22 20 02 00 00 00 00
  $  REQ001:720 03 22 20 03 00 00 00 00       $  ANS001:728 03 22 20 03 00 00 00 00
  $  REQ002:720 03 22 20 04 00 00 00 00       $  ANS002:728 03 22 20 04 00 00 00 00
  $  REQ003:720 03 22 20 05 00 00 00 00       $  ANS003:728 03 22 20 05 00 00 00 00
  $  REQ004:720 03 22 20 06 00 00 00 00       $  ANS004:728 03 22 20 06 00 00 00 00
  $  REQ005:720 03 22 20 07 00 00 00 00       $  ANS005:728 03 22 20 07 00 00 00 00
  $  REQ006:720 03 22 20 08 00 00 00 00       $  ANS006:728 03 22 20 08 00 00 00 00
  $  REQ007:720 03 22 20 09 00 00 00 00       $  ANS007:728 03 22 20 09 00 00 00 00
  $  REQ008:720 03 22 F2 03 00 00 00 00       $  ANS008:728 03 22 F2 03 00 00 00 00
  $  REQ009:720 03 22 F2 04 00 00 00 00       $  ANS009:728 03 22 F2 04 00 00 00 00
  $  REQ010:720 03 22 F2 05 00 00 00 00       $  ANS010:728 03 22 F2 05 00 00 00 00
  $  REQ011:720 03 22 F2 00 00 00 00 00       $  ANS011:728 03 22 F2 00 00 00 00 00
  $  REQ012:720 03 22 F2 13 00 00 00 00       $  ANS012:728 03 22 F2 13 00 00 00 00
  $  REQ013:720 03 22 F2 14 00 00 00 00       $  ANS013:728 03 22 F2 14 00 00 00 00
  $  REQ014:720 03 22 F2 15 00 00 00 00       $  ANS014:728 03 22 F2 15 00 00 00 00
  $  REQ015:720 03 22 F2 10 00 00 00 00       $  ANS015:728 03 22 F2 10 00 00 00 00
  $  REQ016:720 03 22 F2 23 00 00 00 00       $  ANS016:728 03 22 F2 23 00 00 00 00
  $  REQ017:720 03 22 F2 24 00 00 00 00       $  ANS017:728 03 22 F2 24 00 00 00 00
  $  REQ018:720 03 22 F2 25 00 00 00 00       $  ANS018:728 03 22 F2 25 00 00 00 00
  $  REQ019:720 03 22 F2 20 00 00 00 00       $  ANS019:728 03 22 F2 20 00 00 00 00
  $  REQ020:720 03 22 F2 33 00 00 00 00       $  ANS020:728 03 22 F2 33 00 00 00 00
  $  REQ021:720 03 22 F2 34 00 00 00 00       $  ANS021:728 03 22 F2 34 00 00 00 00
  $  REQ022:720 03 22 F2 35 00 00 00 00       $  ANS022:728 03 22 F2 35 00 00 00 00
  $  REQ023:720 03 22 F2 30 00 00 00 00       $  ANS023:728 03 22 F2 30 00 00 00 00

  $  000.近光灯工作时长                                           $    $  h     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.远光灯工作时长                                           $    $  h     $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  002.左前位置灯工作时长                                       $    $  h     $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.左昼行灯工作时长                                         $    $  h     $    $  ANS003.BYTE004  $  y=(x1*256+x2);
  $  004.左角灯工作时长                                           $    $  h     $    $  ANS004.BYTE004  $  y=(x1*256+x2);
  $  005.小灯工作时长                                             $    $  h     $    $  ANS005.BYTE004  $  y=(x1*256+x2);
  $  006.大灯调光次数                                             $    $  c     $    $  ANS006.BYTE004  $  y=x1;
  $  007.大灯调光电机当前位置                                     $    $  %     $    $  ANS007.BYTE004  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);
  $  008.左组合后灯硬件版本                                       $    $        $    $  ANS008.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  009.左组合后灯硬件日期                                       $    $        $    $  ANS008.BYTE005  $  y=SPRINTF([%d.%02d.%02d],x1+2000,x2,x3);
  $  010.左组合后灯软件编码                                       $    $        $    $  ANS009.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  011.左组合后灯软件版本                                       $    $        $    $  ANS010.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  012.左组合后灯引导程序软件版本号/日期                        $    $        $    $  ANS011.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  013.左组合后灯引导程序软件版本号/软件版本                    $    $        $    $  ANS011.BYTE007  $  y=SPRINTF([%d.%d],(x1%1000-x1%10)/10,x1%10);
  $  014.左组合后灯引导程序软件版本号/次要信息                    $    $        $    $  ANS011.BYTE008  $  HEX(x1);
  $  015.左组合后灯引导程序软件版本号/MCU(前电机控制器)型号       $    $        $    $  ANS011.BYTE009  $  HEX(x1);
  $  016.左组合后灯引导程序软件版本号/年月日                      $    $        $    $  ANS011.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  017.右组合后灯硬件版本                                       $    $        $    $  ANS012.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  018.右组合后灯硬件日期                                       $    $        $    $  ANS012.BYTE005  $  y=SPRINTF([%d.%02d.%02d],x1+2000,x2,x3);
  $  019.右组合后灯软件编码                                       $    $        $    $  ANS013.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  020.右组合后灯软件版本                                       $    $        $    $  ANS014.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  021.右组合后灯引导程序软件版本号/日期                        $    $        $    $  ANS015.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  022.右组合后灯引导程序软件版本号/软件版本                    $    $        $    $  ANS015.BYTE007  $  y=SPRINTF([%d.%d],(x1%1000-x1%10)/10,x1%10);
  $  023.右组合后灯引导程序软件版本号/次要信息                    $    $        $    $  ANS015.BYTE008  $  HEX(x1);
  $  024.右组合后灯引导程序软件版本号/MCU(前电机控制器)型号       $    $        $    $  ANS015.BYTE009  $  HEX(x1);
  $  025.右组合后灯引导程序软件版本号/年月日                      $    $        $    $  ANS015.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  026.左尾灯硬件版本                                           $    $        $    $  ANS016.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  027.左尾灯硬件日期                                           $    $        $    $  ANS016.BYTE005  $  y=SPRINTF([%d.%02d.%02d],x1+2000,x2,x3);
  $  028.左尾灯软件编码                                           $    $        $    $  ANS017.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  029.左尾灯软件版本                                           $    $        $    $  ANS018.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  030.左尾灯引导程序软件版本号/日期                            $    $        $    $  ANS019.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  031.左尾灯引导程序软件版本号/软件版本                        $    $        $    $  ANS019.BYTE007  $  y=SPRINTF([%d.%d],(x1%1000-x1%10)/10,x1%10);
  $  032.左尾灯引导程序软件版本号/次要信息                        $    $        $    $  ANS019.BYTE008  $  HEX(x1);
  $  033.左尾灯引导程序软件版本号/MCU(前电机控制器)型号           $    $        $    $  ANS019.BYTE009  $  HEX(x1);
  $  034.左尾灯引导程序软件版本号/年月日                          $    $        $    $  ANS019.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  035.右尾灯硬件版本                                           $    $        $    $  ANS020.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  036.右尾灯硬件日期                                           $    $        $    $  ANS020.BYTE005  $  y=SPRINTF([%d.%02d.%02d],x1+2000,x2,x3);
  $  037.右尾灯软件编码                                           $    $        $    $  ANS021.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  038.右尾灯软件版本                                           $    $        $    $  ANS022.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  039.右尾灯引导程序软件版本号/日期                            $    $        $    $  ANS023.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  040.右尾灯引导程序软件版本号/软件版本                        $    $        $    $  ANS023.BYTE007  $  y=SPRINTF([%d.%d],(x1%1000-x1%10)/10,x1%10);
  $  041.右尾灯引导程序软件版本号/次要信息                        $    $        $    $  ANS023.BYTE008  $  HEX(x1);
  $  042.右尾灯引导程序软件版本号/MCU(前电机控制器)型号           $    $        $    $  ANS023.BYTE009  $  HEX(x1);
  $  043.右尾灯引导程序软件版本号/年月日                          $    $        $    $  ANS023.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);

  $)  01.转向告警灯系统数据流
  $  01.转向告警灯系统数据流
  $  REQ000:720 03 22 20 32 00 00 00 00       $  ANS000:728 03 22 20 32 00 00 00 00
  $  REQ001:720 03 22 20 33 00 00 00 00       $  ANS001:728 03 22 20 33 00 00 00 00

  $  000.左前转向灯工作时长       $    $  h     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.左后转向灯工作时长       $    $  h     $    $  ANS001.BYTE004  $  y=(x1*256+x2);

  $)  02.电除霜系统数据流
  $  02.电除霜系统数据流
  $  REQ000:720 03 22 22 32 00 00 00 00       $  ANS000:728 03 22 22 32 00 00 00 00

  $  000.电除霜控制       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@002a;else if(x1==1) y=@002b;else y=@0001;

  $)  03.喇叭系统数据流
  $  03.喇叭系统数据流
  $  REQ000:720 03 22 22 92 00 00 00 00       $  ANS000:728 03 22 22 92 00 00 00 00
  $  REQ001:720 03 22 22 93 00 00 00 00       $  ANS001:728 03 22 22 93 00 00 00 00

  $  000.喇叭历史工作时间1       $    $       $    $  ANS000.BYTE004  $  y=x1;
  $  001.喇叭历史工作时间2       $    $       $    $  ANS000.BYTE005  $  y=x1;
  $  002.喇叭历史工作时间3       $    $       $    $  ANS000.BYTE006  $  y=x1;
  $  003.喇叭历史工作时间4       $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  004.喇叭历史工作时间5       $    $       $    $  ANS000.BYTE008  $  y=x1;
  $  005.喇叭历史工作时间6       $    $       $    $  ANS000.BYTE009  $  y=x1;
  $  006.喇叭历史工作时间7       $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  007.喇叭历史工作时间8       $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  008.喇叭工作次数            $    $       $    $  ANS001.BYTE004  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);

  $)  04.车窗控制系统数据流
  $  04.车窗控制系统数据流
  $  REQ000:720 03 22 22 C2 00 00 00 00       $  ANS000:728 03 22 22 C2 00 00 00 00
  $  REQ001:720 03 22 22 C3 00 00 00 00       $  ANS001:728 03 22 22 C3 00 00 00 00
  $  REQ002:720 03 22 22 C4 00 00 00 00       $  ANS002:728 03 22 22 C4 00 00 00 00
  $  REQ003:720 03 22 22 C5 00 00 00 00       $  ANS003:728 03 22 22 C5 00 00 00 00
  $  REQ004:720 03 22 22 C6 00 00 00 00       $  ANS004:728 03 22 22 C6 00 00 00 00
  $  REQ005:720 03 22 22 C7 00 00 00 00       $  ANS005:728 03 22 22 C7 00 00 00 00
  $  REQ006:720 03 22 22 C8 00 00 00 00       $  ANS006:728 03 22 22 C8 00 00 00 00
  $  REQ007:720 03 22 22 CC 00 00 00 00       $  ANS007:728 03 22 22 CC 00 00 00 00
  $  REQ008:720 03 22 22 CD 00 00 00 00       $  ANS008:728 03 22 22 CD 00 00 00 00
  $  REQ009:720 03 22 22 CE 00 00 00 00       $  ANS009:728 03 22 22 CE 00 00 00 00
  $  REQ010:720 03 22 22 D2 00 00 00 00       $  ANS010:728 03 22 22 D2 00 00 00 00

  $  000.左前车窗自动上升开关信号       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  001.左前自动下降开关信号           $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  002.左前手动上升开关信号           $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  003.左前车窗手动下降开关信号       $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@06e9;else y=@0001;
  $  004.遥控降窗状态                   $    $       $    $  ANS004.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@06e9;else if(x1==2) y=@06df;else y=@0001;
  $  005.微动开关升降窗状态             $    $       $    $  ANS005.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else if(x1==2) y=@06df;else y=@0001;
  $  006.左前车窗防夹电机耐久次数       $    $       $    $  ANS006.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=25000)) y=(x1*256+x2);else if((x1*256+x2)==65534) y=@069e;else if((x1*256+x2)==65535) y=@0000;else y=@0001;
  $  007.左后自动下降开关信号           $    $       $    $  ANS007.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  008.左后手动上升开关信号           $    $       $    $  ANS008.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  009.左后车窗手动下降开关信号       $    $       $    $  ANS009.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else y=@0001;
  $  010.左后车窗防夹电机耐久次数       $    $       $    $  ANS010.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=25000)) y=(x1*256+x2);else if((x1*256+x2)==65534) y=@069e;else if((x1*256+x2)==65535) y=@0000;else y=@0001;

  $)  05.口盖控制系统数据流
  $  05.口盖控制系统数据流
  $  REQ000:720 03 22 23 92 00 00 00 00       $  ANS000:728 03 22 23 92 00 00 00 00
  $  REQ001:720 03 22 23 93 00 00 00 00       $  ANS001:728 03 22 23 93 00 00 00 00

  $  000.馈电解锁发生的次数             $    $       $    $  ANS000.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=65534)) y=(x1*256+x2);else if((x1*256+x2)==65535) y=@06de;else y=@0001;
  $  001.上次充电口盖馈电解锁时间       $    $       $    $  ANS001.BYTE004  $  y=SPRINTF([%d%s%02d%s%02d%s%02d%s%02d%s%02d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@02ab,x5,@0212,x6,@0213);

  $)  06.直接式胎压系统数据流
  $  06.直接式胎压系统数据流
  $  REQ000:720 03 22 33 05 00 00 00 00       $  ANS000:728 03 22 33 05 00 00 00 00
  $  REQ001:720 03 22 33 06 00 00 00 00       $  ANS001:728 03 22 33 06 00 00 00 00
  $  REQ002:720 03 22 33 07 00 00 00 00       $  ANS002:728 03 22 33 07 00 00 00 00
  $  REQ003:720 03 22 33 08 00 00 00 00       $  ANS003:728 03 22 33 08 00 00 00 00
  $  REQ004:720 03 22 33 09 00 00 00 00       $  ANS004:728 03 22 33 09 00 00 00 00
  $  REQ005:720 03 22 33 0A 00 00 00 00       $  ANS005:728 03 22 33 0A 00 00 00 00
  $  REQ006:720 03 22 33 0F 00 00 00 00       $  ANS006:728 03 22 33 0F 00 00 00 00
  $  REQ007:720 03 22 33 0E 00 00 00 00       $  ANS007:728 03 22 33 0E 00 00 00 00
  $  REQ008:720 03 22 33 10 00 00 00 00       $  ANS008:728 03 22 33 10 00 00 00 00
  $  REQ009:720 03 22 33 11 00 00 00 00       $  ANS009:728 03 22 33 11 00 00 00 00
  $  REQ010:720 03 22 33 12 00 00 00 00       $  ANS010:728 03 22 33 12 00 00 00 00
  $  REQ011:720 03 22 33 13 00 00 00 00       $  ANS011:728 03 22 33 13 00 00 00 00
  $  REQ012:720 03 22 33 14 00 00 00 00       $  ANS012:728 03 22 33 14 00 00 00 00
  $  REQ013:720 03 22 33 15 00 00 00 00       $  ANS013:728 03 22 33 15 00 00 00 00

  $  000.左前轮ID                       $    $          $    $  ANS000.BYTE004  $  HEX(x1,x2,x3,x4);
  $  001.左前轮信号状态                 $    $          $    $  ANS000.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  002.左前轮漏气状态                 $    $          $    $  ANS000.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  003.左前轮压力状态                 $    $          $    $  ANS000.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  004.左前轮压力值                   $    $  kPa     $    $  ANS000.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  005.右前轮ID                       $    $          $    $  ANS001.BYTE004  $  HEX(x1,x2,x3,x4);
  $  006.右前轮信号状态                 $    $          $    $  ANS001.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  007.右前轮漏气状态                 $    $          $    $  ANS001.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  008.右前轮压力状态                 $    $          $    $  ANS001.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  009.右前轮压力值                   $    $  kPa     $    $  ANS001.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  010.左后轮ID                       $    $          $    $  ANS002.BYTE004  $  HEX(x1,x2,x3,x4);
  $  011.左后轮信号状态                 $    $          $    $  ANS002.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  012.左后轮漏气状态                 $    $          $    $  ANS002.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  013.左后轮压力状态                 $    $          $    $  ANS002.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  014.左后轮压力值                   $    $  kPa     $    $  ANS002.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  015.右后轮ID                       $    $          $    $  ANS003.BYTE004  $  HEX(x1,x2,x3,x4);
  $  016.右后轮信号状态                 $    $          $    $  ANS003.BYTE008  $  switxh(x1)0x00: y=@0078;0x01: y=@015c;0xFF: y=@0200;default: y=@0001;
  $  017.右后轮漏气状态                 $    $          $    $  ANS003.BYTE009  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@01fe;0x02: y=@01ff;default: y=@0001;
  $  018.右后轮压力状态                 $    $          $    $  ANS003.BYTE009  $  switxh(x1&0x0C)0x00: y=@0078;0x04: y=@01fc;0x08: y=@01fd;default: y=@0001;
  $  019.右后轮压力值                   $    $  kPa     $    $  ANS003.BYTE010  $  y=SPRINTF([%d],(x2*256+x1));
  $  020.前轴标准压力                   $    $  kpa     $    $  ANS004.BYTE004  $  y=(x2*256+x1);
  $  021.后轴标准压力                   $    $  kpa     $    $  ANS005.BYTE004  $  y=(x2*256+x1);
  $  022.国标/欧标                      $    $          $    $  ANS006.BYTE004  $  if(x1==0) y=@00d1;else if(x1==1) y=@00d4;else y=@0001;
  $  023.自定位功能                     $    $          $    $  ANS007.BYTE004  $  if(x1==0) y=@0328;else if(x1==1) y=@0329;else y=@0001;
  $  024.自定位全局状态                 $    $          $    $  ANS008.BYTE004  $  if(x1==0) y=@0320;else if(x1==1) y=@0702;else if(x1==2) y=@0322;else if(x1==3) y=@0323;else if(x1==4) y=@0548;else if(x1==5) y=@0325;else if(x1==6) y=@03d7;else if(x1==7) y=@0326;else if(x1==8) y=@03d8;else if(x1==9) y=@0703;else y=@0001;
  $  025.左前轮自定位学习状态           $    $          $    $  ANS009.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  026.右前轮自定位学习状态           $    $          $    $  ANS010.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  027.左后轮自定位学习状态           $    $          $    $  ANS011.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  028.左后轮自定位学习状态           $    $          $    $  ANS012.BYTE004  $  if(x1==0) y=@027e;else if(x1==1) y=@031f;else if(x1==2) y=@031e;else if(x1==3) y=@031d;else y=@0001;
  $  029.RSSI(接收信号的强度指示)       $    $  dB      $    $  ANS013.BYTE004  $  y=x1;

  $)  07.电源控制系统数据流
  $  07.电源控制系统数据流
  $  REQ000:720 03 22 27 02 00 00 00 00       $  ANS000:728 03 22 27 02 00 00 00 00
  $  REQ001:720 03 22 27 03 00 00 00 00       $  ANS001:728 03 22 27 03 00 00 00 00
  $  REQ002:720 03 22 27 04 00 00 00 00       $  ANS002:728 03 22 27 04 00 00 00 00
  $  REQ003:720 03 22 27 05 00 00 00 00       $  ANS003:728 03 22 27 05 00 00 00 00
  $  REQ004:720 03 22 27 08 00 00 00 00       $  ANS004:728 03 22 27 08 00 00 00 00
  $  REQ005:720 03 22 27 09 00 00 00 00       $  ANS005:728 03 22 27 09 00 00 00 00
  $  REQ006:720 03 22 27 0B 00 00 00 00       $  ANS006:728 03 22 27 0B 00 00 00 00
  $  REQ007:720 03 22 27 0C 00 00 00 00       $  ANS007:728 03 22 27 0C 00 00 00 00

  $  000.12V制动信号状态        $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@0002;else y=@0001;
  $  001.0V制动灯开关状态       $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@0002;else y=@0001;
  $  002.启动按钮1脚状态        $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@009d;else if(x1==1) y=@000b;else y=@0001;
  $  003.启动按钮1脚状态        $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@009d;else if(x1==1) y=@000b;else y=@0001;
  $  004.ACC电状态              $    $       $    $  ANS004.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  005.IG1(点火1)电状态       $    $       $    $  ANS005.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  006.IG3(点火3)电状态       $    $       $    $  ANS006.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  007.IG4(点火4)电状态       $    $       $    $  ANS007.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;

  $)  08.电源控制系统数据流(启动失败原因记录)
  $  08.电源控制系统数据流(启动失败原因记录)
  $  REQ000:720 03 22 27 0F 00 00 00 00       $  ANS000:728 03 22 27 0F 00 00 00 00

  $  000.启动失败原因记录/数据标识1       $    $       $    $  ANS000.BYTE004  $  if(x1==21) y=@02c8;else y=@0092;
  $  001.启动失败原因1                    $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  002.数据索引1                        $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.启动失败时间标识1                $    $       $    $  ANS000.BYTE008  $  if(x1==5) y=@06f4;else y=@0001;
  $  004.启动失败时间点1                  $    $       $    $  ANS000.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  005.数据索引_1                       $    $       $    $  ANS000.BYTE013  $  y=x1;
  $  006.数据标识2                        $    $       $    $  ANS000.BYTE014  $  if(x1==21) y=@02c8;else y=@0092;
  $  007.启动失败原因2                    $    $       $    $  ANS000.BYTE015  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  008.数据索引2                        $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  009.启动失败时间标识2                $    $       $    $  ANS000.BYTE018  $  if(x1==5) y=@06f4;else y=@0001;
  $  010.启动失败时间点2                  $    $       $    $  ANS000.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  011.数据索引_2                       $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  012.数据标识3                        $    $       $    $  ANS000.BYTE024  $  if(x1==21) y=@02c8;else y=@0092;
  $  013.启动失败原因3                    $    $       $    $  ANS000.BYTE025  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  014.数据索引3                        $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  015.启动失败时间标识3                $    $       $    $  ANS000.BYTE028  $  if(x1==5) y=@06f4;else y=@0001;
  $  016.启动失败时间点3                  $    $       $    $  ANS000.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  017.数据索引_3                       $    $       $    $  ANS000.BYTE033  $  y=x1;
  $  018.数据标识4                        $    $       $    $  ANS000.BYTE034  $  if(x1==21) y=@02c8;else y=@0092;
  $  019.启动失败原因4                    $    $       $    $  ANS000.BYTE035  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  020.数据索引4                        $    $       $    $  ANS000.BYTE037  $  y=x1;
  $  021.启动失败时间标识4                $    $       $    $  ANS000.BYTE038  $  if(x1==5) y=@06f4;else y=@0001;
  $  022.启动失败时间点4                  $    $       $    $  ANS000.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  023.数据索引_4                       $    $       $    $  ANS000.BYTE043  $  y=x1;
  $  024.数据标识5                        $    $       $    $  ANS000.BYTE044  $  if(x1==21) y=@02c8;else y=@0092;
  $  025.启动失败原因5                    $    $       $    $  ANS000.BYTE045  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  026.数据索引5                        $    $       $    $  ANS000.BYTE047  $  y=x1;
  $  027.启动失败时间标识5                $    $       $    $  ANS000.BYTE048  $  if(x1==5) y=@06f4;else y=@0001;
  $  028.启动失败时间点5                  $    $       $    $  ANS000.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  029.数据索引_5                       $    $       $    $  ANS000.BYTE053  $  y=x1;
  $  030.数据标识6                        $    $       $    $  ANS000.BYTE054  $  if(x1==21) y=@02c8;else y=@0092;
  $  031.启动失败原因6                    $    $       $    $  ANS000.BYTE055  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  032.数据索引6                        $    $       $    $  ANS000.BYTE057  $  y=x1;
  $  033.启动失败时间标识6                $    $       $    $  ANS000.BYTE058  $  if(x1==5) y=@06f4;else y=@0001;
  $  034.启动失败时间点6                  $    $       $    $  ANS000.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  035.数据索引_6                       $    $       $    $  ANS000.BYTE063  $  y=x1;
  $  036.数据标识7                        $    $       $    $  ANS000.BYTE064  $  if(x1==21) y=@02c8;else y=@0092;
  $  037.启动失败原因7                    $    $       $    $  ANS000.BYTE065  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  038.数据索引7                        $    $       $    $  ANS000.BYTE067  $  y=x1;
  $  039.启动失败时间标识7                $    $       $    $  ANS000.BYTE068  $  if(x1==5) y=@06f4;else y=@0001;
  $  040.启动失败时间点7                  $    $       $    $  ANS000.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  041.数据索引_7                       $    $       $    $  ANS000.BYTE073  $  y=x1;
  $  042.数据标识8                        $    $       $    $  ANS000.BYTE074  $  if(x1==21) y=@02c8;else y=@0092;
  $  043.启动失败原因8                    $    $       $    $  ANS000.BYTE075  $  if(x1==1) y=@06f5;else if(x1==2) y=@0095;else if(x1==3) y=@06f6;else if(x1==4) y=@0096;else if(x1==5) y=@0097;else if(x1==6) y=@06f7;else if(x1==7) y=@0098;else if(x1==8) y=@0099;else if(x1==9) y=@009a;else if(x1==10) y=@009b;else if(x1==11) y=@06f8;else if(x1==12) y=@06f9;else if(x1==13) y=@02c7;else if(x1==14) y=@06fa;else if(x1==15) y=@06fb;else if(x1==16) y=@06fc;else if(x1==17) y=@06fd;else if(x1==18) y=@06fe;else if(x1==19) y=@06ff;else if(x1==0) y=@0003;else y=@007b;
  $  044.数据索引8                        $    $       $    $  ANS000.BYTE077  $  y=x1;
  $  045.启动失败时间标识8                $    $       $    $  ANS000.BYTE078  $  if(x1==5) y=@06f4;else y=@0001;
  $  046.启动失败时间点8                  $    $       $    $  ANS000.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  047.数据索引_8                       $    $       $    $  ANS000.BYTE083  $  y=x1;

  $)  09.电源控制系统数据流(退电失败原因记录)
  $  09.电源控制系统数据流(退电失败原因记录)
  $  REQ000:720 03 22 27 10 00 00 00 00       $  ANS000:728 03 22 27 10 00 00 00 00

  $  000.退电失败原因记录/数据标识1       $    $       $    $  ANS000.BYTE004  $  if(x1==22) y=@02c6;else y=@0092;
  $  001.退电失败原因1                    $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  002.数据索引1                        $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.退电失败时间标识1                $    $       $    $  ANS000.BYTE008  $  if(x1==6) y=@0700;else y=@0001;
  $  004.退电失败时间点1                  $    $       $    $  ANS000.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  005.数据索引_1                       $    $       $    $  ANS000.BYTE013  $  y=x1;
  $  006.数据标识2                        $    $       $    $  ANS000.BYTE014  $  if(x1==22) y=@02c6;else y=@0092;
  $  007.退电失败原因2                    $    $       $    $  ANS000.BYTE015  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  008.数据索引2                        $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  009.退电失败时间标识2                $    $       $    $  ANS000.BYTE018  $  if(x1==6) y=@0700;else y=@0001;
  $  010.退电失败时间点2                  $    $       $    $  ANS000.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  011.数据索引_2                       $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  012.数据标识3                        $    $       $    $  ANS000.BYTE024  $  if(x1==22) y=@02c6;else y=@0092;
  $  013.退电失败原因3                    $    $       $    $  ANS000.BYTE025  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  014.数据索引3                        $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  015.退电失败时间标识3                $    $       $    $  ANS000.BYTE028  $  if(x1==6) y=@0700;else y=@0001;
  $  016.退电失败时间点3                  $    $       $    $  ANS000.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  017.数据索引_3                       $    $       $    $  ANS000.BYTE033  $  y=x1;
  $  018.数据标识4                        $    $       $    $  ANS000.BYTE034  $  if(x1==22) y=@02c6;else y=@0092;
  $  019.退电失败原因4                    $    $       $    $  ANS000.BYTE035  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  020.数据索引4                        $    $       $    $  ANS000.BYTE037  $  y=x1;
  $  021.退电失败时间标识4                $    $       $    $  ANS000.BYTE038  $  if(x1==6) y=@0700;else y=@0001;
  $  022.退电失败时间点4                  $    $       $    $  ANS000.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  023.数据索引_4                       $    $       $    $  ANS000.BYTE043  $  y=x1;
  $  024.数据标识5                        $    $       $    $  ANS000.BYTE044  $  if(x1==22) y=@02c6;else y=@0092;
  $  025.退电失败原因5                    $    $       $    $  ANS000.BYTE045  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  026.数据索引5                        $    $       $    $  ANS000.BYTE047  $  y=x1;
  $  027.退电失败时间标识5                $    $       $    $  ANS000.BYTE048  $  if(x1==6) y=@0700;else y=@0001;
  $  028.退电失败时间点5                  $    $       $    $  ANS000.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  029.数据索引_5                       $    $       $    $  ANS000.BYTE053  $  y=x1;
  $  030.数据标识6                        $    $       $    $  ANS000.BYTE054  $  if(x1==22) y=@02c6;else y=@0092;
  $  031.退电失败原因6                    $    $       $    $  ANS000.BYTE055  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  032.数据索引6                        $    $       $    $  ANS000.BYTE057  $  y=x1;
  $  033.退电失败时间标识6                $    $       $    $  ANS000.BYTE058  $  if(x1==6) y=@0700;else y=@0001;
  $  034.退电失败时间点6                  $    $       $    $  ANS000.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  035.数据索引_6                       $    $       $    $  ANS000.BYTE063  $  y=x1;
  $  036.数据标识7                        $    $       $    $  ANS000.BYTE064  $  if(x1==22) y=@02c6;else y=@0092;
  $  037.退电失败原因7                    $    $       $    $  ANS000.BYTE065  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  038.数据索引7                        $    $       $    $  ANS000.BYTE067  $  y=x1;
  $  039.退电失败时间标识7                $    $       $    $  ANS000.BYTE068  $  if(x1==6) y=@0700;else y=@0001;
  $  040.退电失败时间点7                  $    $       $    $  ANS000.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  041.数据索引_7                       $    $       $    $  ANS000.BYTE073  $  y=x1;
  $  042.数据标识8                        $    $       $    $  ANS000.BYTE074  $  if(x1==22) y=@02c6;else y=@0092;
  $  043.退电失败原因8                    $    $       $    $  ANS000.BYTE075  $  if(x1==1) y=@02c0;else if(x1==2) y=@06f6;else if(x1==3) y=@06f7;else if(x1==4) y=@02c2;else if(x1==5) y=@0701;else if(x1==6) y=@0090;else if(x1==0) y=@0003;else y=@007b;
  $  044.数据索引8                        $    $       $    $  ANS000.BYTE077  $  y=x1;
  $  045.退电失败时间标识8                $    $       $    $  ANS000.BYTE078  $  if(x1==6) y=@0700;else y=@0001;
  $  046.退电失败时间点8                  $    $       $    $  ANS000.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  047.数据索引_8                       $    $       $    $  ANS000.BYTE083  $  y=x1;

  $)  10.电源控制系统数据流(行驶过程退电命令记录)
  $  10.电源控制系统数据流(行驶过程退电命令记录)
  $  REQ000:720 03 22 27 11 00 00 00 00       $  ANS000:728 03 22 27 11 00 00 00 00

  $  000.行驶过程退电命令记录/数据标识（第1组）       $    $       $    $  ANS000.BYTE004  $  if(x1==24) y=@06ab;else y=@0092;
  $  001.启动按钮1触发（第1组）                       $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  002.启动按钮4触发（第1组）                       $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  003.遥控启动或熄灭触发（第1组）                  $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  004.远程熄火触发（第1组）                        $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@0002;else y=@0003;
  $  005.车速状态（事件发生）（第1组）                $    $       $    $  ANS000.BYTE005  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  006.电源模式（事件发生）（第1组）                $    $       $    $  ANS000.BYTE005  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  007.行驶过程退电命令时间点（第1组）              $    $       $    $  ANS000.BYTE006  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  008.数据索引（第1组）                            $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  009.数据标识（第2组）                            $    $       $    $  ANS000.BYTE011  $  if(x1==24) y=@06ab;else y=@0092;
  $  010.启动按钮1触发（第2组）                       $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  011.启动按钮4触发（第2组）                       $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  012.遥控启动或熄灭触发（第2组）                  $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  013.远程熄火触发（第2组）                        $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@0002;else y=@0003;
  $  014.车速状态（事件发生）（第2组）                $    $       $    $  ANS000.BYTE012  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  015.电源模式（事件发生）（第2组）                $    $       $    $  ANS000.BYTE012  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  016.行驶过程退电命令时间点（第2组）              $    $       $    $  ANS000.BYTE013  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  017.数据索引（第2组）                            $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  018.数据标识（第3组）                            $    $       $    $  ANS000.BYTE018  $  if(x1==24) y=@06ab;else y=@0092;
  $  019.启动按钮1触发（第3组）                       $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  020.启动按钮4触发（第3组）                       $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  021.遥控启动或熄灭触发（第3组）                  $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  022.远程熄火触发（第3组）                        $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@0002;else y=@0003;
  $  023.车速状态（事件发生）（第3组）                $    $       $    $  ANS000.BYTE019  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  024.电源模式（事件发生）（第3组）                $    $       $    $  ANS000.BYTE019  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  025.行驶过程退电命令时间点（第3组）              $    $       $    $  ANS000.BYTE020  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  026.数据索引（第3组）                            $    $       $    $  ANS000.BYTE024  $  y=x1;
  $  027.数据标识（第4组）                            $    $       $    $  ANS000.BYTE025  $  if(x1==24) y=@06ab;else y=@0092;
  $  028.启动按钮1触发（第4组）                       $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  029.启动按钮4触发（第4组）                       $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  030.遥控启动或熄灭触发（第4组）                  $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  031.远程熄火触发（第4组）                        $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@0002;else y=@0003;
  $  032.车速状态（事件发生）（第4组）                $    $       $    $  ANS000.BYTE026  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  033.电源模式（事件发生）（第4组）                $    $       $    $  ANS000.BYTE026  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  034.行驶过程退电命令时间点（第4组）              $    $       $    $  ANS000.BYTE027  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  035.数据索引（第4组）                            $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  036.数据标识（第5组）                            $    $       $    $  ANS000.BYTE032  $  if(x1==24) y=@06ab;else y=@0092;
  $  037.启动按钮1触发（第5组）                       $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  038.启动按钮4触发（第5组）                       $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  039.遥控启动或熄灭触发（第5组）                  $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  040.远程熄火触发（第5组）                        $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@0002;else y=@0003;
  $  041.车速状态（事件发生）（第5组）                $    $       $    $  ANS000.BYTE033  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  042.电源模式（事件发生）（第5组）                $    $       $    $  ANS000.BYTE033  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  043.行驶过程退电命令时间点（第5组）              $    $       $    $  ANS000.BYTE034  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  044.数据索引（第5组）                            $    $       $    $  ANS000.BYTE038  $  y=x1;
  $  045.数据标识（第6组）                            $    $       $    $  ANS000.BYTE039  $  if(x1==24) y=@06ab;else y=@0092;
  $  046.启动按钮1触发（第6组）                       $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  047.启动按钮4触发（第6组）                       $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  048.遥控启动或熄灭触发（第6组）                  $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  049.远程熄火触发（第6组）                        $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@0002;else y=@0003;
  $  050.车速状态（事件发生）（第6组）                $    $       $    $  ANS000.BYTE040  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  051.电源模式（事件发生）（第6组）                $    $       $    $  ANS000.BYTE040  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  052.行驶过程退电命令时间点（第6组）              $    $       $    $  ANS000.BYTE041  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  053.数据索引（第6组）                            $    $       $    $  ANS000.BYTE045  $  y=x1;
  $  054.数据标识（第7组）                            $    $       $    $  ANS000.BYTE046  $  if(x1==24) y=@06ab;else y=@0092;
  $  055.启动按钮1触发（第7组）                       $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  056.启动按钮4触发（第7组）                       $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  057.遥控启动或熄灭触发（第7组）                  $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  058.远程熄火触发（第7组）                        $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@0002;else y=@0003;
  $  059.车速状态（事件发生）（第7组）                $    $       $    $  ANS000.BYTE047  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  060.电源模式（事件发生）（第7组）                $    $       $    $  ANS000.BYTE047  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  061.行驶过程退电命令时间点（第7组）              $    $       $    $  ANS000.BYTE048  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  062.数据索引（第7组）                            $    $       $    $  ANS000.BYTE052  $  y=x1;
  $  063.数据标识（第8组）                            $    $       $    $  ANS000.BYTE053  $  if(x1==24) y=@06ab;else y=@0092;
  $  064.启动按钮1触发（第8组）                       $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  065.启动按钮4触发（第8组）                       $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  066.遥控启动或熄灭触发（第8组）                  $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  067.远程熄火触发（第8组）                        $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@0002;else y=@0003;
  $  068.车速状态（事件发生）（第8组）                $    $       $    $  ANS000.BYTE054  $  if(x1==0) y=@06a9;else if(x1==1) y=@06aa;else y=@0003;
  $  069.电源模式（事件发生）（第8组）                $    $       $    $  ANS000.BYTE054  $  if(x1==0) y=@06a7;else if(x1==1) y=@06a8;else y=@0003;
  $  070.行驶过程退电命令时间点（第8组）              $    $       $    $  ANS000.BYTE055  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  071.数据索引（第8组）                            $    $       $    $  ANS000.BYTE059  $  y=x1;

  $)  11.电源控制系统数据流(起动机继电器故障记录)
  $  11.电源控制系统数据流(起动机继电器故障记录)
  $  REQ000:720 03 22 27 12 00 00 00 00       $  ANS000:728 03 22 27 12 00 00 00 00

  $  000.起动机继电器故障记录/数据标识（第1组）       $    $       $    $  ANS000.BYTE004  $  if(x1==22) y=@06af;else y=@0092;
  $  001.起动机吸合故障（第1组）                      $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06ae;else y=@0003;
  $  002.起动机吸合恢复正常（第1组）                  $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06ad;else y=@0003;
  $  003.起动机断开故障（第1组）                      $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06ac;else y=@0003;
  $  004.起动机断开恢复正常（第1组）                  $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06a6;else y=@0003;
  $  005.起动机继电器故障发生时间点（第1组）          $    $       $    $  ANS000.BYTE006  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  006.数据索引（第1组）                            $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  007.数据标识（第2组）                            $    $       $    $  ANS000.BYTE011  $  if(x1==22) y=@06af;else y=@0092;
  $  008.起动机吸合故障（第2组）                      $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06ae;else y=@0003;
  $  009.起动机吸合恢复正常（第2组）                  $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06ad;else y=@0003;
  $  010.起动机断开故障（第2组）                      $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06ac;else y=@0003;
  $  011.起动机断开恢复正常（第2组）                  $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06a6;else y=@0003;
  $  012.起动机继电器故障发生时间点（第2组）          $    $       $    $  ANS000.BYTE013  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  013.数据索引（第2组）                            $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  014.数据标识（第3组）                            $    $       $    $  ANS000.BYTE018  $  if(x1==22) y=@06af;else y=@0092;
  $  015.起动机吸合故障（第3组）                      $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06ae;else y=@0003;
  $  016.起动机吸合恢复正常（第3组）                  $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06ad;else y=@0003;
  $  017.起动机断开故障（第3组）                      $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06ac;else y=@0003;
  $  018.起动机断开恢复正常（第3组）                  $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06a6;else y=@0003;
  $  019.起动机继电器故障发生时间点（第3组）          $    $       $    $  ANS000.BYTE020  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  020.数据索引（第3组）                            $    $       $    $  ANS000.BYTE024  $  y=x1;
  $  021.数据标识（第4组）                            $    $       $    $  ANS000.BYTE025  $  if(x1==22) y=@06af;else y=@0092;
  $  022.起动机吸合故障（第4组）                      $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06ae;else y=@0003;
  $  023.起动机吸合恢复正常（第4组）                  $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06ad;else y=@0003;
  $  024.起动机断开故障（第4组）                      $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06ac;else y=@0003;
  $  025.起动机断开恢复正常（第4组）                  $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06a6;else y=@0003;
  $  026.起动机继电器故障发生时间点（第4组）          $    $       $    $  ANS000.BYTE027  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  027.数据索引（第4组）                            $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  028.数据标识（第5组）                            $    $       $    $  ANS000.BYTE032  $  if(x1==22) y=@06af;else y=@0092;
  $  029.起动机吸合故障（第5组）                      $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06ae;else y=@0003;
  $  030.起动机吸合恢复正常（第5组）                  $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06ad;else y=@0003;
  $  031.起动机断开故障（第5组）                      $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06ac;else y=@0003;
  $  032.起动机断开恢复正常（第5组）                  $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06a6;else y=@0003;
  $  033.起动机继电器故障发生时间点（第5组）          $    $       $    $  ANS000.BYTE034  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  034.数据索引（第5组）                            $    $       $    $  ANS000.BYTE038  $  y=x1;
  $  035.数据标识（第6组）                            $    $       $    $  ANS000.BYTE039  $  if(x1==22) y=@06af;else y=@0092;
  $  036.起动机吸合故障（第6组）                      $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06ae;else y=@0003;
  $  037.起动机吸合恢复正常（第6组）                  $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06ad;else y=@0003;
  $  038.起动机断开故障（第6组）                      $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06ac;else y=@0003;
  $  039.起动机断开恢复正常（第6组）                  $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06a6;else y=@0003;
  $  040.起动机继电器故障发生时间点（第6组）          $    $       $    $  ANS000.BYTE041  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  041.数据索引（第6组）                            $    $       $    $  ANS000.BYTE045  $  y=x1;
  $  042.数据标识（第7组）                            $    $       $    $  ANS000.BYTE046  $  if(x1==22) y=@06af;else y=@0092;
  $  043.起动机吸合故障（第7组）                      $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06ae;else y=@0003;
  $  044.起动机吸合恢复正常（第7组）                  $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06ad;else y=@0003;
  $  045.起动机断开故障（第7组）                      $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06ac;else y=@0003;
  $  046.起动机断开恢复正常（第7组）                  $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06a6;else y=@0003;
  $  047.起动机继电器故障发生时间点（第7组）          $    $       $    $  ANS000.BYTE048  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  048.数据索引（第7组）                            $    $       $    $  ANS000.BYTE052  $  y=x1;
  $  049.数据标识（第8组）                            $    $       $    $  ANS000.BYTE053  $  if(x1==22) y=@06af;else y=@0092;
  $  050.起动机吸合故障（第8组）                      $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06ae;else y=@0003;
  $  051.起动机吸合恢复正常（第8组）                  $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06ad;else y=@0003;
  $  052.起动机断开故障（第8组）                      $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06ac;else y=@0003;
  $  053.起动机断开恢复正常（第8组）                  $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06a6;else y=@0003;
  $  054.起动机继电器故障发生时间点（第8组）          $    $       $    $  ANS000.BYTE055  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  055.数据索引（第8组）                            $    $       $    $  ANS000.BYTE059  $  y=x1;

  $)  12.电源控制系统数据流(IG继电器异常断电记录)
  $  12.电源控制系统数据流(IG继电器异常断电记录)
  $  REQ000:720 03 22 27 13 00 00 00 00       $  ANS000:728 03 22 27 13 00 00 00 00

  $  000.IG继电器异常断电记录/数据标识（第1组）       $    $       $    $  ANS000.BYTE004  $  if(x1==22) y=@06a5;else y=@0092;
  $  001.IG3(点火3)继电器异常断电（第1组）            $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06a4;else y=@0003;
  $  002.IG4(点火4)继电器异常断电（第1组）            $    $       $    $  ANS000.BYTE005  $  if(x1==1) y=@06a3;else y=@0003;
  $  003.IG继电器异常断电时间点（第1组）              $    $       $    $  ANS000.BYTE006  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  004.数据索引（第1组）                            $    $       $    $  ANS000.BYTE010  $  y=x1;
  $  005.数据标识（第2组）                            $    $       $    $  ANS000.BYTE011  $  if(x1==22) y=@06a5;else y=@0092;
  $  006.IG3(点火3)继电器异常断电（第2组）            $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06a4;else y=@0003;
  $  007.IG4(点火4)继电器异常断电（第2组）            $    $       $    $  ANS000.BYTE012  $  if(x1==1) y=@06a3;else y=@0003;
  $  008.IG继电器异常断电时间点（第2组）              $    $       $    $  ANS000.BYTE013  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  009.数据索引（第2组）                            $    $       $    $  ANS000.BYTE017  $  y=x1;
  $  010.数据标识（第3组）                            $    $       $    $  ANS000.BYTE018  $  if(x1==22) y=@06a5;else y=@0092;
  $  011.IG3(点火3)继电器异常断电（第3组）            $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06a4;else y=@0003;
  $  012.IG4(点火4)继电器异常断电（第3组）            $    $       $    $  ANS000.BYTE019  $  if(x1==1) y=@06a3;else y=@0003;
  $  013.IG继电器异常断电时间点（第3组）              $    $       $    $  ANS000.BYTE020  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  014.数据索引（第3组）                            $    $       $    $  ANS000.BYTE024  $  y=x1;
  $  015.数据标识（第4组）                            $    $       $    $  ANS000.BYTE025  $  if(x1==22) y=@06a5;else y=@0092;
  $  016.IG3(点火3)继电器异常断电（第4组）            $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06a4;else y=@0003;
  $  017.IG4(点火4)继电器异常断电（第4组）            $    $       $    $  ANS000.BYTE026  $  if(x1==1) y=@06a3;else y=@0003;
  $  018.IG继电器异常断电时间点（第4组）              $    $       $    $  ANS000.BYTE027  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  019.数据索引（第4组）                            $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  020.数据标识（第5组）                            $    $       $    $  ANS000.BYTE032  $  if(x1==22) y=@06a5;else y=@0092;
  $  021.IG3(点火3)继电器异常断电（第5组）            $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06a4;else y=@0003;
  $  022.IG4(点火4)继电器异常断电（第5组）            $    $       $    $  ANS000.BYTE033  $  if(x1==1) y=@06a3;else y=@0003;
  $  023.IG继电器异常断电时间点（第5组）              $    $       $    $  ANS000.BYTE034  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  024.数据索引（第5组）                            $    $       $    $  ANS000.BYTE038  $  y=x1;
  $  025.数据标识（第6组）                            $    $       $    $  ANS000.BYTE039  $  if(x1==22) y=@06a5;else y=@0092;
  $  026.IG3(点火3)继电器异常断电（第6组）            $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06a4;else y=@0003;
  $  027.IG4(点火4)继电器异常断电（第6组）            $    $       $    $  ANS000.BYTE040  $  if(x1==1) y=@06a3;else y=@0003;
  $  028.IG继电器异常断电时间点（第6组）              $    $       $    $  ANS000.BYTE041  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  029.数据索引（第6组）                            $    $       $    $  ANS000.BYTE045  $  y=x1;
  $  030.数据标识（第7组）                            $    $       $    $  ANS000.BYTE046  $  if(x1==22) y=@06a5;else y=@0092;
  $  031.IG3(点火3)继电器异常断电（第7组）            $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06a4;else y=@0003;
  $  032.IG4(点火4)继电器异常断电（第7组）            $    $       $    $  ANS000.BYTE047  $  if(x1==1) y=@06a3;else y=@0003;
  $  033.IG继电器异常断电时间点（第7组）              $    $       $    $  ANS000.BYTE048  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  034.数据索引（第7组）                            $    $       $    $  ANS000.BYTE052  $  y=x1;
  $  035.数据标识（第8组）                            $    $       $    $  ANS000.BYTE053  $  if(x1==22) y=@06a5;else y=@0092;
  $  036.IG3(点火3)继电器异常断电（第8组）            $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06a4;else y=@0003;
  $  037.IG4(点火4)继电器异常断电（第8组）            $    $       $    $  ANS000.BYTE054  $  if(x1==1) y=@06a3;else y=@0003;
  $  038.IG继电器异常断电时间点（第8组）              $    $       $    $  ANS000.BYTE055  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  039.数据索引（第8组）                            $    $       $    $  ANS000.BYTE059  $  y=x1;

  $)  13.门控及防盗系统数据流
  $  13.门控及防盗系统数据流
  $  REQ000:720 03 22 27 32 00 00 00 00       $  ANS000:728 03 22 27 32 00 00 00 00
  $  REQ001:720 03 22 27 33 00 00 00 00       $  ANS001:728 03 22 27 33 00 00 00 00
  $  REQ002:720 03 22 27 34 00 00 00 00       $  ANS002:728 03 22 27 34 00 00 00 00
  $  REQ003:720 03 22 27 35 00 00 00 00       $  ANS003:728 03 22 27 35 00 00 00 00
  $  REQ004:720 03 22 27 36 00 00 00 00       $  ANS004:728 03 22 27 36 00 00 00 00
  $  REQ005:720 03 22 27 37 00 00 00 00       $  ANS005:728 03 22 27 37 00 00 00 00
  $  REQ006:720 03 22 27 38 00 00 00 00       $  ANS006:728 03 22 27 38 00 00 00 00
  $  REQ007:720 03 22 27 39 00 00 00 00       $  ANS007:728 03 22 27 39 00 00 00 00
  $  REQ008:720 03 22 27 3A 00 00 00 00       $  ANS008:728 03 22 27 3A 00 00 00 00
  $  REQ009:720 03 22 27 3B 00 00 00 00       $  ANS009:728 03 22 27 3B 00 00 00 00
  $  REQ010:720 03 22 27 3C 00 00 00 00       $  ANS010:728 03 22 27 3C 00 00 00 00
  $  REQ011:720 03 22 27 3D 00 00 00 00       $  ANS011:728 03 22 27 3D 00 00 00 00
  $  REQ012:720 03 22 27 3E 00 00 00 00       $  ANS012:728 03 22 27 3E 00 00 00 00
  $  REQ013:720 03 22 27 3F 00 00 00 00       $  ANS013:728 03 22 27 3F 00 00 00 00
  $  REQ014:720 03 22 27 40 00 00 00 00       $  ANS014:728 03 22 27 40 00 00 00 00
  $  REQ015:720 03 22 27 41 00 00 00 00       $  ANS015:728 03 22 27 41 00 00 00 00
  $  REQ016:720 03 22 27 42 00 00 00 00       $  ANS016:728 03 22 27 42 00 00 00 00
  $  REQ017:720 03 22 27 43 00 00 00 00       $  ANS017:728 03 22 27 43 00 00 00 00
  $  REQ018:720 03 22 27 44 00 00 00 00       $  ANS018:728 03 22 27 44 00 00 00 00

  $  000.左前门开关检测                      $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  001.左后门开关检测                      $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  002.右前门开关检测                      $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  003.右后门开关检测                      $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  004.行李箱开关检测                      $    $       $    $  ANS004.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  005.左前门锁状态                        $    $       $    $  ANS005.BYTE004  $  if(x1==0) y=@0009;else if(x1==1) y=@000a;else y=@0001;
  $  006.左后门锁状态                        $    $       $    $  ANS006.BYTE004  $  if(x1==0) y=@0009;else if(x1==1) y=@000a;else y=@0001;
  $  007.右前门锁状态                        $    $       $    $  ANS007.BYTE004  $  if(x1==0) y=@0009;else if(x1==1) y=@000a;else y=@0001;
  $  008.右后门锁状态                        $    $       $    $  ANS008.BYTE004  $  if(x1==0) y=@0009;else if(x1==1) y=@000a;else y=@0001;
  $  009.行李箱盖开启开关状态                $    $       $    $  ANS009.BYTE004  $  if(x1==0) y=@000b;else if(x1==1) y=@009d;else y=@0001;
  $  010.前舱盖状态                          $    $       $    $  ANS010.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;
  $  011.门锁保护状态                        $    $       $    $  ANS011.BYTE005  $  if(x1==0) y=@0078;else if(x1==1) y=@00ab;else if(x1==2) y=@00ac;else if(x1==3) y=@00ad;else y=@0001;
  $  012.碰撞信号状态（PWM(脉宽调制)）       $    $       $    $  ANS012.BYTE005  $  if(x1==0) y=@00a8;else if(x1==1) y=@00a9;else if(x1==2) y=@00aa;else if(x1==3) y=@007b;else y=@0001;
  $  013.硬线中控锁闭锁开关状态              $    $       $    $  ANS013.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@000b;else y=@0001;
  $  014.硬线中控锁解锁开关状态              $    $       $    $  ANS014.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@000b;else y=@0001;
  $  015.报警触发记录/数据标识1              $    $       $    $  ANS015.BYTE004  $  if(x1==11) y=@02a9;else y=@06d4;
  $  016.报警触发原因_1                      $    $       $    $  ANS015.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  017.数据索引1                           $    $       $    $  ANS015.BYTE007  $  y=x1;
  $  018.报警触发时间标识1                   $    $       $    $  ANS015.BYTE008  $  if(x1==1) y=@009e;else y=@0003;
  $  019.报警触发时间点1                     $    $       $    $  ANS015.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  020.数据索引_1                          $    $       $    $  ANS015.BYTE013  $  y=x1;
  $  021.报警触发记录/数据标识2              $    $       $    $  ANS015.BYTE014  $  if(x1==11) y=@02a9;else y=@06d4;
  $  022.报警触发原因_2                      $    $       $    $  ANS015.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  023.数据索引2                           $    $       $    $  ANS015.BYTE017  $  y=x1;
  $  024.报警触发时间标识2                   $    $       $    $  ANS015.BYTE018  $  if(x1==1) y=@009e;else y=@0003;
  $  025.报警触发时间点2                     $    $       $    $  ANS015.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  026.数据索引_2                          $    $       $    $  ANS015.BYTE023  $  y=x1;
  $  027.报警触发记录/数据标识3              $    $       $    $  ANS015.BYTE024  $  if(x1==11) y=@02a9;else y=@06d4;
  $  028.报警触发原因_3                      $    $       $    $  ANS015.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  029.数据索引3                           $    $       $    $  ANS015.BYTE027  $  y=x1;
  $  030.报警触发时间标识3                   $    $       $    $  ANS015.BYTE028  $  if(x1==1) y=@009e;else y=@0003;
  $  031.报警触发时间点3                     $    $       $    $  ANS015.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  032.数据索引_3                          $    $       $    $  ANS015.BYTE033  $  y=x1;
  $  033.报警触发记录/数据标识4              $    $       $    $  ANS015.BYTE034  $  if(x1==11) y=@02a9;else y=@06d4;
  $  034.报警触发原因_4                      $    $       $    $  ANS015.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  035.数据索引4                           $    $       $    $  ANS015.BYTE037  $  y=x1;
  $  036.报警触发时间标识4                   $    $       $    $  ANS015.BYTE038  $  if(x1==1) y=@009e;else y=@0003;
  $  037.报警触发时间点4                     $    $       $    $  ANS015.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  038.数据索引_4                          $    $       $    $  ANS015.BYTE043  $  y=x1;
  $  039.报警触发记录/数据标识5              $    $       $    $  ANS015.BYTE044  $  if(x1==11) y=@02a9;else y=@06d4;
  $  040.报警触发原因_5                      $    $       $    $  ANS015.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  041.数据索引5                           $    $       $    $  ANS015.BYTE047  $  y=x1;
  $  042.报警触发时间标识5                   $    $       $    $  ANS015.BYTE048  $  if(x1==1) y=@009e;else y=@0003;
  $  043.报警触发时间点5                     $    $       $    $  ANS015.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  044.数据索引_5                          $    $       $    $  ANS015.BYTE053  $  y=x1;
  $  045.报警触发记录/数据标识6              $    $       $    $  ANS015.BYTE054  $  if(x1==11) y=@02a9;else y=@06d4;
  $  046.报警触发原因_6                      $    $       $    $  ANS015.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  047.数据索引6                           $    $       $    $  ANS015.BYTE057  $  y=x1;
  $  048.报警触发时间标识6                   $    $       $    $  ANS015.BYTE058  $  if(x1==1) y=@009e;else y=@0003;
  $  049.报警触发时间点6                     $    $       $    $  ANS015.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  050.数据索引_6                          $    $       $    $  ANS015.BYTE063  $  y=x1;
  $  051.报警触发记录/数据标识7              $    $       $    $  ANS015.BYTE064  $  if(x1==11) y=@02a9;else y=@06d4;
  $  052.报警触发原因_7                      $    $       $    $  ANS015.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  053.数据索引7                           $    $       $    $  ANS015.BYTE067  $  y=x1;
  $  054.报警触发时间标识7                   $    $       $    $  ANS015.BYTE068  $  if(x1==1) y=@009e;else y=@0003;
  $  055.报警触发时间点7                     $    $       $    $  ANS015.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  056.数据索引_7                          $    $       $    $  ANS015.BYTE073  $  y=x1;
  $  057.报警触发记录/数据标识8              $    $       $    $  ANS015.BYTE074  $  if(x1==11) y=@02a9;else y=@06d4;
  $  058.报警触发原因_8                      $    $       $    $  ANS015.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  059.数据索引8                           $    $       $    $  ANS015.BYTE077  $  y=x1;
  $  060.报警触发时间标识8                   $    $       $    $  ANS015.BYTE078  $  if(x1==1) y=@009e;else y=@0003;
  $  061.报警触发时间点8                     $    $       $    $  ANS015.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  062.数据索引_8                          $    $       $    $  ANS015.BYTE083  $  y=x1;
  $  063.报警触发记录/数据标识9              $    $       $    $  ANS015.BYTE084  $  if(x1==11) y=@02a9;else y=@06d4;
  $  064.报警触发原因_9                      $    $       $    $  ANS015.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  065.数据索引9                           $    $       $    $  ANS015.BYTE087  $  y=x1;
  $  066.报警触发时间标识9                   $    $       $    $  ANS015.BYTE088  $  if(x1==1) y=@009e;else y=@0003;
  $  067.报警触发时间点9                     $    $       $    $  ANS015.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  068.数据索引_9                          $    $       $    $  ANS015.BYTE093  $  y=x1;
  $  069.报警触发记录/数据标识10             $    $       $    $  ANS015.BYTE094  $  if(x1==11) y=@02a9;else y=@06d4;
  $  070.报警触发原因_10                     $    $       $    $  ANS015.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06c7;if(((x2>>4)&1)==1) y=@06c8;if(((x2>>5)&1)==1) y=@06c9;if(((x2>>6)&1)==1) y=@06ca;if(((x2>>7)&1)==1) y=@06cb;if(((x1>>0)&1)==1) y=@06cc;if(((x1>>1)&1)==1) y=@06cd;if(((x1>>2)&1)==1) y=@06ce;if(((x1>>3)&1)==1) y=@06cf;if(((x1>>4)&1)==1) y=@06d0;if(((x1>>5)&1)==1) y=@06d1;if(((x1>>6)&1)==1) y=@06d2;if(((x1>>7)&1)==1) y=@06d3;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  071.数据索引10                          $    $       $    $  ANS015.BYTE097  $  y=x1;
  $  072.报警触发时间标识10                  $    $       $    $  ANS015.BYTE098  $  if(x1==1) y=@009e;else y=@0003;
  $  073.报警触发时间点10                    $    $       $    $  ANS015.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  074.数据索引_10                         $    $       $    $  ANS015.BYTE103  $  y=x1;
  $  075.闭锁触发记录/数据标识1              $    $       $    $  ANS016.BYTE004  $  if(x1==12) y=@02c5;else y=@02ea;
  $  076.闭锁触发原因_1                      $    $       $    $  ANS016.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  077.数据索引1                           $    $       $    $  ANS016.BYTE007  $  y=x1;
  $  078.闭锁触发时间标识1                   $    $       $    $  ANS016.BYTE008  $  if(x1==2) y=@06d5;else y=@0003;
  $  079.闭锁触发时间点1                     $    $       $    $  ANS016.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  080.数据索引_1                          $    $       $    $  ANS016.BYTE013  $  y=x1;
  $  081.闭锁触发记录/数据标识2              $    $       $    $  ANS016.BYTE014  $  if(x1==12) y=@02c5;else y=@02ea;
  $  082.闭锁触发原因_2                      $    $       $    $  ANS016.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  083.数据索引2                           $    $       $    $  ANS016.BYTE017  $  y=x1;
  $  084.闭锁触发时间标识2                   $    $       $    $  ANS016.BYTE018  $  if(x1==2) y=@06d5;else y=@0003;
  $  085.闭锁触发时间点2                     $    $       $    $  ANS016.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  086.数据索引_2                          $    $       $    $  ANS016.BYTE023  $  y=x1;
  $  087.闭锁触发记录/数据标识3              $    $       $    $  ANS016.BYTE024  $  if(x1==12) y=@02c5;else y=@02ea;
  $  088.闭锁触发原因_3                      $    $       $    $  ANS016.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  089.数据索引3                           $    $       $    $  ANS016.BYTE027  $  y=x1;
  $  090.闭锁触发时间标识3                   $    $       $    $  ANS016.BYTE028  $  if(x1==2) y=@06d5;else y=@0003;
  $  091.闭锁触发时间点3                     $    $       $    $  ANS016.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  092.数据索引_3                          $    $       $    $  ANS016.BYTE033  $  y=x1;
  $  093.闭锁触发记录/数据标识4              $    $       $    $  ANS016.BYTE034  $  if(x1==12) y=@02c5;else y=@02ea;
  $  094.闭锁触发原因_4                      $    $       $    $  ANS016.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  095.数据索引4                           $    $       $    $  ANS016.BYTE037  $  y=x1;
  $  096.闭锁触发时间标识4                   $    $       $    $  ANS016.BYTE038  $  if(x1==2) y=@06d5;else y=@0003;
  $  097.闭锁触发时间点4                     $    $       $    $  ANS016.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  098.数据索引_4                          $    $       $    $  ANS016.BYTE043  $  y=x1;
  $  099.闭锁触发记录/数据标识5              $    $       $    $  ANS016.BYTE044  $  if(x1==12) y=@02c5;else y=@02ea;
  $  100.闭锁触发原因_5                      $    $       $    $  ANS016.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  101.数据索引5                           $    $       $    $  ANS016.BYTE047  $  y=x1;
  $  102.闭锁触发时间标识5                   $    $       $    $  ANS016.BYTE048  $  if(x1==2) y=@06d5;else y=@0003;
  $  103.闭锁触发时间点5                     $    $       $    $  ANS016.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  104.数据索引_5                          $    $       $    $  ANS016.BYTE053  $  y=x1;
  $  105.闭锁触发记录/数据标识6              $    $       $    $  ANS016.BYTE054  $  if(x1==12) y=@02c5;else y=@02ea;
  $  106.闭锁触发原因_6                      $    $       $    $  ANS016.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  107.数据索引6                           $    $       $    $  ANS016.BYTE057  $  y=x1;
  $  108.闭锁触发时间标识6                   $    $       $    $  ANS016.BYTE058  $  if(x1==2) y=@06d5;else y=@0003;
  $  109.闭锁触发时间点6                     $    $       $    $  ANS016.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  110.数据索引_6                          $    $       $    $  ANS016.BYTE063  $  y=x1;
  $  111.闭锁触发记录/数据标识7              $    $       $    $  ANS016.BYTE064  $  if(x1==12) y=@02c5;else y=@02ea;
  $  112.闭锁触发原因_7                      $    $       $    $  ANS016.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  113.数据索引7                           $    $       $    $  ANS016.BYTE067  $  y=x1;
  $  114.闭锁触发时间标识7                   $    $       $    $  ANS016.BYTE068  $  if(x1==2) y=@06d5;else y=@0003;
  $  115.闭锁触发时间点7                     $    $       $    $  ANS016.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  116.数据索引_7                          $    $       $    $  ANS016.BYTE073  $  y=x1;
  $  117.闭锁触发记录/数据标识8              $    $       $    $  ANS016.BYTE074  $  if(x1==12) y=@02c5;else y=@02ea;
  $  118.闭锁触发原因_8                      $    $       $    $  ANS016.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  119.数据索引8                           $    $       $    $  ANS016.BYTE077  $  y=x1;
  $  120.闭锁触发时间标识8                   $    $       $    $  ANS016.BYTE078  $  if(x1==2) y=@06d5;else y=@0003;
  $  121.闭锁触发时间点8                     $    $       $    $  ANS016.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  122.数据索引_8                          $    $       $    $  ANS016.BYTE083  $  y=x1;
  $  123.闭锁触发记录/数据标识9              $    $       $    $  ANS016.BYTE084  $  if(x1==12) y=@02c5;else y=@02ea;
  $  124.闭锁触发原因_9                      $    $       $    $  ANS016.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  125.数据索引9                           $    $       $    $  ANS016.BYTE087  $  y=x1;
  $  126.闭锁触发时间标识9                   $    $       $    $  ANS016.BYTE088  $  if(x1==2) y=@06d5;else y=@0003;
  $  127.闭锁触发时间点9                     $    $       $    $  ANS016.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  128.数据索引_9                          $    $       $    $  ANS016.BYTE093  $  y=x1;
  $  129.闭锁触发记录/数据标识10             $    $       $    $  ANS016.BYTE094  $  if(x1==12) y=@02c5;else y=@02ea;
  $  130.闭锁触发原因_10                     $    $       $    $  ANS016.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@06d6;if(((x2>>4)&1)==1) y=@06d7;if(((x2>>5)&1)==1) y=@06d8;if(((x2>>6)&1)==1) y=@06d9;if(((x2>>7)&1)==1) y=@06da;if(((x1>>0)&1)==1) y=@06b7;if(((x1>>1)&1)==1) y=@06b9;if(((x1>>2)&1)==1) y=@06ba;if(((x1>>3)&1)==1) y=@06db;if(((x1>>4)&1)==1) y=@06dc;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  131.数据索引10                          $    $       $    $  ANS016.BYTE097  $  y=x1;
  $  132.闭锁触发时间标识10                  $    $       $    $  ANS016.BYTE098  $  if(x1==2) y=@06d5;else y=@0003;
  $  133.闭锁触发时间点10                    $    $       $    $  ANS016.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  134.数据索引_10                         $    $       $    $  ANS016.BYTE103  $  y=x1;
  $  135.解锁触发记录/数据标识1              $    $       $    $  ANS017.BYTE004  $  if(x1==13) y=@02c4;else y=@06b0;
  $  136.解锁触发原因_1                      $    $       $    $  ANS017.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  137.数据索引1                           $    $       $    $  ANS017.BYTE007  $  y=x1;
  $  138.解锁触发时间标识1                   $    $       $    $  ANS017.BYTE008  $  if(x1==3) y=@06b1;else y=@0003;
  $  139.解锁触发时间点1                     $    $       $    $  ANS017.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  140.数据索引_1                          $    $       $    $  ANS017.BYTE013  $  y=x1;
  $  141.解锁触发记录/数据标识2              $    $       $    $  ANS017.BYTE014  $  if(x1==13) y=@02c4;else y=@06b0;
  $  142.解锁触发原因_2                      $    $       $    $  ANS017.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  143.数据索引2                           $    $       $    $  ANS017.BYTE017  $  y=x1;
  $  144.解锁触发时间标识2                   $    $       $    $  ANS017.BYTE018  $  if(x1==3) y=@06b1;else y=@0003;
  $  145.解锁触发时间点2                     $    $       $    $  ANS017.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  146.数据索引_2                          $    $       $    $  ANS017.BYTE023  $  y=x1;
  $  147.解锁触发记录/数据标识3              $    $       $    $  ANS017.BYTE024  $  if(x1==13) y=@02c4;else y=@06b0;
  $  148.解锁触发原因_3                      $    $       $    $  ANS017.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  149.数据索引3                           $    $       $    $  ANS017.BYTE027  $  y=x1;
  $  150.解锁触发时间标识3                   $    $       $    $  ANS017.BYTE028  $  if(x1==3) y=@06b1;else y=@0003;
  $  151.解锁触发时间点3                     $    $       $    $  ANS017.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  152.数据索引_3                          $    $       $    $  ANS017.BYTE033  $  y=x1;
  $  153.解锁触发记录/数据标识4              $    $       $    $  ANS017.BYTE034  $  if(x1==13) y=@02c4;else y=@06b0;
  $  154.解锁触发原因_4                      $    $       $    $  ANS017.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  155.数据索引4                           $    $       $    $  ANS017.BYTE037  $  y=x1;
  $  156.解锁触发时间标识4                   $    $       $    $  ANS017.BYTE038  $  if(x1==3) y=@06b1;else y=@0003;
  $  157.解锁触发时间点4                     $    $       $    $  ANS017.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  158.数据索引_4                          $    $       $    $  ANS017.BYTE043  $  y=x1;
  $  159.解锁触发记录/数据标识5              $    $       $    $  ANS017.BYTE044  $  if(x1==13) y=@02c4;else y=@06b0;
  $  160.解锁触发原因_5                      $    $       $    $  ANS017.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  161.数据索引5                           $    $       $    $  ANS017.BYTE047  $  y=x1;
  $  162.解锁触发时间标识5                   $    $       $    $  ANS017.BYTE048  $  if(x1==3) y=@06b1;else y=@0003;
  $  163.解锁触发时间点5                     $    $       $    $  ANS017.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  164.数据索引_5                          $    $       $    $  ANS017.BYTE053  $  y=x1;
  $  165.解锁触发记录/数据标识6              $    $       $    $  ANS017.BYTE054  $  if(x1==13) y=@02c4;else y=@06b0;
  $  166.解锁触发原因_6                      $    $       $    $  ANS017.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  167.数据索引6                           $    $       $    $  ANS017.BYTE057  $  y=x1;
  $  168.解锁触发时间标识6                   $    $       $    $  ANS017.BYTE058  $  if(x1==3) y=@06b1;else y=@0003;
  $  169.解锁触发时间点6                     $    $       $    $  ANS017.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  170.数据索引_6                          $    $       $    $  ANS017.BYTE063  $  y=x1;
  $  171.解锁触发记录/数据标识7              $    $       $    $  ANS017.BYTE064  $  if(x1==13) y=@02c4;else y=@06b0;
  $  172.解锁触发原因_7                      $    $       $    $  ANS017.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  173.数据索引7                           $    $       $    $  ANS017.BYTE067  $  y=x1;
  $  174.解锁触发时间标识7                   $    $       $    $  ANS017.BYTE068  $  if(x1==3) y=@06b1;else y=@0003;
  $  175.解锁触发时间点7                     $    $       $    $  ANS017.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  176.数据索引_7                          $    $       $    $  ANS017.BYTE073  $  y=x1;
  $  177.解锁触发记录/数据标识8              $    $       $    $  ANS017.BYTE074  $  if(x1==13) y=@02c4;else y=@06b0;
  $  178.解锁触发原因_8                      $    $       $    $  ANS017.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  179.数据索引8                           $    $       $    $  ANS017.BYTE077  $  y=x1;
  $  180.解锁触发时间标识8                   $    $       $    $  ANS017.BYTE078  $  if(x1==3) y=@06b1;else y=@0003;
  $  181.解锁触发时间点8                     $    $       $    $  ANS017.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  182.数据索引_8                          $    $       $    $  ANS017.BYTE083  $  y=x1;
  $  183.解锁触发记录/数据标识9              $    $       $    $  ANS017.BYTE084  $  if(x1==13) y=@02c4;else y=@06b0;
  $  184.解锁触发原因_9                      $    $       $    $  ANS017.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  185.数据索引9                           $    $       $    $  ANS017.BYTE087  $  y=x1;
  $  186.解锁触发时间标识9                   $    $       $    $  ANS017.BYTE088  $  if(x1==3) y=@06b1;else y=@0003;
  $  187.解锁触发时间点9                     $    $       $    $  ANS017.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  188.数据索引_9                          $    $       $    $  ANS017.BYTE093  $  y=x1;
  $  189.解锁触发记录/数据标识10             $    $       $    $  ANS017.BYTE094  $  if(x1==13) y=@02c4;else y=@06b0;
  $  190.解锁触发原因_10                     $    $       $    $  ANS017.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@06b2;if(((x2>>2)&1)==1) y=@06b3;if(((x2>>3)&1)==1) y=@06b4;if(((x2>>4)&1)==1) y=@06b5;if(((x2>>5)&1)==1) y=@06b6;if(((x2>>6)&1)==1) y=@06b7;if(((x2>>7)&1)==1) y=@06b8;if(((x1>>0)&1)==1) y=@06b9;if(((x1>>1)&1)==1) y=@06ba;if(((x1>>2)&1)==1) y=@06bb;if(((x1>>3)&1)==1) y=@06bc;if(((x1>>4)&1)==1) y=@06bd;if(((x1>>5)&1)==1) y=@06be;if(((x1>>6)&1)==1) y=@06bf;if(((x1>>7)&1)==1) y=@06c0;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  191.数据索引10                          $    $       $    $  ANS017.BYTE097  $  y=x1;
  $  192.解锁触发时间标识10                  $    $       $    $  ANS017.BYTE098  $  if(x1==3) y=@06b1;else y=@0003;
  $  193.解锁触发时间点10                    $    $       $    $  ANS017.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  194.数据索引_10                         $    $       $    $  ANS017.BYTE103  $  y=x1;
  $  195.行李箱解锁触发记录/数据标识1        $    $       $    $  ANS018.BYTE004  $  if(x1==14) y=@02c4;else y=@06b0;
  $  196.行李箱解锁触发原因_1                $    $       $    $  ANS018.BYTE005  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  197.数据索引1                           $    $       $    $  ANS018.BYTE007  $  y=x1;
  $  198.行李箱解锁触发时间标识1             $    $       $    $  ANS018.BYTE008  $  if(x1==4) y=@06c1;else y=@0003;
  $  199.行李箱解锁触发时间点1               $    $       $    $  ANS018.BYTE009  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  200.数据索引_1                          $    $       $    $  ANS018.BYTE013  $  y=x1;
  $  201.行李箱解锁触发记录/数据标识2        $    $       $    $  ANS018.BYTE014  $  if(x1==14) y=@02c4;else y=@06b0;
  $  202.行李箱解锁触发原因_2                $    $       $    $  ANS018.BYTE015  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  203.数据索引2                           $    $       $    $  ANS018.BYTE017  $  y=x1;
  $  204.行李箱解锁触发时间标识2             $    $       $    $  ANS018.BYTE018  $  if(x1==4) y=@06c1;else y=@0003;
  $  205.行李箱解锁触发时间点2               $    $       $    $  ANS018.BYTE019  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  206.数据索引_2                          $    $       $    $  ANS018.BYTE023  $  y=x1;
  $  207.行李箱解锁触发记录/数据标识3        $    $       $    $  ANS018.BYTE024  $  if(x1==14) y=@02c4;else y=@06b0;
  $  208.行李箱解锁触发原因_3                $    $       $    $  ANS018.BYTE025  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  209.数据索引3                           $    $       $    $  ANS018.BYTE027  $  y=x1;
  $  210.行李箱解锁触发时间标识3             $    $       $    $  ANS018.BYTE028  $  if(x1==4) y=@06c1;else y=@0003;
  $  211.行李箱解锁触发时间点3               $    $       $    $  ANS018.BYTE029  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  212.数据索引_3                          $    $       $    $  ANS018.BYTE033  $  y=x1;
  $  213.行李箱解锁触发记录/数据标识4        $    $       $    $  ANS018.BYTE034  $  if(x1==14) y=@02c4;else y=@06b0;
  $  214.行李箱解锁触发原因_4                $    $       $    $  ANS018.BYTE035  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  215.数据索引4                           $    $       $    $  ANS018.BYTE037  $  y=x1;
  $  216.行李箱解锁触发时间标识4             $    $       $    $  ANS018.BYTE038  $  if(x1==4) y=@06c1;else y=@0003;
  $  217.行李箱解锁触发时间点4               $    $       $    $  ANS018.BYTE039  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  218.数据索引_4                          $    $       $    $  ANS018.BYTE043  $  y=x1;
  $  219.行李箱解锁触发记录/数据标识5        $    $       $    $  ANS018.BYTE044  $  if(x1==14) y=@02c4;else y=@06b0;
  $  220.行李箱解锁触发原因_5                $    $       $    $  ANS018.BYTE045  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  221.数据索引5                           $    $       $    $  ANS018.BYTE047  $  y=x1;
  $  222.行李箱解锁触发时间标识5             $    $       $    $  ANS018.BYTE048  $  if(x1==4) y=@06c1;else y=@0003;
  $  223.行李箱解锁触发时间点5               $    $       $    $  ANS018.BYTE049  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  224.数据索引_5                          $    $       $    $  ANS018.BYTE053  $  y=x1;
  $  225.行李箱解锁触发记录/数据标识6        $    $       $    $  ANS018.BYTE054  $  if(x1==14) y=@02c4;else y=@06b0;
  $  226.行李箱解锁触发原因_6                $    $       $    $  ANS018.BYTE055  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  227.数据索引6                           $    $       $    $  ANS018.BYTE057  $  y=x1;
  $  228.行李箱解锁触发时间标识6             $    $       $    $  ANS018.BYTE058  $  if(x1==4) y=@06c1;else y=@0003;
  $  229.行李箱解锁触发时间点6               $    $       $    $  ANS018.BYTE059  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  230.数据索引_6                          $    $       $    $  ANS018.BYTE063  $  y=x1;
  $  231.行李箱解锁触发记录/数据标识7        $    $       $    $  ANS018.BYTE064  $  if(x1==14) y=@02c4;else y=@06b0;
  $  232.行李箱解锁触发原因_7                $    $       $    $  ANS018.BYTE065  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  233.数据索引7                           $    $       $    $  ANS018.BYTE067  $  y=x1;
  $  234.行李箱解锁触发时间标识7             $    $       $    $  ANS018.BYTE068  $  if(x1==4) y=@06c1;else y=@0003;
  $  235.行李箱解锁触发时间点7               $    $       $    $  ANS018.BYTE069  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  236.数据索引_7                          $    $       $    $  ANS018.BYTE073  $  y=x1;
  $  237.行李箱解锁触发记录/数据标识8        $    $       $    $  ANS018.BYTE074  $  if(x1==14) y=@02c4;else y=@06b0;
  $  238.行李箱解锁触发原因_8                $    $       $    $  ANS018.BYTE075  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  239.数据索引8                           $    $       $    $  ANS018.BYTE077  $  y=x1;
  $  240.行李箱解锁触发时间标识8             $    $       $    $  ANS018.BYTE078  $  if(x1==4) y=@06c1;else y=@0003;
  $  241.行李箱解锁触发时间点8               $    $       $    $  ANS018.BYTE079  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  242.数据索引_8                          $    $       $    $  ANS018.BYTE083  $  y=x1;
  $  243.行李箱解锁触发记录/数据标识9        $    $       $    $  ANS018.BYTE084  $  if(x1==14) y=@02c4;else y=@06b0;
  $  244.行李箱解锁触发原因_9                $    $       $    $  ANS018.BYTE085  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  245.数据索引9                           $    $       $    $  ANS018.BYTE087  $  y=x1;
  $  246.行李箱解锁触发时间标识9             $    $       $    $  ANS018.BYTE088  $  if(x1==4) y=@06c1;else y=@0003;
  $  247.行李箱解锁触发时间点9               $    $       $    $  ANS018.BYTE089  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  248.数据索引_9                          $    $       $    $  ANS018.BYTE093  $  y=x1;
  $  249.行李箱解锁触发记录/数据标识10       $    $       $    $  ANS018.BYTE094  $  if(x1==14) y=@02c4;else y=@06b0;
  $  250.行李箱解锁触发原因_10               $    $       $    $  ANS018.BYTE095  $  strcat:if(((x2>>0)&1)==1) y=@00da;if(((x2>>1)&1)==1) y=@00da;if(((x2>>2)&1)==1) y=@00da;if(((x2>>3)&1)==1) y=@00da;if(((x2>>4)&1)==1) y=@00da;if(((x2>>5)&1)==1) y=@00da;if(((x2>>6)&1)==1) y=@00da;if(((x2>>7)&1)==1) y=@00da;if(((x1>>0)&1)==1) y=@00da;if(((x1>>1)&1)==1) y=@06c2;if(((x1>>2)&1)==1) y=@06c3;if(((x1>>3)&1)==1) y=@06c4;if(((x1>>4)&1)==1) y=@06b7;if(((x1>>5)&1)==1) y=@06c5;if(((x1>>6)&1)==1) y=@06c6;if(((x1>>7)&1)==1) y=@06be;if((x1==0x00)&&(x2==0x00)) y=@0003;
  $  251.数据索引10                          $    $       $    $  ANS018.BYTE097  $  y=x1;
  $  252.行李箱解锁触发时间标识10            $    $       $    $  ANS018.BYTE098  $  if(x1==4) y=@06c1;else y=@0003;
  $  253.行李箱解锁触发时间点10              $    $       $    $  ANS018.BYTE099  $  y=SPRINTF([%d%s%d%s%d%s%d%s],x1,@0198,x2,@06dd,x3,@02ab,x4,@0212);
  $  254.数据索引_10                         $    $       $    $  ANS018.BYTE103  $  y=x1;

  $)  14.智能进入系统数据流
  $  14.智能进入系统数据流
  $  REQ000:720 03 22 27 92 00 00 00 00       $  ANS000:728 03 22 27 92 00 00 00 00
  $  REQ001:720 03 22 27 93 00 00 00 00       $  ANS001:728 03 22 27 93 00 00 00 00
  $  REQ002:720 03 22 27 94 00 00 00 00       $  ANS002:728 03 22 27 94 00 00 00 00
  $  REQ003:720 03 22 27 95 00 00 00 00       $  ANS003:728 03 22 27 95 00 00 00 00
  $  REQ004:720 03 22 27 96 00 00 00 00       $  ANS004:728 03 22 27 96 00 00 00 00
  $  REQ005:720 03 22 00 20 00 00 00 00       $  ANS005:728 03 22 00 20 00 00 00 00

  $  000.序列号                              $    $       $    $  ANS000.BYTE004  $  y=SPRINTF([%02X %02X %02X %02X %02X %02X],x1,x2,x3,x4,x5,x6);
  $  001.已匹配钥匙数                        $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@00e5;else if(x1==1) y=@00e6;else if(x1==2) y=@00e7;else if(x1==3) y=@00e8;else if(x1==4) y=@00e9;else y=@0001;
  $  002.钥匙新旧状态                        $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@069f;else if(x1==1) y=@06a0;else y=@0001;
  $  003.内部供电状况                        $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@00cb;else if(x1==255) y=@00cc;else y=@0001;
  $  004.读卡器是否失去通信                  $    $       $    $  ANS003.BYTE005  $  if(x1==0) y=@00c9;else if(x1==255) y=@00ca;else y=@0001;
  $  005.读卡器内部天线状态                  $    $       $    $  ANS003.BYTE006  $  if(x1==0) y=@0078;else if(x1==255) y=@0087;else y=@0001;
  $  006.钥匙状态                            $    $       $    $  ANS003.BYTE007  $  if(x1==2) y=@00cd;else if(x1==3) y=@00ce;else if(x1==4) y=@00cf;else if(x1==6) y=@00d0;else y=@0001;
  $  007.钥匙ID                              $    $       $    $  ANS003.BYTE008  $  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $  008.钥匙序号                            $    $       $    $  ANS003.BYTE012  $  HEX(x1);
  $  009.第一把钥匙序号                      $    $       $    $  ANS004.BYTE004  $  HEX(x1);
  $  010.第一把钥匙ID                        $    $       $    $  ANS004.BYTE005  $  HEX(x1,x2,x3);
  $  011.第二把钥匙序号                      $    $       $    $  ANS004.BYTE008  $  HEX(x1);
  $  012.第二把钥匙ID                        $    $       $    $  ANS004.BYTE009  $  HEX(x1,x2,x3);
  $  013.第三把钥匙序号                      $    $       $    $  ANS004.BYTE012  $  HEX(x1);
  $  014.第三把钥匙ID                        $    $       $    $  ANS004.BYTE013  $  HEX(x1,x2,x3);
  $  015.第四把钥匙序号                      $    $       $    $  ANS004.BYTE016  $  HEX(x1);
  $  016.第四把钥匙ID                        $    $       $    $  ANS004.BYTE017  $  HEX(x1,x2,x3);
  $  017.汽车标识编码(VIN(车辆识别码))       $    $       $    $  ANS005.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

  $)  15.燃油低压油泵系统数据流
  $  15.燃油低压油泵系统数据流
  $  REQ000:720 03 22 28 52 00 00 00 00       $  ANS000:728 03 22 28 52 00 00 00 00

  $  000.燃油泵控制状态       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@001d;else y=@0001;

  $)  16.座椅通风加热系统数据流
  $  16.座椅通风加热系统数据流
  $  REQ000:720 03 22 23 F2 00 00 00 00       $  ANS000:728 03 22 23 F2 00 00 00 00

  $  000.主驾座椅通风加热工作状态       $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@00db;else if(x1==1) y=@033d;else if(x1==2) y=@033e;else if(x1==3) y=@033f;else if(x1==4) y=@0341;else if((x1>=5)&&(x1<=7)) y=@007b;else y=@0001;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
