
    车型ID：a217

    模拟：协议模拟-->a217

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~76F

进入命令:

  $~  REQ000:767 02 10 01 00 00 00 00 00       $~  ANS000:76F 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:767 02 3E 80 00 00 00 00 00       $!  ANS000:76F 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:767 04 18 00 00 FF 00 00 00       $#  ANS000:76F 04 18 00 00 FF 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE02 控制故障码个数，从$#ANS000.BYTE3$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a2040000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:767 03 14 00 FF 00 00 00 00       $$  ANS000:76F 03 14 00 FF 00 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:767 03 22 F1 94 00 00 00 00       $%  ANS000:76F 03 22 F1 94 00 00 00 00
  $%  REQ001:767 03 22 F1 95 00 00 00 00       $%  ANS001:76F 03 22 F1 95 00 00 00 00
  $%  REQ002:767 03 22 F1 93 00 00 00 00       $%  ANS002:76F 03 22 F1 93 00 00 00 00

  $%  000:软件类型:          $%    $%  ANS000.BYTE006  $%  if(x1==0x00)y=@0b0c;else if(x1==0x01)y=@0b0d;else y=@0525;
  $%  001:车型:              $%    $%  ANS000.BYTE007  $%  if(x1!=0x03) y=@0525;else if(x2==0xE8)y=@0af6;else if(x2==0xE9)y=@0af7;else if(x2==0xEA)y=@0af8;else if(x2==0xEB)y=@0af9;else if(x2==0xEC)y=@0afa;else if(x2==0xED)y=@0afb;else if(x2==0xEE)y=@0afc;else if(x2==0xEF)y=@0afd;else if(x2==0xF0)y=@0afe;else if(x2==0xF1)y=@0aff;else if(x2==0xF2)y=@0b00;else if(x2==0xF3)y=@0b01;else if(x2==0xF4)y=@0b02;else if(x2==0xF5)y=@0b03;else if(x2==0xF6)y=@0b04;else if(x2==0xF7)y=@0b05;else if(x2==0xF8)y=@0b06;else if(x2==0xF9)y=@0b07;else if(x2==0xFA)y=@0b08;else if(x2==0xFB)y=@0b09;else if(x2==0xFC)y=@0369;else if(x2==0xFD)y=@0b0a;else if(x2==0xFE)y=@0b0b;else if(x2==0xFF)y=@08da;else y=@0525;
  $%  002:ECU类型:           $%    $%  ANS000.BYTE009  $%  if(x1==0x00)y=@0b0f;else if(x1==0x01)y=@0b10;else if(x1==0x02)y=@0b11;else if(x1==0x03)y=@0b12;else if(x1==0x04)y=@0b13;else if(x1==0x05)y=@0b14;else if(x1==0x06)y=@0b15;else if(x1==0x07)y=@0b16;else if(x1==0x08)y=@0b17;else if(x1==0x09)y=@0b18;else if(x1==0x0A)y=@0b19;else if(x1==0x0B)y=@0b1a;else if(x1==0x0C)y=@0b1b;else if(x1==0x0D)y=@0b1c;else if(x1==0x0E)y=@0b1d;else if(x1==0x0F)y=@0b1e;else if(x1==0x10)y=@0b1f;else if(x1==0x11)y=@0b20;else if(x1==0x12)y=@0b21;else if(x1==0x13)y=@0b22;else if(x1==0x14)y=@0b23;else if(x1==0x15)y=@0b24;else if(x1==0x16)y=@0b25;else if(x1==0x17)y=@0b26;else if(x1==0x18)y=@0b27;else if(x1==0x19)y=@0b28;else if(x1==0x1A)y=@0b29;else if(x1==0x1B)y=@0b2a;else if(x==0x1C) y=@0b2b;else if(x==0x1D) y=@0b2c;else if(x==0x1E) y=@0b2d;else if(x==0x1F) y=@0b2e;else if(x==0x20) y=@0b2f;else if(x==0x21) y=@0b30;else if(x==0x22) y=@0b31;else if(x==0x23) y=@0b32;else if(x==0x24) y=@0b33;else if(x==0x25) y=@0b34;else if(x==0x26) y=@0b35;else y=@001b;
  $%  003:适用地区:          $%    $%  ANS000.BYTE010  $%  if(x1==0x00)y=@0b0e;else y=@0525;
  $%  004:扩展信息1:         $%    $%  ANS000.BYTE011  $%  if(x1==0x00)y=@01f9;else y=@0525;
  $%  005:扩展信息2:         $%    $%  ANS000.BYTE010  $%  if(x1==0x00)y=@01f9;else y=@0525;
  $%  006:软件版本号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  007:发布日期:          $%    $%  ANS001.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);
  $%  008:次数:              $%    $%  ANS001.BYTE010  $%  y=x1;
  $%  009:硬件版本号:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  010:发布日期:          $%    $%  ANS002.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);
  $%  011:扩展信息:          $%    $%  ANS002.BYTE010  $%  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:767 30 01 04 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
