电池管理系统(2016.5之后)

  电源：#16(16PIN)
    地：#4,#5(16PIN)
破解人：梁恒飞
通讯线：$~06$~14$~250K$~18FF05F4
通讯线：$~01$~09$~250K$~18FF05F4

;--------------------------------------------------------------------------------------------
00.版本信息
01.读故障码
02.读数据流

;============================================================================================
XX.激活/空闲/加密/版本/30帧/退出命令


;============================================================================================
00.版本信息 ;;;InfoMode=0001

$% REQ00:18FF64F4 00 $%

;;;00.硬件版本 $% $% ANS00.BYTE000     $% ex in program,swcode:0005
;;;01.软件版本 $% $% ANS00.BYTE002     $% ex in program,swcode:0005

;============================================================================================
01.读故障码

$# REQ00:18FF05F4 00 $# ;;;FaultMode:05

从$# BYTE00 $#开始，每$# 00 $#个字节表示一个故障码，前$# 00 $#个字节表示码号。

;============================================================================================
02.读数据流 ;;;LiveMode=0006

$ REQ000:18C0EFF4 00 $

$ 000.总电压             $ $ V $ [,] $ ANS000.BYTE000-001 $ y=(x2*256+x1);
$ 001.总电流             $ $ A $ [,] $ ANS000.BYTE002-003 $ y=(x2*256+x1)*0.1-350;
$ 002.外接充电线连接状态 $ $   $ [,] $ ANS000.BYTE004     $ if((((x1>>0)&0x01))==0x00) y=@5000;else if((((x1>>0)&0x01))==0x01) y=@5001;
$ 003.CP信号             $ $   $ [,] $ ANS000.BYTE004     $ if((((x1>>1)&0x01))==0x00) y=@5002;else if((((x1>>1)&0x01))==0x01) y=@5003;
$ 004.总负接触器KS状态   $ $   $ [,] $ ANS000.BYTE004     $ if((((x1>>2)&0x01))==0x00) y=@5004;else if((((x1>>2)&0x01))==0x01) y=@5005;
$ 005.开关S2状态         $ $   $ [,] $ ANS000.BYTE004     $ if((((x1>>3)&0x01))==0x00) y=@5006;else if((((x1>>3)&0x01))==0x01) y=@5007;
$ 006.与充电机通讯状态   $ $   $ [,] $ ANS000.BYTE004     $ if((((x1>>4)&0x01))==0x00) y=@5008;else if((((x1>>4)&0x01))==0x01) y=@5009;
$ 007.电池包均衡状态     $ $   $ [,] $ ANS000.BYTE004     $ if((((x1>>5)&0x01))==0x00) y=@500a;else if((((x1>>5)&0x01))==0x01) y=@500b;
$ 008.冷却风扇状态       $ $   $ [,] $ ANS000.BYTE004     $ if((((x1>>6)&0x01))==0x00) y=@500c;else if((((x1>>6)&0x01))==0x01) y=@500d;
$ 009.电池组当前的SOC    $ $ % $ [,] $ ANS000.BYTE005     $ if(x1<0x64)y=x1;else y=@500e;
$ 010.电池组当前状态     $ $   $ [,] $ ANS000.BYTE006     $ if((((x1>>0)&0x03))==0x00) y=@500f;else if((((x1>>0)&0x03))==0x01) y=@5010;else if((((x1>>0)&0x03))==0x02) y=@5011;else if((((x1>>0)&0x03))==0x03) y=@5012;
$ 011.故障等级           $ $   $ [,] $ ANS000.BYTE006     $ if((((x1>>2)&0x07))==0x00) y=@5013;else if((((x1>>2)&0x07))==0x01) y=@5014;else if((((x1>>2)&0x07))==0x02) y=@5015;else if((((x1>>2)&0x07))==0x03) y=@5016;else if((((x1>>2)&0x07))==0x04) y=@5017;else y=@5011;
$ 012.能量回馈使能       $ $   $ [,] $ ANS000.BYTE006     $ if((((x1>>5)&0x01))==0x00) y=@5018;else if((((x1>>5)&0x01))==0x01) y=@5019;
$ 013.动力电池报警指示   $ $   $ [,] $ ANS000.BYTE006     $ if((((x1>>6)&0x01))==0x00) y=@5013;else if((((x1>>6)&0x01))==0x01) y=@501a;
$ 014.降功率等级         $ $   $ [,] $ ANS000.BYTE006-007 $ if((((x1>>7)<<1)+((x2&0x01)))==0x00) y=@5002;else if((((x1>>7)<<1)+((x2&0x01)))==0x01) y=@501b;else if((((x1>>7)<<1)+((x2&0x01)))==0x02) y=@501c;else if((((x1>>7)<<1)+((x2&0x01)))==0x03) y=@501d;

<STRTABLE>
	IMS_DSSTRING_5000	外接充电线没有连接	DS_FE00000700C7
	IMS_DSSTRING_5001	外接充电线连接	DS_FE00000700C8
	IMS_DSSTRING_5002	无	DS_FE0000070017
	IMS_DSSTRING_5003	有	DS_FE00000700C9
	IMS_DSSTRING_5004	KS打开	DS_FE00000700CA
	IMS_DSSTRING_5005	KS闭合	DS_FE00000700CB
	IMS_DSSTRING_5006	S2打开	DS_FE00000700CC
	IMS_DSSTRING_5007	S2闭合	DS_FE00000700CD
	IMS_DSSTRING_5008	BMS与充电机通讯断开	DS_FE00000700CE
	IMS_DSSTRING_5009	BMS与充电机通讯接通	DS_FE00000700CF
	IMS_DSSTRING_500A	电池包没有均衡	DS_FE00000700D0
	IMS_DSSTRING_500B	电池包正在均衡	DS_FE00000700D1
	IMS_DSSTRING_500C	断开	DS_FE00000700D2
	IMS_DSSTRING_500D	闭合	DS_FE00000700D3
	IMS_DSSTRING_500E	100	DS_FE00000700D4
	IMS_DSSTRING_500F	搁置	DS_FE00000700D5
	IMS_DSSTRING_5010	放电	DS_FE00000700D6
	IMS_DSSTRING_5011	--	DS_FE0000070006
	IMS_DSSTRING_5012	充电机充电	DS_FE00000700D8
	IMS_DSSTRING_5013	正常	DS_FE0000070083
	IMS_DSSTRING_5014	1级故障(报警)	DS_FE00000700D9
	IMS_DSSTRING_5015	2级故障(降功率)	DS_FE00000700DA
	IMS_DSSTRING_5016	3级故障(锁定输出)	DS_FE00000700DB
	IMS_DSSTRING_5017	4级故障(动力切断)	DS_FE00000700DC
	IMS_DSSTRING_5018	允许	DS_FE00000700DD
	IMS_DSSTRING_5019	不允许	DS_FE00000700DE
	IMS_DSSTRING_501A	故障报警	DS_FE00000700DF
	IMS_DSSTRING_501B	1级降功率(80%)	DS_FE00000700E0
	IMS_DSSTRING_501C	2级降功率(50%)	DS_FE00000700E1
	IMS_DSSTRING_501D	3级降功率(30%)	DS_FE00000700E2
</STRTABLE>

;============================================================================================
END

 $* P4201 单体电压超高-充电-4级
 $* P4202 单体电压超高-回馈-3级
 $* P4203 单体电压超高-3级
 $* P4204 总电压超高-充电-4级
 $* P4205 总电压超高-回馈-3级
 $* P4206 总电压超高-3级
 $* P4207 单体电压过低-1级降功率
 $* P4208 单体电压过低-2级降功率
 $* P4209 单体电压过低-3级降功率
 $* P420A 总电压过低-1级降功率
 $* P420B 总电压过低-2级降功率
 $* P420C 总电压过低-3级降功率
 $* P420D 单体电压超低-3级
 $* P420E 单体电压超低-4级
 $* P420F 单体电压超低-充电
 $* P4210 总电压超低-3级
 $* P4211 总电压超低-4级
 $* P4212 总电压超低-充电
 $* P4213 压差过大-1级降功率
 $* P4214 压差过大-2级降功率
 $* P4215 压差过大-3级降功率
 $* P4216 SOC过低-1级降功率
 $* P4217 SOC过低-2级降功率
 $* P4218 SOC过低-3级降功率
 $* P4219 放电电流过大-1级降功率
 $* P421A 放电电流过大-2级降功率
 $* P421B 放电电流过大-3级降功率
 $* P421C 放电电流超大-3级
 $* P421D 充电电流超大-3级
 $* P421E 充电电流超大-4级
 $* P421F 回馈电流超大-3级
 $* P4220 回馈电流超大-4级
 $* P4221 温度过高-1级降功率
 $* P4222 温度过高-2级降功率
 $* P4223 温度过高-3级降功率
 $* P4224 温度超高-3级
 $* P4225 温度超高-4级
 $* P4226 加热膜温度超高
 $* P4227 温度过低-1级降功率
 $* P4228 温度过低-2级降功率
 $* P4229 温度过低-3级降功率
 $* P422A 温度超低-3级
 $* P422B 温差过高-1级降功率
 $* P422C 温差过高-2级降功率
 $* P422D 温差过高-3级降功率
 $* P422E 温升速率过高-2级降功率
 $* P422F 温升速率超高-4级
 $* P4230 绝缘过低-1级
 $* P4231 绝缘过低-2级降功率
 $* P4232 绝缘超低-4级
 $* P4233 充电时间超长
 $* P4234 加热时间超长
 $* P4235 BMS系统故障
 $* P4236 与充电机通讯故障
 $* P4237 电压采集断开-4级
 $* P4238 电压采集断开-2级降功率
 $* P4239 温度采集断开-4级
 $* P423A 温度采集断开-2级降功率
 $* P423B 加热故障
 $* P423C 负极接触器故障：不能闭合
 $* P423D 负极接触器故障：粘连
