
    车型ID：7306

    模拟：协议模拟-->7306

;******************************************************************************************************************************************************

    通讯线: $~02$~10$~500k$~7FB

进入命令:

  $~  REQ000:7F3 02 10 01 00 00 00 00 00       $~  ANS000:7FB 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7F3 02 3E 00 00 00 00 00 00       $!  ANS000:7FB 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7F3 03 19 02 09 00 00 00 00       $#  ANS000:7FB 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/73060000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7F3 04 14 FF FF FF 00 00 00       $$  ANS000:7FB 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7F3 03 22 F1 87 00 00 00 00       $%  ANS000:7FB 03 22 F1 87 00 00 00 00
  $%  REQ001:7F3 03 22 F1 89 00 00 00 00       $%  ANS001:7FB 03 22 F1 89 00 00 00 00
  $%  REQ002:7F3 03 22 F1 8A 00 00 00 00       $%  ANS002:7FB 03 22 F1 8A 00 00 00 00
  $%  REQ003:7F3 03 22 F1 79 00 00 00 00       $%  ANS003:7FB 03 22 F1 79 00 00 00 00
  $%  REQ004:7F3 03 22 F1 97 00 00 00 00       $%  ANS004:7FB 03 22 F1 97 00 00 00 00
  $%  REQ005:7F3 03 22 F1 99 00 00 00 00       $%  ANS005:7FB 03 22 F1 99 00 00 00 00
  $%  REQ006:7F3 03 22 F1 A1 00 00 00 00       $%  ANS006:7FB 03 22 F1 A1 00 00 00 00
  $%  REQ007:7F3 03 22 F1 8C 00 00 00 00       $%  ANS007:7FB 03 22 F1 8C 00 00 00 00

  $%  000:零件号:               $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  001:软件版本(OEM):        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4)&0x0f,(x1&0x0F),x2);
  $%  002:供应商代码:           $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  003:硬件版本(OEM):        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4)&0x0f,(x1&0x0F),x2);
  $%  004:系统名称:             $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3);
  $%  005:软件发布日期:         $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  006:维修店编码:           $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5);
  $%  007:维修日期:             $%    $%  ANS006.BYTE009  $%  HEX(x1,x2,x3,x4);
  $%  008:维修时的总里程:       $%    $%  ANS006.BYTE013  $%  y=(x1<<16)+(x2<<8)+x3;
  $%  009:ECU生产序列号:        $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.动态数据流
  $  00.动态数据流
  $  REQ000:7F3 03 22 B0 01 00 00 00 00       $  ANS000:7FB 03 22 B0 01 00 00 00 00
  $  REQ001:7F3 03 22 B0 02 00 00 00 00       $  ANS001:7FB 03 22 B0 02 00 00 00 00
  $  REQ002:7F3 03 22 B0 06 00 00 00 00       $  ANS002:7FB 03 22 B0 06 00 00 00 00
  $  REQ003:7F3 03 22 B0 07 00 00 00 00       $  ANS003:7FB 03 22 B0 07 00 00 00 00
  $  REQ004:7F3 03 22 B0 09 00 00 00 00       $  ANS004:7FB 03 22 B0 09 00 00 00 00
  $  REQ005:7F3 03 22 B0 0A 00 00 00 00       $  ANS005:7FB 03 22 B0 0A 00 00 00 00
  $  REQ006:7F3 03 22 B0 0E 00 00 00 00       $  ANS006:7FB 03 22 B0 0E 00 00 00 00
  $  REQ007:7F3 03 22 B0 0F 00 00 00 00       $  ANS007:7FB 03 22 B0 0F 00 00 00 00
  $  REQ008:7F3 03 22 B0 11 00 00 00 00       $  ANS008:7FB 03 22 B0 11 00 00 00 00
  $  REQ009:7F3 03 22 B0 12 00 00 00 00       $  ANS009:7FB 03 22 B0 12 00 00 00 00
  $  REQ010:7F3 03 22 B0 16 00 00 00 00       $  ANS010:7FB 03 22 B0 16 00 00 00 00
  $  REQ011:7F3 03 22 B0 17 00 00 00 00       $  ANS011:7FB 03 22 B0 17 00 00 00 00
  $  REQ012:7F3 03 22 B0 19 00 00 00 00       $  ANS012:7FB 03 22 B0 19 00 00 00 00
  $  REQ013:7F3 03 22 B0 1A 00 00 00 00       $  ANS013:7FB 03 22 B0 1A 00 00 00 00
  $  REQ014:7F3 03 22 B0 1E 00 00 00 00       $  ANS014:7FB 03 22 B0 1E 00 00 00 00
  $  REQ015:7F3 03 22 B0 1F 00 00 00 00       $  ANS015:7FB 03 22 B0 1F 00 00 00 00
  $  REQ016:7F3 03 22 B0 21 00 00 00 00       $  ANS016:7FB 03 22 B0 21 00 00 00 00
  $  REQ017:7F3 03 22 B0 22 00 00 00 00       $  ANS017:7FB 03 22 B0 22 00 00 00 00
  $  REQ018:7F3 03 22 B0 26 00 00 00 00       $  ANS018:7FB 03 22 B0 26 00 00 00 00
  $  REQ019:7F3 03 22 B0 27 00 00 00 00       $  ANS019:7FB 03 22 B0 27 00 00 00 00
  $  REQ020:7F3 03 22 B0 29 00 00 00 00       $  ANS020:7FB 03 22 B0 29 00 00 00 00
  $  REQ021:7F3 03 22 B0 2A 00 00 00 00       $  ANS021:7FB 03 22 B0 2A 00 00 00 00
  $  REQ022:7F3 03 22 B0 2E 00 00 00 00       $  ANS022:7FB 03 22 B0 2E 00 00 00 00
  $  REQ023:7F3 03 22 B0 2F 00 00 00 00       $  ANS023:7FB 03 22 B0 2F 00 00 00 00
  $  REQ024:7F3 03 22 B0 30 00 00 00 00       $  ANS024:7FB 03 22 B0 30 00 00 00 00
  $  REQ025:7F3 03 22 B0 31 00 00 00 00       $  ANS025:7FB 03 22 B0 31 00 00 00 00
  $  REQ026:7F3 03 22 B0 32 00 00 00 00       $  ANS026:7FB 03 22 B0 32 00 00 00 00
  $  REQ027:7F3 03 22 B0 33 00 00 00 00       $  ANS027:7FB 03 22 B0 33 00 00 00 00
  $  REQ028:7F3 03 22 B0 34 00 00 00 00       $  ANS028:7FB 03 22 B0 34 00 00 00 00
  $  REQ029:7F3 03 22 B0 35 00 00 00 00       $  ANS029:7FB 03 22 B0 35 00 00 00 00
  $  REQ030:7F3 03 22 B0 36 00 00 00 00       $  ANS030:7FB 03 22 B0 36 00 00 00 00
  $  REQ031:7F3 03 22 B0 37 00 00 00 00       $  ANS031:7FB 03 22 B0 37 00 00 00 00
  $  REQ032:7F3 03 22 B0 38 00 00 00 00       $  ANS032:7FB 03 22 B0 38 00 00 00 00
  $  REQ033:7F3 03 22 B0 39 00 00 00 00       $  ANS033:7FB 03 22 B0 39 00 00 00 00
  $  REQ034:7F3 03 22 B0 3A 00 00 00 00       $  ANS034:7FB 03 22 B0 3A 00 00 00 00
  $  REQ035:7F3 03 22 B0 3B 00 00 00 00       $  ANS035:7FB 03 22 B0 3B 00 00 00 00
  $  REQ036:7F3 03 22 B0 3C 00 00 00 00       $  ANS036:7FB 03 22 B0 3C 00 00 00 00
  $  REQ037:7F3 03 22 B0 3D 00 00 00 00       $  ANS037:7FB 03 22 B0 3D 00 00 00 00
  $  REQ038:7F3 03 22 B0 3E 00 00 00 00       $  ANS038:7FB 03 22 B0 3E 00 00 00 00
  $  REQ039:7F3 03 22 B0 3F 00 00 00 00       $  ANS039:7FB 03 22 B0 3F 00 00 00 00
  $  REQ040:7F3 03 22 B0 41 00 00 00 00       $  ANS040:7FB 03 22 B0 41 00 00 00 00
  $  REQ041:7F3 03 22 B0 42 00 00 00 00       $  ANS041:7FB 03 22 B0 42 00 00 00 00
  $  REQ042:7F3 03 22 B0 43 00 00 00 00       $  ANS042:7FB 03 22 B0 43 00 00 00 00
  $  REQ043:7F3 03 22 B0 44 00 00 00 00       $  ANS043:7FB 03 22 B0 44 00 00 00 00
  $  REQ044:7F3 03 22 B0 45 00 00 00 00       $  ANS044:7FB 03 22 B0 45 00 00 00 00
  $  REQ045:7F3 03 22 B0 46 00 00 00 00       $  ANS045:7FB 03 22 B0 46 00 00 00 00
  $  REQ046:7F3 03 22 B0 47 00 00 00 00       $  ANS046:7FB 03 22 B0 47 00 00 00 00
  $  REQ047:7F3 03 22 B0 48 00 00 00 00       $  ANS047:7FB 03 22 B0 48 00 00 00 00
  $  REQ048:7F3 03 22 B0 4B 00 00 00 00       $  ANS048:7FB 03 22 B0 4B 00 00 00 00
  $  REQ049:7F3 03 22 B0 56 00 00 00 00       $  ANS049:7FB 03 22 B0 56 00 00 00 00
  $  REQ050:7F3 03 22 B0 57 00 00 00 00       $  ANS050:7FB 03 22 B0 57 00 00 00 00
  $  REQ051:7F3 03 22 B0 58 00 00 00 00       $  ANS051:7FB 03 22 B0 58 00 00 00 00
  $  REQ052:7F3 03 22 B0 59 00 00 00 00       $  ANS052:7FB 03 22 B0 59 00 00 00 00
  $  REQ053:7F3 03 22 B0 5A 00 00 00 00       $  ANS053:7FB 03 22 B0 5A 00 00 00 00
  $  REQ054:7F3 03 22 B0 62 00 00 00 00       $  ANS054:7FB 03 22 B0 62 00 00 00 00
  $  REQ055:7F3 03 22 B0 64 00 00 00 00       $  ANS055:7FB 03 22 B0 64 00 00 00 00
  $  REQ056:7F3 03 22 B0 66 00 00 00 00       $  ANS056:7FB 03 22 B0 66 00 00 00 00
  $  REQ057:7F3 03 22 B0 67 00 00 00 00       $  ANS057:7FB 03 22 B0 67 00 00 00 00
  $  REQ058:7F3 03 22 B0 68 00 00 00 00       $  ANS058:7FB 03 22 B0 68 00 00 00 00
  $  REQ059:7F3 03 22 B0 69 00 00 00 00       $  ANS059:7FB 03 22 B0 69 00 00 00 00
  $  REQ060:7F3 03 22 B0 6B 00 00 00 00       $  ANS060:7FB 03 22 B0 6B 00 00 00 00
  $  REQ061:7F3 03 22 B0 6C 00 00 00 00       $  ANS061:7FB 03 22 B0 6C 00 00 00 00
  $  REQ062:7F3 03 22 B0 6D 00 00 00 00       $  ANS062:7FB 03 22 B0 6D 00 00 00 00
  $  REQ063:7F3 03 22 B0 6E 00 00 00 00       $  ANS063:7FB 03 22 B0 6E 00 00 00 00
  $  REQ064:7F3 03 22 B0 6F 00 00 00 00       $  ANS064:7FB 03 22 B0 6F 00 00 00 00
  $  REQ065:7F3 03 22 B0 70 00 00 00 00       $  ANS065:7FB 03 22 B0 70 00 00 00 00
  $  REQ066:7F3 03 22 B0 71 00 00 00 00       $  ANS066:7FB 03 22 B0 71 00 00 00 00
  $  REQ067:7F3 03 22 B0 72 00 00 00 00       $  ANS067:7FB 03 22 B0 72 00 00 00 00
  $  REQ068:7F3 03 22 B0 73 00 00 00 00       $  ANS068:7FB 03 22 B0 73 00 00 00 00
  $  REQ069:7F3 03 22 B0 74 00 00 00 00       $  ANS069:7FB 03 22 B0 74 00 00 00 00
  $  REQ070:7F3 03 22 B0 75 00 00 00 00       $  ANS070:7FB 03 22 B0 75 00 00 00 00
  $  REQ071:7F3 03 22 B0 76 00 00 00 00       $  ANS071:7FB 03 22 B0 76 00 00 00 00
  $  REQ072:7F3 03 22 B0 77 00 00 00 00       $  ANS072:7FB 03 22 B0 77 00 00 00 00
  $  REQ073:7F3 03 22 B0 78 00 00 00 00       $  ANS073:7FB 03 22 B0 78 00 00 00 00
  $  REQ074:7F3 03 22 B0 79 00 00 00 00       $  ANS074:7FB 03 22 B0 79 00 00 00 00
  $  REQ075:7F3 03 22 B0 7A 00 00 00 00       $  ANS075:7FB 03 22 B0 7A 00 00 00 00
  $  REQ076:7F3 03 22 B0 7B 00 00 00 00       $  ANS076:7FB 03 22 B0 7B 00 00 00 00
  $  REQ077:7F3 03 22 B0 7C 00 00 00 00       $  ANS077:7FB 03 22 B0 7C 00 00 00 00
  $  REQ078:7F3 03 22 B0 7D 00 00 00 00       $  ANS078:7FB 03 22 B0 7D 00 00 00 00
  $  REQ079:7F3 03 22 B0 80 00 00 00 00       $  ANS079:7FB 03 22 B0 80 00 00 00 00
  $  REQ080:7F3 03 22 B0 81 00 00 00 00       $  ANS080:7FB 03 22 B0 81 00 00 00 00
  $  REQ081:7F3 03 22 B0 82 00 00 00 00       $  ANS081:7FB 03 22 B0 82 00 00 00 00
  $  REQ082:7F3 03 22 B0 83 00 00 00 00       $  ANS082:7FB 03 22 B0 83 00 00 00 00
  $  REQ083:7F3 03 22 B0 84 00 00 00 00       $  ANS083:7FB 03 22 B0 84 00 00 00 00
  $  REQ084:7F3 03 22 B0 86 00 00 00 00       $  ANS084:7FB 03 22 B0 86 00 00 00 00
  $  REQ085:7F3 03 22 B0 87 00 00 00 00       $  ANS085:7FB 03 22 B0 87 00 00 00 00

  $  000.电池模块1 单体最小电压                    $    $  V        $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.001;
  $  001.电池模块1 单体最大电压                    $    $  V        $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.001;
  $  002.电池模块1 单体最低温度                    $    $  degC     $    $  ANS002.BYTE004  $  y=x*0.5-40;
  $  003.电池模块1 单体最高温度                    $    $  degC     $    $  ANS003.BYTE004  $  y=x*0.5-40;
  $  004.电池模块2 单体最小电压                    $    $  V        $    $  ANS004.BYTE004  $  y=(x1*256+x2)*0.001;
  $  005.电池模块2 单体最大电压                    $    $  V        $    $  ANS005.BYTE004  $  y=(x1*256+x2)*0.001;
  $  006.电池模块2 单体最低温度                    $    $  degC     $    $  ANS006.BYTE004  $  y=x*0.5-40;
  $  007.电池模块2 单体最高温度                    $    $  degC     $    $  ANS007.BYTE004  $  y=x*0.5-40;
  $  008.电池模块3 单体最小电压                    $    $  V        $    $  ANS008.BYTE004  $  y=(x1*256+x2)*0.001;
  $  009.电池模块3 单体最大电压                    $    $  V        $    $  ANS009.BYTE004  $  y=(x1*256+x2)*0.001;
  $  010.电池模块3 单体最低温度                    $    $  degC     $    $  ANS010.BYTE004  $  y=x*0.5-40;
  $  011.电池模块3 单体最高温度                    $    $  degC     $    $  ANS011.BYTE004  $  y=x*0.5-40;
  $  012.电池模块4 单体最小电压                    $    $  V        $    $  ANS012.BYTE004  $  y=(x1*256+x2)*0.001;
  $  013.电池模块4 单体最大电压                    $    $  V        $    $  ANS013.BYTE004  $  y=(x1*256+x2)*0.001;
  $  014.电池模块4 单体最低温度                    $    $  degC     $    $  ANS014.BYTE004  $  y=x*0.5-40;
  $  015.电池模块4 单体最高温度                    $    $  degC     $    $  ANS015.BYTE004  $  y=x*0.5-40;
  $  016.电池模块5 单体最小电压                    $    $  V        $    $  ANS016.BYTE004  $  y=(x1*256+x2)*0.001;
  $  017.电池模块5 单体最大电压                    $    $  V        $    $  ANS017.BYTE004  $  y=(x1*256+x2)*0.001;
  $  018.电池模块5 单体最低温度                    $    $  degC     $    $  ANS018.BYTE004  $  y=x*0.5-40;
  $  019.电池模块5 单体最高温度                    $    $  degC     $    $  ANS019.BYTE004  $  y=x*0.5-40;
  $  020.电池模块6 单体最小电压                    $    $  V        $    $  ANS020.BYTE004  $  y=(x1*256+x2)*0.001;
  $  021.电池模块6 单体最大电压                    $    $  V        $    $  ANS021.BYTE004  $  y=(x1*256+x2)*0.001;
  $  022.电池模块6 单体最低温度                    $    $  degC     $    $  ANS022.BYTE004  $  y=x*0.5-40;
  $  023.电池模块6 单体最高温度                    $    $  degC     $    $  ANS023.BYTE004  $  y=x*0.5-40;
  $  024.电池模块7 单体最小电压                    $    $  V        $    $  ANS024.BYTE004  $  y=(x1*256+x2)*0.001;
  $  025.电池模块7 单体最大电压                    $    $  V        $    $  ANS025.BYTE004  $  y=(x1*256+x2)*0.001;
  $  026.电池模块7 单体最低温度                    $    $  degC     $    $  ANS026.BYTE004  $  y=x*0.5-40;
  $  027.电池模块7 单体最高温度                    $    $  degC     $    $  ANS027.BYTE004  $  y=x*0.5-40;
  $  028.电池模块8 单体最小电压                    $    $  V        $    $  ANS028.BYTE004  $  y=(x1*256+x2)*0.001;
  $  029.电池模块8 单体最大电压                    $    $  V        $    $  ANS029.BYTE004  $  y=(x1*256+x2)*0.001;
  $  030.电池模块8 单体最低温度                    $    $  degC     $    $  ANS030.BYTE004  $  y=x*0.5-40;
  $  031.电池模块8 单体最高温度                    $    $  degC     $    $  ANS031.BYTE004  $  y=x*0.5-40;
  $  032.电池模块9 单体最小电压                    $    $  V        $    $  ANS032.BYTE004  $  y=(x1*256+x2)*0.001;
  $  033.电池模块9 单体最大电压                    $    $  V        $    $  ANS033.BYTE004  $  y=(x1*256+x2)*0.001;
  $  034.电池模块9 单体最低温度                    $    $  degC     $    $  ANS034.BYTE004  $  y=x*0.5-40;
  $  035.电池模块9 单体最高温度                    $    $  degC     $    $  ANS035.BYTE004  $  y=x*0.5-40;
  $  036.电池模块10 单体最小电压                   $    $  V        $    $  ANS036.BYTE004  $  y=(x1*256+x2)*0.001;
  $  037.电池模块10 单体最大电压                   $    $  V        $    $  ANS037.BYTE004  $  y=(x1*256+x2)*0.001;
  $  038.电池模块10 单体最小温度                   $    $  degC     $    $  ANS038.BYTE004  $  y=x*0.5-40;
  $  039.电池模块10 单体最大温度                   $    $  degC     $    $  ANS039.BYTE004  $  y=x*0.5-40;
  $  040.电池母线电压                              $    $  V        $    $  ANS040.BYTE004  $  y=(x1*256+x2)*0.25;
  $  041.电池电压                                  $    $  V        $    $  ANS041.BYTE004  $  y=x1*256+x2;
  $  042.母线电流1                                 $    $  A        $    $  ANS042.BYTE004  $  y=x1*256+x2-600;
  $  043.母线电流2                                 $    $  A        $    $  ANS043.BYTE004  $  y=x1*256+x2-600;
  $  044.绝缘电阻                                  $    $  Kohm     $    $  ANS044.BYTE004  $  y=(x1*256+x2)*0.5;
  $  045.电池SOC(电池电量)                         $    $  %        $    $  ANS045.BYTE004  $  y=x1;
  $  046.BMS(电池管理系统)报警等级                 $    $           $    $  ANS046.BYTE004  $  if(x==0)y=@0011;else if(x==1)y=@003b;else if(x==2)y=@003c;else if(x==3)y=@003d;else y=@0027;
  $  047.BMS(电池管理系统)的基本状态               $    $           $    $  ANS047.BYTE004  $  if(x==0)y=@002d;else if(x==1)y=@002e;else if(x==2)y=@002f;else if(x==3)y=@0030;else if(x==4)y=@0031;else if(x==5)y=@0032;else if(x==6)y=@0033;else if(x==7)y=@0034;else if(x==8)y=@0027;else if(x==9)y=@0035;else if(x==10)y=@0036;else if(x==11)y=@0027;else if(x==12)y=@0037;else if(x==13)y=@0038;else if(x==14)y=@0039;else if(x==15)y=@003a;else y=@0027;
  $  048.通信状态                                  $    $           $    $  ANS048.BYTE004  $  if((x&0x01)==1)y=@002a;else if((x&0x02)==2)y=@002b;else if((x&0x04)==4)y=@002c;else y=@0027;
  $  049.电池最高温度                              $    $  degC     $    $  ANS049.BYTE004  $  y=x-40;
  $  050.电池最低温度                              $    $  degC     $    $  ANS050.BYTE004  $  y=x-40;
  $  051.电池最大电压                              $    $  V        $    $  ANS051.BYTE004  $  y=(x1*256+x2)*0.001;
  $  052.电池最小电压                              $    $  V        $    $  ANS052.BYTE004  $  y=(x1*256+x2)*0.001;
  $  053.高电压继电器开放要求信号                  $    $           $    $  ANS053.BYTE004  $  if(x==0)y=@0028;else if(x==1)y=@0029;else y=@0027;
  $  054.外部充电完成                              $    $           $    $  ANS054.BYTE004  $  if(x==0)y=@0025;else if(x==1)y=@0026;else y=@0027;
  $  055.辅助蓄电池电压                            $    $  V        $    $  ANS055.BYTE004  $  y=(x1*256+x2)*0.01;
  $  056.外部充电信号(动力电池充电指示)            $    $           $    $  ANS056.BYTE004  $  if(x==0)y=@0047;else if(x==1)y=@0048;else y=@0027;
  $  057.电池故障(显示用)                          $    $           $    $  ANS057.BYTE004  $  if(x==0)y=@0045;else y=@0046;
  $  058.非车载充电连接指示信号                    $    $           $    $  ANS058.BYTE004  $  if(x==0)y=@0043;else if(x==1)y=@0044;else y=@0027;
  $  059.电池温度                                  $    $  degC     $    $  ANS059.BYTE004  $  y=x-40;
  $  060.单体欠压                                  $    $           $    $  ANS060.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  061.单体过压                                  $    $           $    $  ANS061.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  062.系统过压                                  $    $           $    $  ANS062.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  063.单体温度高                                $    $           $    $  ANS063.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  064.预充电故障                                $    $           $    $  ANS064.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  065.子网通信丢失                              $    $           $    $  ANS065.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  066.放电电流大                                $    $           $    $  ANS066.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  067.充电电流大                                $    $           $    $  ANS067.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  068.绝缘过低                                  $    $           $    $  ANS068.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else if(x==2)y=@003c;else y=@0027;
  $  069.充电器通信丢失                            $    $           $    $  ANS069.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else y=@0027;
  $  070.温度差异大                                $    $           $    $  ANS070.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else y=@0027;
  $  071.系统欠压                                  $    $           $    $  ANS071.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else y=@0027;
  $  072.单体温度低                                $    $           $    $  ANS072.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else y=@0027;
  $  073.SOC(电池电量)低                           $    $           $    $  ANS073.BYTE004  $  if(x==0)y=@003b;else if(x==1)y=@042d;else y=@0027;
  $  074.最高允许充电电压                          $    $           $    $  ANS074.BYTE004  $  y=(x1*256+x2)*0.1;
  $  075.最高允许充电电流                          $    $           $    $  ANS075.BYTE004  $  y=x*0.1;
  $  076.车载充电器使能                            $    $           $    $  ANS076.BYTE004  $  if(x==0)y=@003e;else if(x==1)y=@003f;else y=@0027;
  $  077.充电状态                                  $    $           $    $  ANS077.BYTE004  $  if(x==0)y=@005c;else if(x==1)y=@005d;else if(x==2)y=@005e;else if(x==3)y=@005f;else y=@0027;
  $  078.交流输入状态                              $    $           $    $  ANS078.BYTE004  $  if(x==0)y=@005a;else if(x==1)y=@005b;else y=@0027;
  $  079.车载储能装置类型                          $    $           $    $  ANS079.BYTE004  $  if(x==0x01)y=@0051;else if(x==0x02)y=@0052;else if(x==0x03)y=@0053;else if(x==0x04)y=@0054;else if(x==0x05)y=@0055;else if(x==0x06)y=@0056;else if(x==0x07)y=@0057;else if(x==0x08)y=@0058;else if(x==0x09)y=@0059;else y=@0027;
  $  080.车载储能装置总能量-动力电池总能量Ah       $    $           $    $  ANS080.BYTE004  $  y=x;
  $  081.车载储能装置冷却方式                      $    $           $    $  ANS081.BYTE004  $  if(x==0x01)y=@004f;else if(x==0x02)y=@0050;else y=@0027;
  $  082.可充电储能子系统数                        $    $           $    $  ANS082.BYTE004  $  if(x==0xfe)y=@004d;else if(x==0xff)y=@004e;else y=x;
  $  083.可充电储能系统编码长度                    $    $           $    $  ANS083.BYTE004  $  y=x;
  $  084.单体电池个数                              $    $           $    $  ANS084.BYTE004  $  if((x1*256+x2)==0xfffe)y=@004d;else if((x1*256+x2)==0xffff)y=@004e;else y=x1*256+x2;
  $  085.可充电储能温度探针个数                    $    $           $    $  ANS085.BYTE004  $  if((x1*256+x2)==0xfffe)y=@004d;else if((x1*256+x2)==0xffff)y=@004e;else y=x1*256+x2;

  $)  01.可充电储能系统编码-电池编号
  $  01.可充电储能系统编码-电池编号
  $  REQ000:7F3 03 22 B0 85 00 00 00 00       $  ANS000:7FB 03 22 B0 85 00 00 00 00

  $  000.生产厂商代码           $    $           $    $  ANS000.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  001.电池类型代码           $    $           $    $  ANS000.BYTE010  $  if(x==0x01)y=@0051;else if(x==0x02)y=@0052;else if(x==0x03)y=@0053;else if(x==0x04)y=@0054;else if(x==0x05)y=@0055;else if(x==0x06)y=@0056;else if(x==0x07)y=@0057;else if(x==0x08)y=@0058;else if(x==0x09)y=@0059;else y=@0027;
  $  002.额定能量               $    $  kw.h     $    $  ANS000.BYTE011  $  y=(x1*256+x2)*0.1;
  $  003.额定电压               $    $  V        $    $  ANS000.BYTE013  $  y=(x1*256+x2)*0.1;
  $  004.电池生产日期代码       $    $           $    $  ANS000.BYTE015  $  HEX(x1,x2,x3,x4,x5,x6);
  $  005.流水号                 $    $           $    $  ANS000.BYTE021  $  y=SPRINTF([%d],x1*256+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7F3 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
