
    车型ID：731e

    模拟：协议模拟-->731e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~70E

进入命令:

  $~  REQ000:706 02 10 01 00 00 00 00 00       $~  ANS000:70E 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:706 02 3E 00 00 00 00 00 00       $!  ANS000:70E 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:706 03 19 02 09 00 00 00 00       $#  ANS000:70E 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/55000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:706 04 14 FF FF FF 00 00 00       $$  ANS000:70E 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:706 03 22 F1 89 00 00 00 00       $%  ANS000:70E 03 22 F1 89 00 00 00 00
  $%  REQ001:706 03 22 F1 79 00 00 00 00       $%  ANS001:70E 03 22 F1 79 00 00 00 00
  $%  REQ002:706 03 22 F1 99 00 00 00 00       $%  ANS002:70E 03 22 F1 99 00 00 00 00
  $%  REQ003:706 03 22 F1 8A 00 00 00 00       $%  ANS003:70E 03 22 F1 8A 00 00 00 00
  $%  REQ004:706 03 22 F1 87 00 00 00 00       $%  ANS004:70E 03 22 F1 87 00 00 00 00
  $%  REQ005:706 03 22 F1 97 00 00 00 00       $%  ANS005:70E 03 22 F1 97 00 00 00 00
  $%  REQ006:706 03 22 F1 A1 00 00 00 00       $%  ANS006:70E 03 22 F1 A1 00 00 00 00
  $%  REQ007:706 03 22 F1 8C 00 00 00 00       $%  ANS007:70E 03 22 F1 8C 00 00 00 00
  $%  REQ008:706 03 22 F1 90 00 00 00 00       $%  ANS008:70E 03 22 F1 90 00 00 00 00
  $%  REQ009:706 03 22 F1 7F 00 00 00 00       $%  ANS009:70E 03 22 F1 7F 00 00 00 00

  $%  000:软件号(OEM):          $%    $%  ANS000.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  001:硬件号(OEM):          $%    $%  ANS001.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  002:软件发布日期:         $%    $%  ANS002.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  003:供应商代码:           $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:零件编号:             $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  005:系统名称:             $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3);
  $%  006:维修店编码:           $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5);
  $%  007:维修时间:             $%    $%  ANS006.BYTE009  $%  HEX(x1,x2,x3,x4);
  $%  008:维修时的总里程:       $%    $%  ANS006.BYTE013  $%  y=(x1<<16)+(x2<<8)+x3;
  $%  009:ECU生产序列号:        $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30);
  $%  010:VIN码:                $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  011:软件校验码:           $%    $%  ANS009.BYTE004  $%  HEX(x1,x2);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.输入信号状态
  $  00.输入信号状态
  $  REQ000:706 03 22 11 FE 00 00 00 00       $  ANS000:70E 03 22 11 FE 00 00 00 00
  $  REQ001:706 03 22 11 FF 00 00 00 00       $  ANS001:70E 03 22 11 FF 00 00 00 00
  $  REQ002:706 03 22 12 00 00 00 00 00       $  ANS002:70E 03 22 12 00 00 00 00 00
  $  REQ003:706 03 22 12 01 00 00 00 00       $  ANS003:70E 03 22 12 01 00 00 00 00
  $  REQ004:706 03 22 12 02 00 00 00 00       $  ANS004:70E 03 22 12 02 00 00 00 00
  $  REQ005:706 03 22 12 03 00 00 00 00       $  ANS005:70E 03 22 12 03 00 00 00 00
  $  REQ006:706 03 22 12 04 00 00 00 00       $  ANS006:70E 03 22 12 04 00 00 00 00
  $  REQ007:706 03 22 12 05 00 00 00 00       $  ANS007:70E 03 22 12 05 00 00 00 00
  $  REQ008:706 03 22 12 07 00 00 00 00       $  ANS008:70E 03 22 12 07 00 00 00 00
  $  REQ009:706 03 22 12 08 00 00 00 00       $  ANS009:70E 03 22 12 08 00 00 00 00

  $  000.第1把钥匙信息                  $    $          $    $  ANS000.BYTE004  $  HEX(x1,x2);
  $  001.第2把钥匙信息                  $    $          $    $  ANS001.BYTE004  $  HEX(x1,x2);
  $  002.第3把钥匙信息                  $    $          $    $  ANS002.BYTE004  $  HEX(x1,x2);
  $  003.第4把钥匙信息                  $    $          $    $  ANS003.BYTE004  $  HEX(x1,x2);
  $  004.第5把钥匙信息                  $    $          $    $  ANS004.BYTE004  $  HEX(x1,x2);
  $  005.最近接收到的遥控数据           $    $          $    $  ANS005.BYTE004  $  HEX(x1,x2);
  $  006.已学习的钥匙数量               $    $          $    $  ANS006.BYTE004  $  y=x;
  $  007.左前门状态                     $    $          $    $  ANS007.BYTE004  $  if(x1&0x01) y=@006c;else  y=@015d;
  $  008.右前门状态                     $    $          $    $  ANS007.BYTE004  $  if(x1&0x02) y=@006c;else  y=@015d;
  $  009.左后门状态                     $    $          $    $  ANS007.BYTE004  $  if(x1&0x04) y=@006c;else  y=@015d;
  $  010.右后门状态                     $    $          $    $  ANS007.BYTE004  $  if(x1&0x08) y=@006c;else  y=@015d;
  $  011.行李箱状态                     $    $          $    $  ANS007.BYTE004  $  if(x1&0x10) y=@006c;else  y=@015d;
  $  012.左前门锁状态                   $    $          $    $  ANS007.BYTE004  $  if(x1&0x20) y=@0083;else  y=@0068;
  $  013.位置灯开关状态                 $    $          $    $  ANS007.BYTE004  $  if(x1&0x40) y=@043c;else  y=@015d;
  $  014.中控解锁开关状态               $    $          $    $  ANS007.BYTE004  $  if(x1&0x80) y=@043c;else  y=@015d;
  $  015.中控闭锁开关状态               $    $          $    $  ANS007.BYTE005  $  if(x1&0x01) y=@043c;else  y=@015d;
  $  016.左转向开关状态                 $    $          $    $  ANS007.BYTE005  $  if(x1&0x04) y=@043c;else  y=@015d;
  $  017.右转向开关状态                 $    $          $    $  ANS007.BYTE005  $  if(x1&0x08) y=@043c;else  y=@015d;
  $  018.危险报警开关状态               $    $          $    $  ANS007.BYTE005  $  if(x1&0x10) y=@043c;else  y=@015d;
  $  019.后除霜开关状态                 $    $          $    $  ANS007.BYTE005  $  if(x1&0x20) y=@043c;else  y=@015d;
  $  020.行李箱微动开关状态             $    $          $    $  ANS007.BYTE005  $  if(x1&0x40) y=@043c;else  y=@015d;
  $  021.前雨刮洗涤开关状态             $    $          $    $  ANS007.BYTE005  $  if(x1&0x80) y=@043c;else  y=@015d;
  $  022.前雨刮间歇开关状态             $    $          $    $  ANS007.BYTE006  $  if(x1&0x01) y=@043c;else  y=@015d;
  $  023.后雨刮洗涤开关状态             $    $          $    $  ANS007.BYTE006  $  if(x1&0x02) y=@043c;else  y=@015d;
  $  024.后雨刮间歇开关状态             $    $          $    $  ANS007.BYTE006  $  if(x1&0x04) y=@043c;else  y=@015d;
  $  025.前雨刮回位开关状态             $    $          $    $  ANS007.BYTE006  $  if(x1&0x08) y=@043c;else  y=@015d;
  $  026.后雨刮回位开关状态             $    $          $    $  ANS007.BYTE006  $  if(x1&0x10) y=@043c;else  y=@015d;
  $  027.钥匙提醒信号状态(预留)         $    $          $    $  ANS007.BYTE006  $  if(x1&0x20) y=@043e;else  y=@043d;
  $  028.碰撞信号状态                   $    $          $    $  ANS007.BYTE006  $  if(x1&0x40) y=@043e;else  y=@043d;
  $  029.ACC信号状态                    $    $          $    $  ANS007.BYTE006  $  if(x1&0x80) y=@043e;else  y=@043d;
  $  030.IG1信号状态                    $    $          $    $  ANS007.BYTE007  $  if(x1&0x01) y=@043e;else  y=@043d;
  $  031.IG2信号状态(预留)              $    $          $    $  ANS007.BYTE007  $  if(x1&0x02) y=@043e;else  y=@043d;
  $  032.点火开关状态                   $    $          $    $  ANS007.BYTE007  $  if((x1&0x0c)==0x00) y=@045b;else if((x1&0x0c)==0x04) y=@045c;else if((x1&0x0c)==0x08) y=@045d;else  y=@045e;
  $  033.近光灯开关状态                 $    $          $    $  ANS007.BYTE007  $  if(x1&0x10) y=@045f;else  y=@0460;
  $  034.远光灯开关状态                 $    $          $    $  ANS007.BYTE007  $  if(x1&0x20) y=@045f;else  y=@0460;
  $  035.超车灯开关状态                 $    $          $    $  ANS007.BYTE007  $  if(x1&0x40) y=@045f;else  y=@0460;
  $  036.前雾灯开关状态                 $    $          $    $  ANS007.BYTE007  $  if(x1&0x80) y=@045f;else  y=@0460;
  $  037.后雾灯开关状态                 $    $          $    $  ANS007.BYTE008  $  if(x1&0x01) y=@045f;else  y=@0460;
  $  038.机舱盖开关状态(预留)           $    $          $    $  ANS007.BYTE008  $  if(x1&0x02) y=@045f;else  y=@0460;
  $  039.灯光AUTO档开关状态             $    $          $    $  ANS007.BYTE008  $  if(x1&0x04) y=@045f;else  y=@0460;
  $  040.伴我回家转向灯的点亮时间       $    $  Sec     $    $  ANS008.BYTE004  $  y=x;
  $  041.行李箱解锁驱动时间             $    $  ms      $    $  ANS009.BYTE004  $  y=x*10;
  $  042.门锁解闭锁驱动时间             $    $  ms      $    $  ANS009.BYTE005  $  y=x*10;

  $)  01.车身功能配置1
  $  01.车身功能配置1
  $  REQ000:706 03 22 12 06 00 00 00 00       $  ANS000:70E 03 22 12 06 00 00 00 00

  $  000.行车自动落锁       $    $       $    $  ANS000.BYTE004  $  if(x1&0x01)y=@009c;else  y=@0373;
  $  001.变道               $    $       $    $  ANS000.BYTE004  $  if(x1&0x02)y=@009c;else  y=@0373;
  $  002.防盗(预留)         $    $       $    $  ANS000.BYTE004  $  if(x1&0x04)y=@009c;else  y=@0373;
  $  003.紧急制动           $    $       $    $  ANS000.BYTE004  $  if(x1&0x08)y=@009c;else  y=@0373;

  $)  02.车身功能配置2
  $  02.车身功能配置2
  $  REQ000:706 03 22 12 09 00 00 00 00       $  ANS000:70E 03 22 12 09 00 00 00 00

  $  000.后窗加热功能启用标识               $    $          $    $  ANS000.BYTE004  $  if(x&0x01)y=@0160;else  y=@0161;
  $  001.后窗加热执行时间                   $    $  Min     $    $  ANS000.BYTE004  $  y=(x&0x2E)>>1;
  $  002.前雨刮洗涤功能额外挂刷次数         $    $          $    $  ANS000.BYTE005  $  y=x&0x07;
  $  003.前雨刮擦拭功能启用标识(预留)       $    $          $    $  ANS000.BYTE005  $  if(x&0x08)y=@0160;else  y=@0161;
  $  004.前洗涤开关滤波时间                 $    $  ms      $    $  ANS000.BYTE005  $  y=(x>>4)*40;
  $  005.后雨刮洗涤功能额外挂刷次数         $    $          $    $  ANS000.BYTE006  $  y=x&0x07;
  $  006.后雨刮擦拭功能启用标识(预留)       $    $          $    $  ANS000.BYTE006  $  if(x&0x08)y=@0160;else  y=@0161;
  $  007.后洗涤开关滤波时间                 $    $  ms      $    $  ANS000.BYTE006  $  y=(x>>4)*40;

  $)  03.远程功能配置
  $  03.远程功能配置
  $  REQ000:706 03 22 12 0A 00 00 00 00       $  ANS000:70E 03 22 12 0A 00 00 00 00

  $  000.远程后窗加热功能启用标识       $    $       $    $  ANS000.BYTE004  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  001.远程门锁功能启用标识           $    $       $    $  ANS000.BYTE005  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  002.远程后背门功能启用标识         $    $       $    $  ANS000.BYTE006  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  003.远程天窗功能启用标识           $    $       $    $  ANS000.BYTE007  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  004.远程近光灯功能启用标识         $    $       $    $  ANS000.BYTE008  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;

  $)  04.语音功能配置
  $  04.语音功能配置
  $  REQ000:706 03 22 12 0B 00 00 00 00       $  ANS000:70E 03 22 12 0B 00 00 00 00

  $  000.语音功能启用标识               $    $       $    $  ANS000.BYTE004  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  001.语音氛围灯功能启用标识         $    $       $    $  ANS000.BYTE005  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  002.语音后窗加热功能启用标识       $    $       $    $  ANS000.BYTE006  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  003.语音天窗功能启用标识           $    $       $    $  ANS000.BYTE007  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;
  $  004.语音近光灯功能启用标识         $    $       $    $  ANS000.BYTE008  $  if(x==0x00)y=@0161;else if(x==0x55)y=@0160;else  y=@000a;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:706 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
