
    车型ID：733e

    模拟：协议模拟-->733e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 00 00 00 00 00 00       $!  ANS000:7E8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 03 19 02 09 00 00 00 00       $#  ANS000:7E8 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/733e0000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 87 00 00 00 00       $%  ANS000:7E8 03 22 F1 87 00 00 00 00
  $%  REQ001:7E0 03 22 F1 8A 00 00 00 00       $%  ANS001:7E8 03 22 F1 8A 00 00 00 00
  $%  REQ002:7E0 03 22 F1 8B 00 00 00 00       $%  ANS002:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ003:7E0 03 22 F1 8C 00 00 00 00       $%  ANS003:7E8 03 22 F1 8C 00 00 00 00
  $%  REQ004:7E0 03 22 F1 90 00 00 00 00       $%  ANS004:7E8 03 22 F1 90 00 00 00 00
  $%  REQ005:7E0 03 22 F1 91 00 00 00 00       $%  ANS005:7E8 03 22 F1 91 00 00 00 00
  $%  REQ006:7E0 03 22 F1 92 00 00 00 00       $%  ANS006:7E8 03 22 F1 92 00 00 00 00
  $%  REQ007:7E0 03 22 F1 93 00 00 00 00       $%  ANS007:7E8 03 22 F1 93 00 00 00 00
  $%  REQ008:7E0 03 22 F1 94 00 00 00 00       $%  ANS008:7E8 03 22 F1 94 00 00 00 00
  $%  REQ009:7E0 03 22 F1 95 00 00 00 00       $%  ANS009:7E8 03 22 F1 95 00 00 00 00
  $%  REQ010:7E0 03 22 F1 96 00 00 00 00       $%  ANS010:7E8 03 22 F1 96 00 00 00 00
  $%  REQ011:7E0 03 22 F1 99 00 00 00 00       $%  ANS011:7E8 03 22 F1 99 00 00 00 00
  $%  REQ012:7E0 03 22 F1 89 00 00 00 00       $%  ANS012:7E8 03 22 F1 89 00 00 00 00
  $%  REQ013:7E0 03 22 F1 79 00 00 00 00       $%  ANS013:7E8 03 22 F1 79 00 00 00 00
  $%  REQ014:7E0 03 22 F1 A1 00 00 00 00       $%  ANS014:7E8 03 22 F1 A1 00 00 00 00
  $%  REQ015:7E0 03 22 F1 7D 00 00 00 00       $%  ANS015:7E8 03 22 F1 7D 00 00 00 00
  $%  REQ016:7E0 03 22 F1 81 00 00 00 00       $%  ANS016:7E8 03 22 F1 81 00 00 00 00
  $%  REQ017:7E0 03 22 F1 82 00 00 00 00       $%  ANS017:7E8 03 22 F1 82 00 00 00 00
  $%  REQ018:7E0 03 22 F1 7E 00 00 00 00       $%  ANS018:7E8 03 22 F1 7E 00 00 00 00
  $%  REQ019:7E0 03 22 F1 7F 00 00 00 00       $%  ANS019:7E8 03 22 F1 7F 00 00 00 00
  $%  REQ020:7E0 03 22 F1 97 00 00 00 00       $%  ANS020:7E8 03 22 F1 97 00 00 00 00

  $%  000:零件号:                              $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  001:供应商标识:                          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  002:ECU生产日期:                         $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  003:ECU序列号:                           $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  004:VIN码:                               $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  005:车厂定义的ECU硬件号:                 $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  006:系统供应商定义的ECU硬件号:           $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:系统供应商定义的ECU硬件版本号:       $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:系统供应商定义的ECU软件号:           $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:系统供应商定义的ECU软件版本号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  010:系统名或发动机类型:                  $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  011:编程日期:                            $%    $%  ANS011.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  012:软件版本号(OEM):                     $%    $%  ANS012.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  013:硬件版本号(OEM):                     $%    $%  ANS013.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  014:维修店编码:                          $%    $%  ANS014.BYTE004  $%  ASCII(x1,x2,x3,x4,x5);
  $%  015:维修日期:                            $%    $%  ANS014.BYTE009  $%  HEX(x1,x2,x3,x4);
  $%  016:维修时的里程:                        $%    $%  ANS014.BYTE013  $%  HEX(x1,x2,x3);
  $%  017:系统供应商序列号:                    $%    $%  ANS015.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  018:应用层版本号:                        $%    $%  ANS016.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  019:应用层数据版本号:                    $%    $%  ANS017.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  020:标定校验码:                          $%    $%  ANS018.BYTE004  $%  HEX(x1,x2);
  $%  021:软件校验码:                          $%    $%  ANS019.BYTE004  $%  HEX(x1,x2);
  $%  022:发动机型号:                          $%    $%  ANS020.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7E0 03 22 11 00 00 00 00 00       $  ANS000:7E8 03 22 11 00 00 00 00 00
  $  REQ001:7E0 03 22 11 01 00 00 00 00       $  ANS001:7E8 03 22 11 01 00 00 00 00
  $  REQ002:7E0 03 22 11 02 00 00 00 00       $  ANS002:7E8 03 22 11 02 00 00 00 00
  $  REQ003:7E0 03 22 11 03 00 00 00 00       $  ANS003:7E8 03 22 11 03 00 00 00 00
  $  REQ004:7E0 03 22 11 04 00 00 00 00       $  ANS004:7E8 03 22 11 04 00 00 00 00
  $  REQ005:7E0 03 22 11 20 00 00 00 00       $  ANS005:7E8 03 22 11 20 00 00 00 00
  $  REQ006:7E0 03 22 11 41 00 00 00 00       $  ANS006:7E8 03 22 11 41 00 00 00 00
  $  REQ007:7E0 03 22 11 5E 00 00 00 00       $  ANS007:7E8 03 22 11 5E 00 00 00 00
  $  REQ008:7E0 03 22 11 5F 00 00 00 00       $  ANS008:7E8 03 22 11 5F 00 00 00 00
  $  REQ009:7E0 03 22 11 6F 00 00 00 00       $  ANS009:7E8 03 22 11 6F 00 00 00 00
  $  REQ010:7E0 03 22 11 92 00 00 00 00       $  ANS010:7E8 03 22 11 92 00 00 00 00
  $  REQ011:7E0 03 22 11 98 00 00 00 00       $  ANS011:7E8 03 22 11 98 00 00 00 00
  $  REQ012:7E0 03 22 11 99 00 00 00 00       $  ANS012:7E8 03 22 11 99 00 00 00 00
  $  REQ013:7E0 03 22 11 9D 00 00 00 00       $  ANS013:7E8 03 22 11 9D 00 00 00 00
  $  REQ014:7E0 03 22 11 9E 00 00 00 00       $  ANS014:7E8 03 22 11 9E 00 00 00 00
  $  REQ015:7E0 03 22 11 9F 00 00 00 00       $  ANS015:7E8 03 22 11 9F 00 00 00 00
  $  REQ016:7E0 03 22 11 A0 00 00 00 00       $  ANS016:7E8 03 22 11 A0 00 00 00 00
  $  REQ017:7E0 03 22 11 A3 00 00 00 00       $  ANS017:7E8 03 22 11 A3 00 00 00 00
  $  REQ018:7E0 03 22 11 A6 00 00 00 00       $  ANS018:7E8 03 22 11 A6 00 00 00 00
  $  REQ019:7E0 03 22 11 AC 00 00 00 00       $  ANS019:7E8 03 22 11 AC 00 00 00 00
  $  REQ020:7E0 03 22 12 00 00 00 00 00       $  ANS020:7E8 03 22 12 00 00 00 00 00
  $  REQ021:7E0 03 22 12 01 00 00 00 00       $  ANS021:7E8 03 22 12 01 00 00 00 00
  $  REQ022:7E0 03 22 12 02 00 00 00 00       $  ANS022:7E8 03 22 12 02 00 00 00 00
  $  REQ023:7E0 03 22 12 03 00 00 00 00       $  ANS023:7E8 03 22 12 03 00 00 00 00
  $  REQ024:7E0 03 22 12 05 00 00 00 00       $  ANS024:7E8 03 22 12 05 00 00 00 00
  $  REQ025:7E0 03 22 12 06 00 00 00 00       $  ANS025:7E8 03 22 12 06 00 00 00 00
  $  REQ026:7E0 03 22 12 07 00 00 00 00       $  ANS026:7E8 03 22 12 07 00 00 00 00
  $  REQ027:7E0 03 22 12 27 00 00 00 00       $  ANS027:7E8 03 22 12 27 00 00 00 00
  $  REQ028:7E0 03 22 12 28 00 00 00 00       $  ANS028:7E8 03 22 12 28 00 00 00 00
  $  REQ029:7E0 03 22 12 B0 00 00 00 00       $  ANS029:7E8 03 22 12 B0 00 00 00 00
  $  REQ030:7E0 03 22 12 B1 00 00 00 00       $  ANS030:7E8 03 22 12 B1 00 00 00 00
  $  REQ031:7E0 03 22 12 B4 00 00 00 00       $  ANS031:7E8 03 22 12 B4 00 00 00 00
  $  REQ032:7E0 03 22 12 B5 00 00 00 00       $  ANS032:7E8 03 22 12 B5 00 00 00 00
  $  REQ033:7E0 03 22 12 B7 00 00 00 00       $  ANS033:7E8 03 22 12 B7 00 00 00 00
  $  REQ034:7E0 03 22 12 B8 00 00 00 00       $  ANS034:7E8 03 22 12 B8 00 00 00 00
  $  REQ035:7E0 03 22 12 E2 00 00 00 00       $  ANS035:7E8 03 22 12 E2 00 00 00 00
  $  REQ036:7E0 03 22 13 AB 00 00 00 00       $  ANS036:7E8 03 22 13 AB 00 00 00 00
  $  REQ037:7E0 03 22 14 71 00 00 00 00       $  ANS037:7E8 03 22 14 71 00 00 00 00
  $  REQ038:7E0 03 22 14 72 00 00 00 00       $  ANS038:7E8 03 22 14 72 00 00 00 00
  $  REQ039:7E0 03 22 14 73 00 00 00 00       $  ANS039:7E8 03 22 14 73 00 00 00 00
  $  REQ040:7E0 03 22 14 74 00 00 00 00       $  ANS040:7E8 03 22 14 74 00 00 00 00
  $  REQ041:7E0 03 22 14 75 00 00 00 00       $  ANS041:7E8 03 22 14 75 00 00 00 00
  $  REQ042:7E0 03 22 14 76 00 00 00 00       $  ANS042:7E8 03 22 14 76 00 00 00 00
  $  REQ043:7E0 03 22 15 3D 00 00 00 00       $  ANS043:7E8 03 22 15 3D 00 00 00 00
  $  REQ044:7E0 03 22 15 41 00 00 00 00       $  ANS044:7E8 03 22 15 41 00 00 00 00
  $  REQ045:7E0 03 22 15 42 00 00 00 00       $  ANS045:7E8 03 22 15 42 00 00 00 00
  $  REQ046:7E0 03 22 15 43 00 00 00 00       $  ANS046:7E8 03 22 15 43 00 00 00 00
  $  REQ047:7E0 03 22 15 44 00 00 00 00       $  ANS047:7E8 03 22 15 44 00 00 00 00
  $  REQ048:7E0 03 22 15 45 00 00 00 00       $  ANS048:7E8 03 22 15 45 00 00 00 00
  $  REQ049:7E0 03 22 15 46 00 00 00 00       $  ANS049:7E8 03 22 15 46 00 00 00 00
  $  REQ050:7E0 03 22 15 47 00 00 00 00       $  ANS050:7E8 03 22 15 47 00 00 00 00
  $  REQ051:7E0 03 22 16 16 00 00 00 00       $  ANS051:7E8 03 22 16 16 00 00 00 00
  $  REQ052:7E0 03 22 16 17 00 00 00 00       $  ANS052:7E8 03 22 16 17 00 00 00 00
  $  REQ053:7E0 03 22 17 00 00 00 00 00       $  ANS053:7E8 03 22 17 00 00 00 00 00
  $  REQ054:7E0 03 22 17 01 00 00 00 00       $  ANS054:7E8 03 22 17 01 00 00 00 00
  $  REQ055:7E0 03 22 17 02 00 00 00 00       $  ANS055:7E8 03 22 17 02 00 00 00 00
  $  REQ056:7E0 03 22 18 00 00 00 00 00       $  ANS056:7E8 03 22 18 00 00 00 00 00
  $  REQ057:7E0 03 22 18 01 00 00 00 00       $  ANS057:7E8 03 22 18 01 00 00 00 00
  $  REQ058:7E0 03 22 18 02 00 00 00 00       $  ANS058:7E8 03 22 18 02 00 00 00 00
  $  REQ059:7E0 03 22 18 03 00 00 00 00       $  ANS059:7E8 03 22 18 03 00 00 00 00
  $  REQ060:7E0 03 22 18 04 00 00 00 00       $  ANS060:7E8 03 22 18 04 00 00 00 00
  $  REQ061:7E0 03 22 18 05 00 00 00 00       $  ANS061:7E8 03 22 18 05 00 00 00 00
  $  REQ062:7E0 03 22 18 06 00 00 00 00       $  ANS062:7E8 03 22 18 06 00 00 00 00
  $  REQ063:7E0 03 22 18 0A 00 00 00 00       $  ANS063:7E8 03 22 18 0A 00 00 00 00
  $  REQ064:7E0 03 22 18 0B 00 00 00 00       $  ANS064:7E8 03 22 18 0B 00 00 00 00
  $  REQ065:7E0 03 22 18 0C 00 00 00 00       $  ANS065:7E8 03 22 18 0C 00 00 00 00
  $  REQ066:7E0 03 22 18 0E 00 00 00 00       $  ANS066:7E8 03 22 18 0E 00 00 00 00
  $  REQ067:7E0 03 22 18 0F 00 00 00 00       $  ANS067:7E8 03 22 18 0F 00 00 00 00
  $  REQ068:7E0 03 22 18 10 00 00 00 00       $  ANS068:7E8 03 22 18 10 00 00 00 00
  $  REQ069:7E0 03 22 18 32 00 00 00 00       $  ANS069:7E8 03 22 18 32 00 00 00 00
  $  REQ070:7E0 03 22 18 33 00 00 00 00       $  ANS070:7E8 03 22 18 33 00 00 00 00
  $  REQ071:7E0 03 22 18 34 00 00 00 00       $  ANS071:7E8 03 22 18 34 00 00 00 00
  $  REQ072:7E0 03 22 18 35 00 00 00 00       $  ANS072:7E8 03 22 18 35 00 00 00 00
  $  REQ073:7E0 03 22 18 36 00 00 00 00       $  ANS073:7E8 03 22 18 36 00 00 00 00
  $  REQ074:7E0 03 22 18 37 00 00 00 00       $  ANS074:7E8 03 22 18 37 00 00 00 00
  $  REQ075:7E0 03 22 18 38 00 00 00 00       $  ANS075:7E8 03 22 18 38 00 00 00 00
  $  REQ076:7E0 03 22 18 3A 00 00 00 00       $  ANS076:7E8 03 22 18 3A 00 00 00 00
  $  REQ077:7E0 03 22 18 3B 00 00 00 00       $  ANS077:7E8 03 22 18 3B 00 00 00 00
  $  REQ078:7E0 03 22 18 3C 00 00 00 00       $  ANS078:7E8 03 22 18 3C 00 00 00 00
  $  REQ079:7E0 03 22 18 3D 00 00 00 00       $  ANS079:7E8 03 22 18 3D 00 00 00 00
  $  REQ080:7E0 03 22 18 3E 00 00 00 00       $  ANS080:7E8 03 22 18 3E 00 00 00 00
  $  REQ081:7E0 03 22 18 40 00 00 00 00       $  ANS081:7E8 03 22 18 40 00 00 00 00
  $  REQ082:7E0 03 22 18 41 00 00 00 00       $  ANS082:7E8 03 22 18 41 00 00 00 00
  $  REQ083:7E0 03 22 18 42 00 00 00 00       $  ANS083:7E8 03 22 18 42 00 00 00 00
  $  REQ084:7E0 03 22 28 F3 00 00 00 00       $  ANS084:7E8 03 22 28 F3 00 00 00 00
  $  REQ085:7E0 03 22 28 F4 00 00 00 00       $  ANS085:7E8 03 22 28 F4 00 00 00 00
  $  REQ086:7E0 03 22 28 F7 00 00 00 00       $  ANS086:7E8 03 22 28 F7 00 00 00 00
  $  REQ087:7E0 03 22 28 FB 00 00 00 00       $  ANS087:7E8 03 22 28 FB 00 00 00 00
  $  REQ088:7E0 03 22 28 FF 00 00 00 00       $  ANS088:7E8 03 22 28 FF 00 00 00 00
  $  REQ089:7E0 03 22 07 10 00 00 00 00       $  ANS089:7E8 03 22 07 10 00 00 00 00
  $  REQ090:7E0 03 22 18 30 00 00 00 00       $  ANS090:7E8 03 22 18 30 00 00 00 00
  $  REQ091:7E0 03 22 18 39 00 00 00 00       $  ANS091:7E8 03 22 18 39 00 00 00 00
  $  REQ092:7E0 03 22 18 47 00 00 00 00       $  ANS092:7E8 03 22 18 47 00 00 00 00
  $  REQ093:7E0 03 22 18 48 00 00 00 00       $  ANS093:7E8 03 22 18 48 00 00 00 00
  $  REQ094:7E0 03 22 18 49 00 00 00 00       $  ANS094:7E8 03 22 18 49 00 00 00 00
  $  REQ095:7E0 03 22 18 50 00 00 00 00       $  ANS095:7E8 03 22 18 50 00 00 00 00
  $  REQ096:7E0 03 22 18 51 00 00 00 00       $  ANS096:7E8 03 22 18 51 00 00 00 00
  $  REQ097:7E0 03 22 18 52 00 00 00 00       $  ANS097:7E8 03 22 18 52 00 00 00 00
  $  REQ098:7E0 03 22 18 53 00 00 00 00       $  ANS098:7E8 03 22 18 53 00 00 00 00
  $  REQ099:7E0 03 22 18 54 00 00 00 00       $  ANS099:7E8 03 22 18 54 00 00 00 00
  $  REQ100:7E0 03 22 18 55 00 00 00 00       $  ANS100:7E8 03 22 18 55 00 00 00 00
  $  REQ101:7E0 03 22 18 56 00 00 00 00       $  ANS101:7E8 03 22 18 56 00 00 00 00
  $  REQ102:7E0 03 22 18 57 00 00 00 00       $  ANS102:7E8 03 22 18 57 00 00 00 00
  $  REQ103:7E0 03 22 18 58 00 00 00 00       $  ANS103:7E8 03 22 18 58 00 00 00 00
  $  REQ104:7E0 03 22 18 59 00 00 00 00       $  ANS104:7E8 03 22 18 59 00 00 00 00

  $  000.燃油泵打开命令                                      $    $              $    $  ANS000.BYTE004  $  if(((x>>7)&1))y=@0511;else y=@0512;
  $  001.催化剂保护模式开启                                  $    $              $    $  ANS000.BYTE004  $  if(((x>>5)&1))y=@04c5;else y=@04c6;
  $  002.空调离合器                                          $    $              $    $  ANS000.BYTE004  $  if(((x>>4)&1))y=@042e;else y=@006c;
  $  003.助力转向开                                          $    $              $    $  ANS000.BYTE004  $  if(((x>>3)&1))y=@0093;else y=@0092;
  $  004.制动开关打开                                        $    $              $    $  ANS000.BYTE004  $  if(((x>>2)&1))y=@015d;else y=@006c;
  $  005.离合器开关                                          $    $              $    $  ANS000.BYTE004  $  if(((x>>1)&1))y=@0352;else y=@0510;
  $  006.节气门处于怠速状态                                  $    $              $    $  ANS000.BYTE004  $  if(((x>>0)&1))y=@050e;else y=@050f;
  $  007.减速燃油切断激活                                    $    $              $    $  ANS001.BYTE004  $  if(((x>>6)&1))y=@04aa;else y=@04ab;
  $  008.巡航指示灯激活                                      $    $              $    $  ANS001.BYTE004  $  if(((x>>5)&1))y=@04a8;else y=@04a9;
  $  009.EVP继电器输出激活                                   $    $              $    $  ANS001.BYTE004  $  if(((x>>4)&1))y=@04a6;else y=@04a7;
  $  010.MIL(故障指示灯)激活                                 $    $              $    $  ANS001.BYTE004  $  if(((x>>2)&1))y=@0412;else y=@0413;
  $  011.制动灯激活                                          $    $              $    $  ANS001.BYTE004  $  if(((x>>1)&1))y=@04a4;else y=@04a5;
  $  012.发动机冷却液温度指示灯亮                            $    $              $    $  ANS001.BYTE004  $  if(((x>>0)&1))y=@04bf;else y=@04c0;
  $  013.浓/稀,缸组1,传感器1                                 $    $              $    $  ANS002.BYTE004  $  if(((x>>6)&1))y=@04bd;else y=@04be;
  $  014.爆震存在                                            $    $              $    $  ANS002.BYTE004  $  if(((x>>5)&1))y=@04bb;else y=@04bc;
  $  015.动力加浓激活                                        $    $              $    $  ANS002.BYTE004  $  if(((x>>4)&1))y=@04b9;else y=@04ba;
  $  016.氧就绪,缸组1,传感器1                                $    $              $    $  ANS002.BYTE004  $  if(((x>>1)&1))y=@04b7;else y=@04b8;
  $  017.燃油处于闭环状态                                    $    $              $    $  ANS002.BYTE004  $  if(((x>>0)&1))y=@04b5;else y=@04b6;
  $  018.ETC降扭模式激活                                     $    $              $    $  ANS003.BYTE004  $  if(((x>>7)&1))y=@04b3;else y=@04b4;
  $  019.档位在驻车档/空档(自动变速箱)                       $    $              $    $  ANS003.BYTE004  $  if(((x>>6)&1))y=@04b1;else y=@04b2;
  $  020.离合器冲程底端1打开                                 $    $              $    $  ANS003.BYTE004  $  if(((x>>5)&1))y=@04f1;else y=@04f2;
  $  021.离合器冲程底端2打开                                 $    $              $    $  ANS003.BYTE004  $  if(((x>>4)&1))y=@04ef;else y=@04f0;
  $  022.档位在空档(手动变速箱)                              $    $              $    $  ANS003.BYTE004  $  if(((x>>3)&1))y=@04ee;else y=@04b2;
  $  023.空调中压开关开                                      $    $              $    $  ANS003.BYTE004  $  if(((x>>2)&1))y=@042e;else y=@006c;
  $  024.高速冷却风扇打开                                    $    $              $    $  ANS003.BYTE004  $  if(((x>>1)&1))y=@052e;else y=@052f;
  $  025.低速冷却风扇打开                                    $    $              $    $  ANS003.BYTE004  $  if(((x>>0)&1))y=@052c;else y=@052d;
  $  026.崎岖路面失火-忽略失火数据                           $    $              $    $  ANS004.BYTE004  $  if(((x>>2)&1))y=@04e6;else y=@04e7;
  $  027.燃油轨压                                            $    $  kPa         $    $  ANS005.BYTE004  $  y=(x1*256+x2)*10;
  $  028.相对燃油流量                                        $    $  %           $    $  ANS005.BYTE006  $  y=(x1*256+x2)*100/65535;
  $  029.点火钥匙电压                                        $    $  V           $    $  ANS006.BYTE004  $  y=x/10;
  $  030.凸轮位置传感器脉冲计数器                            $    $              $    $  ANS007.BYTE004  $  y=x;
  $  031.排气凸轮位置传感器脉冲计数器                        $    $              $    $  ANS008.BYTE004  $  y=x;
  $  032.启动发动机冷却液温度                                $    $  degC        $    $  ANS009.BYTE004  $  y=x-40;
  $  033.怠速速度期望值                                      $    $  rpm         $    $  ANS010.BYTE004  $  y=x1*256+x2;
  $  034.电动水泵数据                                        $    $              $    $  ANS011.BYTE004  $  y=(x1*256+x2)/256;
  $  035.变量油泵数据                                        $    $              $    $  ANS012.BYTE004  $  if(x==0x00)y=@04f3;else if(x==0x01)y=@04f4;else y=@0027;
  $  036.气压                                                $    $  kPa         $    $  ANS013.BYTE004  $  y=x;
  $  037.空燃比                                              $    $  %           $    $  ANS014.BYTE004  $  y=(x1*256+x2)/1024;
  $  038.节气门前进气温度                                    $    $  degC        $    $  ANS015.BYTE004  $  y=(x1*256+x2)/16;
  $  039.发动机爆震计数器                                    $    $              $    $  ANS016.BYTE004  $  y=x;
  $  040.催化转换器温度计算值                                $    $  degC        $    $  ANS017.BYTE004  $  y=(x1*256+x2)/16;
  $  041.爆震延迟                                            $    $              $    $  ANS018.BYTE004  $  y=x;
  $  042.空气流速密度计算值                                  $    $  g/s         $    $  ANS019.BYTE004  $  y=(x1*256+x2)/128;
  $  043.失火总数                                            $    $  Counts      $    $  ANS020.BYTE004  $  y=x;
  $  044.气缸1失火历史计数器                                 $    $              $    $  ANS021.BYTE004  $  y=x1*256+x2;
  $  045.气缸2失火历史计数器                                 $    $              $    $  ANS022.BYTE004  $  y=x1*256+x2;
  $  046.气缸3失火历史计数器                                 $    $              $    $  ANS023.BYTE004  $  y=x1*256+x2;
  $  047.当前失火-气缸1                                      $    $              $    $  ANS024.BYTE004  $  y=x;
  $  048.当前失火-气缸2                                      $    $              $    $  ANS025.BYTE004  $  y=x;
  $  049.当前失火-气缸3                                      $    $              $    $  ANS026.BYTE004  $  y=x;
  $  050.失火排放故障历史计数器                              $    $              $    $  ANS027.BYTE004  $  y=x1*256+x2;
  $  051.失火排放通过历史计数器                              $    $              $    $  ANS028.BYTE004  $  y=x1*256+x2;
  $  052.加速踏板位置                                        $    $  %           $    $  ANS029.BYTE004  $  y=(x1*256+x2)/256;
  $  053.节气门位置                                          $    $  %           $    $  ANS030.BYTE004  $  y=(x1*256+x2)/256;
  $  054.加速踏板位置传感器1偏移量                           $    $  %           $    $  ANS031.BYTE004  $  y=(x1*256+x2)/256;
  $  055.加速踏板位置传感器2偏移量                           $    $  %           $    $  ANS032.BYTE004  $  y=(x1*256+x2)/256;
  $  056.节气门位置传感器1偏移量                             $    $  %           $    $  ANS033.BYTE004  $  y=(x1*256+x2)/256;
  $  057.节气门位置传感器2偏移量                             $    $  %           $    $  ANS034.BYTE004  $  y=(x1*256+x2)/256;
  $  058.启动IAT(进气温度)                                   $    $  degC        $    $  ANS035.BYTE004  $  y=x-40;
  $  059.巡航模式状态                                        $    $              $    $  ANS036.BYTE004  $  if(x==0x00)y=@009b;else if(x==0x01)y=@0513;else if(x==0x02)y=@0514;else if(x==0x03)y=@0160;else if(x==0x04)y=@0515;else if(x==0x05)y=@0516;else if(x==0x06)y=@0516;else if(x==0x07)y=@0517;else if(x==0x08)y=@0518;else if(x==0x09)y=@0519;else y=@0027;
  $  060.进气凸轮轴相位期望位置                              $    $  Deg         $    $  ANS037.BYTE004  $  y=x1*256+x2-127;
  $  061.排气凸轮轴相位期望位置                              $    $  Deg         $    $  ANS038.BYTE004  $  y=x1*256+x2-127;
  $  062.进气凸轮轴相位实际位置                              $    $  Deg         $    $  ANS039.BYTE004  $  y=x1*256+x2-127;
  $  063.排气凸轮轴相位实际位置                              $    $  Deg         $    $  ANS040.BYTE004  $  y=x1*256+x2-127;
  $  064.进气凸轮轴相位占空比                                $    $  %           $    $  ANS041.BYTE004  $  y=x/255;
  $  065.排气凸轮轴相位占空比                                $    $  %           $    $  ANS042.BYTE004  $  y=x/255;
  $  066.巡航速度错误                                        $    $  Kph         $    $  ANS043.BYTE004  $  y=(x1*256+x2-32768)/128;
  $  067.巡航目标速度                                        $    $  Kph         $    $  ANS044.BYTE004  $  y=x/128;
  $  068.巡航发动机扭矩期望值                                $    $  Nm          $    $  ANS045.BYTE004  $  y=(x1*256+x2)/16-2048;
  $  069.巡航控制断开历史记录-0                              $    $              $    $  ANS046.BYTE004  $  if(x==0x00)y=@0011;else if(x==0x01)y=@051a;else if(x==0x02)y=@051b;else if(x==0x03)y=@051c;else if(x==0x04)y=@051d;else if(x==0x05)y=@051e;else if(x==0x06)y=@051f;else if(x==0x07)y=@0520;else if(x==0x08)y=@0521;else if(x==0x09)y=@0522;else if(x==0x0A)y=@006c;else if(x==0x0B)y=@034e;else if(x==0x0C)y=@0523;else if(x==0x0D)y=@0524;else if(x==0x0E)y=@0525;else if(x==0x0F)y=@0526;else if(x==0x10)y=@0527;else if(x==0x11)y=@0528;else if(x==0x12)y=@0529;else if(x==0x13)y=@04e3;else if(x==0x14)y=@052a;else if(x==0x15)y=@052b;else y=@0027;
  $  070.巡航控制断开历史记录-1                              $    $              $    $  ANS047.BYTE004  $  if(x==0x00)y=@0011;else if(x==0x01)y=@051a;else if(x==0x02)y=@051b;else if(x==0x03)y=@051c;else if(x==0x04)y=@051d;else if(x==0x05)y=@051e;else if(x==0x06)y=@051f;else if(x==0x07)y=@0520;else if(x==0x08)y=@0521;else if(x==0x09)y=@0522;else if(x==0x0A)y=@006c;else if(x==0x0B)y=@034e;else if(x==0x0C)y=@0523;else if(x==0x0D)y=@0524;else if(x==0x0E)y=@0525;else if(x==0x0F)y=@0526;else if(x==0x10)y=@0527;else if(x==0x11)y=@0528;else if(x==0x12)y=@0529;else if(x==0x13)y=@04e3;else if(x==0x14)y=@052a;else if(x==0x15)y=@052b;else y=@0027;
  $  071.巡航控制断开历史记录-2                              $    $              $    $  ANS048.BYTE004  $  if(x==0x00)y=@0011;else if(x==0x01)y=@051a;else if(x==0x02)y=@051b;else if(x==0x03)y=@051c;else if(x==0x04)y=@051d;else if(x==0x05)y=@051e;else if(x==0x06)y=@051f;else if(x==0x07)y=@0520;else if(x==0x08)y=@0521;else if(x==0x09)y=@0522;else if(x==0x0A)y=@006c;else if(x==0x0B)y=@034e;else if(x==0x0C)y=@0523;else if(x==0x0D)y=@0524;else if(x==0x0E)y=@0525;else if(x==0x0F)y=@0526;else if(x==0x10)y=@0527;else if(x==0x11)y=@0528;else if(x==0x12)y=@0529;else if(x==0x13)y=@04e3;else if(x==0x14)y=@052a;else if(x==0x15)y=@052b;else y=@0027;
  $  072.巡航控制断开历史记录-3                              $    $              $    $  ANS049.BYTE004  $  if(x==0x00)y=@0011;else if(x==0x01)y=@051a;else if(x==0x02)y=@051b;else if(x==0x03)y=@051c;else if(x==0x04)y=@051d;else if(x==0x05)y=@051e;else if(x==0x06)y=@051f;else if(x==0x07)y=@0520;else if(x==0x08)y=@0521;else if(x==0x09)y=@0522;else if(x==0x0A)y=@006c;else if(x==0x0B)y=@034e;else if(x==0x0C)y=@0523;else if(x==0x0D)y=@0524;else if(x==0x0E)y=@0525;else if(x==0x0F)y=@0526;else if(x==0x10)y=@0527;else if(x==0x11)y=@0528;else if(x==0x12)y=@0529;else if(x==0x13)y=@04e3;else if(x==0x14)y=@052a;else if(x==0x15)y=@052b;else y=@0027;
  $  073.巡航控制断开历史记录-4                              $    $              $    $  ANS050.BYTE004  $  if(x==0x00)y=@0011;else if(x==0x01)y=@051a;else if(x==0x02)y=@051b;else if(x==0x03)y=@051c;else if(x==0x04)y=@051d;else if(x==0x05)y=@051e;else if(x==0x06)y=@051f;else if(x==0x07)y=@0520;else if(x==0x08)y=@0521;else if(x==0x09)y=@0522;else if(x==0x0A)y=@006c;else if(x==0x0B)y=@034e;else if(x==0x0C)y=@0523;else if(x==0x0D)y=@0524;else if(x==0x0E)y=@0525;else if(x==0x0F)y=@0526;else if(x==0x10)y=@0527;else if(x==0x11)y=@0528;else if(x==0x12)y=@0529;else if(x==0x13)y=@04e3;else if(x==0x14)y=@052a;else if(x==0x15)y=@052b;else y=@0027;
  $  074.参考电压1                                           $    $  mV          $    $  ANS051.BYTE004  $  y=x1*256+x2;
  $  075.参考电压2                                           $    $  mV          $    $  ANS052.BYTE004  $  y=x1*256+x2;
  $  076.操作系统错误掩码                                    $    $              $    $  ANS053.BYTE004  $  y=SPRINTF([%X.%X.%X.%X],x1,x2,x3,x4);
  $  077.主处理器错误代码                                    $    $              $    $  ANS053.BYTE008  $  y=x;
  $  078.主处理器错误指示                                    $    $              $    $  ANS053.BYTE009  $  y=x;
  $  079.监测处理器错误代码                                  $    $              $    $  ANS053.BYTE010  $  y=x;
  $  080.操作系统错误掩码                                    $    $              $    $  ANS054.BYTE004  $  HEX(x1);
  $  081.喷油器诊断信息                                      $    $              $    $  ANS055.BYTE004  $  if(((x>>0)&1))y=@04d2;else y=@01ab;
  $  082.碳罐净化阀                                          $    $              $    $  ANS056.BYTE004  $  y=x*100/255;
  $  083.瞬时油耗                                            $    $              $    $  ANS057.BYTE004  $  y=(x1*256+x2)*100/65535;
  $  084.前空调蒸发器温度                                    $    $              $    $  ANS058.BYTE004  $  y=x/255;
  $  085.总爆震点火延迟-气缸1                                $    $  Deg         $    $  ANS059.BYTE004  $  y=(x1*256+x2)/255;
  $  086.总爆震点火延迟-气缸2                                $    $  Deg         $    $  ANS059.BYTE006  $  y=(x1*256+x2)/255;
  $  087.总爆震点火延迟-气缸3                                $    $  Deg         $    $  ANS059.BYTE008  $  y=(x1*256+x2)/255;
  $  088.总喷射时间-气缸1                                    $    $  ms          $    $  ANS060.BYTE004  $  y=(x1*256+x2)/64;
  $  089.总喷射时间-气缸2                                    $    $  ms          $    $  ANS061.BYTE004  $  y=(x1*256+x2)/64;
  $  090.总喷射时间-气缸3                                    $    $  ms          $    $  ANS062.BYTE004  $  y=(x1*256+x2)/64;
  $  091.点火线圈1充电时间                                   $    $  μs         $    $  ANS063.BYTE004  $  y=x1*256+x2;
  $  092.点火线圈2充电时间                                   $    $  μs         $    $  ANS064.BYTE004  $  y=x1*256+x2;
  $  093.点火线圈3充电时间                                   $    $  μs         $    $  ANS065.BYTE004  $  y=x1*256+x2;
  $  094.氧传感器加热器占空比 缸组1传感器1                   $    $  %           $    $  ANS066.BYTE004  $  y=x*10/255;
  $  095.氧传感器加热器占空比 缸组1传感器2                   $    $  %           $    $  ANS067.BYTE004  $  y=x*10/255;
  $  096.请求点火效率                                        $    $              $    $  ANS068.BYTE004  $  y=(x1*256+x2)/16384;
  $  097.实际点火效率                                        $    $              $    $  ANS068.BYTE006  $  y=(x1*256+x2)/16384;
  $  098.上次发动机启动前的环境气温                          $    $  degC        $    $  ANS069.BYTE004  $  y=(x1*256+x2)/16;
  $  099.上次发动机启动前的发动机冷却液水温                  $    $  degC        $    $  ANS070.BYTE004  $  y=(x1*256+x2)/16;
  $  100.上次发动机启动前的环境气压                          $    $  kPa         $    $  ANS071.BYTE004  $  y=(x1*256+x2)/64;
  $  101.上次发动机启动前的燃油压力                          $    $  kPa         $    $  ANS072.BYTE004  $  y=x1*256+x2;
  $  102.上次发动机启动前的低电压电瓶电压                    $    $  kPa         $    $  ANS073.BYTE004  $  y=(x1*256+x2)/512;
  $  103.上次发动机启动前的发动机淹缸时间                    $    $  s           $    $  ANS074.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  104.上次发动机启动时的发动机转速超速                    $    $  rpm         $    $  ANS075.BYTE004  $  y=x1*256+x2;
  $  105.上次发动机启动时的发动机启动速度                    $    $  ms          $    $  ANS076.BYTE004  $  y=x1*256+x2;
  $  106.上次发动机启动时的发动机同步时间                    $    $  ms          $    $  ANS077.BYTE004  $  y=x1*256+x2;
  $  107.上次发动机启动时的首次喷油                          $    $  ms          $    $  ANS078.BYTE004  $  y=x1*256+x2;
  $  108.发动机启动时间                                      $    $  ms          $    $  ANS079.BYTE004  $  y=x1*256+x2;
  $  109.退出启动序列的时间                                  $    $  ms          $    $  ANS080.BYTE004  $  y=x1*256+x2;
  $  110.长期燃油修正自适应                                  $    $              $    $  ANS081.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $  111.TCS(牵引力控制系统)故障(FDMA降级原因数据)           $    $              $    $  ANS082.BYTE004  $  if(((x>>7)&1))y=@04d2;else y=@01ab;
  $  112.TC(自动变速箱)U跛行回家故障(FDMA降级原因数据)       $    $              $    $  ANS082.BYTE004  $  if(((x>>6)&1))y=@04d2;else y=@01ab;
  $  113.TC(自动变速箱)U启停故障(FDMA降级原因数据)           $    $              $    $  ANS082.BYTE004  $  if(((x>>5)&1))y=@04d2;else y=@01ab;
  $  114.档位位置错误故障(FDMA降级原因数据)                  $    $              $    $  ANS082.BYTE004  $  if(((x>>4)&1))y=@04d2;else y=@01ab;
  $  115.FDMA输入驱动功能动作的次数                          $    $              $    $  ANS083.BYTE004  $  y=x1*256+x2;
  $  116.制动真空差压传感器原始值                            $    $  mV          $    $  ANS084.BYTE004  $  y=x1*256+x2;
  $  117.制动真空差压                                        $    $  kPa         $    $  ANS085.BYTE004  $  y=x1*256+x2;
  $  118.电子恒温器指令占空比                                $    $              $    $  ANS086.BYTE004  $  y=(x1*256+x2)/256;
  $  119.点火钥匙状态                                        $    $              $    $  ANS087.BYTE004  $  if(x==0x00)y=@006c;else if(x==0x01)y=@053e;else if(x==0x02)y=@053f;else if(x==0x03)y=@002d;else y=@000a;
  $  120.制动传感器A/D                                       $    $  V           $    $  ANS088.BYTE004  $  y=x*0.1;
  $  121.首次启动控制                                        $    $              $    $  ANS089.BYTE004  $  if(x&0x80)y=@04f5;else y=@04f6;
  $  122.蓄电池电量                                          $    $              $    $  ANS090.BYTE004  $  y=(x1*256+x2)/256;
  $  123.上一次启动类型                                      $    $              $    $  ANS091.BYTE004  $  if(((x>>7)&1))y=@034f;else y=@0540;
  $  124.碳罐HC浓度                                          $    $              $    $  ANS092.BYTE004  $  y=(x1*256+x2)/1024;
  $  125.碳罐电磁阀占空比                                    $    $  %           $    $  ANS092.BYTE006  $  y=(x1*256+x2)/256;
  $  126.碳罐电磁阀频率                                      $    $  Hz          $    $  ANS092.BYTE008  $  y=(x1*256+x2)/64;
  $  127.碳罐电磁阀有效截面积                                $    $  %           $    $  ANS092.BYTE010  $  y=(x1*256+x2)*100/65535;
  $  128.本次累计脱附HC量                                    $    $  g           $    $  ANS092.BYTE012  $  y=(x1*256+x2)/32;
  $  129.催化器温度保护禁止断油                              $    $              $    $  ANS093.BYTE004  $  if(((x>>7)&1))y=@001b;else y=@001c;
  $  130.冷启动催化器加热请求                                $    $              $    $  ANS093.BYTE004  $  if(((x>>6)&1))y=@001b;else y=@001c;
  $  131.清氧请求                                            $    $              $    $  ANS093.BYTE004  $  if(((x>>5)&1))y=@001b;else y=@001c;
  $  132.催化器加热空燃比控制请求                            $    $              $    $  ANS093.BYTE004  $  if(((x>>4)&1))y=@001b;else y=@001c;
  $  133.催化器加热点火角控制请求                            $    $              $    $  ANS093.BYTE004  $  if(((x>>3)&1))y=@001b;else y=@001c;
  $  134.催化器加热怠速控制请求                              $    $              $    $  ANS093.BYTE004  $  if(((x>>2)&1))y=@001b;else y=@001c;
  $  135.催化器控制正常模式                                  $    $              $    $  ANS093.BYTE004  $  if(((x>>1)&1))y=@001b;else y=@001c;
  $  136.频率控制使能                                        $    $              $    $  ANS093.BYTE004  $  if(((x>>0)&1))y=@001b;else y=@001c;
  $  137.空燃比控制状态                                      $    $              $    $  ANS093.BYTE005  $  if(x==0x00)y=@0530;else if(x==0x01)y=@0531;else if(x==0x02)y=@0532;else if(x==0x03)y=@0533;else if(x==0x04)y=@0534;else if(x==0x05)y=@0535;else if(x==0x06)y=@0536;else if(x==0x07)y=@0537;else if(x==0x08)y=@0538;else if(x==0x09)y=@0539;else y=@000a;
  $  138.目标燃空比                                          $    $              $    $  ANS093.BYTE006  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  139.目标燃烧效率                                        $    $              $    $  ANS093.BYTE008  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  140.起燃最低发动机转速                                  $    $              $    $  ANS093.BYTE010  $  if(x1<0x80)y=x1*256+x2;else y=x1*256+x2-65536;
  $  141.催化器预估温度                                      $    $              $    $  ANS093.BYTE012  $  if(x1<0x80)y=(x1*256+x2)/16;else y=(x1*256+x2-65536)/16;
  $  142.后氧学习电压                                        $    $              $    $  ANS093.BYTE016  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  143.前氧学习值                                          $    $              $    $  ANS093.BYTE018  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  144.后氧反馈状态                                        $    $              $    $  ANS093.BYTE020  $  if(x==0x00)y=@053a;else if(x==0x01)y=@053b;else if(x==0x02)y=@053c;else if(x==0x03)y=@053d;else y=@000a;
  $  145.后氧学习值                                          $    $              $    $  ANS093.BYTE021  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  146.禁止自动启停                                        $    $              $    $  ANS094.BYTE004  $  if(((x>>5)&1))y=@015d;else y=@006c;
  $  147.仪表显示累碳量报警                                  $    $              $    $  ANS094.BYTE004  $  if(((x>>4)&1))y=@015d;else y=@006c;
  $  148.GPF温度高禁止减速断油                               $    $              $    $  ANS094.BYTE004  $  if(((x>>3)&1))y=@015d;else y=@006c;
  $  149.GPF燃烧效率控制使能请求                             $    $              $    $  ANS094.BYTE004  $  if(((x>>2)&1))y=@015d;else y=@006c;
  $  150.GPF最低怠速转速控制使能请求                         $    $              $    $  ANS094.BYTE004  $  if(((x>>1)&1))y=@015d;else y=@006c;
  $  151.GPF空燃比控制使能请求                               $    $              $    $  ANS094.BYTE004  $  if(((x>>0)&1))y=@015d;else y=@006c;
  $  152.GPF灰分计算值                                       $    $              $    $  ANS094.BYTE005  $  y=(x1*256+x2)/32768;
  $  153.GPF里程再生请求                                     $    $              $    $  ANS094.BYTE007  $  y=(x1*256+x2)/32768;
  $  154.GPF发动机运行时间再生请求                           $    $              $    $  ANS094.BYTE009  $  y=(x1*256+x2)/32768;
  $  155.GPF燃油累计再生请求                                 $    $              $    $  ANS094.BYTE011  $  y=(x1*256+x2)/32768;
  $  156.GPF碳载量再生请求                                   $    $              $    $  ANS094.BYTE013  $  y=(x1*256+x2)/32768;
  $  157.GPF启动次数再生请求                                 $    $              $    $  ANS094.BYTE015  $  y=(x1*256+x2)/32768;
  $  158.GPF压模型再生请求                                   $    $              $    $  ANS094.BYTE017  $  y=(x1*256+x2)/32768;
  $  159.GPF压差                                             $    $  kPa         $    $  ANS094.BYTE019  $  if(x1<0x80)y=(x1*256+x2)/64;else y=(x1*256+x2-65536)/64;
  $  160.GPF压差学习值                                       $    $  kPa         $    $  ANS094.BYTE021  $  if(x1<0x80)y=(x1*256+x2)/64;else y=(x1*256+x2-65536)/64;
  $  161.GPF燃烧效率控制目标值                               $    $              $    $  ANS094.BYTE023  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  162.GPF空燃比控制目标值                                 $    $              $    $  ANS094.BYTE025  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  163.GPF怠速控制目标值                                   $    $  rpm         $    $  ANS094.BYTE027  $  if(x1<0x80)y=x1*256+x2;else y=x1*256+x2-65536;
  $  164.GPF温度                                             $    $  degC        $    $  ANS094.BYTE029  $  if(x1<0x80)y=(x1*256+x2)/16;else y=(x1*256+x2-65536)/16;
  $  165.发动机累计运行时间(GPF)                             $    $  seconds     $    $  ANS094.BYTE031  $  y=(x1<<24)+(x1<<16)+(x1<<8)+(x1<<0);
  $  166.发动机累计耗油量(GPF)                               $    $  kilos       $    $  ANS094.BYTE035  $  y=(x1<<24)+(x1<<16)+(x1<<8)+(x1<<0);
  $  167.累计里程(GPF)                                       $    $  km          $    $  ANS094.BYTE039  $  y=(x1<<24)+(x1<<16)+(x1<<8)+(x1<<0);
  $  168.发动机累计启动次数(GPF)                             $    $              $    $  ANS094.BYTE043  $  y=(x1<<24)+(x1<<16)+(x1<<8)+(x1<<0);
  $  169.累计再生时间                                        $    $  seconds     $    $  ANS094.BYTE047  $  y=(x1<<24)+(x1<<16)+(x1<<8)+(x1<<0);
  $  170.再生激活时间                                        $    $  seconds     $    $  ANS094.BYTE051  $  y=(x1<<24)+(x1<<16)+(x1<<8)+(x1<<0);
  $  171.1 缸超级爆震次数                                    $    $              $    $  ANS095.BYTE004  $  y=x;
  $  172.2缸超级爆震次数                                     $    $              $    $  ANS095.BYTE005  $  y=x;
  $  173.3缸超级爆震次数                                     $    $              $    $  ANS095.BYTE006  $  y=x;
  $  174.辛烷值                                              $    $              $    $  ANS096.BYTE004  $  if(x1<0x80)y=(x1*256+x2)/16384;else y=(x1*256+x2-65536)/16384;
  $  175.曲轴箱通风管断开                                    $    $              $    $  ANS097.BYTE004  $  if(x&0x80)y=@001b;else y=@001c;
  $  176.散热器冷却液温度                                    $    $  degC        $    $  ANS098.BYTE004  $  if(x1<0x80)y=(x1*256+x2)/16;else y=(x1*256+x2-65536)/16;
  $  177.GPF载体温度                                         $    $  degC        $    $  ANS099.BYTE004  $  if(x1<0x80)y=(x1*256+x2)/16;else y=(x1*256+x2-65536)/16;
  $  178.GPF压差信号                                         $    $  kPa         $    $  ANS100.BYTE004  $  if(x1<0x80)y=(x1*256+x2)/64;else y=(x1*256+x2-65536)/64;
  $  179.高脱附管路压力                                      $    $  kPa         $    $  ANS101.BYTE004  $  if(x1<0x80)y=(x1*256+x2)/64;else y=(x1*256+x2-65536)/64;
  $  180.碳罐截止阀占空比                                    $    $  pct         $    $  ANS102.BYTE004  $  if(x1<0x80)y=(x1*256+x2)/256;else y=(x1*256+x2-65536)/256;
  $  181.泄压阀状态                                          $    $              $    $  ANS103.BYTE004  $  if(x&0x80)y=@001b;else y=@001c;
  $  182.已完成诊断计数器                                    $    $              $    $  ANS104.BYTE004  $  y=x1*256+x2;
  $  183.启动时温度差值                                      $    $  degC        $    $  ANS104.BYTE006  $  y=(x1*256+x2)/16;

  $)  01.燃油喷射诊断信息
  $  01.燃油喷射诊断信息
  $  REQ000:7E0 03 22 17 02 00 00 00 00       $  ANS000:7E8 03 22 17 02 00 00 00 00

  $  000.燃油喷嘴1过温检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>7)&1))y=@024b;else y=@04fb;
  $  001.燃油喷嘴2过温检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>6)&1))y=@024b;else y=@04fb;
  $  002.燃油喷嘴3过温检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>7)&1))y=@024b;else y=@04fb;
  $  003.燃油喷嘴4过温检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>4)&1))y=@024b;else y=@04fb;
  $  004.燃油喷嘴1过流检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>3)&1))y=@024b;else y=@04fb;
  $  005.燃油喷嘴2过流检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>2)&1))y=@024b;else y=@04fb;
  $  006.燃油喷嘴3过流检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>1)&1))y=@024b;else y=@04fb;
  $  007.燃油喷嘴4过流检测                     $    $       $    $  ANS000.BYTE004  $  if(((x>>0)&1))y=@024b;else y=@04fb;
  $  008.燃油喷嘴外部时钟晶振状态              $    $       $    $  ANS000.BYTE005  $  if(((x>>7)&1))y=@04fc;else y=@0040;
  $  009.SPI通信故障                           $    $       $    $  ANS000.BYTE005  $  if(((x>>6)&1))y=@024b;else y=@04fb;
  $  010.电池电压低导致的关闭                  $    $       $    $  ANS000.BYTE005  $  if(((x>>7)&1))y=@024b;else y=@04fb;
  $  011.SPI命令发出的NDIS脉冲导致的关闭       $    $       $    $  ANS000.BYTE005  $  if(((x>>4)&1))y=@024b;else y=@04fb;
  $  012.DIS导致的关闭                         $    $       $    $  ANS000.BYTE005  $  if(((x>>3)&1))y=@024b;else y=@04fb;
  $  013.NDIS导致的关闭                        $    $       $    $  ANS000.BYTE005  $  if(((x>>2)&1))y=@024b;else y=@04fb;
  $  014.NRST导致的关闭                        $    $       $    $  ANS000.BYTE005  $  if(((x>>1)&1))y=@024b;else y=@04fb;
  $  015.软件重启导致的关闭                    $    $       $    $  ANS000.BYTE005  $  if(((x>>0)&1))y=@024b;else y=@04fb;
  $  016.硬件配置错误导致的关闭                $    $       $    $  ANS000.BYTE006  $  if(((x>>7)&1))y=@024b;else y=@04fb;
  $  017.重启导致的关闭                        $    $       $    $  ANS000.BYTE006  $  if(((x>>6)&1))y=@024b;else y=@04fb;
  $  018.VDD5电压低导致的关闭                  $    $       $    $  ANS000.BYTE006  $  if(((x>>7)&1))y=@024b;else y=@04fb;
  $  019.VDD5过压导致的关闭                    $    $       $    $  ANS000.BYTE006  $  if(((x>>4)&1))y=@024b;else y=@04fb;
  $  020.硬件自检导致的关闭                    $    $       $    $  ANS000.BYTE006  $  if(((x>>3)&1))y=@024b;else y=@04fb;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
