
    车型ID：7376

    模拟：协议模拟-->7376

;******************************************************************************************************************************************************

    通讯线: $~03$~08$~500k$~70E

进入命令:

  $~  REQ000:706 02 10 01 00 00 00 00 00       $~  ANS000:70E 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:706 02 3E 00 00 00 00 00 00       $!  ANS000:70E 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:706 03 19 02 09 00 00 00 00       $#  ANS000:70E 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/5b000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:706 04 14 FF FF FF 00 00 00       $$  ANS000:70E 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:706 03 22 F1 90 00 00 00 00       $%  ANS000:70E 03 22 F1 90 00 00 00 00
  $%  REQ001:706 03 22 F1 87 00 00 00 00       $%  ANS001:70E 03 22 F1 87 00 00 00 00
  $%  REQ002:706 03 22 F1 89 00 00 00 00       $%  ANS002:70E 03 22 F1 89 00 00 00 00
  $%  REQ003:706 03 22 F1 79 00 00 00 00       $%  ANS003:70E 03 22 F1 79 00 00 00 00
  $%  REQ004:706 03 22 F1 99 00 00 00 00       $%  ANS004:70E 03 22 F1 99 00 00 00 00
  $%  REQ005:706 03 22 F1 95 00 00 00 00       $%  ANS005:70E 03 22 F1 95 00 00 00 00
  $%  REQ006:706 03 22 F1 93 00 00 00 00       $%  ANS006:70E 03 22 F1 93 00 00 00 00
  $%  REQ007:706 03 22 F1 97 00 00 00 00       $%  ANS007:70E 03 22 F1 97 00 00 00 00
  $%  REQ008:706 03 22 F1 8A 00 00 00 00       $%  ANS008:70E 03 22 F1 8A 00 00 00 00
  $%  REQ009:706 03 22 F1 8C 00 00 00 00       $%  ANS009:70E 03 22 F1 8C 00 00 00 00
  $%  REQ010:706 03 22 F1 A1 00 00 00 00       $%  ANS010:70E 03 22 F1 A1 00 00 00 00
  $%  REQ011:706 03 22 F1 7F 00 00 00 00       $%  ANS011:70E 03 22 F1 7F 00 00 00 00
  $%  REQ012:706 03 22 F1 8B 00 00 00 00       $%  ANS012:70E 03 22 F1 8B 00 00 00 00
  $%  REQ013:706 03 22 F1 A3 00 00 00 00       $%  ANS013:70E 03 22 F1 A3 00 00 00 00

  $%  000:VIN码:               $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:零件号:              $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  002:软件版本(OEM):       $%    $%  ANS002.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  003:硬件版本(OEM):       $%    $%  ANS003.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  004:编程日期:            $%    $%  ANS004.BYTE004  $%  if((x1==0xff&&x2==0xff&&x3==0xff&&x4==0xff)||(x1==0&&x2==0&&x3==0&&x4==0))y=@0425;else y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:软件版本(sys):       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  006:硬件版本(sys):       $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:系统名称:            $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3);
  $%  008:供应商代码:          $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  009:ECU生产序列号:       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x18,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30);
  $%  010:维修店编码:          $%    $%  ANS010.BYTE004  $%  if((x1==0xff&&x2==0xff&&x3==0xff&&x4==0xff&&x5==0xff)||(x1==0&&x2==0&&x3==0&&x4==0&&x5==0))y=@0425;else y=ASCII(x1,x2,x3,x4,x5);
  $%  011:维修日期:            $%    $%  ANS010.BYTE009  $%  if((x1==0xff&&x2==0xff&&x3==0xff&&x4==0xff)||(x1==0&&x2==0&&x3==0&&x4==0))y=@0425;else y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:维修时的里程:        $%    $%  ANS010.BYTE013  $%  if((x1==0xff&&x2==0xff&&x3==0xff)||(x1==0&&x2==0&&x3==0))y=@0425;else y=(x1<<16)+(x2<<8)+x3;
  $%  013:软件校验码:          $%    $%  ANS011.BYTE004  $%  HEX(x1,x2);
  $%  014:ECU生产日期:         $%    $%  ANS012.BYTE004  $%  if((x1==0xff&&x2==0xff&&x3==0xff&&x4==0xff)||(x1==0&&x2==0&&x3==0&&x4==0))y=@0425;else y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  015:软件长标识:          $%    $%  ANS013.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:706 03 22 02 00 00 00 00 00       $  ANS000:70E 03 22 02 00 00 00 00 00
  $  REQ001:706 03 22 02 07 00 00 00 00       $  ANS001:70E 03 22 02 07 00 00 00 00
  $  REQ002:706 03 22 01 00 00 00 00 00       $  ANS002:70E 03 22 01 00 00 00 00 00
  $  REQ003:706 03 22 01 01 00 00 00 00       $  ANS003:70E 03 22 01 01 00 00 00 00
  $  REQ004:706 03 22 01 02 00 00 00 00       $  ANS004:70E 03 22 01 02 00 00 00 00
  $  REQ005:706 03 22 01 03 00 00 00 00       $  ANS005:70E 03 22 01 03 00 00 00 00
  $  REQ006:706 03 22 01 04 00 00 00 00       $  ANS006:70E 03 22 01 04 00 00 00 00
  $  REQ007:706 03 22 01 05 00 00 00 00       $  ANS007:70E 03 22 01 05 00 00 00 00
  $  REQ008:706 03 22 01 06 00 00 00 00       $  ANS008:70E 03 22 01 06 00 00 00 00
  $  REQ009:706 03 22 12 00 00 00 00 00       $  ANS009:70E 03 22 12 00 00 00 00 00
  $  REQ010:706 03 22 12 01 00 00 00 00       $  ANS010:70E 03 22 12 01 00 00 00 00
  $  REQ011:706 03 22 12 02 00 00 00 00       $  ANS011:70E 03 22 12 02 00 00 00 00
  $  REQ012:706 03 22 12 03 00 00 00 00       $  ANS012:70E 03 22 12 03 00 00 00 00
  $  REQ013:706 03 22 12 04 00 00 00 00       $  ANS013:70E 03 22 12 04 00 00 00 00
  $  REQ014:706 03 22 01 A0 00 00 00 00       $  ANS014:70E 03 22 01 A0 00 00 00 00
  $  REQ015:706 03 22 01 A1 00 00 00 00       $  ANS015:70E 03 22 01 A1 00 00 00 00
  $  REQ016:706 03 22 01 A2 00 00 00 00       $  ANS016:70E 03 22 01 A2 00 00 00 00
  $  REQ017:706 03 22 01 A3 00 00 00 00       $  ANS017:70E 03 22 01 A3 00 00 00 00
  $  REQ018:706 03 22 01 A4 00 00 00 00       $  ANS018:70E 03 22 01 A4 00 00 00 00
  $  REQ019:706 03 22 01 A5 00 00 00 00       $  ANS019:70E 03 22 01 A5 00 00 00 00
  $  REQ020:706 03 22 01 A6 00 00 00 00       $  ANS020:70E 03 22 01 A6 00 00 00 00
  $  REQ021:706 03 22 01 A7 00 00 00 00       $  ANS021:70E 03 22 01 A7 00 00 00 00
  $  REQ022:706 03 22 01 A8 00 00 00 00       $  ANS022:70E 03 22 01 A8 00 00 00 00

  $  000.行车自动落锁功能                           $    $          $    $  ANS000.BYTE004  $  if(((x>>0)&1))y=@0160;else y=@0161;
  $  001.车身防盗报警功能                           $    $          $    $  ANS000.BYTE004  $  if(((x>>1)&1))y=@0160;else y=@0161;
  $  002.紧急制动双闪功能                           $    $          $    $  ANS000.BYTE004  $  if(((x>>2)&1))y=@0160;else y=@0161;
  $  003.前转向灯类型                               $    $          $    $  ANS000.BYTE004  $  if(((x>>3)&1))y=@01b1;else y=@01b2;
  $  004.左右日间行车灯控制功能                     $    $          $    $  ANS000.BYTE004  $  if(((x>>4)&1))y=@0160;else y=@0161;
  $  005.后转向灯类型                               $    $          $    $  ANS000.BYTE004  $  if(((x>>6)&1))y=@01b1;else y=@01b2;
  $  006.前转向灯DTC使能                            $    $          $    $  ANS000.BYTE004  $  if(((x>>7)&1))y=@0160;else y=@0161;
  $  007.自动雨刮功能                               $    $          $    $  ANS000.BYTE005  $  if(((x>>0)&1))y=@0160;else y=@0161;
  $  008.电动后尾门功能                             $    $          $    $  ANS000.BYTE005  $  if(((x>>1)&1))y=@0160;else y=@0161;
  $  009.雨量关窗功能                               $    $          $    $  ANS000.BYTE005  $  if(((x>>2)&1))y=@0160;else y=@0161;
  $  010.多色氛围灯功能                             $    $          $    $  ANS000.BYTE005  $  if(((x>>3)&1))y=@0160;else y=@0161;
  $  011.电动后视镜折叠功能                         $    $          $    $  ANS000.BYTE005  $  if(((x>>4)&1))y=@0160;else y=@0161;
  $  012.自动灯光功能配置                           $    $          $    $  ANS000.BYTE005  $  if(((x>>5)&1))y=@0160;else y=@0161;
  $  013.高压油箱盖锁                               $    $          $    $  ANS000.BYTE005  $  if(((x>>6)&1))y=@0160;else y=@0161;
  $  014.雨量关窗功能配置                           $    $          $    $  ANS000.BYTE005  $  if(((x>>7)&1))y=@05ec;else y=@05ed;
  $  015.电池传感器配置                             $    $          $    $  ANS000.BYTE007  $  if(((x>>7)&1))y=@05ee;else y=@0304;
  $  016.环境光线阈值百分比                         $    $  %       $    $  ANS000.BYTE008  $  y=x;
  $  017.红外光线阈值百分比                         $    $  %       $    $  ANS000.BYTE009  $  y=x;
  $  018.负载模式配置                               $    $          $    $  ANS001.BYTE004  $  if((x&0x7)==0)y=@0311;else if((x&0x7)==1)y=@0312;else if((x&0x7)==2)y=@0313;else if((x&0x7)==3)y=@0314;else y=@000a;
  $  019.伴我回家灯开关激活最大时间                 $    $  ms      $    $  ANS002.BYTE004  $  y=(x&0x7)*500;
  $  020.弯道辅助照明                               $    $          $    $  ANS002.BYTE004  $  if(((x>>3)&1))y=@0160;else y=@0161;
  $  021.伴我回家灯的持续点亮时间                   $    $  s       $    $  ANS003.BYTE004  $  y=(x&0xF)*5;
  $  022.自动关闭近光灯和雾灯的时间周期             $    $  min     $    $  ANS003.BYTE004  $  y=((x>>4)&0xF)*5;
  $  023.点火开关关闭后，车窗电源延时关闭时间       $    $  s       $    $  ANS004.BYTE004  $  y=((x>>4)&0xF)*5;
  $  024.行李箱开关滤波时间                         $    $  ms      $    $  ANS005.BYTE004  $  y=x*20+100;
  $  025.行李箱锁驱动时间                           $    $  ms      $    $  ANS005.BYTE005  $  y=x*20+100;
  $  026.所有车门关闭时，顶灯保持点亮时间           $    $  s       $    $  ANS005.BYTE006  $  y=((x>>1)&0xF)*5;
  $  027.至少一个车门未关时，顶灯保持点亮时间       $    $  min     $    $  ANS005.BYTE006  $  y=((x>>5)&0x7)*5;
  $  028.行李箱开启时，行李箱开关滤波时间           $    $  ms      $    $  ANS006.BYTE004  $  y=(x&0xF)*240;
  $  029.碰撞解锁功能                               $    $          $    $  ANS006.BYTE005  $  if(((x>>0)&1))y=@0160;else y=@0161;
  $  030.除霜器                                     $    $          $    $  ANS006.BYTE005  $  if(((x>>2)&1))y=@0160;else y=@0161;
  $  031.除霜器的最长激活时间                       $    $  min     $    $  ANS006.BYTE005  $  y=((x>>3)&0x1F);
  $  032.前雨刮清洗延长挂刷次数                     $    $          $    $  ANS006.BYTE006  $  y=x&0x7;
  $  033.前雨刮清洗延长刮水功能                     $    $          $    $  ANS006.BYTE006  $  if(((x>>3)&1))y=@0160;else y=@0161;
  $  034.前洗涤开关雨刮联动最小时间                 $    $  ms      $    $  ANS006.BYTE006  $  y=((x>>4)&0xF)*40;
  $  035.后雨刮清洗延长挂刷次数                     $    $          $    $  ANS006.BYTE007  $  y=x&0x7;
  $  036.后雨刮清洗延长刮水功能                     $    $          $    $  ANS006.BYTE007  $  if(((x>>3)&1))y=@0160;else y=@0161;
  $  037.后洗涤开关雨刮联动最小时间                 $    $  ms      $    $  ANS006.BYTE007  $  y=((x>>4)&0xF)*40;
  $  038.自动重新上锁锁功能                         $    $          $    $  ANS007.BYTE004  $  if(((x>>0)&1))y=@0160;else y=@0161;
  $  039.节电电源输出最大时间                       $    $  min     $    $  ANS007.BYTE004  $  y=(x>>2)&0x3F;
  $  040.车窗一键升降功能                           $    $          $    $  ANS007.BYTE005  $  if(((x>>0)&1))y=@0160;else y=@0161;
  $  041.多色氛围灯色彩值                           $    $          $    $  ANS007.BYTE006  $  y=x;
  $  042.多色氛围灯亮度值                           $    $          $    $  ANS007.BYTE007  $  y=x;
  $  043.电源管理AA值-ACC档                         $    $  min     $    $  ANS008.BYTE004  $  y=((x&0xF)*5+5);
  $  044.电源管理AA值-ON档                          $    $  min     $    $  ANS008.BYTE004  $  y=((x>>4)&0xF)*5+5;
  $  045.电源管理AA值-ON档+鼓风机                   $    $  min     $    $  ANS008.BYTE005  $  y=((x&0xF)*5+5);
  $  046.切换用户模式里程数                         $    $  km      $    $  ANS008.BYTE005  $  y=((x>>4)&0xF)*20+20;
  $  047.电源管理BB值                               $    $  %       $    $  ANS008.BYTE006  $  y=x;
  $  048.电源管理CC值-ACC档                         $    $  v       $    $  ANS008.BYTE007  $  y=x*0.1;
  $  049.电源管理CC值+ON档                          $    $  v       $    $  ANS008.BYTE008  $  y=x*0.1;
  $  050.电源管理CC值+ON档+鼓风机                   $    $  v       $    $  ANS008.BYTE009  $  y=x*0.1;
  $  051.蓄电池初始电压                             $    $  v       $    $  ANS008.BYTE010  $  y=x*0.1;
  $  052.左后转向灯反馈                             $    $          $    $  ANS009.BYTE004  $  if(((x>>0)&1))y=@0165;else y=@0166;
  $  053.右后转向灯反馈                             $    $          $    $  ANS009.BYTE004  $  if(((x>>1)&1))y=@0165;else y=@0166;
  $  054.危险灯开关                                 $    $          $    $  ANS009.BYTE004  $  if(((x>>2)&1))y=@0165;else y=@0166;
  $  055.左前转向灯反馈                             $    $          $    $  ANS009.BYTE004  $  if(((x>>3)&1))y=@0165;else y=@0166;
  $  056.右前转向灯反馈                             $    $          $    $  ANS009.BYTE004  $  if(((x>>4)&1))y=@0165;else y=@0166;
  $  057.制动灯开关                                 $    $          $    $  ANS009.BYTE004  $  if(((x>>5)&1))y=@004c;else y=@004b;
  $  058.行李箱状态开关                             $    $          $    $  ANS010.BYTE004  $  if(((x>>3)&1))y=@015d;else y=@006c;
  $  059.左前门状态开关                             $    $          $    $  ANS010.BYTE004  $  if(((x>>4)&1))y=@015d;else y=@006c;
  $  060.右前门状态开关                             $    $          $    $  ANS010.BYTE004  $  if(((x>>5)&1))y=@015d;else y=@006c;
  $  061.左后门状态开关                             $    $          $    $  ANS010.BYTE004  $  if(((x>>6)&1))y=@015d;else y=@006c;
  $  062.右后门状态开关                             $    $          $    $  ANS010.BYTE004  $  if(((x>>7)&1))y=@015d;else y=@006c;
  $  063.行李箱开启开关                             $    $          $    $  ANS011.BYTE004  $  if(((x>>1)&1))y=@004c;else y=@004b;
  $  064.高压油箱盖开关                             $    $          $    $  ANS011.BYTE004  $  if(((x>>2)&1))y=@004c;else y=@004b;
  $  065.主驾驶门锁状态/反馈                        $    $          $    $  ANS011.BYTE004  $  if(((x>>3)&1))y=@0069;else y=@0068;
  $  066.内后备箱解锁开关                           $    $          $    $  ANS011.BYTE004  $  if(((x>>4)&1))y=@00dd;else y=@00de;
  $  067.中控车门锁止开关                           $    $          $    $  ANS011.BYTE004  $  if(((x>>5)&1))y=@00dd;else y=@00de;
  $  068.中控车门解锁开关                           $    $          $    $  ANS011.BYTE004  $  if(((x>>6)&1))y=@00dd;else y=@00de;
  $  069.后雨刮停止开关输入状态                     $    $          $    $  ANS012.BYTE004  $  if(((x>>1)&1))y=@004c;else y=@004b;
  $  070.前雨刮停止开关输入状态                     $    $          $    $  ANS012.BYTE004  $  if(((x>>2)&1))y=@004c;else y=@004b;
  $  071.前发动机舱盖接触开关                       $    $          $    $  ANS012.BYTE005  $  if(((x>>4)&1))y=@00dd;else y=@00de;
  $  072.外部后视镜折叠开关                         $    $          $    $  ANS012.BYTE005  $  if(((x>>5)&1))y=@00dd;else y=@00de;
  $  073.外部后视镜展开开关                         $    $          $    $  ANS012.BYTE005  $  if(((x>>6)&1))y=@00dd;else y=@00de;
  $  074.IGN 2(点火2)                               $    $          $    $  ANS013.BYTE004  $  if(((x>>1)&1))y=@004c;else y=@004b;
  $  075.IGN 1(点火1)                               $    $          $    $  ANS013.BYTE004  $  if(((x>>2)&1))y=@004c;else y=@004b;
  $  076.钥匙插入                                   $    $          $    $  ANS013.BYTE004  $  if(((x>>3)&1))y=@004c;else y=@004b;
  $  077.ACC                                        $    $          $    $  ANS013.BYTE004  $  if(((x>>4)&1))y=@004c;else y=@004b;
  $  078.左闪光灯过载计数器                         $    $          $    $  ANS014.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  079.左闪光灯过载标志                           $    $          $    $  ANS014.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  080.右闪光灯过载计数器                         $    $          $    $  ANS015.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  081.右闪光灯过载标志                           $    $          $    $  ANS015.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  082.后雾灯过载计数器                           $    $          $    $  ANS016.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  083.后雾灯过载标志                             $    $          $    $  ANS016.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  084.前雾灯过载计数器                           $    $          $    $  ANS017.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  085.前雾灯过载标志                             $    $          $    $  ANS017.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  086.内饰灯过载计数器                           $    $          $    $  ANS018.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  087.内饰灯过载标志                             $    $          $    $  ANS018.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  088.位置灯过载计数器                           $    $          $    $  ANS019.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  089.位置灯过载标志                             $    $          $    $  ANS019.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  090.近光灯过载计数器                           $    $          $    $  ANS020.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  091.近光灯过载标志                             $    $          $    $  ANS020.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  092.远光灯过载计数器                           $    $          $    $  ANS021.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  093.远光灯过载标志                             $    $          $    $  ANS021.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;
  $  094.启用继电器过载计数器                       $    $          $    $  ANS022.BYTE004  $  y=(x1&0x7F)*256+x2;
  $  095.启用继电器过载标志                         $    $          $    $  ANS022.BYTE004  $  if(((x1>>7)&1))y=@015e;else y=@015f;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:706 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
