
    车型ID：737c

    模拟：协议模拟-->737c

;******************************************************************************************************************************************************

    通讯线: $~03$~08$~500k$~70A

进入命令:

  $~  REQ000:702 02 10 01 00 00 00 00 00       $~  ANS000:70A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:702 02 3E 00 00 00 00 00 00       $!  ANS000:70A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:702 03 19 02 09 00 00 00 00       $#  ANS000:70A 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/3f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:702 04 14 FF FF FF 00 00 00       $$  ANS000:70A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:702 03 22 F1 89 00 00 00 00       $%  ANS000:70A 03 22 F1 89 00 00 00 00
  $%  REQ001:702 03 22 F1 79 00 00 00 00       $%  ANS001:70A 03 22 F1 79 00 00 00 00
  $%  REQ002:702 03 22 F1 99 00 00 00 00       $%  ANS002:70A 03 22 F1 99 00 00 00 00
  $%  REQ003:702 03 22 F1 7F 00 00 00 00       $%  ANS003:70A 03 22 F1 7F 00 00 00 00
  $%  REQ004:702 03 22 F1 8A 00 00 00 00       $%  ANS004:70A 03 22 F1 8A 00 00 00 00
  $%  REQ005:702 03 22 F1 8C 00 00 00 00       $%  ANS005:70A 03 22 F1 8C 00 00 00 00
  $%  REQ006:702 03 22 F1 90 00 00 00 00       $%  ANS006:70A 03 22 F1 90 00 00 00 00
  $%  REQ007:702 03 22 F1 91 00 00 00 00       $%  ANS007:70A 03 22 F1 91 00 00 00 00
  $%  REQ008:702 03 22 F1 97 00 00 00 00       $%  ANS008:70A 03 22 F1 97 00 00 00 00
  $%  REQ009:702 03 22 F1 A1 00 00 00 00       $%  ANS009:70A 03 22 F1 A1 00 00 00 00

  $%  000:软件版本(OEM):               $%    $%  ANS000.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  001:硬件版本(OEM):               $%    $%  ANS001.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  002:软件发布日期:                $%    $%  ANS002.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  003:软件校验码:                  $%    $%  ANS003.BYTE004  $%  HEX(x1,x2);
  $%  004:供应商代码:                  $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:生产序列号:                  $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  006:VIN码:                       $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:主机厂ECU编号(零件号):       $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  008:系统名称:                    $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5);
  $%  009:维修店编码:                  $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5);
  $%  010:维修时间:                    $%    $%  ANS009.BYTE009  $%  HEX(x1,x2,x3,x4);
  $%  011:维修时的总里程:              $%    $%  ANS009.BYTE013  $%  y=(x1<<16)+(x2<<8)+x3;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:702 03 22 FE 01 00 00 00 00       $  ANS000:70A 03 22 FE 01 00 00 00 00
  $  REQ001:702 03 22 FE 02 00 00 00 00       $  ANS001:70A 03 22 FE 02 00 00 00 00
  $  REQ002:702 03 22 FE 03 00 00 00 00       $  ANS002:70A 03 22 FE 03 00 00 00 00
  $  REQ003:702 03 22 FE 04 00 00 00 00       $  ANS003:70A 03 22 FE 04 00 00 00 00
  $  REQ004:702 03 22 FE 05 00 00 00 00       $  ANS004:70A 03 22 FE 05 00 00 00 00
  $  REQ005:702 03 22 FE 06 00 00 00 00       $  ANS005:70A 03 22 FE 06 00 00 00 00
  $  REQ006:702 03 22 FE 07 00 00 00 00       $  ANS006:70A 03 22 FE 07 00 00 00 00
  $  REQ007:702 03 22 FE 08 00 00 00 00       $  ANS007:70A 03 22 FE 08 00 00 00 00
  $  REQ008:702 03 22 FE 09 00 00 00 00       $  ANS008:70A 03 22 FE 09 00 00 00 00
  $  REQ009:702 03 22 FE 0A 00 00 00 00       $  ANS009:70A 03 22 FE 0A 00 00 00 00
  $  REQ010:702 03 22 FE 0B 00 00 00 00       $  ANS010:70A 03 22 FE 0B 00 00 00 00
  $  REQ011:702 03 22 FE 0D 00 00 00 00       $  ANS011:70A 03 22 FE 0D 00 00 00 00
  $  REQ012:702 03 22 FE 0E 00 00 00 00       $  ANS012:70A 03 22 FE 0E 00 00 00 00
  $  REQ013:702 03 22 FE 0F 00 00 00 00       $  ANS013:70A 03 22 FE 0F 00 00 00 00
  $  REQ014:702 03 22 FE 10 00 00 00 00       $  ANS014:70A 03 22 FE 10 00 00 00 00
  $  REQ015:702 03 22 FE 11 00 00 00 00       $  ANS015:70A 03 22 FE 11 00 00 00 00
  $  REQ016:702 03 22 FE 12 00 00 00 00       $  ANS016:70A 03 22 FE 12 00 00 00 00
  $  REQ017:702 03 22 FE 13 00 00 00 00       $  ANS017:70A 03 22 FE 13 00 00 00 00
  $  REQ018:702 03 22 FE 14 00 00 00 00       $  ANS018:70A 03 22 FE 14 00 00 00 00
  $  REQ019:702 03 22 FE 15 00 00 00 00       $  ANS019:70A 03 22 FE 15 00 00 00 00
  $  REQ020:702 03 22 FE 16 00 00 00 00       $  ANS020:70A 03 22 FE 16 00 00 00 00
  $  REQ021:702 03 22 FE 17 00 00 00 00       $  ANS021:70A 03 22 FE 17 00 00 00 00
  $  REQ022:702 03 22 FE 1B 00 00 00 00       $  ANS022:70A 03 22 FE 1B 00 00 00 00
  $  REQ023:702 03 22 FE 1C 00 00 00 00       $  ANS023:70A 03 22 FE 1C 00 00 00 00
  $  REQ024:702 03 22 FE 1D 00 00 00 00       $  ANS024:70A 03 22 FE 1D 00 00 00 00
  $  REQ025:702 03 22 FE 1E 00 00 00 00       $  ANS025:70A 03 22 FE 1E 00 00 00 00
  $  REQ026:702 03 22 FE 1F 00 00 00 00       $  ANS026:70A 03 22 FE 1F 00 00 00 00
  $  REQ027:702 03 22 FE 20 00 00 00 00       $  ANS027:70A 03 22 FE 20 00 00 00 00
  $  REQ028:702 03 22 FE 21 00 00 00 00       $  ANS028:70A 03 22 FE 21 00 00 00 00
  $  REQ029:702 03 22 FE 23 00 00 00 00       $  ANS029:70A 03 22 FE 23 00 00 00 00
  $  REQ030:702 03 22 FE 24 00 00 00 00       $  ANS030:70A 03 22 FE 24 00 00 00 00
  $  REQ031:702 03 22 FE 25 00 00 00 00       $  ANS031:70A 03 22 FE 25 00 00 00 00
  $  REQ032:702 03 22 FE 30 00 00 00 00       $  ANS032:70A 03 22 FE 30 00 00 00 00
  $  REQ033:702 03 22 FE 31 00 00 00 00       $  ANS033:70A 03 22 FE 31 00 00 00 00
  $  REQ034:702 03 22 FE 34 00 00 00 00       $  ANS034:70A 03 22 FE 34 00 00 00 00
  $  REQ035:702 03 22 FE 35 00 00 00 00       $  ANS035:70A 03 22 FE 35 00 00 00 00
  $  REQ036:702 03 22 FE 36 00 00 00 00       $  ANS036:70A 03 22 FE 36 00 00 00 00

  $  000.PEPS(智能进入控制系统)系统电源模式                     $    $        $    $  ANS000.BYTE004  $  if(x==0)y=@004b;else if(x==1)y=@045c;else if(x==2)y=@004c;else if(x==3)y=@05a1;else y=@000a;
  $  001.备份电源管理系统(BPM)电源模式                          $    $        $    $  ANS001.BYTE004  $  if(x==0)y=@004b;else if(x==1)y=@045c;else if(x==2)y=@004c;else if(x==3)y=@05a1;else y=@000a;
  $  002.当前系统电源管理模式                                   $    $        $    $  ANS002.BYTE004  $  if(x==0)y=@059e;else if(x==1)y=@059f;else if(x==2)y=@05a0;else if(x==3)y=@03d8;else y=@000a;
  $  003.PEPS(智能进入控制系统) 启/停开关状态                   $    $        $    $  ANS003.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  004.PEPS(智能进入控制系统) 绿灯状态                        $    $        $    $  ANS003.BYTE004  $  if(((x>>1)&1)) y = @0000; else y = @0001;
  $  005.PEPS(智能进入控制系统) 黄灯 状态                       $    $        $    $  ANS003.BYTE004  $  if(((x>>2)&1)) y = @0000; else y = @0001;
  $  006.PEPS(智能进入控制系统) 背光灯状态                      $    $        $    $  ANS003.BYTE004  $  if(((x>>3)&1)) y = @0000; else y = @0001;
  $  007.备份电源管理系统(BPM)启/停开关状态                     $    $        $    $  ANS004.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  008.驾驶员侧门锁状态                                       $    $        $    $  ANS005.BYTE004  $  if(((x>>0)&1)) y = @0069; else y = @0068;
  $  009.行李箱开关1状态                                        $    $        $    $  ANS006.BYTE004  $  if(((x>>0)&1)) y = @004c; else y = @004b;
  $  010.行李箱开关2状态                                        $    $        $    $  ANS006.BYTE004  $  if(((x>>1)&1)) y = @004c; else y = @004b;
  $  011.左前门开关状态                                         $    $        $    $  ANS006.BYTE004  $  if(((x>>2)&1)) y = @004c; else y = @004b;
  $  012.右前门开关状态                                         $    $        $    $  ANS006.BYTE004  $  if(((x>>3)&1)) y = @004c; else y = @004b;
  $  013.右后门开关状态                                         $    $        $    $  ANS006.BYTE004  $  if(((x>>4)&1)) y = @004c; else y = @004b;
  $  014.左后门开关状态                                         $    $        $    $  ANS006.BYTE004  $  if(((x>>5)&1)) y = @004c; else y = @004b;
  $  015.右前门请求开关状态                                     $    $        $    $  ANS007.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  016.左前门请求开关状态                                     $    $        $    $  ANS007.BYTE004  $  if(((x>>1)&1)) y = @0000; else y = @0001;
  $  017.行李箱请求开关状态                                     $    $        $    $  ANS007.BYTE004  $  if(((x>>2)&1)) y = @0000; else y = @0001;
  $  018.左前门把手感应信号                                     $    $        $    $  ANS007.BYTE004  $  if(((x>>3)&1)) y = @0000; else y = @0001;
  $  019.右前门把手感应信号                                     $    $        $    $  ANS007.BYTE004  $  if(((x>>4)&1)) y = @0000; else y = @0001;
  $  020.智能钥匙电池电压状态                                   $    $        $    $  ANS008.BYTE004  $  if(((x>>0)&1))y=@0338;else y=@03d5;
  $  021.离合踏板深踩开关1状态                                  $    $        $    $  ANS009.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  022.离合踏板深踩开关2状态                                  $    $        $    $  ANS009.BYTE004  $  if(((x>>1)&1)) y = @0000; else y = @0001;
  $  023.刹车开关1状态                                          $    $        $    $  ANS010.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  024.刹车开关2状态                                          $    $        $    $  ANS010.BYTE004  $  if(((x>>1)&1)) y = @0000; else y = @0001;
  $  025.P档位置开关状态                                        $    $        $    $  ANS011.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  026.ACC继电器反馈状态                                      $    $        $    $  ANS012.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  027.IGN1(点火1)继电器反馈状态                              $    $        $    $  ANS012.BYTE004  $  if(((x>>1)&1)) y = @0000; else y = @0001;
  $  028.IGN2(点火2)继电器反馈状态                              $    $        $    $  ANS012.BYTE004  $  if(((x>>2)&1)) y = @0000; else y = @0001;
  $  029.Start(启动)继电器反馈状态                              $    $        $    $  ANS012.BYTE004  $  if(((x>>3)&1)) y = @0000; else y = @0001;
  $  030.ESCL(电子转向柱锁)反馈1                                $    $        $    $  ANS013.BYTE004  $  if(((x>>0)&1)) y = @0000; else y = @0001;
  $  031.ESCL(电子转向柱锁)反馈2                                $    $        $    $  ANS013.BYTE004  $  if(((x>>1)&1)) y = @0000; else y = @0001;
  $  032.引擎室蜂鸣器驱动类型                                   $    $        $    $  ANS014.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03f2;else if(x==0x02)y=@03f3;else if(x==0x03)y=@03f4;else if(x==0x04)y=@03f5;else if(x==0x05)y=@03f6;else if(x==0x06)y=@03f7;else if(x==0x07)y=@03f8;else if(x==0x08)y=@03f9;else if(x==0x09)y=@03fa;else if(x==0x0A)y=@03fb;else if(x==0x0B)y=@03fc;else if(x==0x0c)y=@03fd;else y=@000a;
  $  033.最新的车门解锁驱动类型                                 $    $        $    $  ANS015.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@0408;else if(x==0x02)y=@0400;else if(x==0x03)y=@0409;else if(x==0x04)y=@040a;else if(x==0x05)y=@040b;else if(x==0x06)y=@040c;else if(x==0x07)y=@040d;else if(x==0x08)y=@040e;else y=@000a;
  $  034.最新的车门闭锁驱动类型                                 $    $        $    $  ANS016.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@0402;else if(x==0x02)y=@0403;else if(x==0x03)y=@0404;else if(x==0x04)y=@0405;else if(x==0x05)y=@0406;else if(x==0x06)y=@0407;
  $  035.最新的行李箱解锁驱动类型                               $    $        $    $  ANS017.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03fe;else if(x==0x02)y=@03ff;else if(x==0x03)y=@0400;else if(x==0x04)y=@0401;
  $  036.智能钥匙认证结果                                       $    $        $    $  ANS018.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03ef;else if(x==0x02)y=@03f0;else if(x==0x03)y=@03f1;
  $  037.EMS(发动机管理系统)认证结果                            $    $        $    $  ANS019.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@02ea;else if(x==0x02)y=@0385;
  $  038.ESCL(电子转向柱锁)认证结果                             $    $        $    $  ANS020.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@02ea;else if(x==0x02)y=@0385;
  $  039.ESCL(电子转向柱锁)锁状态                               $    $        $    $  ANS021.BYTE004  $  if((x&0x03)==0x00)y=@059d;else if((x&0x03)==0x01)y=@0069;else if((x&0x03)==0x02)y=@0068;else if((x&0x03)==0x03)y=@02e9;else y=@000a;
  $  040.ESCL(电子转向柱锁)单元状态                             $    $        $    $  ANS021.BYTE004  $  if((x&0x0C)==0x00)y=@059c;else if((x&0x0C)==0x04)y=@027e;else if((x&0x0C)==0x0C)y=@0040;else y=@000a;
  $  041.ESCL(电子转向柱锁)使能                                 $    $        $    $  ANS021.BYTE004  $  if(x&0x10)y=@0000;else y=@0001;
  $  042.ESCL(电子转向柱锁)请求                                 $    $        $    $  ANS021.BYTE004  $  if(x&0x20)y=@0040;else y=@004d;
  $  043.ESCL(电子转向柱锁)模式                                 $    $        $    $  ANS021.BYTE004  $  if((x&0xC0)==0x40)y=@0133;else if((x&0xC0)==0x80)y=@05b3;else y=@000a;
  $  044.ESCL(电子转向柱锁)LIN线错误反馈                        $    $        $    $  ANS021.BYTE005  $  if(x&0x01)y=@003a;else y=@0045;
  $  045.ESCL(电子转向柱锁)电动机桥故障                         $    $        $    $  ANS021.BYTE005  $  if(x&0x02)y=@003a;else y=@0045;
  $  046.ESCL(电子转向柱锁)电动机故障                           $    $        $    $  ANS021.BYTE005  $  if(x&0x04)y=@003a;else y=@0045;
  $  047.ESCL(电子转向柱锁)微开关故障                           $    $        $    $  ANS021.BYTE005  $  if(x&0x08)y=@003a;else y=@0045;
  $  048.ESCL(电子转向柱锁)低电压标识                           $    $        $    $  ANS021.BYTE005  $  if(x&0x10)y=@05b2;else y=@03d5;
  $  049.ESCL(电子转向柱锁)防盗标识                             $    $        $    $  ANS021.BYTE005  $  if(x&0x40)y=@0000;else y=@0001;
  $  050.ESCL(电子转向柱锁)防盗码                               $    $        $    $  ANS021.BYTE005  $  if(x&0x80)y=@0000;else y=@0001;
  $  051.PEPS(智能进入控制器)电源电压数值                       $    $  V     $    $  ANS022.BYTE004  $  y = x/10;
  $  052.最新的启动类型                                         $    $        $    $  ANS023.BYTE004  $  if(x==0x00)y=@03d9;else if(x==0x01)y=@03e4;else if(x==0x02)y=@05b4;
  $  053.最新的RKE(遥控无钥匙进入)功能类型                      $    $        $    $  ANS024.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03da;else if(x==0x02)y=@0068;else if(x==0x03)y=@03db;else if(x==0x04)y=@03dc;else if(x==0x05)y=@03dd;else if(x==0x06)y=@03e1;else if(x==0x07)y=@03e2;
  $  054.当前存储的智能钥匙数                                   $    $        $    $  ANS025.BYTE004  $  y = x;
  $  055.最新收到的智能钥匙命令                                 $    $        $    $  ANS026.BYTE004  $  if(x==0x00)y=@03d9;else if(x==0x01)y=@03da;else if(x==0x02)y=@0068;else if(x==0x03)y=@03db;else if(x==0x04)y=@03dc;else if(x==0x05)y=@03dd;else if(x==0x06)y=@03de;else if(x==0x07)y=@03df;else if(x==0x08)y=@03e0;else if(x==0x09)y=@03e1;else if(x==0x0A)y=@03e2;
  $  056.最新收到的智能钥匙信息                                 $    $        $    $  ANS027.BYTE004  $  y = (x1<<24)+(x2<<16)+(x3<<8)+x4;
  $  057.ACC继电器驱动                                          $    $        $    $  ANS028.BYTE004  $  if(((x>>0)&1)) y = @003a; else y = @0045;
  $  058.IGN1(点火1)继电器                                      $    $        $    $  ANS028.BYTE005  $  if(((x>>1)&1)) y = @003a; else y = @0045;
  $  059.IGN2(点火2)继电器                                      $    $        $    $  ANS028.BYTE005  $  if(((x>>2)&1)) y = @003a; else y = @0045;
  $  060.伴我回家信号输出状态                                   $    $        $    $  ANS029.BYTE004  $  if(((x>>0)&1))y=@03ed;else y=@03ee;
  $  061.备份电源伴我回家输入状态                               $    $        $    $  ANS030.BYTE004  $  if(x==0x00)y=@03e9;else if(x==0x01)y=@03ea;else if(x==0x02)y=@03eb;else if(x==0x03)y=@03ec;
  $  062.当前诊断模式                                           $    $        $    $  ANS031.BYTE004  $  if(x==0x00)y=@0107;else if(x==0x01)y=@02a4;else if(x==0x02)y=@03e6;else if(x==0x03)y=@03e7;else if(x==0x04)y=@03e8;
  $  063.ESCL(电子转向柱锁)不进行闭锁原因(非闭锁过程失败)       $    $        $    $  ANS032.BYTE004  $  if(x==0x00)y=@0011;else if(x==0x01)y=@05aa;else if(x==0x02)y=@05ab;else if(x==0x03)y=@05ac;else if(x==0x04)y=@05ad;else if(x==0x05)y=@05ae;else if(x==0x06)y=@05af;else if(x==0x07)y=@05b0;else y=@000a;
  $  064.最近一次启动不成功原因                                 $    $        $    $  ANS033.BYTE004  $  if(x==0x00)y=@0011;else if(x==0x01)y=@05a2;else if(x==0x02)y=@05a3;else if(x==0x03)y=@05a4;else if(x==0x04)y=@05a5;else if(x==0x05)y=@05a6;else if(x==0x06)y=@05a7;else if(x==0x07)y=@05a8;else if(x==0x08)y=@05a9;else y=@000a;
  $  065.PEPS1(智能进入控制器1)信号值                           $    $        $    $  ANS034.BYTE004  $  HEX(x1,x2,x3,x4,x5,x6,x7,x8);
  $  066.PEPS4(智能进入控制器4)信号值                           $    $        $    $  ANS035.BYTE004  $  HEX(x1,x2,x3);
  $  067.备份电源管理系统1(BPM1)信号值                          $    $        $    $  ANS036.BYTE004  $  HEX(x1,x2);

  $)  01.PEPS(智能进入系统)电源继电器驱动状态
  $  01.PEPS(智能进入系统)电源继电器驱动状态
  $  REQ000:702 03 22 FE 26 00 00 00 00       $  ANS000:70A 03 22 FE 26 00 00 00 00

  $  000.ACC继电器驱动               $    $       $    $  ANS000.BYTE004  $  if(x&0x01)y=@0000;else y=@0001;
  $  001.IGN1(点火1)继电器驱动       $    $       $    $  ANS000.BYTE004  $  if(x&0x02)y=@0000;else y=@0001;
  $  002.IGN2(点火2)继电器驱动       $    $       $    $  ANS000.BYTE004  $  if(x&0x04)y=@0000;else y=@0001;

  $)  02.BPM(备份电源) 电源继电器驱动状态
  $  02.BPM(备份电源) 电源继电器驱动状态
  $  REQ000:702 03 22 FE 27 00 00 00 00       $  ANS000:70A 03 22 FE 27 00 00 00 00

  $  000.ACC继电器驱动               $    $       $    $  ANS000.BYTE004  $  if(x&0x01)y=@0000;else y=@0001;
  $  001.IGN1(点火1)继电器驱动       $    $       $    $  ANS000.BYTE004  $  if(x&0x02)y=@0000;else y=@0001;
  $  002.IGN2(点火2)继电器驱动       $    $       $    $  ANS000.BYTE004  $  if(x&0x04)y=@0000;else y=@0001;

  $)  03.PEPS(智能进入系统) 电源继电器反馈状态
  $  03.PEPS(智能进入系统) 电源继电器反馈状态
  $  REQ000:702 03 22 FE 28 00 00 00 00       $  ANS000:70A 03 22 FE 28 00 00 00 00

  $  000.ACC 继电器 FB              $    $       $    $  ANS000.BYTE004  $  if(x&0x01)y=@0000;else y=@0001;
  $  001.IGN1(点火1)继电器 FB       $    $       $    $  ANS000.BYTE004  $  if(x&0x02)y=@0000;else y=@0001;
  $  002.IGN2(点火2)继电器 FB       $    $       $    $  ANS000.BYTE004  $  if(x&0x04)y=@0000;else y=@0001;

  $)  04.BPM(备份电源) 电源继电器驱动反馈状态
  $  04.BPM(备份电源) 电源继电器驱动反馈状态
  $  REQ000:702 03 22 FE 29 00 00 00 00       $  ANS000:70A 03 22 FE 29 00 00 00 00

  $  000.ACC 继电器 FB              $    $       $    $  ANS000.BYTE004  $  if(x&0x01)y=@0000;else y=@0001;
  $  001.IGN1(点火1)继电器 FB       $    $       $    $  ANS000.BYTE004  $  if(x&0x02)y=@0000;else y=@0001;
  $  002.IGN2(点火2)继电器 FB       $    $       $    $  ANS000.BYTE004  $  if(x&0x04)y=@0000;else y=@0001;

  $)  05.按键输入状态
  $  05.按键输入状态
  $  REQ000:702 03 22 FE 32 00 00 00 00       $  ANS000:70A 03 22 FE 32 00 00 00 00

  $  000.启停开关         $    $       $    $  ANS000.BYTE004  $  if(x&0x01)y=@0000;else y=@0001;
  $  001.左门开关         $    $       $    $  ANS000.BYTE004  $  if(x&0x02)y=@0000;else y=@0001;
  $  002.右门开关         $    $       $    $  ANS000.BYTE004  $  if(x&0x04)y=@0000;else y=@0001;
  $  003.后背门开关       $    $       $    $  ANS000.BYTE004  $  if(x&0x08)y=@0000;else y=@0001;

  $)  06.PEPS(智能进入控制器)收到的车速及档位状态
  $  06.PEPS(智能进入控制器)收到的车速及档位状态
  $  REQ000:702 03 22 FE 33 00 00 00 00       $  ANS000:70A 03 22 FE 33 00 00 00 00

  $  000.车速丢失                        $    $       $    $  ANS000.BYTE004  $  if(x&0x01)y=@0567;else y=@05b1;
  $  001.车速无效                        $    $       $    $  ANS000.BYTE004  $  if(x&0x02)y=@0567;else y=@05b1;
  $  002.TCU(自动变速箱控制器)丢失       $    $       $    $  ANS000.BYTE004  $  if(x&0x04)y=@0567;else y=@05b1;
  $  003.TCU(自动变速箱控制器)无效       $    $       $    $  ANS000.BYTE004  $  if(x&0x08)y=@0567;else y=@05b1;
  $  004.车速值                          $    $       $    $  ANS000.BYTE005  $  y=x1*256+x2;
  $  005.TCU(自动变速箱控制器)值         $    $       $    $  ANS000.BYTE007  $  y = x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:702 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
