
    车型ID：73b1

    模拟：协议模拟-->73b1

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~688

进入命令:

  $~  REQ000:6A8 01 81 00 00 00 00 00 00       $~  ANS000:688 01 81 00 00 00 00 00 00

空闲命令:

  $!  REQ000:6A8 01 3E 00 00 00 00 00 00       $!  ANS000:688 01 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:6A8 03 17 FF 00 00 00 00 00       $#  ANS000:688 03 17 FF 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE3$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/73b10000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:6A8 03 14 FF 00 00 00 00 00       $$  ANS000:688 03 14 FF 00 00 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:6A8 02 21 80 00 00 00 00 00       $%  ANS000:688 02 21 80 00 00 00 00 00
  $%  REQ001:6A8 02 21 FE 00 00 00 00 00       $%  ANS001:688 02 21 FE 00 00 00 00 00

  $%  000:DF编号(BCD码格式):          $%    $%  ANS000.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  001:供应商编号:                 $%    $%  ANS000.BYTE009  $%  HEX(x1,x2);
  $%  002:补充编号(BCD码格式):        $%    $%  ANS000.BYTE011  $%  HEX(x1,x2,x3,x4,x5);
  $%  003:诊断框架演变索引:           $%    $%  ANS000.BYTE020  $%  HEXx1;
  $%  004:故障码相关参数索引:         $%    $%  ANS000.BYTE021  $%  HEXx1;
  $%  005:硬件版本(OEM):              $%    $%  ANS001.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  006:供应商:                     $%    $%  ANS001.BYTE008  $%  HEXx1;
  $%  007:版本信息:                   $%    $%  ANS001.BYTE009  $%  HEXx1;
  $%  008:软件刷写日期:               $%    $%  ANS001.BYTE010  $%  HEX(x3,x2,x1);
  $%  009:应用程序识别:               $%    $%  ANS001.BYTE013  $%  HEXx1;
  $%  010:软件版本:                   $%    $%  ANS001.BYTE014  $%  HEXx1;
  $%  011:软件标定版本(OEM):          $%    $%  ANS001.BYTE015  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  012:下载日期(十进制格式):       $%    $%  ANS001.BYTE017  $%  HEX(x3,x2,x1);
  $%  013:下载站点:                   $%    $%  ANS001.BYTE020  $%  HEXx1;
  $%  014:下载工具签名:               $%    $%  ANS001.BYTE021  $%  HEX(x1,x2,x3);
  $%  015:下载编号:                   $%    $%  ANS001.BYTE024  $%  HEXx1;
  $%  016:下载文件识别编号:           $%    $%  ANS001.BYTE025  $%  HEX(x1,x2);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.发动机参数:喷油
  $  00.发动机参数:喷油
  $  REQ000:6A8 04 21 C0 80 21 00 00 00       $  ANS000:688 04 21 C0 80 21 00 00 00

  $  000.发动机转速                   $    $  rpm      $    $  ANS000.BYTE003  $  y=x*32;
  $  001.蓄电池电压                   $    $  V        $    $  ANS000.BYTE004  $  y=SPRINTF([%.1f],x1/10);
  $  002.电瓶电压传感器电压           $    $  mV       $    $  ANS000.BYTE005  $  y=SPRINTF([%d],x1*5000/255);
  $  003.目标扭矩                     $    $  Nm       $    $  ANS000.BYTE006  $  y=x*2-100;
  $  004.喷油时间                     $    $  ms       $    $  ANS000.BYTE007  $  y=SPRINTF([%d],x1*100/255);
  $  005.断油状态                     $    $           $    $  ANS000.BYTE008  $  if(x==0x00)y=@0129;else y=@012a;
  $  006.发动机状态                   $    $           $    $  ANS000.BYTE009  $  if(x==0x01)y=@0126;else if(x==0x02)y=@0127;else y=@0128;
  $  007.节气门角度                   $    $  Deg      $    $  ANS000.BYTE010  $  y=SPRINTF([%d],x1*120/255);
  $  008.节气门角度传感器电压         $    $  mV       $    $  ANS000.BYTE011  $  y=SPRINTF([%d],x1*5000/255);
  $  009.水温                         $    $  degC     $    $  ANS000.BYTE012  $  y=x-40;
  $  010.水温传感器电压               $    $  mV       $    $  ANS000.BYTE013  $  y=SPRINTF([%d],x1*5000/255);
  $  011.进气温度                     $    $  degC     $    $  ANS000.BYTE014  $  y=x-40;
  $  012.进气温度传感器电压           $    $  mV       $    $  ANS000.BYTE015  $  y=SPRINTF([%d],x1*5000/255);
  $  013.进气压力                     $    $  mbar     $    $  ANS000.BYTE016  $  y=SPRINTF([%d],x1*4000/255);
  $  014.碳罐净化阀状态               $    $           $    $  ANS000.BYTE020  $  if(x==0x00)y=@0118;else y=@0119;
  $  015.发动机机油温度(估计值)       $    $  degC     $    $  ANS000.BYTE021  $  y=x-40;

  $)  01.发动机参数:点火
  $  01.发动机参数:点火
  $  REQ000:6A8 04 21 C1 80 17 00 00 00       $  ANS000:688 04 21 C1 80 17 00 00 00

  $  000.发动机转速                $    $  rpm      $    $  ANS000.BYTE003  $  y=x*32;
  $  001.蓄电池电压                $    $  V        $    $  ANS000.BYTE004  $  y=SPRINTF([%.1f],x1/10);
  $  002.电瓶电压传感器电压        $    $  mV       $    $  ANS000.BYTE005  $  y=SPRINTF([%d],x1*5000/255);
  $  003.目标扭矩                  $    $  Nm       $    $  ANS000.BYTE006  $  y=x*2-100;
  $  004.点火提前角                $    $  Deg      $    $  ANS000.BYTE007  $  y=SPRINTF([%d],x1*90/255-30);
  $  005.气缸1缸点火蓄能时间       $    $  us       $    $  ANS000.BYTE008  $  y=SPRINTF([%d],x1*30000/255);
  $  006.气缸2缸点火蓄能时间       $    $  us       $    $  ANS000.BYTE009  $  y=SPRINTF([%d],x1*30000/255);
  $  007.气缸3缸点火蓄能时间       $    $  us       $    $  ANS000.BYTE010  $  y=SPRINTF([%d],x1*30000/255);
  $  008.气缸4缸点火蓄能时间       $    $  us       $    $  ANS000.BYTE011  $  y=SPRINTF([%d],x1*30000/255);
  $  009.水温                      $    $  degC     $    $  ANS000.BYTE014  $  y=SPRINTF([%d],x1-40);
  $  010.水温传感器电压            $    $  mV       $    $  ANS000.BYTE015  $  y=SPRINTF([%d],x1*5000/255);
  $  011.进气温度                  $    $  degC     $    $  ANS000.BYTE016  $  y=x-40;
  $  012.进气温度传感器电压        $    $  mV       $    $  ANS000.BYTE017  $  y=x*5000/255;

  $)  02.发动机参数:氧传感器
  $  02.发动机参数:氧传感器
  $  REQ000:6A8 04 21 C2 80 15 00 00 00       $  ANS000:688 04 21 C2 80 15 00 00 00

  $  000.发动机转速             $    $  rpm      $    $  ANS000.BYTE003  $  y=x*32;
  $  001.蓄电池电压             $    $  V        $    $  ANS000.BYTE004  $  y=SPRINTF([%.1f],x1/10);
  $  002.水温                   $    $  degC     $    $  ANS000.BYTE005  $  y=x-40;
  $  003.前氧传感器状态         $    $           $    $  ANS000.BYTE006  $  if(x==0x00)y=@0116;else y=@0117;
  $  004.后氧传感器状态         $    $           $    $  ANS000.BYTE007  $  if(x==0x00)y=@0116;else y=@0117;
  $  005.前氧传感器电压         $    $  mV       $    $  ANS000.BYTE010  $  y=SPRINTF([%d],x1*5000/255);
  $  006.后氧传感器电压         $    $  mV       $    $  ANS000.BYTE011  $  y=SPRINTF([%d],x1*5000/255);
  $  007.氧传感器调节状态       $    $           $    $  ANS000.BYTE014  $  if(x==0x00)y=@0114;else y=@0115;

  $)  03.发动机参数:传感器
  $  03.发动机参数:传感器
  $  REQ000:6A8 04 21 C3 80 27 00 00 00       $  ANS000:688 04 21 C3 80 27 00 00 00

  $  000.发动机转速                      $    $  rpm      $    $  ANS000.BYTE003  $  y=x*32;
  $  001.蓄电池电压                      $    $  V        $    $  ANS000.BYTE004  $  y=SPRINTF([%.1f],x1/10);
  $  002.电瓶电压传感器电压              $    $  mV       $    $  ANS000.BYTE005  $  y=SPRINTF([%d],x1*5000/255);
  $  003.目标扭矩                        $    $  Nm       $    $  ANS000.BYTE006  $  y=x*2-100;
  $  004.发动机状态                      $    $           $    $  ANS000.BYTE007  $  if(x==0x01)y=@0126;else if(x==0x02)y=@0127;else y=@0128;
  $  005.节气门角度                      $    $  Deg      $    $  ANS000.BYTE008  $  y=x*120/255;
  $  006.节气门角度传感器电压            $    $  mV       $    $  ANS000.BYTE009  $  y=SPRINTF([%d],x1*5000/255);
  $  007.水温                            $    $  degC     $    $  ANS000.BYTE010  $  y=x-40;
  $  008.水温传感器电压                  $    $  mV       $    $  ANS000.BYTE011  $  y=SPRINTF([%d],x1*5000/255);
  $  009.进气温度                        $    $  degC     $    $  ANS000.BYTE012  $  y=x-40;
  $  010.进气温度传感器电压              $    $  mV       $    $  ANS000.BYTE013  $  y=SPRINTF([%d],x1*5000/255);
  $  011.进气压力                        $    $  mbar     $    $  ANS000.BYTE014  $  y=SPRINTF([%d],x1*4000/255);
  $  012.碳罐净化阀状态                  $    $           $    $  ANS000.BYTE018  $  if(x==0x00)y=@0118;else y=@0119;
  $  013.碳罐净化阀PWM(脉宽调制)比       $    $  %        $    $  ANS000.BYTE019  $  y=x*100/255;
  $  014.空调允许开启                    $    $           $    $  ANS000.BYTE020  $  if(x==0x00)y=@004b;else y=@004c;
  $  015.空调请求                        $    $           $    $  ANS000.BYTE021  $  if(x==0x00)y=@004b;else y=@004c;
  $  016.变速箱的档位                    $    $           $    $  ANS000.BYTE023  $  if(x==0x00)y=@011f;else if(x==0x01)y=@0120;else if(x==0x02)y=@0121;else if(x==0x03)y=@0122;else if(x==0x04)y=@0123;else if(x==0x05)y=@0124;else if(x==0x06)y=@0125;else y=@000a;
  $  017.发动机机油温度(估计值)          $    $  degC     $    $  ANS000.BYTE024  $  y=x-40;
  $  018.空调管路压力                    $    $  kPa      $    $  ANS000.BYTE025  $  y=SPRINTF([%d],x1*5000/255);
  $  019.驾驶员扭矩需求百分比            $    $  %        $    $  ANS000.BYTE026  $  y=SPRINTF([%d],x1*100/255);

  $)  04.发动机参数:运行中
  $  04.发动机参数:运行中
  $  REQ000:6A8 04 21 C4 80 25 00 00 00       $  ANS000:688 04 21 C4 80 25 00 00 00

  $  000.发动机转速                   $    $  rpm      $    $  ANS000.BYTE003  $  y=x*32;
  $  001.蓄电池电压                   $    $  V        $    $  ANS000.BYTE004  $  y=SPRINTF([%.1f],x1/10);
  $  002.电瓶电压传感器电压           $    $  mV       $    $  ANS000.BYTE005  $  y=SPRINTF([%d],x1*5000/255);
  $  003.点火提前角                   $    $  Deg      $    $  ANS000.BYTE006  $  y=SPRINTF([%d],x1*90/255-30);
  $  004.目标扭矩                     $    $  Nm       $    $  ANS000.BYTE007  $  y=x*2-100;
  $  005.喷油时间                     $    $  ms       $    $  ANS000.BYTE008  $  y=SPRINTF([%d],x1*100/255);
  $  006.断油状态                     $    $           $    $  ANS000.BYTE009  $  if(x==0x00)y=@0129;else y=@012a;
  $  007.发动机状态                   $    $           $    $  ANS000.BYTE010  $  if(x==0x01)y=@0126;else if(x==0x02)y=@0127;else y=@0128;
  $  008.水温                         $    $  degC     $    $  ANS000.BYTE011  $  y=x-40;
  $  009.进气温度                     $    $  degC     $    $  ANS000.BYTE012  $  y=x-40;
  $  010.进气压力                     $    $  mbar     $    $  ANS000.BYTE015  $  y=SPRINTF([%d],x1*4000/255);
  $  011.碳罐净化阀状态               $    $           $    $  ANS000.BYTE017  $  if(x==0x00)y=@0118;else y=@0119;
  $  012.电源继电器指令状态           $    $           $    $  ANS000.BYTE018  $  if(x==0x00)y=@004b;else y=@004c;
  $  013.空调允许开启                 $    $           $    $  ANS000.BYTE019  $  if(x==0x00)y=@004b;else y=@004c;
  $  014.空调请求                     $    $           $    $  ANS000.BYTE020  $  if(x==0x00)y=@004b;else y=@004c;
  $  015.车速                         $    $  km/h     $    $  ANS000.BYTE021  $  y=x;
  $  016.变速箱的档位                 $    $           $    $  ANS000.BYTE023  $  if(x==0x00)y=@011f;else if(x==0x01)y=@0120;else if(x==0x02)y=@0121;else if(x==0x03)y=@0122;else if(x==0x04)y=@0123;else if(x==0x05)y=@0124;else if(x==0x06)y=@0125;else y=@000a;
  $  017.发动机机油温度(估计值)       $    $  degC     $    $  ANS000.BYTE024  $  y=x-40;
  $  018.空调管路压力                 $    $  kPa      $    $  ANS000.BYTE025  $  y=x*11+110;

  $)  05.发动机参数:执行器
  $  05.发动机参数:执行器
  $  REQ000:6A8 04 21 C5 80 16 00 00 00       $  ANS000:688 04 21 C5 80 16 00 00 00

  $  000.发动机转速                             $    $  rpm      $    $  ANS000.BYTE003  $  y=x*32;
  $  001.蓄电池电压                             $    $  V        $    $  ANS000.BYTE004  $  y=SPRINTF([%.1f],x1/10);
  $  002.目标扭矩                               $    $  Nm       $    $  ANS000.BYTE005  $  y=x*2-100;
  $  003.水温                                   $    $  degC     $    $  ANS000.BYTE006  $  y=x-40;
  $  004.进气温度                               $    $  degC     $    $  ANS000.BYTE007  $  y=x-40;
  $  005.氧传感器调节状态                       $    $           $    $  ANS000.BYTE008  $  if(x==0x00)y=@0114;else y=@0115;
  $  006.风扇低速继电器                         $    $           $    $  ANS000.BYTE009  $  if(x==0x00)y=@004b;else y=@004c;
  $  007.风扇实际转速                           $    $  %        $    $  ANS000.BYTE010  $  y=SPRINTF([%d],x1*100/255);
  $  008.风扇目标转速                           $    $  %        $    $  ANS000.BYTE011  $  y=SPRINTF([%d],x1*100/255);
  $  009.空调管路压力                           $    $  kPa      $    $  ANS000.BYTE012  $  y=x*11+110;
  $  010.钥匙状态                               $    $           $    $  ANS000.BYTE013  $  if(x==0x00)y=@004b;else y=@004c;
  $  011.ECU电源状态                            $    $           $    $  ANS000.BYTE014  $  if(x==0x02)y=@011c; else if(x==0x03)y=@011d; else y=@011e;
  $  012.节气门跛行回家和下止点自学习状态       $    $           $    $  ANS000.BYTE016  $  if(x==0x00)y=@011a; else y=@011b;

  $)  06.发动机参数:凸轮轴
  $  06.发动机参数:凸轮轴
  $  REQ000:6A8 04 21 C9 80 08 00 00 00       $  ANS000:688 04 21 C9 80 08 00 00 00

  $  000.允许的凸轮轴角度             $    $  Deg     $    $  ANS000.BYTE003  $  y=x*0.4-20;
  $  001.允许的凸轮轴电子阀状态       $    $          $    $  ANS000.BYTE005  $  if(x==0x00)y=@004b;else y=@004c;
  $  002.发动机转速                   $    $  rpm     $    $  ANS000.BYTE007  $  y=x*32;
  $  003.目标扭矩                     $    $  Nm      $    $  ANS000.BYTE008  $  y=x*2-100;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:6A8 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
