
    车型ID：73d4

    模拟：协议模拟-->73d4

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7D9

进入命令:

  $~  REQ000:7D1 02 10 01 00 00 00 00 00       $~  ANS000:7D9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7D1 02 3E 00 00 00 00 00 00       $!  ANS000:7D9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7D1 03 19 02 09 00 00 00 00       $#  ANS000:7D9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/67000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7D1 04 14 FF FF FF 00 00 00       $$  ANS000:7D9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7D1 03 22 F1 79 00 00 00 00       $%  ANS000:7D9 03 22 F1 79 00 00 00 00
  $%  REQ001:7D1 03 22 F1 80 00 00 00 00       $%  ANS001:7D9 03 22 F1 80 00 00 00 00
  $%  REQ002:7D1 03 22 F1 86 00 00 00 00       $%  ANS002:7D9 03 22 F1 86 00 00 00 00
  $%  REQ003:7D1 03 22 F1 87 00 00 00 00       $%  ANS003:7D9 03 22 F1 87 00 00 00 00
  $%  REQ004:7D1 03 22 F1 89 00 00 00 00       $%  ANS004:7D9 03 22 F1 89 00 00 00 00
  $%  REQ005:7D1 03 22 F1 8A 00 00 00 00       $%  ANS005:7D9 03 22 F1 8A 00 00 00 00
  $%  REQ006:7D1 03 22 F1 8B 00 00 00 00       $%  ANS006:7D9 03 22 F1 8B 00 00 00 00
  $%  REQ007:7D1 03 22 F1 8C 00 00 00 00       $%  ANS007:7D9 03 22 F1 8C 00 00 00 00
  $%  REQ008:7D1 03 22 F1 90 00 00 00 00       $%  ANS008:7D9 03 22 F1 90 00 00 00 00
  $%  REQ009:7D1 03 22 F1 93 00 00 00 00       $%  ANS009:7D9 03 22 F1 93 00 00 00 00
  $%  REQ010:7D1 03 22 F1 95 00 00 00 00       $%  ANS010:7D9 03 22 F1 95 00 00 00 00
  $%  REQ011:7D1 03 22 F1 96 00 00 00 00       $%  ANS011:7D9 03 22 F1 96 00 00 00 00
  $%  REQ012:7D1 03 22 F1 97 00 00 00 00       $%  ANS012:7D9 03 22 F1 97 00 00 00 00
  $%  REQ013:7D1 03 22 F1 98 00 00 00 00       $%  ANS013:7D9 03 22 F1 98 00 00 00 00
  $%  REQ014:7D1 03 22 F1 99 00 00 00 00       $%  ANS014:7D9 03 22 F1 99 00 00 00 00
  $%  REQ015:7D1 03 22 F1 9D 00 00 00 00       $%  ANS015:7D9 03 22 F1 9D 00 00 00 00
  $%  REQ016:7D1 03 22 F1 9C 00 00 00 00       $%  ANS016:7D9 03 22 F1 9C 00 00 00 00
  $%  REQ017:7D1 03 22 F1 A1 00 00 00 00       $%  ANS017:7D9 03 22 F1 A1 00 00 00 00
  $%  REQ018:7D1 03 22 31 00 00 00 00 00       $%  ANS018:7D9 03 22 31 00 00 00 00 00
  $%  REQ019:7D1 03 22 31 01 00 00 00 00       $%  ANS019:7D9 03 22 31 01 00 00 00 00

  $%  000:硬件版本(OEM):                $%    $%  ANS000.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4)&0x0F,(x1&0x0F),x2);
;  $%  001:Bootloader零件号:             $%    $%  ANS001.BYTE004  $%  
  $%  002:激活诊断会话:                 $%    $%  ANS002.BYTE004  $%  HEX(x1);
;  $%  003:零件号(OEM):                  $%    $%  ANS003.BYTE004  $%  
  $%  004:软件版本(OEM):                $%    $%  ANS004.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4)&0x0F,(x1&0x0F),x2);
  $%  005:供应商代码:                   $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  006:ECU生产日期:                  $%    $%  ANS006.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  007:供应商ECU序列号:              $%    $%  ANS007.BYTE013  $%  y=x1*65536+x2*256+x3;
  $%  008:VIN:                          $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:硬件版本号(SYS):              $%    $%  ANS009.BYTE004  $%  HEX(x1,x2);
  $%  010:软件版本号(SYS):              $%    $%  ANS010.BYTE004  $%  HEX(x1,x2);
  $%  011:刷写日期:                     $%    $%  ANS011.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  012:系统名称:                     $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  013:维修店编码或测试序列号:       $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  014:软件发布日期:                 $%    $%  ANS014.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  015:ECU安装日期:                  $%    $%  ANS015.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  016:标定软件版本:                 $%    $%  ANS016.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4)&0x0F,(x1&0x0F),x2);
  $%  017:维修店编码:                   $%    $%  ANS017.BYTE004  $%  if((x1==0xff&&x2==0xff&&x3==0xff&&x4==0xff&&x5==0xff)||(x1==0&&x2==0&&x3==0&&x4==0&&x5==0))y=@0425;else y=ASCII(x1,x2,x3,x4,x5);
  $%  018:维修日期:                     $%    $%  ANS017.BYTE009  $%  if((x1==0xff&&x2==0xff&&x3==0xff&&x4==0xff)||(x1==0&&x2==0&&x3==0&&x4==0))y=@0425;else y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  019:维修时的里程:                 $%    $%  ANS017.BYTE013  $%  if((x1==0xff&&x2==0xff&&x3==0xff)||(x1==0&&x2==0&&x3==0))y=@0425;else y=(x1<<16)+(x2<<8)+x3;
  $%  020:客户组件ID:                   $%    $%  ANS018.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  021:大陆零件号:                   $%    $%  ANS019.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7D1 03 22 02 00 00 00 00 00       $  ANS000:7D9 03 22 02 00 00 00 00 00
  $  REQ001:7D1 03 22 02 01 00 00 00 00       $  ANS001:7D9 03 22 02 01 00 00 00 00
  $  REQ002:7D1 03 22 50 78 00 00 00 00       $  ANS002:7D9 03 22 50 78 00 00 00 00
  $  REQ003:7D1 03 22 10 02 00 00 00 00       $  ANS003:7D9 03 22 10 02 00 00 00 00

  $  000.编程次数           $    $       $    $  ANS000.BYTE004  $  y=x;
  $  001.尝试刷写次数       $    $       $    $  ANS001.BYTE004  $  y=x;
  $  002.下线模式           $    $       $    $  ANS002.BYTE004  $  if(x==0)y=@01d9;else if(x==1)y=@01da;else y=@000a;
  $  003.电池电压           $    $       $    $  ANS003.BYTE007  $  y=x*0.256;
  $  004.储能电压           $    $       $    $  ANS003.BYTE008  $  y=x*0.256;
  $  005.点火循环次数       $    $       $    $  ANS003.BYTE009  $  y=(x1<<24)+(x2<<16)+(x3<<8)+x4;

  $)  01.实时回路阻值
  $  01.实时回路阻值
  $  REQ000:7D1 03 22 10 01 00 00 00 00       $  ANS000:7D9 03 22 10 01 00 00 00 00

  $  000.回路1            $    $          $    $  ANS000.BYTE000  $  if(x1<5)y=@0011;else if(x5==0x01)y=@01db;else if(x5==0x03)y=@01dc;else if(x5==0x00)y=@01dd;else if(x5==0x02)y=@01de;else if(x5==0x0d)y=@01df;else if(x5==0x0e)y=@01e0;else if(x5==0x0f)y=@01e1;else if(x5==0x10)y=@01e2;else if(x5==0x15)y=@01e3;else if(x5==0x16)y=@01e4;else if(x5==0x13)y=@01e5;else if(x5==0x14)y=@01e6;else y=@0011;
  $  001.回路1阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<5)y=@0011;else y=SPRINTF([%.3f],x6*0.256);
  $  002.回路2            $    $          $    $  ANS000.BYTE000  $  if(x1<7)y=@0011;else if(x7==0x01)y=@01db;else if(x7==0x03)y=@01dc;else if(x7==0x00)y=@01dd;else if(x7==0x02)y=@01de;else if(x7==0x0d)y=@01df;else if(x7==0x0e)y=@01e0;else if(x7==0x0f)y=@01e1;else if(x7==0x10)y=@01e2;else if(x7==0x15)y=@01e3;else if(x7==0x16)y=@01e4;else if(x7==0x13)y=@01e5;else if(x7==0x14)y=@01e6;else y=@0011;
  $  003.回路2阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<7)y=@0011;else y=SPRINTF([%.3f],x8*0.256);
  $  004.回路3            $    $          $    $  ANS000.BYTE000  $  if(x1<9)y=@0011;else if(x9==0x01)y=@01db;else if(x9==0x03)y=@01dc;else if(x9==0x00)y=@01dd;else if(x9==0x02)y=@01de;else if(x9==0x0d)y=@01df;else if(x9==0x0e)y=@01e0;else if(x9==0x0f)y=@01e1;else if(x9==0x10)y=@01e2;else if(x9==0x15)y=@01e3;else if(x9==0x16)y=@01e4;else if(x9==0x13)y=@01e5;else if(x9==0x14)y=@01e6;else y=@0011;
  $  005.回路3阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<9)y=@0011;else y=SPRINTF([%.3f],x10*0.256);
  $  006.回路4            $    $          $    $  ANS000.BYTE000  $  if(x1<11)y=@0011;else if(x11==0x01)y=@01db;else if(x11==0x03)y=@01dc;else if(x11==0x00)y=@01dd;else if(x11==0x02)y=@01de;else if(x11==0x0d)y=@01df;else if(x11==0x0e)y=@01e0;else if(x11==0x0f)y=@01e1;else if(x11==0x10)y=@01e2;else if(x11==0x15)y=@01e3;else if(x11==0x16)y=@01e4;else if(x11==0x13)y=@01e5;else if(x11==0x14)y=@01e6;else y=@0011;
  $  007.回路4阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<11)y=@0011;else y=SPRINTF([%.3f],x12*0.256);
  $  008.回路5            $    $          $    $  ANS000.BYTE000  $  if(x1<13)y=@0011;else if(x13==0x01)y=@01db;else if(x13==0x03)y=@01dc;else if(x13==0x00)y=@01dd;else if(x13==0x02)y=@01de;else if(x13==0x0d)y=@01df;else if(x13==0x0e)y=@01e0;else if(x13==0x0f)y=@01e1;else if(x13==0x10)y=@01e2;else if(x13==0x15)y=@01e3;else if(x13==0x16)y=@01e4;else if(x13==0x13)y=@01e5;else if(x13==0x14)y=@01e6;else y=@0011;
  $  009.回路5阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<13)y=@0011;else y=SPRINTF([%.3f],x14*0.256);
  $  010.回路6            $    $          $    $  ANS000.BYTE000  $  if(x1<15)y=@0011;else if(x15==0x01)y=@01db;else if(x15==0x03)y=@01dc;else if(x15==0x00)y=@01dd;else if(x15==0x02)y=@01de;else if(x15==0x0d)y=@01df;else if(x15==0x0e)y=@01e0;else if(x15==0x0f)y=@01e1;else if(x15==0x10)y=@01e2;else if(x15==0x15)y=@01e3;else if(x15==0x16)y=@01e4;else if(x15==0x13)y=@01e5;else if(x15==0x14)y=@01e6;else y=@0011;
  $  011.回路6阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<15)y=@0011;else y=SPRINTF([%.3f],x16*0.256);
  $  012.回路7            $    $          $    $  ANS000.BYTE000  $  if(x1<17)y=@0011;else if(x17==0x01)y=@01db;else if(x17==0x03)y=@01dc;else if(x17==0x00)y=@01dd;else if(x17==0x02)y=@01de;else if(x17==0x0d)y=@01df;else if(x17==0x0e)y=@01e0;else if(x17==0x0f)y=@01e1;else if(x17==0x10)y=@01e2;else if(x17==0x15)y=@01e3;else if(x17==0x16)y=@01e4;else if(x17==0x13)y=@01e5;else if(x17==0x14)y=@01e6;else y=@0011;
  $  013.回路7阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<17)y=@0011;else y=SPRINTF([%.3f],x18*0.256);
  $  014.回路8            $    $          $    $  ANS000.BYTE000  $  if(x1<19)y=@0011;else if(x19==0x01)y=@01db;else if(x19==0x03)y=@01dc;else if(x19==0x00)y=@01dd;else if(x19==0x02)y=@01de;else if(x19==0x0d)y=@01df;else if(x19==0x0e)y=@01e0;else if(x19==0x0f)y=@01e1;else if(x19==0x10)y=@01e2;else if(x19==0x15)y=@01e3;else if(x19==0x16)y=@01e4;else if(x19==0x13)y=@01e5;else if(x19==0x14)y=@01e6;else y=@0011;
  $  015.回路8阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<19)y=@0011;else y=SPRINTF([%.3f],x20*0.256);
  $  016.回路9            $    $          $    $  ANS000.BYTE000  $  if(x1<21)y=@0011;else if(x21==0x01)y=@01db;else if(x21==0x03)y=@01dc;else if(x21==0x00)y=@01dd;else if(x21==0x02)y=@01de;else if(x21==0x0d)y=@01df;else if(x21==0x0e)y=@01e0;else if(x21==0x0f)y=@01e1;else if(x21==0x10)y=@01e2;else if(x21==0x15)y=@01e3;else if(x21==0x16)y=@01e4;else if(x21==0x13)y=@01e5;else if(x21==0x14)y=@01e6;else y=@0011;
  $  017.回路9阻值        $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<21)y=@0011;else y=SPRINTF([%.3f],x22*0.256);
  $  018.回路10           $    $          $    $  ANS000.BYTE000  $  if(x1<23)y=@0011;else if(x23==0x01)y=@01db;else if(x23==0x03)y=@01dc;else if(x23==0x00)y=@01dd;else if(x23==0x02)y=@01de;else if(x23==0x0d)y=@01df;else if(x23==0x0e)y=@01e0;else if(x23==0x0f)y=@01e1;else if(x23==0x10)y=@01e2;else if(x23==0x15)y=@01e3;else if(x23==0x16)y=@01e4;else if(x23==0x13)y=@01e5;else if(x23==0x14)y=@01e6;else y=@0011;
  $  019.回路10阻值       $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<23)y=@0011;else y=SPRINTF([%.3f],x24*0.256);
  $  020.回路11           $    $          $    $  ANS000.BYTE000  $  if(x1<25)y=@0011;else if(x25==0x01)y=@01db;else if(x25==0x03)y=@01dc;else if(x25==0x00)y=@01dd;else if(x25==0x02)y=@01de;else if(x25==0x0d)y=@01df;else if(x25==0x0e)y=@01e0;else if(x25==0x0f)y=@01e1;else if(x25==0x10)y=@01e2;else if(x25==0x15)y=@01e3;else if(x25==0x16)y=@01e4;else if(x25==0x13)y=@01e5;else if(x25==0x14)y=@01e6;else y=@0011;
  $  021.回路11阻值       $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<25)y=@0011;else y=SPRINTF([%.3f],x26*0.256);
  $  022.回路12           $    $          $    $  ANS000.BYTE000  $  if(x1<27)y=@0011;else if(x27==0x01)y=@01db;else if(x27==0x03)y=@01dc;else if(x27==0x00)y=@01dd;else if(x27==0x02)y=@01de;else if(x27==0x0d)y=@01df;else if(x27==0x0e)y=@01e0;else if(x27==0x0f)y=@01e1;else if(x27==0x10)y=@01e2;else if(x27==0x15)y=@01e3;else if(x27==0x16)y=@01e4;else if(x27==0x13)y=@01e5;else if(x27==0x14)y=@01e6;else y=@0011;
  $  023.回路12阻值       $    $  ohm     $    $  ANS000.BYTE000  $  if(x1<27)y=@0011;else y=SPRINTF([%.3f],x28*0.256);

  $)  02.配置信息
  $  02.配置信息
  $  REQ000:7D1 03 22 F0 10 00 00 00 00       $  ANS000:7D9 03 22 F0 10 00 00 00 00

  $  000.驾驶员气囊                     $    $       $    $  ANS000.BYTE004  $  if(((x>>0)&1))y=@00c2;else y=@00c3;
  $  001.副驾驶员气囊                   $    $       $    $  ANS000.BYTE004  $  if(((x>>1)&1))y=@00c2;else y=@00c3;
  $  002.前排左侧安全带预紧器           $    $       $    $  ANS000.BYTE004  $  if(((x>>2)&1))y=@00c2;else y=@00c3;
  $  003.前排右侧安全带预紧器           $    $       $    $  ANS000.BYTE004  $  if(((x>>3)&1))y=@00c2;else y=@00c3;
  $  004.前排左侧侧面气囊               $    $       $    $  ANS000.BYTE004  $  if(((x>>4)&1))y=@00c2;else y=@00c3;
  $  005.前排右侧侧面气囊               $    $       $    $  ANS000.BYTE004  $  if(((x>>5)&1))y=@00c2;else y=@00c3;
  $  006.左侧安全气帘(预留)             $    $       $    $  ANS000.BYTE004  $  if(((x>>6)&1))y=@00c2;else y=@00c3;
  $  007.右侧安全气帘(预留)             $    $       $    $  ANS000.BYTE004  $  if(((x>>7)&1))y=@00c2;else y=@00c3;
  $  008.驾驶员侧安全带预紧             $    $       $    $  ANS000.BYTE005  $  if(((x>>0)&1))y=@00c2;else y=@00c3;
  $  009.驾驶员头部气帘                 $    $       $    $  ANS000.BYTE005  $  if(((x>>1)&1))y=@00c2;else y=@00c3;
  $  010.副驾驶员头部气帘               $    $       $    $  ANS000.BYTE005  $  if(((x>>2)&1))y=@00c2;else y=@00c3;
  $  011.右侧SIS传感器                  $    $       $    $  ANS000.BYTE006  $  if(((x>>0)&1))y=@00c2;else y=@00c3;
  $  012.左侧SIS                        $    $       $    $  ANS000.BYTE006  $  if(((x>>1)&1))y=@00c2;else y=@00c3;
  $  013.前向右侧传感器                 $    $       $    $  ANS000.BYTE006  $  if(((x>>2)&1))y=@00c2;else y=@00c3;
  $  014.前向左侧传感器                 $    $       $    $  ANS000.BYTE006  $  if(((x>>3)&1))y=@00c2;else y=@00c3;
  $  015.第三排左侧安全带锁扣开关       $    $       $    $  ANS000.BYTE007  $  if(((x>>0)&1))y=@00c2;else y=@00c3;
  $  016.第三排右侧安全带锁扣开关       $    $       $    $  ANS000.BYTE007  $  if(((x>>1)&1))y=@00c2;else y=@00c3;
  $  017.第二排左侧安全带锁扣开关       $    $       $    $  ANS000.BYTE007  $  if(((x>>2)&1))y=@00c2;else y=@00c3;
  $  018.第二排中间安全带锁扣开关       $    $       $    $  ANS000.BYTE007  $  if(((x>>3)&1))y=@00c2;else y=@00c3;
  $  019.第二排右侧安全带锁扣           $    $       $    $  ANS000.BYTE007  $  if(((x>>4)&1))y=@00c2;else y=@00c3;
  $  020.副驾驶员安全带锁扣开关         $    $       $    $  ANS000.BYTE007  $  if(((x>>5)&1))y=@00c2;else y=@00c3;
  $  021.驾驶员安全带锁扣开关           $    $       $    $  ANS000.BYTE007  $  if(((x>>6)&1))y=@00c2;else y=@00c3;
  $  022.碰撞信号硬线输出               $    $       $    $  ANS000.BYTE008  $  if(((x>>0)&1))y=@00c2;else y=@00c3;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7D1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
