
    车型ID：73fc

    模拟：协议模拟-->73fc

;******************************************************************************************************************************************************

    通讯线: $~03$~08$~500k$~70A

进入命令:

  $~  REQ000:702 02 10 01 00 00 00 00 00       $~  ANS000:70A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:702 02 3E 00 00 00 00 00 00       $!  ANS000:70A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:702 03 19 02 09 00 00 00 00       $#  ANS000:70A 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/19000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:702 04 14 FF FF FF 00 00 00       $$  ANS000:70A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:702 03 22 F1 79 00 00 00 00       $%  ANS000:70A 03 22 F1 79 00 00 00 00
  $%  REQ001:702 03 22 F1 7F 00 00 00 00       $%  ANS001:70A 03 22 F1 7F 00 00 00 00
  $%  REQ002:702 03 22 F1 89 00 00 00 00       $%  ANS002:70A 03 22 F1 89 00 00 00 00
  $%  REQ003:702 03 22 F1 8A 00 00 00 00       $%  ANS003:70A 03 22 F1 8A 00 00 00 00
  $%  REQ004:702 03 22 F1 8C 00 00 00 00       $%  ANS004:70A 03 22 F1 8C 00 00 00 00
  $%  REQ005:702 03 22 F1 90 00 00 00 00       $%  ANS005:70A 03 22 F1 90 00 00 00 00
  $%  REQ006:702 03 22 F1 91 00 00 00 00       $%  ANS006:70A 03 22 F1 91 00 00 00 00
  $%  REQ007:702 03 22 F1 97 00 00 00 00       $%  ANS007:70A 03 22 F1 97 00 00 00 00
  $%  REQ008:702 03 22 F1 99 00 00 00 00       $%  ANS008:70A 03 22 F1 99 00 00 00 00
  $%  REQ009:702 03 22 F1 A1 00 00 00 00       $%  ANS009:70A 03 22 F1 A1 00 00 00 00

  $%  000:硬件版本(OEM):        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  001:软件校验码:           $%    $%  ANS001.BYTE004  $%  HEX(x1,x2);
  $%  002:软件版本(OEM):        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([V%X.%X.%02X],(x1>>4),(x1&0x0F),x2);
  $%  003:供应商代码:           $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:生产序列号:           $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:VIN码:                $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  006:零部件号:             $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  007:系统名称:             $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2);
  $%  008:软件发布日期:         $%    $%  ANS008.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  009:维修店编码:           $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5);
  $%  010:维修时间:             $%    $%  ANS009.BYTE009  $%  HEX(x1,x2,x3,x4);
  $%  011:维修时的总里程:       $%    $%  ANS009.BYTE013  $%  y=(x1<<16)+(x2<<8)+x3;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:702 03 22 FE 1E 00 00 00 00       $  ANS000:70A 03 22 FE 1E 00 00 00 00
  $  REQ001:702 03 22 FE 14 00 00 00 00       $  ANS001:70A 03 22 FE 14 00 00 00 00
  $  REQ002:702 03 22 FE 15 00 00 00 00       $  ANS002:70A 03 22 FE 15 00 00 00 00
  $  REQ003:702 03 22 FE 0F 00 00 00 00       $  ANS003:70A 03 22 FE 0F 00 00 00 00
  $  REQ004:702 03 22 FE 16 00 00 00 00       $  ANS004:70A 03 22 FE 16 00 00 00 00
  $  REQ005:702 03 22 FE 1B 00 00 00 00       $  ANS005:70A 03 22 FE 1B 00 00 00 00
  $  REQ006:702 03 22 FE 1C 00 00 00 00       $  ANS006:70A 03 22 FE 1C 00 00 00 00
  $  REQ007:702 03 22 FE 1D 00 00 00 00       $  ANS007:70A 03 22 FE 1D 00 00 00 00
  $  REQ008:702 03 22 FE 1F 00 00 00 00       $  ANS008:70A 03 22 FE 1F 00 00 00 00
  $  REQ009:702 03 22 FE 20 00 00 00 00       $  ANS009:70A 03 22 FE 20 00 00 00 00

  $  000.当前存储的智能钥匙数                    $    $        $    $  ANS000.BYTE004  $  y=x;
  $  001.智能钥匙认证结果                        $    $        $    $  ANS001.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03ef;else if(x==0x02)y=@03f0;else if(x==0x03)y=@03f1;
  $  002.EMS(发动机管理系统)认证结果             $    $        $    $  ANS002.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@02ea;else if(x==0x02)y=@0385;
  $  003.ESCL(电子转向柱锁)反馈1                 $    $        $    $  ANS003.BYTE004  $  if(((x>>0)&1))y=@0000;else y=@0001;
  $  004.ESCL(电子转向柱锁)反馈2                 $    $        $    $  ANS003.BYTE004  $  if(((x>>1)&1))y=@0000;else y=@0001;
  $  005.ESCL(电子转向柱锁)认证结果              $    $        $    $  ANS004.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@02ea;else if(x==0x02)y=@0385;
  $  006.PEPS(智能进入控制器)电源电压数值        $    $  V     $    $  ANS005.BYTE004  $  y=x/10;
  $  007.最新的启动类型                          $    $        $    $  ANS006.BYTE004  $  if(x==0x00)y=@03d9;else if(x==0x01)y=@03e4;else if(x==0x02)y=@03e5;
  $  008.最新的RKE(遥控无钥匙进入)功能类型       $    $        $    $  ANS007.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03da;else if(x==0x02)y=@0068;else if(x==0x03)y=@03db;else if(x==0x04)y=@03dc;else if(x==0x05)y=@03dd;else if(x==0x06)y=@03e1;else if(x==0x07)y=@03e2;
  $  009.最新收到的智能钥匙命令                  $    $        $    $  ANS008.BYTE004  $  if(x==0x00)y=@03d9;else if(x==0x01)y=@03da;else if(x==0x02)y=@0068;else if(x==0x03)y=@03db;else if(x==0x04)y=@03dc;else if(x==0x05)y=@03dd;else if(x==0x06)y=@03de;else if(x==0x07)y=@03df;else if(x==0x08)y=@03e0;else if(x==0x09)y=@03e1;else if(x==0x0A)y=@03e2;
  $  010.最新收到的智能钥匙信息                  $    $        $    $  ANS009.BYTE004  $  y=(x1<<24)+(x2<<16)+(x3<<8)+x4;

  $)  01.其他参数
  $  01.其他参数
  $  REQ000:702 03 22 FE 01 00 00 00 00       $  ANS000:70A 03 22 FE 01 00 00 00 00
  $  REQ001:702 03 22 FE 02 00 00 00 00       $  ANS001:70A 03 22 FE 02 00 00 00 00
  $  REQ002:702 03 22 FE 03 00 00 00 00       $  ANS002:70A 03 22 FE 03 00 00 00 00
  $  REQ003:702 03 22 FE 09 00 00 00 00       $  ANS003:70A 03 22 FE 09 00 00 00 00
  $  REQ004:702 03 22 FE 23 00 00 00 00       $  ANS004:70A 03 22 FE 23 00 00 00 00
  $  REQ005:702 03 22 FE 24 00 00 00 00       $  ANS005:70A 03 22 FE 24 00 00 00 00
  $  REQ006:702 03 22 FE 25 00 00 00 00       $  ANS006:70A 03 22 FE 25 00 00 00 00
  $  REQ007:702 03 22 FE 0E 00 00 00 00       $  ANS007:70A 03 22 FE 0E 00 00 00 00
  $  REQ008:702 03 22 FE 21 00 00 00 00       $  ANS008:70A 03 22 FE 21 00 00 00 00
  $  REQ009:702 03 22 FE 04 00 00 00 00       $  ANS009:70A 03 22 FE 04 00 00 00 00
  $  REQ010:702 03 22 FE 06 00 00 00 00       $  ANS010:70A 03 22 FE 06 00 00 00 00
  $  REQ011:702 03 22 FE 07 00 00 00 00       $  ANS011:70A 03 22 FE 07 00 00 00 00
  $  REQ012:702 03 22 FE 08 00 00 00 00       $  ANS012:70A 03 22 FE 08 00 00 00 00
  $  REQ013:702 03 22 FE 0A 00 00 00 00       $  ANS013:70A 03 22 FE 0A 00 00 00 00
  $  REQ014:702 03 22 FE 0B 00 00 00 00       $  ANS014:70A 03 22 FE 0B 00 00 00 00
  $  REQ015:702 03 22 FE 0D 00 00 00 00       $  ANS015:70A 03 22 FE 0D 00 00 00 00
  $  REQ016:702 03 22 FE 10 00 00 00 00       $  ANS016:70A 03 22 FE 10 00 00 00 00
  $  REQ017:702 03 22 FE 11 00 00 00 00       $  ANS017:70A 03 22 FE 11 00 00 00 00
  $  REQ018:702 03 22 FE 12 00 00 00 00       $  ANS018:70A 03 22 FE 12 00 00 00 00
  $  REQ019:702 03 22 FE 13 00 00 00 00       $  ANS019:70A 03 22 FE 13 00 00 00 00

  $  000.PEPS(智能进入控制器)系统电源模式         $    $       $    $  ANS000.BYTE004  $  if(x==0)y=@004b;else if(x==1)y=@0020;elseif(x==2)y=@004c;else y=@002d;
  $  001.备份电源管理系统(BPM)电源模式            $    $       $    $  ANS001.BYTE004  $  if(x==0)y=@004b;else if(x==1)y=@0020;elseif(x==2)y=@004c;else y=@002d;
  $  002.当前系统电源管理模式                     $    $       $    $  ANS002.BYTE004  $  if(x==0)y=@03d6;else if(x==1)y=@03d7;else if(x==2)y=@03d7;else y=@03d8;
  $  003.智能钥匙电池电压状态                     $    $       $    $  ANS003.BYTE004  $  if(((x>>0)&1))y=@0338;else y=@03d5;
  $  004.伴我回家信号输出状态                     $    $       $    $  ANS004.BYTE004  $  if(((x>>0)&1))y=@03ed;else y=@03ee;
  $  005.备份电源伴我回家输入状态                 $    $       $    $  ANS005.BYTE004  $  if(x==0x00)y=@03e9;else if(x==0x01)y=@03ea;else if(x==0x02)y=@03eb;else if(x==0x03)y=@03ec;
  $  006.当前诊断模式                             $    $       $    $  ANS006.BYTE004  $  if(x==0x00)y=@0107;else if(x==0x01)y=@02a4;else if(x==0x02)y=@03e6;else if(x==0x03)y=@03e7;else if(x==0x04)y=@03e8;
  $  007.ACC继电器反馈状态                        $    $       $    $  ANS007.BYTE004  $  if(((x>>0)&1))y=@0000;else y=@0001;
  $  008.IGN1继电器反馈状态                       $    $       $    $  ANS007.BYTE004  $  if(((x>>1)&1))y=@0000;else y=@0001;
  $  009.IGN2继电器反馈状态                       $    $       $    $  ANS007.BYTE004  $  if(((x>>2)&1))y=@0000;else y=@0001;
  $  010.ACC继电器驱动                            $    $       $    $  ANS008.BYTE004  $  if(((x>>0)&1))y=@003a;else y=@0045;
  $  011.IGN1继电器                               $    $       $    $  ANS008.BYTE005  $  if(((x>>1)&1))y=@003a;else y=@0045;
  $  012.IGN2继电器                               $    $       $    $  ANS008.BYTE005  $  if(((x>>2)&1))y=@003a;else y=@0045;
  $  013.PEPS(智能进入控制器) 启/停开关状态       $    $       $    $  ANS009.BYTE004  $  if(((x>>0)&1))y=@0000;else y=@0001;
  $  014.PEPS(智能进入控制器) 黄灯 状态           $    $       $    $  ANS009.BYTE004  $  if(((x>>2)&1))y=@0000;else y=@0001;
  $  015.PEPS(智能进入控制器) 背光灯状态          $    $       $    $  ANS009.BYTE004  $  if(((x>>3)&1))y=@0000;else y=@0001;
  $  016.驾驶员侧门锁状态                         $    $       $    $  ANS010.BYTE004  $  if(((x>>0)&1))y=@0069;else y=@0068;
  $  017.行李箱开关1状态                          $    $       $    $  ANS011.BYTE004  $  if(((x>>0)&1))y=@004c;else y=@004b;
  $  018.行李箱开关2状态                          $    $       $    $  ANS011.BYTE004  $  if(((x>>1)&1))y=@004c;else y=@004b;
  $  019.左前门开关状态                           $    $       $    $  ANS011.BYTE004  $  if(((x>>2)&1))y=@004c;else y=@004b;
  $  020.右前门开关状态                           $    $       $    $  ANS011.BYTE004  $  if(((x>>3)&1))y=@004c;else y=@004b;
  $  021.右后门开关状态                           $    $       $    $  ANS011.BYTE004  $  if(((x>>4)&1))y=@004c;else y=@004b;
  $  022.左后门开关状态                           $    $       $    $  ANS011.BYTE004  $  if(((x>>5)&1))y=@004c;else y=@004b;
  $  023.右前门请求开关状态                       $    $       $    $  ANS012.BYTE004  $  if(((x>>0)&1))y=@0000;else y=@0001;
  $  024.左前门请求开关状态                       $    $       $    $  ANS012.BYTE004  $  if(((x>>1)&1))y=@0000;else y=@0001;
  $  025.行李箱请求开关状态                       $    $       $    $  ANS012.BYTE004  $  if(((x>>2)&1))y=@0000;else y=@0001;
  $  026.离合踏板深踩开关1状态                    $    $       $    $  ANS013.BYTE004  $  if(((x>>0)&1))y=@0000;else y=@0001;
  $  027.离合踏板深踩开关2状态                    $    $       $    $  ANS013.BYTE004  $  if(((x>>1)&1))y=@0000;else y=@0001;
  $  028.刹车开关1状态                            $    $       $    $  ANS014.BYTE004  $  if(((x>>0)&1))y=@0000;else y=@0001;
  $  029.刹车开关2状态                            $    $       $    $  ANS014.BYTE004  $  if(((x>>1)&1))y=@0000;else y=@0001;
  $  030.P档位置开关状态                          $    $       $    $  ANS015.BYTE004  $  if(((x>>0)&1))y=@0000;else y=@0001;
  $  031.机舱蜂鸣器驱动类型                       $    $       $    $  ANS016.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03f2;else if(x==0x02)y=@03f3;else if(x==0x03)y=@03f4;else if(x==0x04)y=@03f5;else if(x==0x05)y=@03f6;else if(x==0x06)y=@03f7;else if(x==0x07)y=@03f8;else if(x==0x08)y=@03f9;else if(x==0x09)y=@03fa;else if(x==0x0A)y=@03fb;else if(x==0x0B)y=@03fc;else y=@03fd;
  $  032.最新的车门解锁驱动类型                   $    $       $    $  ANS017.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@0408;else if(x==0x02)y=@0400;else if(x==0x03)y=@0409;else if(x==0x04)y=@040a;else if(x==0x05)y=@040b;else if(x==0x06)y=@040c;else if(x==0x07)y=@040d;else if(x==0x08)y=@040e;
  $  033.最新的车门闭锁驱动类型                   $    $       $    $  ANS018.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@0402;else if(x==0x02)y=@0403;else if(x==0x03)y=@0404;else if(x==0x04)y=@0405;else if(x==0x05)y=@0406;else if(x==0x06)y=@0407;
  $  034.最新的行李箱解锁驱动类型                 $    $       $    $  ANS019.BYTE004  $  if(x==0x00)y=@03e3;else if(x==0x01)y=@03fe;else if(x==0x02)y=@03ff;else if(x==0x03)y=@0400;else if(x==0x04)y=@0401;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:702 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
