
    车型ID：5005

    模拟：协议模拟-->5005

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:712 02 10 03 00 00 00 00 00       $~  ANS000:702 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:712 02 3E 00 00 00 00 00 00       $!  ANS000:702 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:712 03 19 02 09 00 00 00 00       $#  ANS000:702 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/25000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:712 04 14 FF FF FF 00 00 00       $$  ANS000:702 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:712 03 22 F1 87 00 00 00 00       $%  ANS000:702 03 22 F1 87 00 00 00 00
  $%  REQ001:712 03 22 F1 8A 00 00 00 00       $%  ANS001:702 03 22 F1 8A 00 00 00 00
  $%  REQ002:712 03 22 F1 90 00 00 00 00       $%  ANS002:702 03 22 F1 90 00 00 00 00
  $%  REQ003:712 03 22 F1 92 00 00 00 00       $%  ANS003:702 03 22 F1 92 00 00 00 00
  $%  REQ004:712 03 22 F1 93 00 00 00 00       $%  ANS004:702 03 22 F1 93 00 00 00 00
  $%  REQ005:712 03 22 F1 94 00 00 00 00       $%  ANS005:702 03 22 F1 94 00 00 00 00
  $%  REQ006:712 03 22 F1 95 00 00 00 00       $%  ANS006:702 03 22 F1 95 00 00 00 00
  $%  REQ007:712 03 22 F1 99 00 00 00 00       $%  ANS007:702 03 22 F1 99 00 00 00 00
  $%  REQ008:712 03 22 F1 9B 00 00 00 00       $%  ANS008:702 03 22 F1 9B 00 00 00 00
  $%  REQ009:712 03 22 F1 9D 00 00 00 00       $%  ANS009:702 03 22 F1 9D 00 00 00 00

  $%  000:零部件号:             $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  001:系统供应商标识:       $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:VIN码:                $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  003:ECU硬件号:            $%    $%  ANS003.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  004:ECU硬件版本号:        $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2);
  $%  005:ECU软件号:            $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  006:ECU软件版本号:        $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2);
  $%  007:ECU重编程日期:        $%    $%  ANS007.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  008:标定日期信息:         $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU生产日期:          $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.系统速度和状态信息
  $  00.系统速度和状态信息
  $  REQ000:712 03 22 30 07 00 00 00 00       $  ANS000:702 03 22 30 07 00 00 00 00

  $  000.左前车轮轮速                      $    $  km/h     $    $  ANS000.BYTE004  $  y=x1*2+x2*2/256;
  $  001.右前车轮轮速                      $    $  km/h     $    $  ANS000.BYTE006  $  y=x1*2+x2*2/256;
  $  002.左后车轮轮速                      $    $  km/h     $    $  ANS000.BYTE008  $  y=x1*2+x2*2/256;
  $  003.右后车轮轮速                      $    $  km/h     $    $  ANS000.BYTE010  $  y=x1*2+x2*2/256;
  $  004.汽车速度                          $    $  km/h     $    $  ANS000.BYTE012  $  y=x1*4+x2*4/256;
  $  005.起伏路参数                        $    $  G        $    $  ANS000.BYTE014  $  y=x1*0.00392;
  $  006.左前轮速传感器用电状态            $    $           $    $  ANS000.BYTE015  $  if(x1&0x80) y=@0042;else y=@0013;
  $  007.右前轮速传感器用电状态            $    $           $    $  ANS000.BYTE015  $  if(x1&0x40) y=@0042;else y=@0013;
  $  008.左后轮速传感器用电状态            $    $           $    $  ANS000.BYTE015  $  if(x1&0x20) y=@0042;else y=@0013;
  $  009.右后轮速传感器用电状态            $    $           $    $  ANS000.BYTE015  $  if(x1&0x10) y=@0042;else y=@0013;
  $  010.四轮驱动开关状态                  $    $           $    $  ANS000.BYTE015  $  if(x1&0x04) y=@0043;else y=@0044;
  $  011.ABS(防抱死刹车系统)有效状态       $    $           $    $  ANS000.BYTE015  $  if(x1&0x02) y=@0043;else y=@0044;
  $  012.ABS(防抱死刹车系统)制动开关       $    $           $    $  ANS000.BYTE015  $  if(x1&0x01) y=@0043;else y=@0044;
  $  013.系统电压                          $    $  V        $    $  ANS000.BYTE016  $  y=x1*256/1024+x2*1/1024;
  $  014.电瓶电压                          $    $  V        $    $  ANS000.BYTE018  $  y=x1*256/1024+x2*1/1024;

  $)  01.电源,电机和电磁信息
  $  01.电源,电机和电磁信息
  $  REQ000:712 03 22 30 08 00 00 00 00       $  ANS000:702 03 22 30 08 00 00 00 00

  $  000.泵电机电流                                $    $  Amps         $    $  ANS000.BYTE004  $  y=x1*256/64+x2/64;
  $  001.电瓶电压                                  $    $  V            $    $  ANS000.BYTE008  $  y=x1*256/1024+x2*1/1024;
  $  002.泵电压反馈值                              $    $  V            $    $  ANS000.BYTE010  $  y=x1*256/1024+x2*1/1024;
  $  003.系统电压                                  $    $  V            $    $  ANS000.BYTE012  $  y=x1*256/1024+x2*1/1024;
  $  004.马达温度                                  $    $  degree C     $    $  ANS000.BYTE014  $  y=x1*256+x2*1-37;
  $  005.右后释放ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x80) y=@0000;else y=@0001;
  $  006.右后保持ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x40) y=@0000;else y=@0001;
  $  007.左后释放ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x20) y=@0000;else y=@0001;
  $  008.左后保持ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x10) y=@0000;else y=@0001;
  $  009.右前释放ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x08) y=@0000;else y=@0001;
  $  010.右前保持ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x04) y=@0000;else y=@0001;
  $  011.左前释放ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x02) y=@0000;else y=@0001;
  $  012.左前保持ABS(防抱死刹车系统)电磁激活       $    $               $    $  ANS000.BYTE016  $  if(x1&0x01) y=@0000;else y=@0001;
  $  013.泵命令允许                                $    $               $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0000;else y=@0001;

  $)  02.ECU MCU(电机控制单元)当前和历史故障信息
  $  02.ECU MCU(电机控制单元)当前和历史故障信息
  $  REQ000:712 03 22 30 09 00 00 00 00       $  ANS000:702 03 22 30 09 00 00 00 00

  $  000.DBCM当前MCU(电机控制单元)故障来自电源1       $    $       $    $  ANS000.BYTE004  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  001.DBCM当前MCU(电机控制单元)故障来自电源2       $    $       $    $  ANS000.BYTE005  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  002.DBCM当前MCU(电机控制单元)故障来自电源3       $    $       $    $  ANS000.BYTE006  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  003.DBCM当前MCU(电机控制单元)故障来自电源4       $    $       $    $  ANS000.BYTE007  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  004.DBCM当前MCU(电机控制单元)故障来自电源5       $    $       $    $  ANS000.BYTE008  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  005.DBCM当前MCU(电机控制单元)故障来自电源6       $    $       $    $  ANS000.BYTE009  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  006.DBCM当前ECU故障来自电源1                     $    $       $    $  ANS000.BYTE013  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  007.DBCM当前ECU故障来自电源2                     $    $       $    $  ANS000.BYTE014  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  008.DBCM当前ECU故障来自电源3                     $    $       $    $  ANS000.BYTE015  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  009.DBCM历史MCU(电机控制单元)故障1               $    $       $    $  ANS000.BYTE020  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  010.DBCM历史MCU(电机控制单元)故障2               $    $       $    $  ANS000.BYTE021  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  011.DBCM历史MCU(电机控制单元)故障3               $    $       $    $  ANS000.BYTE022  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  012.DBCM历史MCU(电机控制单元)故障4               $    $       $    $  ANS000.BYTE023  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  013.DBCM历史MCU(电机控制单元)故障5               $    $       $    $  ANS000.BYTE024  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  014.DBCM历史MCU(电机控制单元)故障6               $    $       $    $  ANS000.BYTE025  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  015.DBCM历史ECU故障1                             $    $       $    $  ANS000.BYTE029  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  016.DBCM历史ECU故障2                             $    $       $    $  ANS000.BYTE030  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;
  $  017.DBCM历史ECU故障3                             $    $       $    $  ANS000.BYTE031  $  switxh(x1%0xFF)0x01: y=@0045;default: y=@003f;

  $)  03.最近的故障诊断信息
  $  03.最近的故障诊断信息
  $  REQ000:712 03 22 30 0A 00 00 00 00       $  ANS000:702 03 22 30 0A 00 00 00 00

  $  000.当故障发生时的DRP(电子比例阀)动作                   $    $            $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0058;else y=@0059;
  $  001.当故障发生时的CBD动作                               $    $            $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0058;else y=@0059;
  $  002.当故障发生时的前ABS(防抱死刹车系统)动作             $    $            $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0058;else y=@0059;
  $  003.当故障发生时的后ABS(防抱死刹车系统)动作             $    $            $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0058;else y=@0059;
  $  004.当故障发生时的刹车开关动作                          $    $            $    $  ANS000.BYTE007  $  if(x1&0x04) y=@0058;else y=@0059;
  $  005.当故障发生时的发动机运行动作                        $    $            $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0058;else y=@0059;
  $  006.当故障发生时的ABS(防抱死刹车系统)道路坎坷动作       $    $            $    $  ANS000.BYTE008  $  if(x1&0x10) y=@0058;else y=@0059;
  $  007.当故障发生时的汽车速度                              $    $  km/h      $    $  ANS000.BYTE009  $  y=x1*1;
  $  008.当故障发生时的汽车加速度                            $    $  g         $    $  ANS000.BYTE010  $  y=x1*1/64;
  $  009.当故障发生时的缸点火周期                            $    $  count     $    $  ANS000.BYTE011  $  y=x1*1;
  $  010.当故障第一次发生时的缸点火周期                      $    $  count     $    $  ANS000.BYTE012  $  y=x1*1;
  $  011.过去发生的故障代码数                                $    $  count     $    $  ANS000.BYTE013  $  y=x1*1;
  $  012.当故障发生时的左前轮速                              $    $  km/h      $    $  ANS000.BYTE014  $  y=x1*1;
  $  013.当故障发生时的右前轮速                              $    $  km/h      $    $  ANS000.BYTE015  $  y=x1*1;
  $  014.当故障发生时的左后轮速                              $    $  km/h      $    $  ANS000.BYTE016  $  y=x1*1;
  $  015.当故障发生时的右后轮速                              $    $  km/h      $    $  ANS000.BYTE017  $  y=x1*1;
  $  016.当故障发生时的驾驶时间                              $    $  秒        $    $  ANS000.BYTE018  $  y=x1*256+x2*1;

  $)  04.第二个故障诊断信息
  $  04.第二个故障诊断信息
  $  REQ000:712 03 22 30 0B 00 00 00 00       $  ANS000:702 03 22 30 0B 00 00 00 00

  $  000.当故障发生时的TCS(牵引力控制系统)动作                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x80) y=@0058;else y=@0059;
  $  001.当故障发生时的DRP(电子比例阀)动作                                 $    $            $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0058;else y=@0059;
  $  002.当故障发生时的CBD动作                                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0058;else y=@0059;
  $  003.当故障发生时的前ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0058;else y=@0059;
  $  004.当故障发生时的后ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0058;else y=@0059;
  $  005.当故障发生时的前刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x04) y=@0058;else y=@0059;
  $  006.当故障发生时的后刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x02) y=@0058;else y=@0059;
  $  007.当故障发生时的发动机运行动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0058;else y=@0059;
  $  008.当故障发生时的ABS(防抱死刹车系统)道路坎坷动作                     $    $            $    $  ANS000.BYTE008  $  if(x1&0x10) y=@0058;else y=@0059;
  $  009.当故障发生时的驾驶角度中心动作                                    $    $            $    $  ANS000.BYTE008  $  if(x1&0x08) y=@0058;else y=@0059;
  $  010.当故障发生时的VSE允许                                             $    $            $    $  ANS000.BYTE008  $  if(x1&0x04) y=@0058;else y=@0059;
  $  011.当故障发生时的TCS(牵引力控制系统)/ETS(电子循迹辅助系统)允许       $    $            $    $  ANS000.BYTE008  $  if(x1&0x02) y=@0058;else y=@0059;
  $  012.当故障发生时的汽车速度                                            $    $  km/h      $    $  ANS000.BYTE009  $  y=x1*1;
  $  013.当故障发生时的汽车加速度                                          $    $  g         $    $  ANS000.BYTE010  $  y=x1*1/64;
  $  014.当故障发生时的缸点火周期                                          $    $  count     $    $  ANS000.BYTE011  $  y=x1*1/64;
  $  015.当故障第二次发生时的缸点火周期                                    $    $  count     $    $  ANS000.BYTE012  $  y=x1*1;
  $  016.过去发生的故障代码数                                              $    $  count     $    $  ANS000.BYTE013  $  y=x1*1;
  $  017.当故障发生时的左前轮速                                            $    $  km/h      $    $  ANS000.BYTE014  $  y=x1*1;
  $  018.当故障发生时的右前轮速                                            $    $  km/h      $    $  ANS000.BYTE015  $  y=x1*1;
  $  019.当故障发生时的左后轮速                                            $    $  km/h      $    $  ANS000.BYTE016  $  y=x1*1;
  $  020.当故障发生时的右后轮速                                            $    $  km/h      $    $  ANS000.BYTE017  $  y=x1*1;
  $  021.当故障发生时的驾驶时间                                            $    $  秒        $    $  ANS000.BYTE018  $  y=x1*256+x2*1;

  $)  05.第三个故障诊断信息
  $  05.第三个故障诊断信息
  $  REQ000:712 03 22 30 0C 00 00 00 00       $  ANS000:702 03 22 30 0C 00 00 00 00

  $  000.当故障发生时的TCS(牵引力控制系统)动作                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x80) y=@0058;else y=@0059;
  $  001.当故障发生时的DRP(电子比例阀)动作                                 $    $            $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0058;else y=@0059;
  $  002.当故障发生时的CBD动作                                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0058;else y=@0059;
  $  003.当故障发生时的前ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0058;else y=@0059;
  $  004.当故障发生时的后ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0058;else y=@0059;
  $  005.当故障发生时的前刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x04) y=@0058;else y=@0059;
  $  006.当故障发生时的后刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x02) y=@0058;else y=@0059;
  $  007.当故障发生时的发动机运行动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0058;else y=@0059;
  $  008.当故障发生时的ABS(防抱死刹车系统)道路坎坷动作                     $    $            $    $  ANS000.BYTE008  $  if(x1&0x10) y=@0058;else y=@0059;
  $  009.当故障发生时的驾驶角度中心动作                                    $    $            $    $  ANS000.BYTE008  $  if(x1&0x08) y=@0058;else y=@0059;
  $  010.当故障发生时的VSE允许                                             $    $            $    $  ANS000.BYTE008  $  if(x1&0x04) y=@0058;else y=@0059;
  $  011.当故障发生时的TCS(牵引力控制系统)/ETS(电子循迹辅助系统)允许       $    $            $    $  ANS000.BYTE008  $  if(x1&0x02) y=@0058;else y=@0059;
  $  012.当故障发生时的汽车速度                                            $    $  km/h      $    $  ANS000.BYTE009  $  y=x1*1;
  $  013.当故障发生时的汽车加速度                                          $    $  g         $    $  ANS000.BYTE010  $  y=x1*1/64;
  $  014.当故障发生时的缸点火周期                                          $    $  count     $    $  ANS000.BYTE011  $  y=x1*1/64;
  $  015.当故障第二次发生时的缸点火周期                                    $    $  count     $    $  ANS000.BYTE012  $  y=x1*1;
  $  016.过去发生的故障代码数                                              $    $  count     $    $  ANS000.BYTE013  $  y=x1*1;
  $  017.当故障发生时的左前轮速                                            $    $  km/h      $    $  ANS000.BYTE014  $  y=x1*1;
  $  018.当故障发生时的右前轮速                                            $    $  km/h      $    $  ANS000.BYTE015  $  y=x1*1;
  $  019.当故障发生时的左后轮速                                            $    $  km/h      $    $  ANS000.BYTE016  $  y=x1*1;
  $  020.当故障发生时的右后轮速                                            $    $  km/h      $    $  ANS000.BYTE017  $  y=x1*1;
  $  021.当故障发生时的驾驶时间                                            $    $  秒        $    $  ANS000.BYTE018  $  y=x1*256+x2*1;

  $)  06.第四个故障诊断信息
  $  06.第四个故障诊断信息
  $  REQ000:712 03 22 30 17 00 00 00 00       $  ANS000:702 03 22 30 17 00 00 00 00

  $  000.当故障发生时的TCS(牵引力控制系统)动作                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x80) y=@0058;else y=@0059;
  $  001.当故障发生时的DRP(电子比例阀)动作                                 $    $            $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0058;else y=@0059;
  $  002.当故障发生时的CBD动作                                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0058;else y=@0059;
  $  003.当故障发生时的前ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0058;else y=@0059;
  $  004.当故障发生时的后ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0058;else y=@0059;
  $  005.当故障发生时的前刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x04) y=@0058;else y=@0059;
  $  006.当故障发生时的后刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x02) y=@0058;else y=@0059;
  $  007.当故障发生时的发动机运行动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0058;else y=@0059;
  $  008.当故障发生时的ABS(防抱死刹车系统)道路坎坷动作                     $    $            $    $  ANS000.BYTE008  $  if(x1&0x10) y=@0058;else y=@0059;
  $  009.当故障发生时的驾驶角度中心动作                                    $    $            $    $  ANS000.BYTE008  $  if(x1&0x08) y=@0058;else y=@0059;
  $  010.当故障发生时的VSE允许                                             $    $            $    $  ANS000.BYTE008  $  if(x1&0x04) y=@0058;else y=@0059;
  $  011.当故障发生时的TCS(牵引力控制系统)/ETS(电子循迹辅助系统)允许       $    $            $    $  ANS000.BYTE008  $  if(x1&0x02) y=@0058;else y=@0059;
  $  012.当故障发生时的汽车速度                                            $    $  km/h      $    $  ANS000.BYTE009  $  y=x1*1;
  $  013.当故障发生时的汽车加速度                                          $    $  g         $    $  ANS000.BYTE010  $  y=x1*1/64;
  $  014.当故障发生时的缸点火周期                                          $    $  count     $    $  ANS000.BYTE011  $  y=x1*1/64;
  $  015.当故障第二次发生时的缸点火周期                                    $    $  count     $    $  ANS000.BYTE012  $  y=x1*1;
  $  016.过去发生的故障代码数                                              $    $  count     $    $  ANS000.BYTE013  $  y=x1*1;
  $  017.当故障发生时的左前轮速                                            $    $  km/h      $    $  ANS000.BYTE014  $  y=x1*1;
  $  018.当故障发生时的右前轮速                                            $    $  km/h      $    $  ANS000.BYTE015  $  y=x1*1;
  $  019.当故障发生时的左后轮速                                            $    $  km/h      $    $  ANS000.BYTE016  $  y=x1*1;
  $  020.当故障发生时的右后轮速                                            $    $  km/h      $    $  ANS000.BYTE017  $  y=x1*1;
  $  021.当故障发生时的驾驶时间                                            $    $  秒        $    $  ANS000.BYTE018  $  y=x1*256+x2*1;

  $)  07.第五个故障诊断信息
  $  07.第五个故障诊断信息
  $  REQ000:712 03 22 30 18 00 00 00 00       $  ANS000:702 03 22 30 18 00 00 00 00

  $  000.当故障发生时的TCS(牵引力控制系统)动作                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x80) y=@0058;else y=@0059;
  $  001.当故障发生时的DRP(电子比例阀)动作                                 $    $            $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0058;else y=@0059;
  $  002.当故障发生时的CBD动作                                             $    $            $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0058;else y=@0059;
  $  003.当故障发生时的前ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0058;else y=@0059;
  $  004.当故障发生时的后ABS(防抱死刹车系统)动作                           $    $            $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0058;else y=@0059;
  $  005.当故障发生时的前刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x04) y=@0058;else y=@0059;
  $  006.当故障发生时的后刹车开关动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x02) y=@0058;else y=@0059;
  $  007.当故障发生时的发动机运行动作                                      $    $            $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0058;else y=@0059;
  $  008.当故障发生时的ABS(防抱死刹车系统)道路坎坷动作                     $    $            $    $  ANS000.BYTE008  $  if(x1&0x10) y=@0058;else y=@0059;
  $  009.当故障发生时的驾驶角度中心动作                                    $    $            $    $  ANS000.BYTE008  $  if(x1&0x08) y=@0058;else y=@0059;
  $  010.当故障发生时的VSE允许                                             $    $            $    $  ANS000.BYTE008  $  if(x1&0x04) y=@0058;else y=@0059;
  $  011.当故障发生时的TCS(牵引力控制系统)/ETS(电子循迹辅助系统)允许       $    $            $    $  ANS000.BYTE008  $  if(x1&0x02) y=@0058;else y=@0059;
  $  012.当故障发生时的汽车速度                                            $    $  km/h      $    $  ANS000.BYTE009  $  y=x1*1;
  $  013.当故障发生时的汽车加速度                                          $    $  g         $    $  ANS000.BYTE010  $  y=x1*1/64;
  $  014.当故障发生时的缸点火周期                                          $    $  count     $    $  ANS000.BYTE011  $  y=x1*1/64;
  $  015.当故障第二次发生时的缸点火周期                                    $    $  count     $    $  ANS000.BYTE012  $  y=x1*1;
  $  016.过去发生的故障代码数                                              $    $  count     $    $  ANS000.BYTE013  $  y=x1*1;
  $  017.当故障发生时的左前轮速                                            $    $  km/h      $    $  ANS000.BYTE014  $  y=x1*1;
  $  018.当故障发生时的右前轮速                                            $    $  km/h      $    $  ANS000.BYTE015  $  y=x1*1;
  $  019.当故障发生时的左后轮速                                            $    $  km/h      $    $  ANS000.BYTE016  $  y=x1*1;
  $  020.当故障发生时的右后轮速                                            $    $  km/h      $    $  ANS000.BYTE017  $  y=x1*1;
  $  021.当故障发生时的驾驶时间                                            $    $  秒        $    $  ANS000.BYTE018  $  y=x1*256+x2*1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:712 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
