
    车型ID：5700

    模拟：协议模拟-->5700

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 00 00 9E       $#  ANS000:84 11 F1 18 00 00 00 9E

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/3a000000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 00 00 99       $$  ANS000:83 11 F1 14 00 00 99

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 90 2E       $%  ANS000:82 11 F1 1A 90 2E
  $%  REQ001:82 11 F1 1A 91 2F       $%  ANS001:82 11 F1 1A 91 2F
  $%  REQ002:82 11 F1 1A 92 30       $%  ANS002:82 11 F1 1A 92 30
  $%  REQ003:82 11 F1 1A 94 32       $%  ANS003:82 11 F1 1A 94 32
  $%  REQ004:82 11 F1 1A 96 34       $%  ANS004:82 11 F1 1A 96 34
  $%  REQ005:82 11 F1 1A 97 35       $%  ANS005:82 11 F1 1A 97 35
  $%  REQ006:82 11 F1 1A 98 36       $%  ANS006:82 11 F1 1A 98 36
  $%  REQ007:82 11 F1 1A 99 37       $%  ANS007:82 11 F1 1A 99 37
  $%  REQ008:82 11 F1 1A 9A 38       $%  ANS008:82 11 F1 1A 9A 38
  $%  REQ009:82 11 F1 1A 9F 3D       $%  ANS009:82 11 F1 1A 9F 3D

  $%  000:汽车标识编码:           $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:零件号码:               $%    $%  ANS001.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:ECU硬件号:              $%    $%  ANS002.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  003:ECU软件号:              $%    $%  ANS003.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:定型编码:               $%    $%  ANS004.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:发动机型号:             $%    $%  ANS005.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  006:维修店代码:             $%    $%  ANS006.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  007:编程日期:               $%    $%  ANS007.BYTE005  $%  y=SPRINTF([20%02x%s%02x%s%02x%s],x1,@0007,x2,@0008,x3,@0009);
  $%  008:ECU诊断数据标识:        $%    $%  ANS008.BYTE005  $%  HEX(x1,x2);
  $%  009:博世零件代码号:         $%    $%  ANS009.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.动态数据流
  $  00.动态数据流
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.DTC故障数                    $    $               $    $  ANS000.BYTE005  $  y=x1;
  $  001.电瓶电压                     $    $  V            $    $  ANS000.BYTE013  $  y=x1*0.1;
  $  002.进气压力                     $    $  kPa          $    $  ANS000.BYTE014  $  y=x1;
  $  003.进气温度                     $    $  degree C     $    $  ANS000.BYTE015  $  y=x1*0.75-40;
  $  004.发动机冷却剂温度             $    $  degree C     $    $  ANS000.BYTE017  $  y=x1*0.75-40;
  $  005.点火提前角                   $    $  度           $    $  ANS000.BYTE018  $  if(x<0x80) y=x*0.7;else y=(x*0.7)-89;
  $  006.爆震AD                       $    $  AD           $    $  ANS000.BYTE020  $  y=x1;
  $  007.空调蒸发器温度               $    $  degree C     $    $  ANS000.BYTE021  $  if(x<0x80) y=x;else y=x-256;
  $  008.点火闭合时间                 $    $  ms           $    $  ANS000.BYTE022  $  y=x1*0.1;
  $  009.踏板开度                     $    $  %            $    $  ANS000.BYTE023  $  y=x1;
  $  010.节气门位置                   $    $  V            $    $  ANS000.BYTE026  $  y=x1*4.99+x2*0.01953;
  $  011.车速                         $    $  km/h         $    $  ANS000.BYTE028  $  y=x1;
  $  012.发动机转速                   $    $  rpm          $    $  ANS000.BYTE029  $  y=x1*256+x2;
  $  013.喷油/喷气脉宽                $    $  ms           $    $  ANS000.BYTE031  $  y=x1*0.0852459;
  $  014.怠速空气控制                 $    $  %            $    $  ANS000.BYTE032  $  y=x1*100/256;
  $  015.VVT(可变气门正时)位置        $    $               $    $  ANS000.BYTE033  $  y=x1;
  $  016.目标怠速                     $    $  rpm          $    $  ANS000.BYTE034  $  y=x1*12.5;
  $  017.前氧传感器                   $    $  mV           $    $  ANS000.BYTE035  $  y=x1*4.41425;
  $  018.后氧传感器                   $    $  mV           $    $  ANS000.BYTE037  $  y=x1*4.41425;
  $  019.空燃比闭环学习值             $    $               $    $  ANS000.BYTE038  $  y=x1;
  $  020.空燃比闭环学习单元序号       $    $               $    $  ANS000.BYTE039  $  y=x1;
  $  021.空燃比                       $    $               $    $  ANS000.BYTE041  $  y=x1*0.1;
  $  022.增压温度                     $    $  kPa          $    $  ANS000.BYTE049  $  y=x1;
  $  023.废气阀开度占空比             $    $  %            $    $  ANS000.BYTE050  $  y=x1;
  $  024.里程数                       $    $  km           $    $  ANS000.BYTE055  $  y=x1*6553.6+x2*25.6+x3*0.1;
  $  025.大气压力                     $    $  kPa          $    $  ANS000.BYTE058  $  y=x1;
  $  026.工作时间                     $    $  S            $    $  ANS000.BYTE059  $  y=x1*256+x2;
  $  027.减压阀水温                   $    $  degree C     $    $  ANS000.BYTE063  $  if(x<0x80) y=x;else y=x-256;
  $  028.增压阀水温                   $    $  degree C     $    $  ANS000.BYTE064  $  if(x<0x80) y=x;else y=x-256;
  $  029.燃气喷射压力                 $    $  kPa          $    $  ANS000.BYTE065  $  y=x1*25.6+x2*0.1;
  $  030.钢瓶压力信号电压             $    $  kPa          $    $  ANS000.BYTE067  $  y=x1/51;

  $)  01.状态数据流
  $  01.状态数据流
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.闭环信号                          $    $       $    $  ANS000.BYTE044  $  if(x1&0x01) y=@0057;else y=@0039;
  $  001.氧信号浓                          $    $       $    $  ANS000.BYTE044  $  if(x1&0x02) y=@0057;else y=@0039;
  $  002.自学习                            $    $       $    $  ANS000.BYTE044  $  if(x1&0x04) y=@0057;else y=@0039;
  $  003.清淹模式                          $    $       $    $  ANS000.BYTE044  $  if(x1&0x08) y=@0057;else y=@0039;
  $  004.功率加浓                          $    $       $    $  ANS000.BYTE044  $  if(x1&0x10) y=@0057;else y=@0039;
  $  005.断油模式                          $    $       $    $  ANS000.BYTE044  $  if(x1&0x20) y=@0057;else y=@0039;
  $  006.燃气模式                          $    $       $    $  ANS000.BYTE045  $  if(x1&0x01) y=@0057;else y=@0039;
  $  007.燃气电磁阀                        $    $       $    $  ANS000.BYTE045  $  if(x1&0x02) y=@0057;else y=@0039;
  $  008.排气制动                          $    $       $    $  ANS000.BYTE045  $  if(x1&0x04) y=@0057;else y=@0039;
  $  009.燃油泵                            $    $       $    $  ANS000.BYTE045  $  if(x1&0x08) y=@0057;else y=@0039;
  $  010.刹车开关                          $    $       $    $  ANS000.BYTE046  $  if(x1&0x01) y=@0057;else y=@0039;
  $  011.离合器开关                        $    $       $    $  ANS000.BYTE046  $  if(x1&0x02) y=@0057;else y=@0039;
  $  012.中压开关                          $    $       $    $  ANS000.BYTE046  $  if(x1&0x04) y=@0057;else y=@0039;
  $  013.空调请求                          $    $       $    $  ANS000.BYTE046  $  if(x1&0x10) y=@0057;else y=@0039;
  $  014.空调继电器                        $    $       $    $  ANS000.BYTE046  $  if(x1&0x40) y=@0057;else y=@0039;
  $  015.风扇1                             $    $       $    $  ANS000.BYTE047  $  if(x1&0x01) y=@0057;else y=@0039;
  $  016.风扇2                             $    $       $    $  ANS000.BYTE047  $  if(x1&0x02) y=@0057;else y=@0039;
  $  017.水温报警                          $    $       $    $  ANS000.BYTE047  $  if(x1&0x08) y=@0057;else y=@0039;
  $  018.故障灯开关                        $    $       $    $  ANS000.BYTE047  $  if(x1&0x20) y=@0057;else y=@0039;
  $  019.车辆立即检修指示灯(SVS)开关       $    $       $    $  ANS000.BYTE047  $  if(x1&0x40) y=@0057;else y=@0039;

;******************************************************************************************************************************************************

