
    车型ID：5701

    模拟：协议模拟-->5701

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 AC F1 81 9F       $~  ANS000:81 AC F1 81 9F

空闲命令:

  $!  REQ000:81 AC F1 3E 5C       $!  ANS000:81 AC F1 3E 5C

退出命令:

  $@  REQ000:81 AC F1 82 A0       $@  ANS000:81 AC F1 82 A0


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 AC F1 18 00 00 00 39       $#  ANS000:84 AC F1 18 00 00 00 39

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/3a010000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 AC F1 14 00 00 34       $$  ANS000:83 AC F1 14 00 00 34

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 AC F1 1A 80 B9       $%  ANS000:82 AC F1 1A 80 B9

  $%  000:ACU(安全气囊系统)序列号:        $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4);
  $%  001:制造信息:                       $%    $%  ANS000.BYTE008  $%  ASCII(x1,x2,x3,x4);
  $%  002:参数版本:                       $%    $%  ANS000.BYTE012  $%  ASCII(x1,x2);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.特定数据
  $  00.特定数据
  $  REQ000:82 AC F1 21 08 48       $  ANS000:82 AC F1 21 08 48
  $  REQ001:82 AC F1 21 D1 11       $  ANS001:82 AC F1 21 D1 11

  $  000.电瓶电压                          $    $  V      $    $  ANS000.BYTE005  $  y=x1*1.1312+0.7;
  $  001.DAB(驾驶员安全气囊)电压储能       $    $  V      $    $  ANS000.BYTE006  $  y=x1*0.1536;
  $  002.PAB(乘客安全气囊)电压储能         $    $  V      $    $  ANS000.BYTE007  $  y=x1*0.1536;
  $  003.DRPT电压储能                      $    $  V      $    $  ANS000.BYTE008  $  y=x1*0.1536;
  $  004.PRPT电压储能                      $    $  V      $    $  ANS000.BYTE009  $  y=x1*0.1536;
  $  005.DAB(驾驶员安全气囊)电阻           $    $  Ω     $    $  ANS000.BYTE016  $  y=x1*10/255;
  $  006.PAB(乘客安全气囊)电阻             $    $  Ω     $    $  ANS000.BYTE017  $  y=x1*10/255;
  $  007.DPT牵拉器电阻                     $    $  Ω     $    $  ANS000.BYTE018  $  y=x1*10/255;
  $  008.PPT牵拉器电阻                     $    $  Ω     $    $  ANS000.BYTE019  $  y=x1*10/255;
  $  009.驾驶员锁扣开关状态                $    $         $    $  ANS000.BYTE026  $  switxh(x1&0x03) 0x00: y=@0535;0x01: y=@0536;0x02: y=@00fd;0x03: y=@0537;default: y=@003f;
  $  010.乘员锁扣开关状态                  $    $         $    $  ANS000.BYTE026  $  switxh(x1) 0x00: y=@0535;0x04: y=@0536;0x08: y=@00fd;0x0c: y=@0537;default: y=@003f;
  $  011.乘员气囊关闭开关状态              $    $         $    $  ANS000.BYTE026  $  switxh(x1&0x30) 0x00: y=@0535;0x10: y=@0536;0x20: y=@00fd;0x30: y=@0537;default: y=@003f;
  $  012.驾驶员气囊状态                    $    $         $    $  ANS001.BYTE205  $  switxh(x1&0x03) 0x00: y=@0538;0x01: y=@0539;0x03: y=@0537;default: y=@003f;
  $  013.乘员气囊状态                      $    $         $    $  ANS001.BYTE205  $  switxh(x1) 0x00: y=@0538;0x04: y=@0539;0x0c: y=@0537;default: y=@003f;
  $  014.驾驶员预警器状态                  $    $         $    $  ANS001.BYTE205  $  switxh(x1&0x30) 0x00: y=@0538;0x10: y=@0539;0x30: y=@0537;default: y=@003f;
  $  015.乘员预警器状态                    $    $         $    $  ANS001.BYTE205  $  switxh(x1) 0x00: y=@0538;0x40: y=@0539;0xc0: y=@0537;default: y=@003f;
  $  016.驾驶员座椅锁扣状态                $    $         $    $  ANS001.BYTE207  $  switxh(x1&0x03) 0x00: y=@053a;0x01: y=@053b;0x02: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  017.乘员座椅锁扣状态                  $    $         $    $  ANS001.BYTE207  $  switxh(x1) 0x00: y=@053a;0x04: y=@053b;0x08: y=@00c8;0x0c: y=@0537;default: y=@003f;
  $  018.碰撞时刻告警灯状态                $    $         $    $  ANS001.BYTE207  $  if(x1&0x10) y=@053c;else y=@053d;
  $  019.碰撞输出                          $    $         $    $  ANS001.BYTE207  $  if(x1&0x20) y=@053e;else y=@053f;
  $  020.碰撞记录完整状态                  $    $         $    $  ANS001.BYTE207  $  if(x1&0x40) y=@0540;else y=@0541;
  $  021.驾驶员气囊回路状况                $    $         $    $  ANS001.BYTE208  $  switxh(x1&0x03) 0x00: y=@0542;0x01: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  022.乘员气囊回路状况                  $    $         $    $  ANS001.BYTE208  $  switxh(x1) 0x00: y=@0542;0x04: y=@00c8;0x0c: y=@0537;default: y=@003f;
  $  023.驾驶员预警器回路状况              $    $         $    $  ANS001.BYTE208  $  switxh(x1&0x30) 0x00: y=@0542;0x10: y=@00c8;0x30: y=@0537;default: y=@003f;
  $  024.乘员预警器回路状况                $    $         $    $  ANS001.BYTE208  $  switxh(x1) 0x00: y=@0542;0x40: y=@00c8;0xc0: y=@0537;default: y=@003f;
  $  025.碰撞时刻PADS 状态                 $    $         $    $  ANS001.BYTE209  $  switxh(x1&0x03) 0x00: y=@0039;0x01: y=@0057;0x02: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  026.碰撞时刻PADI 状态                 $    $         $    $  ANS001.BYTE207  $  switxh(x1) 0x00: y=@0039;0x04: y=@0057;0x08: y=@00c8;0x0c: y=@0537;default: y=@003f;

  $)  01.前向点火数据
  $  01.前向点火数据
  $  REQ000:82 AC F1 21 D1 11       $  ANS000:82 AC F1 21 D1 11

  $  000.驾驶员气囊状态             $    $       $    $  ANS000.BYTE205  $  switxh(x1&0x03) 0x00: y=@0538;0x01: y=@0539;0x03: y=@0537;default: y=@003f;
  $  001.乘员气囊状态               $    $       $    $  ANS000.BYTE205  $  switxh(x1) 0x00: y=@0538;0x04: y=@0539;0x0c: y=@0537;default: y=@003f;
  $  002.驾驶员预警器状态           $    $       $    $  ANS000.BYTE205  $  switxh(x1&0x30) 0x00: y=@0538;0x10: y=@0539;0x30: y=@0537;default: y=@003f;
  $  003.乘员预警器状态             $    $       $    $  ANS000.BYTE205  $  switxh(x1) 0x00: y=@0538;0x40: y=@0539;0xc0: y=@0537;default: y=@003f;
  $  004.驾驶员座椅锁扣状态         $    $       $    $  ANS000.BYTE207  $  switxh(x1&0x03) 0x00: y=@053a;0x01: y=@053b;0x02: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  005.乘员座椅锁扣状态           $    $       $    $  ANS000.BYTE207  $  switxh(x1) 0x00: y=@053a;0x04: y=@053b;0x08: y=@00c8;0x0c: y=@0537;default: y=@003f;
  $  006.碰撞时刻告警灯状态         $    $       $    $  ANS000.BYTE207  $  if(x1&0x10) y=@053c;else y=@053d;
  $  007.碰撞输出                   $    $       $    $  ANS000.BYTE207  $  if(x1&0x20) y=@053e;else y=@053f;
  $  008.碰撞记录完整状态           $    $       $    $  ANS000.BYTE207  $  if(x1&0x40) y=@0540;else y=@0541;
  $  009.驾驶员气囊回路状况         $    $       $    $  ANS000.BYTE208  $  switxh(x1&0x03) 0x00: y=@0542;0x01: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  010.乘员气囊回路状况           $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@0542;0x04: y=@00c8;0x0c: y=@0537;default: y=@003f;
  $  011.驾驶员预警器回路状况       $    $       $    $  ANS000.BYTE208  $  switxh(x1&0x30) 0x00: y=@0542;0x10: y=@00c8;0x30: y=@0537;default: y=@003f;
  $  012.乘员预警器回路状况         $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@0542;0x40: y=@00c8;0xc0: y=@0537;default: y=@003f;
  $  013.碰撞时刻PADS 状态          $    $       $    $  ANS000.BYTE209  $  switxh(x1&0x03) 0x00: y=@0039;0x01: y=@0057;0x02: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  014.碰撞时刻PADI 状态          $    $       $    $  ANS000.BYTE207  $  switxh(x1) 0x00: y=@0039;0x04: y=@0057;0x08: y=@00c8;0x0c: y=@0537;default: y=@003f;

  $)  02.前向接近点火数据
  $  02.前向接近点火数据
  $  REQ000:82 AC F1 21 D2 12       $  ANS000:82 AC F1 21 D2 12

  $  000.驾驶员气囊状态             $    $       $    $  ANS000.BYTE205  $  switxh(x1&0x03) 0x00: y=@0538;0x01: y=@0539;0x03: y=@0537;default: y=@003f;
  $  001.乘员气囊状态               $    $       $    $  ANS000.BYTE205  $  switxh(x1) 0x00: y=@0538;0x04: y=@0539;0x0c: y=@0537;default: y=@003f;
  $  002.驾驶员预警器状态           $    $       $    $  ANS000.BYTE205  $  switxh(x1&0x30) 0x00: y=@0538;0x10: y=@0539;0x30: y=@0537;default: y=@003f;
  $  003.乘员预警器状态             $    $       $    $  ANS000.BYTE205  $  switxh(x1) 0x00: y=@0538;0x40: y=@0539;0xc0: y=@0537;default: y=@003f;
  $  004.驾驶员座椅锁扣状态         $    $       $    $  ANS000.BYTE207  $  switxh(x1&0x03) 0x00: y=@053a;0x01: y=@053b;0x02: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  005.乘员座椅锁扣状态           $    $       $    $  ANS000.BYTE207  $  switxh(x1) 0x00: y=@053a;0x04: y=@053b;0x08: y=@00c8;0x0c: y=@0537;default: y=@003f;
  $  006.碰撞时刻告警灯状态         $    $       $    $  ANS000.BYTE207  $  if(x1&0x10) y=@053c;else y=@053d;
  $  007.碰撞输出                   $    $       $    $  ANS000.BYTE207  $  if(x1&0x20) y=@053e;else y=@053f;
  $  008.碰撞记录完整状态           $    $       $    $  ANS000.BYTE207  $  if(x1&0x40) y=@0540;else y=@0541;
  $  009.驾驶员气囊回路状况         $    $       $    $  ANS000.BYTE208  $  switxh(x1&0x03) 0x00: y=@0542;0x01: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  010.乘员气囊回路状况           $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@0542;0x04: y=@00c8;0x0c: y=@0537;default: y=@003f;
  $  011.驾驶员预警器回路状况       $    $       $    $  ANS000.BYTE208  $  switxh(x1&0x30) 0x00: y=@0542;0x10: y=@00c8;0x30: y=@0537;default: y=@003f;
  $  012.乘员预警器回路状况         $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@0542;0x40: y=@00c8;0xc0: y=@0537;default: y=@003f;
  $  013.碰撞时刻PADS 状态          $    $       $    $  ANS000.BYTE209  $  switxh(x1&0x03) 0x00: y=@0039;0x01: y=@0057;0x02: y=@00c8;0x03: y=@0537;default: y=@003f;
  $  014.碰撞时刻PADI 状态          $    $       $    $  ANS000.BYTE207  $  switxh(x1) 0x00: y=@0039;0x04: y=@0057;0x08: y=@00c8;0x0c: y=@0537;default: y=@003f;

;******************************************************************************************************************************************************

