
     系统名称:FVCM (前向摄像头模块)

     系统ID:0000447A

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~73B,718,748

进入命令:

  $~ REQ000:733 02 10 03 00 00 00 00 00       $~ ANS000:73B 02 10 03 00 00 00 00 00
  $~ REQ001:733 03 22 F1 91 00 00 00 00       $~ ANS001:73B 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:733 02 3E 00 00 00 00 00 00       $! ANS000:73B 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~73B,718,748

进入命令:

  $~ REQ000:733 02 10 01 00 00 00 00 00       $~ ANS000:73B 02 10 01 00 00 00 00 00
  $~ REQ001:733 03 22 F1 91 00 00 00 00       $~ ANS001:73B 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:733 02 3E 00 00 00 00 00 00       $! ANS000:73B 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10855572&quot;: &quot;00004479&quot;, &quot;10622902&quot;: &quot;00004479&quot;, &quot;10958125&quot;: &quot;0000447A&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10855572&quot;: &quot;00004479&quot;, &quot;10622902&quot;: &quot;00004479&quot;, &quot;10958125&quot;: &quot;0000447A&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:733 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/0000447A

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:733 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:733 03 22 F1 83 00 00 00 00            $%  
  $%  REQ001:733 03 22 F1 87 00 00 00 00            $%  
  $%  REQ002:733 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ003:733 03 22 F1 90 00 00 00 00            $%  
  $%  REQ004:733 03 22 F1 91 00 00 00 00            $%  
  $%  REQ005:733 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ006:733 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ007:733 03 22 F1 A2 00 00 00 00            $%  
  $%  REQ008:733 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ009:733 03 22 F1 A9 00 00 00 00            $%  
  $%  REQ010:733 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ011:733 03 22 F1 B5 00 00 00 00            $%  
  $%  REQ012:733 03 22 F1 BA 00 00 00 00            $%  
  $%  REQ013:733 03 22 C0 22 00 00 00 00            $%  
  $%  REQ014:733 03 22 F1 00 00 00 00 00            $%  
  $%  REQ015:733 03 22 F1 20 00 00 00 00            $%  
  $%  REQ016:733 03 22 F1 8A 00 00 00 00            $%  
  $%  REQ017:733 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ018:733 03 22 F1 92 00 00 00 00            $%  
  $%  REQ019:733 03 22 F1 94 00 00 00 00            $%  
  $%  REQ020:733 03 22 F1 98 00 00 00 00            $%  
  $%  REQ021:733 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ022:733 03 22 C0 21 00 00 00 00            $%  

  $%  000:电控单元基础软件参考号                     $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  001:电控单元零件号                             $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  002:电控单元序列号                             $%    $%  ANS002.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  003:车辆识别码(VIN)                            $%    $%  ANS003.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  004:电控单元硬件号                             $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元应用软件号                         $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元标定软件号                         $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  007:电控单元网络参考号                         $%    $%  ANS007.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8); 
  $%  008:车辆特征信息(FK)                           $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  009:电控单元配置文件号                         $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  010:电控单元刷新过程文件号                     $%    $%  ANS010.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  011:二级电控单元应用软件号                     $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  012:前向探测雷达(FDR)零件号                    $%    $%  ANS012.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  013:前向探测雷达(FDR)序列号                    $%    $%  ANS013.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  014:ECU软件校验号                              $%    $%  ANS014.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 
  $%  015:网络配置文件零件号-网络信息域(出厂)        $%    $%  ANS015.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  016:系统供应商标识号                           $%    $%  ANS016.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  017:电控单元制造日期                           $%    $%  ANS017.BYTE003  $%  HEX(x1,x2,x3); 
  $%  018:供应商电控单元硬件参考号                   $%    $%  ANS018.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  019:电控单元软件参考号                         $%    $%  ANS019.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  020:配置跟踪域                                 $%    $%  ANS020.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 
  $%  021:电控单元索引信息                           $%    $%  ANS021.BYTE003  $%  HEX(x1,x2,x3); 
  $%  022:前向探测雷达(FDR)车辆识别码（VIN）         $%    $%  ANS022.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:733 03 22 B0 36 00 00 00 00            $  
  $  REQ001:733 03 22 B0 3A 00 00 00 00            $  
  $  REQ002:733 03 22 B0 45 00 00 00 00            $  
  $  REQ003:733 03 22 B0 50 00 00 00 00            $  
  $  REQ004:733 03 22 B0 54 00 00 00 00            $  
  $  REQ005:733 03 22 B0 55 00 00 00 00            $  
  $  REQ006:733 03 22 B0 5B 00 00 00 00            $  
  $  REQ007:733 03 22 B0 71 00 00 00 00            $  
  $  REQ008:733 03 22 B0 76 00 00 00 00            $  

  $  000.图像处理单元温度                             $    $  摄氏度     $    $  ANS000.BYTE003  $  y=(x1*256+x2)*1-40; 
  $  001.MCU温度                                      $    $  摄氏度     $    $  ANS000.BYTE005  $  y=(x1*256+x2)*1-40; 
  $  002.前向摄像头模块(FVCM)遮挡状态                 $    $             $    $  ANS001.BYTE003  $  switxh(x)0x00:@09ee;0x01:@09ef; 
  $  003.前向摄像头模块(FVCM)软件不匹配失效原因       $    $             $    $  ANS002.BYTE003  $  switxh(x)0x08:@0c05;0x04:@0c06;0x02:@0c07;0x01:@0c08; 
  $  004.学习状态                                     $    $             $    $  ANS003.BYTE003  $  switxh(x)0x00:@00e8;0x01:@01b1;0x02:@0401;0x03:@0070;0x04:@0523;0x05:@0970;0x06:@0525;0x07:@0526; 
  $  005.学习进度                                     $    $  百分比     $    $  ANS003.BYTE004  $  y=(x)*1; 
  $  006.标定日期 (年月日)                            $    $             $    $  ANS004.BYTE003  $  y=(x1*65536+x2*256+x3)*1; 
  $  007.标定日期(时分秒)                             $    $             $    $  ANS004.BYTE006  $  y=(x1*65536+x2*256+x3)*1; 
  $  008.标定里程                                     $    $  公里       $    $  ANS004.BYTE009  $  y=(x1*16777216+x2*65536+x3*256+x4)*1; 
  $  009.系统工作模式                                 $    $             $    $  ANS005.BYTE003  $  switxh(x)0x00:@027a;0x01:@0279; 
  $  010.前向摄像头模块(FVCM)售后标定工作             $    $             $    $  ANS006.BYTE003  $  switxh(x)0x00:@00e7;0x01:@008b; 
  $  011.前向探测雷达(FDR)标定日期 (年月日)           $    $             $    $  ANS007.BYTE003  $  y=(x1*65536+x2*256+x3)*1; 
  $  012.前向探测雷达(FDR)标定日期(时分秒)            $    $             $    $  ANS007.BYTE006  $  y=(x1*65536+x2*256+x3)*1; 
  $  013.前向探测雷达(FDR)标定里程                    $    $  公里       $    $  ANS007.BYTE009  $  y=(x1*16777216+x2*65536+x3*256+x4)*1; 
  $  014.前向探测雷达(FDR)标定精度                    $    $             $    $  ANS008.BYTE003  $  switxh(x&0x03)0x00:@00e8;0x01:@0070;0x02:@0a60;0x03:@0a5f; 
  $  015.前向探测雷达(FDR)标定失败的原因              $    $             $    $  ANS008.BYTE003  $  switxh(x&0x0C)0x00:@0523;0x04:@0525;0x08:@0caf; 
  $  016.前向探测雷达(FDR)标定进度                    $    $  %          $    $  ANS008.BYTE004  $  y=(x)*1; 
  $  017.前向探测雷达(FDR)标定水平偏差角              $    $  度         $    $  ANS008.BYTE005  $  y=(x)*0.0625-8; 

;******************************************************************************************************************************************************

