
     系统名称:FVCM (前向摄像头模块)

     系统ID:00004479

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~73B,718,748

进入命令:

  $~ REQ000:733 02 10 03 00 00 00 00 00       $~ ANS000:73B 02 10 03 00 00 00 00 00
  $~ REQ001:733 03 22 F1 91 00 00 00 00       $~ ANS001:73B 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:733 02 3E 00 00 00 00 00 00       $! ANS000:73B 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~73B,718,748

进入命令:

  $~ REQ000:733 02 10 01 00 00 00 00 00       $~ ANS000:73B 02 10 01 00 00 00 00 00
  $~ REQ001:733 03 22 F1 91 00 00 00 00       $~ ANS001:73B 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:733 02 3E 00 00 00 00 00 00       $! ANS000:73B 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10855572&quot;: &quot;00004479&quot;, &quot;10622902&quot;: &quot;00004479&quot;, &quot;10958125&quot;: &quot;0000447A&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10855572&quot;: &quot;00004479&quot;, &quot;10622902&quot;: &quot;00004479&quot;, &quot;10958125&quot;: &quot;0000447A&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:733 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/00004479

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:733 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:733 03 22 F1 83 00 00 00 00            $%  
  $%  REQ001:733 03 22 F1 87 00 00 00 00            $%  
  $%  REQ002:733 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ003:733 03 22 F1 90 00 00 00 00            $%  
  $%  REQ004:733 03 22 F1 91 00 00 00 00            $%  
  $%  REQ005:733 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ006:733 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ007:733 03 22 F1 A2 00 00 00 00            $%  
  $%  REQ008:733 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ009:733 03 22 F1 A9 00 00 00 00            $%  
  $%  REQ010:733 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ011:733 03 22 F1 00 00 00 00 00            $%  
  $%  REQ012:733 03 22 F1 20 00 00 00 00            $%  
  $%  REQ013:733 03 22 F1 8A 00 00 00 00            $%  
  $%  REQ014:733 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ015:733 03 22 F1 92 00 00 00 00            $%  
  $%  REQ016:733 03 22 F1 94 00 00 00 00            $%  
  $%  REQ017:733 03 22 F1 98 00 00 00 00            $%  
  $%  REQ018:733 03 22 F1 A5 00 00 00 00            $%  

  $%  000:电控单元基础软件参考号                     $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  001:电控单元零件号                             $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  002:电控单元序列号                             $%    $%  ANS002.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  003:车辆识别码(VIN)                            $%    $%  ANS003.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  004:电控单元硬件号                             $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元应用软件号                         $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元标定软件号                         $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  007:电控单元网络参考号                         $%    $%  ANS007.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8); 
  $%  008:车辆特征信息(FK)                           $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  009:电控单元配置文件号                         $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  010:电控单元刷新过程文件号                     $%    $%  ANS010.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  011:ECU软件校验号                              $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  012:网络配置文件零件号-网络信息域(出厂)        $%    $%  ANS012.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  013:系统供应商标识号                           $%    $%  ANS013.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  014:电控单元制造日期                           $%    $%  ANS014.BYTE003  $%  HEX(x1,x2,x3); 
  $%  015:供应商电控单元硬件参考号                   $%    $%  ANS015.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  016:电控单元软件参考号                         $%    $%  ANS016.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  017:配置跟踪域                                 $%    $%  ANS017.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 
  $%  018:电控单元索引信息                           $%    $%  ANS018.BYTE003  $%  HEX(x1,x2,x3); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:733 03 22 B0 1C 00 00 00 00            $  
  $  REQ001:733 03 22 B0 1D 00 00 00 00            $  
  $  REQ002:733 03 22 B0 1E 00 00 00 00            $  
  $  REQ003:733 03 22 B0 1F 00 00 00 00            $  
  $  REQ004:733 03 22 B0 23 00 00 00 00            $  
  $  REQ005:733 03 22 B0 2E 00 00 00 00            $  
  $  REQ006:733 03 22 B0 37 00 00 00 00            $  
  $  REQ007:733 03 22 B0 3B 00 00 00 00            $  
  $  REQ008:733 03 22 B0 3D 00 00 00 00            $  
  $  REQ009:733 03 22 B0 4B 00 00 00 00            $  
  $  REQ010:733 03 22 B0 50 00 00 00 00            $  

  $  000.自适应巡航控制(ACC)最后一次无法激活的故障状态                                $    $                 $    $  ANS000.BYTE009  $  switxh((x1*256+x2)&0xFF03)0x8000:@0527;0x4000:@02ca;0x2000:@0b97;0x1000:@0b98;0x0800:@0b99;0x0400:@0b9a;0x0200:@02c5;0x0100:@0b9b;0x02:@02cc;0x01:@0528; 
  $  001.自适应巡航控制(ACC)最后一次无法激活的日期（年月日）                          $    $                 $    $  ANS000.BYTE011  $  y=(x1*65536+x2*256+x3)*1; 
  $  002.自适应巡航控制(ACC)最后一次无法激活的时间（时分秒）                          $    $                 $    $  ANS000.BYTE014  $  y=(x1*65536+x2*256+x3)*1; 
  $  003.自适应巡航控制(ACC)最后一次无法激活的里程                                    $    $  公里           $    $  ANS000.BYTE017  $  y=(x1*65536+x2*256+x3)*1; 
  $  004.自适应巡航控制(ACC)最后一次停止工作的故障状态                                $    $                 $    $  ANS001.BYTE009  $  switxh((x1*256+x2)&0xFF03)0x8000:@0527;0x4000:@02ca;0x2000:@0b97;0x1000:@0b98;0x0800:@0b99;0x0400:@0b9a;0x0200:@02c5;0x0100:@0b9b;0x02:@02cc;0x01:@0528; 
  $  005.自适应巡航控制(ACC)最后一次停止工作的日期（年月日）                          $    $                 $    $  ANS001.BYTE011  $  y=(x1*65536+x2*256+x3)*1; 
  $  006.自适应巡航控制(ACC)最后一次停止工作的时间（时分秒                            $    $                 $    $  ANS001.BYTE014  $  y=(x1*65536+x2*256+x3)*1; 
  $  007.自适应巡航控制(ACC)最后一次停止工作的里程                                    $    $  公里           $    $  ANS001.BYTE017  $  y=(x1*65536+x2*256+x3)*1; 
  $  008.紧急自动制动(AEB)最后一次无法激活的原因                                      $    $                 $    $  ANS002.BYTE003  $  switxh((x1*16777216+x2*65536+x3*256+x4)&0xFDFFFF03)0x80:@0bc1;0x40:@0ba4;0x20:@0ba6;0x10:@08ca;0x08:@0ba3;0x04:@0ba7;0x01:@0b9f;0x80:@0bb3;0x40:@0bb5;0x20:@0ba8;0x10:@0bab;0x08:@0bc3;0x04:@0bad;0x02:@0bae;0x01:@0bac;0x80:@0bbf;0x40:@0bc0;0x20:@0bb7;0x10:@0bba;0x08:@0bc4;0x04:@0bbc;0x02:@0bb0;0x01:@0bb1;0x02:@0bbd;0x01:@0bbe; 
  $  009.紧急自动制动(AEB)最后一次无法激活的故障状态                                  $    $                 $    $  ANS002.BYTE007  $  switxh((x1*256+x2)&0xFF03)0x8000:@0527;0x4000:@02ca;0x2000:@0b97;0x1000:@0b98;0x0800:@0b99;0x0400:@0b9a;0x0200:@02c5;0x0100:@0b9b;0x02:@02cc;0x01:@0528; 
  $  010.紧急自动制动(AEB)最后一次无法激活的日期（年月日）                            $    $                 $    $  ANS002.BYTE009  $  y=(x1*65536+x2*256+x3)*1; 
  $  011.紧急自动制动(AEB)最后一次无法激活的时间（时分秒）                            $    $                 $    $  ANS002.BYTE012  $  y=(x1*65536+x2*256+x3)*1; 
  $  012.紧急自动制动(AEB)最后一次无法激活的里程                                      $    $  公里           $    $  ANS002.BYTE015  $  y=(x1*65536+x2*256+x3)*1; 
  $  013.紧急自动制动(AEB)最后一次停止工作的故障状态                                  $    $                 $    $  ANS003.BYTE007  $  switxh((x1*256+x2)&0xFF03)0x8000:@0527;0x4000:@02ca;0x2000:@0b97;0x1000:@0b98;0x0800:@0b99;0x0400:@0b9a;0x0200:@02c5;0x0100:@0b9b;0x02:@02cc;0x01:@0528; 
  $  014.紧急自动制动(AEB)最后一次停止工作的日期（年月日）                            $    $                 $    $  ANS003.BYTE009  $  y=(x1*65536+x2*256+x3)*1; 
  $  015.紧急自动制动(AEB)最后一次停止工作的时间（时分秒）                            $    $                 $    $  ANS003.BYTE012  $  y=(x1*65536+x2*256+x3)*1; 
  $  016.紧急自动制动(AEB)最后一次停止工作的里程                                      $    $  公里           $    $  ANS003.BYTE015  $  y=(x1*65536+x2*256+x3)*1; 
  $  017.学习状态                                                                     $    $                 $    $  ANS004.BYTE003  $  switxh(x)0x00:@00e8;0x01:@01b1;0x02:@0401;0x03:@0070;0x04:@0523;0x05:@0970;0x06:@0525;0x07:@0526; 
  $  018.学习进度                                                                     $    $  百分比         $    $  ANS004.BYTE004  $  y=(x)*1; 
  $  019.标定状态                                                                     $    $                 $    $  ANS005.BYTE003  $  switxh(x)0x00:@0305;0x01:@0306;0x02:@0307;0x03:@0308; 
  $  020.紧急自动制动(AEB)事件快照-当前功能_最后一次事件                              $    $                 $    $  ANS006.BYTE003  $  switxh(x&0xC0)0x00:@00e8;0x40:@09f8;0x80:@09f9; 
  $  021.紧急自动制动(AEB)事件快照-当前等级_最后一次事件                              $    $                 $    $  ANS006.BYTE003  $  switxh(x&0x30)0x00:@08be;0x10:@08bf;0x20:@08c0; 
  $  022.紧急自动制动(AEB)事件快照-前向碰撞报警(FCW)选择的敏感等级_最后一次事件       $    $                 $    $  ANS006.BYTE003  $  switxh(x&0x0F)0x00:@0401;0x01:@0019;0x02:@001a;0x03:@00c7; 
  $  023.紧急自动制动(AEB)事件快照-当前车速_最后一次事件                              $    $  千米/时        $    $  ANS006.BYTE004  $  y=(x1*256+x2)*0.015625; 
  $  024.紧急自动制动(AEB)事件快照-当前油门踏板的位置_最后一次事件                    $    $  百分比         $    $  ANS006.BYTE006  $  y=(x)*0.392157; 
  $  025.紧急自动制动(AEB)事件快照-当前制动踏板的位置_最后一次事件                    $    $  百分比         $    $  ANS006.BYTE007  $  y=(x)*0.392157; 
  $  026.紧急自动制动(AEB)事件快照-当前横向加速度_最后一次事件                        $    $  米每平方秒     $    $  ANS006.BYTE008  $  y=(((x1*256+x2)&0xFFF0)>>4)*0.015625-32; 
  $  027.紧急自动制动(AEB)事件快照-当前近光灯点亮_最后一次事件                        $    $                 $    $  ANS006.BYTE009  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  028.紧急自动制动(AEB)事件快照-当前远光灯点亮_最后一次事件                        $    $                 $    $  ANS006.BYTE009  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  029.紧急自动制动(AEB)事件快照-当前车辆纵向偏角_最后一次事件                      $    $  度             $    $  ANS006.BYTE009  $  y=((x1*256+x2)&0x03FF)*0.3519-180; 
  $  030.紧急自动制动(AEB)事件快照-当前车辆横向偏角_最后一次事件                      $    $  度             $    $  ANS006.BYTE011  $  y=(((x1*256+x2)&0xFFC0)>>6)*0.3519-180; 
  $  031.紧急自动制动(AEB)事件快照-当前车辆的横向偏移距离_最后一次事件                $    $  米             $    $  ANS006.BYTE012  $  y=(((x1*256+x2)&0x3FFC)>>2)*0.05-102.4; 
  $  032.紧急自动制动(AEB)事件快照-当前车辆的纵向偏移距离_最后一次事件                $    $  米             $    $  ANS006.BYTE013  $  y=((x1*65536+x2*256+x3)&0x03FFC0)*0.05; 
  $  033.紧急自动制动(AEB)事件快照-日期(年月日)_最后一次事件                          $    $                 $    $  ANS006.BYTE016  $  y=(x1*65536+x2*256+x3)*1; 
  $  034.紧急自动制动(AEB)事件快照-时间(时分秒)_最后一次事件                          $    $                 $    $  ANS006.BYTE019  $  y=(x1*65536+x2*256+x3)*1; 
  $  035.紧急自动制动(AEB)事件快照-里程_最后一次事件                                  $    $  公里           $    $  ANS006.BYTE022  $  y=(x1*65536+x2*256+x3)*1; 
  $  036.摄像头遮挡原因                                                               $    $                 $    $  ANS007.BYTE003  $  switxh((x1*256+x2)&0x03FF)0x0200:@02cc;0x0100:@0528;0x80:@0527;0x40:@02ca;0x20:@0b97;0x10:@0b98;0x08:@0b99;0x04:@0b9a;0x02:@02c5;0x01:@0b9b; 
  $  037.前向摄像头模块(FVCM)标定失败的原因                                           $    $                 $    $  ANS008.BYTE003  $  switxh(x&0x07)0x04:@0153;0x02:@0152;0x01:@008e; 
  $  038.前向摄像头模块(FVCM)软件不匹配失效原因                                       $    $                 $    $  ANS009.BYTE003  $  switxh(x&0x0F)0x08:@0c05;0x04:@0c06;0x02:@0c07;0x01:@0c08; 
  $  039.前向摄像头模块(FVCM)遮挡状态                                                 $    $                 $    $  ANS010.BYTE003  $  switxh(x)0x00:@09ee;0x01:@09ef; 

;******************************************************************************************************************************************************

