
    车型ID：0611

    模拟：协议模拟-->0611

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~79D,7F8

进入命令:

  $~  REQ000:795 02 10 01 00 00 00 00 00       $~  ANS000:79D 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:795 02 3E 00 00 00 00 00 00       $!  ANS000:79D 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:795 03 19 02 09 00 00 00 00       $#  ANS000:79D 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f1000000


  $#  01.读故障码库
  $#  REQ000:795 02 19 0A 00 00 00 00 00       $#  ANS000:79D 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f1000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:795 04 14 FF FF FF 00 00 00       $$  ANS000:79D 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:795 03 22 F1 87 00 00 00 00       $%  ANS000:79D 03 22 F1 87 00 00 00 00
  $%  REQ001:795 03 22 F1 8A 00 00 00 00       $%  ANS001:79D 03 22 F1 8A 00 00 00 00
  $%  REQ002:795 03 22 F1 8B 00 00 00 00       $%  ANS002:79D 03 22 F1 8B 00 00 00 00
  $%  REQ003:795 03 22 F1 8C 00 00 00 00       $%  ANS003:79D 03 22 F1 8C 00 00 00 00
  $%  REQ004:795 03 22 F1 90 00 00 00 00       $%  ANS004:79D 03 22 F1 90 00 00 00 00
  $%  REQ005:795 03 22 F1 99 00 00 00 00       $%  ANS005:79D 03 22 F1 99 00 00 00 00
  $%  REQ006:795 03 22 F1 9D 00 00 00 00       $%  ANS006:79D 03 22 F1 9D 00 00 00 00
  $%  REQ007:795 03 22 F1 12 00 00 00 00       $%  ANS007:79D 03 22 F1 12 00 00 00 00
  $%  REQ008:795 03 22 F1 92 00 00 00 00       $%  ANS008:79D 03 22 F1 92 00 00 00 00
  $%  REQ009:795 03 22 F1 93 00 00 00 00       $%  ANS009:79D 03 22 F1 93 00 00 00 00
  $%  REQ010:795 03 22 F1 94 00 00 00 00       $%  ANS010:79D 03 22 F1 94 00 00 00 00
  $%  REQ011:795 03 22 F1 95 00 00 00 00       $%  ANS011:79D 03 22 F1 95 00 00 00 00
  $%  REQ012:795 03 22 F1 80 00 00 00 00       $%  ANS012:79D 03 22 F1 80 00 00 00 00
  $%  REQ013:795 03 22 F1 98 00 00 00 00       $%  ANS013:79D 03 22 F1 98 00 00 00 00

  $%  000:零件号:                                      $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:供应商代码:                                  $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:ECU(电子控制器)生产日期:                     $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  003:ECU(电子控制器)序列号:                       $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2);
  $%  004:车辆识别号(VIN码):                           $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  005:ECU(电子控制器)刷写日期:                     $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  006:ECU(电子控制器)安装日期:                     $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  007:车辆名称:                                    $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  008:ECU(电子控制器)硬件号:                       $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  009:ECU(电子控制器)硬件版本号:                   $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)软件号:                       $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:ECU(电子控制器)软件版本号:                   $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  012:驱动层软件版本:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  013:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.PEPS(无钥匙进入一键式启动单元)配置状态
  $  00.PEPS(无钥匙进入一键式启动单元)配置状态
  $  REQ000:795 03 22 6A 00 00 00 00 00       $  ANS000:79D 03 22 6A 00 00 00 00 00

  $  000.PEPS(无钥匙进入一键式启动单元)功能配置                                 $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@00ab;else y=@00ac;
  $  001.PEPS(无钥匙进入一键式启动单元)是否配有ESCL(电子转向柱锁控制单元)       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@00a7;else y=@00a8;
  $  002.变速箱类型                                                             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@00a9;else y=@00aa;

  $)  01.PEPS(无钥匙进入一键式启动单元)变种配置
  $  01.PEPS(无钥匙进入一键式启动单元)变种配置
  $  REQ000:795 03 22 6A 01 00 00 00 00       $  ANS000:79D 03 22 6A 01 00 00 00 00

  $  000.发动机种类                 $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@00b1;else y=@00b2;
  $  001.是否满足Thatcham标准       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@00ad;else y=@00ae;
  $  002.内部天线个数配置           $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@00af;else y=@00b0;

  $)  02.智能钥匙数
  $  02.智能钥匙数
  $  REQ000:795 03 22 6A 02 00 00 00 00       $  ANS000:79D 03 22 6A 02 00 00 00 00

  $  000.智能钥匙数       $    $  /     $    $  ANS000.BYTE004  $  y=x;

  $)  03.电池管理状态
  $  03.电池管理状态
  $  REQ000:795 03 22 6A 03 00 00 00 00       $  ANS000:79D 03 22 6A 03 00 00 00 00

  $  000.ACC继电器控制输出状态       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@009d;else y=@009e;
  $  001.IG1继电器控制输出状态       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0099;else y=@009a;
  $  002.IG2继电器控制输出状态       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@009b;else y=@009c;
  $  003.IG2继电器控制输出状态       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@009b;else y=@009c;

  $)  04.车门锁状态
  $  04.车门锁状态
  $  REQ000:795 03 22 6A 04 00 00 00 00       $  ANS000:79D 03 22 6A 04 00 00 00 00

  $  000.车辆门锁状态       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@009f;else y=@00a0;

  $)  05.启动按钮背光状态
  $  05.启动按钮背光状态
  $  REQ000:795 03 22 6A 05 00 00 00 00       $  ANS000:79D 03 22 6A 05 00 00 00 00

  $  000.启动按钮背光灯状态             $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@00a5;else y=@00a6;
  $  001.启动按钮琥珀色指示灯状态       $    $  /     $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@00a1;else y=@00a2;
  $  002.启动按钮绿色指示灯状态         $    $  /     $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@00a3;else y=@00a4;

  $)  06.ESCL(电子转向柱锁控制单元)信息
  $  06.ESCL(电子转向柱锁控制单元)信息
  $  REQ000:795 03 22 6A 06 00 00 00 00       $  ANS000:79D 03 22 6A 06 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元)序列号          $    $  /     $    $  ANS000.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  001.ESCL(电子转向柱锁控制单元) 软件版本       $    $  /     $    $  ANS000.BYTE004  $  HEX(x8,x9);
  $  002.date                                      $    $  /     $    $  ANS000.BYTE004  $  HEX(x10,x11,x12,x13);

  $)  07.ESCL(电子转向柱锁控制单元)锁闩状态
  $  07.ESCL(电子转向柱锁控制单元)锁闩状态
  $  REQ000:795 03 22 6A 07 00 00 00 00       $  ANS000:79D 03 22 6A 07 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元)锁闩状态       $    $  /     $    $  ANS000.BYTE004  $  if(x==0x00) y=@008b;else if(x==0x01) y=@008c;else if(x==0x02) y=@008d;else if(x==0x03) y=@008e;else y=@0033;

  $)  08.ESCL(电子转向柱锁控制单元)操作状态
  $  08.ESCL(电子转向柱锁控制单元)操作状态
  $  REQ000:795 03 22 6A 08 00 00 00 00       $  ANS000:79D 03 22 6A 08 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元) 操作 状态       $    $  /     $    $  ANS000.BYTE004  $  if(x==0x00) y=@008f;else if(x==0x01) y=@0090;else y=@0033;

  $)  09.ESCL(电子转向柱锁控制单元)学习状态
  $  09.ESCL(电子转向柱锁控制单元)学习状态
  $  REQ000:795 03 22 6A 09 00 00 00 00       $  ANS000:79D 03 22 6A 09 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元) 学习 状态       $    $  /     $    $  ANS000.BYTE004  $  if(x==0x00) y=@0091;else if(x==0x01) y=@0092;else if(x==0x02) y=@0093;else if(x==0x03) y=@0094;else y=@0033;

  $)  10.ESCL(电子转向柱锁控制单元)工作状态
  $  10.ESCL(电子转向柱锁控制单元)工作状态
  $  REQ000:795 03 22 6A 0A 00 00 00 00       $  ANS000:79D 03 22 6A 0A 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元) 工作 状态       $    $  /     $    $  ANS000.BYTE004  $  if(x==0x00) y=@0095;else if(x==0x01) y=@0096;else y=@0033;

  $)  11.ESCL(电子转向柱锁控制单元)热保护计数器
  $  11.ESCL(电子转向柱锁控制单元)热保护计数器
  $  REQ000:795 03 22 6A 0B 00 00 00 00       $  ANS000:79D 03 22 6A 0B 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元) 热保护计数器       $    $  /     $    $  ANS000.BYTE004  $  y=x;

  $)  12.ESCL(电子转向柱锁控制单元)电压偏低计数器
  $  12.ESCL(电子转向柱锁控制单元)电压偏低计数器
  $  REQ000:795 03 22 6A 0C 00 00 00 00       $  ANS000:79D 03 22 6A 0C 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元) 电压偏低计数器       $    $  /     $    $  ANS000.BYTE004  $  y=x;

  $)  13.ESCL(电子转向柱锁控制单元)内部失效状态1
  $  13.ESCL(电子转向柱锁控制单元)内部失效状态1
  $  REQ000:795 03 22 6A 0D 00 00 00 00       $  ANS000:79D 03 22 6A 0D 00 00 00 00

  $  000.ESCL(电子转向柱锁控制单元) 内部失效 状态 1       $    $  /     $    $  ANS000.BYTE004  $  if(x==0x00) y=@0030;else if((x>0x00)&&(x<0x0F)) y=@0031;else if(x==0x0F) y=@0032;else y=@0033;

  $)  14.PEPS(无钥匙进入一键式启动单元)防盗状态
  $  14.PEPS(无钥匙进入一键式启动单元)防盗状态
  $  REQ000:795 03 22 02 07 00 00 00 00       $  ANS000:79D 03 22 02 07 00 00 00 00

  $  000.电源状态                                $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@06fa; else y=@06fb;
  $  001.VIN码,SC码,钥匙 学习状态                $    $  /     $    $  ANS000.BYTE005  $  if(((x>>0)&1)) y=@06f6; else y=@06f7;
  $  002.VIN码写入状态                           $    $  /     $    $  ANS000.BYTE005  $  if(((x>>1)&1)) y=@06f8; else y=@06f9;
  $  003.SC码写入状态                            $    $  /     $    $  ANS000.BYTE005  $  if(((x>>2)&1)) y=@06f4; else y=@06f5;
  $  004.已学习钥匙个数                          $    $  /     $    $  ANS000.BYTE005  $  if((x&0x38)==0) y=@03d3; else if((x&0x38)==8) y=@02f9; else if((x&0x38)==0x10) y=@02f8; else if((x&0x38)==0x18) y=@03d4; else if((x&0x38)==0x20) y=@03d5;
  $  005.上一次钥匙transponder认证状态           $    $  /     $    $  ANS000.BYTE006  $  if(((x>>0)&1)) y=@06f2; else y=@06f3;
  $  006.上一次ECM(发动机控制模块)认证状态       $    $  /     $    $  ANS000.BYTE006  $  if(((x>>1)&1)) y=@06f2; else y=@06f3;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:795 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
