
    车型ID：0613

    模拟：协议模拟-->0613

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7EA

进入命令:

  $~  REQ000:7E2 02 10 01 00 00 00 00 00       $~  ANS000:7EA 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E2 02 3E 00 00 00 00 00 00       $!  ANS000:7EA 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7E2 03 19 02 09 00 00 00 00       $#  ANS000:7EA 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f3000000


  $#  01.读故障码库
  $#  REQ000:7E2 02 19 0A 00 00 00 00 00       $#  ANS000:7EA 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f3000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E2 04 14 FF FF FF 00 00 00       $$  ANS000:7EA 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E2 03 22 F1 12 00 00 00 00       $%  ANS000:7EA 03 22 F1 12 00 00 00 00
  $%  REQ001:7E2 03 22 F1 86 00 00 00 00       $%  ANS001:7EA 03 22 F1 86 00 00 00 00
  $%  REQ002:7E2 03 22 F1 80 00 00 00 00       $%  ANS002:7EA 03 22 F1 80 00 00 00 00
  $%  REQ003:7E2 03 22 F1 87 00 00 00 00       $%  ANS003:7EA 03 22 F1 87 00 00 00 00
  $%  REQ004:7E2 03 22 F1 8A 00 00 00 00       $%  ANS004:7EA 03 22 F1 8A 00 00 00 00
  $%  REQ005:7E2 03 22 F1 8B 00 00 00 00       $%  ANS005:7EA 03 22 F1 8B 00 00 00 00
  $%  REQ006:7E2 03 22 F1 8C 00 00 00 00       $%  ANS006:7EA 03 22 F1 8C 00 00 00 00
  $%  REQ007:7E2 03 22 F1 90 00 00 00 00       $%  ANS007:7EA 03 22 F1 90 00 00 00 00
  $%  REQ008:7E2 03 22 F1 92 00 00 00 00       $%  ANS008:7EA 03 22 F1 92 00 00 00 00
  $%  REQ009:7E2 03 22 F1 93 00 00 00 00       $%  ANS009:7EA 03 22 F1 93 00 00 00 00
  $%  REQ010:7E2 03 22 F1 94 00 00 00 00       $%  ANS010:7EA 03 22 F1 94 00 00 00 00
  $%  REQ011:7E2 03 22 F1 95 00 00 00 00       $%  ANS011:7EA 03 22 F1 95 00 00 00 00
  $%  REQ012:7E2 03 22 F1 97 00 00 00 00       $%  ANS012:7EA 03 22 F1 97 00 00 00 00
  $%  REQ013:7E2 03 22 F1 98 00 00 00 00       $%  ANS013:7EA 03 22 F1 98 00 00 00 00
  $%  REQ014:7E2 03 22 F1 99 00 00 00 00       $%  ANS014:7EA 03 22 F1 99 00 00 00 00
  $%  REQ015:7E2 03 22 F1 9D 00 00 00 00       $%  ANS015:7EA 03 22 F1 9D 00 00 00 00
  $%  REQ016:7E2 03 22 F2 00 00 00 00 00       $%  ANS016:7EA 03 22 F2 00 00 00 00 00
  $%  REQ017:7E2 03 22 F2 01 00 00 00 00       $%  ANS017:7EA 03 22 F2 01 00 00 00 00
  $%  REQ018:7E2 03 22 F2 02 00 00 00 00       $%  ANS018:7EA 03 22 F2 02 00 00 00 00
  $%  REQ019:7E2 03 22 F2 03 00 00 00 00       $%  ANS019:7EA 03 22 F2 03 00 00 00 00
  $%  REQ020:7E2 03 22 F2 04 00 00 00 00       $%  ANS020:7EA 03 22 F2 04 00 00 00 00
  $%  REQ021:7E2 03 22 F2 05 00 00 00 00       $%  ANS021:7EA 03 22 F2 05 00 00 00 00
  $%  REQ022:7E2 03 22 F2 06 00 00 00 00       $%  ANS022:7EA 03 22 F2 06 00 00 00 00
  $%  REQ023:7E2 03 22 F2 07 00 00 00 00       $%  ANS023:7EA 03 22 F2 07 00 00 00 00
  $%  REQ024:7E2 03 22 F2 08 00 00 00 00       $%  ANS024:7EA 03 22 F2 08 00 00 00 00
  $%  REQ025:7E2 03 22 F2 09 00 00 00 00       $%  ANS025:7EA 03 22 F2 09 00 00 00 00
  $%  REQ026:7E2 03 22 F2 0A 00 00 00 00       $%  ANS026:7EA 03 22 F2 0A 00 00 00 00
  $%  REQ027:7E2 03 22 F2 0B 00 00 00 00       $%  ANS027:7EA 03 22 F2 0B 00 00 00 00
  $%  REQ028:7E2 03 22 F2 0C 00 00 00 00       $%  ANS028:7EA 03 22 F2 0C 00 00 00 00
  $%  REQ029:7E2 03 22 F2 0D 00 00 00 00       $%  ANS029:7EA 03 22 F2 0D 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断会话模式:                            $%    $%  ANS001.BYTE004  $%  if(x==0x01) y=@000f;else if(x==0x03) y=@0010;else y=@0009;
  $%  002:驱动层软件版本:                              $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  003:零件号:                                      $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:供应商代码:                                  $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:ECU(电子控制器)生产日期:                     $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  006:ECU(电子控制器)序列号:                       $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:车辆识别号:                                  $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  008:ECU(电子控制器)硬件号:                       $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)硬件版本号:                   $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)软件号:                       $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  011:ECU(电子控制器)软件版本号:                   $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  012:系统名称或发动机类型:                        $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  013:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  014:编程或配置日期:                              $%    $%  ANS014.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  015:ECU(电子控制器)安装日期:                     $%    $%  ANS015.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  016:雨量传感器软件版本号:                        $%    $%  ANS016.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  017:雨量传感器零部件号:                          $%    $%  ANS017.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  018:天窗软件版本号:                              $%    $%  ANS018.BYTE004  $%  ASCII(x1,x2);
  $%  019:天窗零部件号:                                $%    $%  ANS019.BYTE004  $%  y=SPRINTF([%d%d%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6,x7,x8);
  $%  020:卷帘软件版本号:                              $%    $%  ANS020.BYTE004  $%  ASCII(x1,x2);
  $%  021:卷帘零部件号:                                $%    $%  ANS021.BYTE004  $%  y=SPRINTF([%d%d%d%d%d%d%d%d],x1,x2,x3,x4,x5,x6,x7,x8);
  $%  022:驾驶员侧车窗软件版本号:                      $%    $%  ANS022.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  023:驾驶员侧车窗硬件版本号:                      $%    $%  ANS023.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  024:副驾驶员侧车窗软件版本号:                    $%    $%  ANS024.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  025:副驾驶员侧车窗硬件版本号:                    $%    $%  ANS025.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  026:左后侧车窗软件版本号:                        $%    $%  ANS026.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  027:左后侧车窗硬件版本号:                        $%    $%  ANS027.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  028:右后侧车窗软件版本号:                        $%    $%  ANS028.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  029:右后侧车窗硬件版本号:                        $%    $%  ANS029.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E2 03 22 10 01 00 00 00 00       $  ANS000:7EA 03 22 10 01 00 00 00 00
  $  REQ001:7E2 03 22 10 02 00 00 00 00       $  ANS001:7EA 03 22 10 02 00 00 00 00
  $  REQ002:7E2 03 22 10 03 00 00 00 00       $  ANS002:7EA 03 22 10 03 00 00 00 00
  $  REQ003:7E2 03 22 10 04 00 00 00 00       $  ANS003:7EA 03 22 10 04 00 00 00 00
  $  REQ004:7E2 03 22 10 05 00 00 00 00       $  ANS004:7EA 03 22 10 05 00 00 00 00
  $  REQ005:7E2 03 22 10 06 00 00 00 00       $  ANS005:7EA 03 22 10 06 00 00 00 00
  $  REQ006:7E2 03 22 10 07 00 00 00 00       $  ANS006:7EA 03 22 10 07 00 00 00 00
  $  REQ007:7E2 03 22 01 04 00 00 00 00       $  ANS007:7EA 03 22 01 04 00 00 00 00
  $  REQ008:7E2 03 22 01 07 00 00 00 00       $  ANS008:7EA 03 22 01 07 00 00 00 00
  $  REQ009:7E2 03 22 01 08 00 00 00 00       $  ANS009:7EA 03 22 01 08 00 00 00 00
  $  REQ010:7E2 03 22 01 0F 00 00 00 00       $  ANS010:7EA 03 22 01 0F 00 00 00 00
  $  REQ011:7E2 03 22 01 1A 00 00 00 00       $  ANS011:7EA 03 22 01 1A 00 00 00 00
  $  REQ012:7E2 03 22 01 1C 00 00 00 00       $  ANS012:7EA 03 22 01 1C 00 00 00 00
  $  REQ013:7E2 03 22 01 20 00 00 00 00       $  ANS013:7EA 03 22 01 20 00 00 00 00
  $  REQ014:7E2 03 22 01 21 00 00 00 00       $  ANS014:7EA 03 22 01 21 00 00 00 00
  $  REQ015:7E2 03 22 60 40 00 00 00 00       $  ANS015:7EA 03 22 60 40 00 00 00 00

  $  000.外视镜折叠/打开开关                           $    $  /       $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0000;else y=@0001;
  $  001.左前门开关输入                                $    $  /       $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@0001;else y=@0000;
  $  002.右前门开关输入                                $    $  /       $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  003.后备箱开关输入                                $    $  /       $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@0001;else y=@0000;
  $  004.前雨刮停止位开关                              $    $  /       $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@00e0;else y=@00e1;
  $  005.危险报警灯开关                                $    $  /       $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0001;else y=@0000;
  $  006.刹车灯故障检测输入4                           $    $  /       $    $  ANS001.BYTE004  $  if(((x>>7)&1)) y=@00de;else y=@00df;
  $  007.刹车灯故障检测输入3                           $    $  /       $    $  ANS001.BYTE004  $  if(((x>>6)&1)) y=@00de;else y=@00df;
  $  008.中控解锁开关                                  $    $  /       $    $  ANS001.BYTE004  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  009.中控闭锁开关                                  $    $  /       $    $  ANS001.BYTE004  $  if(((x>>4)&1)) y=@0001;else y=@0000;
  $  010.后备箱解锁开关                                $    $  /       $    $  ANS001.BYTE004  $  if(((x>>3)&1)) y=@0001;else y=@0000;
  $  011.刹车灯故障检测输入2                           $    $  /       $    $  ANS001.BYTE004  $  if(((x>>2)&1)) y=@00de;else y=@00df;
  $  012.前转向灯故障检测输入2                         $    $  /       $    $  ANS001.BYTE004  $  if(((x>>0)&1)) y=@00de;else y=@00df;
  $  013.前雨刮低速开关                                $    $  /       $    $  ANS002.BYTE004  $  if(((x>>7)&1)) y=@0001;else y=@0000;
  $  014.刹车灯故障检测输入1                           $    $  /       $    $  ANS002.BYTE004  $  if(((x>>6)&1)) y=@00de;else y=@00df;
  $  015.左后门开关输入                                $    $  /       $    $  ANS002.BYTE004  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  016.右后门开关输入                                $    $  /       $    $  ANS002.BYTE004  $  if(((x>>4)&1)) y=@0001;else y=@0000;
  $  017.前舱盖开关输入                                $    $  /       $    $  ANS002.BYTE004  $  if(((x>>2)&1)) y=@0001;else y=@0000;
  $  018.后雨刮停止位开关                              $    $  /       $    $  ANS002.BYTE004  $  if(((x>>1)&1)) y=@00e0;else y=@00e1;
  $  019.前转向灯故障检测输入1                         $    $  /       $    $  ANS003.BYTE004  $  if(((x>>7)&1)) y=@00de;else y=@00df;
  $  020.KL15 开关                                     $    $  /       $    $  ANS004.BYTE004  $  if(((x>>6)&1)) y=@0001;else y=@0000;
  $  021.倒车档开关                                    $    $  /       $    $  ANS004.BYTE004  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  022.左前门风窗升降器手动上升                      $    $  /       $    $  ANS005.BYTE004  $  if(((x>>6)&1)) y=@0001;else y=@0000;
  $  023.左前门风窗升降器手动下降                      $    $  /       $    $  ANS005.BYTE004  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  024.右前门风窗升降器手动上升                      $    $  /       $    $  ANS005.BYTE004  $  if(((x>>4)&1)) y=@0001;else y=@0000;
  $  025.右前门风窗升降器手动下降                      $    $  /       $    $  ANS005.BYTE004  $  if(((x>>3)&1)) y=@0001;else y=@0000;
  $  026.左后门风窗升降器手动上升                      $    $  /       $    $  ANS005.BYTE004  $  if(((x>>2)&1)) y=@0001;else y=@0000;
  $  027.左后门风窗升降器手动下降                      $    $  /       $    $  ANS005.BYTE004  $  if(((x>>1)&1)) y=@0001;else y=@0000;
  $  028.右后门风窗升降器手动上升                      $    $  /       $    $  ANS005.BYTE004  $  if(((x>>0)&1)) y=@0001;else y=@0000;
  $  029.右后门风窗升降器手动下降                      $    $  /       $    $  ANS006.BYTE004  $  if(((x>>7)&1)) y=@0001;else y=@0000;
  $  030.左前门风窗升降器自动下降                      $    $  /       $    $  ANS006.BYTE004  $  if(((x>>6)&1)) y=@0001;else y=@0000;
  $  031.右前门风窗升降器自动下降                      $    $  /       $    $  ANS006.BYTE004  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  032.左后门风窗升降器自动下降                      $    $  /       $    $  ANS006.BYTE004  $  if(((x>>4)&1)) y=@0001;else y=@0000;
  $  033.右后门风窗升降器自动下降                      $    $  /       $    $  ANS006.BYTE004  $  if(((x>>3)&1)) y=@0001;else y=@0000;
  $  034.制动灯踏板开关                                $    $  /       $    $  ANS007.BYTE004  $  if(((x>>0)&1)) y=@0001;else y=@0000;
  $  035.环境光传感器                                  $    $  /       $    $  ANS008.BYTE004  $  if(((x>>0)&1)) y=@0001;else y=@0000;
  $  036.定速巡航电阻开关2->体现外部电阻值             $    $  /       $    $  ANS009.BYTE004  $  if(x==0x01) y=@00cc;else if(x==0x02) y=@00cd;else if(x==0x03) y=@00ce;else if(x==0x04) y=@00cf;else if(x==0x05) y=@00d0;else y=@0009;
  $  037.碰撞硬线输入-占空比                           $    $  /       $    $  ANS010.BYTE004  $  y=x1;
  $  038.碰撞硬线输入-频率                             $    $  KHz     $    $  ANS010.BYTE004  $  y=(x2*256+x3)/1000.0;
  $  039.锁反馈信号_开关                               $    $  /       $    $  ANS011.BYTE004  $  if(((x>>7)&1)) y=@0001;else y=@0000;
  $  040.定速巡航电阻开关1->体现外部电阻值             $    $  /       $    $  ANS012.BYTE004  $  if(x==0x01) y=@00d8;else if(x==0x02) y=@00d9;else if(x==0x03) y=string(0xf1,0x03,0x90x03);else if(x==0x04) y=@00da;else if(x==0x05) y=@00db;else if(x==0x06) y=@00cf;else if(x==0x07) y=@00d0;else y=@0009;
  $  041.闭锁源历史记录-记录最近一次闭锁源             $    $  /       $    $  ANS013.BYTE004  $  if(x1==0x00) y=@0002;else if(x1==0x01) y=@0003;else if(x1==0x02) y=@0004;else if(x1==0x03) y=@0005;else if(x1==0x04) y=@0006;else if(x1==0x05) y=@0007;else y=@0009;
  $  042.闭锁源历史记录-记录倒数第二次闭锁源           $    $  /       $    $  ANS013.BYTE004  $  if(x2==0x00) y=@0002;else if(x2==0x01) y=@0003;else if(x2==0x02) y=@0004;else if(x2==0x03) y=@0005;else if(x2==0x04) y=@0006;else if(x2==0x05) y=@0007;else y=@0009;
  $  043.闭锁源历史记录-记录倒数第三次闭锁源           $    $  /       $    $  ANS013.BYTE004  $  if(x3==0x00) y=@0002;else if(x3==0x01) y=@0003;else if(x3==0x02) y=@0004;else if(x3==0x03) y=@0005;else if(x3==0x04) y=@0006;else if(x3==0x05) y=@0007;else y=@0009;
  $  044.闭锁源历史记录-记录倒数第四次闭锁源           $    $  /       $    $  ANS013.BYTE004  $  if(x4==0x00) y=@0002;else if(x4==0x01) y=@0003;else if(x4==0x02) y=@0004;else if(x4==0x03) y=@0005;else if(x4==0x04) y=@0006;else if(x4==0x05) y=@0007;else y=@0009;
  $  045.解锁源历史记录-记录最近一次解锁源             $    $  /       $    $  ANS014.BYTE004  $  if(x1==0x00) y=@00d1;else if(x1==0x01) y=@00d2;else if(x1==0x02) y=@00d3;else if(x1==0x03) y=@00d4;else if(x1==0x04) y=@00d5;else if(x1==0x05) y=@00d6;else if(x1==0x06) y=@00d7;else y=@0009;
  $  046.解锁源历史记录-记录倒数第二次解锁源           $    $  /       $    $  ANS014.BYTE004  $  if(x2==0x00) y=@00d1;else if(x2==0x01) y=@00d2;else if(x2==0x02) y=@00d3;else if(x2==0x03) y=@00d4;else if(x2==0x04) y=@00d5;else if(x2==0x05) y=@00d6;else if(x2==0x06) y=@00d7;else y=@0009;
  $  047.解锁源历史记录-记录倒数第三次解锁源           $    $  /       $    $  ANS014.BYTE004  $  if(x3==0x00) y=@00d1;else if(x3==0x01) y=@00d2;else if(x3==0x02) y=@00d3;else if(x3==0x03) y=@00d4;else if(x3==0x04) y=@00d5;else if(x3==0x05) y=@00d6;else if(x3==0x06) y=@00d7;else y=@0009;
  $  048.解锁源历史记录-记录倒数第四次解锁源           $    $  /       $    $  ANS014.BYTE004  $  if(x4==0x00) y=@00d1;else if(x4==0x01) y=@00d2;else if(x4==0x02) y=@00d3;else if(x4==0x03) y=@00d4;else if(x4==0x04) y=@00d5;else if(x4==0x05) y=@00d6;else if(x4==0x06) y=@00d7;else y=@0009;
  $  049.防盗报警触发源-最近一次防盗报警触发源         $    $  /       $    $  ANS015.BYTE004  $  if(x1==0x00) y=@00d1;else if(x1==0x01) y=@00dc;else if(x1==0x02) y=@00dd;else y=@0009;
  $  050.防盗报警触发源-倒数第二次防盗报警触发源       $    $  /       $    $  ANS015.BYTE004  $  if(x2==0x00) y=@00d1;else if(x2==0x01) y=@00dc;else if(x2==0x02) y=@00dd;else y=@0009;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E2 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
