
    车型ID：06b0

    模拟：协议模拟-->06b0

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 00 00 9E       $#  ANS000:84 11 F1 18 00 00 00 9E

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/06b00000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 00 00 99       $$  ANS000:83 11 F1 14 00 00 99

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 90 2E       $%  ANS000:82 11 F1 1A 90 2E
  $%  REQ001:82 11 F1 1A 91 2F       $%  ANS001:82 11 F1 1A 91 2F
  $%  REQ002:82 11 F1 1A 92 30       $%  ANS002:82 11 F1 1A 92 30
  $%  REQ003:82 11 F1 1A 94 32       $%  ANS003:82 11 F1 1A 94 32
  $%  REQ004:82 11 F1 1A 95 33       $%  ANS004:82 11 F1 1A 95 33
  $%  REQ005:82 11 F1 1A 96 34       $%  ANS005:82 11 F1 1A 96 34
  $%  REQ006:82 11 F1 1A 97 35       $%  ANS006:82 11 F1 1A 97 35
  $%  REQ007:82 11 F1 1A 98 36       $%  ANS007:82 11 F1 1A 98 36
  $%  REQ008:82 11 F1 1A 99 37       $%  ANS008:82 11 F1 1A 99 37
  $%  REQ009:82 11 F1 1A 9A 38       $%  ANS009:82 11 F1 1A 9A 38
  $%  REQ010:82 11 F1 1A 9B 39       $%  ANS010:82 11 F1 1A 9B 39
  $%  REQ011:82 11 F1 1A 9C 3A       $%  ANS011:82 11 F1 1A 9C 3A
  $%  REQ012:82 11 F1 1A 9D 3B       $%  ANS012:82 11 F1 1A 9D 3B
  $%  REQ013:82 11 F1 1A 9F 3D       $%  ANS013:82 11 F1 1A 9F 3D

  $%  000:汽车标识编号（VIN）:                    $%    $%  ANS000.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:零件号码@代码:                          $%    $%  ANS001.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:ECU(电子控制器)基本硬件编号:            $%    $%  ANS002.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  003:ECU(电子控制器)软件编号:                $%    $%  ANS003.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:ECU(电子控制器)软件版本号:              $%    $%  ANS004.BYTE005  $%  y=HEX(x1,x2);
  $%  005:定型编号:                               $%    $%  ANS005.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  006:系统名称或发动机类型:                   $%    $%  ANS006.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6);
  $%  007:维修店代码或诊断仪序列号:               $%    $%  ANS007.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  008:编程日期:                               $%    $%  ANS008.BYTE005  $%  Y=HEX(x1,x2,x3,x4);
  $%  009:ECU(电子控制器)诊断数据标识(DDI):       $%    $%  ANS009.BYTE005  $%  y=HEX(x1,x2);
  $%  010:ECU(电子控制器)代码版本号:              $%    $%  ANS010.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  011:ECURom版本号:                           $%    $%  ANS011.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  012:CAN数据字典版本号:                      $%    $%  ANS012.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  013:博世零件代码号:                         $%    $%  ANS013.BYTE005  $%  Y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.故障码数量                         $    $  /          $    $  ANS000.BYTE005  $  Y=x;
  $  001.电瓶电压                           $    $  V          $    $  ANS000.BYTE036  $  Y=3.5*x/51.2;
  $  002.发动机转速                         $    $  rpm        $    $  ANS000.BYTE037  $  Y=INT((x1*0x100+x2)*0.25);
  $  003.目标怠速(动态)                     $    $  U/min      $    $  ANS000.BYTE039  $  Y=x*10;
  $  004.目标怠速(静态)                     $    $  U/min      $    $  ANS000.BYTE040  $  Y=x*10;
  $  005.速度                               $    $  km/h       $    $  ANS000.BYTE041  $  Y=x;
  $  006.车辆加速度                         $    $  m/s^2      $    $  ANS000.BYTE042  $  if(x>=0&&x<=127) Y=x*0.217;if(x>=128&&x<=255) Y=(x-255)*0.217;
  $  007.发动机冷却剂温度                   $    $  degC       $    $  ANS000.BYTE044  $  Y=x-40;
  $  008.进气温度传感器电压                 $    $  V          $    $  ANS000.BYTE045  $  Y=5*x/256;
  $  009.发动机机油温度                     $    $  degC       $    $  ANS000.BYTE050  $  y=x-60;
  $  010.进气量                             $    $  kg/h       $    $  ANS000.BYTE051  $  y=(x1*0x100+x2)*0.1;
  $  011.踏板位置传感器1电压                $    $  V          $    $  ANS000.BYTE058  $  y=x/51.2;
  $  012.踏板位置传感器2电压                $    $  V          $    $  ANS000.BYTE059  $  y=x/51.2;
  $  013.加速踏板开度                       $    $  %PED       $    $  ANS000.BYTE060  $  y=x/2.55;
  $  014.节气门电为计1电压                  $    $  V          $    $  ANS000.BYTE061  $  y=x/51.2;
  $  015.节气门电为计2电压                  $    $  V          $    $  ANS000.BYTE062  $  y=x/51.2;
  $  016.期望节气门角度                     $    $  %DK        $    $  ANS000.BYTE063  $  y=x/2.55;
  $  017.节气门开度                         $    $  %DK        $    $  ANS000.BYTE064  $  y=x/2.55;
  $  018.用于学习步长的学习时间计数器       $    $  /          $    $  ANS000.BYTE066  $  Y=x;
  $  019.爆震传感器信号1                    $    $  V          $    $  ANS000.BYTE074  $  y=(x1*0x100+x2)/204.8;
  $  020.爆震传感器信号2                    $    $  V          $    $  ANS000.BYTE076  $  y=(x1*0x100+x2)/204.8;
  $  021.1缸推迟点火爆震控制                $    $  Gradkw     $    $  ANS000.BYTE078  $  y=0-x*191.25/255;
  $  022.2缸推迟点火爆震控制                $    $  Gradkw     $    $  ANS000.BYTE079  $  y=0-x*191.25/255;
  $  023.3缸推迟点火爆震控制                $    $  Gradkw     $    $  ANS000.BYTE080  $  y=0-x*191.25/255;
  $  024.4缸推迟点火爆震控制                $    $  Gradkw     $    $  ANS000.BYTE081  $  y=0-x*191.25/255;
  $  025.5缸推迟点火爆震控制                $    $  Gradkw     $    $  ANS000.BYTE082  $  y=0-x*191.25/255;
  $  026.6缸推迟点火爆震控制                $    $  Gradkw     $    $  ANS000.BYTE083  $  y=0-x*191.25/255;
  $  027.1组氧传感器积分值(短期修正)        $    $  /          $    $  ANS000.BYTE084  $  y=2*x/256;
  $  028.2组氧传感器积分值(短期修正)        $    $  /          $    $  ANS000.BYTE085  $  y=2*x/256;
  $  029.1组氧传感器积分值(长期修正)        $    $  /          $    $  ANS000.BYTE090  $  y=2*x/256;
  $  030.混合气加法自学习值(小负荷)         $    $  %          $    $  ANS000.BYTE093  $  if((x1*0x100+x2)>32767) y=(x1*0x100+x2-65535)/21.33;else y=(x1*0x100+x2)/21.33;
  $  031.模型进气温度                       $    $  degC       $    $  ANS000.BYTE095  $  y=(x-64)/1.33;
  $  032.发动机相对负荷                     $    $  %          $    $  ANS000.BYTE096  $  y=x/1.33;
  $  033.炭罐控制阀占空比                   $    $  %          $    $  ANS000.BYTE099  $  y=100*x/256;
  $  034.炭罐净化率                         $    $  /          $    $  ANS000.BYTE101  $  y=x/512;
  $  035.运行里程                           $    $  km         $    $  ANS000.BYTE103  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  036.运行时间                           $    $  Min        $    $  ANS000.BYTE107  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;

;******************************************************************************************************************************************************

