
    车型ID：0823

    模拟：协议模拟-->0823

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~728

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:728 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 00 00 00 00 00 00       $!  ANS000:728 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:728 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/ac000000


  $#  01.读故障码库
  $#  REQ000:720 02 19 0A 00 00 00 00 00       $#  ANS000:728 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/ac000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:728 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 12 00 00 00 00       $%  ANS000:728 03 22 F1 12 00 00 00 00
  $%  REQ001:720 03 22 F1 87 00 00 00 00       $%  ANS001:728 03 22 F1 87 00 00 00 00
  $%  REQ002:720 03 22 F1 89 00 00 00 00       $%  ANS002:728 03 22 F1 89 00 00 00 00
  $%  REQ003:720 03 22 F1 8A 00 00 00 00       $%  ANS003:728 03 22 F1 8A 00 00 00 00
  $%  REQ004:720 03 22 F1 8B 00 00 00 00       $%  ANS004:728 03 22 F1 8B 00 00 00 00
  $%  REQ005:720 03 22 F1 8C 00 00 00 00       $%  ANS005:728 03 22 F1 8C 00 00 00 00
  $%  REQ006:720 03 22 F1 90 00 00 00 00       $%  ANS006:728 03 22 F1 90 00 00 00 00
  $%  REQ007:720 03 22 F1 93 00 00 00 00       $%  ANS007:728 03 22 F1 93 00 00 00 00
  $%  REQ008:720 03 22 F1 95 00 00 00 00       $%  ANS008:728 03 22 F1 95 00 00 00 00
  $%  REQ009:720 03 22 F1 97 00 00 00 00       $%  ANS009:728 03 22 F1 97 00 00 00 00
  $%  REQ010:720 03 22 F1 98 00 00 00 00       $%  ANS010:728 03 22 F1 98 00 00 00 00
  $%  REQ011:720 03 22 F1 99 00 00 00 00       $%  ANS011:728 03 22 F1 99 00 00 00 00
  $%  REQ012:720 03 22 F1 9D 00 00 00 00       $%  ANS012:728 03 22 F1 9D 00 00 00 00
  $%  REQ013:720 03 22 F1 82 00 00 00 00       $%  ANS013:728 03 22 F1 82 00 00 00 00

  $%  000:车辆名称:                                     $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:零件号:                                       $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:Geely软件版本号:                              $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  003:供应商代码:                                   $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  004:ECU(电子控制器)生产日期:                      $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                        $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  006:车辆识别号（VIN码）:                          $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件版本号:                    $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)软件版本号:                    $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)系统名称或发动机类型:          $%    $%  ANS009.BYTE004  $%  0 ASCII
  $%  010:ECU(电子控制器)刷写维修店代号或设备号:        $%    $%  ANS010.BYTE004  $%  0 ASCII
  $%  011:ECU(电子控制器)刷写日期:                      $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  012:ECU(电子控制器)安装日期:                      $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  013:标定软件版本号:                               $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:720 03 22 F1 89 00 00 00 00       $  ANS000:728 03 22 F1 89 00 00 00 00
  $  REQ001:720 03 22 DF 00 00 00 00 00       $  ANS001:728 03 22 DF 00 00 00 00 00
  $  REQ002:720 03 22 60 02 00 00 00 00       $  ANS002:728 03 22 60 02 00 00 00 00
  $  REQ003:720 03 22 60 03 00 00 00 00       $  ANS003:728 03 22 60 03 00 00 00 00
  $  REQ004:720 03 22 60 04 00 00 00 00       $  ANS004:728 03 22 60 04 00 00 00 00
  $  REQ005:720 03 22 60 05 00 00 00 00       $  ANS005:728 03 22 60 05 00 00 00 00
  $  REQ006:720 03 22 60 06 00 00 00 00       $  ANS006:728 03 22 60 06 00 00 00 00
  $  REQ007:720 03 22 60 07 00 00 00 00       $  ANS007:728 03 22 60 07 00 00 00 00
  $  REQ008:720 03 22 60 08 00 00 00 00       $  ANS008:728 03 22 60 08 00 00 00 00
  $  REQ009:720 03 22 60 09 00 00 00 00       $  ANS009:728 03 22 60 09 00 00 00 00
  $  REQ010:720 03 22 60 0B 00 00 00 00       $  ANS010:728 03 22 60 0B 00 00 00 00
  $  REQ011:720 03 22 60 11 00 00 00 00       $  ANS011:728 03 22 60 11 00 00 00 00
  $  REQ012:720 03 22 60 12 00 00 00 00       $  ANS012:728 03 22 60 12 00 00 00 00
  $  REQ013:720 03 22 60 14 00 00 00 00       $  ANS013:728 03 22 60 14 00 00 00 00
  $  REQ014:720 03 22 60 16 00 00 00 00       $  ANS014:728 03 22 60 16 00 00 00 00
  $  REQ015:720 03 22 33 01 00 00 00 00       $  ANS015:728 03 22 33 01 00 00 00 00
  $  REQ016:720 03 22 33 02 00 00 00 00       $  ANS016:728 03 22 33 02 00 00 00 00
  $  REQ017:720 03 22 33 03 00 00 00 00       $  ANS017:728 03 22 33 03 00 00 00 00
  $  REQ018:720 03 22 33 06 00 00 00 00       $  ANS018:728 03 22 33 06 00 00 00 00

  $  000.制造商ECU(电子控制器)软件版本号                      $    $  /        $    $  ANS000.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $  001.ECU(电子控制器)供电电压                              $    $  V        $    $  ANS001.BYTE004  $  y=x*0.1;
  $  002.巡航控制开关-CC                                      $    $  /        $    $  ANS002.BYTE004  $  switxh(x)0x00:y=@0a2a;0x01:y=@0efa;0x02:y=@0efb;0x03:y=@0efc;0x04:y=@0efd;0x05:y=@0efe; default:y=@000b;
  $  003.巡航控制开关-ACC                                     $    $  /        $    $  ANS002.BYTE005  $  switxh(x)0x00:y=@0a2a;0x01:y=@0eff;0x02:y=@0a2c;0x03:y=@0f00; default:y=@000b;
  $  004.左转向开关                                           $    $  /        $    $  ANS003.BYTE004  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  005.右转向开关                                           $    $  /        $    $  ANS003.BYTE004  $  if(((x>>1)&1))y=@0170;else y=@010e;
  $  006.危险报警开关(用手长按住开关才能体现结果)             $    $  /        $    $  ANS003.BYTE004  $  if(((x>>2)&1))y=@0170;else y=@010e;
  $  007.位置灯开关                                           $    $  /        $    $  ANS003.BYTE004  $  if(((x>>3)&1))y=@0170;else y=@010e;
  $  008.近光灯开关                                           $    $  /        $    $  ANS003.BYTE004  $  if(((x>>4)&1))y=@0170;else y=@010e;
  $  009.自动灯开关                                           $    $  /        $    $  ANS003.BYTE004  $  if(((x>>5)&1))y=@0170;else y=@010e;
  $  010.左转向反馈(用手长按住开关才能体现结果)               $    $  /        $    $  ANS003.BYTE004  $  if(((x>>6)&1))y=@01d0;else y=@0dcd;
  $  011.右转向反馈(用手长按住开关才能体现结果)               $    $  /        $    $  ANS003.BYTE004  $  if(((x>>7)&1))y=@0170;else y=@010e;
  $  012.刹车踏板开关                                         $    $  /        $    $  ANS003.BYTE005  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  013.前雾灯开关                                           $    $  /        $    $  ANS003.BYTE005  $  if(((x>>1)&1))y=@0170;else y=@010e;
  $  014.后雾灯开关                                           $    $  /        $    $  ANS003.BYTE005  $  if(((x>>2)&1))y=@0170;else y=@010e;
  $  015.远光灯开关                                           $    $  /        $    $  ANS003.BYTE005  $  if(((x>>3)&1))y=@0170;else y=@010e;
  $  016.倒车档开关(用手长按住开关才能体现结果)               $    $  /        $    $  ANS003.BYTE005  $  if(((x>>5)&1))y=@0170;else y=@010e;
  $  017.左前门门开开关                                       $    $  /        $    $  ANS004.BYTE004  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  018.右前门门开开关                                       $    $  /        $    $  ANS004.BYTE004  $  if(((x>>1)&1))y=@0170;else y=@010e;
  $  019.左后门门开开关                                       $    $  /        $    $  ANS004.BYTE004  $  if(((x>>2)&1))y=@0170;else y=@010e;
  $  020.右后门门开开关                                       $    $  /        $    $  ANS004.BYTE004  $  if(((x>>3)&1))y=@0170;else y=@010e;
  $  021.后备箱打开开关                                       $    $  /        $    $  ANS004.BYTE004  $  if(((x>>4)&1))y=@0170;else y=@010e;
  $  022.引擎盖打开开关                                       $    $  /        $    $  ANS004.BYTE004  $  if(((x>>5)&1))y=@0170;else y=@010e;
  $  023.中控锁锁止开关(用手长按住开关才能体现结果)           $    $  /        $    $  ANS005.BYTE004  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  024.中控锁解锁开关(用手长按住开关才能体现结果)           $    $  /        $    $  ANS005.BYTE004  $  if(((x>>1)&1))y=@0170;else y=@010e;
  $  025.驾驶员车门机械锁开关                                 $    $  /        $    $  ANS005.BYTE004  $  if(((x>>2)&1))y=@0170;else y=@010e;
  $  026.后备箱开启开关                                       $    $  /        $    $  ANS005.BYTE004  $  if(((x>>3)&1))y=@0170;else y=@010e;
  $  027.外部后备箱释放开关                                   $    $  /        $    $  ANS005.BYTE004  $  if(((x>>4)&1))y=@0170;else y=@010e;
  $  028.驾驶员车门锁止状态                                   $    $  /        $    $  ANS005.BYTE004  $  if(((x>>5)&1))y=@0170;else y=@010e;
  $  029.除驾驶员外其他三车门锁止状态                         $    $  /        $    $  ANS005.BYTE004  $  if(((x>>6)&1))y=@01d0;else y=@0dcd;
  $  030.前雨刮清洗开关                                       $    $  /        $    $  ANS006.BYTE004  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  031.前雨刮间歇开关                                       $    $  /        $    $  ANS006.BYTE004  $  if(((x>>1)&1))y=@0170;else y=@010e;
  $  032.前雨刮停止开关                                       $    $  /        $    $  ANS006.BYTE004  $  if(((x>>2)&1))y=@0170;else y=@010e;
  $  033.前雨刮高速开关                                       $    $  /        $    $  ANS006.BYTE004  $  if(((x>>3)&1))y=@0170;else y=@010e;
  $  034.前雨刮低速开关                                       $    $  /        $    $  ANS006.BYTE004  $  if(((x>>4)&1))y=@0170;else y=@010e;
  $  035.前雨刮间歇时间档                                     $    $  /        $    $  ANS007.BYTE004  $  switxh(x)0x00:y=@0943;0x01:y=@0791;0x02:y=@0792;0x03:y=@0793;0x04:y=@0944;0x05:y=@0945;0x06:y=@0946;0xFF:y=@00be;
  $  036.点火开关状态                                         $    $  /        $    $  ANS008.BYTE004  $  switxh(x)0x00:y=@01cf;0x01:y=@015c;0x02:y=@04da;0x03:y=@015f;0x04:y=@034b;0x05:y=@034c;0x06:y=@034d;0x09:y=@034e;0x0A:y=@034f;0x0c:y=@0350;0x0D:y=@0351;0x0E:y=@0352;0x0F:y=@0353;0x10:y=@0354;0x11:y=@0355;0x12:y=@0356;0x14:y=@0357;0x15:y=@0358; default:y=@000b;
  $  037.后除霜开关                                           $    $  /        $    $  ANS009.BYTE004  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  038.前除霜开关                                           $    $  /        $    $  ANS009.BYTE004  $  if(((x>>1)&1))y=@0170;else y=@010e;
  $  039.后视镜折叠开关                                       $    $  /        $    $  ANS010.BYTE004  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  040.记录最近一次闭锁源                                   $    $  /        $    $  ANS011.BYTE004  $  switxh(x)0x00:y=@0002;0x01:y=@0342;0x02:y=@0343;0x03:y=@0005;0x04:y=@0006;0x05:y=@0007;0x06:y=@0344;0x07:y=@00d5;0x08:y=@0345;0x0a:y=@00d4;0x0b:y=@00d7;0x0c:y=@0347;0x0d:y=@0ee8;0x0e:y=@0349;0x0f:y=@034a;default:y=@0ee9;
  $  041.记录倒数第二次闭锁源                                 $    $  /        $    $  ANS011.BYTE005  $  switxh(x)0x00:y=@0002;0x01:y=@0342;0x02:y=@0343;0x03:y=@0005;0x04:y=@0006;0x05:y=@0007;0x06:y=@0344;0x07:y=@00d5;0x08:y=@0345;0x0a:y=@00d4;0x0b:y=@00d7;0x0c:y=@0347;0x0d:y=@0ee8;0x0e:y=@0349;0x0f:y=@034a;default:y=@0ee9;
  $  042.记录倒数第三次闭锁源                                 $    $  /        $    $  ANS011.BYTE006  $  switxh(x)0x00:y=@0002;0x01:y=@0342;0x02:y=@0343;0x03:y=@0005;0x04:y=@0006;0x05:y=@0007;0x06:y=@0344;0x07:y=@00d5;0x08:y=@0345;0x0a:y=@00d4;0x0b:y=@00d7;0x0c:y=@0347;0x0d:y=@0ee8;0x0e:y=@0349;0x0f:y=@034a;default:y=@0ee9;
  $  043.记录倒数第四次闭锁源                                 $    $  /        $    $  ANS011.BYTE007  $  switxh(x)0x00:y=@0002;0x01:y=@0342;0x02:y=@0343;0x03:y=@0005;0x04:y=@0006;0x05:y=@0007;0x06:y=@0344;0x07:y=@00d5;0x08:y=@0345;0x0a:y=@00d4;0x0b:y=@00d7;0x0c:y=@0347;0x0d:y=@0ee8;0x0e:y=@0349;0x0f:y=@034a;default:y=@0ee9;
  $  044.经济模式开关(用手长按住开关才能体现结果)             $    $  /        $    $  ANS012.BYTE004  $  if(((x>>0)&1))y=@0170;else y=@010e;
  $  045.运动模式开关(用手长按住开关才能体现结果)             $    $  /        $    $  ANS012.BYTE004  $  if(((x>>1)&1))y=@0170;else y=@010e;
  $  046.电动模式开关(用手长按住开关才能体现结果)             $    $  /        $    $  ANS012.BYTE004  $  if(((x>>2)&1))y=@0170;else y=@010e;
  $  047.模式保存开关(用手长按住开关才能体现结果)             $    $  /        $    $  ANS012.BYTE004  $  if(((x>>7)&1))y=@0170;else y=@010e;
  $  048.驾驶员侧玻璃开关                                     $    $  /        $    $  ANS013.BYTE004  $  switxh(x&0x07)0x0:y=@0ee7;0x1:y=@03c3;0x2:y=@03c4;0x3:y=@03c5;0x4:y=@03c6;0x5:y=@00be; default:y=@000b;
  $  049.驾驶门乘员侧玻璃开关                                 $    $  /        $    $  ANS013.BYTE004  $  switxh((x>>3)&0x07)0x0:y=@0ee7;0x1:y=@03c3;0x2:y=@03c4;0x3:y=@03c5;0x4:y=@03c6;0x5:y=@00be; default:y=@000b;
  $  050.驾驶门左后侧玻璃开关                                 $    $  /        $    $  ANS013.BYTE005  $  switxh(x&0x07)0x0:y=@0ee7;0x1:y=@03c3;0x2:y=@03c4;0x3:y=@03c5;0x4:y=@03c6;0x5:y=@00be; default:y=@000b;
  $  051.驾驶门右后侧玻璃开关                                 $    $  /        $    $  ANS013.BYTE005  $  switxh((x>>3)&0x07)0x0:y=@0ee7;0x1:y=@03c3;0x2:y=@03c4;0x3:y=@03c5;0x4:y=@03c6;0x5:y=@00be; default:y=@000b;
  $  052.乘员侧玻璃开关                                       $    $  /        $    $  ANS013.BYTE006  $  switxh(x&0x07)0x0:y=@0ee7;0x1:y=@03c3;0x2:y=@03c4;0x3:y=@03c5;0x4:y=@03c6;0x5:y=@00be; default:y=@000b;
  $  053.左后侧玻璃开关                                       $    $  /        $    $  ANS013.BYTE006  $  switxh(x&0x07)0x0:y=@0ee7;0x1:y=@03c3;0x2:y=@03c4;0x3:y=@03c5;0x4:y=@03c6;0x5:y=@00be; default:y=@000b;
  $  054.右后侧玻璃开关                                       $    $  /        $    $  ANS013.BYTE007  $  switxh(x&0x07)0x0:y=@0ee7;0x1:y=@03c3;0x2:y=@03c4;0x3:y=@03c5;0x4:y=@03c6;0x5:y=@00be; default:y=@000b;
  $  055.乘客侧车窗禁止开关(用手长按住开关才能体现结果)       $    $  /        $    $  ANS013.BYTE007  $  if(((x>>3)&1))y=@0001;else y=@01cf;
  $  056.车窗运行许可标识(用手长按住开关才能体现结果)         $    $  /        $    $  ANS013.BYTE007  $  if(((x>>4)&1))y=@0001;else y=@01cf;
  $  057.硬线碰撞信号计数器                                   $    $  /        $    $  ANS014.BYTE004  $  y=x;
  $  058.CAN总线碰撞信号计数器                                $    $  /        $    $  ANS014.BYTE005  $  y=x;
  $  059.左前胎压传感器ID                                     $    $  /        $    $  ANS015.BYTE004  $  HEX(x1,x2,x3,x4);
  $  060.右前胎压传感器ID                                     $    $  /        $    $  ANS015.BYTE008  $  HEX(x1,x2,x3,x4);
  $  061.右后胎压传感器ID                                     $    $  /        $    $  ANS015.BYTE012  $  HEX(x1,x2,x3,x4);
  $  062.左后胎压传感器ID                                     $    $  /        $    $  ANS015.BYTE016  $  HEX(x1,x2,x3,x4);
  $  063.左前胎压值                                           $    $  kPa      $    $  ANS016.BYTE004  $  y=x1*1.373;
  $  064.右前胎压值                                           $    $  kPa      $    $  ANS016.BYTE005  $  y=x1*1.373;
  $  065.右后胎压值                                           $    $  kPa      $    $  ANS016.BYTE006  $  y=x1*1.373;
  $  066.左后胎压值                                           $    $  kPa      $    $  ANS016.BYTE007  $  y=x1*1.373;
  $  067.左前轮温度值                                         $    $  degC     $    $  ANS017.BYTE004  $  y=x-50;
  $  068.右前轮温度值                                         $    $  degC     $    $  ANS017.BYTE005  $  y=x-50;
  $  069.右后轮温度值                                         $    $  degC     $    $  ANS017.BYTE006  $  y=x-50;
  $  070.左后轮温度值                                         $    $  degC     $    $  ANS017.BYTE007  $  y=x-50;
  $  071.低压报警记录-左前胎压传感器ID                        $    $  /        $    $  ANS018.BYTE004  $  HEX(x1,x2,x3,x4);
  $  072.低压报警记录-左前胎压值                              $    $  kPa      $    $  ANS018.BYTE008  $  y=x1*1.373;
  $  073.低压报警记录-左前轮温度值                            $    $  degC     $    $  ANS018.BYTE009  $  y=x-50;
  $  074.低压报警记录-左前TMPS环境温度                        $    $  degC     $    $  ANS018.BYTE010  $  y=x-50;
  $  075.低压报警记录-右前胎压传感器ID                        $    $  /        $    $  ANS018.BYTE011  $  HEX(x1,x2,x3,x4);
  $  076.低压报警记录-右前胎压值                              $    $  kPa      $    $  ANS018.BYTE015  $  y=x1*1.373;
  $  077.低压报警记录-右前轮温度值                            $    $  degC     $    $  ANS018.BYTE016  $  y=x-50;
  $  078.低压报警记录-右前TMPS环境温度                        $    $  degC     $    $  ANS018.BYTE017  $  y=x-50;
  $  079.低压报警记录-右后胎压传感器ID                        $    $  /        $    $  ANS018.BYTE018  $  HEX(x1,x2,x3,x4);
  $  080.低压报警记录-右后胎压值                              $    $  kPa      $    $  ANS018.BYTE022  $  y=x1*1.373;
  $  081.低压报警记录-右后轮温度值                            $    $  degC     $    $  ANS018.BYTE023  $  y=x-50;
  $  082.低压报警记录-右后TMPS环境温度                        $    $  degC     $    $  ANS018.BYTE024  $  y=x-50;
  $  083.低压报警记录-左后胎压传感器ID                        $    $  /        $    $  ANS018.BYTE025  $  HEX(x1,x2,x3,x4);
  $  084.低压报警记录-左后胎压值                              $    $  kPa      $    $  ANS018.BYTE029  $  y=x1*1.373;
  $  085.低压报警记录-左后轮温度值                            $    $  degC     $    $  ANS018.BYTE030  $  y=x-50;
  $  086.低压报警记录-左后TMPS环境温度                        $    $  degC     $    $  ANS018.BYTE031  $  y=x-50;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
