
    车型ID：0aa7

    模拟：协议模拟-->0aa7

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~79D,7F8

进入命令:

  $~  REQ000:795 02 10 01 00 00 00 00 00       $~  ANS000:79D 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:795 02 3E 00 00 00 00 00 00       $!  ANS000:79D 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:795 03 19 02 09 00 00 00 00       $#  ANS000:79D 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f1000000


  $#  01.读故障码库
  $#  REQ000:795 02 19 0A 00 00 00 00 00       $#  ANS000:79D 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f1000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:795 04 14 FF FF FF 00 00 00       $$  ANS000:79D 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:795 03 22 F1 87 00 00 00 00       $%  ANS000:79D 03 22 F1 87 00 00 00 00
  $%  REQ001:795 03 22 F1 8A 00 00 00 00       $%  ANS001:79D 03 22 F1 8A 00 00 00 00
  $%  REQ002:795 03 22 F1 8B 00 00 00 00       $%  ANS002:79D 03 22 F1 8B 00 00 00 00
  $%  REQ003:795 03 22 F1 8C 00 00 00 00       $%  ANS003:79D 03 22 F1 8C 00 00 00 00
  $%  REQ004:795 03 22 F1 90 00 00 00 00       $%  ANS004:79D 03 22 F1 90 00 00 00 00
  $%  REQ005:795 03 22 F1 99 00 00 00 00       $%  ANS005:79D 03 22 F1 99 00 00 00 00
  $%  REQ006:795 03 22 F1 9D 00 00 00 00       $%  ANS006:79D 03 22 F1 9D 00 00 00 00
  $%  REQ007:795 03 22 F1 12 00 00 00 00       $%  ANS007:79D 03 22 F1 12 00 00 00 00
  $%  REQ008:795 03 22 F1 92 00 00 00 00       $%  ANS008:79D 03 22 F1 92 00 00 00 00
  $%  REQ009:795 03 22 F1 93 00 00 00 00       $%  ANS009:79D 03 22 F1 93 00 00 00 00
  $%  REQ010:795 03 22 F1 94 00 00 00 00       $%  ANS010:79D 03 22 F1 94 00 00 00 00
  $%  REQ011:795 03 22 F1 95 00 00 00 00       $%  ANS011:79D 03 22 F1 95 00 00 00 00
  $%  REQ012:795 03 22 F1 80 00 00 00 00       $%  ANS012:79D 03 22 F1 80 00 00 00 00
  $%  REQ013:795 03 22 F1 98 00 00 00 00       $%  ANS013:79D 03 22 F1 98 00 00 00 00

  $%  000:零件号:                                      $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:供应商代码:                                  $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:ECU(电子控制器)生产日期:                     $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  003:ECU(电子控制器)序列号:                       $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2);
  $%  004:车辆识别号(VIN码):                           $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  005:ECU(电子控制器)刷写日期:                     $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  006:ECU(电子控制器)安装日期:                     $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  007:车辆名称:                                    $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  008:ECU(电子控制器)硬件号:                       $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  009:ECU(电子控制器)硬件版本号:                   $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)软件号:                       $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:ECU(电子控制器)软件版本号:                   $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  012:驱动层软件版本:                              $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  013:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS013.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:795 03 22 02 07 00 00 00 00       $  ANS000:79D 03 22 02 07 00 00 00 00
  $  REQ001:795 03 22 6A 00 00 00 00 00       $  ANS001:79D 03 22 6A 00 00 00 00 00
  $  REQ002:795 03 22 6A 01 00 00 00 00       $  ANS002:79D 03 22 6A 01 00 00 00 00
  $  REQ003:795 03 22 6A 02 00 00 00 00       $  ANS003:79D 03 22 6A 02 00 00 00 00
  $  REQ004:795 03 22 6A 03 00 00 00 00       $  ANS004:79D 03 22 6A 03 00 00 00 00
  $  REQ005:795 03 22 6A 04 00 00 00 00       $  ANS005:79D 03 22 6A 04 00 00 00 00
  $  REQ006:795 03 22 6A 05 00 00 00 00       $  ANS006:79D 03 22 6A 05 00 00 00 00
  $  REQ007:795 03 22 6A 06 00 00 00 00       $  ANS007:79D 03 22 6A 06 00 00 00 00
  $  REQ008:795 03 22 6A 07 00 00 00 00       $  ANS008:79D 03 22 6A 07 00 00 00 00
  $  REQ009:795 03 22 6A 08 00 00 00 00       $  ANS009:79D 03 22 6A 08 00 00 00 00
  $  REQ010:795 03 22 6A 09 00 00 00 00       $  ANS010:79D 03 22 6A 09 00 00 00 00
  $  REQ011:795 03 22 6A 0A 00 00 00 00       $  ANS011:79D 03 22 6A 0A 00 00 00 00
  $  REQ012:795 03 22 6A 0B 00 00 00 00       $  ANS012:79D 03 22 6A 0B 00 00 00 00
  $  REQ013:795 03 22 6A 0C 00 00 00 00       $  ANS013:79D 03 22 6A 0C 00 00 00 00
  $  REQ014:795 03 22 6A 0D 00 00 00 00       $  ANS014:79D 03 22 6A 0D 00 00 00 00
  $  REQ015:795 03 22 6A 0E 00 00 00 00       $  ANS015:79D 03 22 6A 0E 00 00 00 00

  $  000.电源状态                                                               $    $  /     $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@06fa; else y=@06fb;
  $  001.VIN码,SC码,钥匙 学习状态                                               $    $  /     $    $  ANS000.BYTE005  $  if(((x>>0)&1)) y=@06f6; else y=@06f7;
  $  002.VIN码写入状态                                                          $    $  /     $    $  ANS000.BYTE005  $  if(((x>>1)&1)) y=@06f8; else y=@06f9;
  $  003.SC码写入状态                                                           $    $  /     $    $  ANS000.BYTE005  $  if(((x>>2)&1)) y=@06f4; else y=@06f5;
  $  004.已学习钥匙个数                                                         $    $  /     $    $  ANS000.BYTE005  $  if((x&0x38)==0) y=@03d3; else if((x&0x38)==8) y=@02f9; else if((x&0x38)==0x10) y=@02f8; else if((x&0x38)==0x18) y=@03d4; else if((x&0x38)==0x20) y=@03d5;
  $  005.上一次钥匙transponder认证状态                                          $    $  /     $    $  ANS000.BYTE006  $  if(((x>>0)&1)) y=@06f2; else y=@06f3;
  $  006.上一次ECM(发动机控制模块)认证状态                                      $    $  /     $    $  ANS000.BYTE006  $  if(((x>>1)&1)) y=@06f2; else y=@06f3;
  $  007.PEPS(无钥匙进入一键式启动单元)功能配置                                 $    $  /     $    $  ANS001.BYTE004  $  if(((x>>0)&1)) y=@00ab;else y=@00ac;
  $  008.PEPS(无钥匙进入一键式启动单元)是否配有ESCL(电子转向柱锁控制单元)       $    $  /     $    $  ANS001.BYTE004  $  if(((x>>1)&1)) y=@00a7;else y=@00a8;
  $  009.变速箱类型                                                             $    $  /     $    $  ANS001.BYTE004  $  if(((x>>2)&1)) y=@00a9;else y=@00aa;
  $  010.发动机种类                                                             $    $  /     $    $  ANS002.BYTE004  $  if(((x>>0)&1)) y=@00b1;else y=@00b2;
  $  011.是否满足Thatcham标准                                                   $    $  /     $    $  ANS002.BYTE004  $  if(((x>>1)&1)) y=@00ad;else y=@00ae;
  $  012.内部天线个数配置                                                       $    $  /     $    $  ANS002.BYTE004  $  if(((x>>2)&1)) y=@00af;else y=@00b0;
  $  013.智能钥匙数                                                             $    $  /     $    $  ANS003.BYTE004  $  y=x;
  $  014.ACC继电器控制输出状态                                                  $    $  /     $    $  ANS004.BYTE004  $  if(((x>>0)&1)) y=@009d;else y=@009e;
  $  015.IG1继电器控制输出状态                                                  $    $  /     $    $  ANS004.BYTE004  $  if(((x>>1)&1)) y=@0099;else y=@009a;
  $  016.IG2继电器控制输出状态                                                  $    $  /     $    $  ANS004.BYTE004  $  if(((x>>2)&1)) y=@009b;else y=@009c;
  $  017.IG2继电器控制输出状态                                                  $    $  /     $    $  ANS004.BYTE004  $  if(((x>>2)&1)) y=@009b;else y=@009c;
  $  018.车辆门锁状态                                                           $    $  /     $    $  ANS005.BYTE004  $  if(((x>>0)&1)) y=@009f;else y=@00a0;
  $  019.启动按钮背光灯状态                                                     $    $  /     $    $  ANS006.BYTE004  $  if(((x>>0)&1)) y=@00a5;else y=@00a6;
  $  020.启动按钮琥珀色指示灯状态                                               $    $  /     $    $  ANS006.BYTE004  $  if(((x>>1)&1)) y=@00a1;else y=@00a2;
  $  021.启动按钮绿色指示灯状态                                                 $    $  /     $    $  ANS006.BYTE004  $  if(((x>>2)&1)) y=@00a3;else y=@00a4;
  $  022.ESCL(电子转向柱锁控制单元)序列号                                       $    $  /     $    $  ANS007.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $  023.ESCL(电子转向柱锁控制单元) 软件版本                                    $    $  /     $    $  ANS007.BYTE004  $  HEX(x8,x9);
  $  024.date                                                                   $    $  /     $    $  ANS007.BYTE004  $  HEX(x10,x11,x12,x13);
  $  025.ESCL(电子转向柱锁控制单元)锁闩状态                                     $    $  /     $    $  ANS008.BYTE004  $  if(x==0x00) y=@008b;else if(x==0x01) y=@008c;else if(x==0x02) y=@008d;else if(x==0x03) y=@008e;else y=@0033;
  $  026.ESCL(电子转向柱锁控制单元) 操作 状态                                   $    $  /     $    $  ANS009.BYTE004  $  if(x==0x00) y=@008f;else if(x==0x01) y=@0090;else y=@0033;
  $  027.ESCL(电子转向柱锁控制单元) 学习 状态                                   $    $  /     $    $  ANS010.BYTE004  $  if(x==0x00) y=@0091;else if(x==0x01) y=@0092;else if(x==0x02) y=@0093;else if(x==0x03) y=@0094;else y=@0033;
  $  028.ESCL(电子转向柱锁控制单元) 工作 状态                                   $    $  /     $    $  ANS011.BYTE004  $  if(x==0x00) y=@0095;else if(x==0x01) y=@0096;else y=@0033;
  $  029.ESCL(电子转向柱锁控制单元) 热保护计数器                                $    $  /     $    $  ANS012.BYTE004  $  y=x;
  $  030.ESCL(电子转向柱锁控制单元) 电压偏低计数器                              $    $  /     $    $  ANS013.BYTE004  $  y=x;
  $  031.ESCL(电子转向柱锁控制单元) 内部失效 状态 1                             $    $  /     $    $  ANS014.BYTE004  $  if(x==0x00) y=@0030;else if((x>0x00)&&(x<0x0F)) y=@0031;else if(x==0x0F) y=@0032;else y=@0033;
  $  032.CPU 故障状态1                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>0)&1)) y=@005a;else y=@005b;
  $  033.CPU 故障状态2                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>1)&1)) y=@0056;else y=@0057;
  $  034.检测板/堆叠测试 故障状态1                                              $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>2)&1)) y=@0058;else y=@0059;
  $  035.检测板/堆叠测试 故障状态2                                              $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>3)&1)) y=@0052;else y=@0053;
  $  036.ROM(只读存储器) 故障状态1                                              $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>4)&1)) y=@0054;else y=@0055;
  $  037.ROM(只读存储器) 故障状态2                                              $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>5)&1)) y=@004e;else y=@004f;
  $  038.锁定地面状态1                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>6)&1)) y=@0050;else y=@0051;
  $  039.锁定地面状态2                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x1>>7)&1)) y=@0068;else y=@0069;
  $  040.电机桥状态1                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x2>>0)&1)) y=@006a;else y=@006b;
  $  041.电机桥状态2                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x2>>1)&1)) y=@0064;else y=@0065;
  $  042.无意识状态1                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x2>>6)&1)) y=@0066;else y=@0067;
  $  043.无意识状态2                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x2>>7)&1)) y=@0060;else y=@0061;
  $  044.无意识解锁状态1                                                        $    $  /     $    $  ANS015.BYTE004  $  if(((x3>>0)&1)) y=@0062;else y=@0063;
  $  045.无意识解锁状态2                                                        $    $  /     $    $  ANS015.BYTE004  $  if(((x3>>1)&1)) y=@005c;else y=@005d;
  $  046.不匹配状态1                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x3>>4)&1)) y=@005e;else y=@005f;
  $  047.不匹配状态2                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x3>>5)&1)) y=@0078;else y=@0079;
  $  048.传感器卡在测试/传感器范围                                              $    $  /     $    $  ANS015.BYTE004  $  if(((x4>>0)&1)) y=@007a;else y=@007b;
  $  049.故障/传感器电源故障状态1                                               $    $  /     $    $  ANS015.BYTE004  $  if(((x4>>1)&1)) y=@0074;else y=@0075;
  $  050.传感器卡在测试/传感器范围                                              $    $  /     $    $  ANS015.BYTE004  $  if(((x5>>4)&1)) y=@0076;else y=@0077;
  $  051.故障/传感器电源故障状态2                                               $    $  /     $    $  ANS015.BYTE004  $  if(((x5>>5)&1)) y=@0070;else y=@0071;
  $  052.MDU过载状态1                                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x5>>6)&1)) y=@0072;else y=@0073;
  $  053.MDU过载状态2                                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x5>>7)&1)) y=@006c;else y=@006d;
  $  054.ECU(电子控制器)电源过压状态1                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>0)&1)) y=@006e;else y=@006f;
  $  055.ECU(电子控制器)电源过压状态2                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>1)&1)) y=@0088;else y=@006f;
  $  056.ECU(电子控制器)电源欠压状态1                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>2)&1)) y=@0089;else y=@008a;
  $  057.ECU(电子控制器)电源欠压状态2                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>3)&1)) y=@0084;else y=@0085;
  $  058.E2P故障状态1                                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>4)&1)) y=@0086;else y=@0087;
  $  059.E2P故障状态2                                                           $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>5)&1)) y=@0080;else y=@0081;
  $  060.不可信的请求状态1                                                      $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>6)&1)) y=@0082;else y=@0083;
  $  061.不可信的请求状态2                                                      $    $  /     $    $  ANS015.BYTE004  $  if(((x6>>7)&1)) y=@007c;else y=@007d;
  $  062.认证故障状态1                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>0)&1)) y=@007e;else y=@007f;
  $  063.认证故障状态2                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>1)&1)) y=@0040;else y=@0041;
  $  064.马达控制测试状态1                                                      $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>2)&1)) y=@0042;else y=@0043;
  $  065.马达控制测试状态2                                                      $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>3)&1)) y=@003c;else y=@003d;
  $  066.无指令状态1                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>4)&1)) y=@003e;else y=@003f;
  $  067.无指令状态2                                                            $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>5)&1)) y=@0038;else y=@0039;
  $  068.指令拒绝状态1                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>6)&1)) y=@003a;else y=@003b;
  $  069.指令拒绝状态2                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x7>>7)&1)) y=@0034;else y=@0035;
  $  070.超时解锁状态1                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x8>>0)&1)) y=@0036;else y=@0037;
  $  071.超时解锁状态2                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x8>>1)&1)) y=@004a;else y=@004b;
  $  072.超时锁止状态1                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x8>>2)&1)) y=@004c;else y=@004d;
  $  073.超时锁止状态2                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x8>>3)&1)) y=@0046;else y=@0047;
  $  074.接收故障状态1                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x8>>4)&1)) y=@0048;else y=@0049;
  $  075.接收故障状态2                                                          $    $  /     $    $  ANS015.BYTE004  $  if(((x8>>5)&1)) y=@0044;else y=@0045;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:795 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
