
    车型ID：0aad

    模拟：协议模拟-->0aad

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7CE

进入命令:

  $~  REQ000:7C6 02 10 01 00 00 00 00 00       $~  ANS000:7CE 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7C6 02 3E 00 00 00 00 00 00       $!  ANS000:7CE 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7C6 03 19 02 09 00 00 00 00       $#  ANS000:7CE 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f9000000


  $#  01.读故障码库
  $#  REQ000:7C6 02 19 0A 00 00 00 00 00       $#  ANS000:7CE 02 19 0A 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f9000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7C6 04 14 FF FF FF 00 00 00       $$  ANS000:7CE 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7C6 03 22 F1 12 00 00 00 00       $%  ANS000:7CE 03 22 F1 12 00 00 00 00
  $%  REQ001:7C6 03 22 F1 80 00 00 00 00       $%  ANS001:7CE 03 22 F1 80 00 00 00 00
  $%  REQ002:7C6 03 22 F1 87 00 00 00 00       $%  ANS002:7CE 03 22 F1 87 00 00 00 00
  $%  REQ003:7C6 03 22 F1 8A 00 00 00 00       $%  ANS003:7CE 03 22 F1 8A 00 00 00 00
  $%  REQ004:7C6 03 22 F1 8B 00 00 00 00       $%  ANS004:7CE 03 22 F1 8B 00 00 00 00
  $%  REQ005:7C6 03 22 F1 8C 00 00 00 00       $%  ANS005:7CE 03 22 F1 8C 00 00 00 00
  $%  REQ006:7C6 03 22 F1 90 00 00 00 00       $%  ANS006:7CE 03 22 F1 90 00 00 00 00
  $%  REQ007:7C6 03 22 F1 92 00 00 00 00       $%  ANS007:7CE 03 22 F1 92 00 00 00 00
  $%  REQ008:7C6 03 22 F1 93 00 00 00 00       $%  ANS008:7CE 03 22 F1 93 00 00 00 00
  $%  REQ009:7C6 03 22 F1 94 00 00 00 00       $%  ANS009:7CE 03 22 F1 94 00 00 00 00
  $%  REQ010:7C6 03 22 F1 95 00 00 00 00       $%  ANS010:7CE 03 22 F1 95 00 00 00 00
  $%  REQ011:7C6 03 22 F1 98 00 00 00 00       $%  ANS011:7CE 03 22 F1 98 00 00 00 00
  $%  REQ012:7C6 03 22 F1 99 00 00 00 00       $%  ANS012:7CE 03 22 F1 99 00 00 00 00
  $%  REQ013:7C6 03 22 F1 9D 00 00 00 00       $%  ANS013:7CE 03 22 F1 9D 00 00 00 00

  $%  000:车辆名称:                                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:驱动层软件版本:                              $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:零件号:                                      $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  003:供应商代码:                                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:ECU(电子控制器)生产日期:                     $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  005:ECU(电子控制器)序列号:                       $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  006:车辆识别号(VIN码):                           $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电子控制器)硬件号:                       $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:ECU(电子控制器)硬件版本号:                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:ECU(电子控制器)软件号:                       $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  010:ECU(电子控制器)软件版本号:                   $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  011:ECU(电子控制器)刷写维修店代号或设备号:       $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  012:ECU(电子控制器)刷写日期:                     $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);
  $%  013:ECU(电子控制器)安装日期:                     $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.空调输出信号
  $  00.空调输出信号
  $  REQ000:7C6 03 22 E1 00 00 00 00 00       $  ANS000:7CE 03 22 E1 00 00 00 00 00

  $  000.请求信号开关压缩机离合                 $    $  /        $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@0703;else y=@0704;
  $  001.大气温度传感器合法标记                 $    $  /        $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@0701;else y=@0702;
  $  002.车内温度传感器合法标记                 $    $  /        $    $  ANS000.BYTE004  $  if(((x>>2)&1)) y=@0701;else y=@0702;
  $  003.空调内外循环模式                       $    $  /        $    $  ANS000.BYTE004  $  switxh(x&0x18) 0x00:y=@0700;0x08:y=@02bf;0x10:y=@02c0;0x18:y=@042f;
  $  004.鼓风机是否打开的状态                   $    $  /        $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  005.发送AC(空调)请求方                     $    $  /        $    $  ANS000.BYTE004  $  if(((x>>6)&1)) y=@06fe;else y=@06ff;
  $  006.空气质量传感器工作状态                 $    $  /        $    $  ANS000.BYTE004  $  if(((x>>7)&1)) y=@0001;else y=@0000;
  $  007.大气温度传感器读数                     $    $  degC     $    $  ANS000.BYTE005  $  if(x==0xff) y=@0713;else y=x*0.5-40;
  $  008.鼓风机自动控制状态                     $    $  /        $    $  ANS000.BYTE006  $  if(((x>>0)&1)) y=@02bb;else y=@02bc;
  $  009.出风模式自动控制状态                   $    $  /        $    $  ANS000.BYTE006  $  if(((x>>1)&1)) y=@02bb;else y=@02bc;
  $  010.进风模式自动控制状态                   $    $  /        $    $  ANS000.BYTE006  $  if(((x>>2)&1)) y=@02bb;else y=@02bc;
  $  011.A/C自动控制状态                        $    $  /        $    $  ANS000.BYTE006  $  if(((x>>3)&1)) y=@02bb;else y=@02bc;
  $  012.空气净化器工作模式                     $    $  /        $    $  ANS000.BYTE006  $  switxh((x>>4)&0x07) 0x00:y=@06fc;0x01:y=@00f6;0x02:y=@0585;0x03:y=@06fd;0x07:y=@00be;default:y=@0018;
  $  013.空气净化开关状态                       $    $  /        $    $  ANS000.BYTE007  $  if(((x>>0)&1)) y=@0001;else y=@0000;
  $  014.提示自动开关状态                       $    $  /        $    $  ANS000.BYTE007  $  if(((x>>1)&1)) y=@0001;else y=@0000;
  $  015.提示空调排风档位                       $    $  /        $    $  ANS000.BYTE007  $  switxh(x&0x1C) 0x00:y=@0000;0x04:y=@070c;0x08:y=@070d;0x0C:y=@070e;0x10:y=@070f;0x14:y=@0710;0x18:y=@0711;0x1C:y=@0712;default:y=@0168;
  $  016.提示关闭空调                           $    $  /        $    $  ANS000.BYTE007  $  if(((x>>5)&1)) y=@001c;else y=@001d;
  $  017.空气净化器提示空气质量传感器信息       $    $  /        $    $  ANS000.BYTE007  $  switxh(x&0xc0) 0x00:y=@0700;0x40:y=@00bc;0x80:y=@02fa;0xc0:y=@00bd;
  $  018.提示空调风流通模式                     $    $  /        $    $  ANS000.BYTE008  $  switxh(x&0x07) 0x00:y=@0000;0x01:y=@0705;0x02:y=@0706;0x03:y=@0707;0x04:y=@0708;0x05:y=@0709;default:y=@0168;
  $  019.车左侧区域空调设置温度                 $    $  /        $    $  ANS000.BYTE008  $  if((x>>3)==0x00) y=@0700;else if((x>>3)==0x01) y=@070a;else if(0x01<(x>>3)<0x10) y=x+16;else if((x>>3)==0x10) y=@070b;else y=@0168;
  $  020.车右侧区域空调设置温度                 $    $  /        $    $  ANS000.BYTE009  $  if(x==0x00) y=@0700;else if(x==0x01) y=@070a;else if(0x01<x<0x10) y=x+16;else if(x==0x10) y=@070b;else y=@0168;
  $  021.提示最大除霜控制请求激活               $    $  /        $    $  ANS000.BYTE009  $  if(((x>>5)&1)) y=@001c;else y=@001d;
  $  022.提示双区域控制请求激活                 $    $  /        $    $  ANS000.BYTE009  $  if(((x>>6)&1)) y=@001c;else y=@001d;
  $  023.提示A/C开关状态                        $    $  /        $    $  ANS000.BYTE010  $  if(((x>>4)&1)) y=@0001;else y=@0000;
  $  024.提示最大A/C开关状态                    $    $  /        $    $  ANS000.BYTE010  $  if(((x>>5)&1)) y=@0001;else y=@0000;
  $  025.提示前窗除雾开关状态                   $    $  /        $    $  ANS000.BYTE010  $  if(((x>>6)&1)) y=@0001;else y=@0000;
  $  026.提示后窗除雾开关状态                   $    $  /        $    $  ANS000.BYTE010  $  if(((x>>7)&1)) y=@0001;else y=@0000;

  $)  01.空调输入信号
  $  01.空调输入信号
  $  REQ000:7C6 03 22 E1 01 00 00 00 00       $  ANS000:7CE 03 22 E1 01 00 00 00 00

  $  000.前除霜电机是否激活                                                $    $  /        $    $  ANS000.BYTE004  $  if(((x>>0)&1)) y=@001c;else y=@001d;
  $  001.后除霜电机是否激活                                                $    $  /        $    $  ANS000.BYTE004  $  if(((x>>1)&1)) y=@001c;else y=@001d;
  $  002.ABS(防抱刹车系统)_ESC(电子稳定控制单元)信号提示车速是否有效       $    $  /        $    $  ANS000.BYTE004  $  if(((x>>4)&1)) y=@042f;else y=@0169;
  $  003.EMS(发动机管理系统)信号提示以上引擎冷却剂温度值是否合法           $    $  /        $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@00be;else y=@04a2;
  $  004.EMS(发动机管理系统)引擎转速非法信号                               $    $  /        $    $  ANS000.BYTE004  $  if(((x>>5)&1)) y=@00be;else y=@04a2;
  $  005.发动机状态信息                                                    $    $  /        $    $  ANS000.BYTE005  $  switxh(x&0x07) 0x00:y=@0390;0x01:y=@064c;0x03:y=@0027;default:y=@0018;
  $  006.ABS(防抱刹车系统)_ESC(电子稳定控制单元)信号提示车速               $    $  km/h     $    $  ANS000.BYTE006  $  y=x;
  $  007.EMS(发动机管理系统)信号提示引擎冷却剂温度                         $    $  degC     $    $  ANS000.BYTE007  $  if(x<0xe9) y=x*0.75-36.8;else y=@0714;
  $  008.EMS(发动机管理系统)信号提示引擎转速                               $    $  rpm      $    $  ANS000.BYTE008  $  if(x1==0xff) y=@0714;else y=INT((x1*0x100+x2)*0.25);

  $)  02.ECU(电子控制器)刷写相关数据流
  $  02.ECU(电子控制器)刷写相关数据流
  $  REQ000:7C6 03 22 02 00 00 00 00 00       $  ANS000:7CE 03 22 02 00 00 00 00 00
  $  REQ001:7C6 03 22 02 01 00 00 00 00       $  ANS001:7CE 03 22 02 01 00 00 00 00

  $  000.ECU(电子控制器)成功刷写次数       $    $  /     $    $  ANS000.BYTE004  $  HEX(x);
  $  001.ECU(电子控制器)尝试刷写次数       $    $  /     $    $  ANS001.BYTE004  $  HEX(x);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7C6 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
