0113     $*     P020113 一缸喷油器控制电路开路
0213     $*     P020213 二缸喷油器控制电路开路
0313     $*     P020313 三缸喷油器控制电路开路
0413     $*     P020413 四缸喷油器控制电路开路
1900     $*     P021900 发动机超转速
2129     $*     P022129 电子节气门位置传感器2信号不合理
2216     $*     P022216 电子节气门位置传感器2信号电路电压过低
2317     $*     P022317 电子节气门位置传感器2信号电路电压过高
5317     $*     C1317 角度传感器未进行零位学习
5611     $*     C1611 传感器主信号值超界
5612     $*     C1612 传感器副信号值超界
5613     $*     C1613 传感器主副信号和超界
5614     $*     C1614 扭矩采样超时
5615     $*     C1615 角度传感器故障
5621     $*     C1621 电池电压过高
5622     $*     C1622 电池电压过低
5631     $*     C1631 EEPROM(电子可擦除只读存储器) 通信故障
5641     $*     C1641 车速无效故障
5642     $*     C1642 转速无效故障
5643     $*     C1643 点火信号丢失
5661     $*     C1661 继电器开路
5663     $*     C1663 过电流
5664     $*     C1664 +5VA 电源电压故障
5665     $*     C1665 控制器内部故障
5666     $*     C1666 预驱动短路
5667     $*     C1667 温度过高故障
5668     $*     C1668 温度传感器故障
6111     $*     P026111 一缸喷油器控制电路电压过低
6212     $*     P026212 一缸喷油器控制电路电压过高
6411     $*     P026411 二缸喷油器控制电路电压过低
6512     $*     P026512 二缸喷油器控制电路电压过高
6711     $*     P026711 三缸喷油器控制电路电压过低
6812     $*     P026812 三缸喷油器控制电路电压过高
7011     $*     P027011 四缸喷油器控制电路电压过低
7112     $*     P027112 四缸喷油器控制电路电压过高
d000     $*     U1000 EPS(电动助力转向系统) 报文发送超时故障
d001     $*     U1001 转速超时故障
d002     $*     U1002 车速超时故障
