
    车型ID：e10c

    模拟：协议模拟-->e10c

;******************************************************************************************************************************************************

    通讯线: $~02$~02$~10400

进入命令:

  $~  REQ000:80 AC F1 01 81 9F       $~  ANS000:80 AC F1 01 81 9F

空闲命令:

	$!  REQ001:80 AC F1 01 3E 5C       $!  REQ001:80 AC F1 01 3E 5C 

退出命令:

  $@  REQ000:80 AC F1 01 82 A0       $@  ANS000:80 AC F1 01 82 A0


;******************************************************************************************************************************************************

读取故障码:

  $#  00.读当前故障码
  $#  REQ000:80 AC F1 04 18 00 80 00 B9       $#  ANS000:80 AC F1 04 18 00 80 00 B9

		控制公式：
			y=(x1<<8)+x2; 

  ANS000.BYTE05 控制故障码个数，从$#ANS000.BYTE6$#开始每$#6$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/e1020000_2BYTE


  $#  01.读历史故障码
  $#  REQ000:80 AC F1 04 18 01 80 00 BA       $#  ANS000:80 AC F1 04 18 01 80 00 BA

		控制公式：
			y=(x1<<8)+x2; 

  ANS000.BYTE05 控制故障码个数，从$#ANS000.BYTE6$#开始每$#6$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/e1020000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
  <FUNCTION type="0" num="1">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:80 AC F1 03 14 80 00 B4       $$  ANS000:80 AC F1 03 14 80 00 B4

;******************************************************************************************************************************************************

读数据流: 

  $)  00.特定数据
  $  00.特定数据
  $  REQ000:80 AC F1 04 80 02 21 08 CC       $  ANS000:80 AC F1 04 80 02 21 08 CC

  $  000.电源电压                 $    $  V       $    $  ANS000.BYTE006  $  y=x1*0.019*59/12+0.7;
  $  001.DAB电压储能              $    $  V       $    $  ANS000.BYTE007  $  y=x1*0.019*8;
  $  002.PAB电压储能              $    $  V       $    $  ANS000.BYTE008  $  y=x1*0.019*8;
  $  003.DRPT电压储能             $    $  V       $    $  ANS000.BYTE009  $  y=x1*0.019*8;
  $  004.PRPT电压储能             $    $  V       $    $  ANS000.BYTE010  $  y=x1*0.019*8;
  $  005.DSAB电压储能             $    $  V       $    $  ANS000.BYTE011  $  y=x1*0.019*8;
  $  006.PSAB电压储能             $    $  V       $    $  ANS000.BYTE012  $  y=x1*0.019*8;
  $  007.DCAB电压储能             $    $  V       $    $  ANS000.BYTE013  $  y=x1*0.019*8;
  $  008.PCAB电压储能             $    $  V       $    $  ANS000.BYTE014  $  y=x1*0.019*8;
  $  009.RDSAB电压储能            $    $  V       $    $  ANS000.BYTE015  $  y=x1*0.019*8;
  $  010.RPSAB电压储能            $    $  V       $    $  ANS000.BYTE016  $  y=x1*0.019*8;
  $  011.VAS电压                  $    $  V       $    $  ANS000.BYTE017  $  y=x1*0.0129*5.4;
  $  012.DAB电阻                  $    $  ohm     $    $  ANS000.BYTE018  $  y=x1*10/255;
  $  013.PAB电阻                  $    $  ohm     $    $  ANS000.BYTE019  $  y=x1*10/255;
  $  014.DPT牵拉器电阻            $    $  ohm     $    $  ANS000.BYTE020  $  y=x1*10/255;
  $  015.PPT牵拉器电阻            $    $  ohm     $    $  ANS000.BYTE021  $  y=x1*10/255;
  $  016.DSAB 电阻                $    $  ohm     $    $  ANS000.BYTE022  $  y=x1*10/255;
  $  017.PSAB 电阻                $    $  ohm     $    $  ANS000.BYTE023  $  y=x1*10/255;
  $  018.DCAB 电阻                $    $  ohm     $    $  ANS000.BYTE024  $  y=x1*10/255;
  $  019.PCAB 电阻                $    $  ohm     $    $  ANS000.BYTE025  $  y=x1*10/255;
  $  020.RDSAB 电阻               $    $  ohm     $    $  ANS000.BYTE026  $  y=x1*10/255;
  $  021.RPSAB 电阻               $    $  ohm     $    $  ANS000.BYTE027  $  y=x1*10/255;
  $  022.驾驶员锁扣开关状态       $    $          $    $  ANS000.BYTE028  $  switxh(x1) 0x00: y=@00e3;0x01: y=@00e4;0x02: y=@00dd;0x03: y=@00de;default: y=@0007;
  $  023.乘员锁扣开关状态         $    $          $    $  ANS000.BYTE028  $  switxh(x1) 0x00: y=@00e3;0x04: y=@00e4;0x08: y=@00dd;0x0c: y=@00de;default: y=@0007;
  $  024.乘员气囊关闭状态         $    $          $    $  ANS000.BYTE028  $  switxh(x1) 0x00: y=@00e3;0x10: y=@00e4;0x20: y=@00dd;0x30: y=@00de;default: y=@0007;

  $)  01.前向碰撞数据#1
  $  01.前向碰撞数据#1
  $  REQ000:80 AC F1 04 80 02 21 D0 94       $  ANS000:80 AC F1 04 80 02 21 D0 94

  $  000.驾驶员气囊状态                  $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x01: y=@00e2;0x03: y=@00de;default: y=@0007;
  $  001.乘员气囊状态                    $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x04: y=@00e2;0x0c: y=@00de;default: y=@0007;
  $  002.驾驶员预警器状态                $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x10: y=@00e2;0x30: y=@00de;default: y=@0007;
  $  003.乘员预警器状态                  $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x40: y=@00e2;0xc0: y=@00de;default: y=@0007;
  $  004.驾驶员座椅锁扣状态              $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@00db;0x01: y=@00dc;0x02: y=@00dd;0x03: y=@00de;default: y=@0007;
  $  005.乘员座椅锁扣状态                $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@00db;0x04: y=@00dc;0x08: y=@00dd;0x0c: y=@00de;default: y=@0007;
  $  006.碰撞时刻告警灯状态              $    $       $    $  ANS000.BYTE208  $  if(x1&0x10) y=@00df;else y=@00e0;
  $  007.碰撞输出                        $    $       $    $  ANS000.BYTE208  $  if(x1&0x20) y=@00e8;else y=@00e9;
  $  008.碰撞记录完整状态                $    $       $    $  ANS000.BYTE208  $  if(x1&0x40) y=@00ea;else y=@00eb;
  $  009.驾驶员气囊回路状况              $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x01: y=@008f;0x03: y=@00de;default: y=@0007;
  $  010.乘员气囊回路状况                $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x04: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  011.驾驶员预警器回路状况            $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x10: y=@008f;0x30: y=@00de;default: y=@0007;
  $  012.乘员预警器回路状况              $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x40: y=@008f;0xC0: y=@00de;default: y=@0007;
  $  013.碰撞时刻PADS 状态               $    $       $    $  ANS000.BYTE210  $  switxh(x1) 0x00: y=@00e5;0x01: y=@00e6;0x02: y=@008f;0x03: y=@00de;default: y=@0007;
  $  014.碰撞时刻PADI 状态               $    $       $    $  ANS000.BYTE210  $  switxh(x1) 0x00: y=@00e5;0x04: y=@00e6;0x08: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  015.当告警灯持续亮时,上电次数       $    $       $    $  ANS000.BYTE213  $  y=x1;

  $)  02.前向碰撞数据#2
  $  02.前向碰撞数据#2
  $  REQ000:80 AC F1 04 80 02 21 D1 95       $  ANS000:80 AC F1 04 80 02 21 D1 95

  $  000.驾驶员气囊状态                  $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x01: y=@00e2;0x03: y=@00de;default: y=@0007;
  $  001.乘员气囊状态                    $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x04: y=@00e2;0x0c: y=@00de;default: y=@0007;
  $  002.驾驶员预警器状态                $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x10: y=@00e2;0x30: y=@00de;default: y=@0007;
  $  003.乘员预警器状态                  $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x40: y=@00e2;0xc0: y=@00de;default: y=@0007;
  $  004.驾驶员座椅锁扣状态              $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@00db;0x01: y=@00dc;0x02: y=@00dd;0x03: y=@00de;default: y=@0007;
  $  005.乘员座椅锁扣状态                $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@00db;0x04: y=@00dc;0x08: y=@00dd;0x0c: y=@00de;default: y=@0007;
  $  006.碰撞时刻告警灯状态              $    $       $    $  ANS000.BYTE208  $  if(x1&0x10) y=@00df;else y=@00e0;
  $  007.碰撞输出                        $    $       $    $  ANS000.BYTE208  $  if(x1&0x20) y=@00e8;else y=@00e9;
  $  008.碰撞记录完整状态                $    $       $    $  ANS000.BYTE208  $  if(x1&0x40) y=@00ea;else y=@00eb;
  $  009.驾驶员气囊回路状况              $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x01: y=@008f;0x03: y=@00de;default: y=@0007;
  $  010.乘员气囊回路状况                $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x04: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  011.驾驶员预警器回路状况            $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x10: y=@008f;0x30: y=@00de;default: y=@0007;
  $  012.乘员预警器回路状况              $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x40: y=@008f;0xC0: y=@00de;default: y=@0007;
  $  013.碰撞时刻PADS 状态               $    $       $    $  ANS000.BYTE210  $  switxh(x1) 0x00: y=@00e5;0x01: y=@00e6;0x02: y=@008f;0x03: y=@00de;default: y=@0007;
  $  014.碰撞时刻PADI 状态               $    $       $    $  ANS000.BYTE210  $  switxh(x1) 0x00: y=@00e5;0x04: y=@00e6;0x08: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  015.当告警灯持续亮时,上电次数       $    $       $    $  ANS000.BYTE213  $  y=x1;

  $)  03.前向碰撞数据#3
  $  03.前向碰撞数据#3
  $  REQ000:80 AC F1 04 80 02 21 D2 96       $  ANS000:80 AC F1 04 80 02 21 D2 96

  $  000.驾驶员气囊状态                  $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x01: y=@00e2;0x03: y=@00de;default: y=@0007;
  $  001.乘员气囊状态                    $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x04: y=@00e2;0x0c: y=@00de;default: y=@0007;
  $  002.驾驶员预警器状态                $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x10: y=@00e2;0x30: y=@00de;default: y=@0007;
  $  003.乘员预警器状态                  $    $       $    $  ANS000.BYTE206  $  switxh(x1) 0x00: y=@00e1;0x40: y=@00e2;0xc0: y=@00de;default: y=@0007;
  $  004.驾驶员座椅锁扣状态              $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@00db;0x01: y=@00dc;0x02: y=@00dd;0x03: y=@00de;default: y=@0007;
  $  005.乘员座椅锁扣状态                $    $       $    $  ANS000.BYTE208  $  switxh(x1) 0x00: y=@00db;0x04: y=@00dc;0x08: y=@00dd;0x0c: y=@00de;default: y=@0007;
  $  006.碰撞时刻告警灯状态              $    $       $    $  ANS000.BYTE208  $  if(x1&0x10) y=@00df;else y=@00e0;
  $  007.碰撞输出                        $    $       $    $  ANS000.BYTE208  $  if(x1&0x20) y=@00e8;else y=@00e9;
  $  008.碰撞记录完整状态                $    $       $    $  ANS000.BYTE208  $  if(x1&0x40) y=@00ea;else y=@00eb;
  $  009.驾驶员气囊回路状况              $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x01: y=@008f;0x03: y=@00de;default: y=@0007;
  $  010.乘员气囊回路状况                $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x04: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  011.驾驶员预警器回路状况            $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x10: y=@008f;0x30: y=@00de;default: y=@0007;
  $  012.乘员预警器回路状况              $    $       $    $  ANS000.BYTE209  $  switxh(x1) 0x00: y=@00e7;0x40: y=@008f;0xC0: y=@00de;default: y=@0007;
  $  013.碰撞时刻PADS 状态               $    $       $    $  ANS000.BYTE210  $  switxh(x1) 0x00: y=@00e5;0x01: y=@00e6;0x02: y=@008f;0x03: y=@00de;default: y=@0007;
  $  014.碰撞时刻PADI 状态               $    $       $    $  ANS000.BYTE210  $  switxh(x1) 0x00: y=@00e5;0x04: y=@00e6;0x08: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  015.当告警灯持续亮时,上电次数       $    $       $    $  ANS000.BYTE213  $  y=x1;

  $)  04.驾驶员侧侧向碰撞记录
  $  04.驾驶员侧侧向碰撞记录
  $  REQ000:80 AC F1 04 80 02 21 D3 97       $  ANS000:80 AC F1 04 80 02 21 D3 97

  $  000.驾驶员侧气囊状态               $    $       $    $  ANS000.BYTE106  $  switxh(x1) 0x00: y=@00e1;0x01: y=@00e2;0x03: y=@00de;default: y=@0007;
  $  001.驾驶员帘式气囊状态             $    $       $    $  ANS000.BYTE106  $  switxh(x1) 0x00: y=@00e1;0x04: y=@00e2;0x0c: y=@00de;default: y=@0007;
  $  002.后排驾驶员侧气囊状态           $    $       $    $  ANS000.BYTE106  $  switxh(x1) 0x00: y=@00e1;0x10: y=@00e2;0x30: y=@00de;default: y=@0007;
  $  003.驾驶员座椅锁扣状态             $    $       $    $  ANS000.BYTE107  $  switxh(x1) 0x00: y=@00db;0x01: y=@00dc;0x02: y=@00dd;0x03: y=@00de;default: y=@0007;
  $  004.乘员座椅锁扣状态               $    $       $    $  ANS000.BYTE107  $  switxh(x1) 0x00: y=@00db;0x04: y=@00dc;0x08: y=@00dd;0x0c: y=@00de;default: y=@0007;
  $  005.碰撞时刻告警灯状态             $    $       $    $  ANS000.BYTE107  $  if(x1&0x10) y=@00df;else y=@00e0;
  $  006.碰撞输出                       $    $       $    $  ANS000.BYTE107  $  if(x1&0x20) y=@00e8;else y=@00e9;
  $  007.碰撞记录完整状态               $    $       $    $  ANS000.BYTE107  $  if(x1&0x40) y=@00ea;else y=@00eb;
  $  008.驾驶员侧气囊回路状态           $    $       $    $  ANS000.BYTE110  $  switxh(x1) 0x00: y=@00e7;0x01: y=@008f;0x03: y=@00de;default: y=@0007;
  $  009.驾驶员帘式气囊回路状态         $    $       $    $  ANS000.BYTE110  $  switxh(x1) 0x00: y=@00e7;0x04: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  010.后排驾驶员侧气囊回路状态       $    $       $    $  ANS000.BYTE110  $  switxh(x1) 0x00: y=@00e7;0x10: y=@008f;0x30: y=@00de;default: y=@0007;
  $  011.碰撞时刻PADS 状态              $    $       $    $  ANS000.BYTE111  $  switxh(x1) 0x00: y=@00e5;0x01: y=@00e6;0x02: y=@008f;0x03: y=@00de;default: y=@0007;
  $  012.碰撞时刻PADI 状态              $    $       $    $  ANS000.BYTE111  $  switxh(x1) 0x00: y=@00e5;0x04: y=@00e6;0x08: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  013.驾驶员侧SIS状态                $    $       $    $  ANS000.BYTE112  $  switxh(x1) 0x00: y=@00e7;0x01: y=@008f;0x03: y=@00de;default: y=@0007;
  $  014.乘员侧SIS状态                  $    $       $    $  ANS000.BYTE112  $  switxh(x1) 0x00: y=@00e7;0x04: y=@008f;0x0C: y=@00de;default: y=@0007;
  $  015.后排驾驶员侧SIS状态            $    $       $    $  ANS000.BYTE112  $  switxh(x1) 0x00: y=@00e7;0x10: y=@008f;0x30: y=@00de;default: y=@0007;
  $  016.后排乘员侧SIS状态              $    $       $    $  ANS000.BYTE112  $  switxh(x1) 0x00: y=@00e7;0x40: y=@008f;0xC0: y=@00de;default: y=@0007;

;******************************************************************************************************************************************************

