
     系统名称:ABS (防抱死制动系统)

     系统ID:00004442

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~728,718,748

进入命令:

  $~ REQ000:720 02 10 03 00 00 00 00 00       $~ ANS000:728 02 10 03 00 00 00 00 00
  $~ REQ001:720 03 22 F1 91 00 00 00 00       $~ ANS001:728 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:720 02 3E 00 00 00 00 00 00       $! ANS000:728 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~728,718,748

进入命令:

  $~ REQ000:720 02 10 01 00 00 00 00 00       $~ ANS000:728 02 10 01 00 00 00 00 00
  $~ REQ001:720 03 22 F1 91 00 00 00 00       $~ ANS001:728 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:720 02 3E 00 00 00 00 00 00       $! ANS000:728 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10387409&quot;: &quot;00004442&quot;, &quot;10520086&quot;: &quot;00004443&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10387409&quot;: &quot;00004442&quot;, &quot;10520086&quot;: &quot;00004443&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:720 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/00004442

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 83 00 00 00 00            $%  
  $%  REQ001:720 03 22 F1 87 00 00 00 00            $%  
  $%  REQ002:720 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ003:720 03 22 F1 90 00 00 00 00            $%  
  $%  REQ004:720 03 22 F1 91 00 00 00 00            $%  
  $%  REQ005:720 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ006:720 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ007:720 03 22 F1 A2 00 00 00 00            $%  
  $%  REQ008:720 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ009:720 03 22 F1 A9 00 00 00 00            $%  
  $%  REQ010:720 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ011:720 03 22 F1 00 00 00 00 00            $%  
  $%  REQ012:720 03 22 F1 20 00 00 00 00            $%  
  $%  REQ013:720 03 22 F1 8A 00 00 00 00            $%  
  $%  REQ014:720 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ015:720 03 22 F1 92 00 00 00 00            $%  
  $%  REQ016:720 03 22 F1 94 00 00 00 00            $%  
  $%  REQ017:720 03 22 F1 98 00 00 00 00            $%  
  $%  REQ018:720 03 22 F1 A5 00 00 00 00            $%  

  $%  000:电控单元基础软件参考号                     $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  001:电控单元零件号                             $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  002:电控单元序列号                             $%    $%  ANS002.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  003:车辆识别码(VIN)                            $%    $%  ANS003.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  004:电控单元硬件号                             $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元应用软件号                         $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元标定软件号                         $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  007:电控单元网络参考号                         $%    $%  ANS007.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8); 
  $%  008:车辆特征信息(FK)                           $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  009:电控单元配置文件号                         $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  010:电控单元刷新过程文件号                     $%    $%  ANS010.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  011:ECU软件校验号                              $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 
  $%  012:网络配置文件零件号-网络信息域(出厂)        $%    $%  ANS012.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  013:系统供应商标识号                           $%    $%  ANS013.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  014:电控单元制造日期                           $%    $%  ANS014.BYTE003  $%  HEX(x1,x2,x3); 
  $%  015:供应商电控单元硬件参考号                   $%    $%  ANS015.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  016:电控单元软件参考号                         $%    $%  ANS016.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  017:配置跟踪域                                 $%    $%  ANS017.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 
  $%  018:电控单元索引信息                           $%    $%  ANS018.BYTE003  $%  HEX(x1,x2,x3); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:720 03 22 B0 01 00 00 00 00            $  
  $  REQ001:720 03 22 B0 03 00 00 00 00            $  
  $  REQ002:720 03 22 B0 04 00 00 00 00            $  
  $  REQ003:720 03 22 B0 05 00 00 00 00            $  
  $  REQ004:720 03 22 B0 06 00 00 00 00            $  
  $  REQ005:720 03 22 B0 10 00 00 00 00            $  
  $  REQ006:720 03 22 B0 11 00 00 00 00            $  
  $  REQ007:720 03 22 B0 12 00 00 00 00            $  
  $  REQ008:720 03 22 B0 13 00 00 00 00            $  
  $  REQ009:720 03 22 B0 14 00 00 00 00            $  
  $  REQ010:720 03 22 B0 15 00 00 00 00            $  
  $  REQ011:720 03 22 B0 16 00 00 00 00            $  
  $  REQ012:720 03 22 B0 17 00 00 00 00            $  
  $  REQ013:720 03 22 B0 18 00 00 00 00            $  
  $  REQ014:720 03 22 B0 19 00 00 00 00            $  
  $  REQ015:720 03 22 B0 07 00 00 00 00            $  
  $  REQ016:720 03 22 B0 08 00 00 00 00            $  
  $  REQ017:720 03 22 B0 09 00 00 00 00            $  

  $  000.制动液液位低开关状态                         $    $                   $    $  ANS000.BYTE003  $  switxh(x&0x10)0x10:@0037;0x00:@002e; 
  $  001.自动驻车（AVH）开关状态                      $    $                   $    $  ANS000.BYTE003  $  switxh(x&0x08)0x08:@0037;0x00:@002e; 
  $  002.陡坡缓降控制(HDC)开关状态                    $    $                   $    $  ANS000.BYTE003  $  switxh(x&0x04)0x04:@0037;0x00:@002e; 
  $  003.动态稳定控制系统(SCS)关闭开关状态            $    $                   $    $  ANS000.BYTE003  $  switxh(x&0x02)0x02:@0037;0x00:@002e; 
  $  004.刹车灯开关状态                               $    $                   $    $  ANS000.BYTE003  $  switxh(x&0x01)0x01:@0037;0x00:@002e; 
  $  005.动态稳定控制系统(SCS)失效                    $    $                   $    $  ANS001.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  006.扭矩增加请求(MSR)失效                        $    $                   $    $  ANS001.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  007.牵引力控制系统(TCS)失效                      $    $                   $    $  ANS001.BYTE003  $  switxh(x&0x04)0x04:@0021;0x00:@0022; 
  $  008.防抱死制动系统(ABS)失效                      $    $                   $    $  ANS001.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  009.电子制动力分配系统(EBD)失效                  $    $                   $    $  ANS001.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  010.左前轮速                                     $    $  千米/时          $    $  ANS002.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  011.右前轮速                                     $    $  千米/时          $    $  ANS002.BYTE005  $  y=(x1*256+x2)*0.1; 
  $  012.右后轮速                                     $    $  千米/时          $    $  ANS002.BYTE007  $  y=(x1*256+x2)*0.1; 
  $  013.左后轮速                                     $    $  千米/时          $    $  ANS002.BYTE009  $  y=(x1*256+x2)*0.1; 
  $  014.横向加速                                     $    $  米每二次方秒     $    $  ANS003.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.098;elsey=(x1*256+x2-0xFFFF)*0.098; 
  $  015.纵向加速                                     $    $  米每二次方秒     $    $  ANS003.BYTE005  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.098;elsey=(x1*256+x2-0xFFFF)*0.098; 
  $  016.偏航角速度                                   $    $  度/秒            $    $  ANS003.BYTE007  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00286;elsey=(x1*256+x2-0xFFFF)*0.00286; 
  $  017.主缸压力                                     $    $  巴               $    $  ANS004.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.01;elsey=(x1*256+x2-0xFFFF)*0.01; 
  $  018.真空度                                       $    $  千帕             $    $  ANS004.BYTE005  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  019.有效自学习时间（EWP）                        $    $  秒               $    $  ANS005.BYTE003  $  y=(x1*256+x2)*1; 
  $  020.间接式胎压监测系统（DDS+）故障警告状态       $    $                   $    $  ANS005.BYTE005  $  switxh(x)0x00:@0022;0x01:@0021; 
  $  021.上一次复位时的里程                           $    $  公里             $    $  ANS006.BYTE003  $  y=(x1*65536+x2*256+x3)*1; 
  $  022.倒数第二次复位时的里程                       $    $  公里             $    $  ANS006.BYTE006  $  y=(x1*65536+x2*256+x3)*1; 
  $  023.上一次警告时的里程                           $    $  公里             $    $  ANS007.BYTE003  $  y=(x1*65536+x2*256+x3)*1; 
  $  024.倒数第二次警告时的里程                       $    $  公里             $    $  ANS007.BYTE006  $  y=(x1*65536+x2*256+x3)*1; 
  $  025.报警原因：右后轮缓慢漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  026.报警原因：左后轮缓慢漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  027.报警原因：右前轮缓慢漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  028.报警原因：左前轮缓慢漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  029.报警原因：右后轮穿刺漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  030.报警原因：左后轮穿刺漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  031.报警原因：右前轮穿刺漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  032.报警原因：左前轮穿刺漏气                     $    $                   $    $  ANS008.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  033.第一个阀值220-250km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE003  $  switxh(x&0x20)0x00:@06e5;0x20:@06e6; 
  $  034.第一个阀值190-220km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE003  $  switxh(x&0x10)0x00:@06e5;0x10:@06e6; 
  $  035.第一个阀值160-190km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE003  $  switxh(x&0x08)0x00:@06e5;0x08:@06e6; 
  $  036.第一个阀值120-160km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE003  $  switxh(x&0x04)0x00:@06e5;0x04:@06e6; 
  $  037.第一个阀值40-120km/h速度段的学习状态         $    $                   $    $  ANS009.BYTE003  $  switxh(x&0x02)0x00:@06e5;0x02:@06e6; 
  $  038.第一个阀值15-40km/h速度段的学习状态          $    $                   $    $  ANS009.BYTE003  $  switxh(x&0x01)0x00:@06e5;0x01:@06e6; 
  $  039.第二个阀值220-250km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE004  $  switxh(x&0x20)0x00:@06e5;0x20:@06e6; 
  $  040.第二个阀值190-220km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE004  $  switxh(x&0x10)0x00:@06e5;0x10:@06e6; 
  $  041.第二个阀值160-190km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE004  $  switxh(x&0x08)0x00:@06e5;0x08:@06e6; 
  $  042.第二个阀值120-160km/h速度段的学习状态        $    $                   $    $  ANS009.BYTE004  $  switxh(x&0x04)0x00:@06e5;0x04:@06e6; 
  $  043.第二个阀值40-120km/h速度段的学习状态         $    $                   $    $  ANS009.BYTE004  $  switxh(x&0x02)0x00:@06e5;0x02:@06e6; 
  $  044.第二个阀值15-40km/h速度段的学习状态          $    $                   $    $  ANS009.BYTE004  $  switxh(x&0x01)0x00:@06e5;0x01:@06e6; 
  $  045.左前轮轮胎振动监测(TOM)系统学习状态          $    $  百分比           $    $  ANS010.BYTE003  $  y=(x)*1; 
  $  046.右前轮轮胎振动监测(TOM)系统学习状态          $    $  百分比           $    $  ANS010.BYTE004  $  y=(x)*1; 
  $  047.左后轮轮胎振动监测(TOM)系统学习状态          $    $  百分比           $    $  ANS010.BYTE005  $  y=(x)*1; 
  $  048.右后轮轮胎振动监测(TOM)系统学习状态          $    $  百分比           $    $  ANS010.BYTE006  $  y=(x)*1; 
  $  049.漏气监测系统(DDS)漏气监测                    $    $  百分比           $    $  ANS011.BYTE003  $  y=(x)*1; 
  $  050.综合DDS和TOM所得到左前轮偏差值               $    $  百分比           $    $  ANS012.BYTE003  $  y=((x&0xF0)>>4)*10; 
  $  051.综合DDS和TOM所得到右前轮偏差值               $    $  百分比           $    $  ANS012.BYTE003  $  y=(x&0x0F)*10; 
  $  052.综合DDS和TOM所得到左后轮偏差值               $    $  百分比           $    $  ANS012.BYTE004  $  y=((x&0xF0)>>4)*10; 
  $  053.综合DDS和TOM所得到右后轮偏差值               $    $  百分比           $    $  ANS012.BYTE004  $  y=(x&0x0F)*10; 
  $  054.四个轮胎压力流失偏差                         $    $  百分比           $    $  ANS013.BYTE003  $  y=(x1*256+x2)*1; 
  $  055.后轴压力流失偏差                             $    $  百分比           $    $  ANS013.BYTE005  $  y=(x)*1; 
  $  056.左前轮漏气监测                               $    $  百分比           $    $  ANS014.BYTE003  $  y=(x)*1; 
  $  057.右前轮漏气监测                               $    $  百分比           $    $  ANS014.BYTE004  $  y=(x)*1; 
  $  058.左后轮漏气监测                               $    $  百分比           $    $  ANS014.BYTE005  $  y=(x)*1; 
  $  059.右后轮漏气监测                               $    $  百分比           $    $  ANS014.BYTE006  $  y=(x)*1; 
  $  060.转向角                                       $    $  度               $    $  ANS015.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.04374;elsey=(x1*256+x2-0xFFFF)*0.04374; 
  $  061.电子真空泵(EVP)累计工作时间                  $    $  秒               $    $  ANS016.BYTE003  $  if(0x800000>(x1*0x100*0x100+x2*0x100+x3))y=(x1*0x100*0x100+x2*0x100+x3)*100;elsey=(x1*0x100*0x100+x2*0x100+x3-0xFFFFFF)*100; 
  $  062.电子真空泵(EVP)工作次数                      $    $                   $    $  ANS017.BYTE003  $  if(0x800000>(x1*0x100*0x100+x2*0x100+x3))y=(x1*0x100*0x100+x2*0x100+x3)*1;elsey=(x1*0x100*0x100+x2*0x100+x3-0xFFFFFF)*1; 

;******************************************************************************************************************************************************

