
     系统名称:TCM (波箱控制模块)

     系统ID:000044B8

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 03 00 00 00 00 00       $~ ANS000:7E9 02 10 03 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 01 00 00 00 00 00       $~ ANS000:7E9 02 10 01 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10472701&quot;: &quot;000044B8&quot;, &quot;24276863&quot;: &quot;000044B9&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10472701&quot;: &quot;000044B8&quot;, &quot;24276863&quot;: &quot;000044B9&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E1 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/000044B8

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E1 03 22 F1 87 00 00 00 00            $%  
  $%  REQ002:7E1 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ003:7E1 03 22 F1 91 00 00 00 00            $%  
  $%  REQ004:7E1 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ005:7E1 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ006:7E1 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ007:7E1 03 22 F1 10 00 00 00 00            $%  
  $%  REQ008:7E1 03 22 B3 00 00 00 00 00            $%  
  $%  REQ009:7E1 03 22 B3 01 00 00 00 00            $%  
  $%  REQ010:7E1 03 22 B3 02 00 00 00 00            $%  
  $%  REQ011:7E1 03 22 B3 03 00 00 00 00            $%  
  $%  REQ012:7E1 03 22 B3 04 00 00 00 00            $%  
  $%  REQ013:7E1 03 22 B3 41 00 00 00 00            $%  

  $%  000:车辆识别码(VIN)               $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:电控单元零件号                $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  002:电控单元制造日期              $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3); 
  $%  003:电控单元硬件号                $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元应用软件号            $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元标定软件号            $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元刷新过程文件号        $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  007:刷新工具参考号记录            $%    $%  ANS007.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  008:刷新里程数记录                $%    $%  ANS007.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 
  $%  009:EEPROM数据结构版本            $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4); 
  $%  010:控制器应用软件代码版本        $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3,x4); 
  $%  011:变速箱版本                    $%    $%  ANS010.BYTE003  $%  HEX(x1,x2); 
  $%  012:TC刷新次数                    $%    $%  ANS011.BYTE003  $%  y=(x1*256+x2)*1; 
  $%  013:控制器标定软件版本            $%    $%  ANS012.BYTE003  $%  HEX(x1); 
  $%  014:阀体版本                      $%    $%  ANS013.BYTE003  $%  HEX(x1,x2); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E1 03 22 B5 83 00 00 00 00            $  
  $  REQ001:7E1 03 22 B5 8B 00 00 00 00            $  
  $  REQ002:7E1 03 22 B3 05 00 00 00 00            $  
  $  REQ003:7E1 03 22 B5 84 00 00 00 00            $  
  $  REQ004:7E1 03 22 B4 06 00 00 00 00            $  
  $  REQ005:7E1 03 22 B4 01 00 00 00 00            $  
  $  REQ006:7E1 03 22 B4 C7 00 00 00 00            $  
  $  REQ007:7E1 03 22 B4 C8 00 00 00 00            $  
  $  REQ008:7E1 03 22 B4 C9 00 00 00 00            $  
  $  REQ009:7E1 03 22 B4 CA 00 00 00 00            $  
  $  REQ010:7E1 03 22 B4 2B 00 00 00 00            $  
  $  REQ011:7E1 03 22 B4 CC 00 00 00 00            $  
  $  REQ012:7E1 03 22 B4 CB 00 00 00 00            $  
  $  REQ013:7E1 03 22 E4 00 00 00 00 00            $  
  $  REQ014:7E1 03 22 E4 01 00 00 00 00            $  
  $  REQ015:7E1 03 22 E4 02 00 00 00 00            $  
  $  REQ016:7E1 03 22 E4 03 00 00 00 00            $  
  $  REQ017:7E1 03 22 E4 04 00 00 00 00            $  
  $  REQ018:7E1 03 22 B4 23 00 00 00 00            $  
  $  REQ019:7E1 03 22 B4 24 00 00 00 00            $  
  $  REQ020:7E1 03 22 B4 25 00 00 00 00            $  
  $  REQ021:7E1 03 22 B4 26 00 00 00 00            $  
  $  REQ022:7E1 03 22 B4 27 00 00 00 00            $  
  $  REQ023:7E1 03 22 B4 28 00 00 00 00            $  
  $  REQ024:7E1 03 22 B4 29 00 00 00 00            $  
  $  REQ025:7E1 03 22 B4 2A 00 00 00 00            $  
  $  REQ026:7E1 03 22 B4 2C 00 00 00 00            $  
  $  REQ027:7E1 03 22 B4 2D 00 00 00 00            $  
  $  REQ028:7E1 03 22 B5 8D 00 00 00 00            $  
  $  REQ029:7E1 03 22 B4 46 00 00 00 00            $  
  $  REQ030:7E1 03 22 B4 45 00 00 00 00            $  
  $  REQ031:7E1 03 22 B5 88 00 00 00 00            $  
  $  REQ032:7E1 03 22 B5 8A 00 00 00 00            $  
  $  REQ033:7E1 03 22 B4 90 00 00 00 00            $  
  $  REQ034:7E1 03 22 B4 32 00 00 00 00            $  
  $  REQ035:7E1 03 22 B4 33 00 00 00 00            $  
  $  REQ036:7E1 03 22 B4 34 00 00 00 00            $  
  $  REQ037:7E1 03 22 B6 0E 00 00 00 00            $  
  $  REQ038:7E1 03 22 B4 CD 00 00 00 00            $  
  $  REQ039:7E1 03 22 B6 0F 00 00 00 00            $  
  $  REQ040:7E1 03 22 B4 37 00 00 00 00            $  
  $  REQ041:7E1 03 22 B4 38 00 00 00 00            $  
  $  REQ042:7E1 03 22 B6 1B 00 00 00 00            $  
  $  REQ043:7E1 03 22 B4 39 00 00 00 00            $  
  $  REQ044:7E1 03 22 B4 3A 00 00 00 00            $  
  $  REQ045:7E1 03 22 B4 9B 00 00 00 00            $  
  $  REQ046:7E1 03 22 B4 3B 00 00 00 00            $  
  $  REQ047:7E1 03 22 B6 1D 00 00 00 00            $  
  $  REQ048:7E1 03 22 B6 1E 00 00 00 00            $  
  $  REQ049:7E1 03 22 B4 A0 00 00 00 00            $  
  $  REQ050:7E1 03 22 B6 1F 00 00 00 00            $  
  $  REQ051:7E1 03 22 B4 3C 00 00 00 00            $  
  $  REQ052:7E1 03 22 B4 3E 00 00 00 00            $  
  $  REQ053:7E1 03 22 B4 41 00 00 00 00            $  
  $  REQ054:7E1 03 22 B4 86 00 00 00 00            $  
  $  REQ055:7E1 03 22 B4 D6 00 00 00 00            $  
  $  REQ056:7E1 03 22 B4 C6 00 00 00 00            $  
  $  REQ057:7E1 03 22 B4 43 00 00 00 00            $  
  $  REQ058:7E1 03 22 B4 C5 00 00 00 00            $  
  $  REQ059:7E1 03 22 B6 26 00 00 00 00            $  
  $  REQ060:7E1 03 22 B4 4B 00 00 00 00            $  
  $  REQ061:7E1 03 22 B4 4A 00 00 00 00            $  
  $  REQ062:7E1 03 22 B4 40 00 00 00 00            $  
  $  REQ063:7E1 03 22 B4 4D 00 00 00 00            $  
  $  REQ064:7E1 03 22 B4 4C 00 00 00 00            $  
  $  REQ065:7E1 03 22 B4 8A 00 00 00 00            $  
  $  REQ066:7E1 03 22 B4 42 00 00 00 00            $  

  $  000.指令档位                                 $    $              $    $  ANS000.BYTE003  $  switxh(x&0x0F)0x00:@038c;0x01:@0044;0x02:@0045;0x03:@0046;0x04:@0047;0x05:@0067;0x06:@0068;0x07:@0069;0x08:@04fa;0x0D:@097d;0x0E:@04cd;0x0F:@0250; 
  $  001.换挡方向                                 $    $              $    $  ANS001.BYTE003  $  switxh(x&0x03)0x00:@0ac3;0x01:@0ac4;0x02:@0ac5; 
  $  002.SubROM禁止可读标志                       $    $              $    $  ANS002.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  003.目标档位                                 $    $              $    $  ANS003.BYTE003  $  switxh(x&0x0F)0x00:@038c;0x01:@0044;0x02:@0045;0x03:@0046;0x04:@0047;0x05:@0067;0x06:@0068;0x07:@0069;0x08:@04fa; 
  $  004.油液温度传感器电压值                     $    $  伏          $    $  ANS004.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  005.电池电压                                 $    $  伏特        $    $  ANS005.BYTE003  $  y=(x)*0.1; 
  $  006.9伏供电1电压                             $    $  伏          $    $  ANS006.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  007.9伏供电2电压                             $    $  伏          $    $  ANS007.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  008.5伏供电1电压                             $    $  伏          $    $  ANS008.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  009.5伏供电2电压                             $    $  伏          $    $  ANS009.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  010.从动轮转速方向                           $    $              $    $  ANS010.BYTE003  $  switxh(x)0x00:@0d07;0x01:@074d;0x02:@074e;0x03:@0070; 
  $  011.点火开关Acc附件电压                      $    $  伏          $    $  ANS011.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  012.点火开关KL15电压                         $    $  伏          $    $  ANS012.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  013.液力变矩器离合器调压电磁阀目标电流       $    $  安培        $    $  ANS013.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  014.离合器调压电磁阀目标电流                 $    $  毫安        $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  015.主油路调压电磁阀目标电流                 $    $  毫安        $    $  ANS015.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  016.主动油缸调压电磁阀目标电流               $    $  毫安        $    $  ANS016.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  017.从动油缸调压电磁阀目标电流               $    $  毫安        $    $  ANS017.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  018.油温                                     $    $  摄氏度      $    $  ANS018.BYTE003  $  y=(x)*1-40; 
  $  019.主动带轮转速                             $    $  转/分钟     $    $  ANS019.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  020.从动带轮转速                             $    $  转/分钟     $    $  ANS020.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  021.涡轮转速                                 $    $  转/分钟     $    $  ANS021.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  022.主动油缸压力                             $    $  巴          $    $  ANS022.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  023.从动油缸压力                             $    $  巴          $    $  ANS023.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  024.换挡杆1脉宽                              $    $  %           $    $  ANS024.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  025.换挡杆2脉宽                              $    $  %           $    $  ANS025.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  026.主动油缸压力电压值                       $    $  伏          $    $  ANS026.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  027.从动油缸压力电压值                       $    $  伏          $    $  ANS027.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  028.启动允许状态                             $    $              $    $  ANS028.BYTE003  $  switxh(x&0x01)0x00:@0acf;0x01:@030a; 
  $  029.曲轴即刻扭矩请求                         $    $  牛米        $    $  ANS029.BYTE003  $  y=(x)*1-10; 
  $  030.曲轴预先扭矩请求                         $    $  牛米        $    $  ANS030.BYTE003  $  y=(x)*1-10; 
  $  031.换挡杆位置                               $    $              $    $  ANS031.BYTE003  $  switxh(x&0x0F)0x00:@024f;0x01:@0250;0x02:@0048;0x03:@007c;0x04:@0044;0x05:@0045;0x06:@0046;0x07:@0047;0x08:@0067;0x09:@0068;0x0A:@0069;0x0B:@04fa;0x0F:@04a7; 
  $  032.换挡拨动开关模式                         $    $              $    $  ANS032.BYTE003  $  switxh(x&0x03)0x00:@0775;0x01:@096b;0x02:@096c; 
  $  033.输入扭矩计算值                           $    $  牛米        $    $  ANS033.BYTE003  $  y=(x)*1.6-100; 
  $  034.离合器调压目标压力                       $    $  巴          $    $  ANS034.BYTE003  $  y=(x)*0.04; 
  $  035.前进挡离合器滑磨功                       $    $  千焦        $    $  ANS035.BYTE003  $  y=(x)*0.1; 
  $  036.倒退挡离合器滑磨功                       $    $  千焦        $    $  ANS036.BYTE003  $  y=(x)*0.1; 
  $  037.车辆倾斜角度                             $    $  %           $    $  ANS037.BYTE003  $  if(0x80>x)y=(x)*1;elsey=(x-0xFF)*1; 
  $  038.主动带轮目标转速                         $    $  转/分钟     $    $  ANS038.BYTE003  $  y=(x1*256+x2)*1; 
  $  039.发动机扭矩限制请求                       $    $  牛米        $    $  ANS039.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*1;elsey=(x1*256+x2-0xFFFF)*1; 
  $  040.主油路目标压力                           $    $  巴          $    $  ANS040.BYTE003  $  y=(x)*0.2; 
  $  041.主动油缸目标压力                         $    $  巴          $    $  ANS041.BYTE003  $  y=(x)*0.2; 
  $  042.实际档位                                 $    $              $    $  ANS042.BYTE003  $  switxh(x)0x00:@038c;0x01:@0044;0x02:@0045;0x03:@0046;0x04:@0047;0x05:@0067;0x06:@0068;0x07:@0069;0x08:@04fa; 
  $  043.实际速比                                 $    $              $    $  ANS043.BYTE003  $  y=(x)*0.0117647058823529; 
  $  044.目标速比                                 $    $              $    $  ANS044.BYTE003  $  y=(x)*0.01+0.2; 
  $  045.主缸输入转矩计算值                       $    $  牛米        $    $  ANS045.BYTE003  $  y=(x)*1; 
  $  046.从动油缸目标压力                         $    $  巴          $    $  ANS046.BYTE003  $  y=(x)*0.2; 
  $  047.变矩器锁止离合器扭矩请求                 $    $  牛米        $    $  ANS047.BYTE003  $  y=(x)*2; 
  $  048.变矩器发动机扭矩限制请求                 $    $  牛米        $    $  ANS048.BYTE003  $  y=(x1*256+x2)*1; 
  $  049.变矩器涡轮扭矩请求                       $    $  牛米        $    $  ANS049.BYTE003  $  y=(x)*1; 
  $  050.传递扭矩负载                             $    $  牛米        $    $  ANS050.BYTE003  $  y=(x)*1; 
  $  051.锁止离合器滑磨功                         $    $  千焦        $    $  ANS051.BYTE003  $  y=(x)*0.1; 
  $  052.液力变矩器离合器目标压力                 $    $  巴          $    $  ANS052.BYTE003  $  y=(x)*0.04-3; 
  $  053.油门踏板位置                             $    $  百分比      $    $  ANS053.BYTE003  $  y=(x)*0.4; 
  $  054.节气门实际位置                           $    $  %           $    $  ANS054.BYTE003  $  y=(x)*1; 
  $  055.发动机冷却液温度                         $    $  摄氏度      $    $  ANS055.BYTE003  $  y=(x)*1-40; 
  $  056.发动机进气温度                           $    $  摄氏度      $    $  ANS056.BYTE003  $  y=(x)*1-40; 
  $  057.发动机实际静态扭矩                       $    $  牛米        $    $  ANS057.BYTE003  $  y=(x)*1-500; 
  $  058.大气压力                                 $    $  千帕        $    $  ANS058.BYTE003  $  y=(x)*1; 
  $  059.制动踏板制动压力                         $    $  千帕        $    $  ANS059.BYTE003  $  y=(x1*256+x2)*1; 
  $  060.左前轮速                                 $    $  千米/时     $    $  ANS060.BYTE003  $  y=(x)*1; 
  $  061.右前轮速                                 $    $  千米/时     $    $  ANS061.BYTE003  $  y=(x)*1; 
  $  062.车速                                     $    $  千米/时     $    $  ANS062.BYTE003  $  y=(x)*1; 
  $  063.左后轮速                                 $    $  千米/时     $    $  ANS063.BYTE003  $  y=(x)*1; 
  $  064.右后轮速                                 $    $  千米/时     $    $  ANS064.BYTE003  $  y=(x)*1; 
  $  065.车辆加速度                               $    $  米/秒^2     $    $  ANS065.BYTE003  $  if(0x80>x)y=(x)*0.1;elsey=(x-0xFF)*0.1; 
  $  066.发动机转速                               $    $  转/分       $    $  ANS066.BYTE003  $  y=(x1*256+x2)*0.2; 

;******************************************************************************************************************************************************

