
     系统名称:TCM (波箱控制模块)

     系统ID:000044B9

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 03 00 00 00 00 00       $~ ANS000:7E9 02 10 03 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 01 00 00 00 00 00       $~ ANS000:7E9 02 10 01 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10472701&quot;: &quot;000044B8&quot;, &quot;24276863&quot;: &quot;000044B9&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10472701&quot;: &quot;000044B8&quot;, &quot;24276863&quot;: &quot;000044B9&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E1 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/000044B9

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E1 03 22 F1 87 00 00 00 00            $%  
  $%  REQ002:7E1 03 22 F1 91 00 00 00 00            $%  
  $%  REQ003:7E1 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ004:7E1 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ005:7E1 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ006:7E1 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ007:7E1 03 22 F1 A9 00 00 00 00            $%  
  $%  REQ008:7E1 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ009:7E1 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ010:7E1 03 22 F1 10 00 00 00 00            $%  

  $%  000:车辆识别代码(VIN)             $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:电控单元零件号                $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  002:电控单元硬件号                $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元应用软件号            $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元标定软件号            $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元序列号                $%    $%  ANS005.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  006:电控单元制造日期              $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:电控单元配置文件号            $%    $%  ANS007.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  008:电控单元索引信息              $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3); 
  $%  009:电控单元刷新过程文件号        $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  010:刷新工具参考号记录            $%    $%  ANS010.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  011:刷新里程数记录                $%    $%  ANS010.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E1 03 22 28 10 00 00 00 00            $  
  $  REQ001:7E1 03 22 F1 3D 00 00 00 00            $  
  $  REQ002:7E1 03 22 36 32 00 00 00 00            $  
  $  REQ003:7E1 03 22 28 B9 00 00 00 00            $  
  $  REQ004:7E1 03 22 28 E7 00 00 00 00            $  
  $  REQ005:7E1 03 22 11 24 00 00 00 00            $  
  $  REQ006:7E1 03 22 F1 3B 00 00 00 00            $  
  $  REQ007:7E1 03 22 F1 3C 00 00 00 00            $  
  $  REQ008:7E1 03 22 34 A6 00 00 00 00            $  
  $  REQ009:7E1 03 22 34 A7 00 00 00 00            $  
  $  REQ010:7E1 03 22 14 21 00 00 00 00            $  
  $  REQ011:7E1 03 22 34 A8 00 00 00 00            $  
  $  REQ012:7E1 03 22 23 A9 00 00 00 00            $  
  $  REQ013:7E1 03 22 23 E8 00 00 00 00            $  
  $  REQ014:7E1 03 22 23 E4 00 00 00 00            $  
  $  REQ015:7E1 03 22 23 EA 00 00 00 00            $  
  $  REQ016:7E1 03 22 23 E6 00 00 00 00            $  
  $  REQ017:7E1 03 22 23 E2 00 00 00 00            $  
  $  REQ018:7E1 03 22 3D 45 00 00 00 00            $  
  $  REQ019:7E1 03 22 34 A9 00 00 00 00            $  
  $  REQ020:7E1 03 22 23 AA 00 00 00 00            $  
  $  REQ021:7E1 03 22 23 E9 00 00 00 00            $  
  $  REQ022:7E1 03 22 23 E5 00 00 00 00            $  
  $  REQ023:7E1 03 22 23 EB 00 00 00 00            $  
  $  REQ024:7E1 03 22 23 E7 00 00 00 00            $  
  $  REQ025:7E1 03 22 23 E3 00 00 00 00            $  
  $  REQ026:7E1 03 22 33 CE 00 00 00 00            $  
  $  REQ027:7E1 03 22 33 BB 00 00 00 00            $  
  $  REQ028:7E1 03 22 23 AB 00 00 00 00            $  
  $  REQ029:7E1 03 22 1A 2D 00 00 00 00            $  
  $  REQ030:7E1 03 22 23 C8 00 00 00 00            $  
  $  REQ031:7E1 03 22 D2 AB 00 00 00 00            $  
  $  REQ032:7E1 03 22 D2 A7 00 00 00 00            $  
  $  REQ033:7E1 03 22 23 CA 00 00 00 00            $  
  $  REQ034:7E1 03 22 23 CB 00 00 00 00            $  
  $  REQ035:7E1 03 22 23 DA 00 00 00 00            $  
  $  REQ036:7E1 03 22 23 DB 00 00 00 00            $  
  $  REQ037:7E1 03 22 D2 AA 00 00 00 00            $  
  $  REQ038:7E1 03 22 01 0C 00 00 00 00            $  
  $  REQ039:7E1 03 22 E1 01 00 00 00 00            $  
  $  REQ040:7E1 03 22 33 CD 00 00 00 00            $  
  $  REQ041:7E1 03 22 33 C3 00 00 00 00            $  
  $  REQ042:7E1 03 22 33 C8 00 00 00 00            $  
  $  REQ043:7E1 03 22 33 C4 00 00 00 00            $  
  $  REQ044:7E1 03 22 33 C9 00 00 00 00            $  
  $  REQ045:7E1 03 22 33 C5 00 00 00 00            $  
  $  REQ046:7E1 03 22 33 CA 00 00 00 00            $  
  $  REQ047:7E1 03 22 33 C6 00 00 00 00            $  
  $  REQ048:7E1 03 22 33 CB 00 00 00 00            $  
  $  REQ049:7E1 03 22 33 C7 00 00 00 00            $  
  $  REQ050:7E1 03 22 33 CC 00 00 00 00            $  
  $  REQ051:7E1 03 22 23 C7 00 00 00 00            $  
  $  REQ052:7E1 03 22 29 33 00 00 00 00            $  
  $  REQ053:7E1 03 22 23 EC 00 00 00 00            $  
  $  REQ054:7E1 03 22 23 ED 00 00 00 00            $  
  $  REQ055:7E1 03 22 33 C1 00 00 00 00            $  
  $  REQ056:7E1 03 22 33 C2 00 00 00 00            $  
  $  REQ057:7E1 03 22 D2 A6 00 00 00 00            $  
  $  REQ058:7E1 03 22 D2 A8 00 00 00 00            $  
  $  REQ059:7E1 03 22 D2 AD 00 00 00 00            $  
  $  REQ060:7E1 03 22 28 04 00 00 00 00            $  
  $  REQ061:7E1 03 22 28 05 00 00 00 00            $  
  $  REQ062:7E1 03 22 23 AE 00 00 00 00            $  
  $  REQ063:7E1 03 22 23 CC 00 00 00 00            $  
  $  REQ064:7E1 03 22 23 D4 00 00 00 00            $  
  $  REQ065:7E1 03 22 23 D0 00 00 00 00            $  
  $  REQ066:7E1 03 22 23 CD 00 00 00 00            $  
  $  REQ067:7E1 03 22 23 D5 00 00 00 00            $  
  $  REQ068:7E1 03 22 23 D1 00 00 00 00            $  
  $  REQ069:7E1 03 22 23 CE 00 00 00 00            $  
  $  REQ070:7E1 03 22 23 D6 00 00 00 00            $  
  $  REQ071:7E1 03 22 23 D2 00 00 00 00            $  
  $  REQ072:7E1 03 22 23 CF 00 00 00 00            $  
  $  REQ073:7E1 03 22 23 D7 00 00 00 00            $  
  $  REQ074:7E1 03 22 23 D3 00 00 00 00            $  
  $  REQ075:7E1 03 22 F1 3A 00 00 00 00            $  
  $  REQ076:7E1 03 22 D2 AC 00 00 00 00            $  
  $  REQ077:7E1 03 22 33 9E 00 00 00 00            $  
  $  REQ078:7E1 03 22 33 80 00 00 00 00            $  
  $  REQ079:7E1 03 22 33 9F 00 00 00 00            $  
  $  REQ080:7E1 03 22 33 81 00 00 00 00            $  
  $  REQ081:7E1 03 22 33 A0 00 00 00 00            $  
  $  REQ082:7E1 03 22 33 82 00 00 00 00            $  
  $  REQ083:7E1 03 22 33 A1 00 00 00 00            $  
  $  REQ084:7E1 03 22 33 83 00 00 00 00            $  
  $  REQ085:7E1 03 22 33 A2 00 00 00 00            $  
  $  REQ086:7E1 03 22 33 84 00 00 00 00            $  
  $  REQ087:7E1 03 22 33 A3 00 00 00 00            $  
  $  REQ088:7E1 03 22 33 85 00 00 00 00            $  
  $  REQ089:7E1 03 22 33 A4 00 00 00 00            $  
  $  REQ090:7E1 03 22 33 86 00 00 00 00            $  
  $  REQ091:7E1 03 22 33 A5 00 00 00 00            $  
  $  REQ092:7E1 03 22 33 87 00 00 00 00            $  
  $  REQ093:7E1 03 22 33 A6 00 00 00 00            $  
  $  REQ094:7E1 03 22 20 7E 00 00 00 00            $  
  $  REQ095:7E1 03 22 01 12 00 00 00 00            $  
  $  REQ096:7E1 03 22 D2 A9 00 00 00 00            $  
  $  REQ097:7E1 03 22 27 FF 00 00 00 00            $  
  $  REQ098:7E1 03 22 3D 30 00 00 00 00            $  
  $  REQ099:7E1 03 22 19 9A 00 00 00 00            $  
  $  REQ100:7E1 03 22 19 7E 00 00 00 00            $  
  $  REQ101:7E1 03 22 33 B2 00 00 00 00            $  
  $  REQ102:7E1 03 22 19 40 00 00 00 00            $  
  $  REQ103:7E1 03 22 19 4F 00 00 00 00            $  
  $  REQ104:7E1 03 22 28 88 00 00 00 00            $  
  $  REQ105:7E1 03 22 28 61 00 00 00 00            $  

  $  000.油门踏板位置                                   $    $  百分比      $    $  ANS000.BYTE003  $  y=(x)*0.390625; 
  $  001.蓄能器预充压力自学习结果                       $    $              $    $  ANS001.BYTE003  $  switxh(x&0xC0)0x00:@01c2;0x40:@008c;0xC0:@008d; 
  $  002.变速器液压油泵继电器控制状态                   $    $              $    $  ANS002.BYTE003  $  switxh(x&0xC0)0x00:@0037;0x40:@0072;0xC0:@0952; 
  $  003.变速器液压油电机实际转速                       $    $  转/分       $    $  ANS003.BYTE003  $  y=(x1*256+x2)*3-30000; 
  $  004.变速器液压油电机期望转速                       $    $  转/分       $    $  ANS004.BYTE003  $  y=(x1*256+x2)*3-30000; 
  $  005.制动踏板开关信号                               $    $              $    $  ANS005.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  006.奇数挡离合器脱开位置学习状态                   $    $              $    $  ANS006.BYTE003  $  switxh(x&0xC0)0x00:@01c2;0x40:@008c;0xC0:@008d; 
  $  007.奇数挡离合器流量点学习状态                     $    $              $    $  ANS006.BYTE004  $  switxh(x&0x30)0x00:@01c2;0x10:@008c;0x30:@008d; 
  $  008.奇数挡离合器流量电磁阀零点学习状态             $    $              $    $  ANS006.BYTE003  $  switxh(x&0x03)0x00:@01c2;0x01:@008c;0x03:@008d; 
  $  009.奇数挡离合器咬合点位置学习状态                 $    $              $    $  ANS006.BYTE003  $  switxh(x&0x30)0x00:@01c2;0x10:@008c;0x30:@008d; 
  $  010.奇数挡离合器啮合点位置学习值                   $    $  毫米        $    $  ANS006.BYTE006  $  y=(x)*0.0784; 
  $  011.奇数挡离合器压力位置对应图学习状态             $    $              $    $  ANS006.BYTE004  $  switxh(x&0xC0)0x00:@01c2;0x40:@008c;0xC0:@008d; 
  $  012.奇数挡离合器啮合点位置学习状态                 $    $              $    $  ANS006.BYTE003  $  switxh(x&0x0C)0x00:@01c2;0x04:@008c;0x0C:@008d; 
  $  013.奇数挡离合器咬合点位置学习值                   $    $  毫米        $    $  ANS006.BYTE007  $  y=(x)*0.0784; 
  $  014.偶数挡离合器脱开位置学习状态                   $    $              $    $  ANS007.BYTE003  $  switxh(x&0xC0)0x00:@01c2;0x40:@008c;0xC0:@008d; 
  $  015.偶数挡离合器流量点学习状态                     $    $              $    $  ANS007.BYTE004  $  switxh(x&0x30)0x00:@01c2;0x10:@008c;0x30:@008d; 
  $  016.偶数挡离合器流量电磁阀零点学习状态             $    $              $    $  ANS007.BYTE003  $  switxh(x&0x03)0x00:@01c2;0x01:@008c;0x03:@008d; 
  $  017.偶数挡离合器咬合点位置学习状态                 $    $              $    $  ANS007.BYTE003  $  switxh(x&0x30)0x00:@01c2;0x10:@008c;0x30:@008d; 
  $  018.偶数挡离合器啮合点位置学习值                   $    $  毫米        $    $  ANS007.BYTE006  $  y=(x)*0.0784; 
  $  019.偶数挡离合器压力位置对应图学习状态             $    $              $    $  ANS007.BYTE004  $  switxh(x&0xC0)0x00:@01c2;0x40:@008c;0xC0:@008d; 
  $  020.偶数挡离合器啮合点位置学习状态                 $    $              $    $  ANS007.BYTE003  $  switxh(x&0x0C)0x00:@01c2;0x04:@008c;0x0C:@008d; 
  $  021.偶数挡离合器咬合点位置学习值                   $    $  毫米        $    $  ANS007.BYTE007  $  y=(x)*0.0784; 
  $  022.奇数挡离合器期望位置                           $    $  毫米        $    $  ANS008.BYTE003  $  y=(x)*0.0784313725490196; 
  $  023.偶数挡离合器期望位置                           $    $  毫米        $    $  ANS009.BYTE003  $  y=(x)*0.0784313725490196; 
  $  024.发动机转速                                     $    $  转/分       $    $  ANS010.BYTE003  $  y=(x1*256+x2)*1; 
  $  025.奇数挡离合器期望状态                           $    $              $    $  ANS011.BYTE003  $  switxh(x)0x00:@0212;0x01:@0208; 
  $  026.奇数挡离合器期望扭矩                           $    $  牛米        $    $  ANS012.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  027.奇数挡离合器啮合点位置学习值                   $    $  毫米        $    $  ANS013.BYTE003  $  y=(x)*0.0784; 
  $  028.奇数挡离合器位置传感器占空比                   $    $  百分比      $    $  ANS014.BYTE003  $  y=(x)*0.392156862745098; 
  $  029.奇数挡离合器位置状态                           $    $              $    $  ANS015.BYTE003  $  switxh(x)0x00:@0212;0x01:@0238;0x02:@0208;0x03:@01b6;0x04:@01b1; 
  $  030.奇数挡离合器位置                               $    $  毫米        $    $  ANS016.BYTE003  $  if(0x80>x)y=(x)*0.15625;elsey=(x-0xFF)*0.15625; 
  $  031.奇数挡离合器滑动转速                           $    $  转/分       $    $  ANS017.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.125;elsey=(x1*256+x2-0xFFFF)*0.125; 
  $  032.奇数挡离合器扭矩                               $    $  牛米        $    $  ANS018.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  033.偶数挡离合器期望状态                           $    $              $    $  ANS019.BYTE003  $  switxh(x)0x00:@0212;0x01:@0208; 
  $  034.偶数挡离合器期望扭矩                           $    $  牛米        $    $  ANS020.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  035.偶数挡离合器啮合点位置学习值                   $    $  毫米        $    $  ANS021.BYTE003  $  y=(x)*0.0784; 
  $  036.偶数挡离合器位置传感器占空比                   $    $  百分比      $    $  ANS022.BYTE003  $  y=(x)*0.392156862745098; 
  $  037.偶数挡离合器位置状态                           $    $              $    $  ANS023.BYTE003  $  switxh(x)0x00:@0212;0x01:@0238;0x02:@0208;0x03:@01b6;0x04:@01b1; 
  $  038.偶数挡离合器位置                               $    $  毫米        $    $  ANS024.BYTE003  $  if(0x80>x)y=(x)*0.15625;elsey=(x-0xFF)*0.15625; 
  $  039.偶数挡离合器滑动转速                           $    $  转/分       $    $  ANS025.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.125;elsey=(x1*256+x2-0xFFFF)*0.125; 
  $  040.偶数挡离合器扭矩                               $    $  牛米        $    $  ANS018.BYTE005  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  041.奇数挡离合器估算温度                           $    $  摄氏度      $    $  ANS026.BYTE003  $  y=(x)*4-40; 
  $  042.偶数挡离合器估算温度                           $    $  摄氏度      $    $  ANS027.BYTE003  $  y=(x)*4-40; 
  $  043.双离合器控制状态                               $    $              $    $  ANS028.BYTE003  $  switxh(x)0x00:@0bd2;0x01:@0bd3;0x02:@0bd4; 
  $  044.发动机扭矩                                     $    $  牛顿*米     $    $  ANS029.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  045.偶数挡输入轴转速                               $    $  转/分       $    $  ANS030.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  046.挂5挡失败次数                                  $    $  次          $    $  ANS031.BYTE003  $  y=(x1*256+x2)*1; 
  $  047.挂1挡失败次数                                  $    $  次          $    $  ANS032.BYTE003  $  y=(x1*256+x2)*1; 
  $  048.奇数挡离合器流量控制电磁阀(S3)期望流量         $    $  升/分钟     $    $  ANS033.BYTE003  $  if(0x80>x)y=(x)*0.046875;elsey=(x-0xFF)*0.046875; 
  $  049.偶数挡离合器流量控制电磁阀(S4)期望流量         $    $  升/分钟     $    $  ANS034.BYTE003  $  if(0x80>x)y=(x)*0.046875;elsey=(x-0xFF)*0.046875; 
  $  050.奇数挡换挡拨叉流量控制电磁阀(S7)期望流量       $    $  升/分钟     $    $  ANS035.BYTE003  $  if(0x80>x)y=(x)*0.046875;elsey=(x-0xFF)*0.046875; 
  $  051.偶数挡换挡拨叉流量控制电磁阀(S8)期望流量       $    $  升/分钟     $    $  ANS036.BYTE003  $  if(0x80>x)y=(x)*0.046875;elsey=(x-0xFF)*0.046875; 
  $  052.挂4挡失败次数                                  $    $  次          $    $  ANS037.BYTE003  $  y=(x1*256+x2)*1; 
  $  053.发动机冷却液温度                               $    $  摄氏度      $    $  ANS038.BYTE003  $  y=(x)*1-40; 
  $  054.里程信息                                       $    $  千米        $    $  ANS039.BYTE003  $  y=(x1*65536+x2*256+x3)*1; 
  $  055.内部模式开关模式(A)输入激活                    $    $              $    $  ANS040.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  056.内部模式开关模式(A)位置传感器信号电压          $    $  伏          $    $  ANS041.BYTE003  $  y=(x)*0.0196078431372549; 
  $  057.内部模式开关模式(A)位置传感器状态              $    $              $    $  ANS042.BYTE003  $  switxh(x)0x00:@01b1;0x01:@0239;0x02:@023a;0x03:@023b;0x04:@023c; 
  $  058.内部模式开关模式(B)输入激活                    $    $              $    $  ANS040.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  059.内部模式开关模式(B)位置传感器信号电压          $    $  伏          $    $  ANS043.BYTE003  $  y=(x)*0.0196078431372549; 
  $  060.内部模式开关模式(B)位置传感器状态              $    $              $    $  ANS044.BYTE003  $  switxh(x)0x00:@01b1;0x01:@0239;0x02:@023a;0x03:@023b;0x04:@023c; 
  $  061.内部模式开关模式(C)输入激活                    $    $              $    $  ANS040.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  062.内部模式开关模式(C)位置传感器信号电压          $    $  伏          $    $  ANS045.BYTE003  $  y=(x)*0.0196078431372549; 
  $  063.内部模式开关模式(C)位置传感器状态              $    $              $    $  ANS046.BYTE003  $  switxh(x)0x00:@01b1;0x01:@0239;0x02:@023a;0x03:@023b;0x04:@023c; 
  $  064.内部模式开关模式(P)输入激活                    $    $              $    $  ANS040.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  065.内部模式开关模式(P)位置传感器信号电压          $    $  伏          $    $  ANS047.BYTE003  $  y=(x)*0.0196078431372549; 
  $  066.内部模式开关模式(P)位置传感器状态              $    $              $    $  ANS048.BYTE003  $  switxh(x)0x00:@01b1;0x01:@0239;0x02:@023a;0x03:@023b;0x04:@023c; 
  $  067.内部模式开关模式(S)输入激活                    $    $              $    $  ANS040.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  068.内部模式开关模式(S)位置传感器信号电压          $    $  伏          $    $  ANS049.BYTE003  $  y=(x)*0.0196078431372549; 
  $  069.内部模式开关模式(S)位置传感器状态              $    $              $    $  ANS050.BYTE003  $  switxh(x)0x00:@01b1;0x01:@0239;0x02:@023a;0x03:@023b;0x04:@023c; 
  $  070.奇数挡输入轴转速                               $    $  转/分       $    $  ANS051.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  071.变速比                                         $    $              $    $  ANS052.BYTE003  $  y=(x1*256+x2)*0.00048828125; 
  $  072.奇数挡离合器压力控制电磁阀(S1)期望压力         $    $  千帕        $    $  ANS053.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  073.偶数挡离合器压力控制电磁阀(S2)期望压力         $    $  千帕        $    $  ANS054.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  074.奇数挡换挡拨叉压力控制电磁阀(S5)期望压力       $    $  千帕        $    $  ANS055.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  075.偶数挡换挡拨叉压力控制电磁阀(S6)期望压力       $    $  千帕        $    $  ANS056.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  076.挂R挡失败次数                                  $    $  次          $    $  ANS057.BYTE003  $  y=(x1*256+x2)*1; 
  $  077.挂2挡失败次数                                  $    $  次          $    $  ANS058.BYTE003  $  y=(x1*256+x2)*1; 
  $  078.挂7挡失败次数                                  $    $  次          $    $  ANS059.BYTE003  $  y=(x1*256+x2)*1; 
  $  079.高压侧驱动1指令打开                            $    $              $    $  ANS060.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  080.高压侧驱动2指令打开                            $    $              $    $  ANS061.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  081.换挡拨叉（挡位1/7）期望状态                    $    $              $    $  ANS062.BYTE003  $  switxh(x&0xC0)0x00:@0027;0x40:@0221;0x80:@007c;0xC0:@0224; 
  $  082.换挡拨叉（挡位1/7）位置传感器占空比            $    $  百分比      $    $  ANS063.BYTE003  $  y=(x)*0.392156862745098; 
  $  083.换挡拨叉（挡位1/7）位置状态                    $    $              $    $  ANS064.BYTE003  $  switxh(x)0x00:@0221;0x01:@0222;0x02:@007c;0x03:@0223;0x04:@0224;0x05:@01b6;0x06:@01b1; 
  $  084.换挡拨叉（挡位1/7）位置                        $    $  毫米        $    $  ANS065.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  085.换挡拨叉（挡位2/6）期望状态                    $    $              $    $  ANS062.BYTE003  $  switxh(x&0x30)0x00:@0027;0x10:@0221;0x20:@007c;0x30:@0224; 
  $  086.换挡拨叉（挡位2/6）位置传感器占空比            $    $  百分比      $    $  ANS066.BYTE003  $  y=(x)*0.392156862745098; 
  $  087.换挡拨叉（挡位2/6）位置状态                    $    $              $    $  ANS067.BYTE003  $  switxh(x)0x00:@0221;0x01:@0222;0x02:@007c;0x03:@0223;0x04:@0224;0x05:@01b6;0x06:@01b1; 
  $  088.换挡拨叉（挡位2/6）位置                        $    $  毫米        $    $  ANS068.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  089.换挡拨叉（挡位4/R）期望状态                    $    $              $    $  ANS062.BYTE003  $  switxh(x&0x0C)0x00:@0027;0x04:@0221;0x08:@007c;0x0C:@0224; 
  $  090.换挡拨叉（挡位4/R）位置传感器占空比            $    $  百分比      $    $  ANS069.BYTE003  $  y=(x)*0.392156862745098; 
  $  091.换挡拨叉（挡位4/R）位置状态                    $    $              $    $  ANS070.BYTE003  $  switxh(x)0x00:@0221;0x01:@0222;0x02:@007c;0x03:@0223;0x04:@0224;0x05:@01b6;0x06:@01b1; 
  $  092.换挡拨叉（挡位4/R）位置                        $    $  毫米        $    $  ANS071.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  093.换挡拨叉（挡位3/5）期望状态                    $    $              $    $  ANS062.BYTE003  $  switxh(x&0x03)0x00:@0027;0x01:@0221;0x02:@007c;0x03:@0224; 
  $  094.换挡拨叉（挡位3/5）位置传感器占空比            $    $  百分比      $    $  ANS072.BYTE003  $  y=(x)*0.392156862745098; 
  $  095.换挡拨叉（挡位3/5）位置状态                    $    $              $    $  ANS073.BYTE003  $  switxh(x)0x00:@0221;0x01:@0222;0x02:@007c;0x03:@0223;0x04:@0224;0x05:@01b6;0x06:@01b1; 
  $  096.换挡拨叉（挡位3/5）位置                        $    $  毫米        $    $  ANS074.BYTE003  $  if(0x80>x)y=(x)*0.09375;elsey=(x-0xFF)*0.09375; 
  $  097.换挡拨叉位置快速自学习结果                     $    $              $    $  ANS075.BYTE003  $  switxh(x&0xC0)0x00:@01c2;0x40:@008c;0xC0:@008d; 
  $  098.换挡拨叉同步器位置自学习结果                   $    $              $    $  ANS075.BYTE003  $  switxh(x&0x30)0x00:@01c2;0x10:@008c;0x30:@008d; 
  $  099.挂6挡失败次数                                  $    $  次          $    $  ANS076.BYTE003  $  y=(x1*256+x2)*1; 
  $  100.奇数挡离合器压力控制电磁阀(S1)指令打开         $    $              $    $  ANS077.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  101.奇数挡离合器压力控制电磁阀(S1)电流             $    $  毫安        $    $  ANS078.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  102.偶数挡离合器压力控制电磁阀(S2)指令打开         $    $              $    $  ANS079.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  103.偶数挡离合器压力控制电磁阀(S2)电流             $    $  毫安        $    $  ANS080.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  104.奇数挡离合器流量控制电磁阀(S3)指令打开         $    $              $    $  ANS081.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  105.奇数挡离合器流量控制电磁阀(S3)电流             $    $  毫安        $    $  ANS082.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  106.偶数挡离合器流量控制电磁阀(S4)指令打开         $    $              $    $  ANS083.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  107.偶数挡离合器流量控制电磁阀(S4)电流             $    $  毫安        $    $  ANS084.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  108.奇数挡换挡拨叉压力控制电磁阀(S5)指令打开       $    $              $    $  ANS085.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  109.奇数挡换挡拨叉压力控制电磁阀(S5)电流           $    $  毫安        $    $  ANS086.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  110.偶数挡换挡拨叉压力控制电磁阀(S6)指令打开       $    $              $    $  ANS087.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  111.偶数挡换挡拨叉压力控制电磁阀(S6)电流           $    $  毫安        $    $  ANS088.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  112.奇数挡换挡拨叉流量控制电磁阀(S7)指令打开       $    $              $    $  ANS089.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  113.奇数挡换挡拨叉流量控制电磁阀(S7)电流           $    $  毫安        $    $  ANS090.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  114.偶数挡换挡拨叉流量控制电磁阀(S8)指令打开       $    $              $    $  ANS091.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  115.偶数挡换挡拨叉流量控制电磁阀(S8)电流           $    $  毫安        $    $  ANS092.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  116.换挡拨叉逻辑压力控制电磁阀(S9)指令打开         $    $              $    $  ANS093.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  117.系统电压模式                                   $    $              $    $  ANS094.BYTE003  $  switxh(x)0x00:@002e;0x01:@055e;0x02:@0970;0x03:@095f; 
  $  118.蓄电池电压                                     $    $  伏          $    $  ANS095.BYTE003  $  y=(x)*0.1; 
  $  119.挂3挡失败次数                                  $    $  次          $    $  ANS096.BYTE003  $  y=(x1*256+x2)*1; 
  $  120.蓄能器压力                                     $    $  千帕        $    $  ANS097.BYTE003  $  y=(x1*256+x2)*0.111111111111111; 
  $  121.实际档位                                       $    $              $    $  ANS098.BYTE003  $  switxh(x)0x00:@01b1;0x02:@007c;0x16:@0912;0x17:@0010;0x1A:@0011;0x1B:@0012;0x1C:@0013;0x1D:@0014;0x1E:@0015;0x1F:@0011; 
  $  122.期望挡位                                       $    $              $    $  ANS099.BYTE003  $  switxh(x)0x00:@007c;0x01:@0010;0x02:@0011;0x03:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x07:@0011; 
  $  123.手动换挡控制激活                               $    $              $    $  ANS100.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  124.运动模式状态                                   $    $              $    $  ANS100.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  125.变速器油液压力                                 $    $  百分比      $    $  ANS101.BYTE003  $  y=(x)*0.392156862745098; 
  $  126.高压侧驱动1实际状态                            $    $              $    $  ANS098.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  127.高压侧驱动2实际状态                            $    $              $    $  ANS098.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  128.变速箱油液温度                                 $    $  摄氏度      $    $  ANS102.BYTE003  $  y=(x)*1-40; 
  $  129.换档杆位置                                     $    $              $    $  ANS103.BYTE003  $  switxh(x)0x00:@0392;0x01:@0939;0x02:@0912;0x04:@007c;0x06:@0015;0x08:@0014;0x10:@0013;0x20:@0012;0x40:@0011;0x80:@0010;0x81:@0069;0xFF:@01b1; 
  $  130.输出轴转速                                     $    $  转/分       $    $  ANS104.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  131.手动降挡信号激活(方向盘侧)                     $    $              $    $  ANS105.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  132.手动降挡信号激活(换挡杆侧)                     $    $              $    $  ANS100.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  133.手动加挡信号激活(方向盘侧)                     $    $              $    $  ANS105.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  134.手动加挡信号激活(换挡杆侧)                     $    $              $    $  ANS100.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 

;******************************************************************************************************************************************************

