
    车型ID：2b05

    模拟：协议模拟-->2b05

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~250K$~18A706FF

进入命令:


空闲命令:


退出命令:



;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:0       $%  ANS000:18A706FF

  $%  000:厂商：             $%    $%  ANS000.BYTE0-4  $%  if(x==0x00) y=@009c;else if(x==0x01) y=@005f;else if(x==0x02) y=@0083;else if(x==0x03) y=@0084;else if(x==0x04) y=@0085;else if(x==0x05) y=@0086;else if(x==0x06) y=@0087;else if(x==0x07) y=@009d;else if(x==0x08) y=@009e;else if(x==0x0b) y=@009f;else if(x==0x0c) y=@00a0;else if(x==0x15) y=@00a1;else if(x==0x16) y=@00a2;else if(x==0x1F) y=@00a3;else if(x==0x29) y=@00a4;else if(x==0x2a) y=@00a5;else if(x==0x2b) y=@00a6;else if(x==0x33) y=@00a7;else if(x==0x37) y=@00a8;else if(x==0x3d) y=@00a9;else if(x==0x47) y=@00aa;else if(x==0x48) y=@00ab;else if(x==0x51) y=@00ac;else if(x==0x66) y=@00b0;else y=SPRINTF([%d],x);
  $%  001:硬件版本号：       $%    $%  ANS000.BYTE0-2  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  002:软件版本号：       $%    $%  ANS000.BYTE000  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  003:设备唯一码：       $%    $%  ANS000.BYTE000  $%  y=@0120;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:0       $  ANS000:18A706FF

  $  000.电机额定转速                                 $    $  rpm      $    $  ANS000.BYTE0-4  $  y=x2*256+x1;
  $  001.电机额定转矩                                 $    $  Nm       $    $  ANS000.BYTE0-2  $  y=x2*256+x1;
  $  002.MCU(电机控制系统)额定电压                    $    $  V        $    $  ANS000.BYTE000  $  y=(x2*256+x1)*0.1;
  $  003.电机反馈转速                                 $    $  rpm      $    $  ANS000.BYTE0-4  $  y=(x2*256+x1)-10000;
  $  004.电机反馈转矩                                 $    $  Nm       $    $  ANS000.BYTE0-2  $  y=(x2*256+x1)-1000;
  $  005.电机母线电压                                 $    $  V        $    $  ANS000.BYTE000  $  y=(x2*256+x1)*0.1;
  $  006.电机电流                                     $    $  A        $    $  ANS000.BYTE002  $  y=(x2*256+x1)*0.1-1600;
  $  007.电机使能                                     $    $           $    $  ANS000.BYTE0-4  $  if(((x>>0)&1)) y=@0034;else y=@0033;
  $  008.运行模式                                     $    $           $    $  ANS000.BYTE0-4  $  if((x&0x06)==0x02) y=@00c9;else if((x&0x06)==0x04) y=@00ca;else y=@0280;
  $  009.请求主继电器状态                             $    $           $    $  ANS000.BYTE0-4  $  if((x&0x18)==0x08) y=@0281;else if((x&0x18)==0x10) y=@0282;else y=@01d5;
  $  010.电机报警等级                                 $    $           $    $  ANS000.BYTE0-4  $  if((x&0xE0)==0x20) y=@004f;else if((x&0xE0)==0x40) y=@0050;else if((x&0xE0)==0x60) y=@0051;else y=@0000;
  $  011.电机温度                                     $    $  degC     $    $  ANS000.BYTE0-3  $  y=x-40;
  $  012.控制器温度                                   $    $  degC     $    $  ANS000.BYTE0-2  $  y=x-40;
  $  013.预充电故障                                   $    $           $    $  ANS000.BYTE0-1  $  if(((x>>0)&1)) y=@005b;else y=@005c;
  $  014.硬件过流故障                                 $    $           $    $  ANS000.BYTE0-1  $  if(((x>>1)&1)) y=@005b;else y=@005c;
  $  015.软件过流故障                                 $    $           $    $  ANS000.BYTE0-1  $  if(((x>>2)&1)) y=@005b;else y=@005c;
  $  016.继电器丢失故障                               $    $           $    $  ANS000.BYTE0-1  $  if(((x>>3)&1)) y=@005b;else y=@005c;
  $  017.电机堵转故障                                 $    $           $    $  ANS000.BYTE0-1  $  if(((x>>4)&1)) y=@005b;else y=@005c;
  $  018.电流采样回路故障                             $    $           $    $  ANS000.BYTE0-1  $  if(((x>>5)&1)) y=@005b;else y=@005c;
  $  019.电机编码器故障                               $    $           $    $  ANS000.BYTE0-1  $  if(((x>>6)&1)) y=@005b;else y=@005c;
  $  020.温度传感器故障                               $    $           $    $  ANS000.BYTE0-1  $  if(((x>>7)&1)) y=@005b;else y=@005c;
  $  021.MCU(电机控制系统)铝板过温3级报警             $    $           $    $  ANS000.BYTE000  $  if(((x>>0)&1)) y=@005b;else y=@005c;
  $  022.电机定子线圈过温3级报警                      $    $           $    $  ANS000.BYTE000  $  if(((x>>1)&1)) y=@005b;else y=@005c;
  $  023.MCU(电机控制系统)直流输入端过压报警          $    $           $    $  ANS000.BYTE000  $  if(((x>>2)&1)) y=@005b;else y=@005c;
  $  024.电机定子线圈过温2级报警                      $    $           $    $  ANS000.BYTE000  $  if(((x>>3)&1)) y=@005b;else y=@005c;
  $  025.MCU(电机控制系统)直流输入端欠压2级报警       $    $           $    $  ANS000.BYTE000  $  if(((x>>4)&1)) y=@005b;else y=@005c;
  $  026.通讯故障                                     $    $           $    $  ANS000.BYTE000  $  if(((x>>5)&1)) y=@005b;else y=@005c;
  $  027.电机超速故障                                 $    $           $    $  ANS000.BYTE000  $  if(((x>>6)&1)) y=@005b;else y=@005c;
  $  028.电机定子线圈过温1级故障                      $    $           $    $  ANS000.BYTE000  $  if(((x>>7)&1)) y=@005b;else y=@005c;
  $  029.MCU(电机控制系统)直流输入端欠压1级报警       $    $           $    $  ANS000.BYTE001  $  if(((x>>0)&1)) y=@005b;else y=@005c;
  $  030.MCU(电机控制系统)铝板过温1级报警             $    $           $    $  ANS000.BYTE001  $  if(((x>>1)&1)) y=@005b;else y=@005c;
  $  031.相电流过流故障                               $    $           $    $  ANS000.BYTE001  $  if(((x>>2)&1)) y=@005b;else y=@005c;
  $  032.IGBT(点火开关)自诊断故障                     $    $           $    $  ANS000.BYTE001  $  if(((x>>3)&1)) y=@005b;else y=@005c;
  $  033.转速故障                                     $    $           $    $  ANS000.BYTE001  $  if(((x>>4)&1)) y=@005b;else y=@005c;
  $  034.水泵故障                                     $    $           $    $  ANS000.BYTE001  $  if(((x>>5)&1)) y=@005b;else y=@005c;
  $  035.水泵风扇故障                                 $    $           $    $  ANS000.BYTE001  $  if(((x>>6)&1)) y=@005b;else y=@005c;
  $  036.电池输出电流                                 $    $  A        $    $  ANS000.BYTE002  $  if((x1==0xFF)&&(x2==0xFF)) y=@027f;else y=(x2*256+x1)*0.1-1600;
  $  037.驱动电机状态                                 $    $           $    $  ANS000.BYTE0-4  $  if(x==0x01) y=@027b;else if(x==0x02) y=@027c;else if(x==0x03) y=@027d;else if(x==0x04) y=@027e;else y=@008f;

;******************************************************************************************************************************************************

