
    车型ID：2b06

    模拟：协议模拟-->2b06

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~250K$~180A06FF,180A08FF,180A10FF,180A11FF

进入命令:


空闲命令:


退出命令:



;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:18DA002F       $%  ANS000:180A06FF

  $%  000:厂商码:            $%    $%  ANS000.BYTE0-4  $%  if(x==0x00) y=@009c;else if(x==0x01) y=@005f;else if(x==0x02) y=@0083;else if(x==0x03) y=@0084;else if(x==0x04) y=@0085;else if(x==0x05) y=@0086;else if(x==0x06) y=@0087;else if(x==0x07) y=@009d;else if(x==0x08) y=@009e;else if(x==0x0b) y=@009f;else if(x==0x0c) y=@00a0;else if(x==0x15) y=@00a1;else if(x==0x16) y=@00a2;else if(x==0x1F) y=@00a3;else if(x==0x29) y=@00a4;else if(x==0x2a) y=@00a5;else if(x==0x2b) y=@00a6;else if(x==0x33) y=@00a7;else if(x==0x37) y=@00a8;else if(x==0x3d) y=@00a9;else if(x==0x47) y=@00aa;else if(x==0x48) y=@00ab;else if(x==0x51) y=@00ac;else if(x==0x66) y=@00b0;else y=SPRINTF([%d],x);
  $%  001:硬件版本号:        $%    $%  ANS000.BYTE0-2  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  002:软件版本号:        $%    $%  ANS000.BYTE000  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  003:设备唯一码：       $%    $%  ANS000.BYTE000  $%  y=@011b;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:18DA002F       $  ANS000:180A06FF

  $  000.额定电压                   $    $  V       $    $  ANS000.BYTE0-4  $  y=(x2*256+x1);
  $  001.额定电流                   $    $  mA      $    $  ANS000.BYTE0-2  $  y=(x2*256+x1);
  $  002.总正绝缘阻值               $    $  KΩ     $    $  ANS000.BYTE0-4  $  y=(x2*256+x1);
  $  003.总负绝缘阻值               $    $  KΩ     $    $  ANS000.BYTE0-2  $  y=(x2*256+x1);
  $  004.绝缘阻值低一级报警         $    $          $    $  ANS000.BYTE000  $  switxh(((x>>0)&1))0:y=@009a;1:y=@009b;default:y=@008f;
  $  005.绝缘阻值低二级报警         $    $          $    $  ANS000.BYTE000  $  switxh(((x>>1)&1))0:y=@009a;1:y=@009b;default:y=@008f;
  $  006.继电器粘连故障             $    $          $    $  ANS000.BYTE000  $  switxh(((x>>2)&1))0:y=@009a;1:y=@009b;default:y=@008f;
  $  007.高压异常                   $    $          $    $  ANS000.BYTE000  $  switxh(((x>>3)&1))0:y=@009a;1:y=@009b;default:y=@008f;
  $  008.基准异常                   $    $          $    $  ANS000.BYTE000  $  switxh(((x>>4)&1))0:y=@009a;1:y=@009b;default:y=@008f;
  $  009.电池输出端电压             $    $  V       $    $  ANS000.BYTE001  $  y=(x2*256+x1)*0.1;
  $  010.电缆额定容量               $    $  A       $    $  ANS000.BYTE0-4  $  y=(x2*256+x1);
  $  011.充电桩最大供电电流         $    $  A       $    $  ANS000.BYTE0-2  $  y=(x2*256+x1);
  $  012.充电枪接入确认             $    $          $    $  ANS000.BYTE000  $  switxh(((x>>0)&1))0:y=@0094;1:y=@0095;default:y=@008f;
  $  013.充电枪有效性               $    $          $    $  ANS000.BYTE000  $  switxh(((x>>1)&1))0:y=@0092;1:y=@0093;default:y=@008f;
  $  014.充电使能                   $    $          $    $  ANS000.BYTE000  $  switxh(((x>>2)&1))0:y=@0098;1:y=@0099;default:y=@008f;
  $  015.CP频率                     $    $          $    $  ANS000.BYTE000  $  switxh(((x>>3)&1))0:y=@0096;1:y=@0097;default:y=@008f;
  $  016.S2开关状态                 $    $          $    $  ANS000.BYTE000  $  switxh(((x>>4)&1))0:y=@0090;1:y=@0091;default:y=@008f;
  $  017.系统最大允许充电电流       $    $  A       $    $  ANS000.BYTE001  $  y=(x2*256+x1)*0.1;

;******************************************************************************************************************************************************

