
    车型ID：2b15

    模拟：协议模拟-->2b15

;******************************************************************************************************************************************************

    通讯线: $~02$~10$~250K$~18A406FF

进入命令:


空闲命令:


退出命令:



;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:0       $%  ANS000:18A406FF

  $%  000:厂商码：           $%    $%  ANS000.BYTE0-4  $%  if(x==0x00) y=@009c;else if(x==0x01) y=@005f;else if(x==0x02) y=@0083;else if(x==0x03) y=@0084;else if(x==0x04) y=@0085;else if(x==0x05) y=@0086;else if(x==0x06) y=@0087;else if(x==0x07) y=@009d;else if(x==0x08) y=@009e;else if(x==0x0b) y=@009f;else if(x==0x0c) y=@00a0;else if(x==0x15) y=@00a1;else if(x==0x16) y=@00a2;else if(x==0x1F) y=@00a3;else if(x==0x29) y=@00a4;else if(x==0x2a) y=@00a5;else if(x==0x2b) y=@00a6;else if(x==0x33) y=@00a7;else if(x==0x37) y=@00a8;else if(x==0x3d) y=@00a9;else if(x==0x47) y=@00aa;else if(x==0x48) y=@00ab;else if(x==0x51) y=@00ac;else if(x==0x66) y=@00b0;else y=SPRINTF([%d],x);
  $%  001:硬件版本号：       $%    $%  ANS000.BYTE0-2  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  002:软件版本号：       $%    $%  ANS000.BYTE000  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  003:设备唯一码：       $%    $%  ANS000.BYTE000  $%  y=@011c;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:0       $  ANS000:18A406FF

  $  000.额定电压                                                          $    $  V      $    $  ANS000.BYTE0-4  $  y=(x2*256+x1);
  $  001.额定电流                                                          $    $  mA     $    $  ANS000.BYTE0-2  $  y=(x2*256+x1);
  $  002.中控锁                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x1>>0)&1))y=@0045;else y=@0046;
  $  003.后备箱                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x1>>1)&1))y=@000e;else y=@000f;
  $  004.充电盖                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x1>>2)&1))y=@000e;else y=@000f;
  $  005.电池舱门                                                          $    $         $    $  ANS000.BYTE0-4  $  if((x1&0x18)==0x08)y=@0030;else if((x1&0x18)==0x10)y=@0031;else if((x1&0x18)==0x18)y=@0032;else y=@00cc;
  $  006.左前窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x03)==0x01)y=@0030;else if((x2&0x03)==0x02)y=@0031;else if((x2&0x03)==0x03)y=@0032;else y=@00cc;
  $  007.右前窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x0C)==0x04)y=@0030;else if((x2&0x0C)==0x08)y=@0031;else if((x2&0x0C)==0x0C)y=@0032;else y=@00cc;
  $  008.左后窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x30)==0x10)y=@0030;else if((x2&0x30)==0x20)y=@0031;else if((x2&0x30)==0x30)y=@0032;else y=@00cc;
  $  009.右后窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0xC0)==0x40)y=@0030;else if((x2&0xC0)==0x80)y=@0031;else if((x2&0xC0)==0xC0)y=@0032;else y=@00cc;
  $  010.左前窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x03)==0x01)y=@0030;else if((x2&0x03)==0x02)y=@0031;else if((x2&0x03)==0x03)y=@0032;else y=@00cc;
  $  011.右前窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x0C)==0x04)y=@0030;else if((x2&0x0C)==0x08)y=@0031;else if((x2&0x0C)==0x0C)y=@0032;else y=@00cc;
  $  012.左后窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x30)==0x10)y=@0030;else if((x2&0x30)==0x20)y=@0031;else if((x2&0x30)==0x30)y=@0032;else y=@00cc;
  $  013.右后窗                                                            $    $         $    $  ANS000.BYTE0-4  $  if((x2&0xC0)==0x40)y=@0030;else if((x2&0xC0)==0x80)y=@0031;else if((x2&0xC0)==0xC0)y=@0032;else y=@00cc;
  $  014.左前门                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x3>>0)&1))y=@000e;else y=@000f;
  $  015.右前门                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x3>>1)&1))y=@000e;else y=@000f;
  $  016.左后门                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x3>>2)&1))y=@000e;else y=@000f;
  $  017.右后门                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x3>>3)&1))y=@000e;else y=@000f;
  $  018.大灯                                                              $    $         $    $  ANS000.BYTE0-4  $  if((x4&0x03)==0x01)y=@002e;else if((x4&0x03)==0x02)y=@002f;else if((x4&0x03)==0x03)y=@000f;else y=@00cc;
  $  019.应急危险灯                                                        $    $         $    $  ANS000.BYTE0-4  $  if(((x4>>2)&1))y=@000e;else y=@000f;
  $  020.前雾灯                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x4>>3)&1))y=@000e;else y=@000f;
  $  021.后雾灯                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x4>>4)&1))y=@000e;else y=@000f;
  $  022.示宽灯                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x4>>5)&1))y=@000e;else y=@000f;
  $  023.倒车灯                                                            $    $         $    $  ANS000.BYTE0-4  $  if(((x4>>6)&1))y=@000e;else y=@000f;
  $  024.左转向灯                                                          $    $         $    $  ANS000.BYTE0-4  $  if((x5&0x03)==0x01)y=@000f;else if((x5&0x03)==0x02)y=@000e;else y=@00cc;
  $  025.右转向灯                                                          $    $         $    $  ANS000.BYTE0-4  $  if((x5&0x0c)==0x04)y=@000f;else if((x5&0x0c)==0x08)y=@000e;else y=@00cc;
  $  026.喇叭                                                              $    $         $    $  ANS000.BYTE0-4  $  if(((x7>>0)&1))y=@000e;else y=@000f;
  $  027.防盗                                                              $    $         $    $  ANS000.BYTE0-4  $  if((x7&0x06)==0x00)y=@0035;else if((x7&0x06)==0x02)y=@0036;else if((x7&0x06)==0x04)y=@0037;else if((x7&0x06)==0x06)y=@0038;else y=@00cc;
  $  028.BCM(车身控制系统)给PEPS(无钥匙进入及一键启动)电机的供电状态       $    $         $    $  ANS000.BYTE0-4  $  if((x7&0x18)==0x00)y=@0033;else if((x7&0x18)==0x08)y=@0034;else if((x7&0x18)==0x10)y=@0001;else y=@00cc;
  $  029.Rke控制命令                                                       $    $         $    $  ANS000.BYTE0-4  $  if((x1&0x0f)==0x01)y=@010a;else if((x1&0x0f)==0x02)y=@010b;else if((x1&0x0f)==0x03)y=@0107;else if((x1&0x0f)==0x04)y=@010c;else y=@00cc;
  $  030.Pke控制命令                                                       $    $         $    $  ANS000.BYTE0-4  $  if((x1&0xf0)==0x10)y=@0105;else if((x1&0xf0)==0x20)y=@0106;else if((x1&0xf0)==0x30)y=@0107;else if((x1&0xf0)==0x40)y=@0108;else if((x1&0xf0)==0x50)y=@0109;else y=@00cc;
  $  031.电子转向柱锁电源控制                                              $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x03)==0x01)y=@010d;else if((x2&0x03)==0x02)y=@010e;else if((x2&0x03)==0x03)y=@010f;else y=@00cc;
  $  032.系统电源模式                                                      $    $         $    $  ANS000.BYTE0-4  $  if((x2&0x0c)==0x00)y=@003f;else if((x2&0x0c)==0x04)y=@0040;else if((x2&0x0c)==0x08)y=@0041;else y=@00d3;
  $  033.钥匙索引                                                          $    $         $    $  ANS000.BYTE0-4  $  if((x3&0x07)==0x01)y=@0100;else if((x3&0x07)==0x02)y=@0101;else if((x3&0x07)==0x03)y=@0102;else if((x3&0x07)==0x04)y=@0103;else y=@00cc;
  $  034.PEPS(无钥匙进入及一键启动)报警信息（仪表显示）                    $    $         $    $  ANS000.BYTE0-4  $  if((x4&0x0f)==0x01)y=@00fb;else if((x4&0x0f)==0x02)y=@00fc;else if((x4&0x0f)==0x03)y=@00fd;else if((x4&0x0f)==0x04)y=@00fe;else if((x4&0x0f)==0x05)y=@00ff;else y=@00cc;
  $  035.电子转向柱锁状态                                                  $    $         $    $  ANS000.BYTE0-4  $  if((x4&0x30)==0x10)y=@0045;else if((x4&0x30)==0x20)y=@0104;else if((x4&0x30)==0x30)y=@0001;else y=@00cc;

;******************************************************************************************************************************************************

