
    车型ID：0044

    模拟：协议模拟-->0044

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7AA

进入命令:

  $~  REQ000:72A 02 10 01 00 00 00 00 00       $~  ANS000:7AA 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:72A 02 3E 00 00 00 00 00 00       $!  ANS000:7AA 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:72A 03 19 02 09 00 00 00 00       $#  ANS000:7AA 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/35000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:72A 04 14 FF FF FF 00 00 00       $$  ANS000:7AA 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:72A 03 22 F1 87 00 00 00 00       $%  ANS000:7AA 03 22 F1 87 00 00 00 00
  $%  REQ001:72A 03 22 F1 8A 00 00 00 00       $%  ANS001:7AA 03 22 F1 8A 00 00 00 00
  $%  REQ002:72A 03 22 F1 93 00 00 00 00       $%  ANS002:7AA 03 22 F1 93 00 00 00 00
  $%  REQ003:72A 03 22 F1 95 00 00 00 00       $%  ANS003:7AA 03 22 F1 95 00 00 00 00
  $%  REQ004:72A 03 22 F1 9D 00 00 00 00       $%  ANS004:7AA 03 22 F1 9D 00 00 00 00
  $%  REQ005:72A 03 22 F1 8B 00 00 00 00       $%  ANS005:7AA 03 22 F1 8B 00 00 00 00
  $%  REQ006:72A 03 22 F1 90 00 00 00 00       $%  ANS006:7AA 03 22 F1 90 00 00 00 00
  $%  REQ007:72A 03 22 F1 84 00 00 00 00       $%  ANS007:7AA 03 22 F1 84 00 00 00 00
  $%  REQ008:72A 03 22 F1 8C 00 00 00 00       $%  ANS008:7AA 03 22 F1 8C 00 00 00 00
  $%  REQ009:72A 03 22 39 10 00 00 00 00       $%  ANS009:7AA 03 22 39 10 00 00 00 00
  $%  REQ010:72A 03 22 F1 A2 00 00 00 00       $%  ANS010:7AA 03 22 F1 A2 00 00 00 00
  $%  REQ011:72A 03 22 F1 A4 00 00 00 00       $%  ANS011:7AA 03 22 F1 A4 00 00 00 00
  $%  REQ012:72A 03 22 F1 A6 00 00 00 00       $%  ANS012:7AA 03 22 F1 A6 00 00 00 00
  $%  REQ013:72A 03 22 F1 AA 00 00 00 00       $%  ANS013:7AA 03 22 F1 AA 00 00 00 00
  $%  REQ014:72A 03 22 F1 A5 00 00 00 00       $%  ANS014:7AA 03 22 F1 A5 00 00 00 00
  $%  REQ015:72A 03 22 F1 A9 00 00 00 00       $%  ANS015:7AA 03 22 F1 A9 00 00 00 00

  $%  000:零部件件号:                     $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  001:系统供应商代码:                 $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  002:系统供应商ECU硬件版本号:        $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  003:系统供应商ECU软件版本号:        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  004:ECU安装日期:                    $%    $%  ANS004.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  005:ECU制造日期:                    $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  006:VIN:                            $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:指纹数据标识符:                 $%    $%  ANS007.BYTE004  $%  y = SPRINTF([%02X%02X%02X%02X%c%c%c%c%c%c%c%c%c%c],x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  008:ECU序列号:                      $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  009:整车配置信息备用码:             $%    $%  ANS009.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  010:CAN Matrix版本号:               $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  011:ECU标定软件版本:                $%    $%  ANS011.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24);
  $%  012:ECU APP软件版本:                $%    $%  ANS012.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  013:应用软件编程成功次数:           $%    $%  ANS013.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  014:应用软件编程尝试次数:           $%    $%  ANS014.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  015:最大允许编程次数:               $%    $%  ANS015.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:72A 03 22 39 09 00 00 00 00       $  ANS000:7AA 03 22 39 09 00 00 00 00
  $  REQ001:72A 03 22 39 15 00 00 00 00       $  ANS001:7AA 03 22 39 15 00 00 00 00
  $  REQ002:72A 03 22 39 16 00 00 00 00       $  ANS002:7AA 03 22 39 16 00 00 00 00
  $  REQ003:72A 03 22 39 53 00 00 00 00       $  ANS003:7AA 03 22 39 53 00 00 00 00
  $  REQ004:72A 03 22 39 54 00 00 00 00       $  ANS004:7AA 03 22 39 54 00 00 00 00
  $  REQ005:72A 03 22 39 5A 00 00 00 00       $  ANS005:7AA 03 22 39 5A 00 00 00 00
  $  REQ006:72A 03 22 39 5B 00 00 00 00       $  ANS006:7AA 03 22 39 5B 00 00 00 00
  $  REQ007:72A 03 22 39 5C 00 00 00 00       $  ANS007:7AA 03 22 39 5C 00 00 00 00
  $  REQ008:72A 03 22 39 5D 00 00 00 00       $  ANS008:7AA 03 22 39 5D 00 00 00 00
  $  REQ009:72A 03 22 39 5E 00 00 00 00       $  ANS009:7AA 03 22 39 5E 00 00 00 00
  $  REQ010:72A 03 22 39 7A 00 00 00 00       $  ANS010:7AA 03 22 39 7A 00 00 00 00
  $  REQ011:72A 03 22 39 7E 00 00 00 00       $  ANS011:7AA 03 22 39 7E 00 00 00 00
  $  REQ012:72A 03 22 39 82 00 00 00 00       $  ANS012:7AA 03 22 39 82 00 00 00 00
  $  REQ013:72A 03 22 39 79 00 00 00 00       $  ANS013:7AA 03 22 39 79 00 00 00 00
  $  REQ014:72A 03 22 39 7D 00 00 00 00       $  ANS014:7AA 03 22 39 7D 00 00 00 00
  $  REQ015:72A 03 22 39 81 00 00 00 00       $  ANS015:7AA 03 22 39 81 00 00 00 00
  $  REQ016:72A 03 22 39 7B 00 00 00 00       $  ANS016:7AA 03 22 39 7B 00 00 00 00
  $  REQ017:72A 03 22 39 7F 00 00 00 00       $  ANS017:7AA 03 22 39 7F 00 00 00 00
  $  REQ018:72A 03 22 39 83 00 00 00 00       $  ANS018:7AA 03 22 39 83 00 00 00 00
  $  REQ019:72A 03 22 39 8E 00 00 00 00       $  ANS019:7AA 03 22 39 8E 00 00 00 00
  $  REQ020:72A 03 22 39 8F 00 00 00 00       $  ANS020:7AA 03 22 39 8F 00 00 00 00
  $  REQ021:72A 03 22 39 84 00 00 00 00       $  ANS021:7AA 03 22 39 84 00 00 00 00
  $  REQ022:72A 03 22 39 1E 00 00 00 00       $  ANS022:7AA 03 22 39 1E 00 00 00 00
  $  REQ023:72A 03 22 39 8C 00 00 00 00       $  ANS023:7AA 03 22 39 8C 00 00 00 00

  $  000.服务标定SPC                                  $    $        $    $  ANS000.BYTE004  $  if(x1==0) y=@009f;else if(x1==1) y=@00a0;else y=@0004;
  $  001.工厂标定TAC-目标板中心线                     $    $        $    $  ANS001.BYTE004  $  y = SPRINTF([%d], x1);
  $  002.工厂标定TAC-目标板方块边长                   $    $        $    $  ANS001.BYTE005  $  y = SPRINTF([%d], (x1*256+x2));
  $  003.工厂标定TAC-两个目标板中心横向间隔距离       $    $        $    $  ANS001.BYTE007  $  y = SPRINTF([%d], x1);
  $  004.工厂标定TAC-目标板中心离地面高度             $    $        $    $  ANS001.BYTE008  $  y = SPRINTF([%d], x1);
  $  005.工厂标定TAC-目标板到车辆前轴的距离           $    $        $    $  ANS001.BYTE009  $  y = SPRINTF([%d], (x1*256+x2));
  $  006.工厂标定TAC-目标类型                         $    $        $    $  ANS001.BYTE011  $  if(x1==0) y=@00a1;else y=@0004;
  $  007.车辆测试用途TAC标定使能                      $    $        $    $  ANS002.BYTE004  $  if(((x1>>0)&1)) y = @0099; else y = @009a;
  $  008.摄像头校准状态                               $    $        $    $  ANS003.BYTE004  $  if(x1==0) y=@009b;else if(x1==1) y=@009c;else if(x1==2) y=@009d;else if(x1==3) y=@009e;else y=@0098;
  $  009.摄像头相关TAC工站校准状态                    $    $        $    $  ANS004.BYTE005  $  if(x1==0) y=@00aa;else if(x1==1) y=@00ab;else if(x1==2) y=@00ac;else if(x1==3) y=@00ad;else if(x1==4) y=@00ae;else if(x1==5) y=@00af;else if(x1==6) y=@00b0;else if(x1==7) y=@00b1;else if(x1==8) y=@00b2;else y=@00b3;
  $  010.摄像头校准横摆角度                           $    $        $    $  ANS005.BYTE004  $  y = SPRINTF([%.4f], (x1*256+x2)*0.00001745-0.56719);
  $  011.摄像头校准YAW角度                            $    $        $    $  ANS006.BYTE004  $  y = SPRINTF([%d], (x1*256+x2)-640);
  $  012.摄像头校准水平角度                           $    $        $    $  ANS007.BYTE004  $  y = SPRINTF([%d], (x1*256+x2)-480);
  $  013.售后标定状态                                 $    $        $    $  ANS008.BYTE004  $  if(x1==0) y=@00a2;else if(x1==1) y=@00a3;else if(x1==2) y=@00a4;else if(x1==3) y=@00a5;else if(x1==4) y=@00a6;else if(x1==5) y=@00a7;else y=@0098;
  $  014.横摆角标定状态                               $    $        $    $  ANS008.BYTE005  $  if(x1==0) y=@00a8;else if(x1==1) y=@00a9;else y=@0098;
  $  015.售后标定状态百分位                           $    $  %     $    $  ANS009.BYTE004  $  y = SPRINTF([%d], x1);
  $  016.SWP1标定文档刷写日期                         $    $        $    $  ANS010.BYTE004  $  HEX(x1,x2,x3);
  $  017.SWP2标定文档刷写日期                         $    $        $    $  ANS011.BYTE004  $  HEX(x1,x2,x3);
  $  018.SWP4标定文档刷写日期                         $    $        $    $  ANS012.BYTE004  $  HEX(x1,x2,x3);
  $  019.SWP1标定文件信息-标定文件类型                $    $        $    $  ANS013.BYTE004  $  ASCII(x1,x2);
  $  020.SWP1标定文件信息-车辆平台类型                $    $        $    $  ANS013.BYTE006  $  y = SPRINTF([%.2X], x1);
  $  021.SWP1标定文件信息-车辆子平台类型              $    $        $    $  ANS013.BYTE007  $  y = SPRINTF([%.2X], x1);
  $  022.SWP1标定文件信息-标定文件支持模式            $    $        $    $  ANS013.BYTE008  $  ASCII(x1,x2);
  $  023.SWP1标定文件信息-标定文件版本                $    $        $    $  ANS013.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  024.SWP1标定文件信息-标定文件零件号              $    $        $    $  ANS013.BYTE016  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  025.SWP1标定文件信息-标定文件校验字              $    $        $    $  ANS013.BYTE031  $  HEX(x1,x2,x3,x4);
  $  026.SWP2标定文件信息-标定文件类型                $    $        $    $  ANS014.BYTE004  $  ASCII(x1,x2);
  $  027.SWP2标定文件信息-车辆平台类型                $    $        $    $  ANS014.BYTE006  $  y = SPRINTF([%.2X], x1);
  $  028.SWP2标定文件信息-车辆子平台类型              $    $        $    $  ANS014.BYTE007  $  y = SPRINTF([%.2X], x1);
  $  029.SWP2标定文件信息-标定文件支持模式            $    $        $    $  ANS014.BYTE008  $  ASCII(x1,x2);
  $  030.SWP2标定文件信息-标定文件版本                $    $        $    $  ANS014.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  031.SWP2标定文件信息-标定文件零件号              $    $        $    $  ANS014.BYTE016  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  032.SWP2标定文件信息-标定文件校验字              $    $        $    $  ANS014.BYTE031  $  HEX(x1,x2,x3,x4);
  $  033.SWP4标定文件信息-标定文件类型                $    $        $    $  ANS015.BYTE004  $  ASCII(x1,x2);
  $  034.SWP4标定文件信息-车辆平台类型                $    $        $    $  ANS015.BYTE006  $  y = SPRINTF([%.2X], x1);
  $  035.SWP4标定文件信息-车辆子平台类型              $    $        $    $  ANS015.BYTE007  $  y = SPRINTF([%.2X], x1);
  $  036.SWP4标定文件信息-标定文件支持模式            $    $        $    $  ANS015.BYTE008  $  ASCII(x1,x2);
  $  037.SWP4标定文件信息-标定文件版本                $    $        $    $  ANS015.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  038.SWP4标定文件信息-标定文件零件号              $    $        $    $  ANS015.BYTE016  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  039.SWP4标定文件信息-标定文件校验字              $    $        $    $  ANS015.BYTE031  $  HEX(x1,x2,x3,x4);
  $  040.SWP1 标定文档刷写成功计数器                  $    $        $    $  ANS016.BYTE004  $  y = SPRINTF([%d], x1);
  $  041.SWP2 标定文档刷写成功计数器                  $    $        $    $  ANS017.BYTE004  $  y = SPRINTF([%d], x1);
  $  042.SWP4 标定文档刷写成功计数器                  $    $        $    $  ANS018.BYTE004  $  y = SPRINTF([%d], x1);
  $  043.VFP标定版本信息                              $    $        $    $  ANS019.BYTE004  $  HEX(x1,x2,x3,x4,x5,x6,x7,x8);
  $  044.VFP标定文档刷写日期                          $    $        $    $  ANS020.BYTE004  $  HEX(x1,x2,x3);
  $  045.VFP标定文档刷写成功计数器                    $    $        $    $  ANS021.BYTE004  $  y = SPRINTF([%d], x1);
  $  046.IFV模式切换                                  $    $        $    $  ANS022.BYTE004  $  if(x1==0) y=@00b4;else if(x1==1) y=@00b5;else y=@0098;
  $  047.车型配置校验码                               $    $        $    $  ANS022.BYTE005  $  y = SPRINTF([%.2X], x1);
  $  048.IFV功能配置模式                              $    $        $    $  ANS022.BYTE006  $  if(x1==0) y=@00b6;else y=@0098;
  $  049.供应商追溯信息                               $    $        $    $  ANS023.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:72A 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
