
    车型ID：5712

    模拟：协议模拟-->5712

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:6A2 02 10 01 00 00 00 00 00       $~  ANS000:6A3 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:6A2 02 3E 00 00 00 00 00 00       $!  ANS000:6A3 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:6A2 03 19 02 08 00 00 00 00       $#  ANS000:6A3 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b1000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:6A2 04 14 FF FF FF 00 00 00       $$  ANS000:6A3 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:6A2 03 22 F1 87 00 00 00 00       $%  ANS000:6A3 03 22 F1 87 00 00 00 00
  $%  REQ001:6A2 03 22 F1 90 00 00 00 00       $%  ANS001:6A3 03 22 F1 90 00 00 00 00
  $%  REQ002:6A2 03 22 F1 89 00 00 00 00       $%  ANS002:6A3 03 22 F1 89 00 00 00 00
  $%  REQ003:6A2 03 22 F1 8A 00 00 00 00       $%  ANS003:6A3 03 22 F1 8A 00 00 00 00
  $%  REQ004:6A2 03 22 F1 8B 00 00 00 00       $%  ANS004:6A3 03 22 F1 8B 00 00 00 00
  $%  REQ005:6A2 03 22 F1 91 00 00 00 00       $%  ANS005:6A3 03 22 F1 91 00 00 00 00
  $%  REQ006:6A2 03 22 F1 92 00 00 00 00       $%  ANS006:6A3 03 22 F1 92 00 00 00 00
  $%  REQ007:6A2 03 22 F1 94 00 00 00 00       $%  ANS007:6A3 03 22 F1 94 00 00 00 00
  $%  REQ008:6A2 03 22 F1 A2 00 00 00 00       $%  ANS008:6A3 03 22 F1 A2 00 00 00 00
  $%  REQ009:6A2 03 22 F1 A4 00 00 00 00       $%  ANS009:6A3 03 22 F1 A4 00 00 00 00
  $%  REQ010:6A2 03 22 F1 00 00 00 00 00       $%  ANS010:6A3 03 22 F1 00 00 00 00 00
  $%  REQ011:6A2 03 22 F1 8C 00 00 00 00       $%  ANS011:6A3 03 22 F1 8C 00 00 00 00
  $%  REQ012:6A2 03 22 02 00 00 00 00 00       $%  ANS012:6A3 03 22 02 00 00 00 00 00

  $%  000:FCC（汽车制造商）零件号:                $%    $%  ANS000.BYTE004  $%  0 ASCII
  $%  001:VIN（车辆识别码）:                      $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  002:FCC（汽车制造商） ECU软件版本号:        $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:供应商代码:                             $%    $%  ANS003.BYTE004  $%  0 ASCII
  $%  004:ECU在供应商生产线上的生产日期:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  005:FCC（汽车制造商） ECU硬件版本号:        $%    $%  ANS005.BYTE004  $%  0 ASCII
  $%  006:供应商ECU硬件版本号:                    $%    $%  ANS006.BYTE004  $%  0 ASCII
  $%  007:供应商ECU软件版本号:                    $%    $%  ANS007.BYTE004  $%  Y=@0e18;
  $%  008:ECU在生产线的安装日期:                  $%    $%  ANS008.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  009:供应商ECU标定软件版本号:                $%    $%  ANS009.BYTE004  $%  Y=@0e17;
  $%  010:车辆模式配置:                           $%    $%  ANS010.BYTE004  $%  if(X1==1)y=@0011;else if(X1==2)y=@03c5;else if(X1==3)y=@006a;else if(X1==0)y=@000d;else y=@0004;
  $%  011:ECU序列号:                              $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  012:软件版本号:                             $%    $%  ANS012.BYTE017  $%  HEX(X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:6A2 03 22 F1 A1 00 00 00 00       $  ANS000:6A3 03 22 F1 A1 00 00 00 00
  $  REQ001:6A2 03 22 02 00 00 00 00 00       $  ANS001:6A3 03 22 02 00 00 00 00 00
  $  REQ002:6A2 03 22 02 01 00 00 00 00       $  ANS002:6A3 03 22 02 01 00 00 00 00
  $  REQ003:6A2 03 22 02 02 00 00 00 00       $  ANS003:6A3 03 22 02 02 00 00 00 00
  $  REQ004:6A2 03 22 02 03 00 00 00 00       $  ANS004:6A3 03 22 02 03 00 00 00 00
  $  REQ005:6A2 03 22 02 04 00 00 00 00       $  ANS005:6A3 03 22 02 04 00 00 00 00
  $  REQ006:6A2 03 22 02 05 00 00 00 00       $  ANS006:6A3 03 22 02 05 00 00 00 00
  $  REQ007:6A2 03 22 02 06 00 00 00 00       $  ANS007:6A3 03 22 02 06 00 00 00 00
  $  REQ008:6A2 03 22 02 07 00 00 00 00       $  ANS008:6A3 03 22 02 07 00 00 00 00
  $  REQ009:6A2 03 22 02 08 00 00 00 00       $  ANS009:6A3 03 22 02 08 00 00 00 00
  $  REQ010:6A2 03 22 02 09 00 00 00 00       $  ANS010:6A3 03 22 02 09 00 00 00 00
  $  REQ011:6A2 03 22 02 0A 00 00 00 00       $  ANS011:6A3 03 22 02 0A 00 00 00 00
  $  REQ012:6A2 03 22 02 0B 00 00 00 00       $  ANS012:6A3 03 22 02 0B 00 00 00 00
  $  REQ013:6A2 03 22 02 13 00 00 00 00       $  ANS013:6A3 03 22 02 13 00 00 00 00

  $  000.司机正向安全气囊                                            $    $                 $    $  ANS000.BYTE004  $  if(((X1>>0)&1)) Y=@0df4;else Y=@0115;
  $  001.乘客正向安全气囊                                            $    $                 $    $  ANS000.BYTE004  $  if(((X1>>1)&1)) Y=@0df6;else Y=@0115;
  $  002.前排司机安全带预紧器                                        $    $                 $    $  ANS000.BYTE004  $  if(((X1>>2)&1)) Y=@0df5;else Y=@0115;
  $  003.前排乘客安全带预紧器                                        $    $                 $    $  ANS000.BYTE004  $  if(((X1>>3)&1)) Y=@0df1;else Y=@0115;
  $  004.司机侧向安全气囊存在                                        $    $                 $    $  ANS000.BYTE004  $  if(((X1>>4)&1)) Y=@0def;else Y=@0df0;
  $  005.乘客侧向安全气囊存在                                        $    $                 $    $  ANS000.BYTE004  $  if(((X1>>5)&1)) Y=@0df3;else Y=@0df0;
  $  006.前排司机帘式安全气囊存在                                    $    $                 $    $  ANS000.BYTE004  $  if(((X1>>6)&1)) Y=@0df2;else Y=@0115;
  $  007.前排乘客帘式安全气囊存在                                    $    $                 $    $  ANS000.BYTE004  $  if(((X1>>7)&1)) Y=@0e00;else Y=@0115;
  $  008.前排司机外设加速传感器存在                                  $    $                 $    $  ANS000.BYTE006  $  if(((X1>>0)&1)) Y=@0dff;else Y=@0df0;
  $  009.前排乘客外设加速传感器存在                                  $    $                 $    $  ANS000.BYTE006  $  if(((X1>>1)&1)) Y=@0e02;else Y=@0df0;
  $  010.钥匙开关存在                                                $    $                 $    $  ANS000.BYTE007  $  if(((X1>>0)&1)) Y=@0e01;else Y=@0115;
  $  011.司机带扣开关                                                $    $                 $    $  ANS000.BYTE007  $  if(((X1>>1)&1)) Y=@0dfc;else Y=@0115;
  $  012.乘客带扣开关                                                $    $                 $    $  ANS000.BYTE007  $  if(((X1>>2)&1)) Y=@0dfb;else Y=@0115;
  $  013.乘客坐垫检测_座椅安全带提醒器                               $    $                 $    $  ANS000.BYTE007  $  if(((X1>>3)&1)) Y=@0dfe;else Y=@0df0;
  $  014.系统告警灯                                                  $    $                 $    $  ANS000.BYTE008  $  if(((X1>>0)&1)) Y=@0dfd;else Y=@0115;
  $  015.PAD（乘客安全气囊解除）灯                                   $    $                 $    $  ANS000.BYTE008  $  if(((X1>>1)&1)) Y=@0df8;else Y=@0115;
  $  016.司机SBR(座椅安全带提醒器)灯                                 $    $                 $    $  ANS000.BYTE008  $  if(((X1>>2)&1)) Y=@0df7;else Y=@0115;
  $  017.乘客SBR(座椅安全带提醒器)灯                                 $    $                 $    $  ANS000.BYTE008  $  if(((X1>>3)&1)) Y=@0dfa;else Y=@0115;
  $  018.碰撞输出                                                    $    $                 $    $  ANS000.BYTE008  $  if(((X1>>4)&1)) Y=@0df9;else Y=@0115;
  $  019.当前故障使故障灯亮                                          $    $                 $    $  ANS001.BYTE024  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  020.历史故障使故障灯亮                                          $    $                 $    $  ANS001.BYTE024  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  021.客户生产模式使故障灯亮                                      $    $                 $    $  ANS001.BYTE024  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  022.气囊引爆使故障灯亮                                          $    $                 $    $  ANS001.BYTE024  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  023.诊断通讯使故障亮                                            $    $                 $    $  ANS001.BYTE024  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  024.算法禁止使故障灯亮                                          $    $                 $    $  ANS001.BYTE024  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  025.诊断服务禁止控制器点火使故障灯闪烁                          $    $                 $    $  ANS001.BYTE024  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  026.事故记数器                                                  $    $                 $    $  ANS001.BYTE025  $  Y=HEX(X1);
  $  027.诊断服务关闭副驾驶安全气囊                                  $    $                 $    $  ANS001.BYTE026  $  if(((X1>>0)&1)) Y=@0b12;else Y=@01fa;
  $  028.PADS 关闭副驾驶安全气囊                                     $    $                 $    $  ANS001.BYTE026  $  if(((X1>>1)&1)) Y=@0b12;else Y=@01fa;
  $  029.驾驶员安全带锁扣定义状态                                    $    $                 $    $  ANS001.BYTE027  $  if(((X1>>1)&1)) Y=@006d;else Y=@003b;
  $  030.驾驶员安全带锁扣状态                                        $    $                 $    $  ANS001.BYTE027  $  if(((X1>>1)&1)) Y=@0e0b;else Y=@09b1;
  $  031.乘员安全带锁扣定义                                          $    $                 $    $  ANS001.BYTE028  $  if(((X1>>0)&1)) Y=@006d;else Y=@003b;
  $  032.乘员安全带锁扣状态                                          $    $                 $    $  ANS001.BYTE028  $  if(((X1>>1)&1)) Y=@0e0b;else Y=@09b1;
  $  033.默认模式                                                    $    $                 $    $  ANS001.BYTE029  $  if(((X1>>0)&1)) Y=@0e05;else Y=@0e06;
  $  034.扩展模式                                                    $    $                 $    $  ANS001.BYTE029  $  if(((X1>>1)&1)) Y=@0e09;else Y=@0e0a;
  $  035.解锁安全访问                                                $    $                 $    $  ANS001.BYTE029  $  if(((X1>>2)&1)) Y=@0e07;else Y=@0e08;
  $  036.碰撞前模式                                                  $    $                 $    $  ANS001.BYTE029  $  if(((X1>>3)&1)) Y=@0bc8;else Y=@0e04;
  $  037.碰撞后模式                                                  $    $                 $    $  ANS001.BYTE029  $  if(((X1>>4)&1)) Y=@0bc3;else Y=@0e03;
  $  038.读取前排司机PAS信息_年                                      $    $                 $    $  ANS002.BYTE004  $  Y=X1&0x1f;
  $  039.读取前排司机PAS信息_月                                      $    $                 $    $  ANS002.BYTE004  $  Y=((X1*256 + X2)/0x20)&0x0f;
  $  040.读取前排司机PAS信息_日                                      $    $                 $    $  ANS002.BYTE005  $  Y=(X1/0x02)&0x1f;
  $  041.读取前排司机PAS信息_SG 点线编号                             $    $                 $    $  ANS002.BYTE006  $  Y=HEX(X1);
  $  042.读取前排司机PAS 信息_ PAS中的SMB 的序列号                   $    $                 $    $  ANS002.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  043.读取前排司机PAS信息_PAS制造商                               $    $                 $    $  ANS002.BYTE013  $  Y=HEX(X1);
  $  044.读取前排乘客PAS信息_年                                      $    $                 $    $  ANS003.BYTE004  $  Y=X1&0x1f;
  $  045.读取前排乘客PAS信息_月                                      $    $                 $    $  ANS003.BYTE004  $  Y=((X1*256 + X2)/0x20)&0x0f;
  $  046.读取前排乘客PAS信息_日                                      $    $                 $    $  ANS003.BYTE005  $  Y=(X1/0x02)&0x1f;
  $  047.读取前排乘客PAS信息_SG点线编号                              $    $                 $    $  ANS003.BYTE006  $  Y=HEX(X1);
  $  048.读取前排乘客PAS信息_PAS中的SMB的序列号                      $    $                 $    $  ANS003.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  049.读取前排乘客PAS信息_PAS制造商                               $    $                 $    $  ANS003.BYTE013  $  Y=HEX(X1);
  $  050.读取前排司机UFS信息_年                                      $    $                 $    $  ANS004.BYTE004  $  Y=X1&0x1f;
  $  051.读取前排司机UFS信息_月                                      $    $                 $    $  ANS004.BYTE004  $  Y=((X1*256 + X2)/0x20)&0x0f;
  $  052.读取前排司机UFS信息_日                                      $    $                 $    $  ANS004.BYTE005  $  Y=(X1/0x02)&0x1f;
  $  053.读取前排司机UFS信息_SG点线编号                              $    $                 $    $  ANS004.BYTE006  $  Y=HEX(X1);
  $  054.读取前排司机UFS信息_UFS中的SMB的序列号                      $    $                 $    $  ANS004.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  055.读取前排司机UFS信息_UFS制造商                               $    $                 $    $  ANS004.BYTE013  $  Y=HEX(X1);
  $  056.读取前排乘客UFS信息_年                                      $    $                 $    $  ANS005.BYTE004  $  Y=X1&0x1f;
  $  057.读取前排乘客UFS信息_月                                      $    $                 $    $  ANS005.BYTE004  $  Y=((X1*256 + X2)/0x20)&0x0f;
  $  058.读取前排乘客UFS信息_日                                      $    $                 $    $  ANS005.BYTE005  $  Y=(X1/0x02)&0x1f;
  $  059.读取前排乘客UFS信息_SG点线编号                              $    $                 $    $  ANS005.BYTE006  $  Y=HEX(X1);
  $  060.读取前排乘客UFS信息_UFS中的SMB的序列号                      $    $                 $    $  ANS005.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  061.读取前排乘客UFS信息_UFS制造商                               $    $                 $    $  ANS005.BYTE013  $  Y=HEX(X1);
  $  062.碰撞记录完成标识                                            $    $                 $    $  ANS006.BYTE004  $  Y=HEX(X1);
  $  063.碰撞次数记数器                                              $    $                 $    $  ANS006.BYTE005  $  Y=X1;
  $  064.系统故障灯                                                  $    $                 $    $  ANS006.BYTE006  $  if((X1&0x03)==0) y=@0e0c;else if((X1&0x03)==1) y=@0e0d;else if((X1&0x03)==2) y=@0e0e;else y=@0004;
  $  065.PADI / PAB(乘客安全气囊) 指示灯                             $    $                 $    $  ANS006.BYTE006  $  if(((X1/0x04)&0x03)==0) y=@0e0c;else if(((X1/0x04)&0x03)==1) y=@0e0d;else if(((X1/0x04)&0x03)==2) y=@0e0e;else y=@0004;
  $  066.驾驶员安全带指示灯                                          $    $                 $    $  ANS006.BYTE006  $  if(((X1/0x10)&0x03)==0) y=@0e0c;else if(((X1/0x10)&0x03)==1) y=@0e0d;else if(((X1/0x10)&0x03)==2) y=@0e0e;else y=@0004;
  $  067.乘员安全带指示灯                                            $    $                 $    $  ANS006.BYTE006  $  if(((X1/0x40)&0x03)==0) y=@0e0c;else if(((X1/0x40)&0x03)==1) y=@0e0d;else if(((X1/0x40)&0x03)==2) y=@0e0e;else y=@0004;
  $  068.中央传感器1                                                 $    $                 $    $  ANS006.BYTE007  $  if(((X1>>0)&1)) Y=@0071;else Y=@00f5;
  $  069.中央传感器2                                                 $    $                 $    $  ANS006.BYTE007  $  if(((X1>>1)&1)) Y=@0071;else Y=@00f5;
  $  070.驾驶员侧外围加速度传感器                                    $    $                 $    $  ANS006.BYTE007  $  if(((X1>>2)&1)) Y=@0071;else Y=@00f5;
  $  071.乘员侧外围加速度传感器                                      $    $                 $    $  ANS006.BYTE007  $  if(((X1>>3)&1)) Y=@0071;else Y=@00f5;
  $  072.驾驶员侧前碰加速度传感器                                    $    $                 $    $  ANS006.BYTE007  $  if(((X1>>4)&1)) Y=@0071;else Y=@00f5;
  $  073.乘员侧前碰加速度传感器                                      $    $                 $    $  ANS006.BYTE007  $  if(((X1>>5)&1)) Y=@0071;else Y=@00f5;
  $  074.DIS_ SFL_HW 特殊解除线                                      $    $                 $    $  ANS006.BYTE008  $  if(((X1>>3)&1)) Y=@00f7;else Y=@02e8;
  $  075.DIS_ AHP_ All 高功率状态                                    $    $                 $    $  ANS006.BYTE008  $  if(((X1>>4)&1)) Y=@00f7;else Y=@02e8;
  $  076.DIS_ AHP_ All 低功率状态                                    $    $                 $    $  ANS006.BYTE008  $  if(((X1>>5)&1)) Y=@00f7;else Y=@02e8;
  $  077.驾驶员座椅位置                                              $    $                 $    $  ANS006.BYTE009  $  if((X1&0x03)==0) y=@0e0f;else if((X1&0x03)==1) y=@0e10;else if((X1&0x03)==2) y=@0071;else if((X1&0x03)==3) y=@0e11;else y=@0004;
  $  078.ISOFIX                                                      $    $                 $    $  ANS006.BYTE009  $  if(((X1/0x04)&0x03)==0) y=@0e0f;else if(((X1/0x04)&0x03)==1) y=@0e10;else if(((X1/0x04)&0x03)==2) y=@0071;else if(((X1/0x04)&0x03)==3) y=@0e11;else y=@0004;
  $  079.驾驶员安全带锁扣                                            $    $                 $    $  ANS006.BYTE010  $  if((X1&0x03)==0) y=@0e0f;else if((X1&0x03)==1) y=@0e10;else if((X1&0x03)==2) y=@0071;else if((X1&0x03)==3) y=@0e11;else y=@0004;
  $  080.乘员安全带锁扣                                              $    $                 $    $  ANS006.BYTE010  $  if(((X1/0x04)&0x03)==0) y=@0e0f;else if(((X1/0x04)&0x03)==1) y=@0e10;else if(((X1/0x04)&0x03)==2) y=@0071;else if(((X1/0x04)&0x03)==3) y=@0e11;else y=@0004;
  $  081.PADS / PAB(乘客安全气囊) 开关                               $    $                 $    $  ANS006.BYTE010  $  if(((X1/0x10)&0x03)==0) y=@0e0f;else if(((X1/0x10)&0x03)==1) y=@0e10;else if(((X1/0x10)&0x03)==2) y=@0071;else if(((X1/0x10)&0x03)==3) y=@0e11;else y=@0004;
  $  082.从RAM(随机存储器) 中读出的故障代码                          $    $                 $    $  ANS006.BYTE011  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  083.车速                                                        $    $  km/h           $    $  ANS006.BYTE043  $  Y=(X1*256+X2)*0.01;
  $  084.运行时间计数器                                              $    $                 $    $  ANS006.BYTE045  $  Y=X1*16777216+X2*65536+X3*256+X4;
  $  085.ACU(气囊控制器) Y传感器侧面接近引爆                         $    $                 $    $  ANS006.BYTE049  $  if(((X1>>0)&1)) Y=@012f;else Y=@0130;
  $  086.后侧接近引爆                                                $    $                 $    $  ANS006.BYTE049  $  if(((X1>>1)&1)) Y=@012f;else Y=@0130;
  $  087.前气囊引爆                                                  $    $                 $    $  ANS006.BYTE050  $  if(((X1>>0)&1)) Y=@012f;else Y=@0130;
  $  088.驾驶员侧气囊引爆                                            $    $                 $    $  ANS006.BYTE050  $  if(((X1>>1)&1)) Y=@012f;else Y=@0130;
  $  089.乘员侧气囊引爆                                              $    $                 $    $  ANS006.BYTE050  $  if(((X1>>2)&1)) Y=@012f;else Y=@0130;
  $  090.预拉紧式安全带引爆                                          $    $                 $    $  ANS006.BYTE050  $  if(((X1>>3)&1)) Y=@012f;else Y=@0130;
  $  091.后侧起爆                                                    $    $                 $    $  ANS006.BYTE050  $  if(((X1>>4)&1)) Y=@012f;else Y=@0130;
  $  092.前气囊接近引爆                                              $    $                 $    $  ANS006.BYTE050  $  if(((X1>>5)&1)) Y=@012f;else Y=@0130;
  $  093.驾驶员侧气囊接近引爆                                        $    $                 $    $  ANS006.BYTE050  $  if(((X1>>6)&1)) Y=@012f;else Y=@0130;
  $  094.乘员侧气囊接近引爆                                          $    $                 $    $  ANS006.BYTE050  $  if(((X1>>7)&1)) Y=@012f;else Y=@0130;
  $  095.正面碰撞有可靠性                                            $    $                 $    $  ANS006.BYTE051  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  096.侧碰撞有可靠性                                              $    $                 $    $  ANS006.BYTE051  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  097.后碰撞有可靠性                                              $    $                 $    $  ANS006.BYTE051  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  098.算法启动时间                                                $    $  ms             $    $  ANS006.BYTE052  $  Y=X1*0.5;
  $  099.从发生碰撞到接近引爆的时间                                  $    $  ms             $    $  ANS006.BYTE053  $  Y=(X1*256+X2)*0.5;
  $  100.从发生碰撞到前算法达到前气囊预值的时间                      $    $  ms             $    $  ANS006.BYTE055  $  Y=(X1*256+X2)*0.5;
  $  101.从发生碰撞到侧算法达到侧气囊预值的时间                      $    $  ms             $    $  ANS006.BYTE057  $  Y=(X1*256+X2)*0.5;
  $  102.从发生碰撞到预拉紧式安全带引爆的时间                        $    $  ms             $    $  ANS006.BYTE059  $  Y=(X1*256+X2)*0.5;
  $  103.从发生碰撞到前气囊引爆的时间                                $    $  ms             $    $  ANS006.BYTE061  $  Y=(X1*256+X2)*0.5;
  $  104.从发生碰撞到侧气囊引爆的时间                                $    $  ms             $    $  ANS006.BYTE063  $  Y=(X1*256+X2)*0.5;
  $  105.算法运行时间                                                $    $  ms             $    $  ANS006.BYTE065  $  Y=(X1*256+X2)*0.5;
  $  106.算法启动期间X轴方向最大加速度                               $    $  G(Gravity)     $    $  ANS006.BYTE067  $  Y=X1*0.8;
  $  107.算法启动期间Y轴方向最大加速度                               $    $  G(Gravity)     $    $  ANS006.BYTE068  $  Y=X1*0.8;
  $  108.算法启动期间驾驶员侧外围加速度传感器最大加速度              $    $  G(Gravity)     $    $  ANS006.BYTE069  $  Y=X1*1;
  $  109.算法启动期间乘员侧外围加速度传感器最大加速度                $    $  G(Gravity)     $    $  ANS006.BYTE070  $  Y=X1*1;
  $  110.从发生碰撞到X 轴最大加速度的时间                            $    $  ms             $    $  ANS006.BYTE073  $  Y=(X1*256+X2)*0.5;
  $  111.从发生碰撞到Y 轴最大加速度的时间                            $    $  ms             $    $  ANS006.BYTE075  $  Y=(X1*256+X2)*0.5;
  $  112.从发生碰撞到驾驶员侧外围加速度传感器最大加速度的时间        $    $  ms             $    $  ANS006.BYTE077  $  Y=(X1*256+X2)*0.5;
  $  113.从发生碰撞到乘员侧外围加速度传感器最大加速度的时间          $    $  ms             $    $  ANS006.BYTE079  $  Y=(X1*256+X2)*0.5;
  $  114.速度变量                                                    $    $  km/h           $    $  ANS006.BYTE085  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  115.点火回路1电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE105  $  Y=X1*0.025;
  $  116.点火回路2电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE106  $  Y=X1*0.025;
  $  117.点火回路3电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE107  $  Y=X1*0.025;
  $  118.点火回路4电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE108  $  Y=X1*0.025;
  $  119.点火回路5电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE109  $  Y=X1*0.025;
  $  120.点火回路6电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE110  $  Y=X1*0.025;
  $  121.点火回路7电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE111  $  Y=X1*0.025;
  $  122.点火回路8电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE112  $  Y=X1*0.025;
  $  123.点火回路9电流流过的时间                                     $    $  ms             $    $  ANS006.BYTE113  $  Y=X1*0.025;
  $  124.点火回路10电流流过的时间                                    $    $  ms             $    $  ANS006.BYTE114  $  Y=X1*0.025;
  $  125.在碰撞发生时的能量储备电压                                  $    $  V              $    $  ANS006.BYTE117  $  Y=X1*0.2;
  $  126.在引爆气囊后能量储备电压                                    $    $  V              $    $  ANS006.BYTE118  $  Y=X1*0.2;
  $  127.引爆前电源电压                                              $    $  V              $    $  ANS006.BYTE119  $  Y=X1*0.1;
  $  128.引爆后电源电压                                              $    $  V              $    $  ANS006.BYTE120  $  Y=X1*0.1;
  $  129.碰撞输出信号已发送                                          $    $                 $    $  ANS006.BYTE121  $  if(((X1>>0)&1)) Y=@0e12;else Y=@0e13;
  $  130.前气囊引爆的次数                                            $    $                 $    $  ANS007.BYTE004  $  Y=X1;
  $  131.侧气囊引爆的次数                                            $    $                 $    $  ANS007.BYTE005  $  Y=X1;
  $  132.安全带预紧器引爆的次数                                      $    $                 $    $  ANS007.BYTE007  $  Y=X1;
  $  133.总的碰撞次数包含引爆和接近引爆                              $    $                 $    $  ANS007.BYTE008  $  Y=X1;
  $  134.碰撞记录1 被锁定                                            $    $                 $    $  ANS007.BYTE009  $  if(((X1>>0)&1)) Y=@012f;else Y=@0130;
  $  135.加速度信息所属的碰撞记录被锁定                              $    $                 $    $  ANS007.BYTE009  $  if(((X1>>4)&1)) Y=@012f;else Y=@0130;
  $  136.加速度信息所属的碰撞记录区                                  $    $                 $    $  ANS007.BYTE010  $  if(X1==2) y=@0e14;else if(X1==1) y=@0e15;else if(X1==3) y=@0e16;else y=@0004;
  $  137.含有最新数据的碰撞记录                                      $    $                 $    $  ANS007.BYTE011  $  Y=X1;
  $  138.碰撞记录已经被正确记录                                      $    $                 $    $  ANS008.BYTE004  $  Y=HEX(X1);
  $  139.加速度数据所属的碰撞记录                                    $    $                 $    $  ANS008.BYTE005  $  if(X1==2) y=@0e14;else if(X1==1) y=@0e15;else if(X1==3) y=@0e16;else y=@0004;
  $  140.中央传感器1 通道40 字节的采样数据                           $    $                 $    $  ANS008.BYTE006  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40);
  $  141.中央传感器2 通道40 字节的采样数据                           $    $                 $    $  ANS008.BYTE046  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40);
  $  142.碰撞记录已经被正确记录                                      $    $                 $    $  ANS009.BYTE004  $  Y=HEX(X1);
  $  143.加速度数据所属的碰撞记录                                    $    $                 $    $  ANS009.BYTE005  $  Y=X1;
  $  144.每0.5ms来自驾驶员侧外围加速度传感器的40 字节采样数据        $    $                 $    $  ANS009.BYTE006  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40);
  $  145.每0.5ms来自副驾驶侧外围加速度传感器的40 字节采样数据        $    $                 $    $  ANS009.BYTE046  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40);
  $  146.每0.5ms 来自驾驶员侧前碰加速度传感器的40 字节采样数据       $    $                 $    $  ANS009.BYTE086  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40);
  $  147.每0.5ms来自副驾驶侧外围加速度传感器的40 字节采样数据        $    $                 $    $  ANS009.BYTE126  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40);
  $  148.驾驶员前气囊回路阻值                                        $    $  ohm            $    $  ANS010.BYTE004  $  Y=X1*0.1;
  $  149.乘员前气囊回路阻值                                          $    $  ohm            $    $  ANS010.BYTE005  $  Y=X1*0.1;
  $  150.驾驶员安全带预紧器回路阻值                                  $    $  ohm            $    $  ANS010.BYTE006  $  Y=X1*0.1;
  $  151.乘员安全带预紧器回路阻值                                    $    $  ohm            $    $  ANS010.BYTE007  $  Y=X1*0.1;
  $  152.驾驶员侧气囊回路阻值                                        $    $  ohm            $    $  ANS010.BYTE008  $  Y=X1*0.1;
  $  153.乘员侧气囊回路阻值                                          $    $  ohm            $    $  ANS010.BYTE009  $  Y=X1*0.1;
  $  154.驾驶员侧侧气帘回路阻值                                      $    $  ohm            $    $  ANS010.BYTE010  $  Y=X1*0.1;
  $  155.乘员侧侧气帘回路阻值                                        $    $  ohm            $    $  ANS010.BYTE011  $  Y=X1*0.1;
  $  156.乘员前气囊开关阻值                                          $    $                 $    $  ANS010.BYTE016  $  Y=X1*256+X2;
  $  157.驾驶员安全带锁扣阻值                                        $    $                 $    $  ANS010.BYTE018  $  Y=X1*256+X2;
  $  158.乘员安全带锁扣阻值                                          $    $                 $    $  ANS010.BYTE020  $  Y=X1*256+X2;
  $  159.乘员检测传感器阻值                                          $    $                 $    $  ANS010.BYTE022  $  Y=X1*256+X2;
  $  160.供应商生产日期-年                                           $    $                 $    $  ANS011.BYTE004  $  Y=HEX(X1,X2);
  $  161.供应商生产日期-月                                           $    $                 $    $  ANS011.BYTE006  $  Y=HEX(X1);
  $  162.供应商生产日期-日                                           $    $                 $    $  ANS011.BYTE007  $  Y=HEX(X1);
  $  163.EEPROM(电可擦除只读存储器)版本                              $    $                 $    $  ANS011.BYTE008  $  Y=HEX(X1,X2,X3);
  $  164.供应商零件号代码                                            $    $                 $    $  ANS011.BYTE011  $  Y=ASCII(X1,X2,X3,X4);
  $  165.产品序列号                                                  $    $                 $    $  ANS011.BYTE015  $  Y=HEX(X1,X2,X3,X4);
  $  166.客户项目ID                                                  $    $                 $    $  ANS011.BYTE019  $  Y=HEX(X1,X2);
  $  167.PAS前排司机ID                                               $    $                 $    $  ANS011.BYTE021  $  Y=HEX(X1,X2);
  $  168.PAS前排乘客ID                                               $    $                 $    $  ANS011.BYTE023  $  Y=HEX(X1,X2);
  $  169.MDS算法ID                                                   $    $                 $    $  ANS011.BYTE029  $  Y=HEX(X1);
  $  170.主算法ID                                                    $    $                 $    $  ANS011.BYTE030  $  Y=HEX(X1);
  $  171.释放矩阵算法ID                                              $    $                 $    $  ANS011.BYTE031  $  Y=HEX(X1);
  $  172.点火顺序算法ID                                              $    $                 $    $  ANS011.BYTE032  $  Y=HEX(X1);
  $  173.参数ID                                                      $    $                 $    $  ANS011.BYTE033  $  Y=HEX(X1);
  $  174.软件版本ID                                                  $    $                 $    $  ANS011.BYTE034  $  Y=HEX(X1,X2);
  $  175.参数传输ID                                                  $    $                 $    $  ANS011.BYTE036  $  Y=HEX(X1,X2,X3,X4);
  $  176.校验值字节                                                  $    $                 $    $  ANS011.BYTE040  $  Y=HEX(X1,X2,X3,X4);
  $  177.当前运行时间记数器                                          $    $                 $    $  ANS011.BYTE044  $  Y=X1*65536+X2*256+X3;
  $  178.开-关机记数器                                               $    $                 $    $  ANS011.BYTE047  $  Y=X1*256+X2;
  $  179.供应商硬件号                                                $    $                 $    $  ANS011.BYTE049  $  Y=HEX(X1);
  $  180.供应商软件号                                                $    $                 $    $  ANS011.BYTE050  $  Y=HEX(X1);
  $  181.碰撞记录完成标识                                            $    $                 $    $  ANS012.BYTE004  $  Y=HEX(X1);
  $  182.碰撞次数记数器                                              $    $                 $    $  ANS012.BYTE005  $  Y=X1;
  $  183.系统故障灯                                                  $    $                 $    $  ANS012.BYTE006  $  if((X1&0x03)==0) y=@0e0c;else if((X1&0x03)==1) y=@0e0d;else if((X1&0x03)==2) y=@0e0e;else y=@0004;
  $  184.PADI / PAB(乘客安全气囊) 指示灯                             $    $                 $    $  ANS012.BYTE006  $  if(((X1/0x04)&0x03)==0) y=@0e0c;else if(((X1/0x04)&0x03)==1) y=@0e0d;else if(((X1/0x04)&0x03)==2) y=@0e0e;else y=@0004;
  $  185.驾驶员安全带指示灯                                          $    $                 $    $  ANS012.BYTE006  $  if(((X1/0x10)&0x03)==0) y=@0e0c;else if(((X1/0x10)&0x03)==1) y=@0e0d;else if(((X1/0x10)&0x03)==2) y=@0e0e;else y=@0004;
  $  186.乘员安全带指示灯                                            $    $                 $    $  ANS012.BYTE006  $  if(((X1/0x40)&0x03)==0) y=@0e0c;else if(((X1/0x40)&0x03)==1) y=@0e0d;else if(((X1/0x40)&0x03)==2) y=@0e0e;else y=@0004;
  $  187.中央传感器1                                                 $    $                 $    $  ANS012.BYTE007  $  if(((X1>>0)&1)) Y=@0071;else Y=@00f5;
  $  188.中央传感器2                                                 $    $                 $    $  ANS012.BYTE007  $  if(((X1>>1)&1)) Y=@0071;else Y=@00f5;
  $  189.驾驶员侧外围加速度传感器                                    $    $                 $    $  ANS012.BYTE007  $  if(((X1>>2)&1)) Y=@0071;else Y=@00f5;
  $  190.乘员侧外围加速度传感器                                      $    $                 $    $  ANS012.BYTE007  $  if(((X1>>3)&1)) Y=@0071;else Y=@00f5;
  $  191.驾驶员侧前碰加速度传感器                                    $    $                 $    $  ANS012.BYTE007  $  if(((X1>>4)&1)) Y=@0071;else Y=@00f5;
  $  192.乘员侧前碰加速度传感器                                      $    $                 $    $  ANS012.BYTE007  $  if(((X1>>5)&1)) Y=@0071;else Y=@00f5;
  $  193.DIS_ SFL_HW 特殊解除线                                      $    $                 $    $  ANS012.BYTE008  $  if(((X1>>3)&1)) Y=@00f7;else Y=@02e8;
  $  194.DIS_ AHP_ All 高功率状态                                    $    $                 $    $  ANS012.BYTE008  $  if(((X1>>4)&1)) Y=@00f7;else Y=@02e8;
  $  195.DIS_ AHP_ All 低功率状态                                    $    $                 $    $  ANS012.BYTE008  $  if(((X1>>5)&1)) Y=@00f7;else Y=@02e8;
  $  196.驾驶员座椅位置                                              $    $                 $    $  ANS012.BYTE009  $  if((X1&0x03)==0) y=@0e0f;else if((X1&0x03)==1) y=@0e10;else if((X1&0x03)==2) y=@0071;else if((X1&0x03)==3) y=@0e11;else y=@0004;
  $  197.ISOFIX                                                      $    $                 $    $  ANS012.BYTE009  $  if(((X1/0x04)&0x03)==0) y=@0e0f;else if(((X1/0x04)&0x03)==1) y=@0e10;else if(((X1/0x04)&0x03)==2) y=@0071;else if(((X1/0x04)&0x03)==3) y=@0e11;else y=@0004;
  $  198.驾驶员安全带锁扣                                            $    $                 $    $  ANS012.BYTE010  $  if((X1&0x03)==0) y=@0e0f;else if((X1&0x03)==1) y=@0e10;else if((X1&0x03)==2) y=@0071;else if((X1&0x03)==3) y=@0e11;else y=@0004;
  $  199.乘员安全带锁扣                                              $    $                 $    $  ANS012.BYTE010  $  if(((X1/0x04)&0x03)==0) y=@0e0f;else if(((X1/0x04)&0x03)==1) y=@0e10;else if(((X1/0x04)&0x03)==2) y=@0071;else if(((X1/0x04)&0x03)==3) y=@0e11;else y=@0004;
  $  200.PADS / PAB(乘客安全气囊) 开关                               $    $                 $    $  ANS012.BYTE010  $  if(((X1/0x10)&0x03)==0) y=@0e0f;else if(((X1/0x10)&0x03)==1) y=@0e10;else if(((X1/0x10)&0x03)==2) y=@0071;else if(((X1/0x10)&0x03)==3) y=@0e11;else y=@0004;
  $  201.从RAM(随机存储器) 中读出的故障代码                          $    $                 $    $  ANS012.BYTE011  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  202.车速                                                        $    $  km/h           $    $  ANS012.BYTE043  $  Y=(X1*256+X2)*0.01;
  $  203.运行时间计数器                                              $    $                 $    $  ANS012.BYTE045  $  Y=X1*16777216+X2*65536+X3*256+X4;
  $  204.ACU(气囊控制器) Y传感器侧面接近引爆                         $    $                 $    $  ANS012.BYTE049  $  if(((X1>>0)&1)) Y=@012f;else Y=@0130;
  $  205.后侧接近引爆                                                $    $                 $    $  ANS012.BYTE049  $  if(((X1>>1)&1)) Y=@012f;else Y=@0130;
  $  206.前气囊引爆                                                  $    $                 $    $  ANS012.BYTE050  $  if(((X1>>0)&1)) Y=@012f;else Y=@0130;
  $  207.驾驶员侧气囊引爆                                            $    $                 $    $  ANS012.BYTE050  $  if(((X1>>1)&1)) Y=@012f;else Y=@0130;
  $  208.乘员侧气囊引爆                                              $    $                 $    $  ANS012.BYTE050  $  if(((X1>>2)&1)) Y=@012f;else Y=@0130;
  $  209.预拉紧式安全带引爆                                          $    $                 $    $  ANS012.BYTE050  $  if(((X1>>3)&1)) Y=@012f;else Y=@0130;
  $  210.后侧起爆                                                    $    $                 $    $  ANS012.BYTE050  $  if(((X1>>4)&1)) Y=@012f;else Y=@0130;
  $  211.前气囊接近引爆                                              $    $                 $    $  ANS012.BYTE050  $  if(((X1>>5)&1)) Y=@012f;else Y=@0130;
  $  212.驾驶员侧气囊接近引爆                                        $    $                 $    $  ANS012.BYTE050  $  if(((X1>>6)&1)) Y=@012f;else Y=@0130;
  $  213.乘员侧气囊接近引爆                                          $    $                 $    $  ANS012.BYTE050  $  if(((X1>>7)&1)) Y=@012f;else Y=@0130;
  $  214.正面碰撞有可靠性                                            $    $                 $    $  ANS012.BYTE051  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  215.侧碰撞有可靠性                                              $    $                 $    $  ANS012.BYTE051  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  216.后碰撞有可靠性                                              $    $                 $    $  ANS012.BYTE051  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  217.算法启动时间                                                $    $  ms             $    $  ANS012.BYTE052  $  Y=X1*0.5;
  $  218.从发生碰撞到接近引爆的时间                                  $    $  ms             $    $  ANS012.BYTE053  $  Y=(X1*256+X2)*0.5;
  $  219.从发生碰撞到前算法达到前气囊预值的时间                      $    $  ms             $    $  ANS012.BYTE055  $  Y=(X1*256+X2)*0.5;
  $  220.从发生碰撞到侧算法达到侧气囊预值的时间                      $    $  ms             $    $  ANS012.BYTE057  $  Y=(X1*256+X2)*0.5;
  $  221.从发生碰撞到预拉紧式安全带引爆的时间                        $    $  ms             $    $  ANS012.BYTE059  $  Y=(X1*256+X2)*0.5;
  $  222.从发生碰撞到前气囊引爆的时间                                $    $  ms             $    $  ANS012.BYTE061  $  Y=(X1*256+X2)*0.5;
  $  223.从发生碰撞到侧气囊引爆的时间                                $    $  ms             $    $  ANS012.BYTE063  $  Y=(X1*256+X2)*0.5;
  $  224.算法运行时间                                                $    $  ms             $    $  ANS012.BYTE065  $  Y=(X1*256+X2)*0.5;
  $  225.算法启动期间X轴方向最大加速度                               $    $  G(Gravity)     $    $  ANS012.BYTE067  $  Y=X1*0.8;
  $  226.算法启动期间Y轴方向最大加速度                               $    $  G(Gravity)     $    $  ANS012.BYTE068  $  Y=X1*0.8;
  $  227.算法启动期间驾驶员侧外围加速度传感器最大加速度              $    $  G(Gravity)     $    $  ANS012.BYTE069  $  Y=X1*1;
  $  228.算法启动期间乘员侧外围加速度传感器最大加速度                $    $  G(Gravity)     $    $  ANS012.BYTE070  $  Y=X1*1;
  $  229.从发生碰撞到X 轴最大加速度的时间                            $    $  ms             $    $  ANS012.BYTE073  $  Y=(X1*256+X2)*0.5;
  $  230.从发生碰撞到Y 轴最大加速度的时间                            $    $  ms             $    $  ANS012.BYTE075  $  Y=(X1*256+X2)*0.5;
  $  231.从发生碰撞到驾驶员侧外围加速度传感器最大加速度的时间        $    $  ms             $    $  ANS012.BYTE077  $  Y=(X1*256+X2)*0.5;
  $  232.从发生碰撞到乘员侧外围加速度传感器最大加速度的时间          $    $  ms             $    $  ANS012.BYTE079  $  Y=(X1*256+X2)*0.5;
  $  233.速度变量                                                    $    $  km/h           $    $  ANS012.BYTE085  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  234.点火回路1电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE105  $  Y=X1*0.025;
  $  235.点火回路2电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE106  $  Y=X1*0.025;
  $  236.点火回路3电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE107  $  Y=X1*0.025;
  $  237.点火回路4电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE108  $  Y=X1*0.025;
  $  238.点火回路5电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE109  $  Y=X1*0.025;
  $  239.点火回路6电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE110  $  Y=X1*0.025;
  $  240.点火回路7电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE111  $  Y=X1*0.025;
  $  241.点火回路8电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE112  $  Y=X1*0.025;
  $  242.点火回路9电流流过的时间                                     $    $  ms             $    $  ANS012.BYTE113  $  Y=X1*0.025;
  $  243.点火回路10电流流过的时间                                    $    $  ms             $    $  ANS012.BYTE114  $  Y=X1*0.025;
  $  244.在碰撞发生时的能量储备电压                                  $    $  V              $    $  ANS012.BYTE117  $  Y=X1*0.2;
  $  245.在引爆气囊后能量储备电压                                    $    $  V              $    $  ANS012.BYTE118  $  Y=X1*0.2;
  $  246.引爆前电源电压                                              $    $  V              $    $  ANS012.BYTE119  $  Y=X1*0.1;
  $  247.引爆后电源电压                                              $    $  V              $    $  ANS012.BYTE120  $  Y=X1*0.1;
  $  248.碰撞输出信号已发送                                          $    $                 $    $  ANS012.BYTE121  $  if(((X1>>0)&1)) Y=@0e12;else Y=@0e13;
  $  249.碰撞记录完成标识                                            $    $                 $    $  ANS013.BYTE004  $  Y=HEX(X1);
  $  250.碰撞次数记数器                                              $    $                 $    $  ANS013.BYTE005  $  Y=X1;
  $  251.系统故障灯                                                  $    $                 $    $  ANS013.BYTE006  $  if((X1&0x03)==0) y=@0e0c;else if((X1&0x03)==1) y=@0e0d;else if((X1&0x03)==2) y=@0e0e;else y=@0004;
  $  252.PADI / PAB(乘客安全气囊) 指示灯                             $    $                 $    $  ANS013.BYTE006  $  if(((X1/0x04)&0x03)==0) y=@0e0c;else if(((X1/0x04)&0x03)==1) y=@0e0d;else if(((X1/0x04)&0x03)==2) y=@0e0e;else y=@0004;
  $  253.驾驶员安全带指示灯                                          $    $                 $    $  ANS013.BYTE006  $  if(((X1/0x10)&0x03)==0) y=@0e0c;else if(((X1/0x10)&0x03)==1) y=@0e0d;else if(((X1/0x10)&0x03)==2) y=@0e0e;else y=@0004;
  $  254.乘员安全带指示灯                                            $    $                 $    $  ANS013.BYTE006  $  if(((X1/0x40)&0x03)==0) y=@0e0c;else if(((X1/0x40)&0x03)==1) y=@0e0d;else if(((X1/0x40)&0x03)==2) y=@0e0e;else y=@0004;
  $  255.中央传感器1                                                 $    $                 $    $  ANS013.BYTE007  $  if(((X1>>0)&1)) Y=@0071;else Y=@00f5;
  $  256.中央传感器2                                                 $    $                 $    $  ANS013.BYTE007  $  if(((X1>>1)&1)) Y=@0071;else Y=@00f5;
  $  257.驾驶员侧外围加速度传感器                                    $    $                 $    $  ANS013.BYTE007  $  if(((X1>>2)&1)) Y=@0071;else Y=@00f5;
  $  258.乘员侧外围加速度传感器                                      $    $                 $    $  ANS013.BYTE007  $  if(((X1>>3)&1)) Y=@0071;else Y=@00f5;
  $  259.驾驶员侧前碰加速度传感器                                    $    $                 $    $  ANS013.BYTE007  $  if(((X1>>4)&1)) Y=@0071;else Y=@00f5;
  $  260.乘员侧前碰加速度传感器                                      $    $                 $    $  ANS013.BYTE007  $  if(((X1>>5)&1)) Y=@0071;else Y=@00f5;
  $  261.DIS_ SFL_HW 特殊解除线                                      $    $                 $    $  ANS013.BYTE008  $  if(((X1>>3)&1)) Y=@00f7;else Y=@02e8;
  $  262.DIS_ AHP_ All 高功率状态                                    $    $                 $    $  ANS013.BYTE008  $  if(((X1>>4)&1)) Y=@00f7;else Y=@02e8;
  $  263.DIS_ AHP_ All 低功率状态                                    $    $                 $    $  ANS013.BYTE008  $  if(((X1>>5)&1)) Y=@00f7;else Y=@02e8;
  $  264.驾驶员座椅位置                                              $    $                 $    $  ANS013.BYTE009  $  if((X1&0x03)==0) y=@0e0f;else if((X1&0x03)==1) y=@0e10;else if((X1&0x03)==2) y=@0071;else if((X1&0x03)==3) y=@0e11;else y=@0004;
  $  265.ISOFIX                                                      $    $                 $    $  ANS013.BYTE009  $  if(((X1/0x04)&0x03)==0) y=@0e0f;else if(((X1/0x04)&0x03)==1) y=@0e10;else if(((X1/0x04)&0x03)==2) y=@0071;else if(((X1/0x04)&0x03)==3) y=@0e11;else y=@0004;
  $  266.驾驶员安全带锁扣                                            $    $                 $    $  ANS013.BYTE010  $  if((X1&0x03)==0) y=@0e0f;else if((X1&0x03)==1) y=@0e10;else if((X1&0x03)==2) y=@0071;else if((X1&0x03)==3) y=@0e11;else y=@0004;
  $  267.乘员安全带锁扣                                              $    $                 $    $  ANS013.BYTE010  $  if(((X1/0x04)&0x03)==0) y=@0e0f;else if(((X1/0x04)&0x03)==1) y=@0e10;else if(((X1/0x04)&0x03)==2) y=@0071;else if(((X1/0x04)&0x03)==3) y=@0e11;else y=@0004;
  $  268.PADS / PAB(乘客安全气囊) 开关                               $    $                 $    $  ANS013.BYTE010  $  if(((X1/0x10)&0x03)==0) y=@0e0f;else if(((X1/0x10)&0x03)==1) y=@0e10;else if(((X1/0x10)&0x03)==2) y=@0071;else if(((X1/0x10)&0x03)==3) y=@0e11;else y=@0004;
  $  269.从RAM(随机存储器) 中读出的故障代码                          $    $                 $    $  ANS013.BYTE011  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  270.车速                                                        $    $  km/h           $    $  ANS013.BYTE043  $  Y=(X1*256+X2)*0.01;
  $  271.运行时间计数器                                              $    $                 $    $  ANS013.BYTE045  $  Y=X1*16777216+X2*65536+X3*256+X4;
  $  272.ACU(气囊控制器) Y传感器侧面接近引爆                         $    $                 $    $  ANS013.BYTE049  $  if(((X1>>0)&1)) Y=@012f;else Y=@0130;
  $  273.后侧接近引爆                                                $    $                 $    $  ANS013.BYTE049  $  if(((X1>>1)&1)) Y=@012f;else Y=@0130;
  $  274.前气囊引爆                                                  $    $                 $    $  ANS013.BYTE050  $  if(((X1>>0)&1)) Y=@012f;else Y=@0130;
  $  275.驾驶员侧气囊引爆                                            $    $                 $    $  ANS013.BYTE050  $  if(((X1>>1)&1)) Y=@012f;else Y=@0130;
  $  276.乘员侧气囊引爆                                              $    $                 $    $  ANS013.BYTE050  $  if(((X1>>2)&1)) Y=@012f;else Y=@0130;
  $  277.预拉紧式安全带引爆                                          $    $                 $    $  ANS013.BYTE050  $  if(((X1>>3)&1)) Y=@012f;else Y=@0130;
  $  278.后侧起爆                                                    $    $                 $    $  ANS013.BYTE050  $  if(((X1>>4)&1)) Y=@012f;else Y=@0130;
  $  279.前气囊接近引爆                                              $    $                 $    $  ANS013.BYTE050  $  if(((X1>>5)&1)) Y=@012f;else Y=@0130;
  $  280.驾驶员侧气囊接近引爆                                        $    $                 $    $  ANS013.BYTE050  $  if(((X1>>6)&1)) Y=@012f;else Y=@0130;
  $  281.乘员侧气囊接近引爆                                          $    $                 $    $  ANS013.BYTE050  $  if(((X1>>7)&1)) Y=@012f;else Y=@0130;
  $  282.正面碰撞有可靠性                                            $    $                 $    $  ANS013.BYTE051  $  if(((X1>>0)&1)) Y=@0015;else Y=@0014;
  $  283.侧碰撞有可靠性                                              $    $                 $    $  ANS013.BYTE051  $  if(((X1>>1)&1)) Y=@0015;else Y=@0014;
  $  284.后碰撞有可靠性                                              $    $                 $    $  ANS013.BYTE051  $  if(((X1>>2)&1)) Y=@0015;else Y=@0014;
  $  285.算法启动时间                                                $    $  ms             $    $  ANS013.BYTE052  $  Y=X1*0.5;
  $  286.从发生碰撞到接近引爆的时间                                  $    $  ms             $    $  ANS013.BYTE053  $  Y=(X1*256+X2)*0.5;
  $  287.从发生碰撞到前算法达到前气囊预值的时间                      $    $  ms             $    $  ANS013.BYTE055  $  Y=(X1*256+X2)*0.5;
  $  288.从发生碰撞到侧算法达到侧气囊预值的时间                      $    $  ms             $    $  ANS013.BYTE057  $  Y=(X1*256+X2)*0.5;
  $  289.从发生碰撞到预拉紧式安全带引爆的时间                        $    $  ms             $    $  ANS013.BYTE059  $  Y=(X1*256+X2)*0.5;
  $  290.从发生碰撞到前气囊引爆的时间                                $    $  ms             $    $  ANS013.BYTE061  $  Y=(X1*256+X2)*0.5;
  $  291.从发生碰撞到侧气囊引爆的时间                                $    $  ms             $    $  ANS013.BYTE063  $  Y=(X1*256+X2)*0.5;
  $  292.算法运行时间                                                $    $  ms             $    $  ANS013.BYTE065  $  Y=(X1*256+X2)*0.5;
  $  293.算法启动期间X轴方向最大加速度                               $    $  G(Gravity)     $    $  ANS013.BYTE067  $  Y=X1*0.8;
  $  294.算法启动期间Y轴方向最大加速度                               $    $  G(Gravity)     $    $  ANS013.BYTE068  $  Y=X1*0.8;
  $  295.算法启动期间驾驶员侧外围加速度传感器最大加速度              $    $  G(Gravity)     $    $  ANS013.BYTE069  $  Y=X1*1;
  $  296.算法启动期间乘员侧外围加速度传感器最大加速度                $    $  G(Gravity)     $    $  ANS013.BYTE070  $  Y=X1*1;
  $  297.从发生碰撞到X 轴最大加速度的时间                            $    $  ms             $    $  ANS013.BYTE073  $  Y=(X1*256+X2)*0.5;
  $  298.从发生碰撞到Y 轴最大加速度的时间                            $    $  ms             $    $  ANS013.BYTE075  $  Y=(X1*256+X2)*0.5;
  $  299.从发生碰撞到驾驶员侧外围加速度传感器最大加速度的时间        $    $  ms             $    $  ANS013.BYTE077  $  Y=(X1*256+X2)*0.5;
  $  300.从发生碰撞到乘员侧外围加速度传感器最大加速度的时间          $    $  ms             $    $  ANS013.BYTE079  $  Y=(X1*256+X2)*0.5;
  $  301.速度变量                                                    $    $  km/h           $    $  ANS013.BYTE085  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  302.点火回路1电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE105  $  Y=X1*0.025;
  $  303.点火回路2电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE106  $  Y=X1*0.025;
  $  304.点火回路3电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE107  $  Y=X1*0.025;
  $  305.点火回路4电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE108  $  Y=X1*0.025;
  $  306.点火回路5电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE109  $  Y=X1*0.025;
  $  307.点火回路6电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE110  $  Y=X1*0.025;
  $  308.点火回路7电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE111  $  Y=X1*0.025;
  $  309.点火回路8电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE112  $  Y=X1*0.025;
  $  310.点火回路9电流流过的时间                                     $    $  ms             $    $  ANS013.BYTE113  $  Y=X1*0.025;
  $  311.点火回路10电流流过的时间                                    $    $  ms             $    $  ANS013.BYTE114  $  Y=X1*0.025;
  $  312.在碰撞发生时的能量储备电压                                  $    $  V              $    $  ANS013.BYTE117  $  Y=X1*0.2;
  $  313.在引爆气囊后能量储备电压                                    $    $  V              $    $  ANS013.BYTE118  $  Y=X1*0.2;
  $  314.引爆前电源电压                                              $    $  V              $    $  ANS013.BYTE119  $  Y=X1*0.1;
  $  315.引爆后电源电压                                              $    $  V              $    $  ANS013.BYTE120  $  Y=X1*0.1;
  $  316.碰撞输出信号已发送                                          $    $                 $    $  ANS013.BYTE121  $  if(((X1>>0)&1)) Y=@0e12;else Y=@0e13;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:6A2 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
