
    车型ID：5713

    模拟：协议模拟-->5713

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:620 02 10 01 00 00 00 00 00       $~  ANS000:621 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:620 02 3E 00 00 00 00 00 00       $!  ANS000:621 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:620 03 19 02 08 00 00 00 00       $#  ANS000:621 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b2000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:620 04 14 FF FF FF 00 00 00       $$  ANS000:621 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:620 03 22 F1 87 00 00 00 00       $%  ANS000:621 03 22 F1 87 00 00 00 00
  $%  REQ001:620 03 22 F1 99 00 00 00 00       $%  ANS001:621 03 22 F1 99 00 00 00 00
  $%  REQ002:620 03 22 F1 90 00 00 00 00       $%  ANS002:621 03 22 F1 90 00 00 00 00
  $%  REQ003:620 03 22 F1 89 00 00 00 00       $%  ANS003:621 03 22 F1 89 00 00 00 00
  $%  REQ004:620 03 22 F1 8A 00 00 00 00       $%  ANS004:621 03 22 F1 8A 00 00 00 00
  $%  REQ005:620 03 22 F1 8B 00 00 00 00       $%  ANS005:621 03 22 F1 8B 00 00 00 00
  $%  REQ006:620 03 22 F1 91 00 00 00 00       $%  ANS006:621 03 22 F1 91 00 00 00 00
  $%  REQ007:620 03 22 F1 92 00 00 00 00       $%  ANS007:621 03 22 F1 92 00 00 00 00
  $%  REQ008:620 03 22 F1 94 00 00 00 00       $%  ANS008:621 03 22 F1 94 00 00 00 00
  $%  REQ009:620 03 22 F1 A2 00 00 00 00       $%  ANS009:621 03 22 F1 A2 00 00 00 00
  $%  REQ010:620 03 22 F1 A1 00 00 00 00       $%  ANS010:621 03 22 F1 A1 00 00 00 00
  $%  REQ011:620 03 22 F1 8C 00 00 00 00       $%  ANS011:621 03 22 F1 8C 00 00 00 00

  $%  000:FCC（汽车制造商）零件号:                $%    $%  ANS000.BYTE004  $%  0 ASCII
  $%  001:编程日期:                               $%    $%  ANS001.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  002:VIN（车辆识别码）:                      $%    $%  ANS002.BYTE004  $%  0 ASCII
  $%  003:FCC（汽车制造商） ECU软件版本号:        $%    $%  ANS003.BYTE004  $%  0 ASCII
  $%  004:供应商代码:                             $%    $%  ANS004.BYTE004  $%  0 ASCII
  $%  005:ECU在供应商生产线上的生产日期:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  006:FCC（汽车制造商） ECU硬件版本号:        $%    $%  ANS006.BYTE004  $%  0 ASCII
  $%  007:供应商ECU硬件版本号:                    $%    $%  ANS007.BYTE004  $%  0 ASCII
  $%  008:供应商ECU软件版本号:                    $%    $%  ANS008.BYTE004  $%  0 ASCII
  $%  009:ECU在生产线的安装日期:                  $%    $%  ANS009.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  010:显示语言:                               $%    $%  ANS010.BYTE004  $%  if((X1&0x03)==0) y=@098e;else if((X1&0x03)==1) y=@0e2a;else y=@0004;
  $%  011:带区:                                   $%    $%  ANS010.BYTE004  $%  if(((X1/0x04)&0x03)==0) y=@0e2e;else if(((X1/0x04)&0x03)==1) y=@0e2f;else y=@0004;
  $%  012:空调类型:                               $%    $%  ANS010.BYTE004  $%  if(((X1/0x10)&0x03)==0) y=@0e2b;else if(((X1/0x10)&0x03)==1) y=@0e2c;else if(((X1/0x10)&0x03)==2) y=@0e2d;else y=@0004;
  $%  013:空调显示:                               $%    $%  ANS010.BYTE004  $%  if(((X1>>6)&1)) Y=@0e23;else Y=@0e24;
  $%  014:扬声器声道:                             $%    $%  ANS010.BYTE004  $%  if(((X1>>7)&1)) Y=@0e21;else Y=@0e22;
  $%  015:PAC类型:                                $%    $%  ANS010.BYTE005  $%  if((X1&0x03)==0) y=@0e27;else if((X1&0x03)==1) y=@0e28;else if((X1&0x03)==2) y=@0e29;else y=@0004;
  $%  016:PAC显示:                                $%    $%  ANS010.BYTE005  $%  if(((X1>>2)&1)) Y=@0e25;else Y=@0e26;
  $%  017:AVM 类型:                               $%    $%  ANS010.BYTE005  $%  if(((X1/0x08)&0x03)==0) y=@0e1b;else if(((X1/0x08)&0x03)==1) y=@0e1c;else y=@0004;
  $%  018:AVM显示:                                $%    $%  ANS010.BYTE005  $%  if(((X1>>5)&1)) Y=@0e19;else Y=@0e1a;
  $%  019:ECU序列号:                              $%    $%  ANS011.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:620 03 22 05 00 00 00 00 00       $  ANS000:621 03 22 05 00 00 00 00 00
  $  REQ001:620 03 22 05 01 00 00 00 00       $  ANS001:621 03 22 05 01 00 00 00 00
  $  REQ002:620 03 22 05 06 00 00 00 00       $  ANS002:621 03 22 05 06 00 00 00 00
  $  REQ003:620 03 22 05 07 00 00 00 00       $  ANS003:621 03 22 05 07 00 00 00 00
  $  REQ004:620 03 22 05 08 00 00 00 00       $  ANS004:621 03 22 05 08 00 00 00 00
  $  REQ005:620 03 22 05 0A 00 00 00 00       $  ANS005:621 03 22 05 0A 00 00 00 00
  $  REQ006:620 03 22 05 0B 00 00 00 00       $  ANS006:621 03 22 05 0B 00 00 00 00
  $  REQ007:620 03 22 05 0C 00 00 00 00       $  ANS007:621 03 22 05 0C 00 00 00 00
  $  REQ008:620 03 22 05 0D 00 00 00 00       $  ANS008:621 03 22 05 0D 00 00 00 00
  $  REQ009:620 03 22 05 0E 00 00 00 00       $  ANS009:621 03 22 05 0E 00 00 00 00
  $  REQ010:620 03 22 05 0F 00 00 00 00       $  ANS010:621 03 22 05 0F 00 00 00 00
  $  REQ011:620 03 22 05 10 00 00 00 00       $  ANS011:621 03 22 05 10 00 00 00 00
  $  REQ012:620 03 22 05 11 00 00 00 00       $  ANS012:621 03 22 05 11 00 00 00 00
  $  REQ013:620 03 22 05 12 00 00 00 00       $  ANS013:621 03 22 05 12 00 00 00 00

  $  000.音频源选择                $    $       $    $  ANS000.BYTE004  $  if(X1==0) y=@0e1d;else if(X1==1) y=@0e1e;else if(X1==2) y=@0e1f;else if(X1==3) y=@0e20;else if(X1==9) y=@0b0d;else y=@0004;
  $  001.音量等级                  $    $       $    $  ANS001.BYTE004  $  Y=HEX(X1);
  $  002.静音状态                  $    $       $    $  ANS002.BYTE004  $  if(X1==0) y=@0341;else if(X1==1) y=@017d;else y=@0004;
  $  003.调谐器当前频段            $    $       $    $  ANS003.BYTE004  $  if(X1==0) y=@0bf2;else if(X1==1) y=@0bf3;else if(X1==3) y=@0bf5;else y=@0004;
  $  004.收音机当前预设电台        $    $       $    $  ANS003.BYTE005  $  if(X1==1) y=@0e53;else if(X1==2) y=@0e54;else if(X1==3) y=@0e55;else if(X1==4) y=@0e56;else if(X1==5) y=@0e57;else if(X1==6) y=@0e58;else y=@0004;
  $  005.调谐器频率                $    $       $    $  ANS003.BYTE006  $  Y=X1*256+X2;
  $  006.信号强度                  $    $       $    $  ANS004.BYTE004  $  Y=HEX(X1);
  $  007.EQ频点1值                 $    $       $    $  ANS005.BYTE004  $  if(X1==27) y=@0e34;else if(X1==0) y=@0e35;else if(X1==1) y=@0e36;else if(X1==2) y=@0e37;else if(X1==3) y=@0e38;else if(X1==4) y=@0e39;else if(X1==5) y=@0e3a;else if(X1==6) y=@0e3b;else if(X1==7) y=@0e3c;else if(X1==8) y=@0e3d;else if(X1==9) y=@0e3e;else if(X1==10) y=@0e3f;else if(X1==11) y=@0e40;else if(X1==12) y=@0e41;else if(X1==13) y=@0e42;else if(X1==14) y=@0e43;else if(X1==15) y=@0e44;else if(X1==16) y=@0e45;else if(X1==17) y=@0e46;else if(X1==18) y=@0e47;else if(X1==19) y=@0e48;else if(X1==20) y=@0e49;else if(X1==21) y=@0e4a;else if(X1==22) y=@0e4b;else if(X1==23) y=@0e4c;else if(X1==24) y=@0e4d;else if(X1==25) y=@0e4e;else if(X1==26) y=@0e4f;else if(X1==28) y=@0e50;else y=@0004;
  $  008.EQ频点2值                 $    $       $    $  ANS006.BYTE004  $  if(X1==27) y=@0e34;else if(X1==0) y=@0e35;else if(X1==1) y=@0e36;else if(X1==2) y=@0e37;else if(X1==3) y=@0e38;else if(X1==4) y=@0e39;else if(X1==5) y=@0e3a;else if(X1==6) y=@0e3b;else if(X1==7) y=@0e3c;else if(X1==8) y=@0e3d;else if(X1==9) y=@0e3e;else if(X1==10) y=@0e3f;else if(X1==11) y=@0e40;else if(X1==12) y=@0e41;else if(X1==13) y=@0e42;else if(X1==14) y=@0e43;else if(X1==15) y=@0e44;else if(X1==16) y=@0e45;else if(X1==17) y=@0e46;else if(X1==18) y=@0e47;else if(X1==19) y=@0e48;else if(X1==20) y=@0e49;else if(X1==21) y=@0e4a;else if(X1==22) y=@0e4b;else if(X1==23) y=@0e4c;else if(X1==24) y=@0e4d;else if(X1==25) y=@0e4e;else if(X1==26) y=@0e4f;else if(X1==28) y=@0e50;else y=@0004;
  $  009.EQ频点3值                 $    $       $    $  ANS007.BYTE004  $  if(X1==27) y=@0e34;else if(X1==0) y=@0e35;else if(X1==1) y=@0e36;else if(X1==2) y=@0e37;else if(X1==3) y=@0e38;else if(X1==4) y=@0e39;else if(X1==5) y=@0e3a;else if(X1==6) y=@0e3b;else if(X1==7) y=@0e3c;else if(X1==8) y=@0e3d;else if(X1==9) y=@0e3e;else if(X1==10) y=@0e3f;else if(X1==11) y=@0e40;else if(X1==12) y=@0e41;else if(X1==13) y=@0e42;else if(X1==14) y=@0e43;else if(X1==15) y=@0e44;else if(X1==16) y=@0e45;else if(X1==17) y=@0e46;else if(X1==18) y=@0e47;else if(X1==19) y=@0e48;else if(X1==20) y=@0e49;else if(X1==21) y=@0e4a;else if(X1==22) y=@0e4b;else if(X1==23) y=@0e4c;else if(X1==24) y=@0e4d;else if(X1==25) y=@0e4e;else if(X1==26) y=@0e4f;else if(X1==28) y=@0e50;else y=@0004;
  $  010.EQ频点4值                 $    $       $    $  ANS008.BYTE004  $  if(X1==27) y=@0e34;else if(X1==0) y=@0e35;else if(X1==1) y=@0e36;else if(X1==2) y=@0e37;else if(X1==3) y=@0e38;else if(X1==4) y=@0e39;else if(X1==5) y=@0e3a;else if(X1==6) y=@0e3b;else if(X1==7) y=@0e3c;else if(X1==8) y=@0e3d;else if(X1==9) y=@0e3e;else if(X1==10) y=@0e3f;else if(X1==11) y=@0e40;else if(X1==12) y=@0e41;else if(X1==13) y=@0e42;else if(X1==14) y=@0e43;else if(X1==15) y=@0e44;else if(X1==16) y=@0e45;else if(X1==17) y=@0e46;else if(X1==18) y=@0e47;else if(X1==19) y=@0e48;else if(X1==20) y=@0e49;else if(X1==21) y=@0e4a;else if(X1==22) y=@0e4b;else if(X1==23) y=@0e4c;else if(X1==24) y=@0e4d;else if(X1==25) y=@0e4e;else if(X1==26) y=@0e4f;else if(X1==28) y=@0e50;else y=@0004;
  $  011.EQ频点5值                 $    $       $    $  ANS009.BYTE004  $  if(X1==27) y=@0e34;else if(X1==0) y=@0e35;else if(X1==1) y=@0e36;else if(X1==2) y=@0e37;else if(X1==3) y=@0e38;else if(X1==4) y=@0e39;else if(X1==5) y=@0e3a;else if(X1==6) y=@0e3b;else if(X1==7) y=@0e3c;else if(X1==8) y=@0e3d;else if(X1==9) y=@0e3e;else if(X1==10) y=@0e3f;else if(X1==11) y=@0e40;else if(X1==12) y=@0e41;else if(X1==13) y=@0e42;else if(X1==14) y=@0e43;else if(X1==15) y=@0e44;else if(X1==16) y=@0e45;else if(X1==17) y=@0e46;else if(X1==18) y=@0e47;else if(X1==19) y=@0e48;else if(X1==20) y=@0e49;else if(X1==21) y=@0e4a;else if(X1==22) y=@0e4b;else if(X1==23) y=@0e4c;else if(X1==24) y=@0e4d;else if(X1==25) y=@0e4e;else if(X1==26) y=@0e4f;else if(X1==28) y=@0e50;else y=@0004;
  $  012.最佳听音位                $    $       $    $  ANS010.BYTE004  $  if(X1==1) y=@0e30;else if(X1==2) y=@0e31;else if(X1==3) y=@0e32;else if(X1==4) y=@0e33;else y=@0004;
  $  013.声场                      $    $       $    $  ANS011.BYTE004  $  if(X1==0) y=@0e51;else if(X1==1) y=@0e52;else if(X1==2) y=@0ada;else y=@0004;
  $  014.ALC(氛围灯主控制器)       $    $       $    $  ANS012.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@01e5;else if(X1==2) y=@01e6;else if(X1==3) y=@0477;else y=@0004;
  $  015.等响度                    $    $       $    $  ANS013.BYTE004  $  if(X1==0) y=@0014;else if(X1==1) y=@0015;else y=@0004;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:620 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
