
    车型ID：5714

    模拟：协议模拟-->5714

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:618 02 10 01 00 00 00 00 00       $~  ANS000:619 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:618 02 3E 00 00 00 00 00 00       $!  ANS000:619 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:618 03 19 02 08 00 00 00 00       $#  ANS000:619 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b3000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:618 04 14 FF FF FF 00 00 00       $$  ANS000:619 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:618 03 22 F1 87 00 00 00 00       $%  ANS000:619 03 22 F1 87 00 00 00 00
  $%  REQ001:618 03 22 F1 98 00 00 00 00       $%  ANS001:619 03 22 F1 98 00 00 00 00
  $%  REQ002:618 03 22 F1 99 00 00 00 00       $%  ANS002:619 03 22 F1 99 00 00 00 00
  $%  REQ003:618 03 22 F1 90 00 00 00 00       $%  ANS003:619 03 22 F1 90 00 00 00 00
  $%  REQ004:618 03 22 F1 89 00 00 00 00       $%  ANS004:619 03 22 F1 89 00 00 00 00
  $%  REQ005:618 03 22 F1 80 00 00 00 00       $%  ANS005:619 03 22 F1 80 00 00 00 00
  $%  REQ006:618 03 22 F1 83 00 00 00 00       $%  ANS006:619 03 22 F1 83 00 00 00 00
  $%  REQ007:618 03 22 F1 8A 00 00 00 00       $%  ANS007:619 03 22 F1 8A 00 00 00 00
  $%  REQ008:618 03 22 F1 8B 00 00 00 00       $%  ANS008:619 03 22 F1 8B 00 00 00 00
  $%  REQ009:618 03 22 F1 91 00 00 00 00       $%  ANS009:619 03 22 F1 91 00 00 00 00
  $%  REQ010:618 03 22 F1 92 00 00 00 00       $%  ANS010:619 03 22 F1 92 00 00 00 00
  $%  REQ011:618 03 22 F1 94 00 00 00 00       $%  ANS011:619 03 22 F1 94 00 00 00 00
  $%  REQ012:618 03 22 F1 81 00 00 00 00       $%  ANS012:619 03 22 F1 81 00 00 00 00
  $%  REQ013:618 03 22 F1 A2 00 00 00 00       $%  ANS013:619 03 22 F1 A2 00 00 00 00
  $%  REQ014:618 03 22 F1 A1 00 00 00 00       $%  ANS014:619 03 22 F1 A1 00 00 00 00
  $%  REQ015:618 03 22 F1 00 00 00 00 00       $%  ANS015:619 03 22 F1 00 00 00 00 00
  $%  REQ016:618 03 22 F1 8C 00 00 00 00       $%  ANS016:619 03 22 F1 8C 00 00 00 00

  $%  000:FCC（汽车制造商）零件号:                               $%    $%  ANS000.BYTE004  $%  0 ASCII
  $%  001:诊断仪序列号:                                          $%    $%  ANS001.BYTE004  $%  0 ASCII
  $%  002:编程日期:                                              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  003:VIN（车辆识别码）:                                     $%    $%  ANS003.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  004:FCC（汽车制造商） ECU软件版本号:                       $%    $%  ANS004.BYTE004  $%  0 ASCII
  $%  005:FCC（汽车制造商） ECU刷新软件版本号:                   $%    $%  ANS005.BYTE004  $%  0 ASCII
  $%  006:供应商ECU刷新软件版本号:                               $%    $%  ANS006.BYTE004  $%  0 ASCII
  $%  007:供应商代码:                                            $%    $%  ANS007.BYTE004  $%  0 ASCII
  $%  008:ECU在供应商生产线上的生产日期:                         $%    $%  ANS008.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  009:FCC（汽车制造商） ECU硬件版本号:                       $%    $%  ANS009.BYTE004  $%  0 ASCII
  $%  010:供应商ECU硬件版本号:                                   $%    $%  ANS010.BYTE004  $%  0 ASCII
  $%  011:供应商ECU软件版本号:                                   $%    $%  ANS011.BYTE004  $%  0 ASCII
  $%  012:FCC（汽车制造商） ECU应用软件版本号:                   $%    $%  ANS012.BYTE004  $%  0 ASCII
  $%  013:ECU在生产线的安装日期:                                 $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X-%02X-%02X],X1,X2,X3);
  $%  014:发动机熄火自动解锁:                                    $%    $%  ANS014.BYTE004  $%  if(((X1>>0)&1)) Y=@0dc3;else Y=@0dc4;
  $%  015:解锁车门:                                              $%    $%  ANS014.BYTE004  $%  if(((X1>>1)&1)) Y=@0dc1;else Y=@0dc2;
  $%  016:前天窗，遮阳帘:                                        $%    $%  ANS014.BYTE004  $%  if(((X1>>2)&1)) Y=@0dbd;else Y=@0dbe;
  $%  017:有遥控功能，长按闭锁键或锁芯闭锁后松手自动关窗:        $%    $%  ANS014.BYTE005  $%  if((X1&0x03)==0) y=@0db9;else if((X1&0x03)==1) y=@0dba;else if((X1&0x03)==2) y=@0dbb;else if((X1&0x03)==3) y=@0dbc;else y=@0004;
  $%  018:RLS(雨量传感器):                                       $%    $%  ANS014.BYTE005  $%  if(((X1/0x08)&0x03)==0) y=@0dbf;else if(((X1/0x08)&0x03)==1) y=@0dc0;else if(((X1/0x08)&0x03)==2) y=@0db3;else y=@0004;
  $%  019:RLS(雨量传感器):                                       $%    $%  ANS014.BYTE006  $%  if(((X1>>0)&1)) Y=@0db2;else Y=@0db3;
  $%  020:转向灯:                                                $%    $%  ANS014.BYTE006  $%  if(((X1>>1)&1)) Y=@0db2;else Y=@0db3;
  $%  021:DRL(日间行车灯):                                       $%    $%  ANS014.BYTE006  $%  if(((X1/0x04)&0x03)==0) y=@0daf;else if(((X1/0x04)&0x03)==1) y=@0db0;else if(((X1/0x04)&0x03)==2) y=@0db1;else y=@0004;
  $%  022:车辆报警:                                              $%    $%  ANS014.BYTE007  $%  if((X1&0x03)==0) y=@0db6;else if((X1&0x03)==1) y=@0db7;else if((X1&0x03)==2) y=@0db8;else y=@0004;
  $%  023:钥匙忘拔提醒:                                          $%    $%  ANS014.BYTE007  $%  if(((X1>>2)&1)) Y=@0db4;else Y=@0db5;
  $%  024:AT（自动变速器）或MT（手动变速器）:                    $%    $%  ANS014.BYTE007  $%  if(((X1>>3)&1)) Y=@0d8c;else Y=@0d8b;
  $%  025:PEPS(无匙进入及启动系统):                              $%    $%  ANS014.BYTE008  $%  if((X1&0x03)==0) y=@0dc9;else if((X1&0x03)==1) y=@0dca;else if((X1&0x03)==2) y=@0dcb;else if((X1&0x03)==3) y=@0dcc;else y=@0004;
  $%  026:EBS(电子制动系统):                                     $%    $%  ANS014.BYTE008  $%  if(((X1>>2)&1)) Y=@0dcf;else Y=@0dd0;
  $%  027:PSD（电动滑动门）:                                     $%    $%  ANS014.BYTE008  $%  if(((X1>>3)&1)) Y=@0dcd;else Y=@0dce;
  $%  028:PLG（电动提升式门）:                                   $%    $%  ANS014.BYTE008  $%  if(((X1>>4)&1)) Y=@0dc7;else Y=@0dc8;
  $%  029:ALU:                                                   $%    $%  ANS014.BYTE008  $%  if(((X1>>5)&1)) Y=@0dc5;else Y=@0dc6;
  $%  030:车辆模式配置:                                          $%    $%  ANS015.BYTE004  $%  if(X1==1) y=@0011;else if(X1==2) y=@03c5;else if(X1==3) y=@006a;else if(X1==0) y=@000d;else y=@0004;
  $%  031:ECU序列号:                                             $%    $%  ANS016.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:618 03 22 10 00 00 00 00 00       $  ANS000:619 03 22 10 00 00 00 00 00
  $  REQ001:618 03 22 10 01 00 00 00 00       $  ANS001:619 03 22 10 01 00 00 00 00
  $  REQ002:618 03 22 10 02 00 00 00 00       $  ANS002:619 03 22 10 02 00 00 00 00
  $  REQ003:618 03 22 10 03 00 00 00 00       $  ANS003:619 03 22 10 03 00 00 00 00
  $  REQ004:618 03 22 10 04 00 00 00 00       $  ANS004:619 03 22 10 04 00 00 00 00
  $  REQ005:618 03 22 10 05 00 00 00 00       $  ANS005:619 03 22 10 05 00 00 00 00

  $  000.发送至LIN的记录碰撞发生次数              $    $           $    $  ANS000.BYTE004  $  Y=X1&0x0f;
  $  001.CAN发送的记录碰撞发生次数                $    $           $    $  ANS000.BYTE004  $  Y=(X1/0x10)&0x0f;
  $  002.首次碰撞发生时的里程表记录值             $    $  km       $    $  ANS000.BYTE005  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;
  $  003.第二次碰撞发生时的里程表记录值           $    $  km       $    $  ANS000.BYTE009  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;
  $  004.末次碰撞发生时的里程表记录值             $    $  km       $    $  ANS000.BYTE013  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;
  $  005.碰撞时存储的VIN码                        $    $           $    $  ANS000.BYTE017  $  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $  006.ACC开关（ACC继电器）                     $    $           $    $  ANS001.BYTE004  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  007.IGN1开关（IGN1继电器）                   $    $           $    $  ANS001.BYTE004  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  008.IGN2开关（IGN2继电器）                   $    $           $    $  ANS001.BYTE004  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  009.钥匙提示开关                             $    $           $    $  ANS001.BYTE004  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  010.前雾灯开关                               $    $           $    $  ANS001.BYTE004  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  011.后雾灯开关                               $    $           $    $  ANS001.BYTE004  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  012.TNS开关                                  $    $           $    $  ANS001.BYTE004  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  013.近光灯开关                               $    $           $    $  ANS001.BYTE004  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  014.自动灯开关                               $    $           $    $  ANS001.BYTE005  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  015.超车灯开关                               $    $           $    $  ANS001.BYTE005  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  016.远光灯开关                               $    $           $    $  ANS001.BYTE005  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  017.左转向开关                               $    $           $    $  ANS001.BYTE005  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  018.右转向开关                               $    $           $    $  ANS001.BYTE005  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  019.行李箱开启请求开关                       $    $           $    $  ANS001.BYTE005  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  020.行李箱解锁开关                           $    $           $    $  ANS001.BYTE005  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  021.发动机罩开启请求开关                     $    $           $    $  ANS001.BYTE005  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  022.制动灯开关                               $    $           $    $  ANS001.BYTE006  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  023.倒车灯开关                               $    $           $    $  ANS001.BYTE006  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  024.危险警报灯开关                           $    $           $    $  ANS001.BYTE006  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  025.前雨刮器低速开关                         $    $           $    $  ANS001.BYTE006  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  026.前雨刮器高速开关                         $    $           $    $  ANS001.BYTE006  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  027.前雨刮器间歇自动开关                     $    $           $    $  ANS001.BYTE006  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  028.前雨刮器停止开关                         $    $           $    $  ANS001.BYTE006  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  029.前大灯清洗开关                           $    $           $    $  ANS001.BYTE006  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  030.后雨刮打开开关                           $    $           $    $  ANS002.BYTE004  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  031.后雨刮器间歇开关                         $    $           $    $  ANS002.BYTE004  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  032.后清洗开关                               $    $           $    $  ANS002.BYTE004  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  033.遥控器锁止开关                           $    $           $    $  ANS002.BYTE004  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  034.遥控器解锁开关                           $    $           $    $  ANS002.BYTE004  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  035.遥控器行李箱开关                         $    $           $    $  ANS002.BYTE004  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  036.遥控器电池状态                           $    $           $    $  ANS002.BYTE004  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  037.DI低速输入1（变速器P挡）                 $    $           $    $  ANS002.BYTE004  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  038.前雨刮器调节                             $    $           $    $  ANS002.BYTE005  $  if((X1&0x0f)==1) y=@01e5;else if((X1&0x0f)==2) y=@01e6;else if((X1&0x0f)==3) y=@0477;else if((X1&0x0f)==4) y=@0478;else if((X1&0x0f)==5) y=@056c;else if((X1&0x0f)==6) y=@056d;else if((X1&0x0f)==7) y=@056e;else if((X1&0x0f)==8) y=@0dd9;else if((X1&0x0f)==9) y=@0dda;else y=@0004;
  $  039.变速器N挡                                $    $           $    $  ANS002.BYTE005  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  040.启停开关输入1                            $    $           $    $  ANS002.BYTE005  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  041.启停开关输入2                            $    $           $    $  ANS002.BYTE005  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  042.离合器踏板开关                           $    $           $    $  ANS002.BYTE005  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  043.DI低速输入2（ESCLHW传感器反馈）          $    $           $    $  ANS002.BYTE006  $  if(((X1>>0)&1)) Y=@0dd7;else Y=@0dd8;
  $  044.报警模式                                 $    $           $    $  ANS002.BYTE006  $  if(((X1/0x02)&0x07)==0) y=@003e;else if(((X1/0x02)&0x07)==1) y=@0ddc;else if(((X1/0x02)&0x07)==2) y=@020f;else if(((X1/0x02)&0x07)==3) y=@03b5;else if(((X1/0x02)&0x07)==4) y=@0ddd;else y=@0004;
  $  045.ESCL(电子转向管柱锁)接地继电器反馈       $    $           $    $  ANS002.BYTE001  $  if(X1>=0) Y=@0ddb;
  $  046.ESCL(电子转向管柱锁)电源继电器反馈       $    $           $    $  ANS002.BYTE001  $  if(X1>=0) Y=@0dd5;
  $  047.车内灯诊断反馈状态                       $    $           $    $  ANS002.BYTE006  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  048.后除霜诊断反馈状态                       $    $           $    $  ANS002.BYTE006  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  049.字节34_低电平预留                        $    $  km/h     $    $  ANS002.BYTE007  $  Y=(X1*256+X2)*0.01;
  $  050.TNS灯                                    $    $           $    $  ANS003.BYTE004  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  051.日间行车灯                               $    $           $    $  ANS003.BYTE004  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  052.后雾灯                                   $    $           $    $  ANS003.BYTE004  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  053.近光灯                                   $    $           $    $  ANS003.BYTE004  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  054.远光灯                                   $    $           $    $  ANS003.BYTE004  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  055.制动灯                                   $    $           $    $  ANS003.BYTE004  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  056.右前雾灯                                 $    $           $    $  ANS003.BYTE004  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  057.左前雾灯                                 $    $           $    $  ANS003.BYTE004  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  058.倒车灯                                   $    $           $    $  ANS003.BYTE005  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  059.左转向灯                                 $    $           $    $  ANS003.BYTE005  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  060.右转向灯                                 $    $           $    $  ANS003.BYTE005  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  061.后风窗加热                               $    $           $    $  ANS003.BYTE005  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  062.后雨刮                                   $    $           $    $  ANS003.BYTE005  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  063.室内灯                                   $    $           $    $  ANS003.BYTE005  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  064.门灯                                     $    $           $    $  ANS003.BYTE005  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  065.验证状态_应答器或遥控器                  $    $           $    $  ANS003.BYTE005  $  if(((X1>>7)&1)) Y=@003e;else Y=@0dd6;
  $  066.行李箱灯                                 $    $           $    $  ANS003.BYTE006  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  067.前雨刮器低速档                           $    $           $    $  ANS003.BYTE006  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  068.前雨刮器高速档                           $    $           $    $  ANS003.BYTE006  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  069.喇叭                                     $    $           $    $  ANS003.BYTE006  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  070.前大灯清洗                               $    $           $    $  ANS003.BYTE006  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  071.行李箱解锁                               $    $           $    $  ANS003.BYTE006  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  072.LSD输出1_防盗指示灯                      $    $           $    $  ANS003.BYTE006  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  073.LSD输出2                                 $    $           $    $  ANS003.BYTE006  $  if(((X1>>7)&1)) Y=@0210;else Y=@020f;
  $  074.室内灯PWM(脉宽调制)输出                  $    $           $    $  ANS003.BYTE007  $  Y=X1&0x7f;
  $  075.IGN1继电器                               $    $           $    $  ANS003.BYTE008  $  if(((X1>>0)&1)) Y=@0210;else Y=@020f;
  $  076.IGN2继电器                               $    $           $    $  ANS003.BYTE008  $  if(((X1>>1)&1)) Y=@0210;else Y=@020f;
  $  077.ACC继电器                                $    $           $    $  ANS003.BYTE008  $  if(((X1>>2)&1)) Y=@0210;else Y=@020f;
  $  078.启停开关黄色LED灯                        $    $           $    $  ANS003.BYTE008  $  if(((X1>>3)&1)) Y=@0210;else Y=@020f;
  $  079.启停开关红色LED灯                        $    $           $    $  ANS003.BYTE008  $  if(((X1>>4)&1)) Y=@0210;else Y=@020f;
  $  080.燃油盖锁止控制                           $    $           $    $  ANS003.BYTE008  $  if(((X1>>5)&1)) Y=@0210;else Y=@020f;
  $  081.燃油盖解锁控制                           $    $           $    $  ANS003.BYTE008  $  if(((X1>>6)&1)) Y=@0210;else Y=@020f;
  $  082.YFVE下线测试结果                         $    $           $    $  ANS004.BYTE004  $  if(X1==0) y=@0dd1;else if(X1==1) y=@0dd2;else y=@0004;
  $  083.电瓶电压                                 $    $           $    $  ANS004.BYTE007  $  Y=X1;
  $  084.SK1指示                                  $    $           $    $  ANS005.BYTE004  $  if(X1==0) y=@0dd3;else if(X1==1) y=@0dd4;else y=@0004;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:618 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
