
    车型ID：5b1c

    模拟：协议模拟-->5b1c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:722 02 10 01 00 00 00 00 00       $~  ANS000:72A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:722 02 3E 00 00 00 00 00 00       $!  ANS000:72A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:722 03 19 02 08 00 00 00 00       $#  ANS000:72A 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:722 04 14 FF FF FF 00 00 00       $$  ANS000:72A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:722 03 22 F1 00 00 00 00 00       $%  ANS000:72A 03 22 F1 00 00 00 00 00
  $%  REQ001:722 03 22 F1 80 00 00 00 00       $%  ANS001:72A 03 22 F1 80 00 00 00 00
  $%  REQ002:722 03 22 F1 81 00 00 00 00       $%  ANS002:72A 03 22 F1 81 00 00 00 00
  $%  REQ003:722 03 22 F1 83 00 00 00 00       $%  ANS003:72A 03 22 F1 83 00 00 00 00
  $%  REQ004:722 03 22 F1 87 00 00 00 00       $%  ANS004:72A 03 22 F1 87 00 00 00 00
  $%  REQ005:722 03 22 F1 89 00 00 00 00       $%  ANS005:72A 03 22 F1 89 00 00 00 00
  $%  REQ006:722 03 22 F1 90 00 00 00 00       $%  ANS006:72A 03 22 F1 90 00 00 00 00
  $%  REQ007:722 03 22 F1 91 00 00 00 00       $%  ANS007:72A 03 22 F1 91 00 00 00 00
  $%  REQ008:722 03 22 F1 93 00 00 00 00       $%  ANS008:72A 03 22 F1 93 00 00 00 00
  $%  REQ009:722 03 22 F1 95 00 00 00 00       $%  ANS009:72A 03 22 F1 95 00 00 00 00
  $%  REQ010:722 03 22 F1 98 00 00 00 00       $%  ANS010:72A 03 22 F1 98 00 00 00 00
  $%  REQ011:722 03 22 F1 99 00 00 00 00       $%  ANS011:72A 03 22 F1 99 00 00 00 00
  $%  REQ012:722 03 22 F1 9C 00 00 00 00       $%  ANS012:72A 03 22 F1 9C 00 00 00 00
  $%  REQ013:722 03 22 F1 9D 00 00 00 00       $%  ANS013:72A 03 22 F1 9D 00 00 00 00
  $%  REQ014:722 03 22 F1 A1 00 00 00 00       $%  ANS014:72A 03 22 F1 A1 00 00 00 00
  $%  REQ015:722 03 22 F1 A4 00 00 00 00       $%  ANS015:72A 03 22 F1 A4 00 00 00 00

  $%  000:模式信息:                          $%    $%  ANS000.BYTE004  $%  if(X1==0) y=@0011;else if(X1==1) y=@006a;else y=@0004;
  $%  001:ECU刷新软件版本号:                 $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:ECU应用软件版本号:                 $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  003:供应商ECU刷新软件版本号:           $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  004:零件号:                            $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:ECU软件号:                         $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  006:VIN码:                             $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  007:ECU硬件版本号:                     $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  008:硬件号版本:                        $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:软件号版本:                        $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:诊断仪序列号:                      $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:编程日期:                          $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  012:标定软件版本号:                    $%    $%  ANS012.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  013:ECU安装日期:                       $%    $%  ANS013.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  014:系统配置:                          $%    $%  ANS014.BYTE004  $%  Y=HEX(X1,X2);
  $%  015:Supplier ECU标定软件版本号:        $%    $%  ANS015.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:722 03 22 2A 01 00 00 00 00       $  ANS000:72A 03 22 2A 01 00 00 00 00
  $  REQ001:722 03 22 2A 03 00 00 00 00       $  ANS001:72A 03 22 2A 03 00 00 00 00
  $  REQ002:722 03 22 2A 04 00 00 00 00       $  ANS002:72A 03 22 2A 04 00 00 00 00
  $  REQ003:722 03 22 2A 06 00 00 00 00       $  ANS003:72A 03 22 2A 06 00 00 00 00
  $  REQ004:722 03 22 2A 07 00 00 00 00       $  ANS004:72A 03 22 2A 07 00 00 00 00
  $  REQ005:722 03 22 2A 08 00 00 00 00       $  ANS005:72A 03 22 2A 08 00 00 00 00
  $  REQ006:722 03 22 2A 09 00 00 00 00       $  ANS006:72A 03 22 2A 09 00 00 00 00
  $  REQ007:722 03 22 2A 0A 00 00 00 00       $  ANS007:72A 03 22 2A 0A 00 00 00 00
  $  REQ008:722 03 22 2A 0B 00 00 00 00       $  ANS008:72A 03 22 2A 0B 00 00 00 00
  $  REQ009:722 03 22 2A 0C 00 00 00 00       $  ANS009:72A 03 22 2A 0C 00 00 00 00
  $  REQ010:722 03 22 2A 0F 00 00 00 00       $  ANS010:72A 03 22 2A 0F 00 00 00 00
  $  REQ011:722 03 22 2A 10 00 00 00 00       $  ANS011:72A 03 22 2A 10 00 00 00 00
  $  REQ012:722 03 22 2A 11 00 00 00 00       $  ANS012:72A 03 22 2A 11 00 00 00 00
  $  REQ013:722 03 22 2A 12 00 00 00 00       $  ANS013:72A 03 22 2A 12 00 00 00 00
  $  REQ014:722 03 22 2A 13 00 00 00 00       $  ANS014:72A 03 22 2A 13 00 00 00 00
  $  REQ015:722 03 22 2A 14 00 00 00 00       $  ANS015:72A 03 22 2A 14 00 00 00 00
  $  REQ016:722 03 22 2A 00 00 00 00 00       $  ANS016:72A 03 22 2A 00 00 00 00 00
  $  REQ017:722 03 22 2A 0E 00 00 00 00       $  ANS017:72A 03 22 2A 0E 00 00 00 00
  $  REQ018:722 03 22 2A 17 00 00 00 00       $  ANS018:72A 03 22 2A 17 00 00 00 00
  $  REQ019:722 03 22 2A 18 00 00 00 00       $  ANS019:72A 03 22 2A 18 00 00 00 00
  $  REQ020:722 03 22 2A 1A 00 00 00 00       $  ANS020:72A 03 22 2A 1A 00 00 00 00
  $  REQ021:722 03 22 2A 25 00 00 00 00       $  ANS021:72A 03 22 2A 25 00 00 00 00
  $  REQ022:722 03 22 2A 26 00 00 00 00       $  ANS022:72A 03 22 2A 26 00 00 00 00
  $  REQ023:722 03 22 2A 27 00 00 00 00       $  ANS023:72A 03 22 2A 27 00 00 00 00
  $  REQ024:722 03 22 2A 28 00 00 00 00       $  ANS024:72A 03 22 2A 28 00 00 00 00
  $  REQ025:722 03 22 2A 29 00 00 00 00       $  ANS025:72A 03 22 2A 29 00 00 00 00
  $  REQ026:722 03 22 2A 2A 00 00 00 00       $  ANS026:72A 03 22 2A 2A 00 00 00 00
  $  REQ027:722 03 22 2A 41 00 00 00 00       $  ANS027:72A 03 22 2A 41 00 00 00 00
  $  REQ028:722 03 22 2A 42 00 00 00 00       $  ANS028:72A 03 22 2A 42 00 00 00 00

  $  000.图像处理器温度                              $    $  degC      $    $  ANS000.BYTE004  $  Y=(X1*256+X2)*1-40;
  $  001.摄像头遮挡原因                              $    $            $    $  ANS001.BYTE004  $  if(((X2>>0)&1)) Y=@03de;else if(((X2>>1)&1)) Y=@03df;else if(((X2>>2)&1)) Y=@03e0;else if(((X2>>3)&1)) Y=@03e1;else if(((X2>>4)&1)) Y=@03e2;else if(((X2>>5)&1)) Y=@03e3;else if(((X2>>6)&1)) Y=@03e4;else if(((X2>>7)&1)) Y=@03e5;else if(((X1>>0)&1)) Y=@03e6;else if(((X1>>1)&1)) Y=@03e7;else Y=@03e8;
  $  002.标定故障原因                                $    $            $    $  ANS002.BYTE004  $  if(((X1>>0)&1)) Y=@0002;else if(((X1>>1)&1)) Y=@03dc;else if(((X1>>2)&1)) Y=@03dd;else y=@0004;
  $  003.跟踪域                                      $    $            $    $  ANS003.BYTE004  $  Y=HEX(X1);
  $  004.电瓶电压                                    $    $  V         $    $  ANS004.BYTE004  $  Y=X1*0.1;
  $  005.里程读数                                    $    $  km        $    $  ANS005.BYTE004  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.1;
  $  006.车速                                        $    $  km/h      $    $  ANS006.BYTE004  $  Y=(X1*256+X2)*0.01;
  $  007.发动机转速                                  $    $  rpm       $    $  ANS007.BYTE004  $  Y=(X1*256+X2)*0.25;
  $  008.发动机转速有效标志位                        $    $            $    $  ANS008.BYTE004  $  if(X1==0) y=@0013;else if(X1==1) y=@03ec;else y=@0004;
  $  009.图像处理单元运行状态_EyeQ主状态             $    $            $    $  ANS009.BYTE013  $  if(X1==0) y=@0152;else if(X1==1) y=@0153;else if(X1==2) y=@0154;else if(X1==3) y=@0155;else if(X1==34) y=@0156;else if(X1==130) y=@0157;else if(X1==133) y=@0158;else if(X1==146) y=@0159;else if(X1==172) y=@015a;else if(X1==173) y=@015b;else y=@0004;
  $  010.SPC标定状态                                 $    $            $    $  ANS010.BYTE004  $  if(X1==0) y=@0131;else if(X1==1) y=@03e9;else if(X1==2) y=@03ea;else if(X1==3) y=@03eb;else if(X1==4) y=@0173;else if(X1==5) y=@0174;else if(X1==6) y=@0175;else if(X1==7) y=@0176;else if(X1==8) y=@0177;else if(X1==9) y=@0178;else y=@0004;
  $  011.摄像头到目标板的距离                        $    $  m         $    $  ANS011.BYTE004  $  Y=(X1*256+X2)*0.001;
  $  012.ECU(电子控制器)生产日期                     $    $            $    $  ANS012.BYTE004  $  Y=HEX(X1,X2,X3);
  $  013.ECU(电子控制器)串号                         $    $            $    $  ANS013.BYTE004  $  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  014.图像处理单元故障原因                        $    $            $    $  ANS014.BYTE004  $  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9);
  $  015.IFC(智能前视控制模块)软件不匹配原因         $    $            $    $  ANS015.BYTE004  $  if(((X1>>0)&1)) Y=@0c73;else if(((X1>>1)&1)) Y=@0c74;else if(((X1>>2)&1)) Y=@0c75;else if(((X1>>3)&1)) Y=@0c76; else Y=@0c77;
  $  016.摄像头距左车轮距离                          $    $  m         $    $  ANS016.BYTE004  $  Y=(X1*256+X2)*0.1;
  $  017.摄像头距离右车轮距离                        $    $  m         $    $  ANS016.BYTE006  $  Y=(X1*256+X2)*0.1;
  $  018.摄像头距目标板距离                          $    $  m         $    $  ANS016.BYTE008  $  Y=(X1*256+X2)*0.001;
  $  019.摄像头安装高度                              $    $  m         $    $  ANS016.BYTE010  $  Y=(X1*256+X2)*0.01;
  $  020.目标板中心距地面高度（左侧）                $    $  m         $    $  ANS016.BYTE012  $  Y=(X1*256+X2)*0.01;
  $  021.目标板中心距地面高度（右侧）                $    $  m         $    $  ANS016.BYTE014  $  Y=(X1*256+X2)*0.01;
  $  022.左目标板中轴线距车辆中轴线距离              $    $  m         $    $  ANS016.BYTE016  $  Y=(X1*256+X2)*0.01-5;
  $  023.右目标板中轴线距车辆中轴线距离              $    $  m         $    $  ANS016.BYTE018  $  Y=(X1*256+X2)*0.01-5;
  $  024.目标板方格尺寸                              $    $  m         $    $  ANS016.BYTE020  $  Y=(X1*256+X2)*0.001;
  $  025.黑白格排列方式                              $    $  Pixel     $    $  ANS016.BYTE022  $  Y=X1;
  $  026.摄像头焦距                                  $    $  Pixel     $    $  ANS016.BYTE023  $  Y=(X1*256+X2);
  $  027.右标靶左下角正方形颜色                      $    $  Pixel     $    $  ANS016.BYTE025  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  028.左标靶左下角正方形颜色                      $    $  Pixel     $    $  ANS016.BYTE026  $  if(X1==0) y=@0128;else if(X1==1) y=@0129;else y=@0004;
  $  029.目标板数量                                  $    $            $    $  ANS016.BYTE027  $  Y=X1;
  $  030.最大俯仰方向标定值                          $    $  Pixel     $    $  ANS016.BYTE028  $  Y=X1;
  $  031.最大横摆方向标定值                          $    $  Pixel     $    $  ANS016.BYTE029  $  Y=X1;
  $  032.最小俯仰方向标定值                          $    $  Pixel     $    $  ANS016.BYTE030  $  Y=X1-40;
  $  033.最小横摆方向标定值                          $    $  Pixel     $    $  ANS016.BYTE031  $  Y=X1-47;
  $  034.最大侧倾角                                  $    $  rad       $    $  ANS016.BYTE032  $  Y=X1*0.001;
  $  035.底部有效图像坐标值                          $    $  Pixel     $    $  ANS016.BYTE033  $  Y=X1-120;
  $  036.顶部有效图像坐标值                          $    $  Pixel     $    $  ANS016.BYTE034  $  Y=X1;
  $  037.摄像头到车辆前端的距离                      $    $  m         $    $  ANS016.BYTE035  $  Y=X1*0.01;
  $  038.摄像头到车辆中轴线的距离                    $    $  m         $    $  ANS016.BYTE036  $  Y=X1*0.01-1.28;
  $  039.EOL标定错误原因                             $    $            $    $  ANS017.BYTE005  $  if(X1==0x00) y=@0131;else if(X1==0x01) y=@0132;else if(X1==0x02) y=@0133;else if(X1==0x03) y=@0134;else if(X1==0x04) y=@032e;else if(X1==0x05) y=@0136;else if(X1==0x06) y=@0137;else if(X1==0x07) y=@0138;else if(X1==0x08) y=@0139;else if(X1==0x09) y=@013a;else if(X1==0x0A) y=@013b;else if(X1==0x0B) y=@013c;else if(X1==0x0C) y=@013d;else if(X1==0x0D) y=@032f;else if(X1==0x0E) y=@013f;else if(X1==0x0F) y=@0140;else if(X1==0x10) y=@0141;else if(X1==0x11) y=@0142;else if(X1==0x12) y=@0143;else if(X1==0x13) y=@0144;else if(X1==0x14) y=@0145;else if(X1==0x15) y=@0146;else if(X1==0x18) y=@0147;else if(X1==0x21) y=@0148;else y=@0004;
  $  040.摄像头标定俯仰角                            $    $            $    $  ANS017.BYTE007  $  Y=(X1*256+X2)-188;
  $  041.摄像头标定水平角                            $    $            $    $  ANS017.BYTE009  $  Y=(X1*256+X2)-160;
  $  042.摄像头自动标定俯仰角                        $    $            $    $  ANS017.BYTE012  $  Y=X1-40;
  $  043.摄像头自动标定水平角                        $    $            $    $  ANS017.BYTE013  $  Y=X1-40;
  $  044.LDW(车道偏离预警系统)功能故障的原因         $    $            $    $  ANS018.BYTE004  $  if(((X1>>4)&1)) Y=@03f1;else if(((X1>>5)&1)) Y=@03f2;else Y=@00f5;
  $  045.FCW功能故障的原因                           $    $            $    $  ANS019.BYTE004  $  if(((X1>>4)&1)) Y=@03f1;else if(((X1>>5)&1)) Y=@03f2;else Y=@00f5;
  $  046.AEB功能故障的原因                           $    $            $    $  ANS020.BYTE004  $  if(((X1>>4)&1)) Y=@03f3;else if(((X1>>5)&1)) Y=@03f5;else if(((X1>>6)&1)) Y=@03f1;else Y=@00f5;
  $  047.LDW(车道偏离预警系统)功能无法激活原因       $    $            $    $  ANS021.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else if(((X1>>4)&1)) Y=@03f1;else if(((X1>>5)&1)) Y=@03f2;else if(((X1>>6)&1)) Y=@03f6;else Y=@00f5;
  $  048.LDW(车道偏离预警系统)功能退出的原因         $    $            $    $  ANS022.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else if(((X1>>4)&1)) Y=@03f1;else if(((X1>>5)&1)) Y=@03f2;else if(((X1>>6)&1)) Y=@03f6;else Y=@00f5;
  $  049.LDW(车道偏离预警系统) 功能退出时间          $    $            $    $  ANS022.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  050.FCW功能无法激活的原因                       $    $            $    $  ANS023.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else if(((X1>>4)&1)) Y=@03f1;else if(((X1>>5)&1)) Y=@03f2;else y=@0004;
  $  051.FCW功能无法激活时间                         $    $            $    $  ANS023.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  052.FCW功能退出的原因                           $    $            $    $  ANS024.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else if(((X1>>4)&1)) Y=@03f1;else if(((X1>>5)&1)) Y=@03f2;else Y=@00f5;
  $  053.FCW功能退出时间                             $    $            $    $  ANS024.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  054.IHC功能无法激活的原因                       $    $            $    $  ANS025.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else Y=@00f5;
  $  055.IHC功能无法活时间                           $    $            $    $  ANS025.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  056.IHC 功能退出的原因                          $    $            $    $  ANS026.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else Y=@00f5;
  $  057.IHC 功能退出的时间                          $    $            $    $  ANS026.BYTE007  $  Y=HEX(X1,X2,X3,X4,X5,X6);
  $  058.最近一次AEB 功能无法激活的原因              $    $            $    $  ANS027.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else if(((X1>>4)&1)) Y=@03f3;else if(((X1>>5)&1)) Y=@03f4;else if(((X1>>6)&1)) Y=@03f1;else Y=@00f5;
  $  059.最近一次AEB 功能退出的原因                  $    $            $    $  ANS028.BYTE004  $  if(((X1>>0)&1)) Y=@03ed;else if(((X1>>1)&1)) Y=@03ee;else if(((X1>>2)&1)) Y=@03ef;else if(((X1>>3)&1)) Y=@03f0;else if(((X1>>4)&1)) Y=@03f3;else if(((X1>>5)&1)) Y=@03f4;else if(((X1>>6)&1)) Y=@03f1;else Y=@00f5;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:722 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
