
    车型ID：5c19

    模拟：协议模拟-->5c19

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7F0 02 10 01 00 00 00 00 00       $~  ANS000:7F8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7F0 02 3E 00 00 00 00 00 00       $!  ANS000:7F8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7F0 03 19 02 08 00 00 00 00       $#  ANS000:7F8 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7F0 04 14 FF FF FF 00 00 00       $$  ANS000:7F8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7F0 03 22 F1 82 00 00 00 00       $%  ANS000:7F8 03 22 F1 82 00 00 00 00
  $%  REQ001:7F0 03 22 F1 87 00 00 00 00       $%  ANS001:7F8 03 22 F1 87 00 00 00 00
  $%  REQ002:7F0 03 22 F1 90 00 00 00 00       $%  ANS002:7F8 03 22 F1 90 00 00 00 00
  $%  REQ003:7F0 03 22 F1 91 00 00 00 00       $%  ANS003:7F8 03 22 F1 91 00 00 00 00
  $%  REQ004:7F0 03 22 F1 92 00 00 00 00       $%  ANS004:7F8 03 22 F1 92 00 00 00 00
  $%  REQ005:7F0 03 22 F1 94 00 00 00 00       $%  ANS005:7F8 03 22 F1 94 00 00 00 00
  $%  REQ006:7F0 03 22 F1 95 00 00 00 00       $%  ANS006:7F8 03 22 F1 95 00 00 00 00
  $%  REQ007:7F0 03 22 F1 98 00 00 00 00       $%  ANS007:7F8 03 22 F1 98 00 00 00 00
  $%  REQ008:7F0 03 22 F1 99 00 00 00 00       $%  ANS008:7F8 03 22 F1 99 00 00 00 00
  $%  REQ009:7F0 03 22 F1 9D 00 00 00 00       $%  ANS009:7F8 03 22 F1 9D 00 00 00 00
  $%  REQ010:7F0 03 22 F1 A1 00 00 00 00       $%  ANS010:7F8 03 22 F1 A1 00 00 00 00
  $%  REQ011:7F0 03 22 06 30 00 00 00 00       $%  ANS011:7F8 03 22 06 30 00 00 00 00
  $%  REQ012:7F0 03 22 06 31 00 00 00 00       $%  ANS012:7F8 03 22 06 31 00 00 00 00

  $%  000:数据信息字段版本:        $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  001:零件号:                  $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  002:VIN:                     $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  003:ECU硬件版本号:           $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  004:硬件号:                  $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:软件号:                  $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  006:软件版本号:              $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  007:诊断仪序列号:            $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  008:编程日期:                $%    $%  ANS008.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  009:ECU安装日期:             $%    $%  ANS009.BYTE004  $%  Y=HEX(X1,X2,X3,X4);
  $%  010:配置信息:                $%    $%  ANS010.BYTE004  $%  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:标定软件信息:            $%    $%  ANS011.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  012:旋变偏移:                $%    $%  ANS012.BYTE004  $%  Y=(X1*256+X2)*360/4096;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7F0 03 22 06 00 00 00 00 00       $  ANS000:7F8 03 22 06 00 00 00 00 00
  $  REQ001:7F0 03 22 06 01 00 00 00 00       $  ANS001:7F8 03 22 06 01 00 00 00 00
  $  REQ002:7F0 03 22 06 02 00 00 00 00       $  ANS002:7F8 03 22 06 02 00 00 00 00
  $  REQ003:7F0 03 22 06 03 00 00 00 00       $  ANS003:7F8 03 22 06 03 00 00 00 00
  $  REQ004:7F0 03 22 06 04 00 00 00 00       $  ANS004:7F8 03 22 06 04 00 00 00 00
  $  REQ005:7F0 03 22 06 05 00 00 00 00       $  ANS005:7F8 03 22 06 05 00 00 00 00
  $  REQ006:7F0 03 22 06 06 00 00 00 00       $  ANS006:7F8 03 22 06 06 00 00 00 00
  $  REQ007:7F0 03 22 06 07 00 00 00 00       $  ANS007:7F8 03 22 06 07 00 00 00 00
  $  REQ008:7F0 03 22 06 08 00 00 00 00       $  ANS008:7F8 03 22 06 08 00 00 00 00
  $  REQ009:7F0 03 22 06 09 00 00 00 00       $  ANS009:7F8 03 22 06 09 00 00 00 00
  $  REQ010:7F0 03 22 06 0A 00 00 00 00       $  ANS010:7F8 03 22 06 0A 00 00 00 00
  $  REQ011:7F0 03 22 06 0B 00 00 00 00       $  ANS011:7F8 03 22 06 0B 00 00 00 00
  $  REQ012:7F0 03 22 06 0C 00 00 00 00       $  ANS012:7F8 03 22 06 0C 00 00 00 00
  $  REQ013:7F0 03 22 06 0D 00 00 00 00       $  ANS013:7F8 03 22 06 0D 00 00 00 00
  $  REQ014:7F0 03 22 06 0E 00 00 00 00       $  ANS014:7F8 03 22 06 0E 00 00 00 00
  $  REQ015:7F0 03 22 06 0F 00 00 00 00       $  ANS015:7F8 03 22 06 0F 00 00 00 00
  $  REQ016:7F0 03 22 06 10 00 00 00 00       $  ANS016:7F8 03 22 06 10 00 00 00 00
  $  REQ017:7F0 03 22 06 11 00 00 00 00       $  ANS017:7F8 03 22 06 11 00 00 00 00
  $  REQ018:7F0 03 22 06 12 00 00 00 00       $  ANS018:7F8 03 22 06 12 00 00 00 00
  $  REQ019:7F0 03 22 06 13 00 00 00 00       $  ANS019:7F8 03 22 06 13 00 00 00 00
  $  REQ020:7F0 03 22 06 14 00 00 00 00       $  ANS020:7F8 03 22 06 14 00 00 00 00
  $  REQ021:7F0 03 22 06 16 00 00 00 00       $  ANS021:7F8 03 22 06 16 00 00 00 00
  $  REQ022:7F0 03 22 06 17 00 00 00 00       $  ANS022:7F8 03 22 06 17 00 00 00 00
  $  REQ023:7F0 03 22 06 15 00 00 00 00       $  ANS023:7F8 03 22 06 15 00 00 00 00
  $  REQ024:7F0 03 22 06 18 00 00 00 00       $  ANS024:7F8 03 22 06 18 00 00 00 00
  $  REQ025:7F0 03 22 06 19 00 00 00 00       $  ANS025:7F8 03 22 06 19 00 00 00 00
  $  REQ026:7F0 03 22 06 1A 00 00 00 00       $  ANS026:7F8 03 22 06 1A 00 00 00 00
  $  REQ027:7F0 03 22 06 1B 00 00 00 00       $  ANS027:7F8 03 22 06 1B 00 00 00 00
  $  REQ028:7F0 03 22 06 1C 00 00 00 00       $  ANS028:7F8 03 22 06 1C 00 00 00 00
  $  REQ029:7F0 03 22 06 1D 00 00 00 00       $  ANS029:7F8 03 22 06 1D 00 00 00 00
  $  REQ030:7F0 03 22 01 00 00 00 00 00       $  ANS030:7F8 03 22 01 00 00 00 00 00
  $  REQ031:7F0 03 22 06 20 00 00 00 00       $  ANS031:7F8 03 22 06 20 00 00 00 00
  $  REQ032:7F0 03 22 06 21 00 00 00 00       $  ANS032:7F8 03 22 06 21 00 00 00 00
  $  REQ033:7F0 03 22 06 22 00 00 00 00       $  ANS033:7F8 03 22 06 22 00 00 00 00
  $  REQ034:7F0 03 22 06 23 00 00 00 00       $  ANS034:7F8 03 22 06 23 00 00 00 00
  $  REQ035:7F0 03 22 06 24 00 00 00 00       $  ANS035:7F8 03 22 06 24 00 00 00 00
  $  REQ036:7F0 03 22 06 25 00 00 00 00       $  ANS036:7F8 03 22 06 25 00 00 00 00
  $  REQ037:7F0 03 22 06 26 00 00 00 00       $  ANS037:7F8 03 22 06 26 00 00 00 00
  $  REQ038:7F0 03 22 06 27 00 00 00 00       $  ANS038:7F8 03 22 06 27 00 00 00 00
  $  REQ039:7F0 03 22 06 28 00 00 00 00       $  ANS039:7F8 03 22 06 28 00 00 00 00
  $  REQ040:7F0 03 22 06 29 00 00 00 00       $  ANS040:7F8 03 22 06 29 00 00 00 00
  $  REQ041:7F0 03 22 06 2A 00 00 00 00       $  ANS041:7F8 03 22 06 2A 00 00 00 00
  $  REQ042:7F0 03 22 06 2F 00 00 00 00       $  ANS042:7F8 03 22 06 2F 00 00 00 00

  $  000.支持的数据ID                                                   $    $           $    $  ANS000.BYTE004  $  Y=HEX(X1,X2,X3,X4);
  $  001.MCU(驱动电机控制单元)弱电电压                                  $    $  V        $    $  ANS001.BYTE004  $  Y=(x1*256+x2)*20/4095;
  $  002.AD参考电压                                                     $    $  V        $    $  ANS002.BYTE004  $  Y=(x1*256+x2)*6/4095;
  $  003.位置传感器供电电压                                             $    $  V        $    $  ANS003.BYTE004  $  Y=(x1*256+x2)*30/4095;
  $  004.电流传感器5V电压                                               $    $  V        $    $  ANS004.BYTE004  $  Y=(x1*256+x2)*6/4095;
  $  005.驱动板数字5V电压                                               $    $  V        $    $  ANS005.BYTE004  $  Y=(x1*256+x2)*6/4095;
  $  006.驱动板模拟5V电压                                               $    $  V        $    $  ANS006.BYTE004  $  Y=(x1*256+x2)*6/4095;
  $  007.点火开关状态                                                   $    $           $    $  ANS007.BYTE004  $  if((X1&0x01)==0) y=@0014;else if((X1&0x01)==1) y=@0015;else y=@0004;
  $  008.U相电流                                                        $    $  A        $    $  ANS008.BYTE004  $  Y=(x1*256+x2)*1600/4095;
  $  009.V相电流                                                        $    $  A        $    $  ANS009.BYTE004  $  Y=(x1*256+x2)*1600/4095;
  $  010.W相电流                                                        $    $  A        $    $  ANS010.BYTE004  $  Y=(x1*256+x2)*1600/4095;
  $  011.MCU(驱动电机控制单元) PWM(脉宽调制)状态                        $    $           $    $  ANS011.BYTE004  $  if((X1&0x03)==0) y=@0793;else if((X1&0x03)==1) y=@0371;else if((X1&0x03)==2) y=@0c2d;else y=@0004;
  $  012.电机转速                                                       $    $  rpm      $    $  ANS012.BYTE004  $  Y=(X1*256+X2);
  $  013.电机控制要求                                                   $    $           $    $  ANS013.BYTE004  $  if((X1&0x03)==0) y=@009c;else if((X1&0x03)==1) y=@0347;else y=@0004;
  $  014.IGBT温度                                                       $    $  degC     $    $  ANS014.BYTE004  $  Y=X1-40;
  $  015.母线电压                                                       $    $  V        $    $  ANS015.BYTE004  $  Y=(X1*256+X2);
  $  016.BMS(电池管理系统)电压                                          $    $  V        $    $  ANS016.BYTE004  $  Y=(X1*256+X2);
  $  017.3相电流峰值                                                    $    $  A        $    $  ANS017.BYTE004  $  Y=(x1*256+x2)*1600/4095;
  $  018.HCU(整车控制器)扭矩请求                                        $    $  Nm       $    $  ANS018.BYTE004  $  Y=(X1*256+X2)*0.25;
  $  019.电机扭矩估算值                                                 $    $  Nm       $    $  ANS019.BYTE004  $  Y=(X1*256+X2)/8;
  $  020.电机温度                                                       $    $  degC     $    $  ANS020.BYTE004  $  Y=X1-40;
  $  021.电机扭矩下限值                                                 $    $  Nm       $    $  ANS021.BYTE004  $  Y=(X1*256+X2)/8;
  $  022.电机扭矩上限值                                                 $    $  Nm       $    $  ANS022.BYTE004  $  Y=(X1*256+X2)/8;
  $  023.载波频率                                                       $    $  Hz       $    $  ANS023.BYTE004  $  Y=(X1*256+X2);
  $  024.支持的数据ID                                                   $    $           $    $  ANS024.BYTE004  $  Y=HEX(X1,X2);
  $  025.电机扭矩指令值                                                 $    $  Nm       $    $  ANS025.BYTE004  $  Y=(X1*256+X2)/8;
  $  026.电机工作状态                                                   $    $           $    $  ANS026.BYTE004  $  Y=(X1*256+X2);
  $  027.SPI Eltl位置                                                   $    $           $    $  ANS027.BYTE004  $  Y=(X1*256+X2);
  $  028.旋变补偿                                                       $    $           $    $  ANS028.BYTE004  $  Y=(X1*256+X2);
  $  029.控制的Eltl位置                                                 $    $           $    $  ANS029.BYTE004  $  Y=(X1*256+X2);
  $  030.车速                                                           $    $  km/h     $    $  ANS030.BYTE004  $  Y=(X1*256+X2)*0.01;
  $  031.MCU(驱动电机控制单元)弱电电压欠压标志位                        $    $           $    $  ANS031.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  032.MCU(驱动电机控制单元)弱电电压过压标志位                        $    $           $    $  ANS031.BYTE004  $  if((X1&0x02)==0) y=@003e;else if((X1&0x02)==0x02) y=@01b2;else y=@0004;
  $  033.驱动板数字5V电源异常标志位                                     $    $           $    $  ANS031.BYTE004  $  if((X1&0x04)==0) y=@003e;else if((X1&0x04)==0x04) y=@01b2;else y=@0004;
  $  034.驱动板模拟5V电压异常标志位                                     $    $           $    $  ANS031.BYTE004  $  if((X1&0x08)==0) y=@003e;else if((X1&0x08)==0x08) y=@01b2;else y=@0004;
  $  035.位置传感器供电电压异常标志位                                   $    $           $    $  ANS031.BYTE004  $  if((X1&0x10)==0) y=@003e;else if((X1&0x10)==0x10) y=@01b2;else y=@0004;
  $  036.电流传感器5V电源异常标志位                                     $    $           $    $  ANS031.BYTE004  $  if((X1&0x20)==0) y=@003e;else if((X1&0x20)==0x20) y=@01b2;else y=@0004;
  $  037.AD参考电压异常标志位                                           $    $           $    $  ANS031.BYTE004  $  if((X1&0x40)==0) y=@003e;else if((X1&0x40)==0x40) y=@01b2;else y=@0004;
  $  038.母线电压过压标志位(软件）                                      $    $           $    $  ANS032.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  039.母线电压欠压标志位(软件）                                      $    $           $    $  ANS032.BYTE004  $  if((X1&0x02)==0) y=@003e;else if((X1&0x02)==0x02) y=@01b2;else y=@0004;
  $  040.母线电压异常标志位                                             $    $           $    $  ANS032.BYTE004  $  if((X1&0x04)==0) y=@003e;else if((X1&0x04)==0x04) y=@01b2;else y=@0004;
  $  041.母线电压过压标志位(硬件）                                      $    $           $    $  ANS032.BYTE004  $  if((X1&0x08)==0) y=@003e;else if((X1&0x08)==0x08) y=@01b2;else y=@0004;
  $  042.BMS(电池管理系统)电压与母线电压差异异常标志位                  $    $           $    $  ANS032.BYTE004  $  if((X1&0x10)==0) y=@003e;else if((X1&0x10)==0x10) y=@01b2;else y=@0004;
  $  043.MCU(驱动电机控制单元) RAM(随机存储器)异常标志                  $    $           $    $  ANS032.BYTE004  $  if((X1&0x20)==0) y=@003e;else if((X1&0x20)==0x20) y=@01b2;else y=@0004;
  $  044.MCU(驱动电机控制单元) ROM(只读存储器)异常标志                  $    $           $    $  ANS032.BYTE004  $  if((X1&0x40)==0) y=@003e;else if((X1&0x40)==0x40) y=@01b2;else y=@0004;
  $  045.IGBT温度降额标志位                                             $    $           $    $  ANS033.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  046.IGBT温度过温标志位                                             $    $           $    $  ANS033.BYTE004  $  if((X1&0x02)==0) y=@003e;else if((X1&0x02)==0x02) y=@01b2;else y=@0004;
  $  047.电机温度降额标志位                                             $    $           $    $  ANS033.BYTE004  $  if((X1&0x04)==0) y=@003e;else if((X1&0x04)==0x04) y=@01b2;else y=@0004;
  $  048.电机温度过温标志位                                             $    $           $    $  ANS033.BYTE004  $  if((X1&0x08)==0) y=@003e;else if((X1&0x08)==0x08) y=@01b2;else y=@0004;
  $  049.驱动板高温异常标志位                                           $    $           $    $  ANS033.BYTE004  $  if((X1&0x10)==0) y=@003e;else if((X1&0x10)==0x10) y=@01b2;else y=@0004;
  $  050.驱动板过温异常标志位                                           $    $           $    $  ANS033.BYTE004  $  if((X1&0x20)==0) y=@003e;else if((X1&0x20)==0x20) y=@01b2;else y=@0004;
  $  051.ECU(电子控制器)内部监控异常标志位                              $    $           $    $  ANS033.BYTE004  $  if((X1&0x40)==0) y=@003e;else if((X1&0x40)==0x40) y=@01b2;else y=@0004;
  $  052.电流传感器偏移异常标志                                         $    $           $    $  ANS034.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  053.电机输出软件过电流标志位                                       $    $           $    $  ANS034.BYTE004  $  if((X1&0x02)==0) y=@003e;else if((X1&0x02)==0x02) y=@01b2;else y=@0004;
  $  054.电机输出硬件过电流标志位                                       $    $           $    $  ANS034.BYTE004  $  if((X1&0x04)==0) y=@003e;else if((X1&0x04)==0x04) y=@01b2;else y=@0004;
  $  055.三相电流和校验错误状态标志                                     $    $           $    $  ANS034.BYTE004  $  if((X1&0x08)==0) y=@003e;else if((X1&0x08)==0x08) y=@01b2;else y=@0004;
  $  056.高端IGBT故障异常标志                                           $    $           $    $  ANS034.BYTE004  $  if((X1&0x10)==0) y=@003e;else if((X1&0x10)==0x10) y=@01b2;else y=@0004;
  $  057.低端IGBT故障异常标志                                           $    $           $    $  ANS034.BYTE004  $  if((X1&0x20)==0) y=@003e;else if((X1&0x20)==0x20) y=@01b2;else y=@0004;
  $  058.高端IGBT就绪异常标志                                           $    $           $    $  ANS034.BYTE004  $  if((X1&0x40)==0) y=@003e;else if((X1&0x40)==0x40) y=@01b2;else y=@0004;
  $  059.低端IGBT就绪异常标志                                           $    $           $    $  ANS035.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  060.旋变励磁信号异常标志位                                         $    $           $    $  ANS035.BYTE004  $  if((X1&0x02)==0) y=@003e;else if((X1&0x02)==0x02) y=@01b2;else y=@0004;
  $  061.旋变信号采集异常                                               $    $           $    $  ANS035.BYTE004  $  if((X1&0x04)==0) y=@003e;else if((X1&0x04)==0x04) y=@01b2;else y=@0004;
  $  062.旋变合理性校验异常标志位                                       $    $           $    $  ANS035.BYTE004  $  if((X1&0x08)==0) y=@003e;else if((X1&0x08)==0x08) y=@01b2;else y=@0004;
  $  063.RD转换器Z信号停止异常标志位                                    $    $           $    $  ANS035.BYTE004  $  if((X1&0x10)==0) y=@003e;else if((X1&0x10)==0x10) y=@01b2;else y=@0004;
  $  064.RD转换器旋变角异常标志位                                       $    $           $    $  ANS035.BYTE004  $  if((X1&0x20)==0) y=@003e;else if((X1&0x20)==0x20) y=@01b2;else y=@0004;
  $  065.CAN通讯异常标志位                                              $    $           $    $  ANS035.BYTE004  $  if((X1&0x40)==0) y=@003e;else if((X1&0x40)==0x40) y=@01b2;else y=@0004;
  $  066.CAN接收异常(HCU节点)标识                                       $    $           $    $  ANS036.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  067.CAN接收异常(BMS节点)标志位                                     $    $           $    $  ANS036.BYTE004  $  if((X1&0x02)==0) y=@003e;else if((X1&0x02)==0x02) y=@01b2;else y=@0004;
  $  068.CAN接收异常(所有节点)标志位                                    $    $           $    $  ANS036.BYTE004  $  if((X1&0x04)==0) y=@003e;else if((X1&0x04)==0x04) y=@01b2;else y=@0004;
  $  069.HCU(整车控制器)_3报文Livecounter(动态计数器)异常标志位         $    $           $    $  ANS036.BYTE004  $  if((X1&0x08)==0) y=@003e;else if((X1&0x08)==0x08) y=@01b2;else y=@0004;
  $  070.HCU(整车控制器)_3报文Checksum(校验和)异常标志位                $    $           $    $  ANS036.BYTE004  $  if((X1&0x10)==0) y=@003e;else if((X1&0x10)==0x10) y=@01b2;else y=@0004;
  $  071.BMS(电池管理系统)_1报文Livecounter(动态计数器)异常标志位       $    $           $    $  ANS036.BYTE004  $  if((X1&0x20)==0) y=@003e;else if((X1&0x20)==0x20) y=@01b2;else y=@0004;
  $  072.BMS(电池管理系统)_1报文Checksum(校验和)异常标志位              $    $           $    $  ANS036.BYTE004  $  if((X1&0x40)==0) y=@003e;else if((X1&0x40)==0x40) y=@01b2;else y=@0004;
  $  073.诊断存储器数据异常(EEPROM)                                     $    $           $    $  ANS037.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  074.旋变补偿量存储器数据异常(EEPROM)标志位                         $    $           $    $  ANS037.BYTE004  $  if((X1&0x02)==0) y=@003e;else if((X1&0x02)==0x02) y=@01b2;else y=@0004;
  $  075.旋变补偿量未设定(EEPROM)标志位                                 $    $           $    $  ANS037.BYTE004  $  if((X1&0x04)==0) y=@003e;else if((X1&0x04)==0x04) y=@01b2;else y=@0004;
  $  076.旋变补偿量读取异常(EEPROM)标志位                               $    $           $    $  ANS037.BYTE004  $  if((X1&0x08)==0) y=@003e;else if((X1&0x08)==0x08) y=@01b2;else y=@0004;
  $  077.旋变补偿量溢出范围(EEPROM)标志位                               $    $           $    $  ANS037.BYTE004  $  if((X1&0x10)==0) y=@003e;else if((X1&0x10)==0x10) y=@01b2;else y=@0004;
  $  078.电机断路异常标志位                                             $    $           $    $  ANS037.BYTE004  $  if((X1&0x20)==0) y=@003e;else if((X1&0x20)==0x20) y=@01b2;else y=@0004;
  $  079.扭矩监视异常标志位                                             $    $           $    $  ANS037.BYTE004  $  if((X1&0x40)==0) y=@003e;else if((X1&0x40)==0x40) y=@01b2;else y=@0004;
  $  080.电机减磁标志位                                                 $    $           $    $  ANS038.BYTE004  $  if((X1&0x01)==0) y=@003e;else if((X1&0x01)==0x01) y=@01b2;else y=@0004;
  $  081.支持的数据ID                                                   $    $           $    $  ANS039.BYTE004  $  Y=HEX(X1);
  $  082.MCU(驱动电机控制单元)使能                                      $    $           $    $  ANS040.BYTE004  $  if((X1&0x01)==0) y=@0469;else if((X1&0x01)==0x01) y=@018d;else y=@0004;
  $  083.快速放电请求                                                   $    $           $    $  ANS040.BYTE004  $  if((X1&0x02)==0) y=@0005;else if((X1&0x02)==0x02) y=@0016;else y=@0004;
  $  084.主正继电器状态                                                 $    $           $    $  ANS040.BYTE004  $  if((X1&0x04)==0) y=@020f;else if((X1&0x04)==0x04) y=@0210;else y=@0004;
  $  085.预充继电器状态                                                 $    $           $    $  ANS040.BYTE004  $  if((X1&0x08)==0) y=@020f;else if((X1&0x08)==0x08) y=@0210;else y=@0004;
  $  086.MCU(驱动电机控制单元)冷却请求                                  $    $           $    $  ANS041.BYTE004  $  if((X1&0x07)==0) y=@009c;else if((X1&0x07)==1) y=@0c33;else if((X1&0x07)==2) y=@0c34;else if((X1&0x07)==3) y=@0c35;else if((X1&0x07)==7) y=@0c35;else y=@0004;
  $  087.电机工作状态                                                   $    $           $    $  ANS042.BYTE004  $  if((X1&0x07)==0) y=@0025;else if((X1&0x07)==1) y=@0c2e;else if((X1&0x07)==2) y=@0c2f;else if((X1&0x07)==3) y=@031f;else if((X1&0x07)==4) y=@0c30;else if((X1&0x07)==5) y=@0c31;else if((X1&0x07)==7) y=@0c32;else y=@0004;
  $  088.MCU(驱动电机控制单元) PWM(脉宽调制)状态                        $    $           $    $  ANS042.BYTE004  $  if(((x>>3)&0x03)==0) y=@0793;else if(((x>>3)&0x03)==1) y=@0371;else if(((x>>3)&0x03)==2) y=@0c2d;else y=@0004;
  $  089.TM错误状态                                                     $    $           $    $  ANS042.BYTE004  $  if(((x>>5)&0x07)==0) y=@00f5;else if(((x>>5)&0x07)==1) y=@0213;else if(((x>>5)&0x07)==2) y=@0c36;else if(((x>>5)&0x07)==3) y=@0024;else if(((x>>5)&0x07)==4) y=@0c37;else if(((x>>5)&0x07)==5) y=@0c38;else y=@0004;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7F0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
