
    车型ID：7132

    模拟：协议模拟-->7132

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E3 02 10 01 00 00 00 00 00       $~  ANS000:7EB 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E3 02 3E 00 00 00 00 00 00       $!  ANS000:7EB 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E3 03 19 02 08 00 00 00 00       $#  ANS000:7EB 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E3 04 14 FF FF FF 00 00 00       $$  ANS000:7EB 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E3 03 22 F1 A6 00 00 00 00       $%  ANS000:7EB 03 22 F1 A6 00 00 00 00
  $%  REQ001:7E3 03 22 F1 A5 00 00 00 00       $%  ANS001:7EB 03 22 F1 A5 00 00 00 00
  $%  REQ002:7E3 03 22 F1 A4 00 00 00 00       $%  ANS002:7EB 03 22 F1 A4 00 00 00 00
  $%  REQ003:7E3 03 22 F1 A3 00 00 00 00       $%  ANS003:7EB 03 22 F1 A3 00 00 00 00
  $%  REQ004:7E3 03 22 F1 A1 00 00 00 00       $%  ANS004:7EB 03 22 F1 A1 00 00 00 00
  $%  REQ005:7E3 03 22 F1 9D 00 00 00 00       $%  ANS005:7EB 03 22 F1 9D 00 00 00 00
  $%  REQ006:7E3 03 22 F1 9C 00 00 00 00       $%  ANS006:7EB 03 22 F1 9C 00 00 00 00
  $%  REQ007:7E3 03 22 F1 99 00 00 00 00       $%  ANS007:7EB 03 22 F1 99 00 00 00 00
  $%  REQ008:7E3 03 22 F1 98 00 00 00 00       $%  ANS008:7EB 03 22 F1 98 00 00 00 00
  $%  REQ009:7E3 03 22 F1 95 00 00 00 00       $%  ANS009:7EB 03 22 F1 95 00 00 00 00
  $%  REQ010:7E3 03 22 F1 94 00 00 00 00       $%  ANS010:7EB 03 22 F1 94 00 00 00 00
  $%  REQ011:7E3 03 22 F1 93 00 00 00 00       $%  ANS011:7EB 03 22 F1 93 00 00 00 00
  $%  REQ012:7E3 03 22 F1 92 00 00 00 00       $%  ANS012:7EB 03 22 F1 92 00 00 00 00
  $%  REQ013:7E3 03 22 F1 91 00 00 00 00       $%  ANS013:7EB 03 22 F1 91 00 00 00 00
  $%  REQ014:7E3 03 22 F1 90 00 00 00 00       $%  ANS014:7EB 03 22 F1 90 00 00 00 00
  $%  REQ015:7E3 03 22 F1 8C 00 00 00 00       $%  ANS015:7EB 03 22 F1 8C 00 00 00 00
  $%  REQ016:7E3 03 22 F1 89 00 00 00 00       $%  ANS016:7EB 03 22 F1 89 00 00 00 00
  $%  REQ017:7E3 03 22 F1 87 00 00 00 00       $%  ANS017:7EB 03 22 F1 87 00 00 00 00
  $%  REQ018:7E3 03 22 F1 83 00 00 00 00       $%  ANS018:7EB 03 22 F1 83 00 00 00 00
  $%  REQ019:7E3 03 22 F1 81 00 00 00 00       $%  ANS019:7EB 03 22 F1 81 00 00 00 00
  $%  REQ020:7E3 03 22 F1 80 00 00 00 00       $%  ANS020:7EB 03 22 F1 80 00 00 00 00
  $%  REQ021:7E3 03 22 F1 00 00 00 00 00       $%  ANS021:7EB 03 22 F1 00 00 00 00 00

  $%  000:车辆在生产线上的生产日期:                   $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);
  $%  001:车辆规格号:                                 $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18);
  $%  002:供应商ECU(电子控制器)标定软件版本号:        $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  003:SK码:                                       $%    $%  ANS003.BYTE004  $%  Y=HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  004:系统配置:                                   $%    $%  ANS004.BYTE004  $%  0 HEX
  $%  005:ECU(电子控制器)安装日期:                    $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);
  $%  006:标定软件版本号:                             $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  007:编程日期:                                   $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);
  $%  008:诊断仪序列号:                               $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  009:供应商软件版本号:                           $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:供应商软件号:                               $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:供应商硬件版本号:                           $%    $%  ANS011.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  012:供应商ECU(电子控制器)硬件号:                $%    $%  ANS012.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  013:ECU(电子控制器)硬件版本号:                  $%    $%  ANS013.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  014:车辆VIN:                                    $%    $%  ANS014.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  015:ECU(电子控制器)序列号:                      $%    $%  ANS015.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  016:ECU(电子控制器)软件版本号:                  $%    $%  ANS016.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  017:OEM(原厂设备制造商)零件号:                  $%    $%  ANS017.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  018:供应商ECU(电子控制器)刷新软件版本号:        $%    $%  ANS018.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  019:ECU(电子控制器)应用软件版本号:              $%    $%  ANS019.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  020:ECU(电子控制器)刷新软件版本号:              $%    $%  ANS020.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  021:模式配置:                                   $%    $%  ANS021.BYTE004  $%  Y=HEX(X1);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E3 03 22 03 46 00 00 00 00       $  ANS000:7EB 03 22 03 46 00 00 00 00
  $  REQ001:7E3 03 22 03 3F 00 00 00 00       $  ANS001:7EB 03 22 03 3F 00 00 00 00
  $  REQ002:7E3 03 22 03 3E 00 00 00 00       $  ANS002:7EB 03 22 03 3E 00 00 00 00
  $  REQ003:7E3 03 22 03 3D 00 00 00 00       $  ANS003:7EB 03 22 03 3D 00 00 00 00
  $  REQ004:7E3 03 22 03 3C 00 00 00 00       $  ANS004:7EB 03 22 03 3C 00 00 00 00
  $  REQ005:7E3 03 22 03 3A 00 00 00 00       $  ANS005:7EB 03 22 03 3A 00 00 00 00
  $  REQ006:7E3 03 22 03 39 00 00 00 00       $  ANS006:7EB 03 22 03 39 00 00 00 00
  $  REQ007:7E3 03 22 03 38 00 00 00 00       $  ANS007:7EB 03 22 03 38 00 00 00 00
  $  REQ008:7E3 03 22 03 37 00 00 00 00       $  ANS008:7EB 03 22 03 37 00 00 00 00
  $  REQ009:7E3 03 22 03 36 00 00 00 00       $  ANS009:7EB 03 22 03 36 00 00 00 00
  $  REQ010:7E3 03 22 03 35 00 00 00 00       $  ANS010:7EB 03 22 03 35 00 00 00 00
  $  REQ011:7E3 03 22 03 32 00 00 00 00       $  ANS011:7EB 03 22 03 32 00 00 00 00
  $  REQ012:7E3 03 22 03 31 00 00 00 00       $  ANS012:7EB 03 22 03 31 00 00 00 00
  $  REQ013:7E3 03 22 03 30 00 00 00 00       $  ANS013:7EB 03 22 03 30 00 00 00 00
  $  REQ014:7E3 03 22 03 2F 00 00 00 00       $  ANS014:7EB 03 22 03 2F 00 00 00 00
  $  REQ015:7E3 03 22 03 2E 00 00 00 00       $  ANS015:7EB 03 22 03 2E 00 00 00 00
  $  REQ016:7E3 03 22 03 2D 00 00 00 00       $  ANS016:7EB 03 22 03 2D 00 00 00 00
  $  REQ017:7E3 03 22 03 2C 00 00 00 00       $  ANS017:7EB 03 22 03 2C 00 00 00 00
  $  REQ018:7E3 03 22 03 2A 00 00 00 00       $  ANS018:7EB 03 22 03 2A 00 00 00 00
  $  REQ019:7E3 03 22 03 29 00 00 00 00       $  ANS019:7EB 03 22 03 29 00 00 00 00
  $  REQ020:7E3 03 22 03 28 00 00 00 00       $  ANS020:7EB 03 22 03 28 00 00 00 00
  $  REQ021:7E3 03 22 03 26 00 00 00 00       $  ANS021:7EB 03 22 03 26 00 00 00 00
  $  REQ022:7E3 03 22 03 24 00 00 00 00       $  ANS022:7EB 03 22 03 24 00 00 00 00
  $  REQ023:7E3 03 22 03 23 00 00 00 00       $  ANS023:7EB 03 22 03 23 00 00 00 00
  $  REQ024:7E3 03 22 03 22 00 00 00 00       $  ANS024:7EB 03 22 03 22 00 00 00 00
  $  REQ025:7E3 03 22 03 21 00 00 00 00       $  ANS025:7EB 03 22 03 21 00 00 00 00
  $  REQ026:7E3 03 22 03 20 00 00 00 00       $  ANS026:7EB 03 22 03 20 00 00 00 00
  $  REQ027:7E3 03 22 03 1E 00 00 00 00       $  ANS027:7EB 03 22 03 1E 00 00 00 00
  $  REQ028:7E3 03 22 03 1D 00 00 00 00       $  ANS028:7EB 03 22 03 1D 00 00 00 00
  $  REQ029:7E3 03 22 03 1C 00 00 00 00       $  ANS029:7EB 03 22 03 1C 00 00 00 00
  $  REQ030:7E3 03 22 03 1B 00 00 00 00       $  ANS030:7EB 03 22 03 1B 00 00 00 00
  $  REQ031:7E3 03 22 03 1A 00 00 00 00       $  ANS031:7EB 03 22 03 1A 00 00 00 00
  $  REQ032:7E3 03 22 03 19 00 00 00 00       $  ANS032:7EB 03 22 03 19 00 00 00 00
  $  REQ033:7E3 03 22 03 18 00 00 00 00       $  ANS033:7EB 03 22 03 18 00 00 00 00
  $  REQ034:7E3 03 22 03 17 00 00 00 00       $  ANS034:7EB 03 22 03 17 00 00 00 00
  $  REQ035:7E3 03 22 03 16 00 00 00 00       $  ANS035:7EB 03 22 03 16 00 00 00 00
  $  REQ036:7E3 03 22 03 15 00 00 00 00       $  ANS036:7EB 03 22 03 15 00 00 00 00
  $  REQ037:7E3 03 22 03 14 00 00 00 00       $  ANS037:7EB 03 22 03 14 00 00 00 00
  $  REQ038:7E3 03 22 03 13 00 00 00 00       $  ANS038:7EB 03 22 03 13 00 00 00 00
  $  REQ039:7E3 03 22 03 12 00 00 00 00       $  ANS039:7EB 03 22 03 12 00 00 00 00
  $  REQ040:7E3 03 22 03 11 00 00 00 00       $  ANS040:7EB 03 22 03 11 00 00 00 00
  $  REQ041:7E3 03 22 03 10 00 00 00 00       $  ANS041:7EB 03 22 03 10 00 00 00 00
  $  REQ042:7E3 03 22 03 0F 00 00 00 00       $  ANS042:7EB 03 22 03 0F 00 00 00 00
  $  REQ043:7E3 03 22 03 0E 00 00 00 00       $  ANS043:7EB 03 22 03 0E 00 00 00 00
  $  REQ044:7E3 03 22 03 0D 00 00 00 00       $  ANS044:7EB 03 22 03 0D 00 00 00 00
  $  REQ045:7E3 03 22 03 0C 00 00 00 00       $  ANS045:7EB 03 22 03 0C 00 00 00 00
  $  REQ046:7E3 03 22 03 0B 00 00 00 00       $  ANS046:7EB 03 22 03 0B 00 00 00 00
  $  REQ047:7E3 03 22 03 0A 00 00 00 00       $  ANS047:7EB 03 22 03 0A 00 00 00 00
  $  REQ048:7E3 03 22 03 09 00 00 00 00       $  ANS048:7EB 03 22 03 09 00 00 00 00
  $  REQ049:7E3 03 22 03 08 00 00 00 00       $  ANS049:7EB 03 22 03 08 00 00 00 00
  $  REQ050:7E3 03 22 03 07 00 00 00 00       $  ANS050:7EB 03 22 03 07 00 00 00 00
  $  REQ051:7E3 03 22 03 06 00 00 00 00       $  ANS051:7EB 03 22 03 06 00 00 00 00
  $  REQ052:7E3 03 22 03 05 00 00 00 00       $  ANS052:7EB 03 22 03 05 00 00 00 00
  $  REQ053:7E3 03 22 03 04 00 00 00 00       $  ANS053:7EB 03 22 03 04 00 00 00 00
  $  REQ054:7E3 03 22 03 01 00 00 00 00       $  ANS054:7EB 03 22 03 01 00 00 00 00
  $  REQ055:7E3 03 22 03 00 00 00 00 00       $  ANS055:7EB 03 22 03 00 00 00 00 00

  $  000.档位信息                                     $    $           $    $  ANS000.BYTE004  $  if(X1==0) y=@0075;else if(X1==1) y=@0076;else if(X1==2) y=@0077;else if(X1==3) y=@0078;else if(X1==7) y=@0069;else y=@0006;
  $  001.直流充电口温度传感器2信号电压                $    $  mV       $    $  ANS001.BYTE004  $  Y=(X1*256+X2)*1;
  $  002.直流充电口温度传感器1信号电压                $    $  mV       $    $  ANS002.BYTE004  $  Y=(X1*256+X2)*1;
  $  003.交流充电口温度传感器2信号电压                $    $  mV       $    $  ANS003.BYTE004  $  Y=(X1*256+X2)*1;
  $  004.交流充电口温度传感器1信号电压                $    $  mV       $    $  ANS004.BYTE004  $  Y=(X1*256+X2)*1;
  $  005.水温传感器信号电压                           $    $  mV       $    $  ANS005.BYTE004  $  Y=(X1*256+X2)*1;
  $  006.辅助制动开关状态                             $    $           $    $  ANS006.BYTE004  $  if(X1==0) y=@000b;else if(X1==1) y=@000c;else y=@0006;
  $  007.主制动开关状态                               $    $           $    $  ANS007.BYTE004  $  if(X1==0) y=@000b;else if(X1==1) y=@000c;else y=@0006;
  $  008.互锁开关输入电压                             $    $  mV       $    $  ANS008.BYTE004  $  Y=(X1*256+X2)*1;
  $  009.互锁开关输出电压                             $    $  mV       $    $  ANS009.BYTE004  $  Y=(X1*256+X2)*1;
  $  010.充电口电压                                   $    $  mV       $    $  ANS010.BYTE004  $  Y=(X1*256+X2)*1;
  $  011.加速踏板2信号电压                            $    $  mV       $    $  ANS011.BYTE004  $  Y=(X1*256+X2)*1;
  $  012.加速踏板1信号电压                            $    $  mV       $    $  ANS012.BYTE004  $  Y=(X1*256+X2)*1;
  $  013.加速踏板2供电电压                            $    $  mV       $    $  ANS013.BYTE004  $  Y=(X1*256+X2)*1;
  $  014.加速踏板1供电电压                            $    $  mV       $    $  ANS014.BYTE004  $  Y=(X1*256+X2)*1;
  $  015.能量管理模式                                 $    $           $    $  ANS015.BYTE004  $  if(X1==0) y=@07a5;else if(X1==1) y=@02e2;else if(X1==2) y=@07a6;else if(X1==3) y=@07a7;else if(X1==4) y=@07a8;else if(X1==5) y=@07a9;else if(X1==6) y=@07aa;else if(X1==7) y=@07ab;else if(X1==8) y=@07ac;else if(X1==9) y=@07ad;else if(X1==10) y=@020b;else if(X1==11) y=@07ae;else if(X1==12) y=@07af;else if(X1==13) y=@07b0;else if(X1==14) y=@07b1;else if(X1==15) y=@07b2;else if(X1==16) y=@07b3;else if(X1==17) y=@07b4;else if(X1==18) y=@07b5;else if(X1==19) y=@0227;else if(X1==21) y=@07b6;else if(X1==22) y=@07b7;else if(X1==23) y=@0c90;else if(X1==24) y=@0c91;else if(X1==25) y=@0c92;else if(X1==26) y=@07bb;else if(X1==27) y=@07bc;else if(X1==28) y=@07bd;else if(X1==29) y=@07be;else if(X1==30) y=@07bf;else y=@0006;
  $  016.电机控制模式                                 $    $           $    $  ANS016.BYTE004  $  if(X1==0) y=@02e2;else if(X1==1) y=@07a2;else if(X1==2) y=@04e7;else if(X1==3) y=@0c8b;else if(X1==4) y=@00d8;else if(X1==5) y=@07a3;else if(X1==6) y=@0c8c;else if(X1==7) y=@07a4;else y=@0006;
  $  017.高压系统控制模式                             $    $           $    $  ANS017.BYTE004  $  if(X1==0) y=@078c;else if(X1==1) y=@078d;else if(X1==2) y=@078e;else if(X1==3) y=@078f;else if(X1==4) y=@0790;else if(X1==5) y=@0791;else if(X1==6) y=@0792;else if(X1==7) y=@0793;else if(X1==8) y=@0794;else if(X1==9) y=@0795;else if(X1==10) y=@0796;else if(X1==11) y=@0797;else if(X1==12) y=@0798;else if(X1==13) y=@0799;else if(X1==14) y=@079a;else if(X1==15) y=@079b;else if(X1==16) y=@079c;else if(X1==17) y=@079d;else if(X1==18) y=@079e;else if(X1==19) y=@079f;else if(X1==20) y=@07a0;else if(X1==21) y=@07a1;else y=@0006;
  $  018.电机水温                                     $    $  degC     $    $  ANS018.BYTE004  $  Y=(X1*256+X2)*0.05-1638.4;
  $  019.低压管理继电器后电压                         $    $  mV       $    $  ANS019.BYTE004  $  Y=(X1*256+X2)*1;
  $  020.低压管理继电器控制信号                       $    $           $    $  ANS020.BYTE004  $  if(X1==0) y=@02c1;else if(X1==1) y=@0005;else y=@0006;
  $  021.电池控制信号PWM(脉宽调制)                    $    $  %        $    $  ANS021.BYTE004  $  Y=(X1*256+X2)*0.005;
  $  022.前驱动电机冷却水泵控制PWM(脉宽调制)          $    $  %        $    $  ANS022.BYTE004  $  Y=(X1*256+X2)*0.005;
  $  023.高速冷却风扇继电器控制信号                   $    $           $    $  ANS023.BYTE004  $  if(X1==0) y=@02c1;else if(X1==1) y=@0005;else y=@0006;
  $  024.低速冷却风扇继电器控制信号                   $    $           $    $  ANS024.BYTE004  $  if(X1==0) y=@02c1;else if(X1==1) y=@0005;else y=@0006;
  $  025.冷却风扇继电器控制信号                       $    $           $    $  ANS025.BYTE004  $  if(X1==0) y=@02c1;else if(X1==1) y=@0005;else y=@0006;
  $  026.水暖PTC(高压加热电阻)控制PWM(脉宽调制)       $    $  %        $    $  ANS026.BYTE004  $  Y=(X1*256+X2)*0.005;
  $  027.小电瓶电压                                   $    $  V        $    $  ANS027.BYTE004  $  Y=X1*0.07;
  $  028.HCU(整车控制器)状态                          $    $           $    $  ANS028.BYTE004  $  if(X1==0) y=@006c;else if(X1==1) y=@028c;else if(X1==2) y=@008b;else y=@0006;
  $  029.车辆就绪标志                                 $    $           $    $  ANS029.BYTE004  $  if(X1==0) y=@0c88;else if(X1==1) y=@0c89;else if(X1==2) y=@0c8a;else y=@0006;
  $  030.制动信号                                     $    $           $    $  ANS030.BYTE004  $  if(X1==0) y=@0c8e;else if(X1==1) y=@0c8f;else if(X1==3) y=@0006;else y=@0006;
  $  031.虚拟加速踏板开度                             $    $  %        $    $  ANS031.BYTE004  $  Y=X1*0.4;
  $  032.加速踏板开度                                 $    $  %        $    $  ANS032.BYTE004  $  Y=X1*0.4;
  $  033.钥匙位置                                     $    $           $    $  ANS033.BYTE004  $  if(X1==0) y=@05ee;else if(X1==1) y=@0070;else if(X1==2) y=@05ef;else if(X1==3) y=@00fa;else y=@0006;
  $  034.高压互锁系统状态                             $    $           $    $  ANS034.BYTE004  $  if(X1==0) y=@0028;else if(X1==1) y=@008b;else y=@0006;
  $  035.电机控制模式                                 $    $           $    $  ANS035.BYTE004  $  if(X1==0) y=@0056;else if(X1==1) y=@0c8d;else y=@0006;
  $  036.快速放电命令                                 $    $           $    $  ANS036.BYTE004  $  if(X1==0) y=@02c1;else if(X1==1) y=@0005;else y=@0006;
  $  037.MCU(驱动电机控制单元)使能命令                $    $           $    $  ANS037.BYTE004  $  if(X1==0) y=@0133;else if(X1==1) y=@0132;else y=@0006;
  $  038.电机力矩请求                                 $    $  Nm       $    $  ANS038.BYTE004  $  Y=(X1*256+X2)*0.25-350;
  $  039.电机转速请求                                 $    $  rpm      $    $  ANS039.BYTE004  $  Y=(X1*256+X2)*1-14000;
  $  040.充电负继电器控制命令                         $    $           $    $  ANS040.BYTE004  $  if(X1==0) y=@0002;else if(X1==1) y=@0001;else y=@0006;
  $  041.充电正继电器控制命令                         $    $           $    $  ANS041.BYTE004  $  if(X1==0) y=@0002;else if(X1==1) y=@0001;else y=@0006;
  $  042.预充继电器控制命令                           $    $           $    $  ANS042.BYTE004  $  if(X1==0) y=@0002;else if(X1==1) y=@0001;else y=@0006;
  $  043.主负继电器控制命令                           $    $           $    $  ANS043.BYTE004  $  if(X1==0) y=@0002;else if(X1==1) y=@0001;else y=@0006;
  $  044.主正继电器控制命令                           $    $           $    $  ANS044.BYTE004  $  if(X1==0) y=@0002;else if(X1==1) y=@0001;else y=@0006;
  $  045.碰撞状态                                     $    $           $    $  ANS045.BYTE004  $  if(X1==0) y=@05dd;else if(X1==1) y=@0bbd;else y=@0006;
  $  046.车速                                         $    $  km/h     $    $  ANS046.BYTE004  $  Y=(X1*256+X2)/100;
  $  047.电池SOC(电池剩余电量)值                      $    $  %        $    $  ANS047.BYTE004  $  Y=(X1*256+X2)/10;
  $  048.电池温度                                     $    $  degC     $    $  ANS048.BYTE004  $  Y=X1*1-40;
  $  049.动力电池状态                                 $    $           $    $  ANS049.BYTE004  $  if(X1==0) y=@006c;else if(X1==1) y=@028c;else if(X1==2) y=@0c85;else if(X1==3) y=@07c1;else if(X1==4) y=@07c2;else if(X1==5) y=@07c3;else if(X1==6) y=@07c4;else if(X1==7) y=@07c5;else if(X1==8) y=@07c6;else if(X1==14) y=@070f;else y=@0006;
  $  050.电机温度                                     $    $  degC     $    $  ANS050.BYTE004  $  Y=X1*1-40;
  $  051.IGBT温度                                     $    $  degC     $    $  ANS051.BYTE004  $  Y=X1*1-40;
  $  052.电机故障状态                                 $    $           $    $  ANS052.BYTE004  $  if(X1==0) y=@0c86;else if(X1==1) y=@028c;else if(X1==2) y=@0c87;else if(X1==3) y=@0410;else if(X1==4) y=@07ca;else if(X1==5) y=@07cb;else y=@0006;
  $  053.电机工作状态                                 $    $           $    $  ANS053.BYTE004  $  if(X1==0) y=@02e2;else if(X1==1) y=@07a2;else if(X1==2) y=@04e7;else if(X1==3) y=@0c8b;else if(X1==4) y=@00d8;else if(X1==5) y=@07a3;else if(X1==6) y=@0c8c;else if(X1==7) y=@07a4;else y=@0006;
  $  054.前电机实际扭矩                               $    $  Nm       $    $  ANS054.BYTE004  $  Y=(X1*256+X2)*0.25-350;
  $  055.前电机实际转速                               $    $  rpm      $    $  ANS055.BYTE004  $  Y=(X1*256+X2)*1-14000;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E3 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
