
    车型ID：7213

    模拟：协议模拟-->7213

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:725 02 10 01 00 00 00 00 00       $~  ANS000:72D 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:725 02 3E 00 00 00 00 00 00       $!  ANS000:72D 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:725 03 19 02 09 00 00 00 00       $#  ANS000:72D 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:725 04 14 FF FF FF 00 00 00       $$  ANS000:72D 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:725 03 22 F1 00 00 00 00 00       $%  ANS000:72D 03 22 F1 00 00 00 00 00
  $%  REQ001:725 03 22 F1 80 00 00 00 00       $%  ANS001:72D 03 22 F1 80 00 00 00 00
  $%  REQ002:725 03 22 F1 81 00 00 00 00       $%  ANS002:72D 03 22 F1 81 00 00 00 00
  $%  REQ003:725 03 22 F1 83 00 00 00 00       $%  ANS003:72D 03 22 F1 83 00 00 00 00
  $%  REQ004:725 03 22 F1 87 00 00 00 00       $%  ANS004:72D 03 22 F1 87 00 00 00 00
  $%  REQ005:725 03 22 F1 89 00 00 00 00       $%  ANS005:72D 03 22 F1 89 00 00 00 00
  $%  REQ006:725 03 22 F1 90 00 00 00 00       $%  ANS006:72D 03 22 F1 90 00 00 00 00
  $%  REQ007:725 03 22 F1 91 00 00 00 00       $%  ANS007:72D 03 22 F1 91 00 00 00 00
  $%  REQ008:725 03 22 F1 92 00 00 00 00       $%  ANS008:72D 03 22 F1 92 00 00 00 00
  $%  REQ009:725 03 22 F1 93 00 00 00 00       $%  ANS009:72D 03 22 F1 93 00 00 00 00
  $%  REQ010:725 03 22 F1 94 00 00 00 00       $%  ANS010:72D 03 22 F1 94 00 00 00 00
  $%  REQ011:725 03 22 F1 95 00 00 00 00       $%  ANS011:72D 03 22 F1 95 00 00 00 00
  $%  REQ012:725 03 22 F1 98 00 00 00 00       $%  ANS012:72D 03 22 F1 98 00 00 00 00
  $%  REQ013:725 03 22 F1 99 00 00 00 00       $%  ANS013:72D 03 22 F1 99 00 00 00 00
  $%  REQ014:725 03 22 F1 9C 00 00 00 00       $%  ANS014:72D 03 22 F1 9C 00 00 00 00
  $%  REQ015:725 03 22 F1 9D 00 00 00 00       $%  ANS015:72D 03 22 F1 9D 00 00 00 00
  $%  REQ016:725 03 22 F1 A1 00 00 00 00       $%  ANS016:72D 03 22 F1 A1 00 00 00 00
  $%  REQ017:725 03 22 F1 A4 00 00 00 00       $%  ANS017:72D 03 22 F1 A4 00 00 00 00

  $%  000:模式配置:                                   $%    $%  ANS000.BYTE004  $%  Y=HEX(X1);
  $%  001:ECU(电子控制器)刷新软件版本号:              $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  002:ECU(电子控制器)应用软件版本号:              $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  003:供应商ECU(电子控制器)刷新软件版本号:        $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  004:零件号:                                     $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  005:ECU(电子控制器)软件版本号:                  $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  006:车辆VIN:                                    $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  007:ECU(电子控制器)硬件版本号:                  $%    $%  ANS007.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  008:供应商ECU(电子控制器)硬件号:                $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:供应商ECU(电子控制器)硬件版本号:            $%    $%  ANS009.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:供应商ECU(电子控制器)软件号:                $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:供应商ECU(电子控制器)软件版本号:            $%    $%  ANS011.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  012:诊断仪序列号:                               $%    $%  ANS012.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:编程日期:                                   $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);
  $%  014:标定软件版本号:                             $%    $%  ANS014.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  015:ECU(电子控制器)安装日期:                    $%    $%  ANS015.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);
  $%  016:系统配置:                                   $%    $%  ANS016.BYTE004  $%  Y=HEX(X1,X2,X3);
  $%  017:供应商ECU(电子控制器)标定软件版本号:        $%    $%  ANS017.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:725 03 22 2A C0 00 00 00 00       $  ANS000:72D 03 22 2A C0 00 00 00 00
  $  REQ001:725 03 22 2A C1 00 00 00 00       $  ANS001:72D 03 22 2A C1 00 00 00 00
  $  REQ002:725 03 22 2A C2 00 00 00 00       $  ANS002:72D 03 22 2A C2 00 00 00 00
  $  REQ003:725 03 22 2A C3 00 00 00 00       $  ANS003:72D 03 22 2A C3 00 00 00 00
  $  REQ004:725 03 22 2A C4 00 00 00 00       $  ANS004:72D 03 22 2A C4 00 00 00 00
  $  REQ005:725 03 22 2A C5 00 00 00 00       $  ANS005:72D 03 22 2A C5 00 00 00 00
  $  REQ006:725 03 22 2A C6 00 00 00 00       $  ANS006:72D 03 22 2A C6 00 00 00 00

  $  000.ECU(电子控制器)供电电压                              $    $  V      $    $  ANS000.BYTE004  $  Y=X1*0.1;
  $  001.距离障碍物距离距离障碍物距离USS1，直接回波           $    $  cm     $    $  ANS001.BYTE004  $  Y=X1*256+X2;
  $  002.距离障碍物距离距离障碍物距离USS2，直接回波           $    $  cm     $    $  ANS001.BYTE006  $  Y=X1*256+X2;
  $  003.距离障碍物距离距离障碍物距离USS3，直接回波           $    $  cm     $    $  ANS001.BYTE008  $  Y=X1*256+X2;
  $  004.距离障碍物距离距离障碍物距离USS4，直接回波           $    $  cm     $    $  ANS001.BYTE010  $  Y=X1*256+X2;
  $  005.距离障碍物距离距离障碍物距离USS5，直接回波           $    $  cm     $    $  ANS001.BYTE012  $  Y=X1*256+X2;
  $  006.距离障碍物距离距离障碍物距离USS6，直接回波           $    $  cm     $    $  ANS001.BYTE014  $  Y=X1*256+X2;
  $  007.距离障碍物距离距离障碍物距离USS7，直接回波           $    $  cm     $    $  ANS001.BYTE016  $  Y=X1*256+X2;
  $  008.距离障碍物距离距离障碍物距离USS8，直接回波           $    $  cm     $    $  ANS001.BYTE018  $  Y=X1*256+X2;
  $  009.距离障碍物距离距离障碍物距离USS9，直接回波           $    $  cm     $    $  ANS001.BYTE020  $  Y=X1*256+X2;
  $  010.距离障碍物距离距离障碍物距离USS10，直接回波          $    $  cm     $    $  ANS001.BYTE022  $  Y=X1*256+X2;
  $  011.距离障碍物距离距离障碍物距离USS11，直接回波          $    $  cm     $    $  ANS001.BYTE024  $  Y=X1*256+X2;
  $  012.距离障碍物距离距离障碍物距离USS12，直接回波          $    $  cm     $    $  ANS001.BYTE026  $  Y=X1*256+X2;
  $  013.距离障碍物距离距离障碍物距离USS1-2，间接回波         $    $  cm     $    $  ANS001.BYTE028  $  Y=X1*256+X2;
  $  014.距离障碍物距离距离障碍物距离USS2-3，间接回波         $    $  cm     $    $  ANS001.BYTE030  $  Y=X1*256+X2;
  $  015.距离障碍物距离距离障碍物距离USS3-4，间接回波         $    $  cm     $    $  ANS001.BYTE032  $  Y=X1*256+X2;
  $  016.距离障碍物距离距离障碍物距离USS4-5，间接回波         $    $  cm     $    $  ANS001.BYTE034  $  Y=X1*256+X2;
  $  017.距离障碍物距离距离障碍物距离USS5-6，间接回波         $    $  cm     $    $  ANS001.BYTE036  $  Y=X1*256+X2;
  $  018.距离障碍物距离距离障碍物距离USS7-8，间接回波         $    $  cm     $    $  ANS001.BYTE038  $  Y=X1*256+X2;
  $  019.距离障碍物距离距离障碍物距离USS8-9，间接回波         $    $  cm     $    $  ANS001.BYTE040  $  Y=X1*256+X2;
  $  020.距离障碍物距离距离障碍物距离USS9-10，间接回波        $    $  cm     $    $  ANS001.BYTE042  $  Y=X1*256+X2;
  $  021.距离障碍物距离距离障碍物距离USS10-11，间接回波       $    $  cm     $    $  ANS001.BYTE044  $  Y=X1*256+X2;
  $  022.距离障碍物距离距离障碍物距离USS11-12，间接回波       $    $  cm     $    $  ANS001.BYTE046  $  Y=X1*256+X2;
  $  023.USS1响铃时间                                         $    $  us     $    $  ANS002.BYTE004  $  Y=X1*256+X2;
  $  024.USS2响铃时间                                         $    $  us     $    $  ANS002.BYTE006  $  Y=X1*256+X2;
  $  025.USS3响铃时间                                         $    $  us     $    $  ANS002.BYTE008  $  Y=X1*256+X2;
  $  026.USS4响铃时间                                         $    $  us     $    $  ANS002.BYTE010  $  Y=X1*256+X2;
  $  027.USS5响铃时间                                         $    $  us     $    $  ANS002.BYTE012  $  Y=X1*256+X2;
  $  028.USS6响铃时间                                         $    $  us     $    $  ANS002.BYTE014  $  Y=X1*256+X2;
  $  029.USS7响铃时间                                         $    $  us     $    $  ANS002.BYTE016  $  Y=X1*256+X2;
  $  030.USS8响铃时间                                         $    $  us     $    $  ANS002.BYTE018  $  Y=X1*256+X2;
  $  031.USS9响铃时间                                         $    $  us     $    $  ANS002.BYTE020  $  Y=X1*256+X2;
  $  032.USS10响铃时间                                        $    $  us     $    $  ANS002.BYTE022  $  Y=X1*256+X2;
  $  033.USS11响铃时间                                        $    $  us     $    $  ANS002.BYTE024  $  Y=X1*256+X2;
  $  034.USS12响铃时间                                        $    $  us     $    $  ANS002.BYTE026  $  Y=X1*256+X2;
  $  035.左侧平行驻车轨迹长度                                 $    $  cm     $    $  ANS003.BYTE004  $  Y=X1*256+X2;
  $  036.左侧平行驻车轨迹宽度                                 $    $  cm     $    $  ANS003.BYTE006  $  Y=X1*256+X2;
  $  037.左侧交叉驻车轨迹长度                                 $    $  cm     $    $  ANS004.BYTE004  $  Y=X1*256+X2;
  $  038.左侧交叉驻车轨迹宽度                                 $    $  cm     $    $  ANS004.BYTE006  $  Y=X1*256+X2;
  $  039.右侧平行驻车轨迹长度                                 $    $  cm     $    $  ANS005.BYTE004  $  Y=X1*256+X2;
  $  040.右侧平行驻车轨迹宽度                                 $    $  cm     $    $  ANS005.BYTE006  $  Y=X1*256+X2;
  $  041.右侧交叉驻车轨迹长度                                 $    $  cm     $    $  ANS006.BYTE004  $  Y=X1*256+X2;
  $  042.右侧交叉驻车轨迹宽度                                 $    $  cm     $    $  ANS006.BYTE006  $  Y=X1*256+X2;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:725 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
