
    车型ID：1a35

    模拟：协议模拟-->1a35

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 03 19 02 09 00 00 00 00       $#  ANS000:729 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/fe000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 04 14 FF FF FF 00 00 00       $$  ANS000:729 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 F1 93 00 00 00 00       $%  ANS000:729 03 22 F1 93 00 00 00 00
  $%  REQ001:721 03 22 F1 94 00 00 00 00       $%  ANS001:729 03 22 F1 94 00 00 00 00
  $%  REQ002:721 03 22 F1 95 00 00 00 00       $%  ANS002:729 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1/100,(x1/10)%10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d/%02d/%02d],x1,x2,x3);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%.2d.%.2d],(x1*256+x2)/10000,((x1*256+x2)%10000)/100,(x1*256+x2)%100);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d/%02d/%02d],x1,x2,x3);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000:左前门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@0004;else y=@0005;
  $  001:右前门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@0004;else y=@0005;
  $  002:左后门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@0004;else y=@0005;
  $  003:右后门灯开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@0004;else y=@0005;
  $  004:行李箱开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@0004;else y=@0005;
  $  005:左前门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x20)y=@0064;else y=@026f;
  $  006:左后门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x40)y=@0064;else y=@026f;
  $  007:右前门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x80)y=@0064;else y=@026f;
  $  008:右后门锁状态                      $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0064;else y=@026f;
  $  009:后背门锁状态                      $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0064;else y=@026f;
  $  010:发动机前舱盖状态                  $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0004;else y=@0005;
  $  011:安全带状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0358;else y=@0271;
  $  012:12V制动信号状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@00e6;else y=@0048;
  $  013:0V制动灯开关状态                  $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@00e6;else y=@0048;
  $  014:启动按钮1脚状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0272;else y=@0273;
  $  015:启动按钮4脚状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0272;else y=@0273;
  $  016:CAN线中控锁闭锁开关状态           $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0272;else y=@0048;
  $  017:CAN线中控锁解锁开关状态           $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0272;else y=@0048;
  $  018:硬线中控锁闭锁开关状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@0272;else y=@0048;
  $  019:硬线中控锁解锁开关状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@0272;else y=@0048;
  $  020:IG1电状态                         $    $       $    $  ANS000.BYTE006  $  if(x1&0x80)y=@0004;else y=@0005;
  $  021:自复位告警开关状态                $    $       $    $  ANS000.BYTE007  $  if(x1&0x40)y=@0272;else y=@0048;
  $  022:电动外后视镜翻转调节              $    $       $    $  ANS000.BYTE008  $  switxh(x1&0x0F)0:y=@027b;1:y=@035c;2:y=@035d;3:y=@035e;4:y=@035f;5:y=@0360;6:y=@0361;7:y=@0362;8:y=@0363;default: y=@001c;
  $  023:电动外后视镜左右选择              $    $       $    $  ANS000.BYTE008  $  switxh(x1&0x30)0x10:y=@0367;0x20:y=@0368;0x30:y=@001c;default: y=@0048;
  $  024:门锁保护状态                      $    $       $    $  ANS000.BYTE009  $  switxh(x1&0x18)0x00: y=@0022;0x08: y=@0364;0x10: y=@0365;0x18: y=@0366;default:y=@0076;
  $  025:碰撞信号状态(PWM(脉宽调制))       $    $       $    $  ANS000.BYTE009  $  if(x1<0x40) y=@0423;else if(x1<0x80) y=@0424;else if(x1<0xC0) y=@0425;else y=@001c;
  $  026:前大灯洗涤开关状态                $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@00e6;else y=@0048;
  $  027:交流充电枪状态                    $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@00e6;else y=@0048;

  $)  01.历史记录-报警记录
  $  01.历史记录-报警记录
  $  REQ000:721 03 22 01 09 00 00 00 00       $  ANS000:729 03 22 01 09 00 00 00 00

  $  000:报警记录1-记录有效性       $    $       $    $  ANS000.BYTE004  $  if(x1==0x11)y=@035a;else y=@035b;
  $  001:报警记录1-主驾车门         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0359;else y=@0048;
  $  002:报警记录1-副驾车门         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0359;else y=@0048;
  $  003:报警记录1-左后车门         $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0359;else y=@0048;
  $  004:报警记录1-右后车门         $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0359;else y=@0048;
  $  005:报警记录1-行李箱盖         $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0359;else y=@0048;
  $  006:报警记录1-IG1电            $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0359;else y=@0048;
  $  007:报警记录1-主驾门锁         $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0359;else y=@0048;
  $  008:报警记录1-左后门锁         $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0359;else y=@0048;
  $  009:报警记录1-副驾门锁         $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0359;else y=@0048;
  $  010:报警记录1-右后门锁         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0359;else y=@0048;
  $  011:报警记录1-前舱盖           $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@0359;else y=@0048;
  $  012:报警记录1-数据索引         $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013:报警记录2-记录有效性       $    $       $    $  ANS000.BYTE008  $  if(x1==0x11)y=@035a;else y=@035b;
  $  014:报警记录2-主驾车门         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0359;else y=@0048;
  $  015:报警记录2-副驾车门         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0359;else y=@0048;
  $  016:报警记录2-左后车门         $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0359;else y=@0048;
  $  017:报警记录2-右后车门         $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0359;else y=@0048;
  $  018:报警记录2-行李箱盖         $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0359;else y=@0048;
  $  019:报警记录2-IG1电            $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0359;else y=@0048;
  $  020:报警记录2-主驾门锁         $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0359;else y=@0048;
  $  021:报警记录2-左后门锁         $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0359;else y=@0048;
  $  022:报警记录2-副驾门锁         $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0359;else y=@0048;
  $  023:报警记录2-右后门锁         $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@0359;else y=@0048;
  $  024:报警记录2-前舱盖           $    $       $    $  ANS000.BYTE010  $  if(x1&0x20)y=@0359;else y=@0048;
  $  025:报警记录2-数据索引         $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026:报警记录3-记录有效性       $    $       $    $  ANS000.BYTE012  $  if(x1==0x11)y=@035a;else y=@035b;
  $  027:报警记录3-主驾车门         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0359;else y=@0048;
  $  028:报警记录3-副驾车门         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0359;else y=@0048;
  $  029:报警记录3-左后车门         $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0359;else y=@0048;
  $  030:报警记录3-右后车门         $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0359;else y=@0048;
  $  031:报警记录3-行李箱盖         $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0359;else y=@0048;
  $  032:报警记录3-IG1电            $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0359;else y=@0048;
  $  033:报警记录3-主驾门锁         $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0359;else y=@0048;
  $  034:报警记录3-左后门锁         $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0359;else y=@0048;
  $  035:报警记录3-副驾门锁         $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@0359;else y=@0048;
  $  036:报警记录3-右后门锁         $    $       $    $  ANS000.BYTE014  $  if(x1&0x08)y=@0359;else y=@0048;
  $  037:报警记录3-前舱盖           $    $       $    $  ANS000.BYTE014  $  if(x1&0x20)y=@0359;else y=@0048;
  $  038:报警记录3-数据索引         $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039:报警记录4-记录有效性       $    $       $    $  ANS000.BYTE016  $  if(x1==0x11)y=@035a;else y=@035b;
  $  040:报警记录4-主驾车门         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0359;else y=@0048;
  $  041:报警记录4-副驾车门         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0359;else y=@0048;
  $  042:报警记录4-左后车门         $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0359;else y=@0048;
  $  043:报警记录4-右后车门         $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0359;else y=@0048;
  $  044:报警记录4-行李箱盖         $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0359;else y=@0048;
  $  045:报警记录4-IG1电            $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0359;else y=@0048;
  $  046:报警记录4-主驾门锁         $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0359;else y=@0048;
  $  047:报警记录4-左后门锁         $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0359;else y=@0048;
  $  048:报警记录4-副驾门锁         $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@0359;else y=@0048;
  $  049:报警记录4-右后门锁         $    $       $    $  ANS000.BYTE018  $  if(x1&0x08)y=@0359;else y=@0048;
  $  050:报警记录4-前舱盖           $    $       $    $  ANS000.BYTE018  $  if(x1&0x20)y=@0359;else y=@0048;
  $  051:报警记录4-数据索引         $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052:报警记录5-记录有效性       $    $       $    $  ANS000.BYTE020  $  if(x1==0x11)y=@035a;else y=@035b;
  $  053:报警记录5-主驾车门         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0359;else y=@0048;
  $  054:报警记录5-副驾车门         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0359;else y=@0048;
  $  055:报警记录5-左后车门         $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0359;else y=@0048;
  $  056:报警记录5-右后车门         $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0359;else y=@0048;
  $  057:报警记录5-行李箱盖         $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0359;else y=@0048;
  $  058:报警记录5-IG1电            $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0359;else y=@0048;
  $  059:报警记录5-主驾门锁         $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0359;else y=@0048;
  $  060:报警记录5-左后门锁         $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0359;else y=@0048;
  $  061:报警记录5-副驾门锁         $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@0359;else y=@0048;
  $  062:报警记录5-右后门锁         $    $       $    $  ANS000.BYTE022  $  if(x1&0x08)y=@0359;else y=@0048;
  $  063:报警记录5-前舱盖           $    $       $    $  ANS000.BYTE022  $  if(x1&0x20)y=@0359;else y=@0048;
  $  064:报警记录5-数据索引         $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065:报警记录6-记录有效性       $    $       $    $  ANS000.BYTE024  $  if(x1==0x11)y=@035a;else y=@035b;
  $  066:报警记录6-主驾车门         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0359;else y=@0048;
  $  067:报警记录6-副驾车门         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0359;else y=@0048;
  $  068:报警记录6-左后车门         $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0359;else y=@0048;
  $  069:报警记录6-右后车门         $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0359;else y=@0048;
  $  070:报警记录6-行李箱盖         $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0359;else y=@0048;
  $  071:报警记录6-IG1电            $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0359;else y=@0048;
  $  072:报警记录6-主驾门锁         $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0359;else y=@0048;
  $  073:报警记录6-左后门锁         $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0359;else y=@0048;
  $  074:报警记录6-副驾门锁         $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@0359;else y=@0048;
  $  075:报警记录6-右后门锁         $    $       $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0359;else y=@0048;
  $  076:报警记录6-前舱盖           $    $       $    $  ANS000.BYTE026  $  if(x1&0x20)y=@0359;else y=@0048;
  $  077:报警记录6-数据索引         $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078:报警记录7-记录有效性       $    $       $    $  ANS000.BYTE028  $  if(x1==0x11)y=@035a;else y=@035b;
  $  079:报警记录7-主驾车门         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0359;else y=@0048;
  $  080:报警记录7-副驾车门         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0359;else y=@0048;
  $  081:报警记录7-左后车门         $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0359;else y=@0048;
  $  082:报警记录7-右后车门         $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0359;else y=@0048;
  $  083:报警记录7-行李箱盖         $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0359;else y=@0048;
  $  084:报警记录7-IG1电            $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0359;else y=@0048;
  $  085:报警记录7-主驾门锁         $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0359;else y=@0048;
  $  086:报警记录7-左后门锁         $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0359;else y=@0048;
  $  087:报警记录7-副驾门锁         $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@0359;else y=@0048;
  $  088:报警记录7-右后门锁         $    $       $    $  ANS000.BYTE030  $  if(x1&0x08)y=@0359;else y=@0048;
  $  089:报警记录7-前舱盖           $    $       $    $  ANS000.BYTE030  $  if(x1&0x20)y=@0359;else y=@0048;
  $  090:报警记录7-数据索引         $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091:报警记录8-记录有效性       $    $       $    $  ANS000.BYTE032  $  if(x1==0x11)y=@035a;else y=@035b;
  $  092:报警记录8-主驾车门         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0359;else y=@0048;
  $  093:报警记录8-副驾车门         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0359;else y=@0048;
  $  094:报警记录8-左后车门         $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0359;else y=@0048;
  $  095:报警记录8-右后车门         $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0359;else y=@0048;
  $  096:报警记录8-行李箱盖         $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0359;else y=@0048;
  $  097:报警记录8-IG1电            $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0359;else y=@0048;
  $  098:报警记录8-主驾门锁         $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0359;else y=@0048;
  $  099:报警记录8-左后门锁         $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0359;else y=@0048;
  $  100:报警记录8-副驾门锁         $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@0359;else y=@0048;
  $  101:报警记录8-右后门锁         $    $       $    $  ANS000.BYTE034  $  if(x1&0x08)y=@0359;else y=@0048;
  $  102:报警记录8-前舱盖           $    $       $    $  ANS000.BYTE034  $  if(x1&0x20)y=@0359;else y=@0048;
  $  103:报警记录8-数据索引         $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.历史记录-闭锁记录
  $  02.历史记录-闭锁记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00

  $  000:闭锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  if(x1==0x12)y=@035a;else y=@035b;
  $  001:闭锁记录1-副驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0359;else y=@0048;
  $  002:闭锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0359;else y=@0048;
  $  003:闭锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0359;else y=@0048;
  $  004:闭锁记录1-超速                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0359;else y=@0048;
  $  005:闭锁记录1-自动返回防盗         $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0359;else y=@0048;
  $  006:闭锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0359;else y=@0048;
  $  007:闭锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0359;else y=@0048;
  $  008:闭锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0359;else y=@0048;
  $  009:闭锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0359;else y=@0048;
  $  010:闭锁记录1-自动设定防盗         $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0359;else y=@0048;
  $  011:闭锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  012:闭锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  if(x1==0x12)y=@035a;else y=@035b;
  $  013:闭锁记录2-副驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0359;else y=@0048;
  $  014:闭锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0359;else y=@0048;
  $  015:闭锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0359;else y=@0048;
  $  016:闭锁记录2-超速                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0359;else y=@0048;
  $  017:闭锁记录2-自动返回防盗         $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0359;else y=@0048;
  $  018:闭锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0359;else y=@0048;
  $  019:闭锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@0359;else y=@0048;
  $  020:闭锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0359;else y=@0048;
  $  021:闭锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0359;else y=@0048;
  $  022:闭锁记录2-自动设定防盗         $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0359;else y=@0048;
  $  023:闭锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  024:闭锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  if(x1==0x12)y=@035a;else y=@035b;
  $  025:闭锁记录3-副驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0359;else y=@0048;
  $  026:闭锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0359;else y=@0048;
  $  027:闭锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0359;else y=@0048;
  $  028:闭锁记录3-超速                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0359;else y=@0048;
  $  029:闭锁记录3-自动返回防盗         $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0359;else y=@0048;
  $  030:闭锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0359;else y=@0048;
  $  031:闭锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@0359;else y=@0048;
  $  032:闭锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0359;else y=@0048;
  $  033:闭锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0359;else y=@0048;
  $  034:闭锁记录3-自动设定防盗         $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0359;else y=@0048;
  $  035:闭锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  036:闭锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  if(x1==0x12)y=@035a;else y=@035b;
  $  037:闭锁记录4-副驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0359;else y=@0048;
  $  038:闭锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0359;else y=@0048;
  $  039:闭锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0359;else y=@0048;
  $  040:闭锁记录4-超速                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0359;else y=@0048;
  $  041:闭锁记录4-自动返回防盗         $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0359;else y=@0048;
  $  042:闭锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0359;else y=@0048;
  $  043:闭锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@0359;else y=@0048;
  $  044:闭锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0359;else y=@0048;
  $  045:闭锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0359;else y=@0048;
  $  046:闭锁记录4-自动设定防盗         $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0359;else y=@0048;
  $  047:闭锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  048:闭锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  if(x1==0x12)y=@035a;else y=@035b;
  $  049:闭锁记录5-副驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0359;else y=@0048;
  $  050:闭锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0359;else y=@0048;
  $  051:闭锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0359;else y=@0048;
  $  052:闭锁记录5-超速                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0359;else y=@0048;
  $  053:闭锁记录5-自动返回防盗         $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0359;else y=@0048;
  $  054:闭锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0359;else y=@0048;
  $  055:闭锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@0359;else y=@0048;
  $  056:闭锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0359;else y=@0048;
  $  057:闭锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0359;else y=@0048;
  $  058:闭锁记录5-自动设定防盗         $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0359;else y=@0048;
  $  059:闭锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  060:闭锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  if(x1==0x12)y=@035a;else y=@035b;
  $  061:闭锁记录6-副驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0359;else y=@0048;
  $  062:闭锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0359;else y=@0048;
  $  063:闭锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0359;else y=@0048;
  $  064:闭锁记录6-超速                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0359;else y=@0048;
  $  065:闭锁记录6-自动返回防盗         $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0359;else y=@0048;
  $  066:闭锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0359;else y=@0048;
  $  067:闭锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0359;else y=@0048;
  $  068:闭锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0359;else y=@0048;
  $  069:闭锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0359;else y=@0048;
  $  070:闭锁记录6-自动设定防盗         $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0359;else y=@0048;
  $  071:闭锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  072:闭锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  if(x1==0x12)y=@035a;else y=@035b;
  $  073:闭锁记录7-副驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0359;else y=@0048;
  $  074:闭锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0359;else y=@0048;
  $  075:闭锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0359;else y=@0048;
  $  076:闭锁记录7-超速                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0359;else y=@0048;
  $  077:闭锁记录7-自动返回防盗         $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0359;else y=@0048;
  $  078:闭锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0359;else y=@0048;
  $  079:闭锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@0359;else y=@0048;
  $  080:闭锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0359;else y=@0048;
  $  081:闭锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0359;else y=@0048;
  $  082:闭锁记录7-自动设定防盗         $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0359;else y=@0048;
  $  083:闭锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  084:闭锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  if(x1==0x12)y=@035a;else y=@035b;
  $  085:闭锁记录8-副驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0359;else y=@0048;
  $  086:闭锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0359;else y=@0048;
  $  087:闭锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0359;else y=@0048;
  $  088:闭锁记录8-超速                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0359;else y=@0048;
  $  089:闭锁记录8-自动返回防盗         $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0359;else y=@0048;
  $  090:闭锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0359;else y=@0048;
  $  091:闭锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@0359;else y=@0048;
  $  092:闭锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0359;else y=@0048;
  $  093:闭锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0359;else y=@0048;
  $  094:闭锁记录8-自动设定防盗         $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0359;else y=@0048;
  $  095:闭锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.历史记录-解锁记录
  $  03.历史记录-解锁记录
  $  REQ000:721 03 22 01 0B 00 00 00 00       $  ANS000:729 03 22 01 0B 00 00 00 00

  $  000:解锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  if(x1==0x13)y=@035a;else y=@035b;
  $  001:解锁记录1-副驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0359;else y=@0048;
  $  002:解锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0359;else y=@0048;
  $  003:解锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0359;else y=@0048;
  $  004:解锁记录1-退电                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0359;else y=@0048;
  $  005:解锁记录1-碰撞信号             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0359;else y=@0048;
  $  006:解锁记录1-钥匙在车内           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0359;else y=@0048;
  $  007:解锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0359;else y=@0048;
  $  008:解锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0359;else y=@0048;
  $  009:解锁记录1-锁定防止             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0359;else y=@0048;
  $  010:解锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0359;else y=@0048;
  $  011:解锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0359;else y=@0048;
  $  012:解锁记录1-硬线碰撞信号         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0359;else y=@0048;
  $  013:解锁记录1-CAN线碰撞信号        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@0359;else y=@0048;
  $  014:解锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  015:解锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  if(x1==0x13)y=@035a;else y=@035b;
  $  016:解锁记录2-副驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0359;else y=@0048;
  $  017:解锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0359;else y=@0048;
  $  018:解锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0359;else y=@0048;
  $  019:解锁记录2-退电                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0359;else y=@0048;
  $  020:解锁记录2-碰撞信号             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0359;else y=@0048;
  $  021:解锁记录2-钥匙在车内           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0359;else y=@0048;
  $  022:解锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@0359;else y=@0048;
  $  023:解锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0359;else y=@0048;
  $  024:解锁记录2-锁定防止             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0359;else y=@0048;
  $  025:解锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0359;else y=@0048;
  $  026:解锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0359;else y=@0048;
  $  027:解锁记录2-硬线碰撞信号         $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@0359;else y=@0048;
  $  028:解锁记录2-CAN线碰撞信号        $    $       $    $  ANS000.BYTE010  $  if(x1&0x10)y=@0359;else y=@0048;
  $  029:解锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  030:解锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  if(x1==0x13)y=@035a;else y=@035b;
  $  031:解锁记录3-副驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0359;else y=@0048;
  $  032:解锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0359;else y=@0048;
  $  033:解锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0359;else y=@0048;
  $  034:解锁记录3-退电                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0359;else y=@0048;
  $  035:解锁记录3-碰撞信号             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0359;else y=@0048;
  $  036:解锁记录3-钥匙在车内           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0359;else y=@0048;
  $  037:解锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@0359;else y=@0048;
  $  038:解锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0359;else y=@0048;
  $  039:解锁记录3-锁定防止             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0359;else y=@0048;
  $  040:解锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0359;else y=@0048;
  $  041:解锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@0359;else y=@0048;
  $  042:解锁记录3-硬线碰撞信号         $    $       $    $  ANS000.BYTE014  $  if(x1&0x08)y=@0359;else y=@0048;
  $  043:解锁记录3-CAN线碰撞信号        $    $       $    $  ANS000.BYTE014  $  if(x1&0x10)y=@0359;else y=@0048;
  $  044:解锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  045:解锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  if(x1==0x13)y=@035a;else y=@035b;
  $  046:解锁记录4-副驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0359;else y=@0048;
  $  047:解锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0359;else y=@0048;
  $  048:解锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0359;else y=@0048;
  $  049:解锁记录4-退电                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0359;else y=@0048;
  $  050:解锁记录4-碰撞信号             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0359;else y=@0048;
  $  051:解锁记录4-钥匙在车内           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0359;else y=@0048;
  $  052:解锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@0359;else y=@0048;
  $  053:解锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0359;else y=@0048;
  $  054:解锁记录4-锁定防止             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0359;else y=@0048;
  $  055:解锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0359;else y=@0048;
  $  056:解锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@0359;else y=@0048;
  $  057:解锁记录4-硬线碰撞信号         $    $       $    $  ANS000.BYTE018  $  if(x1&0x08)y=@0359;else y=@0048;
  $  058:解锁记录4-CAN线碰撞信号        $    $       $    $  ANS000.BYTE018  $  if(x1&0x10)y=@0359;else y=@0048;
  $  059:解锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  060:解锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  if(x1==0x13)y=@035a;else y=@035b;
  $  061:解锁记录5-副驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0359;else y=@0048;
  $  062:解锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0359;else y=@0048;
  $  063:解锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0359;else y=@0048;
  $  064:解锁记录5-退电                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0359;else y=@0048;
  $  065:解锁记录5-碰撞信号             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0359;else y=@0048;
  $  066:解锁记录5-钥匙在车内           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0359;else y=@0048;
  $  067:解锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@0359;else y=@0048;
  $  068:解锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0359;else y=@0048;
  $  069:解锁记录5-锁定防止             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0359;else y=@0048;
  $  070:解锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0359;else y=@0048;
  $  071:解锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@0359;else y=@0048;
  $  072:解锁记录5-硬线碰撞信号         $    $       $    $  ANS000.BYTE022  $  if(x1&0x08)y=@0359;else y=@0048;
  $  073:解锁记录5-CAN线碰撞信号        $    $       $    $  ANS000.BYTE022  $  if(x1&0x10)y=@0359;else y=@0048;
  $  074:解锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  075:解锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  if(x1==0x13)y=@035a;else y=@035b;
  $  076:解锁记录6-副驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0359;else y=@0048;
  $  077:解锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0359;else y=@0048;
  $  078:解锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0359;else y=@0048;
  $  079:解锁记录6-退电                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0359;else y=@0048;
  $  080:解锁记录6-碰撞信号             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0359;else y=@0048;
  $  081:解锁记录6-钥匙在车内           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0359;else y=@0048;
  $  082:解锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0359;else y=@0048;
  $  083:解锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0359;else y=@0048;
  $  084:解锁记录6-锁定防止             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0359;else y=@0048;
  $  085:解锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0359;else y=@0048;
  $  086:解锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@0359;else y=@0048;
  $  087:解锁记录6-硬线碰撞信号         $    $       $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0359;else y=@0048;
  $  088:解锁记录6-CAN线碰撞信号        $    $       $    $  ANS000.BYTE026  $  if(x1&0x10)y=@0359;else y=@0048;
  $  089:解锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  090:解锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  if(x1==0x13)y=@035a;else y=@035b;
  $  091:解锁记录7-副驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0359;else y=@0048;
  $  092:解锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0359;else y=@0048;
  $  093:解锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0359;else y=@0048;
  $  094:解锁记录7-退电                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0359;else y=@0048;
  $  095:解锁记录7-碰撞信号             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0359;else y=@0048;
  $  096:解锁记录7-钥匙在车内           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0359;else y=@0048;
  $  097:解锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@0359;else y=@0048;
  $  098:解锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0359;else y=@0048;
  $  099:解锁记录7-锁定防止             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0359;else y=@0048;
  $  100:解锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0359;else y=@0048;
  $  101:解锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@0359;else y=@0048;
  $  102:解锁记录7-硬线碰撞信号         $    $       $    $  ANS000.BYTE030  $  if(x1&0x08)y=@0359;else y=@0048;
  $  103:解锁记录7-CAN线碰撞信号        $    $       $    $  ANS000.BYTE030  $  if(x1&0x10)y=@0359;else y=@0048;
  $  104:解锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  105:解锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  if(x1==0x13)y=@035a;else y=@035b;
  $  106:解锁记录8-副驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0359;else y=@0048;
  $  107:解锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0359;else y=@0048;
  $  108:解锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0359;else y=@0048;
  $  109:解锁记录8-退电                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0359;else y=@0048;
  $  110:解锁记录8-碰撞信号             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0359;else y=@0048;
  $  111:解锁记录8-钥匙在车内           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0359;else y=@0048;
  $  112:解锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@0359;else y=@0048;
  $  113:解锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0359;else y=@0048;
  $  114:解锁记录8-锁定防止             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0359;else y=@0048;
  $  115:解锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0359;else y=@0048;
  $  116:解锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@0359;else y=@0048;
  $  117:解锁记录8-硬线碰撞信号         $    $       $    $  ANS000.BYTE034  $  if(x1&0x08)y=@0359;else y=@0048;
  $  118:解锁记录8-CAN线碰撞信号        $    $       $    $  ANS000.BYTE034  $  if(x1&0x10)y=@0359;else y=@0048;
  $  119:解锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.历史记录-行李箱解锁记录
  $  04.历史记录-行李箱解锁记录
  $  REQ000:721 03 22 01 0C 00 00 00 00       $  ANS000:729 03 22 01 0C 00 00 00 00

  $  000:行李箱解锁记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  if(x1==0x14)y=@035a;else y=@035b;
  $  001:行李箱解锁记录1-遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0359;else y=@0048;
  $  002:行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0359;else y=@0048;
  $  003:行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0359;else y=@0048;
  $  004:行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0359;else y=@0048;
  $  005:行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0359;else y=@0048;
  $  006:行李箱解锁记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007:行李箱解锁记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  if(x1==0x14)y=@035a;else y=@035b;
  $  008:行李箱解锁记录2-遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0359;else y=@0048;
  $  009:行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0359;else y=@0048;
  $  010:行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0359;else y=@0048;
  $  011:行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0359;else y=@0048;
  $  012:行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0359;else y=@0048;
  $  013:行李箱解锁记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014:行李箱解锁记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  if(x1==0x14)y=@035a;else y=@035b;
  $  015:行李箱解锁记录3-遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0359;else y=@0048;
  $  016:行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0359;else y=@0048;
  $  017:行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0359;else y=@0048;
  $  018:行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0359;else y=@0048;
  $  019:行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0359;else y=@0048;
  $  020:行李箱解锁记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021:行李箱解锁记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  if(x1==0x14)y=@035a;else y=@035b;
  $  022:行李箱解锁记录4-遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0359;else y=@0048;
  $  023:行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0359;else y=@0048;
  $  024:行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0359;else y=@0048;
  $  025:行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0359;else y=@0048;
  $  026:行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0359;else y=@0048;
  $  027:行李箱解锁记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028:行李箱解锁记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  if(x1==0x14)y=@035a;else y=@035b;
  $  029:行李箱解锁记录5-遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0359;else y=@0048;
  $  030:行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0359;else y=@0048;
  $  031:行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0359;else y=@0048;
  $  032:行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0359;else y=@0048;
  $  033:行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0359;else y=@0048;
  $  034:行李箱解锁记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035:行李箱解锁记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  if(x1==0x14)y=@035a;else y=@035b;
  $  036:行李箱解锁记录6-遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0359;else y=@0048;
  $  037:行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0359;else y=@0048;
  $  038:行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0359;else y=@0048;
  $  039:行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0359;else y=@0048;
  $  040:行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0359;else y=@0048;
  $  041:行李箱解锁记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042:行李箱解锁记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  if(x1==0x14)y=@035a;else y=@035b;
  $  043:行李箱解锁记录7-遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0359;else y=@0048;
  $  044:行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0359;else y=@0048;
  $  045:行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0359;else y=@0048;
  $  046:行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0359;else y=@0048;
  $  047:行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0359;else y=@0048;
  $  048:行李箱解锁记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049:行李箱解锁记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  if(x1==0x14)y=@035a;else y=@035b;
  $  050:行李箱解锁记录8-遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0359;else y=@0048;
  $  051:行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0359;else y=@0048;
  $  052:行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0359;else y=@0048;
  $  053:行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0359;else y=@0048;
  $  054:行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0359;else y=@0048;
  $  055:行李箱解锁记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.历史记录-启动失败记录
  $  05.历史记录-启动失败记录
  $  REQ000:721 03 22 01 0D 00 00 00 00       $  ANS000:729 03 22 01 0D 00 00 00 00

  $  000:启动失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  if(x1==0x15)y=@035a;else y=@035b;
  $  001:启动失败记录1-启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  002:启动失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003:启动失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  if(x1==0x15)y=@035a;else y=@035b;
  $  004:启动失败记录2-启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  005:启动失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006:启动失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  if(x1==0x15)y=@035a;else y=@035b;
  $  007:启动失败记录3-启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  008:启动失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009:启动失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  if(x1==0x15)y=@035a;else y=@035b;
  $  010:启动失败记录4-启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  011:启动失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012:启动失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  if(x1==0x15)y=@035a;else y=@035b;
  $  013:启动失败记录5-启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  014:启动失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015:启动失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  if(x1==0x15)y=@035a;else y=@035b;
  $  016:启动失败记录6-启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  017:启动失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018:启动失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  if(x1==0x15)y=@035a;else y=@035b;
  $  019:启动失败记录7-启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  020:启动失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021:启动失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  if(x1==0x15)y=@035a;else y=@035b;
  $  022:启动失败记录8-启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@034c;else if(x1==0x02) y=@028c;else if(x1==0x03) y=@0286;else if(x1==0x04) y=@028d;else if(x1==0x05) y=@028e;else if(x1==0x06) y=@0369;else if(x1==0x07) y=@036a;else if(x1==0x08) y=@0290;else if(x1==0x09) y=@0291;else if(x1==0x0A) y=@0292;else if(x1==0x0B) y=@034e;else y=@001c;
  $  023:启动失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.历史记录-退电失败记录
  $  06.历史记录-退电失败记录
  $  REQ000:721 03 22 01 0E 00 00 00 00       $  ANS000:729 03 22 01 0E 00 00 00 00

  $  000:退电失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  if(x1==0x16)y=@035a;else y=@035b;
  $  001:退电失败记录1-退电失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  002:退电失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003:退电失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  if(x1==0x16)y=@035a;else y=@035b;
  $  004:退电失败记录2-退电失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  005:退电失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006:退电失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  if(x1==0x16)y=@035a;else y=@035b;
  $  007:退电失败记录3-退电失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  008:退电失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009:退电失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  if(x1==0x16)y=@035a;else y=@035b;
  $  010:退电失败记录4-退电失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  011:退电失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012:退电失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  if(x1==0x16)y=@035a;else y=@035b;
  $  013:退电失败记录5-退电失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  014:退电失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015:退电失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  if(x1==0x16)y=@035a;else y=@035b;
  $  016:退电失败记录6-退电失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  017:退电失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018:退电失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  if(x1==0x16)y=@035a;else y=@035b;
  $  019:退电失败记录7-退电失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  020:退电失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021:退电失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  if(x1==0x16)y=@035a;else y=@035b;
  $  022:退电失败记录8-退电失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00) y=@0048;else if(x1==0x01) y=@0285;else if(x1==0x02) y=@0286;else if(x1==0x03) y=@0369;else if(x1==0x04) y=@036b;else if(x1==0x05) y=@036c;else if(x1==0x06) y=@036d;else y=@001c;
  $  023:退电失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:721 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
