
    车型ID：2429

    模拟：协议模拟-->2429

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 03 19 02 09 00 00 00 00       $#  ANS000:729 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f7000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 04 14 FF FF FF 00 00 00       $$  ANS000:729 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 F1 93 00 00 00 00       $%  ANS000:729 03 22 F1 93 00 00 00 00
  $%  REQ001:721 03 22 F1 94 00 00 00 00       $%  ANS001:729 03 22 F1 94 00 00 00 00
  $%  REQ002:721 03 22 F1 95 00 00 00 00       $%  ANS002:729 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1/100,(x1/10)%10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@001d,x2,@001e,x3,@001f);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%.2d.%.2d],(x1*256+x2)/10000,((x1*256+x2)%10000)/100,(x1*256+x2)%100);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@001d,x2,@001e,x3,@001f);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000:左前门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@0004;else y=@0005;
  $  001:右前门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@0004;else y=@0005;
  $  002:左后门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@0004;else y=@0005;
  $  003:右后门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@0004;else y=@0005;
  $  004:后背门解锁开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@0004;else y=@0005;
  $  005:左前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x20) y=@0064;else y=@026f;
  $  006:左后门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x40) y=@0064;else y=@026f;
  $  007:右前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x80) y=@0064;else y=@026f;
  $  008:右后门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0064;else y=@026f;
  $  009:后背门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0064;else y=@026f;
  $  010:发动机前舱盖状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0004;else y=@0005;
  $  011:安全带未系信号检测状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0358;else y=@0271;
  $  012:12V制动信号状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@00e6;else y=@0048;
  $  013:0V制动灯开关状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@00e6;else y=@0048;
  $  014:启动按钮1脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@0272;else y=@0273;
  $  015:启动按钮4脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@0272;else y=@0273;
  $  016:CAN线中控锁闭锁开关状态             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@0272;else y=@0048;
  $  017:CAN线中控锁解锁开关状态             $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@0272;else y=@0048;
  $  018:硬线中控锁闭锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@0272;else y=@0048;
  $  019:硬线中控锁解锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@0272;else y=@0048;
  $  020:IG1电状态                           $    $       $    $  ANS000.BYTE006  $  if(x1&0x80) y=@00d3;else y=@00d4;
  $  021:ACC电状态                           $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@00d3;else y=@00d4;
  $  022:机械钥匙闭锁开关状态(预留)          $    $       $    $  ANS000.BYTE007  $  if(x1&0x08) y=@026f;else y=@0048;
  $  023:机械钥匙解锁开关状态(预留)          $    $       $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0064;else y=@0048;
  $  024:行李箱安全系统开启状态(预留)        $    $       $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0004;else y=@0005;
  $  025:开关状态(SwitchState)               $    $       $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0004;else y=@0005;
  $  026:近光灯硬件开关状态                  $    $       $    $  ANS000.BYTE008  $  if(x1&0x20) y=@00e6;else y=@0048;
  $  027:门锁保护状态                        $    $       $    $  ANS000.BYTE009  $  switxh(x1&0x06)0x00: y=@0022;0x02: y=@0364;0x04: y=@0365;0x06: y=@0366;default: y=@001c;
  $  028:前碰撞信号状态(PWM(脉宽调制))       $    $       $    $  ANS000.BYTE009  $  switxh(x1&0x30)0x00: y=@0423;0x10: y=@0424;0x20: y=@0425;default: y=@001c;

  $)  01.历史记录
  $  01.历史记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00
  $  REQ001:721 03 22 01 0B 00 00 00 00       $  ANS001:729 03 22 01 0B 00 00 00 00
  $  REQ002:721 03 22 01 0C 00 00 00 00       $  ANS002:729 03 22 01 0C 00 00 00 00
  $  REQ003:721 03 22 01 0D 00 00 00 00       $  ANS003:729 03 22 01 0D 00 00 00 00
  $  REQ004:721 03 22 01 0E 00 00 00 00       $  ANS004:729 03 22 01 0E 00 00 00 00

  $  000:闭锁记录1-记录有效性                       $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  001:闭锁记录1-副驶中控开关                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0359;else y=@0048;
  $  002:闭锁记录1-主驾中控开关                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0359;else y=@0048;
  $  003:闭锁记录1-遥控                             $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0359;else y=@0048;
  $  004:闭锁记录1-超速                             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0359;else y=@0048;
  $  005:闭锁记录1-自动返回防盗                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0359;else y=@0048;
  $  006:闭锁记录1-左前门微动开关                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0359;else y=@0048;
  $  007:闭锁记录1-右前门微动开关                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@0359;else y=@0048;
  $  008:闭锁记录1-后背门微动开关                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@0359;else y=@0048;
  $  009:闭锁记录1-远程控制                         $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0359;else y=@0048;
  $  010:闭锁记录1-自动设定防盗                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@0359;else y=@0048;
  $  011:闭锁记录1-数据索引                         $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  012:闭锁记录2-记录有效性                       $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  013:闭锁记录2-副驶中控开关                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0359;else y=@0048;
  $  014:闭锁记录2-主驾中控开关                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0359;else y=@0048;
  $  015:闭锁记录2-遥控                             $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0359;else y=@0048;
  $  016:闭锁记录2-超速                             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0359;else y=@0048;
  $  017:闭锁记录2-自动返回防盗                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@0359;else y=@0048;
  $  018:闭锁记录2-左前门微动开关                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@0359;else y=@0048;
  $  019:闭锁记录2-右前门微动开关                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@0359;else y=@0048;
  $  020:闭锁记录2-后背门微动开关                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@0359;else y=@0048;
  $  021:闭锁记录2-远程控制                         $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@0359;else y=@0048;
  $  022:闭锁记录2-自动设定防盗                     $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@0359;else y=@0048;
  $  023:闭锁记录2-数据索引                         $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  024:闭锁记录3-记录有效性                       $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  025:闭锁记录3-副驶中控开关                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@0359;else y=@0048;
  $  026:闭锁记录3-主驾中控开关                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@0359;else y=@0048;
  $  027:闭锁记录3-遥控                             $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@0359;else y=@0048;
  $  028:闭锁记录3-超速                             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@0359;else y=@0048;
  $  029:闭锁记录3-自动返回防盗                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@0359;else y=@0048;
  $  030:闭锁记录3-左前门微动开关                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@0359;else y=@0048;
  $  031:闭锁记录3-右前门微动开关                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@0359;else y=@0048;
  $  032:闭锁记录3-后背门微动开关                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@0359;else y=@0048;
  $  033:闭锁记录3-远程控制                         $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@0359;else y=@0048;
  $  034:闭锁记录3-自动设定防盗                     $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@0359;else y=@0048;
  $  035:闭锁记录3-数据索引                         $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  036:闭锁记录4-记录有效性                       $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  037:闭锁记录4-副驶中控开关                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@0359;else y=@0048;
  $  038:闭锁记录4-主驾中控开关                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0359;else y=@0048;
  $  039:闭锁记录4-遥控                             $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@0359;else y=@0048;
  $  040:闭锁记录4-超速                             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@0359;else y=@0048;
  $  041:闭锁记录4-自动返回防盗                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@0359;else y=@0048;
  $  042:闭锁记录4-左前门微动开关                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@0359;else y=@0048;
  $  043:闭锁记录4-右前门微动开关                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@0359;else y=@0048;
  $  044:闭锁记录4-后背门微动开关                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@0359;else y=@0048;
  $  045:闭锁记录4-远程控制                         $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@0359;else y=@0048;
  $  046:闭锁记录4-自动设定防盗                     $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@0359;else y=@0048;
  $  047:闭锁记录4-数据索引                         $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  048:闭锁记录5-记录有效性                       $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  049:闭锁记录5-副驶中控开关                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0359;else y=@0048;
  $  050:闭锁记录5-主驾中控开关                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0359;else y=@0048;
  $  051:闭锁记录5-遥控                             $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@0359;else y=@0048;
  $  052:闭锁记录5-超速                             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@0359;else y=@0048;
  $  053:闭锁记录5-自动返回防盗                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@0359;else y=@0048;
  $  054:闭锁记录5-左前门微动开关                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@0359;else y=@0048;
  $  055:闭锁记录5-右前门微动开关                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@0359;else y=@0048;
  $  056:闭锁记录5-后背门微动开关                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@0359;else y=@0048;
  $  057:闭锁记录5-远程控制                         $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@0359;else y=@0048;
  $  058:闭锁记录5-自动设定防盗                     $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@0359;else y=@0048;
  $  059:闭锁记录5-数据索引                         $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  060:闭锁记录6-记录有效性                       $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  061:闭锁记录6-副驶中控开关                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0359;else y=@0048;
  $  062:闭锁记录6-主驾中控开关                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0359;else y=@0048;
  $  063:闭锁记录6-遥控                             $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0359;else y=@0048;
  $  064:闭锁记录6-超速                             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0359;else y=@0048;
  $  065:闭锁记录6-自动返回防盗                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0359;else y=@0048;
  $  066:闭锁记录6-左前门微动开关                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0359;else y=@0048;
  $  067:闭锁记录6-右前门微动开关                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@0359;else y=@0048;
  $  068:闭锁记录6-后背门微动开关                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@0359;else y=@0048;
  $  069:闭锁记录6-远程控制                         $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@0359;else y=@0048;
  $  070:闭锁记录6-自动设定防盗                     $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@0359;else y=@0048;
  $  071:闭锁记录6-数据索引                         $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  072:闭锁记录7-记录有效性                       $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  073:闭锁记录7-副驶中控开关                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0359;else y=@0048;
  $  074:闭锁记录7-主驾中控开关                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0359;else y=@0048;
  $  075:闭锁记录7-遥控                             $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@0359;else y=@0048;
  $  076:闭锁记录7-超速                             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@0359;else y=@0048;
  $  077:闭锁记录7-自动返回防盗                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0359;else y=@0048;
  $  078:闭锁记录7-左前门微动开关                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0359;else y=@0048;
  $  079:闭锁记录7-右前门微动开关                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@0359;else y=@0048;
  $  080:闭锁记录7-后背门微动开关                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@0359;else y=@0048;
  $  081:闭锁记录7-远程控制                         $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@0359;else y=@0048;
  $  082:闭锁记录7-自动设定防盗                     $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@0359;else y=@0048;
  $  083:闭锁记录7-数据索引                         $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  084:闭锁记录8-记录有效性                       $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x12: y=@035a;default: y=@035b;
  $  085:闭锁记录8-副驶中控开关                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0359;else y=@0048;
  $  086:闭锁记录8-主驾中控开关                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0359;else y=@0048;
  $  087:闭锁记录8-遥控                             $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@0359;else y=@0048;
  $  088:闭锁记录8-超速                             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0359;else y=@0048;
  $  089:闭锁记录8-自动返回防盗                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@0359;else y=@0048;
  $  090:闭锁记录8-左前门微动开关                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@0359;else y=@0048;
  $  091:闭锁记录8-右前门微动开关                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@0359;else y=@0048;
  $  092:闭锁记录8-后背门微动开关                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@0359;else y=@0048;
  $  093:闭锁记录8-远程控制                         $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@0359;else y=@0048;
  $  094:闭锁记录8-自动设定防盗                     $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@0359;else y=@0048;
  $  095:闭锁记录8-数据索引                         $    $       $    $  ANS000.BYTE035  $  y=x1;
  $  096:解锁记录1-记录有效性                       $    $       $    $  ANS001.BYTE004  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  097:解锁记录1-副驶中控开关                     $    $       $    $  ANS001.BYTE005  $  if(x1&0x01) y=@0359;else y=@0048;
  $  098:解锁记录1-主驾中控开关                     $    $       $    $  ANS001.BYTE005  $  if(x1&0x02) y=@0359;else y=@0048;
  $  099:解锁记录1-遥控                             $    $       $    $  ANS001.BYTE005  $  if(x1&0x04) y=@0359;else y=@0048;
  $  100:解锁记录1-退电                             $    $       $    $  ANS001.BYTE005  $  if(x1&0x08) y=@0359;else y=@0048;
  $  101:解锁记录1-碰撞信号                         $    $       $    $  ANS001.BYTE005  $  if(x1&0x10) y=@0359;else y=@0048;
  $  102:解锁记录1-钥匙在车内                       $    $       $    $  ANS001.BYTE005  $  if(x1&0x20) y=@0359;else y=@0048;
  $  103:解锁记录1-左前门微动开关                   $    $       $    $  ANS001.BYTE005  $  if(x1&0x40) y=@0359;else y=@0048;
  $  104:解锁记录1-右前门微动开关                   $    $       $    $  ANS001.BYTE005  $  if(x1&0x80) y=@0359;else y=@0048;
  $  105:解锁记录1-锁定防止                         $    $       $    $  ANS001.BYTE006  $  if(x1&0x01) y=@0359;else y=@0048;
  $  106:解锁记录1-后背门微动开关                   $    $       $    $  ANS001.BYTE006  $  if(x1&0x02) y=@0359;else y=@0048;
  $  107:解锁记录1-远程控制                         $    $       $    $  ANS001.BYTE006  $  if(x1&0x04) y=@0359;else y=@0048;
  $  108:解锁记录1-硬线碰撞信号                     $    $       $    $  ANS001.BYTE006  $  if(x1&0x08) y=@0359;else y=@0048;
  $  109:解锁记录1-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE006  $  if(x1&0x10) y=@0359;else y=@0048;
  $  110:解锁记录1-数据索引                         $    $       $    $  ANS001.BYTE007  $  y=x1;
  $  111:解锁记录2-记录有效性                       $    $       $    $  ANS001.BYTE008  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  112:解锁记录2-副驶中控开关                     $    $       $    $  ANS001.BYTE009  $  if(x1&0x01) y=@0359;else y=@0048;
  $  113:解锁记录2-主驾中控开关                     $    $       $    $  ANS001.BYTE009  $  if(x1&0x02) y=@0359;else y=@0048;
  $  114:解锁记录2-遥控                             $    $       $    $  ANS001.BYTE009  $  if(x1&0x04) y=@0359;else y=@0048;
  $  115:解锁记录2-退电                             $    $       $    $  ANS001.BYTE009  $  if(x1&0x08) y=@0359;else y=@0048;
  $  116:解锁记录2-碰撞信号                         $    $       $    $  ANS001.BYTE009  $  if(x1&0x10) y=@0359;else y=@0048;
  $  117:解锁记录2-钥匙在车内                       $    $       $    $  ANS001.BYTE009  $  if(x1&0x20) y=@0359;else y=@0048;
  $  118:解锁记录2-左前门微动开关                   $    $       $    $  ANS001.BYTE009  $  if(x1&0x40) y=@0359;else y=@0048;
  $  119:解锁记录2-右前门微动开关                   $    $       $    $  ANS001.BYTE009  $  if(x1&0x80) y=@0359;else y=@0048;
  $  120:解锁记录2-锁定防止                         $    $       $    $  ANS001.BYTE010  $  if(x1&0x01) y=@0359;else y=@0048;
  $  121:解锁记录2-后背门微动开关                   $    $       $    $  ANS001.BYTE010  $  if(x1&0x02) y=@0359;else y=@0048;
  $  122:解锁记录2-远程控制                         $    $       $    $  ANS001.BYTE010  $  if(x1&0x04) y=@0359;else y=@0048;
  $  123:解锁记录2-硬线碰撞信号                     $    $       $    $  ANS001.BYTE010  $  if(x1&0x08) y=@0359;else y=@0048;
  $  124:解锁记录2-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE010  $  if(x1&0x10) y=@0359;else y=@0048;
  $  125:解锁记录2-数据索引                         $    $       $    $  ANS001.BYTE011  $  y=x1;
  $  126:解锁记录3-记录有效性                       $    $       $    $  ANS001.BYTE012  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  127:解锁记录3-副驶中控开关                     $    $       $    $  ANS001.BYTE013  $  if(x1&0x01) y=@0359;else y=@0048;
  $  128:解锁记录3-主驾中控开关                     $    $       $    $  ANS001.BYTE013  $  if(x1&0x02) y=@0359;else y=@0048;
  $  129:解锁记录3-遥控                             $    $       $    $  ANS001.BYTE013  $  if(x1&0x04) y=@0359;else y=@0048;
  $  130:解锁记录3-退电                             $    $       $    $  ANS001.BYTE013  $  if(x1&0x08) y=@0359;else y=@0048;
  $  131:解锁记录3-碰撞信号                         $    $       $    $  ANS001.BYTE013  $  if(x1&0x10) y=@0359;else y=@0048;
  $  132:解锁记录3-钥匙在车内                       $    $       $    $  ANS001.BYTE013  $  if(x1&0x20) y=@0359;else y=@0048;
  $  133:解锁记录3-左前门微动开关                   $    $       $    $  ANS001.BYTE013  $  if(x1&0x40) y=@0359;else y=@0048;
  $  134:解锁记录3-右前门微动开关                   $    $       $    $  ANS001.BYTE013  $  if(x1&0x80) y=@0359;else y=@0048;
  $  135:解锁记录3-锁定防止                         $    $       $    $  ANS001.BYTE014  $  if(x1&0x01) y=@0359;else y=@0048;
  $  136:解锁记录3-后背门微动开关                   $    $       $    $  ANS001.BYTE014  $  if(x1&0x02) y=@0359;else y=@0048;
  $  137:解锁记录3-远程控制                         $    $       $    $  ANS001.BYTE014  $  if(x1&0x04) y=@0359;else y=@0048;
  $  138:解锁记录3-硬线碰撞信号                     $    $       $    $  ANS001.BYTE014  $  if(x1&0x08) y=@0359;else y=@0048;
  $  139:解锁记录3-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE014  $  if(x1&0x10) y=@0359;else y=@0048;
  $  140:解锁记录3-数据索引                         $    $       $    $  ANS001.BYTE015  $  y=x1;
  $  141:解锁记录4-记录有效性                       $    $       $    $  ANS001.BYTE016  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  142:解锁记录4-副驶中控开关                     $    $       $    $  ANS001.BYTE017  $  if(x1&0x01) y=@0359;else y=@0048;
  $  143:解锁记录4-主驾中控开关                     $    $       $    $  ANS001.BYTE017  $  if(x1&0x02) y=@0359;else y=@0048;
  $  144:解锁记录4-遥控                             $    $       $    $  ANS001.BYTE017  $  if(x1&0x04) y=@0359;else y=@0048;
  $  145:解锁记录4-退电                             $    $       $    $  ANS001.BYTE017  $  if(x1&0x08) y=@0359;else y=@0048;
  $  146:解锁记录4-碰撞信号                         $    $       $    $  ANS001.BYTE017  $  if(x1&0x10) y=@0359;else y=@0048;
  $  147:解锁记录4-钥匙在车内                       $    $       $    $  ANS001.BYTE017  $  if(x1&0x20) y=@0359;else y=@0048;
  $  148:解锁记录4-左前门微动开关                   $    $       $    $  ANS001.BYTE017  $  if(x1&0x40) y=@0359;else y=@0048;
  $  149:解锁记录4-右前门微动开关                   $    $       $    $  ANS001.BYTE017  $  if(x1&0x80) y=@0359;else y=@0048;
  $  150:解锁记录4-锁定防止                         $    $       $    $  ANS001.BYTE018  $  if(x1&0x01) y=@0359;else y=@0048;
  $  151:解锁记录4-后背门微动开关                   $    $       $    $  ANS001.BYTE018  $  if(x1&0x02) y=@0359;else y=@0048;
  $  152:解锁记录4-远程控制                         $    $       $    $  ANS001.BYTE018  $  if(x1&0x04) y=@0359;else y=@0048;
  $  153:解锁记录4-硬线碰撞信号                     $    $       $    $  ANS001.BYTE018  $  if(x1&0x08) y=@0359;else y=@0048;
  $  154:解锁记录4-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE018  $  if(x1&0x10) y=@0359;else y=@0048;
  $  155:解锁记录4-数据索引                         $    $       $    $  ANS001.BYTE019  $  y=x1;
  $  156:解锁记录5-记录有效性                       $    $       $    $  ANS001.BYTE020  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  157:解锁记录5-副驶中控开关                     $    $       $    $  ANS001.BYTE021  $  if(x1&0x01) y=@0359;else y=@0048;
  $  158:解锁记录5-主驾中控开关                     $    $       $    $  ANS001.BYTE021  $  if(x1&0x02) y=@0359;else y=@0048;
  $  159:解锁记录5-遥控                             $    $       $    $  ANS001.BYTE021  $  if(x1&0x04) y=@0359;else y=@0048;
  $  160:解锁记录5-退电                             $    $       $    $  ANS001.BYTE021  $  if(x1&0x08) y=@0359;else y=@0048;
  $  161:解锁记录5-碰撞信号                         $    $       $    $  ANS001.BYTE021  $  if(x1&0x10) y=@0359;else y=@0048;
  $  162:解锁记录5-钥匙在车内                       $    $       $    $  ANS001.BYTE021  $  if(x1&0x20) y=@0359;else y=@0048;
  $  163:解锁记录5-左前门微动开关                   $    $       $    $  ANS001.BYTE021  $  if(x1&0x40) y=@0359;else y=@0048;
  $  164:解锁记录5-右前门微动开关                   $    $       $    $  ANS001.BYTE021  $  if(x1&0x80) y=@0359;else y=@0048;
  $  165:解锁记录5-锁定防止                         $    $       $    $  ANS001.BYTE022  $  if(x1&0x01) y=@0359;else y=@0048;
  $  166:解锁记录5-后背门微动开关                   $    $       $    $  ANS001.BYTE022  $  if(x1&0x02) y=@0359;else y=@0048;
  $  167:解锁记录5-远程控制                         $    $       $    $  ANS001.BYTE022  $  if(x1&0x04) y=@0359;else y=@0048;
  $  168:解锁记录5-硬线碰撞信号                     $    $       $    $  ANS001.BYTE022  $  if(x1&0x08) y=@0359;else y=@0048;
  $  169:解锁记录5-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE022  $  if(x1&0x10) y=@0359;else y=@0048;
  $  170:解锁记录5-数据索引                         $    $       $    $  ANS001.BYTE023  $  y=x1;
  $  171:解锁记录6-记录有效性                       $    $       $    $  ANS001.BYTE024  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  172:解锁记录6-副驶中控开关                     $    $       $    $  ANS001.BYTE025  $  if(x1&0x01) y=@0359;else y=@0048;
  $  173:解锁记录6-主驾中控开关                     $    $       $    $  ANS001.BYTE025  $  if(x1&0x02) y=@0359;else y=@0048;
  $  174:解锁记录6-遥控                             $    $       $    $  ANS001.BYTE025  $  if(x1&0x04) y=@0359;else y=@0048;
  $  175:解锁记录6-退电                             $    $       $    $  ANS001.BYTE025  $  if(x1&0x08) y=@0359;else y=@0048;
  $  176:解锁记录6-碰撞信号                         $    $       $    $  ANS001.BYTE025  $  if(x1&0x10) y=@0359;else y=@0048;
  $  177:解锁记录6-钥匙在车内                       $    $       $    $  ANS001.BYTE025  $  if(x1&0x20) y=@0359;else y=@0048;
  $  178:解锁记录6-左前门微动开关                   $    $       $    $  ANS001.BYTE025  $  if(x1&0x40) y=@0359;else y=@0048;
  $  179:解锁记录6-右前门微动开关                   $    $       $    $  ANS001.BYTE025  $  if(x1&0x80) y=@0359;else y=@0048;
  $  180:解锁记录6-锁定防止                         $    $       $    $  ANS001.BYTE026  $  if(x1&0x01) y=@0359;else y=@0048;
  $  181:解锁记录6-后背门微动开关                   $    $       $    $  ANS001.BYTE026  $  if(x1&0x02) y=@0359;else y=@0048;
  $  182:解锁记录6-远程控制                         $    $       $    $  ANS001.BYTE026  $  if(x1&0x04) y=@0359;else y=@0048;
  $  183:解锁记录6-硬线碰撞信号                     $    $       $    $  ANS001.BYTE026  $  if(x1&0x08) y=@0359;else y=@0048;
  $  184:解锁记录6-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE026  $  if(x1&0x10) y=@0359;else y=@0048;
  $  185:解锁记录6-数据索引                         $    $       $    $  ANS001.BYTE027  $  y=x1;
  $  186:解锁记录7-记录有效性                       $    $       $    $  ANS001.BYTE028  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  187:解锁记录7-副驶中控开关                     $    $       $    $  ANS001.BYTE029  $  if(x1&0x01) y=@0359;else y=@0048;
  $  188:解锁记录7-主驾中控开关                     $    $       $    $  ANS001.BYTE029  $  if(x1&0x02) y=@0359;else y=@0048;
  $  189:解锁记录7-遥控                             $    $       $    $  ANS001.BYTE029  $  if(x1&0x04) y=@0359;else y=@0048;
  $  190:解锁记录7-退电                             $    $       $    $  ANS001.BYTE029  $  if(x1&0x08) y=@0359;else y=@0048;
  $  191:解锁记录7-碰撞信号                         $    $       $    $  ANS001.BYTE029  $  if(x1&0x10) y=@0359;else y=@0048;
  $  192:解锁记录7-钥匙在车内                       $    $       $    $  ANS001.BYTE029  $  if(x1&0x20) y=@0359;else y=@0048;
  $  193:解锁记录7-左前门微动开关                   $    $       $    $  ANS001.BYTE029  $  if(x1&0x40) y=@0359;else y=@0048;
  $  194:解锁记录7-右前门微动开关                   $    $       $    $  ANS001.BYTE029  $  if(x1&0x80) y=@0359;else y=@0048;
  $  195:解锁记录7-锁定防止                         $    $       $    $  ANS001.BYTE030  $  if(x1&0x01) y=@0359;else y=@0048;
  $  196:解锁记录7-后背门微动开关                   $    $       $    $  ANS001.BYTE030  $  if(x1&0x02) y=@0359;else y=@0048;
  $  197:解锁记录7-远程控制                         $    $       $    $  ANS001.BYTE030  $  if(x1&0x04) y=@0359;else y=@0048;
  $  198:解锁记录7-硬线碰撞信号                     $    $       $    $  ANS001.BYTE030  $  if(x1&0x08) y=@0359;else y=@0048;
  $  199:解锁记录7-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE030  $  if(x1&0x10) y=@0359;else y=@0048;
  $  200:解锁记录7-数据索引                         $    $       $    $  ANS001.BYTE031  $  y=x1;
  $  201:解锁记录8-记录有效性                       $    $       $    $  ANS001.BYTE032  $  switxh(x1)0x13: y=@035a;default: y=@035b;
  $  202:解锁记录8-副驶中控开关                     $    $       $    $  ANS001.BYTE033  $  if(x1&0x01) y=@0359;else y=@0048;
  $  203:解锁记录8-主驾中控开关                     $    $       $    $  ANS001.BYTE033  $  if(x1&0x02) y=@0359;else y=@0048;
  $  204:解锁记录8-遥控                             $    $       $    $  ANS001.BYTE033  $  if(x1&0x04) y=@0359;else y=@0048;
  $  205:解锁记录8-退电                             $    $       $    $  ANS001.BYTE033  $  if(x1&0x08) y=@0359;else y=@0048;
  $  206:解锁记录8-碰撞信号                         $    $       $    $  ANS001.BYTE033  $  if(x1&0x10) y=@0359;else y=@0048;
  $  207:解锁记录8-钥匙在车内                       $    $       $    $  ANS001.BYTE033  $  if(x1&0x20) y=@0359;else y=@0048;
  $  208:解锁记录8-左前门微动开关                   $    $       $    $  ANS001.BYTE033  $  if(x1&0x40) y=@0359;else y=@0048;
  $  209:解锁记录8-右前门微动开关                   $    $       $    $  ANS001.BYTE033  $  if(x1&0x80) y=@0359;else y=@0048;
  $  210:解锁记录8-锁定防止                         $    $       $    $  ANS001.BYTE034  $  if(x1&0x01) y=@0359;else y=@0048;
  $  211:解锁记录8-后背门微动开关                   $    $       $    $  ANS001.BYTE034  $  if(x1&0x02) y=@0359;else y=@0048;
  $  212:解锁记录8-远程控制                         $    $       $    $  ANS001.BYTE034  $  if(x1&0x04) y=@0359;else y=@0048;
  $  213:解锁记录8-硬线碰撞信号                     $    $       $    $  ANS001.BYTE034  $  if(x1&0x08) y=@0359;else y=@0048;
  $  214:解锁记录8-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE034  $  if(x1&0x10) y=@0359;else y=@0048;
  $  215:解锁记录8-数据索引                         $    $       $    $  ANS001.BYTE035  $  y=x1;
  $  216:行李箱解锁记录1-记录有效性                 $    $       $    $  ANS002.BYTE004  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  217:行李箱解锁记录1-遥控信号                   $    $       $    $  ANS002.BYTE005  $  if(x1&0x01) y=@0359;else y=@0048;
  $  218:行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS002.BYTE005  $  if(x1&0x02) y=@0359;else y=@0048;
  $  219:行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE005  $  if(x1&0x04) y=@0359;else y=@0048;
  $  220:行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS002.BYTE005  $  if(x1&0x08) y=@0359;else y=@0048;
  $  221:行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS002.BYTE005  $  if(x1&0x10) y=@0359;else y=@0048;
  $  222:行李箱解锁记录1-数据索引                   $    $       $    $  ANS002.BYTE007  $  y=x1;
  $  223:行李箱解锁记录2-记录有效性                 $    $       $    $  ANS002.BYTE008  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  224:行李箱解锁记录2-遥控信号                   $    $       $    $  ANS002.BYTE009  $  if(x1&0x01) y=@0359;else y=@0048;
  $  225:行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS002.BYTE009  $  if(x1&0x02) y=@0359;else y=@0048;
  $  226:行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE009  $  if(x1&0x04) y=@0359;else y=@0048;
  $  227:行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS002.BYTE009  $  if(x1&0x08) y=@0359;else y=@0048;
  $  228:行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS002.BYTE009  $  if(x1&0x10) y=@0359;else y=@0048;
  $  229:行李箱解锁记录2-数据索引                   $    $       $    $  ANS002.BYTE011  $  y=x1;
  $  230:行李箱解锁记录3-记录有效性                 $    $       $    $  ANS002.BYTE012  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  231:行李箱解锁记录3-遥控信号                   $    $       $    $  ANS002.BYTE013  $  if(x1&0x01) y=@0359;else y=@0048;
  $  232:行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS002.BYTE013  $  if(x1&0x02) y=@0359;else y=@0048;
  $  233:行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE013  $  if(x1&0x04) y=@0359;else y=@0048;
  $  234:行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS002.BYTE013  $  if(x1&0x08) y=@0359;else y=@0048;
  $  235:行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS002.BYTE013  $  if(x1&0x10) y=@0359;else y=@0048;
  $  236:行李箱解锁记录3-数据索引                   $    $       $    $  ANS002.BYTE015  $  y=x1;
  $  237:行李箱解锁记录4-记录有效性                 $    $       $    $  ANS002.BYTE016  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  238:行李箱解锁记录4-遥控信号                   $    $       $    $  ANS002.BYTE017  $  if(x1&0x01) y=@0359;else y=@0048;
  $  239:行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS002.BYTE017  $  if(x1&0x02) y=@0359;else y=@0048;
  $  240:行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE017  $  if(x1&0x04) y=@0359;else y=@0048;
  $  241:行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS002.BYTE017  $  if(x1&0x08) y=@0359;else y=@0048;
  $  242:行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS002.BYTE017  $  if(x1&0x10) y=@0359;else y=@0048;
  $  243:行李箱解锁记录4-数据索引                   $    $       $    $  ANS002.BYTE019  $  y=x1;
  $  244:行李箱解锁记录5-记录有效性                 $    $       $    $  ANS002.BYTE020  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  245:行李箱解锁记录5-遥控信号                   $    $       $    $  ANS002.BYTE021  $  if(x1&0x01) y=@0359;else y=@0048;
  $  246:行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS002.BYTE021  $  if(x1&0x02) y=@0359;else y=@0048;
  $  247:行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE021  $  if(x1&0x04) y=@0359;else y=@0048;
  $  248:行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS002.BYTE021  $  if(x1&0x08) y=@0359;else y=@0048;
  $  249:行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS002.BYTE021  $  if(x1&0x10) y=@0359;else y=@0048;
  $  250:行李箱解锁记录5-数据索引                   $    $       $    $  ANS002.BYTE023  $  y=x1;
  $  251:行李箱解锁记录6-记录有效性                 $    $       $    $  ANS002.BYTE024  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  252:行李箱解锁记录6-遥控信号                   $    $       $    $  ANS002.BYTE025  $  if(x1&0x01) y=@0359;else y=@0048;
  $  253:行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS002.BYTE025  $  if(x1&0x02) y=@0359;else y=@0048;
  $  254:行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE025  $  if(x1&0x04) y=@0359;else y=@0048;
  $  255:行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS002.BYTE025  $  if(x1&0x08) y=@0359;else y=@0048;
  $  256:行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS002.BYTE025  $  if(x1&0x10) y=@0359;else y=@0048;
  $  257:行李箱解锁记录6-数据索引                   $    $       $    $  ANS002.BYTE027  $  y=x1;
  $  258:行李箱解锁记录7-记录有效性                 $    $       $    $  ANS002.BYTE028  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  259:行李箱解锁记录7-遥控信号                   $    $       $    $  ANS002.BYTE029  $  if(x1&0x01) y=@0359;else y=@0048;
  $  260:行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS002.BYTE029  $  if(x1&0x02) y=@0359;else y=@0048;
  $  261:行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE029  $  if(x1&0x04) y=@0359;else y=@0048;
  $  262:行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS002.BYTE029  $  if(x1&0x08) y=@0359;else y=@0048;
  $  263:行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS002.BYTE029  $  if(x1&0x10) y=@0359;else y=@0048;
  $  264:行李箱解锁记录7-数据索引                   $    $       $    $  ANS002.BYTE031  $  y=x1;
  $  265:行李箱解锁记录8-记录有效性                 $    $       $    $  ANS002.BYTE032  $  switxh(x1)0x14: y=@035a;default: y=@035b;
  $  266:行李箱解锁记录8-遥控信号                   $    $       $    $  ANS002.BYTE033  $  if(x1&0x01) y=@0359;else y=@0048;
  $  267:行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS002.BYTE033  $  if(x1&0x02) y=@0359;else y=@0048;
  $  268:行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE033  $  if(x1&0x04) y=@0359;else y=@0048;
  $  269:行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS002.BYTE033  $  if(x1&0x08) y=@0359;else y=@0048;
  $  270:行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS002.BYTE033  $  if(x1&0x10) y=@0359;else y=@0048;
  $  271:行李箱解锁记录8-数据索引                   $    $       $    $  ANS002.BYTE035  $  y=x1;
  $  272:启动失败记录1-记录有效性                   $    $       $    $  ANS003.BYTE004  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  273:启动失败记录1-启动失败原因                 $    $       $    $  ANS003.BYTE005  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  274:启动失败记录1-数据索引                     $    $       $    $  ANS003.BYTE007  $  y=x1;
  $  275:启动失败记录2-记录有效性                   $    $       $    $  ANS003.BYTE008  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  276:启动失败记录2-启动失败原因                 $    $       $    $  ANS003.BYTE009  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  277:启动失败记录2-数据索引                     $    $       $    $  ANS003.BYTE011  $  y=x1;
  $  278:启动失败记录3-记录有效性                   $    $       $    $  ANS003.BYTE012  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  279:启动失败记录3-启动失败原因                 $    $       $    $  ANS003.BYTE013  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  280:启动失败记录3-数据索引                     $    $       $    $  ANS003.BYTE015  $  y=x1;
  $  281:启动失败记录4-记录有效性                   $    $       $    $  ANS003.BYTE016  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  282:启动失败记录4-启动失败原因                 $    $       $    $  ANS003.BYTE017  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  283:启动失败记录4-数据索引                     $    $       $    $  ANS003.BYTE019  $  y=x1;
  $  284:启动失败记录5-记录有效性                   $    $       $    $  ANS003.BYTE020  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  285:启动失败记录5-启动失败原因                 $    $       $    $  ANS003.BYTE021  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  286:启动失败记录5-数据索引                     $    $       $    $  ANS003.BYTE023  $  y=x1;
  $  287:启动失败记录6-记录有效性                   $    $       $    $  ANS003.BYTE024  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  288:启动失败记录6-启动失败原因                 $    $       $    $  ANS003.BYTE025  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  289:启动失败记录6-数据索引                     $    $       $    $  ANS003.BYTE027  $  y=x1;
  $  290:启动失败记录7-记录有效性                   $    $       $    $  ANS003.BYTE028  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  291:启动失败记录7-启动失败原因                 $    $       $    $  ANS003.BYTE029  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  292:启动失败记录7-数据索引                     $    $       $    $  ANS003.BYTE031  $  y=x1;
  $  293:启动失败记录8-记录有效性                   $    $       $    $  ANS003.BYTE032  $  switxh(x1)0x15: y=@035a;default: y=@035b;
  $  294:启动失败记录8-启动失败原因                 $    $       $    $  ANS003.BYTE033  $  switxh(x1)0x00: y=@0048;0x01: y=@034c;0x02: y=@0432;0x03: y=@0286;0x04: y=@0433;0x05: y=@028e;0x06: y=@0369;0x07: y=@028f;0x08: y=@0434;0x09: y=@0291;0x0A: y=@0292;0x0B: y=@034e;default: y=@001c;
  $  295:启动失败记录8-数据索引                     $    $       $    $  ANS003.BYTE035  $  y=x1;
  $  296:退电失败记录1-记录有效性                   $    $       $    $  ANS004.BYTE004  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  297:退电失败记录1-退电失败原因                 $    $       $    $  ANS004.BYTE005  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  298:退电失败记录1-数据索引                     $    $       $    $  ANS004.BYTE007  $  y=x1;
  $  299:退电失败记录2-记录有效性                   $    $       $    $  ANS004.BYTE008  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  300:退电失败记录2-退电失败原因                 $    $       $    $  ANS004.BYTE009  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  301:退电失败记录2-数据索引                     $    $       $    $  ANS004.BYTE011  $  y=x1;
  $  302:退电失败记录3-记录有效性                   $    $       $    $  ANS004.BYTE012  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  303:退电失败记录3-退电失败原因                 $    $       $    $  ANS004.BYTE013  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  304:退电失败记录3-数据索引                     $    $       $    $  ANS004.BYTE015  $  y=x1;
  $  305:退电失败记录4-记录有效性                   $    $       $    $  ANS004.BYTE016  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  306:退电失败记录4-退电失败原因                 $    $       $    $  ANS004.BYTE017  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  307:退电失败记录4-数据索引                     $    $       $    $  ANS004.BYTE019  $  y=x1;
  $  308:退电失败记录5-记录有效性                   $    $       $    $  ANS004.BYTE020  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  309:退电失败记录5-退电失败原因                 $    $       $    $  ANS004.BYTE021  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  310:退电失败记录5-数据索引                     $    $       $    $  ANS004.BYTE023  $  y=x1;
  $  311:退电失败记录6-记录有效性                   $    $       $    $  ANS004.BYTE024  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  312:退电失败记录6-退电失败原因                 $    $       $    $  ANS004.BYTE025  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  313:退电失败记录6-数据索引                     $    $       $    $  ANS004.BYTE027  $  y=x1;
  $  314:退电失败记录7-记录有效性                   $    $       $    $  ANS004.BYTE028  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  315:退电失败记录7-退电失败原因                 $    $       $    $  ANS004.BYTE029  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  316:退电失败记录7-数据索引                     $    $       $    $  ANS004.BYTE031  $  y=x1;
  $  317:退电失败记录8-记录有效性                   $    $       $    $  ANS004.BYTE032  $  switxh(x1)0x16: y=@035a;default: y=@035b;
  $  318:退电失败记录8-退电失败原因                 $    $       $    $  ANS004.BYTE033  $  switxh(x1)0x00: y=@0048;0x01: y=@0285;0x02: y=@0286;0x03: y=@0369;0x04: y=@036b;0x05: y=@036c;0x06: y=@028a;default: y=@001c;
  $  319:退电失败记录8-数据索引                     $    $       $    $  ANS004.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:721 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
