
    车型ID：2710

    模拟：协议模拟-->2710

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7B7 02 10 01 00 00 00 00 00       $~  ANS000:7BF 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B7 02 3E 80 00 00 00 00 00       $!  ANS000:7BF 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7B7 03 19 02 09 00 00 00 00       $#  ANS000:7BF 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/4c000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B7 04 14 FF FF FF 00 00 00       $$  ANS000:7BF 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B7 03 22 F1 93 00 00 00 00       $%  ANS000:7BF 03 22 F1 93 00 00 00 00
  $%  REQ001:7B7 03 22 F1 94 00 00 00 00       $%  ANS001:7BF 03 22 F1 94 00 00 00 00
  $%  REQ002:7B7 03 22 F1 95 00 00 00 00       $%  ANS002:7BF 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1/100,(x1/10)%10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@001d,x2,@001e,x3,@001f);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%.2d.%.2d],(x1*256+x2)/10000,((x1*256+x2)%10000)/100,(x1*256+x2)%100);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@001d,x2,@001e,x3,@001f);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B7 03 22 01 08 00 00 00 00       $  ANS000:7BF 03 22 01 08 00 00 00 00
  $  REQ001:7B7 03 22 01 20 00 00 00 00       $  ANS001:7BF 03 22 01 20 00 00 00 00
  $  REQ002:7B7 03 22 01 21 00 00 00 00       $  ANS002:7BF 03 22 01 21 00 00 00 00

  $  000:左儿童锁闭锁状态               $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0064;else y=@026f;
  $  001:右儿童锁闭锁状态               $    $       $    $  ANS000.BYTE007  $  if(x1&0x02) y=@0064;else y=@026f;
  $  002:交流充电口状态                 $    $       $    $  ANS000.BYTE007  $  if(x1&0x04) y=@0004;else y=@0005;
  $  003:交流充电口照明灯状态           $    $       $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0004;else y=@0005;
  $  004:行李箱解锁开关状态             $    $       $    $  ANS000.BYTE007  $  if(x1&0x10) y=@00e6;else y=@0048;
  $  005:行李箱灯开关状态               $    $       $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0004;else y=@0005;
  $  006:行李箱状态                     $    $       $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0004;else y=@0005;
  $  007:行李箱灯状态                   $    $       $    $  ANS000.BYTE007  $  if(x1&0x80) y=@0004;else y=@0005;
  $  008:油箱口盖状态                   $    $       $    $  ANS000.BYTE008  $  if(x1&0x01) y=@0004;else y=@0005;
  $  009:后雨刮复位信号                 $    $       $    $  ANS000.BYTE008  $  if(x1&0x02) y=@00e6;else y=@0048;
  $  010:后小灯状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x04) y=@0004;else y=@0005;
  $  011:倒车灯状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x08) y=@0004;else y=@0005;
  $  012:后雾灯状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x10) y=@0004;else y=@0005;
  $  013:报警器状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x20) y=@0004;else y=@0005;
  $  014:后除霜状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x40) y=@0004;else y=@0005;
  $  015:后舱ACC电状态                  $    $       $    $  ANS000.BYTE008  $  if(x1&0x80) y=@0004;else y=@0005;
  $  016:后雨刮开关状态                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0004;else y=@0005;
  $  017:后鼓风机状态                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0004;else y=@0005;
  $  018:后洗涤状态                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0004;else y=@0005;
  $  019:前洗涤状态                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0004;else y=@0005;
  $  020:直流充电口盖状态               $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@0004;else y=@0005;
  $  021:直流充电口照明状态             $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@0004;else y=@0005;
  $  022:交流充电枪连接状态             $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@0426;else y=@015e;
  $  023:直流充电枪连接状态             $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@0426;else y=@015e;
  $  024:交流充电枪闭锁位置             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@0064;else y=@026f;
  $  025:直流充电枪闭锁位置             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@0064;else y=@026f;
  $  026:告警灯状态                     $    $       $    $  ANS000.BYTE010  $  switxh(x1&0x0C)0x00: y=@0048;0x04: y=@0480;0x08: y=@0481;0x0C: y=@05d9;default: y=@001c;
  $  027:左转向灯开关状态               $    $       $    $  ANS000.BYTE010  $  switxh(x1&0x30)0x00: y=@0048;0x10: y=@0483;0x20: y=@0484;0x30: y=@009e;default: y=@001c;
  $  028:右转向灯开关状态               $    $       $    $  ANS000.BYTE010  $  switxh(x1&0xC0)0x00: y=@0048;0x40: y=@0483;0x80: y=@0484;0xC0: y=@009e;default: y=@001c;
  $  029:左后转向灯故障                 $    $       $    $  ANS000.BYTE011  $  if(x1&0x01) y=@0059;else y=@0022;
  $  030:右后转向灯故障                 $    $       $    $  ANS000.BYTE011  $  if(x1&0x02) y=@0059;else y=@0022;
  $  031:左后二排安全带状态             $    $       $    $  ANS000.BYTE011  $  if(x1&0x04) y=@0487;else y=@0488;
  $  032:左后二排座椅乘客有无状态       $    $       $    $  ANS000.BYTE011  $  if(x1&0x08) y=@0485;else y=@0486;
  $  033:右后二排安全带状态             $    $       $    $  ANS000.BYTE011  $  if(x1&0x10) y=@0487;else y=@0488;
  $  034:右后二排座椅乘客有无状态       $    $       $    $  ANS000.BYTE011  $  if(x1&0x20) y=@0485;else y=@0486;
  $  035:中后二排安全带状态             $    $       $    $  ANS000.BYTE011  $  if(x1&0x40) y=@0487;else y=@0488;
  $  036:中后二排座椅乘客有无状态       $    $       $    $  ANS000.BYTE011  $  if(x1&0x80) y=@0485;else y=@0486;
  $  037:记录有效性                     $    $       $    $  ANS001.BYTE004  $  switxh(x1)0x21: y=@035a;default: y=@035b;
  $  038:窗控左儿童锁闭锁指令           $    $       $    $  ANS001.BYTE005  $  if(x1&0x01) y=@00e6;else y=@0048;
  $  039:窗控右儿童锁闭锁指令           $    $       $    $  ANS001.BYTE005  $  if(x1&0x02) y=@00e6;else y=@0048;
  $  040:IO控制左儿童锁闭锁指令         $    $       $    $  ANS001.BYTE005  $  if(x1&0x04) y=@00e6;else y=@0048;
  $  041:IO控制右儿童锁闭锁指令         $    $       $    $  ANS001.BYTE005  $  if(x1&0x08) y=@00e6;else y=@0048;
  $  042:数据索引                       $    $       $    $  ANS001.BYTE006  $  switxh(x1)0x00: y=@0048;0x01: y=@00e6;default: y=@0048;
  $  043:儿童锁闭锁触发时间标识         $    $       $    $  ANS001.BYTE007  $  switxh(x1)0x00: y=@0048;0x01: y=@00e6;default: y=@001c;
  $  044:触发时间                       $    $       $    $  ANS001.BYTE008  $  y=SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@001e,x2,@001f,x3,@05da,x4,@059e);
  $  045:数据索引_1                     $    $       $    $  ANS001.BYTE012  $  y=x1;
  $  046:记录有效性_1                   $    $       $    $  ANS002.BYTE004  $  switxh(x1)0x21: y=@035a;default: y=@035b;
  $  047:窗控左儿童锁解锁指令           $    $       $    $  ANS002.BYTE005  $  if(x1&0x01) y=@00e6;else y=@0048;
  $  048:窗控右儿童锁解锁指令           $    $       $    $  ANS002.BYTE005  $  if(x1&0x02) y=@00e6;else y=@0048;
  $  049:IO控制左儿童锁解锁指令         $    $       $    $  ANS002.BYTE005  $  if(x1&0x04) y=@00e6;else y=@0048;
  $  050:IO控制右儿童锁解锁指令         $    $       $    $  ANS002.BYTE005  $  if(x1&0x08) y=@00e6;else y=@0048;
  $  051:数据索引_2                     $    $       $    $  ANS002.BYTE006  $  switxh(x1)0x00: y=@0048;0x01: y=@00e6;default: y=@0048;
  $  052:儿童锁解锁触发时间标识         $    $       $    $  ANS002.BYTE007  $  switxh(x1)0x00: y=@0048;0x01: y=@00e6;default: y=@001c;
  $  053:触发时间_1                     $    $       $    $  ANS002.BYTE008  $  y=SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@001e,x2,@001f,x3,@05da,x4,@059e);
  $  054:数据索引_3                     $    $       $    $  ANS002.BYTE012  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B7 30 01 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
