
    车型ID：a2b0

    模拟：协议模拟-->a2b0

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 04 18 00 00 FF 00 00 00       $#  ANS000:729 04 18 00 00 FF 00 00 00

  ANS000.BYTE02 控制故障码个数，从$#ANS000.BYTE3$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a2b10000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 03 14 00 FF 00 00 00 00       $$  ANS000:729 03 14 00 FF 00 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 00 01 00 00 00 00       $%  ANS000:729 03 22 00 01 00 00 00 00
  $%  REQ001:721 03 22 00 03 00 00 00 00       $%  ANS001:729 03 22 00 03 00 00 00 00

  $%  000:软件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  001:软件日期:        $%    $%  ANS000.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);
  $%  002:硬件版本:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  003:硬件日期:        $%    $%  ANS001.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000:左前门灯开关检测                    $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@0004;else y=@0005;
  $  001:右前门灯开关检测                    $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@0004;else y=@0005;
  $  002:左后门灯开关检测                    $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@0004;else y=@0005;
  $  003:右后门灯开关检测                    $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@0004;else y=@0005;
  $  004:行李箱开关检测                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@0004;else y=@0005;
  $  005:左前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x20) y=@0064;else y=@026f;
  $  006:左后门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x40) y=@0064;else y=@026f;
  $  007:右前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x80) y=@0064;else y=@026f;
  $  008:右后门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0064;else y=@026f;
  $  009:后背门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0064;else y=@026f;
  $  010:发动机前舱盖状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0004;else y=@0005;
  $  011:安全带未系信号检测                  $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0270;else y=@031e;
  $  012:12V制动信号状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@00e6;else y=@0048;
  $  013:0V制动灯开关状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@00e6;else y=@0048;
  $  014:启动按钮1脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0272;else y=@0273;
  $  015:启动按钮4脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0272;else y=@0273;
  $  016:离合踏板状态                        $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0062;else y=@00aa;
  $  017:起动机继电器状态                    $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@002f;else y=@002e;
  $  018:左中控锁闭锁开关状态                $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@0272;else y=@0048;
  $  019:左门中控锁解锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@0272;else y=@0048;
  $  020:右门中控锁闭锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@0272;else y=@0048;
  $  021:右门中控锁解锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@0272;else y=@0048;
  $  022:IG1电状态                           $    $       $    $  ANS000.BYTE006  $  if(x1&0x80) y=@009f;else y=@00a0;
  $  023:ACC电状态                           $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@009f;else y=@00a0;
  $  024:外后视镜折叠开关状态                $    $       $    $  ANS000.BYTE007  $  if((x1&0x07)==0x00 || (x1&0x07)==0x01 )y=@0278;else if((x1&0x07)==0x02 || (x1&0x07)==0x03)y=@0279;else if((x1&0x07)==0x04 || (x1&0x07)==0x05)y=@027a;else if((x1&0x07)==0x06 || (x1&0x07)==0x07) y=@0048;
  $  025:行李箱安全系统状态                  $    $       $    $  ANS000.BYTE007  $  if(x1&0x20)y=@009f;else y=@00a0;
  $  026:自复位开关告警状态                  $    $       $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0272;else y=@0048;
  $  027:自锁式告警开关状态                  $    $       $    $  ANS000.BYTE007  $  if(x1&0x80) y=@0272;else y=@0048;
  $  028:电动外后视镜翻转调节                $    $       $    $  ANS000.BYTE008  $  if((x1&0x0f)==0x00)y=@027b;else if((x1&0x0f)==0x01)y=@027c;else if((x1&0x0f)==0x02)y=@027d;else if((x1&0x0f)==0x03)y=@027e;else if((x1&0x0f)==0x04)y=@027f;else if((x1&0x0f)==0x05)y=@0280;else if((x1&0x0f)==0x06)y=@0281;else if((x1&0x0f)==0x07)y=@0282;else if((x1&0x0f)==0x08)y=@0283;else y=@0076;
  $  029:电动外后视镜左右选择                $    $       $    $  ANS000.BYTE008  $  if((x1&0x30)==0x10)y=@0275;else if((x1&0x30)==0x20)y=@0276;else if((x1&0x30)==0x30)y=@0076;else y=@0048;
  $  030:近光灯硬件开关状态                  $    $       $    $  ANS000.BYTE008  $  if(x1&0x40) y=@0272;else y=@0048;
  $  031:雨刮复位状态                        $    $       $    $  ANS000.BYTE008  $  if(x1&0x80) y=@0354;else y=@0355;
  $  032:远光灯执行状态反馈                  $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0004;else y=@0005;
  $  033:近光灯执行状态反馈                  $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0004;else y=@0005;
  $  034:门锁保护状态                        $    $       $    $  ANS000.BYTE009  $  if((x1&0x18)==0x08)y=@0274;else if((x1&0x18)==0x10)y=@0024;else if((x1&0x18)==0x18)y=@0274;else y=@0022;
  $  035:前碰撞信号状态(PWM(脉宽调制))       $    $       $    $  ANS000.BYTE009  $  if((x1&0xc0)==0x40)y=@0277;else if((x1&0xc0)==0x80)y=@003a;else if((x1&0xc0)==0xc0)y=@0048;else y=@0022;
  $  036:前雨刮硬件信号驱动状态              $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0272;else y=@0048;

  $)  01.历史数据-防盗报警记录
  $  01.历史数据-防盗报警记录
  $  REQ000:721 03 22 01 09 00 00 00 00       $  ANS000:729 03 22 01 09 00 00 00 00

  $  000:数据标识             $    $       $    $  ANS000.BYTE004  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  001:驾驶侧车门           $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0284;else y=@0048;
  $  002:副驾驶侧车门         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0284;else y=@0048;
  $  003:左后车门             $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0284;else y=@0048;
  $  004:右后车门             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0284;else y=@0048;
  $  005:行李箱盖             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0284;else y=@0048;
  $  006:IG1电                $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0284;else y=@0048;
  $  007:驾驶侧车门锁         $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0284;else y=@0048;
  $  008:左后门锁             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@0284;else y=@0048;
  $  009:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@0284;else y=@0048;
  $  010:右后车门锁           $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@0284;else y=@0048;
  $  011:前舰盖               $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@0284;else y=@0048;
  $  012:数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013:数据标识             $    $       $    $  ANS000.BYTE008  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  014:驾驶侧车门           $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0284;else y=@0048;
  $  015:副驾驶侧车门         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0284;else y=@0048;
  $  016:左后车门             $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0284;else y=@0048;
  $  017:右后车门             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0284;else y=@0048;
  $  018:行李箱盖             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@0284;else y=@0048;
  $  019:IG1电                $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@0284;else y=@0048;
  $  020:驾驶侧车门锁         $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@0284;else y=@0048;
  $  021:左后门锁             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@0284;else y=@0048;
  $  022:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@0284;else y=@0048;
  $  023:右后车门锁           $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@0284;else y=@0048;
  $  024:前舰盖               $    $       $    $  ANS000.BYTE010  $  if(x1&0x20) y=@0284;else y=@0048;
  $  025:数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026:数据标识             $    $       $    $  ANS000.BYTE012  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  027:驾驶侧车门           $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@0284;else y=@0048;
  $  028:副驾驶侧车门         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@0284;else y=@0048;
  $  029:左后车门             $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@0284;else y=@0048;
  $  030:右后车门             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@0284;else y=@0048;
  $  031:行李箱盖             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@0284;else y=@0048;
  $  032:IG1电                $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@0284;else y=@0048;
  $  033:驾驶侧车门锁         $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@0284;else y=@0048;
  $  034:左后门锁             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@0284;else y=@0048;
  $  035:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@0284;else y=@0048;
  $  036:右后车门锁           $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@0284;else y=@0048;
  $  037:前舰盖               $    $       $    $  ANS000.BYTE014  $  if(x1&0x20) y=@0284;else y=@0048;
  $  038:数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039:数据标识             $    $       $    $  ANS000.BYTE016  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  040:驾驶侧车门           $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@0284;else y=@0048;
  $  041:副驾驶侧车门         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0284;else y=@0048;
  $  042:左后车门             $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@0284;else y=@0048;
  $  043:右后车门             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@0284;else y=@0048;
  $  044:行李箱盖             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@0284;else y=@0048;
  $  045:IG1电                $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@0284;else y=@0048;
  $  046:驾驶侧车门锁         $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@0284;else y=@0048;
  $  047:左后门锁             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@0284;else y=@0048;
  $  048:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@0284;else y=@0048;
  $  049:右后车门锁           $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@0284;else y=@0048;
  $  050:前舰盖               $    $       $    $  ANS000.BYTE018  $  if(x1&0x20) y=@0284;else y=@0048;
  $  051:数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052:数据标识             $    $       $    $  ANS000.BYTE020  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  053:驾驶侧车门           $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0284;else y=@0048;
  $  054:副驾驶侧车门         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0284;else y=@0048;
  $  055:左后车门             $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@0284;else y=@0048;
  $  056:右后车门             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@0284;else y=@0048;
  $  057:行李箱盖             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@0284;else y=@0048;
  $  058:IG1电                $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@0284;else y=@0048;
  $  059:驾驶侧车门锁         $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@0284;else y=@0048;
  $  060:左后门锁             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@0284;else y=@0048;
  $  061:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@0284;else y=@0048;
  $  062:右后车门锁           $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@0284;else y=@0048;
  $  063:前舰盖               $    $       $    $  ANS000.BYTE022  $  if(x1&0x20) y=@0284;else y=@0048;
  $  064:数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065:数据标识             $    $       $    $  ANS000.BYTE024  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  066:驾驶侧车门           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0284;else y=@0048;
  $  067:副驾驶侧车门         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0284;else y=@0048;
  $  068:左后车门             $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0284;else y=@0048;
  $  069:右后车门             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0284;else y=@0048;
  $  070:行李箱盖             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0284;else y=@0048;
  $  071:IG1电                $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0284;else y=@0048;
  $  072:驾驶侧车门锁         $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@0284;else y=@0048;
  $  073:左后门锁             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@0284;else y=@0048;
  $  074:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@0284;else y=@0048;
  $  075:右后车门锁           $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@0284;else y=@0048;
  $  076:前舰盖               $    $       $    $  ANS000.BYTE026  $  if(x1&0x20) y=@0284;else y=@0048;
  $  077:数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078:数据标识             $    $       $    $  ANS000.BYTE028  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  079:驾驶侧车门           $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0284;else y=@0048;
  $  080:副驾驶侧车门         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0284;else y=@0048;
  $  081:左后车门             $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@0284;else y=@0048;
  $  082:右后车门             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@0284;else y=@0048;
  $  083:行李箱盖             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0284;else y=@0048;
  $  084:IG1电                $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0284;else y=@0048;
  $  085:驾驶侧车门锁         $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@0284;else y=@0048;
  $  086:左后门锁             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@0284;else y=@0048;
  $  087:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@0284;else y=@0048;
  $  088:右后车门锁           $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@0284;else y=@0048;
  $  089:前舰盖               $    $       $    $  ANS000.BYTE030  $  if(x1&0x20) y=@0284;else y=@0048;
  $  090:数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091:数据标识             $    $       $    $  ANS000.BYTE032  $  if(x1==0x11) y=@00e6;else y=@0048;
  $  092:驾驶侧车门           $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0284;else y=@0048;
  $  093:副驾驶侧车门         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0284;else y=@0048;
  $  094:左后车门             $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@0284;else y=@0048;
  $  095:右后车门             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0284;else y=@0048;
  $  096:行李箱盖             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@0284;else y=@0048;
  $  097:IG1电                $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@0284;else y=@0048;
  $  098:驾驶侧车门锁         $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@0284;else y=@0048;
  $  099:左后门锁             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@0284;else y=@0048;
  $  100:副驾驶侧车门锁       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@0284;else y=@0048;
  $  101:右后车门锁           $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@0284;else y=@0048;
  $  102:前舰盖               $    $       $    $  ANS000.BYTE034  $  if(x1&0x20) y=@0284;else y=@0048;
  $  103:数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.历史数据-门锁闭锁记录
  $  02.历史数据-门锁闭锁记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00

  $  000:数据标识               $    $       $    $  ANS000.BYTE004  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  001:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0284;else y=@0048;
  $  002:驾驶侧中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0284;else y=@0048;
  $  003:遥控信号               $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0284;else y=@0048;
  $  004:超速闭锁               $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0284;else y=@0048;
  $  005:自动返回防盗           $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0284;else y=@0048;
  $  006:左前门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0284;else y=@0048;
  $  007:右前门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@0284;else y=@0048;
  $  008:后背门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@0284;else y=@0048;
  $  009:远程控制闭锁           $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0284;else y=@0048;
  $  010:数据索引               $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  011:数据标识               $    $       $    $  ANS000.BYTE008  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  012:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0284;else y=@0048;
  $  013:驾驶侧中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0284;else y=@0048;
  $  014:遥控信号               $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0284;else y=@0048;
  $  015:超速闭锁               $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0284;else y=@0048;
  $  016:自动返回防盗           $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@0284;else y=@0048;
  $  017:左前门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@0284;else y=@0048;
  $  018:右前门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@0284;else y=@0048;
  $  019:后背门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@0284;else y=@0048;
  $  020:远程控制闭锁           $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@0284;else y=@0048;
  $  021:数据索引               $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  022:数据标识               $    $       $    $  ANS000.BYTE012  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  023:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@0284;else y=@0048;
  $  024:驾驶侧中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@0284;else y=@0048;
  $  025:遥控信号               $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@0284;else y=@0048;
  $  026:超速闭锁               $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@0284;else y=@0048;
  $  027:自动返回防盗           $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@0284;else y=@0048;
  $  028:左前门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@0284;else y=@0048;
  $  029:右前门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@0284;else y=@0048;
  $  030:后背门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@0284;else y=@0048;
  $  031:远程控制闭锁           $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@0284;else y=@0048;
  $  032:数据索引               $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  033:数据标识               $    $       $    $  ANS000.BYTE016  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  034:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@0284;else y=@0048;
  $  035:驾驶侧中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0284;else y=@0048;
  $  036:遥控信号               $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@0284;else y=@0048;
  $  037:超速闭锁               $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@0284;else y=@0048;
  $  038:自动返回防盗           $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@0284;else y=@0048;
  $  039:左前门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@0284;else y=@0048;
  $  040:右前门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@0284;else y=@0048;
  $  041:后背门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@0284;else y=@0048;
  $  042:远程控制闭锁           $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@0284;else y=@0048;
  $  043:数据索引               $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  044:数据标识               $    $       $    $  ANS000.BYTE020  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  045:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0284;else y=@0048;
  $  046:驾驶侧中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0284;else y=@0048;
  $  047:遥控信号               $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@0284;else y=@0048;
  $  048:超速闭锁               $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@0284;else y=@0048;
  $  049:自动返回防盗           $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@0284;else y=@0048;
  $  050:左前门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@0284;else y=@0048;
  $  051:右前门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@0284;else y=@0048;
  $  052:后背门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@0284;else y=@0048;
  $  053:远程控制闭锁           $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@0284;else y=@0048;
  $  054:数据索引               $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  055:数据标识               $    $       $    $  ANS000.BYTE024  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  056:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0284;else y=@0048;
  $  057:驾驶侧中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0284;else y=@0048;
  $  058:遥控信号               $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0284;else y=@0048;
  $  059:超速闭锁               $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0284;else y=@0048;
  $  060:自动返回防盗           $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0284;else y=@0048;
  $  061:左前门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0284;else y=@0048;
  $  062:右前门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@0284;else y=@0048;
  $  063:后背门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@0284;else y=@0048;
  $  064:远程控制闭锁           $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@0284;else y=@0048;
  $  065:数据索引               $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  066:数据标识               $    $       $    $  ANS000.BYTE028  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  067:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0284;else y=@0048;
  $  068:驾驶侧中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0284;else y=@0048;
  $  069:遥控信号               $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@0284;else y=@0048;
  $  070:超速闭锁               $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@0284;else y=@0048;
  $  071:自动返回防盗           $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0284;else y=@0048;
  $  072:左前门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0284;else y=@0048;
  $  073:右前门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@0284;else y=@0048;
  $  074:后背门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@0284;else y=@0048;
  $  075:远程控制闭锁           $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@0284;else y=@0048;
  $  076:数据索引               $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  077:数据标识               $    $       $    $  ANS000.BYTE032  $  if(x1==0x12) y=@00e6;else y=@0048;
  $  078:副驾驶侧中控开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0284;else y=@0048;
  $  079:驾驶侧中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0284;else y=@0048;
  $  080:遥控信号               $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@0284;else y=@0048;
  $  081:超速闭锁               $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0284;else y=@0048;
  $  082:自动返回防盗           $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@0284;else y=@0048;
  $  083:左前门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@0284;else y=@0048;
  $  084:右前门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@0284;else y=@0048;
  $  085:后背门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@0284;else y=@0048;
  $  086:远程控制闭锁           $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@0284;else y=@0048;
  $  087:数据索引               $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.历史数据-门锁解锁记录
  $  03.历史数据-门锁解锁记录
  $  REQ000:721 03 22 01 0B 00 00 00 00       $  ANS000:729 03 22 01 0B 00 00 00 00

  $  000:数据标识                   $    $       $    $  ANS000.BYTE004  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  001:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0284;else y=@0048;
  $  002:驾驶侧中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0284;else y=@0048;
  $  003:遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0284;else y=@0048;
  $  004:退电解锁                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0284;else y=@0048;
  $  005:碰撞信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0284;else y=@0048;
  $  006:钥匙在车门                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0284;else y=@0048;
  $  007:左前门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@0284;else y=@0048;
  $  008:右前门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@0284;else y=@0048;
  $  009:锁定防止                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0284;else y=@0048;
  $  010:后背门微动开关             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@0284;else y=@0048;
  $  011:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@0284;else y=@0048;
  $  012:数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013:数据标识                   $    $       $    $  ANS000.BYTE008  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  014:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0284;else y=@0048;
  $  015:驾驶侧中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0284;else y=@0048;
  $  016:遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0284;else y=@0048;
  $  017:退电解锁                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0284;else y=@0048;
  $  018:碰撞信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@0284;else y=@0048;
  $  019:钥匙在车门                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@0284;else y=@0048;
  $  020:左前门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@0284;else y=@0048;
  $  021:右前门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@0284;else y=@0048;
  $  022:锁定防止                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@0284;else y=@0048;
  $  023:后背门微动开关             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@0284;else y=@0048;
  $  024:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@0284;else y=@0048;
  $  025:数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026:数据标识                   $    $       $    $  ANS000.BYTE012  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  027:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@0284;else y=@0048;
  $  028:驾驶侧中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@0284;else y=@0048;
  $  029:遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@0284;else y=@0048;
  $  030:退电解锁                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@0284;else y=@0048;
  $  031:碰撞信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@0284;else y=@0048;
  $  032:钥匙在车门                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@0284;else y=@0048;
  $  033:左前门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@0284;else y=@0048;
  $  034:右前门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@0284;else y=@0048;
  $  035:锁定防止                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@0284;else y=@0048;
  $  036:后背门微动开关             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@0284;else y=@0048;
  $  037:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@0284;else y=@0048;
  $  038:数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039:数据标识                   $    $       $    $  ANS000.BYTE016  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  040:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@0284;else y=@0048;
  $  041:驾驶侧中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0284;else y=@0048;
  $  042:遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@0284;else y=@0048;
  $  043:退电解锁                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@0284;else y=@0048;
  $  044:碰撞信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@0284;else y=@0048;
  $  045:钥匙在车门                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@0284;else y=@0048;
  $  046:左前门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@0284;else y=@0048;
  $  047:右前门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@0284;else y=@0048;
  $  048:锁定防止                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@0284;else y=@0048;
  $  049:后背门微动开关             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@0284;else y=@0048;
  $  050:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@0284;else y=@0048;
  $  051:数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052:数据标识                   $    $       $    $  ANS000.BYTE020  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  053:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0284;else y=@0048;
  $  054:驾驶侧中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0284;else y=@0048;
  $  055:遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@0284;else y=@0048;
  $  056:退电解锁                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@0284;else y=@0048;
  $  057:碰撞信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@0284;else y=@0048;
  $  058:钥匙在车门                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@0284;else y=@0048;
  $  059:左前门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@0284;else y=@0048;
  $  060:右前门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@0284;else y=@0048;
  $  061:锁定防止                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@0284;else y=@0048;
  $  062:后背门微动开关             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@0284;else y=@0048;
  $  063:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@0284;else y=@0048;
  $  064:数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065:数据标识                   $    $       $    $  ANS000.BYTE024  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  066:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0284;else y=@0048;
  $  067:驾驶侧中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0284;else y=@0048;
  $  068:遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0284;else y=@0048;
  $  069:退电解锁                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0284;else y=@0048;
  $  070:碰撞信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0284;else y=@0048;
  $  071:钥匙在车门                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0284;else y=@0048;
  $  072:左前门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@0284;else y=@0048;
  $  073:右前门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@0284;else y=@0048;
  $  074:锁定防止                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@0284;else y=@0048;
  $  075:后背门微动开关             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@0284;else y=@0048;
  $  076:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@0284;else y=@0048;
  $  077:数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078:数据标识                   $    $       $    $  ANS000.BYTE028  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  079:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0284;else y=@0048;
  $  080:驾驶侧中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0284;else y=@0048;
  $  081:遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@0284;else y=@0048;
  $  082:退电解锁                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@0284;else y=@0048;
  $  083:碰撞信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0284;else y=@0048;
  $  084:钥匙在车门                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0284;else y=@0048;
  $  085:左前门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@0284;else y=@0048;
  $  086:右前门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@0284;else y=@0048;
  $  087:锁定防止                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@0284;else y=@0048;
  $  088:后背门微动开关             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@0284;else y=@0048;
  $  089:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@0284;else y=@0048;
  $  090:数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091:数据标识                   $    $       $    $  ANS000.BYTE032  $  if(x1==0x13) y=@00e6;else y=@0048;
  $  092:副驾驶侧中控开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0284;else y=@0048;
  $  093:驾驶侧中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0284;else y=@0048;
  $  094:遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@0284;else y=@0048;
  $  095:退电解锁                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0284;else y=@0048;
  $  096:碰撞信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@0284;else y=@0048;
  $  097:钥匙在车门                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@0284;else y=@0048;
  $  098:左前门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@0284;else y=@0048;
  $  099:右前门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@0284;else y=@0048;
  $  100:锁定防止                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@0284;else y=@0048;
  $  101:后背门微动开关             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@0284;else y=@0048;
  $  102:远程控制解锁所有车门       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@0284;else y=@0048;
  $  103:数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.历史数据-行李箱解锁记录
  $  04.历史数据-行李箱解锁记录
  $  REQ000:721 03 22 01 0C 00 00 00 00       $  ANS000:729 03 22 01 0C 00 00 00 00

  $  000:数据标识                   $    $       $    $  ANS000.BYTE004  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  001:遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0284;else y=@0048;
  $  002:行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0284;else y=@0048;
  $  003:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0284;else y=@0048;
  $  004:后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0284;else y=@0048;
  $  005:远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0284;else y=@0048;
  $  006:数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007:数据标识                   $    $       $    $  ANS000.BYTE008  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  008:遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0284;else y=@0048;
  $  009:行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0284;else y=@0048;
  $  010:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0284;else y=@0048;
  $  011:后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0284;else y=@0048;
  $  012:远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@0284;else y=@0048;
  $  013:数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014:数据标识                   $    $       $    $  ANS000.BYTE012  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  015:遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@0284;else y=@0048;
  $  016:行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@0284;else y=@0048;
  $  017:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@0284;else y=@0048;
  $  018:后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@0284;else y=@0048;
  $  019:远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@0284;else y=@0048;
  $  020:数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021:数据标识                   $    $       $    $  ANS000.BYTE016  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  022:遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@0284;else y=@0048;
  $  023:行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0284;else y=@0048;
  $  024:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@0284;else y=@0048;
  $  025:后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@0284;else y=@0048;
  $  026:远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@0284;else y=@0048;
  $  027:数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028:数据标识                   $    $       $    $  ANS000.BYTE020  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  029:遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0284;else y=@0048;
  $  030:行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0284;else y=@0048;
  $  031:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@0284;else y=@0048;
  $  032:后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@0284;else y=@0048;
  $  033:远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@0284;else y=@0048;
  $  034:数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035:数据标识                   $    $       $    $  ANS000.BYTE024  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  036:遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0284;else y=@0048;
  $  037:行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0284;else y=@0048;
  $  038:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0284;else y=@0048;
  $  039:后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0284;else y=@0048;
  $  040:远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0284;else y=@0048;
  $  041:数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042:数据标识                   $    $       $    $  ANS000.BYTE028  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  043:遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0284;else y=@0048;
  $  044:行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0284;else y=@0048;
  $  045:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@0284;else y=@0048;
  $  046:后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@0284;else y=@0048;
  $  047:远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0284;else y=@0048;
  $  048:数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049:数据标识                   $    $       $    $  ANS000.BYTE032  $  if(x1==0x14) y=@00e6;else y=@0048;
  $  050:遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0284;else y=@0048;
  $  051:行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0284;else y=@0048;
  $  052:钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@0284;else y=@0048;
  $  053:后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0284;else y=@0048;
  $  054:远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@0284;else y=@0048;
  $  055:数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.历史数据-启动失败原因记录
  $  05.历史数据-启动失败原因记录
  $  REQ000:721 03 22 01 0D 00 00 00 00       $  ANS000:729 03 22 01 0D 00 00 00 00

  $  000:数据标识           $    $       $    $  ANS000.BYTE004  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  001:启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  002:数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003:数据标识           $    $       $    $  ANS000.BYTE008  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  004:启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  005:数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006:数据标识           $    $       $    $  ANS000.BYTE012  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  007:启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  008:数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009:数据标识           $    $       $    $  ANS000.BYTE016  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  010:启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  011:数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012:数据标识           $    $       $    $  ANS000.BYTE020  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  013:启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  014:数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015:数据标识           $    $       $    $  ANS000.BYTE024  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  016:启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  017:数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018:数据标识           $    $       $    $  ANS000.BYTE028  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  019:启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  020:数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021:数据标识           $    $       $    $  ANS000.BYTE032  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  022:启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@028b;else if(x1==0x02)y=@028c;else if(x1==0x03)y=@0286;else if(x1==0x04)y=@028d;else if(x1==0x05)y=@028e;else if(x1==0x06)y=@0287;else if(x1==0x07)y=@028f;else if(x1==0x08)y=@0290;else if(x1==0x09)y=@0291;else if(x1==0x0a)y=@0292;else if(x1==0x0b)y=@0293;else y=@009e;
  $  023:数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.历史数据-退电失败原因记录
  $  06.历史数据-退电失败原因记录
  $  REQ000:721 03 22 01 0E 00 00 00 00       $  ANS000:729 03 22 01 0E 00 00 00 00

  $  000:数据标识           $    $       $    $  ANS000.BYTE004  $  if(x1==0x15) y=@00e6;else y=@0048;
  $  001:启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  002:数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003:数据标识           $    $       $    $  ANS000.BYTE008  $  if(x1==0x16) y=@00e6;else y=@0048;
  $  004:启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  005:数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006:数据标识           $    $       $    $  ANS000.BYTE012  $  if(x1==0x16) y=@00e6;else y=@0048;
  $  007:启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  008:数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009:数据标识           $    $       $    $  ANS000.BYTE016  $  if(x1==0x16) y=@00e6;else y=@0048;
  $  010:启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  011:数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012:数据标识           $    $       $    $  ANS000.BYTE020  $  if(x1==0x16) y=@00e6;else y=@0048;
  $  013:启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  014:数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015:数据标识           $    $       $    $  ANS000.BYTE024  $  if(x1==0x16) y=@00e6;else y=@0048;
  $  016:启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  017:数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018:数据标识           $    $       $    $  ANS000.BYTE028  $  if(x1==0x16) y=@00e6;else y=@0048;
  $  019:启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  020:数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021:数据标识           $    $       $    $  ANS000.BYTE032  $  if(x1==0x16) y=@00e6;else y=@0048;
  $  022:启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00)y=@0048;else if(x1==0x01)y=@0285;else if(x1==0x02)y=@0286;else if(x1==0x03)y=@0287;else if(x1==0x04)y=@0288;else if(x1==0x05)y=@0289;else if(x1==0x06)y=@028a;else y=@009e;
  $  023:数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:721 30 01 04 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
