
    车型ID：a302

    模拟：协议模拟-->a302

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 00 00 9E       $#  ANS000:84 11 F1 18 00 00 00 9E

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a3020000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 00 00 99       $$  ANS000:83 11 F1 14 00 00 99

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 90 2E       $%  ANS000:82 11 F1 1A 90 2E
  $%  REQ001:82 11 F1 1A 91 2F       $%  ANS001:82 11 F1 1A 91 2F
  $%  REQ002:82 11 F1 1A 92 30       $%  ANS002:82 11 F1 1A 92 30
  $%  REQ003:82 11 F1 1A 94 32       $%  ANS003:82 11 F1 1A 94 32
  $%  REQ004:82 11 F1 1A 95 33       $%  ANS004:82 11 F1 1A 95 33
  $%  REQ005:82 11 F1 1A 96 34       $%  ANS005:82 11 F1 1A 96 34
  $%  REQ006:82 11 F1 1A 97 35       $%  ANS006:82 11 F1 1A 97 35
  $%  REQ007:82 11 F1 1A 98 36       $%  ANS007:82 11 F1 1A 98 36
  $%  REQ008:82 11 F1 1A 99 37       $%  ANS008:82 11 F1 1A 99 37
  $%  REQ009:82 11 F1 1A 9A 38       $%  ANS009:82 11 F1 1A 9A 38
  $%  REQ010:82 11 F1 1A 9B 39       $%  ANS010:82 11 F1 1A 9B 39
  $%  REQ011:82 11 F1 1A 9C 3A       $%  ANS011:82 11 F1 1A 9C 3A
  $%  REQ012:82 11 F1 1A 9D 3B       $%  ANS012:82 11 F1 1A 9D 3B
  $%  REQ013:82 11 F1 1A 9F 3D       $%  ANS013:82 11 F1 1A 9F 3D

  $%  000:汽车标识编号(VIN):               $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:零件号码α代码:                  $%    $%  ANS001.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:ECU基本硬件编号:                 $%    $%  ANS002.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  003:ECU软件编号:                     $%    $%  ANS003.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:ECU软件版本号:                   $%    $%  ANS004.BYTE005  $%  y=x1;
  $%  005:定型编号:                        $%    $%  ANS005.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  006:系统名称或发动机类型:            $%    $%  ANS006.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  007:维修店代码或诊断仪序列号:        $%    $%  ANS007.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  008:编程日期:                        $%    $%  ANS008.BYTE005  $%  y=SPRINTF([%d-%d-%d],x1,x2,x3);
  $%  009:ECU诊断标识(DDI):                $%    $%  ANS009.BYTE005  $%  y=x1*256+x2;
  $%  010:ECU代码版本号:                   $%    $%  ANS010.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  011:ECU只读存储器版本号:             $%    $%  ANS011.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  012:CAN数据字典版本号:               $%    $%  ANS012.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  013:博世零件代码号:                  $%    $%  ANS013.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  014:博世零件代码号:                  $%    $%  ANS013.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000:故障码数量                             $    $               $    $  ANS000.BYTE005  $  y=x1;
  $  001:AT 转换离合器激活                      $    $               $    $  ANS000.BYTE033  $  if(x1&0x08)y=@01dd;else y=@0007;
  $  002:电瓶电压                               $    $  V            $    $  ANS000.BYTE036  $  y=x1 *0.073675;
  $  003:发动机转速                             $    $  rpm          $    $  ANS000.BYTE037  $  y=x1 *64+x2*64/256;
  $  004:目标怠速(无补偿)                       $    $  rpm          $    $  ANS000.BYTE039  $  y=x1 *10;
  $  005:目标怠速(有补偿)                       $    $  rpm          $    $  ANS000.BYTE040  $  y=x1 *10;
  $  006:车速                                   $    $  km/h         $    $  ANS000.BYTE041  $  y=x1;
  $  007:车辆加速度                             $    $  m/s2         $    $  ANS000.BYTE042  $  if(x1>0x7E) y=(x1-255)*0.217;else y=x1*0.217;
  $  008:发动机冷却剂温度传感器电压             $    $  V            $    $  ANS000.BYTE043  $  y=5*x1/256.00;
  $  009:冷却液温度                             $    $  degree C     $    $  ANS000.BYTE044  $  y=x1-40;
  $  010:进气温度传感器电压                     $    $  V            $    $  ANS000.BYTE045  $  y=x1 /256.00*5;
  $  011:进气温度                               $    $  degree C     $    $  ANS000.BYTE046  $  y=x1-40;
  $  012:环境温度                               $    $  degree C     $    $  ANS000.BYTE047  $  y=x1-40;
  $  013:空调蒸发器温度A/D值                    $    $  V            $    $  ANS000.BYTE048  $  y=x1*5/256.00;
  $  014:步进电机目标位置                       $    $  步幅         $    $  ANS000.BYTE055  $  y=x1;
  $  015:进气歧管压力传感器电压                 $    $  V            $    $  ANS000.BYTE056  $  y=x1 *4.98/255.00;
  $  016:进气歧管压力                           $    $  hPa          $    $  ANS000.BYTE057  $  y=x1 *10;
  $  017:踏板位置传感器1电压                    $    $  V            $    $  ANS000.BYTE058  $  y=x1*0.01953125;
  $  018:踏板位置传感器2电压                    $    $  V            $    $  ANS000.BYTE059  $  y=x1/51.20;
  $  019:标准化的踏板脚加速度                   $    $  %PED         $    $  ANS000.BYTE060  $  y=x1*0.39215;
  $  020:节气门电位计1电压                      $    $  V            $    $  ANS000.BYTE061  $  y=x1*0.01953125;
  $  021:节气门电位计2电压                      $    $  V            $    $  ANS000.BYTE062  $  y=x1*0.01953125;
  $  022:节气门角度期望值                       $    $  %DK          $    $  ANS000.BYTE063  $  y=x1*0.39215;
  $  023:节气门开度                             $    $  %            $    $  ANS000.BYTE064  $  y=x1*0.39215;
  $  024:节气门电机PWM(脉宽调制) 控制信号       $    $  %            $    $  ANS000.BYTE065  $  y=x1*0.39215;
  $  025:用于学习步长的学习时间计数器           $    $               $    $  ANS000.BYTE066  $  y=x1;
  $  026:平均喷油脉宽                           $    $  毫秒         $    $  ANS000.BYTE069  $  y=x1*0.1;
  $  027:充电时间                               $    $  毫秒         $    $  ANS000.BYTE070  $  y=x1*0.1;
  $  028:1缸点火提前角                          $    $  °           $    $  ANS000.BYTE071  $  y=x1*0.50-64.0;
  $  029:燃油容积流量(升/小时)                  $    $  L/h          $    $  ANS000.BYTE072  $  y=(x1*256+x2)/65536.00*140.625;
  $  030:爆震传感器信号1                        $    $  V            $    $  ANS000.BYTE074  $  y=(x1*256+x2)/1000.00*19.5313;
  $  031:爆震传感器信号2                        $    $  V            $    $  ANS000.BYTE076  $  y=(x1*256+x2)/1000.00*19.5313;
  $  032:1缸推迟点火暴震控制                    $    $  °           $    $  ANS000.BYTE078  $  y=x1*191.25/255;
  $  033:2缸推迟点火暴震控制                    $    $  °           $    $  ANS000.BYTE079  $  y=x1*0.75;
  $  034:3缸推迟点火暴震控制                    $    $  °           $    $  ANS000.BYTE080  $  y=x1*0.75;
  $  035:4缸推迟点火暴震控制                    $    $  °           $    $  ANS000.BYTE081  $  y=x1*0.75;
  $  036:1组氧传感器积分值(短期修正)            $    $  %            $    $  ANS000.BYTE084  $  y=x1*0.0078;
  $  037:1组氧传感器电压(传感器1)               $    $  V            $    $  ANS000.BYTE086  $  y=x1*0.0195;
  $  038:1组氧传感器电压(传感器2)               $    $  V            $    $  ANS000.BYTE087  $  y=x1*0.0195;
  $  039:1组氧传感器积分值(长期修正)            $    $  %            $    $  ANS000.BYTE090  $  y=x1*0.0078;
  $  040:模式进气温度                           $    $  degree C     $    $  ANS000.BYTE095  $  y=x1*0.75-48;
  $  041:发动机相对负荷                         $    $  %            $    $  ANS000.BYTE096  $  y=x1*6.0;
  $  042:怠速扭矩自学习                         $    $  %            $    $  ANS000.BYTE097  $  if(((x1*256 + x2)>=0)&&((x1*256 + x2)<=32767)) y=(x1*256 + x2)*100/32768.00;else if(((x1*256 + x2)>=32768)&&((x1*256 + x2)<=65535)) y=(x1*256+ x2-65536)*100/32768.00;
  $  043:怠速转速控制目标扭矩修正               $    $  %            $    $  ANS000.BYTE098  $  if(x1<128) y=x1/128.0*100.0;else y=(x1-255.0)/128.0*100.0;
  $  044:碳罐控制阀占空比                       $    $  %            $    $  ANS000.BYTE099  $  y=x1*100.0/256.00;
  $  045:碳罐控制的相对喷油量                   $    $  %            $    $  ANS000.BYTE100  $  y=3061.22/255.0*x1;
  $  046:碳罐净化率                             $    $               $    $  ANS000.BYTE101  $  y=x1*0.5/256.00;
  $  047:碳罐负荷                               $    $               $    $  ANS000.BYTE102  $  if(x1<0x7f) y=63.0/126.0*x1;else y=(x1-255)*63.0/126.0;
  $  048:进气阀开度(相对于LWOT)                 $    $  °           $    $  ANS000.BYTE117  $  y=x1*0.50;
  $  049:废气阀关度(相对于LWOT)                 $    $  °           $    $  ANS000.BYTE118  $  y=x1*0.50;
  $  050:凸轮轴重叠角                           $    $  °           $    $  ANS000.BYTE119  $  y=x1*0.50;
  $  051:进气凸轮轴重叠系数                     $    $               $    $  ANS000.BYTE120  $  y=x1*1.0/255.0;
  $  052:废气凸轮轴重叠系数                     $    $               $    $  ANS000.BYTE121  $  y=x1*1.0/255.0;
  $  053:排气凸轮轴输出PWM(脉宽调制)信号        $    $  %            $    $  ANS000.BYTE123  $  y=x1*99.61/255.0;
  $  054:废气再循环系统                         $    $               $    $  ANS000.BYTE027  $  if(x1&0x04)y=@0006;else y=@0007;
  $  055:空调因温度断开                         $    $               $    $  ANS000.BYTE032  $  if(x1&0x10) y=@0000;else y=@0001;
  $  056:进气凸轮轴输出PWM(脉宽调制)信号        $    $               $    $  ANS000.BYTE122  $  y=x1*99.61/255.0;
  $  057:风扇PWM(脉宽调制)                      $    $               $    $  ANS000.BYTE024  $  if(x1&0x04)y=@01db;else y=@01dc;
  $  058:进气歧管空气流量传感器电压             $    $  V            $    $  ANS000.BYTE053  $  y=x1/256.0*5;
  $  059:进气歧管空气流量                       $    $  kg/h         $    $  ANS000.BYTE051  $  y=x1*25.6+x2*0.1;
  $  060:防盗处于初始状态                       $    $               $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0000;else y=@0001;
  $  061:Freestart次数用尽                      $    $               $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0000;else y=@0001;
  $  062:无发动机认可的CHALLENGE应答            $    $               $    $  ANS000.BYTE018  $  if(x1&0x04)y=@0000;else y=@0001;
  $  063:防盗系统状态                           $    $               $    $  ANS000.BYTE018  $  if(x1&0x08)y=@01de;else y=@0022;
  $  064:安全等级0                              $    $               $    $  ANS000.BYTE018  $  if(x1&0x10)y=@01db;else y=@01dc;
  $  065:安全等级1                              $    $               $    $  ANS000.BYTE018  $  if(x1&0x20)y=@01db;else y=@01dc;
  $  066:安全等级2                              $    $               $    $  ANS000.BYTE018  $  if(x1&0x40)y=@01db;else y=@01dc;
  $  067:安全等级3                              $    $               $    $  ANS000.BYTE018  $  if(x1&0x80)y=@01db;else y=@01dc;
  $  068:安全代码编程状态                       $    $               $    $  ANS000.BYTE021  $  if(x1&0x01)y=@01d9;else y=@01da;
  $  069:安全代码输入                           $    $               $    $  ANS000.BYTE021  $  if(x1&0x02)y=@01df;else y=@01e0;
  $  070:安全代码锁定功能                       $    $               $    $  ANS000.BYTE021  $  if(x1&0x04)y=@01dd;else y=@0007;
  $  071:安全等级0                              $    $               $    $  ANS000.BYTE021  $  if(x1&0x10)y=@01db;else y=@01dc;
  $  072:安全等级1                              $    $               $    $  ANS000.BYTE021  $  if(x1&0x20)y=@01db;else y=@01dc;
  $  073:安全等级2                              $    $               $    $  ANS000.BYTE021  $  if(x1&0x40)y=@01db;else y=@01dc;
  $  074:安全等级3                              $    $               $    $  ANS000.BYTE021  $  if(x1&0x80)y=@01db;else y=@01dc;
  $  075:安全进入                               $    $               $    $  ANS000.BYTE022  $  if(x1&0x01)y=@01dd;else y=@0007;
  $  076:变量字                                 $    $               $    $  ANS000.BYTE022  $  if(x1&0x02)y=@01d9;else y=@01da;
  $  077:CAN车辆配置                            $    $               $    $  ANS000.BYTE022  $  if(x1&0x04)y=@01d9;else y=@01da;
  $  078:VIN码                                  $    $               $    $  ANS000.BYTE022  $  if(x1&0x08)y=@01d9;else y=@01da;
  $  079:动力总成数据                           $    $               $    $  ANS000.BYTE022  $  if(x1&0x10)y=@01d9;else y=@01da;
  $  080:风扇#1                                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x01)y=@01db;else y=@01dc;
  $  081:风扇#2                                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x02)y=@01db;else y=@01dc;
  $  082:点火开关                               $    $               $    $  ANS000.BYTE025  $  if(x1&0x01)y=@01db;else y=@01dc;
  $  083:主继电器                               $    $               $    $  ANS000.BYTE025  $  if(x1&0x02)y=@01d7;else y=@01d8;
  $  084:燃油泵继电器                           $    $               $    $  ANS000.BYTE025  $  if(x1&0x04)y=@01d7;else y=@01d8;
  $  085:启动马达                               $    $               $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0000;else y=@0001;
  $  086:怠速运行                               $    $               $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0000;else y=@0001;
  $  087:同步条件                               $    $               $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0000;else y=@0001;
  $  088:达到发动机工作温度                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0000;else y=@0001;
  $  089:车速信号                               $    $               $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0000;else y=@0001;
  $  090:节气门怠速位置                         $    $               $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0000;else y=@0001;
  $  091:节气门全开                             $    $               $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0000;else y=@0001;
  $  092:减速燃油切断                           $    $               $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0000;else y=@0001;
  $  093:加速燃油增浓                           $    $               $    $  ANS000.BYTE026  $  if(x1&0x10) y=@0000;else y=@0001;
  $  094:空燃比调节                             $    $               $    $  ANS000.BYTE027  $  if(x1&0x01)y=@0006;else y=@0007;
  $  095:碳罐控制阀                             $    $               $    $  ANS000.BYTE027  $  if(x1&0x08)y=@0006;else y=@0007;
  $  096:减速断油                               $    $               $    $  ANS000.BYTE027  $  if(x1&0x10)y=@0006;else y=@0007;
  $  097:催化剂保护加浓                         $    $               $    $  ANS000.BYTE027  $  if(x1&0x20)y=@0006;else y=@0007;
  $  098:混合气自学习条件                       $    $               $    $  ANS000.BYTE027  $  if(x1&0x40)y=@0006;else y=@0007;
  $  099:氧传感器1信号                          $    $               $    $  ANS000.BYTE028  $  if(x1&0x01)y=@0008;else y=@0009;
  $  100:氧传感器2信号                          $    $               $    $  ANS000.BYTE028  $  if(x1&0x02)y=@0008;else y=@0009;
  $  101:氧传感器1加热                          $    $               $    $  ANS000.BYTE028  $  if(x1&0x10)y=@0006;else y=@0007;
  $  102:氧传感器2加热                          $    $               $    $  ANS000.BYTE028  $  if(x1&0x20)y=@0006;else y=@0007;
  $  103:踏板位置确认怠速                       $    $               $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0000;else y=@0001;
  $  104:电气负载1                              $    $               $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0000;else y=@0001;
  $  105:电气负载2                              $    $               $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0000;else y=@0001;
  $  106:故障灯激活                             $    $               $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0000;else y=@0001;
  $  107:故障灯闪烁                             $    $               $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0000;else y=@0001;
  $  108:维修灯激活                             $    $               $    $  ANS000.BYTE030  $  if(x1&0x10) y=@0000;else y=@0001;
  $  109:维修灯闪烁                             $    $               $    $  ANS000.BYTE030  $  if(x1&0x20)y=@0000;else y=@0001;
  $  110:维修灯故障                             $    $               $    $  ANS000.BYTE030  $  if(x1&0x40)y=@0000;else y=@0001;
  $  111:节气门位置错误                         $    $               $    $  ANS000.BYTE031  $  if(x1&0x01)y=@0000;else y=@0001;
  $  112:电子节气门电源故障                     $    $               $    $  ANS000.BYTE031  $  if(x1&0x02)y=@0000;else y=@0001;
  $  113:空调开关                               $    $               $    $  ANS000.BYTE032  $  if(x1&0x01)y=@009f;else y=@00a0;
  $  114:空调请求                               $    $               $    $  ANS000.BYTE032  $  if(x1&0x02)y=@009f;else y=@00a0;
  $  115:空调压缩机                             $    $               $    $  ANS000.BYTE032  $  if(x1&0x01)y=@009f;else y=@00a0;
  $  116:空调断开或无空调                       $    $               $    $  ANS000.BYTE032  $  if(x1&0x08)y=@0000;else y=@0001;
  $  117:空调因温度断开                         $    $               $    $  ANS000.BYTE032  $  if(x1&0x10) y=@0000;else y=@0001;
  $  118:怠速转速因空调而增加                   $    $               $    $  ANS000.BYTE032  $  if(x1&0x20)y=@0000;else y=@0001;
  $  119:全负荷时关闭空调压缩机(无延迟)         $    $               $    $  ANS000.BYTE032  $  if(x1&0x40)y=@0000;else y=@0001;
  $  120:空调中压开关                           $    $               $    $  ANS000.BYTE032  $  if(x1&0x80)y=@0000;else y=@0001;

;******************************************************************************************************************************************************

