
    车型ID：a305

    模拟：协议模拟-->a305

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 02 19 FF 00 00 00 00 00       $#  ANS000:7E8 02 19 FF 00 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE5$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a3050000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 90 00 00 00 00       $%  ANS000:7E8 03 22 F1 90 00 00 00 00
  $%  REQ001:7E0 03 22 F1 94 00 00 00 00       $%  ANS001:7E8 03 22 F1 94 00 00 00 00
  $%  REQ002:7E0 03 22 F1 92 00 00 00 00       $%  ANS002:7E8 03 22 F1 92 00 00 00 00
  $%  REQ003:7E0 03 22 F1 95 00 00 00 00       $%  ANS003:7E8 03 22 F1 95 00 00 00 00
  $%  REQ004:7E0 03 22 F1 8B 00 00 00 00       $%  ANS004:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E0 03 22 F1 99 00 00 00 00       $%  ANS005:7E8 03 22 F1 99 00 00 00 00

  $%  000:VIN:               $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:软件编号:          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:硬件编号:          $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  003:软件版本号:        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2);
  $%  004:生产日期:          $%    $%  ANS004.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  005:编程日期:          $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.动态数据
  $  00.动态数据
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:故障码数目                             $    $                  $    $  ANS000.BYTE004  $  y=x1;
  $  001:车速                                   $    $  km/h            $    $  ANS000.BYTE040  $  y=x1;
  $  002:发动机转速                             $    $  rpm             $    $  ANS000.BYTE036  $  y=x1*64+x2/4;
  $  003:目标怠速                               $    $  rpm             $    $  ANS000.BYTE039  $  y=x1*10;
  $  004:电源电压                               $    $  V               $    $  ANS000.BYTE035  $  y=x1/10.0;
  $  005:点火提前角                             $    $  °              $    $  ANS000.BYTE065  $  y=x1-50;
  $  006:目标增压压力                           $    $  kpa             $    $  ANS000.BYTE113  $  y=x1;
  $  007:进气压力                               $    $  kpa             $    $  ANS000.BYTE046  $  y=x1;
  $  008:实际增压压力                           $    $  kpa             $    $  ANS000.BYTE115  $  y=x1;
  $  009:进气流量                               $    $  kg/h            $    $  ANS000.BYTE047  $  y=x1*25.6+x2/10.0;
  $  010:ETC(电子节气门)目标开度                $    $  %               $    $  ANS000.BYTE049  $  y=x1*25.6+x2/10.0;
  $  011:ETC(电子节气门)实际开度                $    $  %               $    $  ANS000.BYTE055  $  y=x1*25.6+x2/10.0;
  $  012:冷却液温度                             $    $  degree C        $    $  ANS000.BYTE042  $  y=x1-40;
  $  013:散热器出口位置                         $    $  degree C        $    $  ANS000.BYTE119  $  y=x1-40;
  $  014:进气温度                               $    $  degree C        $    $  ANS000.BYTE044  $  y=x1-40;
  $  015:增压气体温度                           $    $  degree C        $    $  ANS000.BYTE117  $  y=x1-40;
  $  016:加速踏板位置                           $    $  %               $    $  ANS000.BYTE105  $  y=x1*25.6+x2/10.0;
  $  017:目标油压                               $    $  bar             $    $  ANS000.BYTE108  $  y=x1;
  $  018:实际油压                               $    $  bar             $    $  ANS000.BYTE110  $  y=x1;
  $  019:充磁时间                               $    $  ms              $    $  ANS000.BYTE063  $  y=x1/10.0;
  $  020:喷油脉宽                               $    $  ms              $    $  ANS000.BYTE064  $  y=x1/10.0;
  $  021:碳罐阀占空比                           $    $  %               $    $  ANS000.BYTE062  $  y=x1*100.0/255;
  $  022:无极风扇占空比                         $    $  %               $    $  ANS000.BYTE102  $  y=x1*100.0/255;
  $  023:交流发电机负荷                         $    $  %               $    $  ANS000.BYTE107  $  y=x1*100.0/255;
  $  024:油压调节阀占空比                       $    $  %               $    $  ANS000.BYTE111  $  y=x1*100.0/255;
  $  025:增压压力限制阀占空比                   $    $  %               $    $  ANS000.BYTE122  $  y=x1*100.0/255;
  $  026:运行里程                               $    $  km              $    $  ANS000.BYTE092  $  y=x1*16777216+x2*65536+x3*256+x4;
  $  027:运行时间                               $    $  小时 : 分钟     $    $  ANS000.BYTE096  $  if(x1<0x80)y=SPRINTF([%d%s%d],((x1*16777216+x2*65536+x3*256+x4)/60),@01d5,((x1*16777216+x2*65536+x3*256+x4)%60));else y=0;
  $  028:大气压力值                             $    $  kpa             $    $  ANS000.BYTE120  $  y=x1;
  $  029:空调压力                               $    $  mpa             $    $  ANS000.BYTE067  $  y=x1*256/1000.000+x2/1000.000;
  $  030:爆震传感器                             $    $                  $    $  ANS000.BYTE069  $  y=x1*256+x2;
  $  031:ETC(电子节气门)电机PWM(脉宽调制)       $    $  %               $    $  ANS000.BYTE058  $  y=x1*100.0/255;
  $  032:氧传感器1                              $    $  V               $    $  ANS000.BYTE081  $  y=x1/255.00;
  $  033:氧传感器2                              $    $  V               $    $  ANS000.BYTE082  $  y=x1/255.00;
  $  034:ETC(电子节气门)位置传感器1             $    $  V               $    $  ANS000.BYTE051  $  y=x1*4.98/255+x2*0.02/255;
  $  035:ETC(电子节气门)位置传感器2             $    $  V               $    $  ANS000.BYTE053  $  y=x1*4.98/255+x2*0.02/255;
  $  036:进气压力传感器                         $    $  V               $    $  ANS000.BYTE045  $  y=x1*5/255.0;
  $  037:进气温度传感器                         $    $  V               $    $  ANS000.BYTE043  $  y=x1*5/255.0;
  $  038:冷却液温度传感器                       $    $  V               $    $  ANS000.BYTE041  $  y=x1*5/255.0;
  $  039:增压压力传感器                         $    $  V               $    $  ANS000.BYTE114  $  y=x1*5/255.0;
  $  040:增压气体温度传感器                     $    $  V               $    $  ANS000.BYTE116  $  y=x1*5/255.0;
  $  041:散热器出口温度传感器                   $    $  V               $    $  ANS000.BYTE118  $  y=x1*5/255.0;
  $  042:油压传感器                             $    $  V               $    $  ANS000.BYTE109  $  y=x1*5/255.0;
  $  043:空调压力传感器                         $    $  V               $    $  ANS000.BYTE066  $  y=x1*5/255.0;
  $  044:加速踏板1信号                          $    $  V               $    $  ANS000.BYTE103  $  y=x1*5/255.0;
  $  045:加速踏板2信号                          $    $  V               $    $  ANS000.BYTE104  $  y=x1*5/255.0;
  $  046:1缸推迟点火爆震控制                    $    $  °              $    $  ANS000.BYTE073  $  y=x1/10.0;
  $  047:2缸推迟点火爆震控制                    $    $  °              $    $  ANS000.BYTE074  $  y=x1/10.0;
  $  048:3缸推迟点火爆震控制                    $    $  °              $    $  ANS000.BYTE075  $  y=x1/10.0;
  $  049:4缸推迟点火爆震控制                    $    $  °              $    $  ANS000.BYTE076  $  y=x1/10.0;
  $  050:海拔校正                               $    $  %               $    $  ANS000.BYTE121  $  y=x1*100.0/255;
  $  051:实际进气相位                           $    $  °              $    $  ANS000.BYTE124  $  y=x1*256+x2-100;
  $  052:目标进气相位                           $    $  °              $    $  ANS000.BYTE126  $  y=x1*256+x2-100;
  $  053:燃油短期修正值                         $    $                  $    $  ANS000.BYTE079  $  y=x1*2.0/256;
  $  054:燃油长期修正值                         $    $                  $    $  ANS000.BYTE085  $  y=x1*2.0/256;
  $  055:空燃比                                 $    $                  $    $  ANS000.BYTE128  $  y=x1/10.0;
  $  056:怠速流量控制                           $    $                  $    $  ANS000.BYTE129  $  y=x1*256+x2;
  $  057:凸轮轴相位                             $    $  °              $    $  ANS000.BYTE131  $  y=x1*256+x2-100;
  $  058:厂家数据1                              $    $                  $    $  ANS000.BYTE077  $  y=x1*256+x2;
  $  059:倾角信息                               $    $  °              $    $  ANS000.BYTE133  $  if(x1<0xF1) y=x1*120.0/240.0-60.0;else y=@009a;
  $  060:制动助力器压力                         $    $  kpa             $    $  ANS000.BYTE112  $  y=x1;
  $  061:巡航设定车速                           $    $  km/h            $    $  ANS000.BYTE142  $  y=x1;
  $  062:巡航开关电压                           $    $  V               $    $  ANS000.BYTE143  $  y=x1*5.0/255;

  $)  01.系统状态
  $  01.系统状态
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:点火电源开启                          $    $       $    $  ANS000.BYTE024  $  if(x1&0x01) y=@0000; else y=@0001;
  $  001:主继电器工作                          $    $       $    $  ANS000.BYTE024  $  if(x1&0x02) y=@0000; else y=@0001;
  $  002:燃油泵状态                            $    $       $    $  ANS000.BYTE024  $  if(x1&0x04) y=@0004; else y=@0005;
  $  003:ETC(电子节气门)处于怠速位置           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0000; else y=@0001;
  $  004:ETC(电子节气门)处于部分打开位置       $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0000; else y=@0001;
  $  005:ETC(电子节气门)处于全打开位置         $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0000; else y=@0001;
  $  006:激活减速断油                          $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0006; else y=@0007;
  $  007:激活加速加浓                          $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0006; else y=@0007;
  $  008:MIL(故障指示灯)激活                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0006; else y=@0007;
  $  009:MIL(故障指示灯)闪烁                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0000; else y=@0001;
  $  010:SVS(系统维修指示灯)激活               $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0006; else y=@0007;
  $  011:SVS(系统维修指示灯)闪烁               $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0000; else y=@0001;
  $  012:氧传感器1信号                         $    $       $    $  ANS000.BYTE027  $  if(x1&0x01) y=@0008; else y=@0009;
  $  013:氧传感器2信号                         $    $       $    $  ANS000.BYTE027  $  if(x1&0x02) y=@0008; else y=@0009;
  $  014:氧传感器1加热                         $    $       $    $  ANS000.BYTE027  $  if(x1&0x10) y=@000a; else y=@000b;
  $  015:氧传感器2加热                         $    $       $    $  ANS000.BYTE027  $  if(x1&0x20) y=@000a; else y=@000b;
  $  016:燃油反馈状态                          $    $       $    $  ANS000.BYTE034  $  if(x1&0x40) y=@006c; else y=@006d;
  $  017:加速踏板处于怠速位置                  $    $       $    $  ANS000.BYTE028  $  if(x1&0x01) y=@0000; else y=@0001;
  $  018:制动踏板状态                          $    $       $    $  ANS000.BYTE028  $  if(x1&0x02) y=@0062; else y=@0063;
  $  019:是否有空调请求                        $    $       $    $  ANS000.BYTE028  $  if(x1&0x04) y=@0000; else y=@0001;
  $  020:后车窗/前挡风玻璃加热                 $    $       $    $  ANS000.BYTE028  $  if(x1&0x08) y=@0004; else y=@0005;
  $  021:动力转向开关                          $    $       $    $  ANS000.BYTE028  $  if(x1&0x10) y=@0004; else y=@0005;
  $  022:防盗锁定状态                          $    $       $    $  ANS000.BYTE034  $  if(x1&0x20) y=@0064; else y=@0065;
  $  023:刹车开关激活                          $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@0006; else y=@0007;
  $  024:刹车灯激活                            $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@0006; else y=@0007;
  $  025:离合器开关激活                        $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@0006; else y=@0007;
  $  026:水泵继电器状态                        $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@0004; else y=@0005;
  $  027:进气旁通阀                            $    $       $    $  ANS000.BYTE034  $  if(x1&0x10) y=@0004; else y=@0005;
  $  028:空调请求激活                          $    $       $    $  ANS000.BYTE031  $  if(x1&0x02) y=@0006; else y=@0007;
  $  029:空调压缩机开                          $    $       $    $  ANS000.BYTE031  $  if(x1&0x04) y=@0000; else y=@0001;
  $  030:怠速转速因空调而增加                  $    $       $    $  ANS000.BYTE031  $  if(x1&0x20) y=@0000; else y=@0001;
  $  031:全负荷时关闭空调压缩机                $    $       $    $  ANS000.BYTE031  $  if(x1&0x40) y=@0000; else y=@0001;
  $  032:空调中压开关开                        $    $       $    $  ANS000.BYTE031  $  if(x1&0x80) y=@0000; else y=@0001;
  $  033:低速风扇开启                          $    $       $    $  ANS000.BYTE023  $  if(x1&0x01) y=@0000; else y=@0001;
  $  034:高速风扇开启                          $    $       $    $  ANS000.BYTE023  $  if(x1&0x02) y=@0000; else y=@0001;
  $  035:风扇类型                              $    $       $    $  ANS000.BYTE023  $  if(x1&0x08) y=@009e; else if(x1&0x04) y=@01d3; else y=@01d2;
  $  036:巡航功能                              $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0004; else y=@0005;
  $  037:巡航状态                              $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@00e6; else y=@0048;
  $  038:按键状态                              $    $       $    $  ANS000.BYTE033  $  if((x1&0x1F)<4) y=@0066;else if((x1&0x1F)<8) y=@0067;else if((x1&0x1F)<0x0C) y=@0068;else if((x1&0x1F)<0x10) y=@01d4;else if((x1&0x1F)<0x14) y=@006a;else if((x1&0x1F)<0x18) y=@01d6;else y=@0076;
  $  039:真空泵状态                            $    $       $    $  ANS000.BYTE028  $  if(x1&0x40) y=@0004; else y=@0005;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 01 04 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
