
    车型ID：a30a

    模拟：协议模拟-->a30a

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 02 19 FF 00 00 00 00 00       $#  ANS000:7E8 02 19 FF 00 00 00 00 00

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a30a0000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 90 00 00 00 00       $%  ANS000:7E8 03 22 F1 90 00 00 00 00
  $%  REQ001:7E0 03 22 F1 94 00 00 00 00       $%  ANS001:7E8 03 22 F1 94 00 00 00 00
  $%  REQ002:7E0 03 22 F1 92 00 00 00 00       $%  ANS002:7E8 03 22 F1 92 00 00 00 00
  $%  REQ003:7E0 03 22 F1 95 00 00 00 00       $%  ANS003:7E8 03 22 F1 95 00 00 00 00
  $%  REQ004:7E0 03 22 F1 8B 00 00 00 00       $%  ANS004:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E0 03 22 F1 99 00 00 00 00       $%  ANS005:7E8 03 22 F1 99 00 00 00 00

  $%  000:VIN:               $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:软件编号:          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:硬件编号:          $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  003:软件版本号:        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2);
  $%  004:生产日期:          $%    $%  ANS004.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  005:编程日期:          $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.动态数据
  $  00.动态数据
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:故障码数目                             $    $               $    $  ANS000.BYTE004  $  y=x1;
  $  001:车速                                   $    $  km/h         $    $  ANS000.BYTE040  $  y=x1;
  $  002:发动机转速                             $    $  rpm          $    $  ANS000.BYTE036  $  if((x1*64+x2*63/255)<64) y=0;else y=x1*64+x2*63/255;
  $  003:目标怠速                               $    $  rpm          $    $  ANS000.BYTE039  $  y=x1*10;
  $  004:电源电压                               $    $  V            $    $  ANS000.BYTE035  $  y=x1/10.0;
  $  005:点火提前角                             $    $  度           $    $  ANS000.BYTE065  $  y=x1-50;
  $  006:进气压力                               $    $  kPa          $    $  ANS000.BYTE046  $  y=x1;
  $  007:进气流量                               $    $  kg/h         $    $  ANS000.BYTE047  $  y=x1*25.6+x2*0.1;
  $  008:ETC(电子节气门)目标开度                $    $  %            $    $  ANS000.BYTE049  $  y=x1*25.6+x2*0.1;
  $  009:ETC(电子节气门)实际开度                $    $  %            $    $  ANS000.BYTE055  $  y=x1*25.6+x2*0.1;
  $  010:冷却液温度                             $    $  degree C     $    $  ANS000.BYTE042  $  y=x1-40;
  $  011:进气温度                               $    $  degree C     $    $  ANS000.BYTE044  $  y=x1-40;
  $  012:加速踏板位置                           $    $  %            $    $  ANS000.BYTE105  $  y=x1*25.6+x2*0.1;
  $  013:制动助力器压力                         $    $  kPa          $    $  ANS000.BYTE112  $  y=x1;
  $  014:电池温度                               $    $  degree C     $    $  ANS000.BYTE168  $  y=x1-40;
  $  015:电池传感器电压                         $    $  V            $    $  ANS000.BYTE157  $  y=x1/100.00;
  $  016:环境温度                               $    $  degree C     $    $  ANS000.BYTE169  $  y=x1-40;
  $  017:电池电量                               $    $  %            $    $  ANS000.BYTE165  $  y=x1 * 100/255;
  $  018:充磁时间                               $    $  毫秒         $    $  ANS000.BYTE063  $  y=x1/10.0;
  $  019:喷油脉宽                               $    $  毫秒         $    $  ANS000.BYTE064  $  y=x1/10.0;
  $  020:碳罐阀占空比                           $    $  %            $    $  ANS000.BYTE062  $  y=x1*100.0/255;
  $  021:燃油位置输出                           $    $  L            $    $  ANS000.BYTE138  $  y=x1;
  $  022:运行里程                               $    $  km           $    $  ANS000.BYTE092  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  023:运行时间                               $    $  分钟         $    $  ANS000.BYTE096  $  y=(x1*16777216)+(x2*65536)+(x3*256)+x4;
  $  024:故障里程                               $    $               $    $  ANS000.BYTE134  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  025:大气压力值                             $    $  kPa          $    $  ANS000.BYTE120  $  y=x1;
  $  026:EGR(废气再循环)开度                    $    $  %            $    $  ANS000.BYTE139  $  y=x1*25.6+x2*0.1;
  $  027:爆震传感器                             $    $               $    $  ANS000.BYTE069  $  y=x1*256 + x2;
  $  028:ETC(电子节气门)电机PWM(脉宽调制)       $    $  %            $    $  ANS000.BYTE058  $  y=x1*100.0/255;
  $  029:氧传感器1                              $    $  V            $    $  ANS000.BYTE081  $  y=x1*1.00/255;
  $  030:氧传感器2                              $    $  V            $    $  ANS000.BYTE082  $  y=x1*1.00/255;
  $  031:ETC(电子节气门)位置传感器1             $    $  V            $    $  ANS000.BYTE051  $  y=x1*4.98/255+x2*0.01/132;
  $  032:ETC(电子节气门)位置传感器2             $    $  V            $    $  ANS000.BYTE053  $  y=x1*4.98/255+x2*0.01/132;
  $  033:进气压力传感器                         $    $  V            $    $  ANS000.BYTE045  $  y=x1*5.0/255;
  $  034:进气温度传感器                         $    $  V            $    $  ANS000.BYTE043  $  y=x1*5.0/255;
  $  035:冷却液温度传感器                       $    $  V            $    $  ANS000.BYTE041  $  y=x1*5.0/255;
  $  036:加速踏板1信号                          $    $  V            $    $  ANS000.BYTE103  $  y=x1*5.0/255;
  $  037:加速踏板2信号                          $    $  V            $    $  ANS000.BYTE104  $  y=x1*5.0/255;
  $  038:EGR(废气再循环)阀位置传感器电压        $    $  V            $    $  ANS000.BYTE141  $  y=x1*5.0/255;
  $  039:1缸推迟点火爆震控制                    $    $  度           $    $  ANS000.BYTE073  $  y=x1/10.0;
  $  040:2缸推迟点火爆震控制                    $    $  度           $    $  ANS000.BYTE074  $  y=x1/10.0;
  $  041:3缸推迟点火爆震控制                    $    $  度           $    $  ANS000.BYTE075  $  y=x1/10.0;
  $  042:4缸推迟点火爆震控制                    $    $  度           $    $  ANS000.BYTE076  $  y=x1/10.0;
  $  043:燃油短期修正值                         $    $               $    $  ANS000.BYTE079  $  y=x1*1.99/255;
  $  044:燃油长期修正值                         $    $               $    $  ANS000.BYTE085  $  y=x1*1.99/255;
  $  045:空燃比                                 $    $               $    $  ANS000.BYTE128  $  y=x1/10.0;

  $)  01.发动机稳态工况
  $  01.发动机稳态工况
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:点火电源开启       $    $       $    $  ANS000.BYTE024  $  if(x1&0x01) y=@0000; else y=@0001;
  $  001:主继电器工作       $    $       $    $  ANS000.BYTE024  $  if(x1&0x02) y=@0000; else y=@0001;
  $  002:燃油泵状态         $    $       $    $  ANS000.BYTE024  $  if(x1&0x04) y=@0004; else y=@0005;

  $)  02.发动机动态工况
  $  02.发动机动态工况
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:ETC(电子节气门)处于怠速位置           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0000; else y=@0001;
  $  001:ETC(电子节气门)处于部分打开位置       $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0000; else y=@0001;
  $  002:ETC(电子节气门)处于全开位置           $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0000; else y=@0001;
  $  003:激活减速断油                          $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0006; else y=@0007;
  $  004:激活加速加浓                          $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0006; else y=@0007;
  $  005:档位状态                              $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0133; else if(x1&0x40)y=@00c7; else if(x1&0x80)y=@00c8;else y=@00d6;

  $)  03.指示灯SVS/MIL
  $  03.指示灯SVS/MIL
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:MIL(故障指示灯)激活           $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0006; else y=@0007;
  $  001:MIL(故障指示灯)闪烁           $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0000; else y=@0001;
  $  002:SVS(系统维修指示灯)激活       $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0006; else y=@0007;
  $  003:SVS(系统维修指示灯)闪烁       $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0000; else y=@0001;

  $)  04.氧传感器
  $  04.氧传感器
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:氧传感器1信号              $    $       $    $  ANS000.BYTE027  $  if(x1&0x01) y=@0008; else y=@0009;
  $  001:氧传感器2信号              $    $       $    $  ANS000.BYTE027  $  if(x1&0x02) y=@0008; else y=@0009;
  $  002:氧传感器1加热              $    $       $    $  ANS000.BYTE027  $  if(x1&0x10) y=@000a; else y=@000b;
  $  003:氧传感器2加热              $    $       $    $  ANS000.BYTE027  $  if(x1&0x20) y=@000a; else y=@000b;
  $  004:燃油反馈状态               $    $       $    $  ANS000.BYTE034  $  if(x1&0x40) y=@006c; else y=@006d;
  $  005:加速踏板处于怠速位置       $    $       $    $  ANS000.BYTE028  $  if(x1&0x01) y=@0000; else y=@0001;
  $  006:制动踏板状态               $    $       $    $  ANS000.BYTE028  $  if(x1&0x02) y=@0062; else y=@0063;
  $  007:是否有空调请求             $    $       $    $  ANS000.BYTE028  $  if(x1&0x04) y=@0000; else y=@0001;
  $  008:动力转向开关               $    $       $    $  ANS000.BYTE028  $  if(x1&0x08) y=@0004; else y=@0005;
  $  009:防盗锁定状态               $    $       $    $  ANS000.BYTE034  $  if(x1&0x20) y=@0064; else y=@0065;
  $  010:刹车开关激活               $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@0006; else y=@0007;
  $  011:刹车灯激活                 $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@0006; else y=@0007;
  $  012:可变气门升程伐状态         $    $       $    $  ANS000.BYTE034  $  if(x1&0x80) y=@0004; else y=@0005;

  $)  05.空调系统
  $  05.空调系统
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:空调请求激活                 $    $       $    $  ANS000.BYTE031  $  if(x1&0x02) y=@0006; else y=@0007;
  $  001:空调压缩机开                 $    $       $    $  ANS000.BYTE031  $  if(x1&0x04) y=@0000; else y=@0001;
  $  002:怠速转速因空调而增加         $    $       $    $  ANS000.BYTE031  $  if(x1&0x20) y=@0000; else y=@0001;
  $  003:全负荷时关闭空调压缩机       $    $       $    $  ANS000.BYTE031  $  if(x1&0x40) y=@0000; else y=@0001;
  $  004:空调中压开关                 $    $       $    $  ANS000.BYTE031  $  if(x1&0x20) y=@0000; else y=@0001;

  $)  06.发动机防盗解锁状态
  $  06.发动机防盗解锁状态
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:ECU发送码验证结果        $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@001b; else y=@001a;
  $  001:IKEY发送码验证结果       $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@001b; else y=@001a;
  $  002:ECU新旧状态              $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@0060; else y=@0061;

  $)  07.发动机冷却系统
  $  07.发动机冷却系统
  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000:低速风扇开启             $    $       $    $  ANS000.BYTE023  $  if(x1&0x01) y=@0000; else y=@0001;
  $  001:高速风扇开启             $    $       $    $  ANS000.BYTE023  $  if(x1&0x02) y=@0000; else y=@0001;
  $  002:启停功能主开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@003b; else y=@0005;
  $  003:AC关联                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0222; else y=@0223;
  $  004:车速条件                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@0220; else y=@0221;
  $  005:水温条件                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@0220; else y=@0221;
  $  006:室外温度条件             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@0220; else y=@0221;
  $  007:空调条件                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@0220; else y=@0221;
  $  008:电池能力条件             $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@0220; else y=@0221;
  $  009:真空度条件               $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@0220; else y=@0221;
  $  010:安全条件导致失效         $    $       $    $  ANS000.BYTE019  $  if(x1&0x01) y=@0220; else y=@0221;
  $  011:发动机故障导致失效       $    $       $    $  ANS000.BYTE019  $  if(x1&0x02) y=@0220; else y=@0221;
  $  012:前舱盖条件               $    $       $    $  ANS000.BYTE019  $  if(x1&0x04) y=@0220; else y=@0221;
  $  013:左前门条件               $    $       $    $  ANS000.BYTE019  $  if(x1&0x08) y=@0220; else y=@0221;
  $  014:拖动无超时               $    $       $    $  ANS000.BYTE019  $  if(x1&0x10) y=@0220; else y=@0221;
  $  015:节气门无故障             $    $       $    $  ANS000.BYTE019  $  if(x1&0x20) y=@0220; else y=@0221;
  $  016:水温无故障               $    $       $    $  ANS000.BYTE019  $  if(x1&0x40) y=@0220; else y=@0221;
  $  017:进气压力无故障           $    $       $    $  ANS000.BYTE019  $  if(x1&0x80) y=@0220; else y=@0221;

  $)  08.诊断实际检测率(IUPR)
  $  08.诊断实际检测率(IUPR)
  $  REQ000:7E0 03 22 F1 04 00 00 00 00       $  ANS000:7E8 03 22 F1 04 00 00 00 00

  $  000:一般监测条件满足次数                     $    $  次     $    $  ANS000.BYTE004  $  y=x1*256 + x2;
  $  001:点火循环次数                             $    $  次     $    $  ANS000.BYTE006  $  y=x1*256 + x2;
  $  002:三元催化器监测完成次数                   $    $  次     $    $  ANS000.BYTE008  $  y=x1*256 + x2;
  $  003:三元催化器监测条件满足次数               $    $  次     $    $  ANS000.BYTE010  $  y=x1*256 + x2;
  $  004:前氧传感器监测完成次数                   $    $  次     $    $  ANS000.BYTE012  $  y=x1*256 + x2;
  $  005:前氧传感器监测条件满足次数               $    $  次     $    $  ANS000.BYTE014  $  y=x1*256 + x2;
  $  006:VVT(可变气门正时)监测完成次数            $    $  次     $    $  ANS000.BYTE016  $  y=x1*256 + x2;
  $  007:VVT(可变气门正时)监测条件满足次数        $    $  次     $    $  ANS000.BYTE018  $  y=x1*256 + x2;
  $  008:EVAP(燃油蒸发系统)监测完成次数           $    $  次     $    $  ANS000.BYTE020  $  y=x1*256 + x2;
  $  009:EVAP(燃油蒸发系统)监测条件满足次数       $    $  次     $    $  ANS000.BYTE022  $  y=x1*256 + x2;
  $  010:后氧传感器监测完成次数                   $    $  次     $    $  ANS000.BYTE024  $  y=x1*256 + x2;
  $  011:后氧传感器监测条件满足次数               $    $  次     $    $  ANS000.BYTE026  $  y=x1*256 + x2;
  $  012:增压系统监测完成次数                     $    $  次     $    $  ANS000.BYTE028  $  y=x1*256 + x2;
  $  013:增压系统监测条件满足次数                 $    $  次     $    $  ANS000.BYTE030  $  y=x1*256 + x2;
  $  014:燃油系统监测完成次数                     $    $  次     $    $  ANS000.BYTE032  $  y=x1*256 + x2;
  $  015:燃油系统监测条件满足次数                 $    $  次     $    $  ANS000.BYTE034  $  y=x1*256 + x2;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 01 04 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
