
    车型ID：5809

    模拟：协议模拟-->5809

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~774

进入命令:

  $~  REQ000:764 02 10 03 FF FF FF FF FF       $~  ANS000:774 02 10 03 FF FF FF FF FF

空闲命令:

  $!  REQ000:764 02 3E 00 FF FF FF FF FF       $!  ANS000:774 02 3E 00 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:764 03 19 02 09 FF FF FF FF       $#  ANS000:774 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/58060000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:764 04 14 FF FF FF FF FF FF       $$  ANS000:774 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:764 03 22 F1 91 FF FF FF FF       $%  ANS000:774 03 22 F1 91 FF FF FF FF
  $%  REQ001:764 03 22 F1 88 FF FF FF FF       $%  ANS001:774 03 22 F1 88 FF FF FF FF
  $%  REQ002:764 03 22 F1 8B FF FF FF FF       $%  ANS002:774 03 22 F1 8B FF FF FF FF
  $%  REQ003:764 03 22 F1 8C FF FF FF FF       $%  ANS003:774 03 22 F1 8C FF FF FF FF
  $%  REQ004:764 03 22 F1 9D FF FF FF FF       $%  ANS004:774 03 22 F1 9D FF FF FF FF
  $%  REQ005:764 03 22 F1 8A FF FF FF FF       $%  ANS005:774 03 22 F1 8A FF FF FF FF
  $%  REQ006:764 03 22 F1 87 FF FF FF FF       $%  ANS006:774 03 22 F1 87 FF FF FF FF
  $%  REQ007:764 03 22 F1 99 FF FF FF FF       $%  ANS007:774 03 22 F1 99 FF FF FF FF
  $%  REQ008:764 03 22 F1 B0 FF FF FF FF       $%  ANS008:774 03 22 F1 B0 FF FF FF FF
  $%  REQ009:764 03 22 F1 98 FF FF FF FF       $%  ANS009:774 03 22 F1 98 FF FF FF FF
  $%  REQ010:764 03 22 F1 80 FF FF FF FF       $%  ANS010:774 03 22 F1 80 FF FF FF FF
  $%  REQ011:764 03 22 F1 90 FF FF FF FF       $%  ANS011:774 03 22 F1 90 FF FF FF FF
  $%  REQ012:764 03 22 F1 B1 FF FF FF FF       $%  ANS012:774 03 22 F1 B1 FF FF FF FF

  $%  000:硬件版本号:                           $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  001:软件版本号:                           $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:ECU生产日期:                          $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  003:控制器序列号:                         $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  004:ECU装配日期:                          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  005:系统供应商代码:                       $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:整车零部件号:                         $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  007:刷新日期:                             $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  008:ICCID:                                $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  009:程序修复车间代码/测试者序列号:        $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:Boot版本号:                           $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  011:VIN:                                  $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  012:IMEI:                                 $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);

;******************************************************************************************************************************************************

读数据流: 

;  $  REQ000:764       $  ANS000:774

;  $  000.检测控制器工作信号                  $    $             $    $  ANS000.BYTE000  $  y=x&0x0f;
;  $  001.远程空调系统开启指令                $    $             $    $  ANS000.BYTE001  $  switxh(x&0x40) 0x40:y=@0151;default: y=@0330;
;  $  002.远程唤醒信号                        $    $             $    $  ANS000.BYTE001  $  switxh(x&0x80) 0x80:y=@0097;default: y=@0330;
;  $  003.远程空调系统状态                    $    $             $    $  ANS000.BYTE003  $  switxh(x&0x03) 0x00:y=@0192;0x01:y=@0010;0x02:y=@0048;0x03:y=@0007;default: y=@0007;
;  $  004.远程空调温度请求信号                $    $             $    $  ANS000.BYTE003  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0007;
;  $  005.远程空调AUTO请求指令                $    $             $    $  ANS000.BYTE004  $  switxh(x&0x03) 0x00:y=@0192;0x01:y=@0282;0x02:y=@0329;0x03:y=@0007;default: y=@0007;
;  $  006.远程空调PTC请求指令                 $    $             $    $  ANS000.BYTE004  $  switxh(x&0x0c) 0x00:y=@0192;0x04:y=@0284;0x08:y=@0285;0x0c:y=@0007;default: y=@0007;
;  $  007.远程空调AC请求指令                  $    $             $    $  ANS000.BYTE004  $  switxh(x&0x30) 0x00:y=@0192;0x10:y=@0327;0x20:y=@0328;0x30:y=@0007;default: y=@0007;
;  $  008.远程空调MAX前除霜除雾请求信号       $    $             $    $  ANS000.BYTE004  $  switxh(x&0xc0) 0x00:y=@0192;0x40:y=@0007;0x80:y=@0268;0xc0:y=@0007;default: y=@0007;
;  $  009.远程空调鼓风机档位                  $    $             $    $  ANS000.BYTE005  $  switxh(x&0x3c) 0x00:y=@0192;0x04:y=level 1;0x08:y=level 2;0x0c:y=level 3;0x10:y=level 4;0x14:y=level 5;0x18:y=level 6;0x1c:y=level 7;0x20:y=level off;default: y=@0007;
;  $  010.远程空调内循环开启请求信号          $    $             $    $  ANS000.BYTE005  $  switxh(x&0xc0) 0x00:y=@0192;0x40:y=@0100;0x80:y=@0326;0xc0:y=@0007;default: y=@0007;
;  $  011.方向盘旋转角度                      $    $  degree     $    $  ANS000.BYTE002  $  y=((x1*256+x2)/2)*0.1-1080;
;  $  012.AVM控制状态                         $    $             $    $  ANS000.BYTE004  $  switxh(x&0x08) 0x08:y=@0268;default: y=@0007;
;  $  013.AVM工作状态                         $    $             $    $  ANS000.BYTE004  $  switxh(x&0xe0) 0x00:y=@0200;0x20:y=@0255;0x40:y=@0256;0x60:y=@0257;0x80:y=@0258;0xa0:y=@0259;0xc0:y=@0260;0xe0:y=@0074;default: y=@0007;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:764 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
