
    车型ID：580b

    模拟：协议模拟-->580b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~773

进入命令:

  $~  REQ000:763 02 10 03 FF FF FF FF FF       $~  ANS000:773 02 10 03 FF FF FF FF FF

空闲命令:

  $!  REQ000:763 02 3E 00 FF FF FF FF FF       $!  ANS000:773 02 3E 00 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:763 03 19 02 09 FF FF FF FF       $#  ANS000:773 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/5c000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:763 04 14 FF FF FF FF FF FF       $$  ANS000:773 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:763 03 22 F1 95 FF FF FF FF       $%  ANS000:773 03 22 F1 95 FF FF FF FF
  $%  REQ001:763 03 22 F1 88 FF FF FF FF       $%  ANS001:773 03 22 F1 88 FF FF FF FF
  $%  REQ002:763 03 22 F1 9D FF FF FF FF       $%  ANS002:773 03 22 F1 9D FF FF FF FF
  $%  REQ003:763 03 22 F1 8A FF FF FF FF       $%  ANS003:773 03 22 F1 8A FF FF FF FF
  $%  REQ004:763 03 22 F1 87 FF FF FF FF       $%  ANS004:773 03 22 F1 87 FF FF FF FF
  $%  REQ005:763 03 22 F1 99 FF FF FF FF       $%  ANS005:773 03 22 F1 99 FF FF FF FF
  $%  REQ006:763 03 22 F1 98 FF FF FF FF       $%  ANS006:773 03 22 F1 98 FF FF FF FF

  $%  000:OS软件版本号:                         $%    $%  ANS000.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  001:软件版本号:                           $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:ECU装配日期:                          $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  003:系统供应商代码:                       $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  004:整车零部件号:                         $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  005:刷新日期:                             $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  006:程序修复车间代码/测试者序列号:        $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.IDS总线数据流监听
  $  00.IDS总线数据流监听
;  $  REQ000:763       $  ANS000:773

;  $  000.空调系统开启/关闭状态       $    $       $    $  ANS000.BYTE003  $  switxh(x&0x03) 0x00:y=@0277;0x01:y=@0010;0x02:y=@0048;0x03:y=@0007;default: y=@0007;
;  $  001.用户设定温度                $    $       $    $  ANS000.BYTE000  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0277;
;  $  002.空调AUTO请求指令            $    $       $    $  ANS000.BYTE001  $  switxh(x&0x03) 0x00:y=@0277;0x01:y=@0282;0x02:y=@0283;0x03:y=@0007;default: y=@0007;
;  $  003.PTC请求指令                 $    $       $    $  ANS000.BYTE001  $  switxh(x&0x0c) 0x00:y=@0277;0x04:y=@0284;0x08:y=@0285;0x0c:y=@0007;default: y=@0007;
;  $  004.AC请求指令                  $    $       $    $  ANS000.BYTE001  $  switxh(x&0x30) 0x00:y=@0007;0x10:y=@0280;0x20:y=@0281;0x30:y=@0007;default: y=@0007;
;  $  005.MAX前除霜除雾指令           $    $       $    $  ANS000.BYTE001  $  switxh(x&0xc0) 0x00:y=@0277;0x40:y=@0007;0x80:y=@0151;0xc0:y=@0007;default: y=@0007;
;  $  006.后除霜除雾指令              $    $       $    $  ANS000.BYTE002  $  switxh(x&0x03) 0x00:y=@0277;0x01:y=@0151;0x02:y=@0278;0x03:y=@0007;default: y=@0007;
;  $  007.内循环开启指令              $    $       $    $  ANS000.BYTE002  $  switxh(x&0x0c) 0x00:y=@0277;0x04:y=@0279;0x08:y=@0048;0x0c:y=@0007;default: y=@0007;
;  $  008.鼓风机档位                  $    $       $    $  ANS000.BYTE002  $  switxh(x&0xf0) 0x00:y=@0277;0x10:y=level 1;0x20:y=level 2;0x30:y=level 3;0x40:y=level 4;0x50:y=level 5;0x60:y=level 6;0x70:y=level 7;0x80:y=@0010;default: y=@0007;
;  $  009.模式风门位置请求            $    $       $    $  ANS000.BYTE003  $  switxh(x&0xe0) 0x00:y=@0277;0x20:y=@0272;0x40:y=@0273;0x60:y=@0274;0x80:y=@0275;0xa0:y=@0276;0xc0:y=@0007;0xe0:y=@0007;default: y=@0007;
;  $  010.经济模式状态                $    $       $    $  ANS000.BYTE005  $  switxh(x&0x10) 0x10:y=@0048;default: y=@0010;

  $)  01.CLM总线数据监听
  $  01.CLM总线数据监听
;  $  REQ000:763       $  ANS000:773

;  $  000.压缩机状态反馈               $    $               $    $  ANS000.BYTE002  $  switxh(x&0x80) 0x80:y=@0268;default: y=@0007;
;  $  001.空调系统状态反馈             $    $               $    $  ANS000.BYTE002  $  switxh(x&0x40) 0x40:y=@0268;default: y=@0007;
;  $  002.前除霜除雾状态反馈           $    $               $    $  ANS000.BYTE002  $  switxh(x&0x20) 0x20:y=@0268;default: y=@0007;
;  $  003.外温传感器温度失效状态       $    $               $    $  ANS000.BYTE002  $  switxh(x&0x10) 0x10:y=@0025;default: y=@0266;
;  $  004.室内温度失效状态             $    $               $    $  ANS000.BYTE002  $  switxh(x&0x08) 0x08:y=@0025;default: y=@0266;
;  $  005.蒸发器温度失效状态           $    $               $    $  ANS000.BYTE002  $  switxh(x&0x04) 0x04:y=@0025;default: y=@0266;
;  $  006.外温传感器温度               $    $  degree C     $    $  ANS000.BYTE003  $  y=x*0.5-55;
;  $  007.室内温度                     $    $  degree C     $    $  ANS000.BYTE004  $  y=x*0.5-55;
;  $  008.蒸发器温度                   $    $  degree C     $    $  ANS000.BYTE005  $  y=x*0.5-55;
;  $  009.压缩机转速请求               $    $  rpm          $    $  ANS000.BYTE000  $  y=(x1&127)*100;
;  $  010.空调压缩机使能信号           $    $               $    $  ANS000.BYTE001  $  switxh(x&0x03) 0x00:y=@0267;0x01:y=@0010;0x02:y=@0048;0x03:y=@0007;default: y=@0007;
;  $  011.中压开关状态/常开            $    $               $    $  ANS000.BYTE001  $  switxh(x&0x80) 0x80:y=@0048;default: y=@0010;
;  $  012.中压开关状态/常闭            $    $               $    $  ANS000.BYTE001  $  switxh(x&0x40) 0x40:y=@0048;default: y=@0010;
;  $  013.PTC使能                      $    $               $    $  ANS000.BYTE002  $  switxh(x&0x80) 0x80:y=@0048;default: y=@0010;

  $)  02.ICU总线数据监听
  $  02.ICU总线数据监听
;  $  REQ000:763       $  ANS000:773

;  $  000.检测控制器工作信号             $    $         $    $  ANS000.BYTE002  $  y=x&0x15;
;  $  001.总里程                         $    $  km     $    $  ANS000.BYTE000  $  y=(x1*256+x2)*16+x3/16;
;  $  002.安全气囊故障指示               $    $         $    $  ANS000.BYTE003  $  switxh(x&0x02) 0x02:y=@0025;default: y=@0266;
;  $  003.主驾驶员侧安全带锁扣信号       $    $         $    $  ANS000.BYTE003  $  switxh(x&0x04) 0x04:y=@0264;default: y=@0265;
;  $  004.制动液信号                     $    $         $    $  ANS000.BYTE003  $  switxh(x&0x08) 0x08:y=@0025;default: y=@0221;
;  $  005.维修保养状态                   $    $         $    $  ANS000.BYTE003  $  switxh(x&0x10) 0x10:y=@0151;default: y=@0007;

  $)  03.PTC总线数据监听
  $  03.PTC总线数据监听
;  $  REQ000:763       $  ANS000:773

;  $  000.PTC温度           $    $  degree C     $    $  ANS000.BYTE000  $  y=x-40;
;  $  001.PTC工作状态       $    $               $    $  ANS000.BYTE001  $  switxh(x&0xc0) 0x00:y=off;0x40:y=@0221;0x80:y=@0263;0xc0:y=@0156;default: y=@0007;
;  $  002.PTC功率反馈       $    $  W            $    $  ANS000.BYTE005  $  y=x1*256+x2;

  $)  04.EAC总线数据监听
  $  04.EAC总线数据监听
;  $  REQ000:763       $  ANS000:773

;  $  000.压缩机转速           $    $  rpm          $    $  ANS000.BYTE000  $  y=(x1&127)*100;
;  $  001.压缩机输入电压       $    $  V            $    $  ANS000.BYTE001  $  y=x*2+x2/128;
;  $  002.压缩机输入电流       $    $  A            $    $  ANS000.BYTE001  $  y=(x1&127)*2*0.1+x2/64*0.1;
;  $  003.压缩机温度           $    $  degree C     $    $  ANS000.BYTE003  $  y=(x1&63)*4+x2/64-40;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:763 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
