
    车型ID：580c

    模拟：协议模拟-->580c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~71A

进入命令:

  $~  REQ000:70A 02 10 03 FF FF FF FF FF       $~  ANS000:71A 02 10 03 FF FF FF FF FF

空闲命令:

  $!  REQ000:70A 02 3E 00 FF FF FF FF FF       $!  ANS000:71A 02 3E 00 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:70A 03 19 02 09 FF FF FF FF       $#  ANS000:71A 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/58080000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:70A 04 14 FF FF FF FF FF FF       $$  ANS000:71A 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:70A 03 22 F1 87 FF FF FF FF       $%  ANS000:71A 03 22 F1 87 FF FF FF FF
  $%  REQ001:70A 03 22 F1 8A FF FF FF FF       $%  ANS001:71A 03 22 F1 8A FF FF FF FF
  $%  REQ002:70A 03 22 F1 8B FF FF FF FF       $%  ANS002:71A 03 22 F1 8B FF FF FF FF
  $%  REQ003:70A 03 22 F1 9D FF FF FF FF       $%  ANS003:71A 03 22 F1 9D FF FF FF FF
  $%  REQ004:70A 03 22 F1 8C FF FF FF FF       $%  ANS004:71A 03 22 F1 8C FF FF FF FF
  $%  REQ005:70A 03 22 F1 91 FF FF FF FF       $%  ANS005:71A 03 22 F1 91 FF FF FF FF
  $%  REQ006:70A 03 22 F1 88 FF FF FF FF       $%  ANS006:71A 03 22 F1 88 FF FF FF FF
  $%  REQ007:70A 03 22 F1 99 FF FF FF FF       $%  ANS007:71A 03 22 F1 99 FF FF FF FF
  $%  REQ008:70A 03 22 F1 98 FF FF FF FF       $%  ANS008:71A 03 22 F1 98 FF FF FF FF
  $%  REQ009:70A 03 22 F1 B0 FF FF FF FF       $%  ANS009:71A 03 22 F1 B0 FF FF FF FF
  $%  REQ010:70A 03 22 F1 80 FF FF FF FF       $%  ANS010:71A 03 22 F1 80 FF FF FF FF

  $%  000:整车零部件号:                      $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  001:系统供应商代码:                    $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  002:ECU生产日期:                       $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  003:ECU装配日期:                       $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  004:控制器序列号:                      $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  005:硬件版本号:                        $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  006:软件版本号(正常升级版本):          $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  007:刷新日期:                          $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  008:维修店代码或诊断设备序列号:        $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  009:软件版本号(固定版本):              $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  010:Bootloader软件版本号:              $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.动态数据读取
  $  00.动态数据读取
  $  REQ000:70A 03 22 08 01 FF FF FF FF       $  ANS000:71A 03 22 08 01 FF FF FF FF
  $  REQ001:70A 03 22 08 02 FF FF FF FF       $  ANS001:71A 03 22 08 02 FF FF FF FF
  $  REQ002:70A 03 22 08 03 FF FF FF FF       $  ANS002:71A 03 22 08 03 FF FF FF FF
  $  REQ003:70A 03 22 08 04 FF FF FF FF       $  ANS003:71A 03 22 08 04 FF FF FF FF
  $  REQ004:70A 03 22 08 05 FF FF FF FF       $  ANS004:71A 03 22 08 05 FF FF FF FF
  $  REQ005:70A 03 22 08 06 FF FF FF FF       $  ANS005:71A 03 22 08 06 FF FF FF FF

  $  000.充电请求          $    $        $    $  ANS000.BYTE004  $  y=x;
  $  001.充电机状态        $    $        $    $  ANS001.BYTE004  $  y=x;
  $  002.OBC输出电压       $    $  V     $    $  ANS002.BYTE004  $  y=(x1*256+x2)*0.1;
  $  003.OBC输出电流       $    $  A     $    $  ANS003.BYTE004  $  y=(x1*256+x2)*0.1;
  $  004.OBC输入电压       $    $  V     $    $  ANS004.BYTE004  $  y=(x1*256+x2)*0.1;
  $  005.OBC输入电流       $    $  A     $    $  ANS005.BYTE004  $  y=(x1*256+x2)*0.1;

  $)  01.总线数据监控
  $  01.总线数据监控
;  $  REQ000:70A       $  ANS000:71A

;  $  000.充电机状态                     $    $         $    $  ANS000.BYTE000  $  switxh(x&0x07) 0x00:y=@0116;0x02:y=@0321;0x03:y=@0322;0x04:y=@0195;0x05:y=@0196;default: y=@0074;
;  $  001.充电机输出电流                 $    $  A      $    $  ANS000.BYTE001  $  y=(x1*256+x2)*0.05;
;  $  002.充电机输出电压                 $    $  V      $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.05;
;  $  003.OBC温度                        $    $         $    $  ANS000.BYTE005  $  switxh(x&0x30) 0x00:y=@0000;0x10:y=@0334;0x20:y=@0335;default: y=@0074;
;  $  004.充电机当前可输出最大功率       $    $  KW     $    $  ANS000.BYTE001  $  y=x*16*0.005+x2/16*0.005;
;  $  005.充电机输入电压                 $    $  V      $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.01;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:70A 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
