
    车型ID：580f

    模拟：协议模拟-->580f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7EA

进入命令:

  $~  REQ000:7E2 02 10 81 FF FF FF FF FF       $~  ANS000:7EA 02 10 81 FF FF FF FF FF

空闲命令:

  $!  REQ000:7E2 02 3E 01 FF FF FF FF FF       $!  ANS000:7EA 02 3E 01 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E2 04 18 00 FF 00 FF FF FF       $#  ANS000:7EA 04 18 00 FF 00 FF FF FF

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE02 控制故障码个数，从$#ANS000.BYTE3$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/580b0000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E2 03 14 FF 00 FF FF FF FF       $$  ANS000:7EA 03 14 FF 00 FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E2 02 1A 90 FF FF FF FF FF       $%  ANS000:7EA 02 1A 90 FF FF FF FF FF
  $%  REQ001:7E2 02 1A 91 FF FF FF FF FF       $%  ANS001:7EA 02 1A 91 FF FF FF FF FF
  $%  REQ002:7E2 02 1A 92 FF FF FF FF FF       $%  ANS002:7EA 02 1A 92 FF FF FF FF FF
  $%  REQ003:7E2 02 1A 95 FF FF FF FF FF       $%  ANS003:7EA 02 1A 95 FF FF FF FF FF
  $%  REQ004:7E2 02 1A 11 FF FF FF FF FF       $%  ANS004:7EA 02 1A 11 FF FF FF FF FF
  $%  REQ005:7E2 02 1A 94 FF FF FF FF FF       $%  ANS005:7EA 02 1A 94 FF FF FF FF FF
  $%  REQ006:7E2 02 1A 93 FF FF FF FF FF       $%  ANS006:7EA 02 1A 93 FF FF FF FF FF
  $%  REQ007:7E2 02 1A 16 FF FF FF FF FF       $%  ANS007:7EA 02 1A 16 FF FF FF FF FF
  $%  REQ008:7E2 02 1A 98 FF FF FF FF FF       $%  ANS008:7EA 02 1A 98 FF FF FF FF FF
  $%  REQ009:7E2 02 1A 99 FF FF FF FF FF       $%  ANS009:7EA 02 1A 99 FF FF FF FF FF

  $%  000:VIN:                         $%    $%  ANS000.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:VCU零件号:                   $%    $%  ANS001.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  002:整车配置码:                  $%    $%  ANS002.BYTE003  $%  y=HEX(x1,x2,x3);
  $%  003:软件版本号(公告版本):        $%    $%  ANS003.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:软件版本号(内控版本):        $%    $%  ANS004.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:Bootloader版本号:            $%    $%  ANS005.BYTE003  $%  y=HEX(x1,x2,x3,x4,x5,x6);
  $%  006:硬件版本号(公告版本):        $%    $%  ANS006.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  007:硬件版本号(内控版本):        $%    $%  ANS007.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  008:控制器序列号:                $%    $%  ANS008.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  009:驱动电机编码:                $%    $%  ANS009.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E2 02 21 01 FF FF FF FF FF       $  ANS000:7EA 02 21 01 FF FF FF FF FF
  $  REQ001:7E2 02 21 02 FF FF FF FF FF       $  ANS001:7EA 02 21 02 FF FF FF FF FF
  $  REQ002:7E2 02 21 03 FF FF FF FF FF       $  ANS002:7EA 02 21 03 FF FF FF FF FF
  $  REQ003:7E2 02 21 04 FF FF FF FF FF       $  ANS003:7EA 02 21 04 FF FF FF FF FF

  $  000.纯电剩余里程               $    $  km           $    $  ANS000.BYTE003  $  y=x1*256+x2;
  $  001.电机扭矩                   $    $  Nm           $    $  ANS000.BYTE005  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/64;
  $  002.电机转速                   $    $  rpm          $    $  ANS000.BYTE007  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/2;
  $  003.车速                       $    $  km/h         $    $  ANS000.BYTE009  $  y=(x1*256+x2)/256;
  $  004.动力电池电量               $    $  %            $    $  ANS000.BYTE011  $  y=(x1*256+x2)/256;
  $  005.动力电池电压               $    $  V            $    $  ANS000.BYTE013  $  y=(x1*256+x2)/32;
  $  006.动力电池电流               $    $  A            $    $  ANS000.BYTE015  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/16;
  $  007.低压蓄电池电压             $    $  V            $    $  ANS000.BYTE017  $  y=(x1*256+x2)/1024;
  $  008.DCDC负载电流               $    $  A            $    $  ANS000.BYTE019  $  y=(x1*256+x2)/256;
  $  009.高压电池温度               $    $  degree C     $    $  ANS000.BYTE021  $  y=(x&0x7f)-(x&0x80);
  $  010.MCU控制器温度              $    $  degree C     $    $  ANS000.BYTE022  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  011.电机温度                   $    $  degree C     $    $  ANS000.BYTE024  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  012.油门踏板深度               $    $  %            $    $  ANS000.BYTE026  $  y=(x1*256+x2)/256;
  $  013.驾驶员请求扭矩             $    $  Nm           $    $  ANS000.BYTE028  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  014.制动真空压力               $    $  Kpa          $    $  ANS000.BYTE030  $  y=(x1*256+x2)/64;
  $  015.环境温度                   $    $  degree C     $    $  ANS000.BYTE034  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  016.请求DCDC输出电压           $    $  V            $    $  ANS000.BYTE036  $  y=(x1*256+x2)/128;
  $  017.点火信号                   $    $               $    $  ANS001.BYTE003  $  switxh(x&0x01) 0x01:y=@0048;default: y=@0010;
  $  018.MCU使能状态                $    $               $    $  ANS001.BYTE003  $  switxh(x&0x08) 0x08:y=@0048;default: y=@0010;
  $  019.动力电池使能               $    $               $    $  ANS001.BYTE003  $  switxh(x&0x10) 0x10:y=@0048;default: y=@0010;
  $  020.刹车开关                   $    $               $    $  ANS001.BYTE003  $  switxh(x&0x20) 0x20:y=@0316;default: y=@0317;
  $  021.制动真空泵使能             $    $               $    $  ANS001.BYTE003  $  switxh(x&0x40) 0x40:y=@0048;default: y=@0010;
  $  022.高压电池连接状态           $    $               $    $  ANS001.BYTE003  $  switxh(x&0x80) 0x80:y=@0175;default: y=@0176;
  $  023.档位信息                   $    $               $    $  ANS001.BYTE004  $  switxh(x) 0x00:y=N;0x01:y=D;0x02:y=R;default: y=@0074;
  $  024.高速风扇使能信号           $    $               $    $  ANS001.BYTE005  $  switxh(x&0x04) 0x04:y=@0048;default: y=@0010;
  $  025.低速风扇使能信号           $    $               $    $  ANS001.BYTE005  $  switxh(x&0x08) 0x08:y=@0048;default: y=@0010;
  $  026.PTC是否允许使能            $    $               $    $  ANS001.BYTE005  $  switxh(x&0x10) 0x10:y=@0046;default: y=@0047;
  $  027.压缩机是否允许使能         $    $               $    $  ANS001.BYTE005  $  switxh(x&0x20) 0x20:y=@0046;default: y=@0047;
  $  028.冷却水泵是否允许使能       $    $               $    $  ANS001.BYTE005  $  switxh(x&0x40) 0x40:y=@0046;default: y=@0047;
  $  029.电机_MCU环路互锁           $    $               $    $  ANS001.BYTE005  $  switxh(x&0x80) 0x80:y=@0175;default: y=@0075;
  $  030.高压附件环路互锁           $    $               $    $  ANS001.BYTE006  $  switxh(x&0x01) 0x01:y=@0075;default: y=@0175;
  $  031.电池环路互锁               $    $               $    $  ANS001.BYTE006  $  switxh(x&0x02) 0x02:y=@0075;default: y=@0175;
  $  032.DCDC使能                   $    $               $    $  ANS001.BYTE006  $  switxh(x&0x04) 0x04:y=@0101;default: y=@0123;
  $  033.气囊状态信号               $    $               $    $  ANS001.BYTE006  $  switxh(x&0x20) 0x20:y=@0309;default: y=@0310;
  $  034.经济模式开关               $    $               $    $  ANS001.BYTE006  $  switxh(x&0x40) 0x40:y=@0311;default: y=@0312;
  $  035.控制器故障模式             $    $               $    $  ANS002.BYTE003  $  switxh(x) 0x01:y=@0297;0x02:y=@0298;0x04:y=@0299;0x08:y=@0300;0x10:y=@0301;0x20:y=@0302;0x40:y=@0303;0x80:y=@0304;default: y=@0190;
  $  036.MCU模式                    $    $               $    $  ANS003.BYTE003  $  switxh(x) 0x01:y=@0305;0x05:y=@0042;0x12:y=@0306;0x15:y=@0307;0x03:y=@0308;0x02:y=@0185;0x0b:y=@0184;default: y=@0074;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E2 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
