
    车型ID：5823

    模拟：协议模拟-->5823

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B0

进入命令:

  $~  REQ000:7A0 02 10 03 FF FF FF FF FF       $~  ANS000:7B0 02 10 03 FF FF FF FF FF
  $~  REQ001:7A0 02 27 03 FF FF FF FF FF       $~  ANS001:7B0 02 27 03 FF FF FF FF FF
  $~  REQ002:7A0 04 27 04 1E B0 FF FF FF       $~  ANS002:7B0 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:7A0 02 3E 80 00 00 00 00 00       $!  ANS000:7B0 02 3E 80 00 00 00 00 00

退出命令:

  $@  REQ000:7A0 02 10 01 FF FF FF FF FF       $@  ANS000:7B0 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7A0 03 19 02 09 FF FF FF FF       $#  ANS000:7B0 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/58160000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7A0 04 14 FF FF FF FF FF FF       $$  ANS000:7B0 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7A0 03 22 F1 91 FF FF FF FF       $%  ANS000:7B0 03 22 F1 91 FF FF FF FF
  $%  REQ001:7A0 03 22 F1 88 FF FF FF FF       $%  ANS001:7B0 03 22 F1 88 FF FF FF FF
  $%  REQ002:7A0 03 22 F1 8B FF FF FF FF       $%  ANS002:7B0 03 22 F1 8B FF FF FF FF
  $%  REQ003:7A0 03 22 F1 8C FF FF FF FF       $%  ANS003:7B0 03 22 F1 8C FF FF FF FF
  $%  REQ004:7A0 03 22 F1 9D FF FF FF FF       $%  ANS004:7B0 03 22 F1 9D FF FF FF FF
  $%  REQ005:7A0 03 22 F1 8A FF FF FF FF       $%  ANS005:7B0 03 22 F1 8A FF FF FF FF
  $%  REQ006:7A0 03 22 F1 87 FF FF FF FF       $%  ANS006:7B0 03 22 F1 87 FF FF FF FF
  $%  REQ007:7A0 03 22 F1 99 FF FF FF FF       $%  ANS007:7B0 03 22 F1 99 FF FF FF FF
  $%  REQ008:7A0 03 22 F1 B0 FF FF FF FF       $%  ANS008:7B0 03 22 F1 B0 FF FF FF FF
  $%  REQ009:7A0 03 22 F1 98 FF FF FF FF       $%  ANS009:7B0 03 22 F1 98 FF FF FF FF
  $%  REQ010:7A0 03 22 F1 80 FF FF FF FF       $%  ANS010:7B0 03 22 F1 80 FF FF FF FF
  $%  REQ011:7A0 03 22 F1 C0 FF FF FF FF       $%  ANS011:7B0 03 22 F1 C0 FF FF FF FF
  $%  REQ012:7A0 03 22 F1 BF FF FF FF FF       $%  ANS012:7B0 03 22 F1 BF FF FF FF FF
  $%  REQ013:7A0 03 22 F1 90 FF FF FF FF       $%  ANS013:7B0 03 22 F1 90 FF FF FF FF
  $%  REQ014:7A0 03 22 F1 B1 FF FF FF FF       $%  ANS014:7B0 03 22 F1 B1 FF FF FF FF

  $%  000:硬件版本号:                           $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  001:软件版本号:                           $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:ECU生产日期:                          $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  003:控制器序列号:                         $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  004:ECU装配日期:                          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  005:系统供应商代码:                       $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:整车零部件号:                         $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  007:刷新日期:                             $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  008:ICCID:                                $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  009:程序修复车间代码/测试者序列号:        $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:Boot版本号:                           $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  011:软件版本号(固定版本):                 $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  012:硬件版本号(固定版本):                 $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  013:VIN:                                  $%    $%  ANS013.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  014:IMEI:                                 $%    $%  ANS014.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7A0 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
