
    车型ID：5826

    模拟：协议模拟-->5826

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~717

进入命令:

  $~  REQ000:707 02 10 03 FF FF FF FF FF       $~  ANS000:717 02 10 03 FF FF FF FF FF
  $~  REQ001:707 02 27 03 FF FF FF FF FF       $~  ANS001:717 02 27 03 FF FF FF FF FF
  $~  REQ002:707 04 27 04 1E B0 FF FF FF       $~  ANS002:717 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:707 02 3E 00 FF FF FF FF FF       $!  ANS000:717 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:707 02 10 01 FF FF FF FF FF       $@  ANS000:717 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:707 03 19 02 FF FF FF FF FF       $#  ANS000:717 03 19 02 FF FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/67000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:707 04 14 FF FF FF FF FF FF       $$  ANS000:717 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:707 03 22 F1 80 FF FF FF FF       $%  ANS000:717 03 22 F1 80 FF FF FF FF
  $%  REQ001:707 03 22 F1 86 FF FF FF FF       $%  ANS001:717 03 22 F1 86 FF FF FF FF
  $%  REQ002:707 03 22 F1 87 FF FF FF FF       $%  ANS002:717 03 22 F1 87 FF FF FF FF
  $%  REQ003:707 03 22 F1 88 FF FF FF FF       $%  ANS003:717 03 22 F1 88 FF FF FF FF
  $%  REQ004:707 03 22 F1 B0 FF FF FF FF       $%  ANS004:717 03 22 F1 B0 FF FF FF FF
  $%  REQ005:707 03 22 F1 8A FF FF FF FF       $%  ANS005:717 03 22 F1 8A FF FF FF FF
  $%  REQ006:707 03 22 F1 8B FF FF FF FF       $%  ANS006:717 03 22 F1 8B FF FF FF FF
  $%  REQ007:707 03 22 F1 8C FF FF FF FF       $%  ANS007:717 03 22 F1 8C FF FF FF FF
  $%  REQ008:707 03 22 F1 90 FF FF FF FF       $%  ANS008:717 03 22 F1 90 FF FF FF FF
  $%  REQ009:707 03 22 F1 91 FF FF FF FF       $%  ANS009:717 03 22 F1 91 FF FF FF FF
  $%  REQ010:707 03 22 F1 98 FF FF FF FF       $%  ANS010:717 03 22 F1 98 FF FF FF FF
  $%  REQ011:707 03 22 F1 99 FF FF FF FF       $%  ANS011:717 03 22 F1 99 FF FF FF FF
  $%  REQ012:707 03 22 F1 BF FF FF FF FF       $%  ANS012:717 03 22 F1 BF FF FF FF FF
  $%  REQ013:707 03 22 F1 C0 FF FF FF FF       $%  ANS013:717 03 22 F1 C0 FF FF FF FF
  $%  REQ014:707 03 22 F1 9D FF FF FF FF       $%  ANS014:717 03 22 F1 9D FF FF FF FF
  $%  REQ015:707 03 22 F2 00 FF FF FF FF       $%  ANS015:717 03 22 F2 00 FF FF FF FF
  $%  REQ016:707 03 22 F1 D0 FF FF FF FF       $%  ANS016:717 03 22 F1 D0 FF FF FF FF

  $%  000:软件版本号:                        $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                  $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                      $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号:                    $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:        $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商代码:                    $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:ECU生产日期:                       $%    $%  ANS006.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  007:控制器序列号:                      $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  008:整车VIN:                           $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:硬件版本号:                        $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  010:诊断设备序列号:                    $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:刷新日期:                          $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  012:硬件版本号（固定版本）:            $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  013:软件总成版本:                      $%    $%  ANS013.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  014:ECU装配日期:                       $%    $%  ANS014.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  015:电机编码:                          $%    $%  ANS015.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  016:软件总成零件号:                    $%    $%  ANS016.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:707 03 22 08 01 FF FF FF FF       $  ANS000:717 03 22 08 01 FF FF FF FF
  $  REQ001:707 03 22 08 03 FF FF FF FF       $  ANS001:717 03 22 08 03 FF FF FF FF
  $  REQ002:707 03 22 08 04 FF FF FF FF       $  ANS002:717 03 22 08 04 FF FF FF FF
  $  REQ003:707 03 22 08 05 FF FF FF FF       $  ANS003:717 03 22 08 05 FF FF FF FF
  $  REQ004:707 03 22 08 06 FF FF FF FF       $  ANS004:717 03 22 08 06 FF FF FF FF
  $  REQ005:707 03 22 08 07 FF FF FF FF       $  ANS005:717 03 22 08 07 FF FF FF FF
  $  REQ006:707 03 22 08 08 FF FF FF FF       $  ANS006:717 03 22 08 08 FF FF FF FF
  $  REQ007:707 03 22 08 09 FF FF FF FF       $  ANS007:717 03 22 08 09 FF FF FF FF
  $  REQ008:707 03 22 08 0A FF FF FF FF       $  ANS008:717 03 22 08 0A FF FF FF FF
  $  REQ009:707 03 22 08 0B FF FF FF FF       $  ANS009:717 03 22 08 0B FF FF FF FF
  $  REQ010:707 03 22 08 10 FF FF FF FF       $  ANS010:717 03 22 08 10 FF FF FF FF
  $  REQ011:707 03 22 08 11 FF FF FF FF       $  ANS011:717 03 22 08 11 FF FF FF FF
  $  REQ012:707 03 22 08 12 FF FF FF FF       $  ANS012:717 03 22 08 12 FF FF FF FF
  $  REQ013:707 03 22 08 16 FF FF FF FF       $  ANS013:717 03 22 08 16 FF FF FF FF
  $  REQ014:707 03 22 08 17 FF FF FF FF       $  ANS014:717 03 22 08 17 FF FF FF FF
  $  REQ015:707 03 22 08 19 FF FF FF FF       $  ANS015:717 03 22 08 19 FF FF FF FF
  $  REQ016:707 03 22 08 1D FF FF FF FF       $  ANS016:717 03 22 08 1D FF FF FF FF
  $  REQ017:707 03 22 08 0D FF FF FF FF       $  ANS017:717 03 22 08 0D FF FF FF FF

  $  000.MCU使能命令            $    $               $    $  ANS000.BYTE004  $  switxh(x&0x01) 0x01:y=@0101;default: y=@0112;
  $  001.目标转矩命令           $    $  Nm           $    $  ANS001.BYTE004  $  y=x1*256+x2-500;
  $  002.目标转速命令           $    $  r/min        $    $  ANS002.BYTE004  $  y=x1*256+x2-12000;
  $  003.档位信号               $    $               $    $  ANS003.BYTE004  $  switxh(x) 0x00:y=@0113;0x01:y=@0042;0x02:y=@0114;0x03:y=@0115;0x0a:y=@0204;0x0b:y=@0205;0x12:y=@0206;0x1a:y=@0207;default: y=@0007;
  $  004.主动放电命令           $    $               $    $  ANS004.BYTE004  $  switxh(x&0x01) 0x01:y=@0009;default: y=@0008;
  $  005.防溜坡命令             $    $               $    $  ANS005.BYTE004  $  switxh(x&0x01) 0x01:y=@0326;default: y=@0100;
  $  006.实际工作模式           $    $               $    $  ANS006.BYTE004  $  switxh(x) 0x00:y=@0113;0x01:y=@0042;0x02:y=@0114;0x03:y=@0115;0x0a:y=@0204;0x0b:y=@0205;0x12:y=@0206;0x1a:y=@0207;default: y=@0007;
  $  007.实际反馈转矩           $    $  Nm           $    $  ANS007.BYTE004  $  y=x1*256+x2-500;
  $  008.实际反馈转速           $    $  r/min        $    $  ANS008.BYTE004  $  y=x1*256+x2-12000;
  $  009.旋变初始偏移位置       $    $  degree       $    $  ANS009.BYTE004  $  y=(x1*256+x2)*0.1-360;
  $  010.电机电流有效值         $    $  A            $    $  ANS010.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  011.允许最大输出转矩       $    $  Nm           $    $  ANS011.BYTE004  $  y=x1*256+x2-500;
  $  012.直流母线电压           $    $  V            $    $  ANS012.BYTE004  $  y=x1*256+x2-500;
  $  013.IGBT温度               $    $  degree C     $    $  ANS013.BYTE004  $  y=x-40;
  $  014.电机温度               $    $  degree C     $    $  ANS014.BYTE004  $  y=x-40;
  $  015.钥匙信号               $    $               $    $  ANS015.BYTE004  $  switxh(x&0x01) 0x01:y=KEY_ON;default: y=OFF;
  $  016.12蓄电池电压           $    $  V            $    $  ANS016.BYTE004  $  y=x1*256+x2-12;
  $  017.上下电状态             $    $               $    $  ANS017.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:707 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
