
    车型ID：5827

    模拟：协议模拟-->5827

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~716

进入命令:

  $~  REQ000:706 02 10 03 FF FF FF FF FF       $~  ANS000:716 02 10 03 FF FF FF FF FF
  $~  REQ001:706 02 27 03 FF FF FF FF FF       $~  ANS001:716 02 27 03 FF FF FF FF FF
  $~  REQ002:706 04 27 04 1E B0 FF FF FF       $~  ANS002:716 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:706 02 3E 00 FF FF FF FF FF       $!  ANS000:716 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:706 02 10 01 FF FF FF FF FF       $@  ANS000:716 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:706 03 19 02 09 FF FF FF FF       $#  ANS000:716 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/68000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:706 04 14 FF FF FF FF FF FF       $$  ANS000:716 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:706 03 22 F1 91 FF FF FF FF       $%  ANS000:716 03 22 F1 91 FF FF FF FF
  $%  REQ001:706 03 22 F1 88 FF FF FF FF       $%  ANS001:716 03 22 F1 88 FF FF FF FF
  $%  REQ002:706 03 22 F1 8B FF FF FF FF       $%  ANS002:716 03 22 F1 8B FF FF FF FF
  $%  REQ003:706 03 22 F1 8C FF FF FF FF       $%  ANS003:716 03 22 F1 8C FF FF FF FF
  $%  REQ004:706 03 22 F1 9D FF FF FF FF       $%  ANS004:716 03 22 F1 9D FF FF FF FF
  $%  REQ005:706 03 22 F1 8A FF FF FF FF       $%  ANS005:716 03 22 F1 8A FF FF FF FF
  $%  REQ006:706 03 22 F1 86 FF FF FF FF       $%  ANS006:716 03 22 F1 86 FF FF FF FF
  $%  REQ007:706 03 22 F1 87 FF FF FF FF       $%  ANS007:716 03 22 F1 87 FF FF FF FF
  $%  REQ008:706 03 22 F1 99 FF FF FF FF       $%  ANS008:716 03 22 F1 99 FF FF FF FF
  $%  REQ009:706 03 22 20 2D FF FF FF FF       $%  ANS009:716 03 22 20 2D FF FF FF FF
  $%  REQ010:706 03 22 F1 90 FF FF FF FF       $%  ANS010:716 03 22 F1 90 FF FF FF FF
  $%  REQ011:706 03 22 20 2E FF FF FF FF       $%  ANS011:716 03 22 20 2E FF FF FF FF
  $%  REQ012:706 03 22 20 2F FF FF FF FF       $%  ANS012:716 03 22 20 2F FF FF FF FF

  $%  000:硬件版本号:              $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  001:软件版本号:              $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:ECU生产日期:             $%    $%  ANS002.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  003:控制器序列号:            $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:ECU装配日期:             $%    $%  ANS004.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  005:系统供应商代码:          $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:当前诊断任务模式:        $%    $%  ANS006.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  007:整车零部件号:            $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  008:刷新日期:                $%    $%  ANS008.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  009:DigitalOutputs:          $%    $%  ANS009.BYTE004  $%  y=x;
  $%  010:VIN:                     $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  011:PwmOutputs:              $%    $%  ANS011.BYTE004  $%  y=x;
  $%  012:Battery code:            $%    $%  ANS012.BYTE004  $%  y=x;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读取动态数据流
  $  00.读取动态数据流
  $  REQ000:706 03 22 F0 15 FF FF FF FF       $  ANS000:716 03 22 F0 15 FF FF FF FF
  $  REQ001:706 03 22 F0 16 FF FF FF FF       $  ANS001:716 03 22 F0 16 FF FF FF FF

  $  000.SOC值       $    $  %     $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.01;
  $  001.SOH值       $    $  %     $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.01;

  $)  01.总线数据监听
  $  01.总线数据监听
;  $  REQ000:706       $  ANS000:716

;  $  000.电池允许最大放电电流       $    $  A            $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.05-1600;
;  $  001.电池允许最大充电电流       $    $  A            $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.05-1600;
;  $  002.SOC值                      $    $  %            $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.01;
;  $  003.电池包型号                 $    $               $    $  ANS000.BYTE006  $  switxh(x&0x0f) 0x01:y=GA;0x02:y=DA;0x03:y=JA;0x04:y=KA;default: y=@0007;
;  $  004.动力电池切断指示灯         $    $               $    $  ANS000.BYTE006  $  switxh(x&0x20) 0x20:y=@0048;default: y=@0010;
;  $  005.充电线连接指示灯           $    $               $    $  ANS000.BYTE006  $  switxh(x&0xc0) 0x00:y=@0075;0x40:y=@0324;0x80:y=@0325;0xc0:y=@0074;default: y=@0007;
;  $  006.控制器工作信号             $    $  %            $    $  ANS000.BYTE007  $  y=x&0x15;
;  $  007.电池允许最小放电电压       $    $  V            $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.05;
;  $  008.电池允许最大充电电压       $    $  V            $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.05;
;  $  009.动力电池母线电流           $    $  A            $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.05-1600;
;  $  010.动力电池内部电压           $    $  V            $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.05;
;  $  011.动力电池输出电压           $    $  V            $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.05;
;  $  012.电池单体电芯平均温度       $    $  degree C     $    $  ANS000.BYTE006  $  y=x-40;
;  $  013.SOH值                      $    $  %            $    $  ANS000.BYTE007  $  y=x;
;  $  014.单体最高电压               $    $  mV           $    $  ANS000.BYTE000  $  y=x1*256+x2;
;  $  015.单体最低电压               $    $  mV           $    $  ANS000.BYTE002  $  y=x1*256+x2;
;  $  016.单体最高温度               $    $  degree C     $    $  ANS000.BYTE004  $  y=x-40;
;  $  017.单体最低温度               $    $  degree C     $    $  ANS000.BYTE005  $  y=x-40;
;  $  018.动力电池状态               $    $               $    $  ANS000.BYTE000  $  switxh(x&0x03) 0x00:y=@0117;0x01:y=@0116;default: y=@0074;
;  $  019.正极继电器状态             $    $               $    $  ANS000.BYTE001  $  switxh(x&0x03) 0x00:y=@0075;0x01:y=@0175;default: y=@0074;
;  $  020.负极继电器状态             $    $               $    $  ANS000.BYTE001  $  switxh(x&0x0c) 0x00:y=@0075;0x04:y=@0175;default: y=@0074;
;  $  021.预充完成状态               $    $               $    $  ANS000.BYTE001  $  switxh(x&0x30) 0x00:y=@0075;0x10:y=@0175;default: y=@0074;
;  $  022.预充继电器状态             $    $               $    $  ANS000.BYTE001  $  switxh(x&0xc0) 0x00:y=@0075;0x40:y=@0175;default: y=@0074;
;  $  023.慢充状态                   $    $               $    $  ANS000.BYTE000  $  switxh(x&0xe0) 0x00:y=@0116;0x20:y=@0321;0x40:y=@0322;0x60:y=@0195;0x80:y=@0196;default: y=@0323;
;  $  024.快充状态                   $    $               $    $  ANS000.BYTE000  $  switxh(x&0x1c) 0x00:y=@0116;0x04:y=@0321;0x08:y=@0322;0x0c:y=@0195;0x10:y=@0196;default: y=@0323;
;  $  025.慢充最大允许交流电流       $    $               $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.05-1600;
;  $  026.动力电池充电状态           $    $               $    $  ANS000.BYTE000  $  switxh(x) 0x00:y=@0075;0x01:y=@0321;0x03:y=@0196;default: y=@0074;
;  $  027.BMS请求电流                $    $               $    $  ANS000.BYTE001  $  y=(x1*256+x2)*0.05;
;  $  028.BMS请求电压                $    $               $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.05;
;  $  029.BMS工作状态                $    $               $    $  ANS000.BYTE006  $  switxh(x&0x06) 0x00:y=@0039;0x02:y=@0198;default: y=@0074;
;  $  030.绝缘电阻值                 $    $               $    $  ANS000.BYTE007  $  switxh(x) 0x00:y=@0101;0x01:y=@0296;default: y=@0074;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:706 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
