
    车型ID：582f

    模拟：协议模拟-->582f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~71A

进入命令:

  $~  REQ000:70A 02 10 03 FF FF FF FF FF       $~  ANS000:71A 02 10 03 FF FF FF FF FF
  $~  REQ001:70A 02 27 03 FF FF FF FF FF       $~  ANS001:71A 02 27 03 FF FF FF FF FF
  $~  REQ002:70A 04 27 04 1E B0 FF FF FF       $~  ANS002:71A 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:70A 02 3E 00 FF FF FF FF FF       $!  ANS000:71A 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:70A 02 10 01 FF FF FF FF FF       $@  ANS000:71A 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:70A 03 19 02 09 FF FF FF FF       $#  ANS000:71A 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/6e000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:70A 04 14 FF FF FF FF FF FF       $$  ANS000:71A 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:70A 03 22 F1 87 FF FF FF FF       $%  ANS000:71A 03 22 F1 87 FF FF FF FF
  $%  REQ001:70A 03 22 F1 8A FF FF FF FF       $%  ANS001:71A 03 22 F1 8A FF FF FF FF
  $%  REQ002:70A 03 22 F1 8B FF FF FF FF       $%  ANS002:71A 03 22 F1 8B FF FF FF FF
  $%  REQ003:70A 03 22 F1 9D FF FF FF FF       $%  ANS003:71A 03 22 F1 9D FF FF FF FF
  $%  REQ004:70A 03 22 F1 8C FF FF FF FF       $%  ANS004:71A 03 22 F1 8C FF FF FF FF
  $%  REQ005:70A 03 22 F1 91 FF FF FF FF       $%  ANS005:71A 03 22 F1 91 FF FF FF FF
  $%  REQ006:70A 03 22 F1 88 FF FF FF FF       $%  ANS006:71A 03 22 F1 88 FF FF FF FF
  $%  REQ007:70A 03 22 F1 99 FF FF FF FF       $%  ANS007:71A 03 22 F1 99 FF FF FF FF
  $%  REQ008:70A 03 22 F1 98 FF FF FF FF       $%  ANS008:71A 03 22 F1 98 FF FF FF FF
  $%  REQ009:70A 03 22 F1 B0 FF FF FF FF       $%  ANS009:71A 03 22 F1 B0 FF FF FF FF
  $%  REQ010:70A 03 22 F1 80 FF FF FF FF       $%  ANS010:71A 03 22 F1 80 FF FF FF FF
  $%  REQ011:70A 03 22 F1 BF FF FF FF FF       $%  ANS011:71A 03 22 F1 BF FF FF FF FF
  $%  REQ012:70A 03 22 F1 C0 FF FF FF FF       $%  ANS012:71A 03 22 F1 C0 FF FF FF FF
  $%  REQ013:70A 03 22 F1 86 FF FF FF FF       $%  ANS013:71A 03 22 F1 86 FF FF FF FF
  $%  REQ014:70A 03 22 F1 90 FF FF FF FF       $%  ANS014:71A 03 22 F1 90 FF FF FF FF
  $%  REQ015:70A 03 22 F1 D0 FF FF FF FF       $%  ANS015:71A 03 22 F1 D0 FF FF FF FF

  $%  000:整车零部件号:                      $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  001:系统供应商代码:                    $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  002:ECU生产日期:                       $%    $%  ANS002.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  003:ECU装配日期:                       $%    $%  ANS003.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  004:控制器序列号:                      $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  005:硬件版本号:                        $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  006:应用软件版本号:                    $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  007:刷新日期:                          $%    $%  ANS007.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  008:诊断设备序列号:                    $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  009:应用软件版本号（固定版本）:        $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  010:软件版本号:                        $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  011:硬件版本号（固定版本）:            $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  012:软件总成版本:                      $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  013:当前诊断任务模式:                  $%    $%  ANS013.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  014:整车VIN:                           $%    $%  ANS014.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  015:软件总成零件号:                    $%    $%  ANS015.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:70A 03 22 08 01 FF FF FF FF       $  ANS000:71A 03 22 08 01 FF FF FF FF
  $  REQ001:70A 03 22 08 02 FF FF FF FF       $  ANS001:71A 03 22 08 02 FF FF FF FF
  $  REQ002:70A 03 22 08 03 FF FF FF FF       $  ANS002:71A 03 22 08 03 FF FF FF FF
  $  REQ003:70A 03 22 08 04 FF FF FF FF       $  ANS003:71A 03 22 08 04 FF FF FF FF
  $  REQ004:70A 03 22 08 05 FF FF FF FF       $  ANS004:71A 03 22 08 05 FF FF FF FF
  $  REQ005:70A 03 22 08 06 FF FF FF FF       $  ANS005:71A 03 22 08 06 FF FF FF FF

  $  000.充电请求          $    $        $    $  ANS000.BYTE004  $  switxh(x) 0x01:y=@0199;default: y=@0200;
  $  001.充电机状态        $    $        $    $  ANS001.BYTE004  $  switxh(x) 0x00:y=@0097;0x01:y=@0116;0x02:y=@0092;0x03:y=@0194;0x04:y=@0195;0x05:y=@0196;0x06:y=0x07:y=@0197;0x07:y=@0198;default: y=-;
  $  002.OBC输出电压       $    $  V     $    $  ANS002.BYTE004  $  y=(x1*256+x2)*0.1;
  $  003.OBC输出电流       $    $  A     $    $  ANS003.BYTE004  $  y=(x1*256+x2)*0.1;
  $  004.OBC输入电压       $    $  V     $    $  ANS004.BYTE004  $  y=x1*256+x2;
  $  005.OBC输入电流       $    $  A     $    $  ANS005.BYTE004  $  y=(x1*256+x2)*0.1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:70A 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
