
    车型ID：583b

    模拟：协议模拟-->583b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~790

进入命令:

  $~  REQ000:780 02 10 03 FF FF FF FF FF       $~  ANS000:790 02 10 03 FF FF FF FF FF
  $~  REQ001:780 02 27 03 FF FF FF FF FF       $~  ANS001:790 02 27 03 FF FF FF FF FF
  $~  REQ002:780 04 27 04 1E B0 FF FF FF       $~  ANS002:790 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:780 02 3E 00 FF FF FF FF FF       $!  ANS000:790 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:780 02 10 01 FF FF FF FF FF       $@  ANS000:790 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:780 03 19 02 09 FF FF FF FF       $#  ANS000:790 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/79000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:780 04 14 FF FF FF FF FF FF       $$  ANS000:790 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:780 03 22 F1 80 FF FF FF FF       $%  ANS000:790 03 22 F1 80 FF FF FF FF
  $%  REQ001:780 03 22 F1 86 FF FF FF FF       $%  ANS001:790 03 22 F1 86 FF FF FF FF
  $%  REQ002:780 03 22 F1 87 FF FF FF FF       $%  ANS002:790 03 22 F1 87 FF FF FF FF
  $%  REQ003:780 03 22 F1 88 FF FF FF FF       $%  ANS003:790 03 22 F1 88 FF FF FF FF
  $%  REQ004:780 03 22 F1 B0 FF FF FF FF       $%  ANS004:790 03 22 F1 B0 FF FF FF FF
  $%  REQ005:780 03 22 F1 8A FF FF FF FF       $%  ANS005:790 03 22 F1 8A FF FF FF FF
  $%  REQ006:780 03 22 F1 8B FF FF FF FF       $%  ANS006:790 03 22 F1 8B FF FF FF FF
  $%  REQ007:780 03 22 F1 8C FF FF FF FF       $%  ANS007:790 03 22 F1 8C FF FF FF FF
  $%  REQ008:780 03 22 F1 90 FF FF FF FF       $%  ANS008:790 03 22 F1 90 FF FF FF FF
  $%  REQ009:780 03 22 F1 91 FF FF FF FF       $%  ANS009:790 03 22 F1 91 FF FF FF FF
  $%  REQ010:780 03 22 F1 9D FF FF FF FF       $%  ANS010:790 03 22 F1 9D FF FF FF FF
  $%  REQ011:780 03 22 F1 BF FF FF FF FF       $%  ANS011:790 03 22 F1 BF FF FF FF FF
  $%  REQ012:780 03 22 F1 C0 FF FF FF FF       $%  ANS012:790 03 22 F1 C0 FF FF FF FF

  $%  000:软件版本号:                        $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                  $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                      $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号:                    $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:        $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商代码:                    $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:ECU生产日期:                       $%    $%  ANS006.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  007:控制器序列号:                      $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  008:整车VIN:                           $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:硬件版本号:                        $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  010:ECU装配日期:                       $%    $%  ANS010.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  011:硬件版本号（固定版本）:            $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  012:软件总成版本:                      $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:780 03 22 F0 20 FF FF FF FF       $  ANS000:790 03 22 F0 20 FF FF FF FF
  $  REQ001:780 03 22 F0 44 FF FF FF FF       $  ANS001:790 03 22 F0 44 FF FF FF FF
  $  REQ002:780 03 22 F0 45 FF FF FF FF       $  ANS002:790 03 22 F0 45 FF FF FF FF

  $  000.BMS低压供电电压       $    $  V     $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.电源模式监测          $    $        $    $  ANS001.BYTE004  $  switxh(x) 0x00:y=@0100;0x01:y=@0192;0x02:y=@0223;0x03:y=@0039;0x04:y=@0224;0x05:y=@0225;default: y=-;
  $  002.系统运行状态          $    $        $    $  ANS002.BYTE004  $  switxh(x) 0x00:y=@0117;0x01:y=@0221;0x02:y=@0156;0x03:y=@0222;default: y=-;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:780 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
