
    车型ID：5843

    模拟：协议模拟-->5843

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~734

进入命令:

  $~  REQ000:724 02 10 03 FF FF FF FF FF       $~  ANS000:734 02 10 03 FF FF FF FF FF
  $~  REQ001:724 02 27 03 FF FF FF FF FF       $~  ANS001:734 02 27 03 FF FF FF FF FF
  $~  REQ002:724 04 27 04 1E B0 FF FF FF       $~  ANS002:734 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:724 02 3E 00 FF FF FF FF FF       $!  ANS000:734 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:724 02 10 01 FF FF FF FF FF       $@  ANS000:734 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:724 03 19 02 09 FF FF FF FF       $#  ANS000:734 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/7f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:724 04 14 FF FF FF FF FF FF       $$  ANS000:734 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:724 03 22 F1 80 FF FF FF FF       $%  ANS000:734 03 22 F1 80 FF FF FF FF
  $%  REQ001:724 03 22 F1 86 FF FF FF FF       $%  ANS001:734 03 22 F1 86 FF FF FF FF
  $%  REQ002:724 03 22 F1 87 FF FF FF FF       $%  ANS002:734 03 22 F1 87 FF FF FF FF
  $%  REQ003:724 03 22 F1 88 FF FF FF FF       $%  ANS003:734 03 22 F1 88 FF FF FF FF
  $%  REQ004:724 03 22 F1 B0 FF FF FF FF       $%  ANS004:734 03 22 F1 B0 FF FF FF FF
  $%  REQ005:724 03 22 F1 8A FF FF FF FF       $%  ANS005:734 03 22 F1 8A FF FF FF FF
  $%  REQ006:724 03 22 F1 8B FF FF FF FF       $%  ANS006:734 03 22 F1 8B FF FF FF FF
  $%  REQ007:724 03 22 F1 8C FF FF FF FF       $%  ANS007:734 03 22 F1 8C FF FF FF FF
  $%  REQ008:724 03 22 F1 90 FF FF FF FF       $%  ANS008:734 03 22 F1 90 FF FF FF FF
  $%  REQ009:724 03 22 F1 91 FF FF FF FF       $%  ANS009:734 03 22 F1 91 FF FF FF FF
  $%  REQ010:724 03 22 F1 99 FF FF FF FF       $%  ANS010:734 03 22 F1 99 FF FF FF FF
  $%  REQ011:724 03 22 F1 9D FF FF FF FF       $%  ANS011:734 03 22 F1 9D FF FF FF FF
  $%  REQ012:724 03 22 F1 BF FF FF FF FF       $%  ANS012:734 03 22 F1 BF FF FF FF FF
  $%  REQ013:724 03 22 F1 C0 FF FF FF FF       $%  ANS013:734 03 22 F1 C0 FF FF FF FF

  $%  000:Bootloader软件版本号:                  $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                      $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                          $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号（正常升级版本）:        $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:            $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商代码:                        $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:ECU生产日期:                           $%    $%  ANS006.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  007:控制器序列号:                          $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:整车VIN:                               $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:硬件版本号:                            $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  010:刷新日期:                              $%    $%  ANS010.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  011:ECU装配日期:                           $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  012:硬件版本号（固定版本）:                $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  013:软件总成版本:                          $%    $%  ANS013.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:724 03 22 05 06 FF FF FF FF       $  ANS000:734 03 22 05 06 FF FF FF FF
  $  REQ001:724 03 22 05 07 FF FF FF FF       $  ANS001:734 03 22 05 07 FF FF FF FF
  $  REQ002:724 03 22 05 08 FF FF FF FF       $  ANS002:734 03 22 05 08 FF FF FF FF
  $  REQ003:724 03 22 05 09 FF FF FF FF       $  ANS003:734 03 22 05 09 FF FF FF FF
  $  REQ004:724 03 22 05 10 FF FF FF FF       $  ANS004:734 03 22 05 10 FF FF FF FF
  $  REQ005:724 03 22 05 11 FF FF FF FF       $  ANS005:734 03 22 05 11 FF FF FF FF
  $  REQ006:724 03 22 05 12 FF FF FF FF       $  ANS006:734 03 22 05 12 FF FF FF FF
  $  REQ007:724 03 22 05 13 FF FF FF FF       $  ANS007:734 03 22 05 13 FF FF FF FF
  $  REQ008:724 03 22 05 14 FF FF FF FF       $  ANS008:734 03 22 05 14 FF FF FF FF
  $  REQ009:724 03 22 05 17 FF FF FF FF       $  ANS009:734 03 22 05 17 FF FF FF FF
  $  REQ010:724 03 22 05 19 FF FF FF FF       $  ANS010:734 03 22 05 19 FF FF FF FF

  $  000.转向力矩                 $    $  Nm           $    $  ANS000.BYTE004  $  y=(x1*256+x2)/4096-8;
  $  001.系统运行模式             $    $  —           $    $  ANS001.BYTE004  $  switxh(x) 0x01:y=@0040;0x02:y=@0041;0x03:y=@0042;0x04:y=@0043;default: y=@0007;
  $  002.电源电压                 $    $  V            $    $  ANS002.BYTE005  $  y=(x1*256+x2)/50;
  $  003.助力使能信号             $    $  —           $    $  ANS003.BYTE004  $  switxh(x) 0x00:y=@0038;0x01:y=@0039;default: y=@0007;
  $  004.主扭矩信号周期           $    $  us           $    $  ANS004.BYTE004  $  y=(x1*256+x2)/10;
  $  005.辅扭矩信号周期           $    $  us           $    $  ANS004.BYTE006  $  y=(x1*256+x2)/10;
  $  006.主扭矩信号占空比         $    $  %            $    $  ANS004.BYTE008  $  y=(x1*256+x2)*100/4096;
  $  007.辅扭矩信号占空比         $    $  %            $    $  ANS004.BYTE010  $  y=(x1*256+x2)*100/4096;
  $  008.主角度信号周期           $    $  us           $    $  ANS005.BYTE004  $  y=(x1*256+x2)/10;
  $  009.辅角度信号周期           $    $  us           $    $  ANS005.BYTE006  $  y=(x1*256+x2)/10;
  $  010.主角度信号占空比         $    $  %            $    $  ANS005.BYTE008  $  y=(x1*256+x2)*100/4096;
  $  011.辅角度信号占空比         $    $  %            $    $  ANS005.BYTE010  $  y=(x1*256+x2)*100/4096;
  $  012.ECU温度                  $    $  degree C     $    $  ANS006.BYTE004  $  y=x1*256+x2-32768;
  $  013.EPS 扭矩传感器电压       $    $  V            $    $  ANS007.BYTE004  $  y=(x1*256+x2)*5/1024;
  $  014.MCU电压                  $    $  V            $    $  ANS008.BYTE004  $  y=(x1*256+x2)*9/1024;
  $  015.车速                     $    $  km/h         $    $  ANS009.BYTE004  $  y=x;
  $  016.转向角度                 $    $  degree       $    $  ANS010.BYTE004  $  y=(x1*256+x2)/16-2048;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:724 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
