
    车型ID：584d

    模拟：协议模拟-->584d

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~772

进入命令:

  $~  REQ000:762 02 10 03 FF FF FF FF FF       $~  ANS000:772 02 10 03 FF FF FF FF FF
  $~  REQ001:762 02 27 03 FF FF FF FF FF       $~  ANS001:772 02 27 03 FF FF FF FF FF
  $~  REQ002:762 04 27 04 1E B0 FF FF FF       $~  ANS002:772 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:762 02 3E 00 FF FF FF FF FF       $!  ANS000:772 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:762 02 10 01 FF FF FF FF FF       $@  ANS000:772 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:762 03 19 02 09 FF FF FF FF       $#  ANS000:772 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/89000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:762 04 14 FF FF FF FF FF FF       $$  ANS000:772 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:762 03 22 F1 80 FF FF FF FF       $%  ANS000:772 03 22 F1 80 FF FF FF FF
  $%  REQ001:762 03 22 F1 86 FF FF FF FF       $%  ANS001:772 03 22 F1 86 FF FF FF FF
  $%  REQ002:762 03 22 F1 87 FF FF FF FF       $%  ANS002:772 03 22 F1 87 FF FF FF FF
  $%  REQ003:762 03 22 F1 88 FF FF FF FF       $%  ANS003:772 03 22 F1 88 FF FF FF FF
  $%  REQ004:762 03 22 F1 B0 FF FF FF FF       $%  ANS004:772 03 22 F1 B0 FF FF FF FF
  $%  REQ005:762 03 22 F1 8A FF FF FF FF       $%  ANS005:772 03 22 F1 8A FF FF FF FF
  $%  REQ006:762 03 22 F1 8B FF FF FF FF       $%  ANS006:772 03 22 F1 8B FF FF FF FF
  $%  REQ007:762 03 22 F1 8C FF FF FF FF       $%  ANS007:772 03 22 F1 8C FF FF FF FF
  $%  REQ008:762 03 22 F1 90 FF FF FF FF       $%  ANS008:772 03 22 F1 90 FF FF FF FF
  $%  REQ009:762 03 22 F1 91 FF FF FF FF       $%  ANS009:772 03 22 F1 91 FF FF FF FF
  $%  REQ010:762 03 22 F1 98 FF FF FF FF       $%  ANS010:772 03 22 F1 98 FF FF FF FF
  $%  REQ011:762 03 22 F1 99 FF FF FF FF       $%  ANS011:772 03 22 F1 99 FF FF FF FF
  $%  REQ012:762 03 22 F1 9D FF FF FF FF       $%  ANS012:772 03 22 F1 9D FF FF FF FF
  $%  REQ013:762 03 22 F3 FF FF FF FF FF       $%  ANS013:772 03 22 F3 FF FF FF FF FF
  $%  REQ014:762 03 22 F3 FE FF FF FF FF       $%  ANS014:772 03 22 F3 FE FF FF FF FF
  $%  REQ015:762 03 22 F1 BF FF FF FF FF       $%  ANS015:772 03 22 F1 BF FF FF FF FF
  $%  REQ016:762 03 22 F1 C0 FF FF FF FF       $%  ANS016:772 03 22 F1 C0 FF FF FF FF

  $%  000:软件版本号:                        $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                  $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                      $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  003:应用软件版本号:                    $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:        $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商代码:                    $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:ECU生产日期:                       $%    $%  ANS006.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  007:控制器序列号:                      $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  008:整车VIN:                           $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:硬件版本号:                        $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  010:诊断设备序列号:                    $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:刷新日期:                          $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  012:ECU装配日期:                       $%    $%  ANS012.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  013:KL30电压值读取:                    $%    $%  ANS013.BYTE004  $%  y=x1*256+x2;
  $%  014:KL15电压值读取:                    $%    $%  ANS014.BYTE004  $%  y=x1*256+x2;
  $%  015:硬件版本号（固定版本）:            $%    $%  ANS015.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  016:软件总成版本:                      $%    $%  ANS016.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:762 03 22 F0 20 FF FF FF FF       $  ANS000:772 03 22 F0 20 FF FF FF FF
  $  REQ001:762 03 22 F0 21 FF FF FF FF       $  ANS001:772 03 22 F0 21 FF FF FF FF
  $  REQ002:762 03 22 F0 22 FF FF FF FF       $  ANS002:772 03 22 F0 22 FF FF FF FF
  $  REQ003:762 03 22 F0 43 FF FF FF FF       $  ANS003:772 03 22 F0 43 FF FF FF FF

  $  000.铅酸电池电压             $    $  V     $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.A+电压值                 $    $  V     $    $  ANS001.BYTE004  $  y=x*0.1;
  $  002.放电最高故障等级         $    $        $    $  ANS002.BYTE004  $  switxh(x&0x07) 0x00:y=@0000;0x01:y=@0233;0x02:y=@0395;0x03:y=@0234;0x04:y=@0396;0x05:y=@0397;0x06:y=@0398;0x07:y=@0399;default: y=@0007;
  $  003.充电最高故障等级         $    $        $    $  ANS002.BYTE004  $  switxh(x&0x38) 0x00:y=@0000;0x08:y=@0233;0x10:y=@0395;0x18:y=@0234;0x20:y=@0396;0x28:y=@0397;0x30:y=@0398;0x38:y=@0399;default: y=@0007;
  $  004.VCU通信故障              $    $        $    $  ANS002.BYTE004  $  switxh(x&0x40) 0x40:y=@0220;default: y=@0096;
  $  005.整车CAN BusOff故障       $    $        $    $  ANS002.BYTE004  $  switxh(x&0x80) 0x80:y=@0095;default: y=@0096;
  $  006.电池工作状态             $    $        $    $  ANS003.BYTE004  $  switxh(x&0x03) 0x00:y=@0117;0x01:y=@0218;0x02:y=@0219;default: y=-;
  $  007.电池加热状态             $    $        $    $  ANS003.BYTE004  $  switxh(x&0x0c) 0x00:y=@0088;0x04:y=@0089;0x08:y=@0090;default: y=-;
  $  008.电池充电状态             $    $        $    $  ANS003.BYTE004  $  switxh(x&0x30) 0x00:y=@0091;0x10:y=@0092;0x20:y=@0093;default: y=@0094;
  $  009.VCU控制指令              $    $        $    $  ANS003.BYTE004  $  switxh(x&0xc0) 0x00:y=@0075;0x40:y=@0175;default: y=-;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:762 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
