
    车型ID：584e

    模拟：协议模拟-->584e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7D0

进入命令:

  $~  REQ000:7C0 02 10 03 FF FF FF FF FF       $~  ANS000:7D0 02 10 03 FF FF FF FF FF
  $~  REQ001:7C0 02 27 03 FF FF FF FF FF       $~  ANS001:7D0 02 27 03 FF FF FF FF FF
  $~  REQ002:7C0 04 27 04 1E B0 FF FF FF       $~  ANS002:7D0 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:7C0 02 3E 00 FF FF FF FF FF       $!  ANS000:7D0 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:7C0 02 10 01 FF FF FF FF FF       $@  ANS000:7D0 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7C0 03 19 02 09 FF FF FF FF       $#  ANS000:7D0 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/8a000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7C0 04 14 FF FF FF FF FF FF       $$  ANS000:7D0 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7C0 03 22 F1 80 FF FF FF FF       $%  ANS000:7D0 03 22 F1 80 FF FF FF FF
  $%  REQ001:7C0 03 22 F1 86 FF FF FF FF       $%  ANS001:7D0 03 22 F1 86 FF FF FF FF
  $%  REQ002:7C0 03 22 F1 87 FF FF FF FF       $%  ANS002:7D0 03 22 F1 87 FF FF FF FF
  $%  REQ003:7C0 03 22 F1 88 FF FF FF FF       $%  ANS003:7D0 03 22 F1 88 FF FF FF FF
  $%  REQ004:7C0 03 22 F1 B0 FF FF FF FF       $%  ANS004:7D0 03 22 F1 B0 FF FF FF FF
  $%  REQ005:7C0 03 22 F1 A2 FF FF FF FF       $%  ANS005:7D0 03 22 F1 A2 FF FF FF FF
  $%  REQ006:7C0 03 22 F1 8A FF FF FF FF       $%  ANS006:7D0 03 22 F1 8A FF FF FF FF
  $%  REQ007:7C0 03 22 F1 8B FF FF FF FF       $%  ANS007:7D0 03 22 F1 8B FF FF FF FF
  $%  REQ008:7C0 03 22 F1 8C FF FF FF FF       $%  ANS008:7D0 03 22 F1 8C FF FF FF FF
  $%  REQ009:7C0 03 22 F1 90 FF FF FF FF       $%  ANS009:7D0 03 22 F1 90 FF FF FF FF
  $%  REQ010:7C0 03 22 F1 91 FF FF FF FF       $%  ANS010:7D0 03 22 F1 91 FF FF FF FF
  $%  REQ011:7C0 03 22 F1 98 FF FF FF FF       $%  ANS011:7D0 03 22 F1 98 FF FF FF FF
  $%  REQ012:7C0 03 22 F1 99 FF FF FF FF       $%  ANS012:7D0 03 22 F1 99 FF FF FF FF
  $%  REQ013:7C0 03 22 F1 9D FF FF FF FF       $%  ANS013:7D0 03 22 F1 9D FF FF FF FF
  $%  REQ014:7C0 03 22 F1 BF FF FF FF FF       $%  ANS014:7D0 03 22 F1 BF FF FF FF FF
  $%  REQ015:7C0 03 22 F1 C0 FF FF FF FF       $%  ANS015:7D0 03 22 F1 C0 FF FF FF FF

  $%  000:软件版本号:                        $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                  $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                      $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号:                    $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:        $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:ECU标定软件号:                     $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  006:系统供应商代码:                    $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  007:ECU生产日期:                       $%    $%  ANS007.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  008:控制器序列号:                      $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  009:整车VIN:                           $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  010:硬件版本号:                        $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  011:诊断设备序列号:                    $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  012:刷新日期:                          $%    $%  ANS012.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  013:ECU装配日期:                       $%    $%  ANS013.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  014:硬件版本号:                        $%    $%  ANS014.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  015:软件总成版本:                      $%    $%  ANS015.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7C0 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
