
    车型ID：585f

    模拟：协议模拟-->585f

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k$~734

进入命令:

  $~  REQ000:724 02 10 03 FF FF FF FF FF       $~  ANS000:734 02 10 03 FF FF FF FF FF
  $~  REQ001:724 02 27 03 FF FF FF FF FF       $~  ANS001:734 02 27 03 FF FF FF FF FF
  $~  REQ002:724 04 27 04 1E B0 FF FF FF       $~  ANS002:734 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:724 02 3E 00 FF FF FF FF FF       $!  ANS000:734 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:724 02 10 01 FF FF FF FF FF       $@  ANS000:734 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:724 03 19 02 09 FF FF FF FF       $#  ANS000:734 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/99000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:724 04 14 FF FF FF FF FF FF       $$  ANS000:734 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:724 03 22 F1 80 FF FF FF FF       $%  ANS000:734 03 22 F1 80 FF FF FF FF
  $%  REQ001:724 03 22 F1 86 FF FF FF FF       $%  ANS001:734 03 22 F1 86 FF FF FF FF
  $%  REQ002:724 03 22 F1 87 FF FF FF FF       $%  ANS002:734 03 22 F1 87 FF FF FF FF
  $%  REQ003:724 03 22 F1 88 FF FF FF FF       $%  ANS003:734 03 22 F1 88 FF FF FF FF
  $%  REQ004:724 03 22 F1 B0 FF FF FF FF       $%  ANS004:734 03 22 F1 B0 FF FF FF FF
  $%  REQ005:724 03 22 F1 8A FF FF FF FF       $%  ANS005:734 03 22 F1 8A FF FF FF FF
  $%  REQ006:724 03 22 F1 8B FF FF FF FF       $%  ANS006:734 03 22 F1 8B FF FF FF FF
  $%  REQ007:724 03 22 F1 8C FF FF FF FF       $%  ANS007:734 03 22 F1 8C FF FF FF FF
  $%  REQ008:724 03 22 F1 90 FF FF FF FF       $%  ANS008:734 03 22 F1 90 FF FF FF FF
  $%  REQ009:724 03 22 F1 91 FF FF FF FF       $%  ANS009:734 03 22 F1 91 FF FF FF FF
  $%  REQ010:724 03 22 F1 98 FF FF FF FF       $%  ANS010:734 03 22 F1 98 FF FF FF FF
  $%  REQ011:724 03 22 F1 99 FF FF FF FF       $%  ANS011:734 03 22 F1 99 FF FF FF FF
  $%  REQ012:724 03 22 F1 BF FF FF FF FF       $%  ANS012:734 03 22 F1 BF FF FF FF FF
  $%  REQ013:724 03 22 F1 C0 FF FF FF FF       $%  ANS013:734 03 22 F1 C0 FF FF FF FF
  $%  REQ014:724 03 22 F1 9D FF FF FF FF       $%  ANS014:734 03 22 F1 9D FF FF FF FF
  $%  REQ015:724 03 22 F1 D0 FF FF FF FF       $%  ANS015:734 03 22 F1 D0 FF FF FF FF

  $%  000:Bootloader软件版本号:                    $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                        $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                            $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号（正常升级版本）:          $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:              $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商代码:                          $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:ECU生产日期:                             $%    $%  ANS006.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  007:控制器序列号:                            $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  008:整车VIN:                                 $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:硬件版本号:                              $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  010:TesterSerialNumberDataIdentifier:        $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:刷新日期:                                $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  012:应用硬件版本号（固定版本）:              $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  013:软件总成版本号:                          $%    $%  ANS013.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  014:ECU装配日期:                             $%    $%  ANS014.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  015:软件总成零件号:                          $%    $%  ANS015.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:724 03 22 03 00 FF FF FF FF       $  ANS000:734 03 22 03 00 FF FF FF FF

  $  000.Battery Voltage              $    $  V        $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.HW-Torque                    $    $  Nm       $    $  ANS000.BYTE005  $  y=x*0.1-12.7;
  $  002.HW-Angle                     $    $  Deg      $    $  ANS000.BYTE006  $  y=x*0.1-3276.7;
  $  003.HW-Angle1                    $    $  Deg      $    $  ANS000.BYTE007  $  y=x*0.1-3276.7;
  $  004.VehicleSpeed                 $    $  km/h     $    $  ANS000.BYTE008  $  y=x;
  $  005.Feedback Motor Current       $    $  A        $    $  ANS000.BYTE009  $  y=x-127;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:724 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
