
    车型ID：2406

    模拟：协议模拟-->2406

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k

进入命令:

  $~  REQ000:762 02 10 01 00 00 00 00 00       $~  ANS000:76A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:762 02 3E 00 00 00 00 00 00       $!  ANS000:76A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读当前故障码
  $#  REQ000:762 03 19 02 09 00 00 00 00       $#  ANS000:76A 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/14000000


  $#  01.读历史故障码
  $#  REQ000:762 03 19 02 08 00 00 00 00       $#  ANS000:76A 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/14000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:762 04 14 FF FF FF 00 00 00       $$  ANS000:76A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:762 03 22 F1 87 00 00 00 00       $%  ANS000:76A 03 22 F1 87 00 00 00 00
  $%  REQ001:762 03 22 F1 88 00 00 00 00       $%  ANS001:76A 03 22 F1 88 00 00 00 00
  $%  REQ002:762 03 22 F1 89 00 00 00 00       $%  ANS002:76A 03 22 F1 89 00 00 00 00
  $%  REQ003:762 03 22 F1 8A 00 00 00 00       $%  ANS003:76A 03 22 F1 8A 00 00 00 00
  $%  REQ004:762 03 22 F1 8B 00 00 00 00       $%  ANS004:76A 03 22 F1 8B 00 00 00 00
  $%  REQ005:762 03 22 F1 8C 00 00 00 00       $%  ANS005:76A 03 22 F1 8C 00 00 00 00
  $%  REQ006:762 03 22 F1 90 00 00 00 00       $%  ANS006:76A 03 22 F1 90 00 00 00 00
  $%  REQ007:762 03 22 F1 91 00 00 00 00       $%  ANS007:76A 03 22 F1 91 00 00 00 00
  $%  REQ008:762 03 22 F1 92 00 00 00 00       $%  ANS008:76A 03 22 F1 92 00 00 00 00
  $%  REQ009:762 03 22 F1 93 00 00 00 00       $%  ANS009:76A 03 22 F1 93 00 00 00 00
  $%  REQ010:762 03 22 F1 94 00 00 00 00       $%  ANS010:76A 03 22 F1 94 00 00 00 00
  $%  REQ011:762 03 22 F1 95 00 00 00 00       $%  ANS011:76A 03 22 F1 95 00 00 00 00
  $%  REQ012:762 03 22 F1 99 00 00 00 00       $%  ANS012:76A 03 22 F1 99 00 00 00 00
  $%  REQ013:762 03 22 F1 9D 00 00 00 00       $%  ANS013:76A 03 22 F1 9D 00 00 00 00
  $%  REQ014:762 03 22 FD 01 00 00 00 00       $%  ANS014:76A 03 22 FD 01 00 00 00 00
  $%  REQ015:762 03 22 FD 02 00 00 00 00       $%  ANS015:76A 03 22 FD 02 00 00 00 00
  $%  REQ016:762 03 22 FD 55 00 00 00 00       $%  ANS016:76A 03 22 FD 55 00 00 00 00
  $%  REQ017:762 03 22 FD 93 00 00 00 00       $%  ANS017:76A 03 22 FD 93 00 00 00 00
  $%  REQ018:762 03 22 FD 95 00 00 00 00       $%  ANS018:76A 03 22 FD 95 00 00 00 00

  $%  000:海马预留的零部件号:                   $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%c%c%c%02X%c%c%c],X1,X2,X3,X4,X5,X6,X7,X8);
  $%  001:海马ECU软件号:                        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%c%c%c%02X%c%c%c],X1,X2,X3,X4,X5,X6,X7,X8);
  $%  002:海马ECU软件版本号:                    $%    $%  ANS002.BYTE004  $%  HEX(X1,X2);
  $%  003:ECU供应商的ID:                        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X%02X%c%02X],X1,X2,X3,X4);
  $%  004:ECU生产日期:                          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],X1,X2,X3,X4);
  $%  005:ECU序列号:                            $%    $%  ANS005.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7);
  $%  006:VIN:                                  $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  007:海马ECU硬件零部件号:                  $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%c%c%c%c%02X%c],X1,X2,X3,X4,X5,X6,X7);
  $%  008:供应商ECU硬件零部件号:                $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  009:供应商ECU硬件本版号:                  $%    $%  ANS009.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  010:供应商ECU软件零部件号:                $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  011:供应商ECU软件版本号:                  $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  012:程序下载日期:                         $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],X1,X2,X3,X4);
  $%  013:ECU安装日期:                          $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],X1,X2,X3,X4);
  $%  014:boot软件零部件号:                     $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  015:boot软件版本号:                       $%    $%  ANS015.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  016:产品序列号:                           $%    $%  ANS016.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  017:电子转向管柱锁(ESCL)硬件版本号:       $%    $%  ANS017.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  018:电子转向管柱锁(ESCL)软件版本号:       $%    $%  ANS018.BYTE004  $%  HEX(X1,X2,X3,X4,X5);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.一键启动控制系统(PEPS)常规数据1
  $  00.一键启动控制系统(PEPS)常规数据1
  $  REQ000:762 03 22 F1 86 00 00 00 00       $  ANS000:76A 03 22 F1 86 00 00 00 00
  $  REQ001:762 03 22 FE 06 00 00 00 00       $  ANS001:76A 03 22 FE 06 00 00 00 00
  $  REQ002:762 03 22 FE 05 00 00 00 00       $  ANS002:76A 03 22 FE 05 00 00 00 00
  $  REQ003:762 03 22 FE 07 00 00 00 00       $  ANS003:76A 03 22 FE 07 00 00 00 00
  $  REQ004:762 03 22 FE 08 00 00 00 00       $  ANS004:76A 03 22 FE 08 00 00 00 00
  $  REQ005:762 03 22 FE 0D 00 00 00 00       $  ANS005:76A 03 22 FE 0D 00 00 00 00
  $  REQ006:762 03 22 FE 0E 00 00 00 00       $  ANS006:76A 03 22 FE 0E 00 00 00 00
  $  REQ007:762 03 22 FE 0F 00 00 00 00       $  ANS007:76A 03 22 FE 0F 00 00 00 00
  $  REQ008:762 03 22 FE 0C 00 00 00 00       $  ANS008:76A 03 22 FE 0C 00 00 00 00
  $  REQ009:762 03 22 FD 15 00 00 00 00       $  ANS009:76A 03 22 FD 15 00 00 00 00
  $  REQ010:762 03 22 FD 16 00 00 00 00       $  ANS010:76A 03 22 FD 16 00 00 00 00
  $  REQ011:762 03 22 FD 17 00 00 00 00       $  ANS011:76A 03 22 FD 17 00 00 00 00
  $  REQ012:762 03 22 FD 18 00 00 00 00       $  ANS012:76A 03 22 FD 18 00 00 00 00

  $  000.当前诊断模式                                     $    $            $    $  ANS000.BYTE004  $  if(x==0x01)y=@0008;else if(x==0x02)y=@003b;else if(x==0x03)y=@003c;else if(x==0x60)y=@003d;else y=@0003;
  $  001.司机侧门的门状态                                 $    $            $    $  ANS001.BYTE004  $  if((x&0x80)==0x00)y=@0021;else if((x&0x80)==0x80)y=@003a;else y=@0003;
  $  002.副司机侧门的门状态                               $    $            $    $  ANS001.BYTE004  $  if((x&0x40)==0x00)y=@0021;else if((x&0x40)==0x40)y=@003a;else y=@0003;
  $  003.后备箱门的门状态                                 $    $            $    $  ANS001.BYTE004  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  004.引擎盖的状态                                     $    $            $    $  ANS001.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  005.电子转向柱(ESCL)锁舌的状态                       $    $            $    $  ANS001.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  006.手刹信号                                         $    $            $    $  ANS001.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  007.预留信号2                                        $    $            $    $  ANS001.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  008.离合信号                                         $    $            $    $  ANS001.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  009.预留信号1                                        $    $            $    $  ANS001.BYTE005  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  010.左后门的开关状态                                 $    $            $    $  ANS001.BYTE005  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  011.右后门的开关状态                                 $    $            $    $  ANS001.BYTE005  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  012.后备箱开关的状态                                 $    $            $    $  ANS001.BYTE005  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  013.左前门的开关状态                                 $    $            $    $  ANS001.BYTE005  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  014.右前门的开关状态                                 $    $            $    $  ANS001.BYTE005  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  015.电源电压                                         $    $            $    $  ANS002.BYTE004  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  016.开始继电器的反馈状态                             $    $            $    $  ANS002.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  017.IGN2继电器的反馈状态                             $    $            $    $  ANS002.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  018.IGN1b继电器的反馈状态                            $    $            $    $  ANS002.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  019.IGN1a继电器的反馈状态                            $    $            $    $  ANS002.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  020.自适应巡航控制(ACC)继电器的反馈状态              $    $            $    $  ANS002.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  021.N档信号                                          $    $            $    $  ANS002.BYTE005  $  if((x&0x80)==0x00)y=@0021;else if((x&0x80)==0x80)y=@003a;else y=@0003;
  $  022.P档信号                                          $    $            $    $  ANS002.BYTE005  $  if((x&0x40)==0x00)y=@0021;else if((x&0x40)==0x40)y=@003a;else y=@0003;
  $  023.刹车开关2信号                                    $    $            $    $  ANS002.BYTE005  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  024.刹车开关1信号                                    $    $            $    $  ANS002.BYTE005  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  025.电源电压                                         $    $            $    $  ANS002.BYTE005  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  026.电源电压                                         $    $            $    $  ANS002.BYTE005  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  027.一键启动开关2的开关状态                          $    $            $    $  ANS002.BYTE005  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  028.一键启动开关1的开关状态                          $    $            $    $  ANS002.BYTE005  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  029.车速信号                                         $    $  km/h      $    $  ANS003.BYTE004  $  y=x;
  $  030.转速信号                                         $    $  1/min     $    $  ANS004.BYTE004  $  y=x*32;
  $  031.找不到钥匙报警灯的反馈信号                       $    $            $    $  ANS005.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  032.一键启动开关LED2的反馈信号                       $    $            $    $  ANS005.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  033.一键启动开关LED1的反馈信号                       $    $            $    $  ANS005.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  034.一键启动控制系统(PEPS)失败报警灯的反馈信号       $    $            $    $  ANS005.BYTE005  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  035.开始继电器驱动的反馈信号                         $    $            $    $  ANS006.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  036.IGN2继电器驱动的反馈信号                         $    $            $    $  ANS006.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  037.IGN1b继电器驱动的反馈信号                        $    $            $    $  ANS006.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  038.IGN1a继电器驱动的反馈信号                        $    $            $    $  ANS006.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  039.ACC继电器驱动的反馈信号                          $    $            $    $  ANS006.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  040.电子转向柱(ESCL)电源电压                         $    $            $    $  ANS007.BYTE004  $  if((x&0x40)==0x00)y=@0021;else if((x&0x40)==0x40)y=@003a;else y=@0003;
  $  041.电子转向柱(ESCL)供地的反馈信号                   $    $            $    $  ANS007.BYTE004  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  042.电子转向柱(ESCL)使能信号的反馈信号               $    $            $    $  ANS007.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  043.防抱死刹车系统(ABS)电源的反馈信号                $    $            $    $  ANS007.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  044.防抱死刹车系统(ABS)电源的电压                    $    $            $    $  ANS007.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  045.门上锁信号的反馈信号                             $    $            $    $  ANS007.BYTE005  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  046.门解锁信号的反馈信号                             $    $            $    $  ANS007.BYTE005  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  047.喇叭的反馈信号                                   $    $            $    $  ANS007.BYTE005  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  048.电源电压                                         $    $  V         $    $  ANS008.BYTE004  $  y=x*0.1;
  $  049.电源电压                                         $    $  V         $    $  ANS008.BYTE005  $  y=x*0.1;
  $  050.电源电压                                         $    $  V         $    $  ANS008.BYTE006  $  y=x*0.1;
  $  051.BAT_ECU电压数据                                  $    $            $    $  ANS009.BYTE004  $  y=x;
  $  052.BAT_安全电压数据                                 $    $            $    $  ANS010.BYTE004  $  y=x;
  $  053.BAT_PDM电压数据                                  $    $            $    $  ANS011.BYTE004  $  y=x;
  $  054.电压数据                                         $    $            $    $  ANS012.BYTE004  $  y=x;

  $)  01.一键启动控制系统(PEPS)常规数据2
  $  01.一键启动控制系统(PEPS)常规数据2
  $  REQ000:762 03 22 FD 20 00 00 00 00       $  ANS000:76A 03 22 FD 20 00 00 00 00
  $  REQ001:762 03 22 FD 21 00 00 00 00       $  ANS001:76A 03 22 FD 21 00 00 00 00
  $  REQ002:762 03 22 FD 22 00 00 00 00       $  ANS002:76A 03 22 FD 22 00 00 00 00
  $  REQ003:762 03 22 FD 23 00 00 00 00       $  ANS003:76A 03 22 FD 23 00 00 00 00
  $  REQ004:762 03 22 FD 25 00 00 00 00       $  ANS004:76A 03 22 FD 25 00 00 00 00
  $  REQ005:762 03 22 FD 24 00 00 00 00       $  ANS005:76A 03 22 FD 24 00 00 00 00
  $  REQ006:762 03 22 FD 26 00 00 00 00       $  ANS006:76A 03 22 FD 26 00 00 00 00
  $  REQ007:762 03 22 FD 27 00 00 00 00       $  ANS007:76A 03 22 FD 27 00 00 00 00
  $  REQ008:762 03 22 FD 28 00 00 00 00       $  ANS008:76A 03 22 FD 28 00 00 00 00
  $  REQ009:762 03 22 FD 29 00 00 00 00       $  ANS009:76A 03 22 FD 29 00 00 00 00
  $  REQ010:762 03 22 FD 30 00 00 00 00       $  ANS010:76A 03 22 FD 30 00 00 00 00
  $  REQ011:762 03 22 FD 31 00 00 00 00       $  ANS011:76A 03 22 FD 31 00 00 00 00
  $  REQ012:762 03 22 FD 32 00 00 00 00       $  ANS012:76A 03 22 FD 32 00 00 00 00
  $  REQ013:762 03 22 FD 34 00 00 00 00       $  ANS013:76A 03 22 FD 34 00 00 00 00
  $  REQ014:762 03 22 FD 33 00 00 00 00       $  ANS014:76A 03 22 FD 33 00 00 00 00
  $  REQ015:762 03 22 FD 35 00 00 00 00       $  ANS015:76A 03 22 FD 35 00 00 00 00

  $  000.车型选择                                  $    $            $    $  ANS000.BYTE004  $  if((x&0xc0)==0x00)y=@0038;else if((x&0xc0)==0x40)y=@0039;else y=@0003;
  $  001.自动手动选择                              $    $            $    $  ANS001.BYTE004  $  if((x&0x80)==0x00)y=@0036;else if((x&0x80)==0x80)y=@0037;else y=@0003;
  $  002.P/N选择                                   $    $            $    $  ANS002.BYTE004  $  if((x&0x80)==0x00)y=@0034;else if((x&0x80)==0x80)y=@0035;else y=@0003;
  $  003.司机侧门的天线                            $    $            $    $  ANS003.BYTE004  $  if((x&0x80)==0x00)y=@0032;else if((x&0x80)==0x80)y=@0033;else y=@0003;
  $  004.副司机侧门的天线                          $    $            $    $  ANS003.BYTE004  $  if((x&0x40)==0x00)y=@0032;else if((x&0x40)==0x40)y=@0033;else y=@0003;
  $  005.左/右后门的天线                           $    $            $    $  ANS003.BYTE004  $  if((x&0x20)==0x00)y=@0032;else if((x&0x20)==0x20)y=@0033;else y=@0003;
  $  006.后备箱天线                                $    $            $    $  ANS003.BYTE004  $  if((x&0x10)==0x00)y=@0032;else if((x&0x10)==0x10)y=@0033;else y=@0003;
  $  007.保险杠天线                                $    $            $    $  ANS003.BYTE004  $  if((x&0x08)==0x00)y=@0032;else if((x&0x08)==0x08)y=@0033;else y=@0003;
  $  008.车内前部天线                              $    $            $    $  ANS003.BYTE004  $  if((x&0x04)==0x00)y=@0032;else if((x&0x04)==0x04)y=@0033;else y=@0003;
  $  009.车内中部天线                              $    $            $    $  ANS003.BYTE004  $  if((x&0x02)==0x00)y=@0032;else if((x&0x02)==0x02)y=@0033;else y=@0003;
  $  010.车内后部天线                              $    $            $    $  ANS003.BYTE004  $  if((x&0x01)==0x00)y=@0032;else if((x&0x01)==0x01)y=@0033;else y=@0003;
  $  011.后备箱微动开关                            $    $            $    $  ANS004.BYTE004  $  if((x&0xc0)==0x00)y=@002f;else if((x&0xc0)==0x40)y=@0030;else if((x&0xc0)==0x80)y=@0031;else y=@0003;
  $  012.左前门微动开关                            $    $            $    $  ANS005.BYTE004  $  if((x&0xc0)==0x00)y=@002f;else if((x&0xc0)==0x40)y=@0030;else if((x&0xc0)==0x80)y=@0031;else y=@0003;
  $  013.右前门微动开关                            $    $            $    $  ANS005.BYTE004  $  if((x&0x30)==0x00)y=@002f;else if((x&0x30)==0x10)y=@0030;else if((x&0x30)==0x20)y=@0031;else y=@0003;
  $  014.左后门微动开关                            $    $            $    $  ANS005.BYTE004  $  if((x&0x0c)==0x00)y=@002f;else if((x&0x0c)==0x04)y=@0030;else if((x&0x0c)==0x08)y=@0031;else y=@0003;
  $  015.右后门微动开关                            $    $            $    $  ANS005.BYTE004  $  if((x&0x03)==0x00)y=@002f;else if((x&0x03)==0x01)y=@0030;else if((x&0x03)==0x02)y=@0031;else y=@0003;
  $  016.发动机启动时转速阀值                      $    $  1/min     $    $  ANS006.BYTE004  $  y=x*4;
  $  017.发动机停止时转速阀值                      $    $  1/min     $    $  ANS007.BYTE004  $  y=x*4;
  $  018.发动机启动时间参数                        $    $  ms        $    $  ANS008.BYTE004  $  y=x*25;
  $  019.转速误差值                                $    $  1/min     $    $  ANS009.BYTE004  $  y=x*4;
  $  020.遥控无钥匙进入(RKE)使能                   $    $            $    $  ANS010.BYTE004  $  if((x&0x80)==0x00)y=@0027;else if((x&0x80)==0x80)y=@0028;else y=@0003;
  $  021.遥控无钥匙进入(RKE)编码类型               $    $            $    $  ANS010.BYTE004  $  if((x&0x60)==0x20)y=@0025;else if((x&0x60)==0x40)y=@0026;else y=@0003;
  $  022.遥控无钥匙进入(RKE)频率                   $    $            $    $  ANS010.BYTE004  $  if((x&0x1c)==0x04)y=@002c;else if((x&0x1c)==0x08)y=@002d;else if((x&0x1c)==0x10)y=@002e;else y=@0003;
  $  023.操作模式选择                              $    $            $    $  ANS010.BYTE004  $  if((x&0x03)==0x00)y=@0029;else if((x&0x03)==0x01)y=@002a;else if((x&0x03)==0x02)y=@002b;else y=@0003;
  $  024.后备箱的PKS                               $    $            $    $  ANS011.BYTE004  $  if((x&0x80)==0x00)y=@0021;else if((x&0x80)==0x80)y=@003a;else y=@0003;
  $  025.后备箱上锁查找车外钥匙                    $    $            $    $  ANS011.BYTE004  $  if((x&0x40)==0x00)y=@0021;else if((x&0x40)==0x40)y=@003a;else y=@0003;
  $  026.后备箱上锁查找车内钥匙                    $    $            $    $  ANS011.BYTE004  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  027.后备箱上锁查找后备箱钥匙                  $    $            $    $  ANS011.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  028.被动无钥匙进入(PKE)上锁查找车外钥匙       $    $            $    $  ANS011.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  029.钥匙找到后其结果保持的时间                $    $  s         $    $  ANS012.BYTE004  $  y=x;
  $  030.紧急启动的车速值                          $    $  km/h      $    $  ANS013.BYTE004  $  y=x;
  $  031.紧急停止的车速值                          $    $  km/h      $    $  ANS013.BYTE005  $  y=x;
  $  032.电源控制模式                              $    $            $    $  ANS014.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  033.主/辅电源分配单元(PDU)逻辑                $    $            $    $  ANS014.BYTE004  $  if((x&0x0c)==0x00)y=@0021;else if((x&0x0c)==0x04)y=@0022;else if((x&0x0c)==0x08)y=@0023;else if((x&0x0c)==0x0c)y=@0024;else y=@0003;
  $  034.一键启动开关的LED1                        $    $            $    $  ANS015.BYTE004  $  if((x&0x40)==0x00)y=@0021;else if((x&0x40)==0x40)y=@003a;else y=@0003;
  $  035.一键启动开关的LED2                        $    $            $    $  ANS015.BYTE004  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  036.自适应巡航控制(ACC)继电器控制             $    $            $    $  ANS015.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  037.IGN1a继电器控制                           $    $            $    $  ANS015.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  038.IGN1b继电器控制                           $    $            $    $  ANS015.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  039.IGN2继电器控制                            $    $            $    $  ANS015.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  040.开始继电器控制                            $    $            $    $  ANS015.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;

  $)  02.一键启动控制系统(PEPS)常规数据3
  $  02.一键启动控制系统(PEPS)常规数据3
  $  REQ000:762 03 22 FD 36 00 00 00 00       $  ANS000:76A 03 22 FD 36 00 00 00 00
  $  REQ001:762 03 22 FD 37 00 00 00 00       $  ANS001:76A 03 22 FD 37 00 00 00 00
  $  REQ002:762 03 22 FD 38 00 00 00 00       $  ANS002:76A 03 22 FD 38 00 00 00 00
  $  REQ003:762 03 22 FD 41 00 00 00 00       $  ANS003:76A 03 22 FD 41 00 00 00 00
  $  REQ004:762 03 22 FD 62 00 00 00 00       $  ANS004:76A 03 22 FD 62 00 00 00 00
  $  REQ005:762 03 22 FD 63 00 00 00 00       $  ANS005:76A 03 22 FD 63 00 00 00 00
  $  REQ006:762 03 22 FD 64 00 00 00 00       $  ANS006:76A 03 22 FD 64 00 00 00 00
  $  REQ007:762 03 22 FD 82 00 00 00 00       $  ANS007:76A 03 22 FD 82 00 00 00 00
  $  REQ008:762 03 22 FD 84 00 00 00 00       $  ANS008:76A 03 22 FD 84 00 00 00 00
  $  REQ009:762 03 22 FD 85 00 00 00 00       $  ANS009:76A 03 22 FD 85 00 00 00 00
  $  REQ010:762 03 22 FD 86 00 00 00 00       $  ANS010:76A 03 22 FD 86 00 00 00 00
  $  REQ011:762 03 22 FD 87 00 00 00 00       $  ANS011:76A 03 22 FD 87 00 00 00 00
  $  REQ012:762 03 22 FD 88 00 00 00 00       $  ANS012:76A 03 22 FD 88 00 00 00 00
  $  REQ013:762 03 22 FD 89 00 00 00 00       $  ANS013:76A 03 22 FD 89 00 00 00 00

  $  000.备份自适应巡航控制(ACC)继电器控制                            $    $           $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  001.备份IGN1a继电器控制                                          $    $           $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  002.备份IGN1b继电器控制                                          $    $           $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  003.备份START继电器控制                                          $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  004.电子转向管柱锁(ESCL)上锁的车速阈值                           $    $  km/h     $    $  ANS001.BYTE004  $  y=x;
  $  005.防抱死刹车系统(ABS)睡眠时间                                  $    $  s        $    $  ANS002.BYTE004  $  y=x;
  $  006.一键启动控制系统(PEPS) 闭锁状态                              $    $           $    $  ANS003.BYTE004  $  if((x&0x80)==0x00)y=@0021;else if((x&0x80)==0x80)y=@003a;else y=@0003;
  $  007.VIN状态                                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x40)==0x00)y=@0021;else if((x&0x40)==0x40)y=@003a;else y=@0003;
  $  008.PIN状态                                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  009.电子转向管柱锁(ESCL) SKC状态                                 $    $           $    $  ANS003.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@003a;else y=@0003;
  $  010.产品保证书(PSW)状态                                          $    $           $    $  ANS003.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  011.RSK状态                                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  012.ISK状态                                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  013.WUP状态                                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  014.全部闭锁状态                                                 $    $           $    $  ANS003.BYTE005  $  if((x&0x80)==0x00)y=@0021;else if((x&0x80)==0x80)y=@003a;else y=@0003;
  $  015.防盗控制器(IMMO)状态                                         $    $           $    $  ANS003.BYTE005  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@003a;else y=@0003;
  $  016.电子转向柱(ESCL)状态                                         $    $           $    $  ANS003.BYTE005  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@003a;else y=@0003;
  $  017.Fob2状态                                                     $    $           $    $  ANS003.BYTE005  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@003a;else y=@0003;
  $  018.Fob1状态                                                     $    $           $    $  ANS003.BYTE005  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@003a;else y=@0003;
  $  019.原始模式                                                     $    $           $    $  ANS003.BYTE006  $  if((x&0x80)==0x00)y=@0021;else if((x&0x80)==0x80)y=@003a;else y=@0003;
  $  020.正常模式                                                     $    $           $    $  ANS003.BYTE006  $  if((x&0x40)==0x00)y=@0021;else if((x&0x40)==0x40)y=@003a;else y=@0003;
  $  021.回复OK                                                       $    $           $    $  ANS003.BYTE006  $  if((x&0x20)==0x00)y=@0021;else if((x&0x20)==0x20)y=@003a;else y=@0003;
  $  022.9V电池电压校验BAT_ECU                                        $    $           $    $  ANS004.BYTE004  $  y=x;
  $  023.16V电池电压校验BAT_ECU                                       $    $           $    $  ANS004.BYTE005  $  y=x;
  $  024.9V电池电压校验BAT_SAFE                                       $    $           $    $  ANS005.BYTE004  $  y=x;
  $  025.16V电池电压校验BAT_SAFE                                      $    $           $    $  ANS005.BYTE005  $  y=x;
  $  026.9V电池电压校验BAT_PDM                                        $    $           $    $  ANS006.BYTE004  $  y=x;
  $  027.16V电池电压校验BAT_PDM                                       $    $           $    $  ANS006.BYTE005  $  y=x;
  $  028.电源分配单元(PDU)水平                                        $    $           $    $  ANS007.BYTE004  $  y=x;
  $  029.电子转向柱(ESCL)供地的状态                                   $    $           $    $  ANS007.BYTE005  $  y=x;
  $  030.电子转向柱(ESCL)认证通过信号                                 $    $           $    $  ANS007.BYTE006  $  y=x;
  $  031.一键启动开关1被按下                                          $    $           $    $  ANS007.BYTE007  $  if((x&0x03)==0x00)y=@001f;else if((x&0x03)==0x01)y=@0020;else y=@0003;
  $  032.一键启动开关2被按下                                          $    $           $    $  ANS007.BYTE007  $  if((x&0x0c)==0x00)y=@001f;else if((x&0x0c)==0x04)y=@0020;else y=@0003;
  $  033.一键启动控制系统(PEPS)控制电源分配单元(PDU)的模式            $    $           $    $  ANS007.BYTE008  $  y=x;
  $  034.主继电器驱动器状态                                           $    $           $    $  ANS007.BYTE009  $  y=x;
  $  035.辅电源分配单元(PDU)的命令状态                                $    $           $    $  ANS007.BYTE010  $  y=x;
  $  036.驱动电机控制单元(MCU)转台                                    $    $           $    $  ANS007.BYTE011  $  y=x;
  $  037.电源分配单元(PDU)反馈水平                                    $    $           $    $  ANS007.BYTE012  $  y=x;
  $  038.防抱死刹车系统(ABS)提供速度值的更新有效位                    $    $           $    $  ANS008.BYTE004  $  y=x;
  $  039.车速关闭的定时器                                             $    $           $    $  ANS008.BYTE005  $  y=x;
  $  040.防抱死刹车系统(ABS)睡眠的定时器                              $    $           $    $  ANS008.BYTE006  $  y=x;
  $  041.防抱死刹车系统(ABS)电源状态                                  $    $           $    $  ANS008.BYTE007  $  y=x;
  $  042.车速检查状态                                                 $    $           $    $  ANS008.BYTE008  $  y=x;
  $  043.车速有效标志位                                               $    $           $    $  ANS008.BYTE009  $  y=x;
  $  044.电子转向柱(ESCL)上锁使能标志位                               $    $           $    $  ANS008.BYTE010  $  y=x;
  $  045.钥匙扫描的触发                                               $    $           $    $  ANS009.BYTE004  $  y=x;
  $  046.钥匙信息                                                     $    $           $    $  ANS009.BYTE005  $  HEX(X1,X2,X3,X4);
  $  047.钥匙查找控制状态                                             $    $           $    $  ANS009.BYTE009  $  y=(x1*256+x2);
  $  048.得到PKS的状态                                                $    $           $    $  ANS010.BYTE004  $  if(x==0x00)y=@0018;else if(x==0x01)y=@0019;else if(x==0x02)y=@001a;else if(x==0x03)y=@001b;else if(x==0x04)y=@001c;else if(x==0x05)y=@001d;else if(x==0x06)y=@001e;else y=@0003;
  $  049.得到防盗控制器(IMMO)的状态                                   $    $           $    $  ANS011.BYTE004  $  y=(x1*256+x2);
  $  050.学习命令                                                     $    $           $    $  ANS012.BYTE004  $  y=x;
  $  051.学习状态                                                     $    $           $    $  ANS012.BYTE005  $  y=x;
  $  052.学习状态                                                     $    $           $    $  ANS012.BYTE006  $  HEX(X1,X2,X3,X4);
  $  053.得到电子转向柱(ESCL)控制命令                                 $    $           $    $  ANS013.BYTE004  $  y=x;
  $  054.得到电子转向柱(ESCL)供电状态                                 $    $           $    $  ANS013.BYTE005  $  y=x;
  $  055.得到电子转向柱(ESCL)当前状态                                 $    $           $    $  ANS013.BYTE006  $  y=x;
  $  056.得到电子转向柱(ESCL)电源有效状态                             $    $           $    $  ANS013.BYTE007  $  y=x;
  $  057.得到PKS_使能电子转向柱(ESCL)上锁状态                         $    $           $    $  ANS013.BYTE008  $  y=x;
  $  058.得到电子转向柱(ESCL)反馈一键启动控制系统(PEPS)状态请求       $    $           $    $  ANS013.BYTE009  $  y=x;
  $  059.得到电子转向柱(ESCL)解锁状态序列                             $    $           $    $  ANS013.BYTE010  $  y=x;
  $  060.得到电子转向柱(ESCL)上锁状态序列                             $    $           $    $  ANS013.BYTE011  $  y=x;
  $  061.得到电子转向柱(ESCL)学习状态序列                             $    $           $    $  ANS013.BYTE012  $  y=x;
  $  062.得到SKC                                                      $    $           $    $  ANS013.BYTE013  $  HEX(X1,X2,X3,X4,X5,X6);
  $  063.得到电子转向柱(ESCL)上电尝试次数                             $    $           $    $  ANS013.BYTE019  $  y=x;
  $  064.得到电子转向柱(ESCL)解锁尝试次数                             $    $           $    $  ANS013.BYTE020  $  y=x;
  $  065.得到电子转向柱(ESCL)上锁尝试次数                             $    $           $    $  ANS013.BYTE021  $  y=x;
  $  066.得到电子转向柱(ESCL)学习尝试次数                             $    $           $    $  ANS013.BYTE022  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:762 30 00 01 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
