
    车型ID：240b

    模拟：协议模拟-->240b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E3 02 10 03 00 00 00 00 00       $~  ANS000:7EB 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:7E3 02 3E 00 00 00 00 00 00       $!  ANS000:7EB 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E3 03 19 02 09 00 00 00 00       $#  ANS000:7EB 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/19000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E3 04 14 FF FF FF 00 00 00       $$  ANS000:7EB 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E3 03 22 F1 87 00 00 00 00       $%  ANS000:7EB 03 22 F1 87 00 00 00 00
  $%  REQ001:7E3 03 22 F1 8A 00 00 00 00       $%  ANS001:7EB 03 22 F1 8A 00 00 00 00
  $%  REQ002:7E3 03 22 F1 8B 00 00 00 00       $%  ANS002:7EB 03 22 F1 8B 00 00 00 00
  $%  REQ003:7E3 03 22 F1 8C 00 00 00 00       $%  ANS003:7EB 03 22 F1 8C 00 00 00 00
  $%  REQ004:7E3 03 22 F1 90 00 00 00 00       $%  ANS004:7EB 03 22 F1 90 00 00 00 00
  $%  REQ005:7E3 03 22 F1 9D 00 00 00 00       $%  ANS005:7EB 03 22 F1 9D 00 00 00 00

  $%  000:海马备用零件号:       $%    $%  ANS000.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  001:ECU供应商识别:        $%    $%  ANS001.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  002:ECU生产日期:          $%    $%  ANS002.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  003:单元序列号:           $%    $%  ANS003.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $%  004:VIN码:                $%    $%  ANS004.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  005:ECU安装日期:          $%    $%  ANS005.BYTE004  $%  HEX(X1,X2,X3,X4);

;******************************************************************************************************************************************************

读数据流: 

 ; $)  00.数据流(气囊回路阻值)
 ; $  00.数据流(气囊回路阻值)
 ; $  REQ000:7E3 03 22 10 01 00 00 00 00       $  ANS000:7EB 03 22 10 01 00 00 00 00
 ;
 ; $  000.驾驶侧前安全气囊电阻2        $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==1)y=x6*0.256;else if(x7==1)y=x8*0.256;else if(x9==1)y=x10*0.256;else if(x11==1)y=x12*0.256;else if(x13==1)y=x14*0.256;else if(x15==1)y=x16*0.256;else if(x17==1)y=x18*0.256;else if(x19==1)y=x20*0.256;else if(x21==1)y=x22*0.256;else if(x23==1)y=x24*0.256;else if(x25==1)y=x26*0.256;else if(x27==1)y=x28*0.256;else y=@0003;
 ; $  001.乘客侧前安全气囊电阻2        $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==3)y=x6*0.256;else if(x7==3)y=x8*0.256;else if(x9==3)y=x10*0.256;else if(x11==3)y=x12*0.256;else if(x13==3)y=x14*0.256;else if(x15==3)y=x16*0.256;else if(x17==3)y=x18*0.256;else if(x19==3)y=x20*0.256;else if(x21==3)y=x22*0.256;else if(x23==3)y=x24*0.256;else if(x25==3)y=x26*0.256;else if(x27==3)y=x28*0.256;else y=@0003;
 ; $  002.驾驶侧前安全气囊电阻         $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==0)y=x6*0.256;else if(x7==0)y=x8*0.256;else if(x9==0)y=x10*0.256;else if(x11==0)y=x12*0.256;else if(x13==0)y=x14*0.256;else if(x15==0)y=x16*0.256;else if(x17==0)y=x18*0.256;else if(x19==0)y=x20*0.256;else if(x21==0)y=x22*0.256;else if(x23==0)y=x24*0.256;else if(x25==0)y=x26*0.256;else if(x27==0)y=x28*0.256;else y=@0003;
 ; $  003.乘客侧前安全气囊电阻         $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==2)y=x6*0.256;else if(x7==2)y=x8*0.256;else if(x9==2)y=x10*0.256;else if(x11==2)y=x12*0.256;else if(x13==2)y=x14*0.256;else if(x15==2)y=x16*0.256;else if(x17==2)y=x18*0.256;else if(x19==2)y=x20*0.256;else if(x21==2)y=x22*0.256;else if(x23==2)y=x24*0.256;else if(x25==2)y=x26*0.256;else if(x27==2)y=x28*0.256;else y=@0003;
 ; $  004.驾驶侧侧安全气囊电阻         $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==13)y=x6*0.256;else if(x7==13)y=x8*0.256;else if(x9==13)y=x10*0.256;else if(x11==13)y=x12*0.256;else if(x13==13)y=x14*0.256;else if(x15==13)y=x16*0.256;else if(x17==13)y=x18*0.256;else if(x19==13)y=x20*0.256;else if(x21==13)y=x22*0.256;else if(x23==13)y=x24*0.256;else if(x25==13)y=x26*0.256;else if(x27==13)y=x28*0.256;else y=@0003;
 ; $  005.乘客侧侧前安全气囊电阻       $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==14)y=x6*0.256;else if(x7==14)y=x8*0.256;else if(x9==14)y=x10*0.256;else if(x11==14)y=x12*0.256;else if(x13==14)y=x14*0.256;else if(x15==14)y=x16*0.256;else if(x17==14)y=x18*0.256;else if(x19==14)y=x20*0.256;else if(x21==14)y=x22*0.256;else if(x23==14)y=x24*0.256;else if(x25==14)y=x26*0.256;else if(x27==14)y=x28*0.256;else y=@0003;
 ; $  006.驾驶侧气帘电阻               $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==15)y=x6*0.256;else if(x7==15)y=x8*0.256;else if(x9==15)y=x10*0.256;else if(x11==15)y=x12*0.256;else if(x13==15)y=x14*0.256;else if(x15==15)y=x16*0.256;else if(x17==15)y=x18*0.256;else if(x19==15)y=x20*0.256;else if(x21==15)y=x22*0.256;else if(x23==15)y=x24*0.256;else if(x25==15)y=x26*0.256;else if(x27==15)y=x28*0.256;else y=@0003;
 ; $  007.乘客侧气帘电阻               $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==16)y=x6*0.256;else if(x7==16)y=x8*0.256;else if(x9==16)y=x10*0.256;else if(x11==16)y=x12*0.256;else if(x13==16)y=x14*0.256;else if(x15==16)y=x16*0.256;else if(x17==16)y=x18*0.256;else if(x19==16)y=x20*0.256;else if(x21==16)y=x22*0.256;else if(x23==16)y=x24*0.256;else if(x25==16)y=x26*0.256;else if(x27==16)y=x28*0.256;else y=@0003;
 ; $  008.驾驶预紧带电阻               $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==21)y=x6*0.256;else if(x7==21)y=x8*0.256;else if(x9==21)y=x10*0.256;else if(x11==21)y=x12*0.256;else if(x13==21)y=x14*0.256;else if(x15==21)y=x16*0.256;else if(x17==21)y=x18*0.256;else if(x19==21)y=x20*0.256;else if(x21==21)y=x22*0.256;else if(x23==21)y=x24*0.256;else if(x25==21)y=x26*0.256;else if(x27==21)y=x28*0.256;else y=@0003;
 ; $  009.乘客侧预紧带电阻             $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==22)y=x6*0.256;else if(x7==22)y=x8*0.256;else if(x9==22)y=x10*0.256;else if(x11==22)y=x12*0.256;else if(x13==22)y=x14*0.256;else if(x15==22)y=x16*0.256;else if(x17==22)y=x18*0.256;else if(x19==22)y=x20*0.256;else if(x21==22)y=x22*0.256;else if(x23==22)y=x24*0.256;else if(x25==22)y=x26*0.256;else if(x27==22)y=x28*0.256;else y=@0003;
 ; $  010.驾驶员安全带电阻             $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==19)y=x6*0.256;else if(x7==19)y=x8*0.256;else if(x9==19)y=x10*0.256;else if(x11==19)y=x12*0.256;else if(x13==19)y=x14*0.256;else if(x15==19)y=x16*0.256;else if(x17==19)y=x18*0.256;else if(x19==19)y=x20*0.256;else if(x21==19)y=x22*0.256;else if(x23==19)y=x24*0.256;else if(x25==19)y=x26*0.256;else if(x27==19)y=x28*0.256;else y=@0003;
 ; $  011.乘客安全带电阻               $    $  ohm     $    $  ANS000.BYTE000  $  if(x5==20)y=x6*0.256;else if(x7==20)y=x8*0.256;else if(x9==20)y=x10*0.256;else if(x11==20)y=x12*0.256;else if(x13==20)y=x14*0.256;else if(x15==20)y=x16*0.256;else if(x17==20)y=x18*0.256;else if(x19==20)y=x20*0.256;else if(x21==20)y=x22*0.256;else if(x23==20)y=x24*0.256;else if(x25==20)y=x26*0.256;else if(x27==20)y=x28*0.256;else y=@0003;

  $)  01.数据流（配置信息）
  $  01.数据流（配置信息）
  $  REQ000:7E3 03 22 10 02 00 00 00 00       $  ANS000:7EB 03 22 10 02 00 00 00 00
  $  REQ001:7E3 03 22 50 78 00 00 00 00       $  ANS001:7EB 03 22 50 78 00 00 00 00

  $  000.驾驶预紧带电阻             $    $  ohm     $    $  ANS000.BYTE001  $  y=x*0.256;
  $  001.乘客侧预紧带电阻           $    $  ohm     $    $  ANS000.BYTE001  $  y=x*0.256;
  $  002.驾驶员安全带电阻           $    $  ohm     $    $  ANS000.BYTE001  $  y=x*0.256;
  $  003.乘客安全带电阻             $    $  ohm     $    $  ANS000.BYTE001  $  y=x*0.256;
  $  004.电瓶电压                   $    $  V       $    $  ANS000.BYTE007  $  y=x*256/1000;
  $  005.能量储存电压               $    $  V       $    $  ANS000.BYTE008  $  y=x*256/1000;
  $  006.乘客侧安全带开关状态       $    $          $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@00aa;else if((x&0x01)==0x00)y=@00ab;else y=@0003;
  $  007.驾驶侧安全带开关状态       $    $          $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@00aa;else if((x&0x10)==0x00)y=@00ab;else y=@0003;
  $  008.乘客侧安全带开关配置       $    $          $    $  ANS000.BYTE004  $  if((x&0x06)==0x00)y=@00ac;else if((x&0x06)==0x02)y=@0029;else if((x&0x06)==0x04)y=@0072;else y=@0003;
  $  009.驾驶侧安全带开关配置       $    $          $    $  ANS000.BYTE004  $  if((x&0x60)==0x00)y=@00ac;else if((x&0x60)==0x20)y=@0029;else if((x&0x60)==0x40)y=@0072;else y=@0003;
  $  010.乘客座椅察觉状态           $    $          $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@00a8;else if((x&0x01)==0x00)y=@00a9;else y=@0003;
  $  011.乘客座椅察觉配置           $    $          $    $  ANS001.BYTE005  $  if((x&0x02)==0x00)y=@0072;else if((x&0x02)==0x02)y=@0073;else y=@0003;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E3 30 00 01 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
