
    车型ID：240e

    模拟：协议模拟-->240e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:740 02 10 01 00 00 00 00 00       $~  ANS000:748 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:740 02 3E 00 00 00 00 00 00       $!  ANS000:748 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:740 03 19 02 09 00 00 00 00       $#  ANS000:748 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/02000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:740 04 14 FF FF FF 00 00 00       $$  ANS000:748 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:740 03 22 F1 81 00 00 00 00       $%  ANS000:748 03 22 F1 81 00 00 00 00
  $%  REQ001:740 03 22 F1 86 00 00 00 00       $%  ANS001:748 03 22 F1 86 00 00 00 00
  $%  REQ002:740 03 22 F1 87 00 00 00 00       $%  ANS002:748 03 22 F1 87 00 00 00 00
  $%  REQ003:740 03 22 F1 88 00 00 00 00       $%  ANS003:748 03 22 F1 88 00 00 00 00
  $%  REQ004:740 03 22 F1 89 00 00 00 00       $%  ANS004:748 03 22 F1 89 00 00 00 00
  $%  REQ005:740 03 22 F1 8A 00 00 00 00       $%  ANS005:748 03 22 F1 8A 00 00 00 00
  $%  REQ006:740 03 22 F1 8B 00 00 00 00       $%  ANS006:748 03 22 F1 8B 00 00 00 00
  $%  REQ007:740 03 22 F1 8C 00 00 00 00       $%  ANS007:748 03 22 F1 8C 00 00 00 00
  $%  REQ008:740 03 22 F1 90 00 00 00 00       $%  ANS008:748 03 22 F1 90 00 00 00 00
  $%  REQ009:740 03 22 F1 91 00 00 00 00       $%  ANS009:748 03 22 F1 91 00 00 00 00
  $%  REQ010:740 03 22 F1 92 00 00 00 00       $%  ANS010:748 03 22 F1 92 00 00 00 00
  $%  REQ011:740 03 22 F1 93 00 00 00 00       $%  ANS011:748 03 22 F1 93 00 00 00 00
  $%  REQ012:740 03 22 F1 94 00 00 00 00       $%  ANS012:748 03 22 F1 94 00 00 00 00
  $%  REQ013:740 03 22 F1 95 00 00 00 00       $%  ANS013:748 03 22 F1 95 00 00 00 00
  $%  REQ014:740 03 22 F1 97 00 00 00 00       $%  ANS014:748 03 22 F1 97 00 00 00 00
  $%  REQ015:740 03 22 F1 99 00 00 00 00       $%  ANS015:748 03 22 F1 99 00 00 00 00
  $%  REQ016:740 03 22 F1 9D 00 00 00 00       $%  ANS016:748 03 22 F1 9D 00 00 00 00

  $%  000:应用软件ID号:              $%    $%  ANS000.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  001:当前诊断会话级别:          $%    $%  ANS001.BYTE004  $%  if(x==0x01)y=@0008;else if(x==0x03)y=@0009;else y=@0003;
  $%  002:海马零部件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%c%c%c%02X%c%c%c],X1,X2,X3,X4,X5,X6,X7,X8);
  $%  003:海马ECU软件号:             $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%c%c%c%02X%c%c%c],X1,X2,X3,X4,X5,X6,X7,X8);
  $%  004:海马ECU软件版本号:         $%    $%  ANS004.BYTE004  $%  HEX(X1,X2);
  $%  005:ECU供应商ID:               $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02X%02X%c%02X%02X%c],X1,X2,X3,X4,X5,X6);
  $%  006:ECU生产日期:               $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],X1,X2,X3,X4);
  $%  007:ECU序列号:                 $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7);
  $%  008:车辆识别代码（VIN）:       $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  009:海马ECU硬件编号:           $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%c%c%c%02X%c%c%c],X1,X2,X3,X4,X5,X6,X7,X8);
  $%  010:供应商ECU硬件编号:         $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  011:供应商ECU硬件版本号:       $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  012:供应商ECU软件编号:         $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  013:供应商ECU软件版本号:       $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  014:系统名称:                  $%    $%  ANS014.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  015:编程日期:                  $%    $%  ANS015.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],X1,X2,X3,X4);
  $%  016:ECU安装日期:               $%    $%  ANS016.BYTE004  $%  y=SPRINTF([%02X%02X-%02X-%02X],X1,X2,X3,X4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.电子转向管柱锁(ESCL) 电源输出
  $  00.电子转向管柱锁(ESCL) 电源输出
  $  REQ000:740 03 22 FE 10 00 00 00 00       $  ANS000:748 03 22 FE 10 00 00 00 00

  $  000.电子转向管柱锁(ESCL)电源输出       $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@009d;else if((x&0x01)==0x01)y=@009e;else y=@0003;

  $)  01.上下锁控制输出
  $  01.上下锁控制输出
  $  REQ000:740 03 22 FE 11 00 00 00 00       $  ANS000:748 03 22 FE 11 00 00 00 00

  $  000.闭锁输出             $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@009b;else if((x&0x01)==0x01)y=@009c;else y=@0003;
  $  001.解锁输出             $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@0096;else if((x&0x02)==0x02)y=@0097;else y=@0003;
  $  002.行李箱解锁输出       $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@0094;else if((x&0x04)==0x04)y=@0095;else y=@0003;

  $)  02.前雨刮及清洗输出
  $  02.前雨刮及清洗输出
  $  REQ000:740 03 22 FE 12 00 00 00 00       $  ANS000:748 03 22 FE 12 00 00 00 00

  $  000.雨刮输出       $    $       $    $  ANS000.BYTE004  $  if((x&0x03)==0x00)y=@0092;else if((x&0x03)==0x01)y=@0099;else if((x&0x03)==0x02)y=@009a;else y=@0003;
  $  001.清洗           $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@0092;else if((x&0x04)==0x04)y=@0098;else y=@0003;

  $)  03.外部灯输出
  $  03.外部灯输出
  $  REQ000:740 03 22 FE 13 00 00 00 00       $  ANS000:748 03 22 FE 13 00 00 00 00

  $  000.小灯输出         $    $       $    $  ANS000.BYTE005  $  if((x&0x03)==0x00)y=@000a;else if((x&0x03)==0x01)y=@000b;else if((x&0x03)==0x02)y=@0092;else y=@0003;
  $  001.近光灯输出       $    $       $    $  ANS000.BYTE005  $  if((x&0x0c)==0x00)y=@000a;else if((x&0x0c)==0x04)y=@000b;else if((x&0x0c)==0x08)y=@0092;else y=@0003;
  $  002.远光灯输出       $    $       $    $  ANS000.BYTE005  $  if((x&0x30)==0x00)y=@000a;else if((x&0x30)==0x10)y=@000b;else if((x&0x30)==0x20)y=@0092;else y=@0003;
  $  003.后雾灯           $    $       $    $  ANS000.BYTE004  $  if((x&0x03)==0x00)y=@000a;else if((x&0x03)==0x01)y=@000b;else if((x&0x03)==0x02)y=@0092;else y=@0003;
  $  004.刹车灯           $    $       $    $  ANS000.BYTE004  $  if((x&0x0c)==0x00)y=@000a;else if((x&0x0c)==0x04)y=@000b;else if((x&0x0c)==0x08)y=@0092;else y=@0003;
  $  005.日间行车灯       $    $       $    $  ANS000.BYTE004  $  if((x&0x30)==0x00)y=@000a;else if((x&0x30)==0x10)y=@000b;else if((x&0x30)==0x20)y=@0092;else y=@0003;
  $  006.前雾灯           $    $       $    $  ANS000.BYTE004  $  if((x&0xc0)==0x00)y=@000a;else if((x&0xc0)==0x40)y=@000b;else if((x&0xc0)==0x80)y=@0092;else y=@0003;

  $)  04.内部灯输出
  $  04.内部灯输出
  $  REQ000:740 03 22 FE 14 00 00 00 00       $  ANS000:748 03 22 FE 14 00 00 00 00

  $  000.顶灯1电源        $    $       $    $  ANS000.BYTE004  $  if((x&0x03)==0x00)y=@000a;else if((x&0x03)==0x01)y=@000b;else if((x&0x03)==0x02)y=@0092;else y=@0003;
  $  001.顶灯2电源        $    $       $    $  ANS000.BYTE004  $  if((x&0x0c)==0x00)y=@000a;else if((x&0x0c)==0x04)y=@000b;else if((x&0x0c)==0x08)y=@0092;else y=@0003;
  $  002.钥匙空照明       $    $       $    $  ANS000.BYTE004  $  if((x&0x30)==0x00)y=@000a;else if((x&0x30)==0x10)y=@000b;else if((x&0x30)==0x20)y=@0092;else y=@0003;

  $)  05.转向灯输出
  $  05.转向灯输出
  $  REQ000:740 03 22 FE 15 00 00 00 00       $  ANS000:748 03 22 FE 15 00 00 00 00

  $  000.左转向灯输出       $    $       $    $  ANS000.BYTE004  $  if((x&0x03)==0x00)y=@000a;else if((x&0x03)==0x01)y=@0091;else if((x&0x03)==0x02)y=@0092;else if((x&0x03)==0x03)y=@0093;else y=@0003;
  $  001.右转向灯输出       $    $       $    $  ANS000.BYTE004  $  if((x&0x0c)==0x00)y=@000a;else if((x&0x0c)==0x04)y=@0091;else if((x&0x0c)==0x08)y=@0092;else if((x&0x0c)==0x0c)y=@0093;else y=@0003;

  $)  06.后雨刮和后清洗、大灯清洗输出
  $  06.后雨刮和后清洗、大灯清洗输出
  $  REQ000:740 03 22 FE 16 00 00 00 00       $  ANS000:748 03 22 FE 16 00 00 00 00

  $  000.后雨刮         $    $       $    $  ANS000.BYTE004  $  if((x&0x03)==0x00)y=@000a;else if((x&0x03)==0x01)y=@000b;else if((x&0x03)==0x02)y=@0092;else y=@0003;
  $  001.后清洗         $    $       $    $  ANS000.BYTE004  $  if((x&0x0c)==0x00)y=@000a;else if((x&0x0c)==0x04)y=@000b;else if((x&0x0c)==0x08)y=@0092;else y=@0003;
  $  002.大灯清洗       $    $       $    $  ANS000.BYTE004  $  if((x&0x0c)==0x00)y=@000a;else if((x&0x0c)==0x04)y=@000b;else if((x&0x0c)==0x08)y=@0092;else y=@0003;

  $)  07.电喇叭输出
  $  07.电喇叭输出
  $  REQ000:740 03 22 FE 18 00 00 00 00       $  ANS000:748 03 22 FE 18 00 00 00 00

  $  000.电喇叭       $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;

  $)  08.电源分配输入
  $  08.电源分配输入
  $  REQ000:740 03 22 FE 20 00 00 00 00       $  ANS000:748 03 22 FE 20 00 00 00 00

  $  000.ACC         $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;
  $  001.IGN1        $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@000a;else if((x&0x02)==0x02)y=@0045;else y=@0003;
  $  002.IGN2        $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@000a;else if((x&0x04)==0x04)y=@0045;else y=@0003;
  $  003.START       $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@000a;else if((x&0x08)==0x08)y=@0045;else y=@0003;

  $)  09.前雨刮及前清洗控制输入
  $  09.前雨刮及前清洗控制输入
  $  REQ000:740 03 22 FE 21 00 00 00 00       $  ANS000:748 03 22 FE 21 00 00 00 00

  $  000.前雨刮低速请求           $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;
  $  001.前雨刮高速请求           $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@000a;else if((x&0x02)==0x02)y=@0045;else y=@0003;
  $  002.前雨刮间歇工作请求       $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@000a;else if((x&0x04)==0x04)y=@0045;else y=@0003;
  $  003.前洗涤请求               $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@000a;else if((x&0x08)==0x08)y=@0045;else y=@0003;
  $  004.前雨刮间歇挡位           $    $       $    $  ANS000.BYTE004  $  if((x&0x70)==0x10)y=@0010;else if((x&0x70)==0x20)y=@0011;else if((x&0x70)==0x30)y=@0012;else if((x&0x70)==0x40)y=@0041;else if((x&0x70)==0x50)y=@0042;else y=@0003;

  $)  10.小灯和大灯开关输入
  $  10.小灯和大灯开关输入
  $  REQ000:740 03 22 FE 22 00 00 00 00       $  ANS000:748 03 22 FE 22 00 00 00 00

  $  000.小灯开关         $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;
  $  001.近光灯开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@000a;else if((x&0x02)==0x02)y=@0045;else y=@0003;
  $  002.远光灯开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@000a;else if((x&0x04)==0x04)y=@0045;else y=@0003;
  $  003.超车灯开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@000a;else if((x&0x08)==0x08)y=@0045;else y=@0003;

  $)  11.转向灯控制开关输入
  $  11.转向灯控制开关输入
  $  REQ000:740 03 22 FE 24 00 00 00 00       $  ANS000:748 03 22 FE 24 00 00 00 00

  $  000.左转向开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;
  $  001.右转向开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@000a;else if((x&0x02)==0x02)y=@0045;else y=@0003;
  $  002.应急开关         $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@000a;else if((x&0x04)==0x04)y=@0045;else y=@0003;

  $)  12.前后雾灯开关输入
  $  12.前后雾灯开关输入
  $  REQ000:740 03 22 FE 25 00 00 00 00       $  ANS000:748 03 22 FE 25 00 00 00 00

  $  000.前雾灯开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;
  $  001.后雾灯开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@000a;else if((x&0x02)==0x02)y=@0045;else y=@0003;

  $)  13.门锁控制开关输入
  $  13.门锁控制开关输入
  $  REQ000:740 03 22 FE 26 00 00 00 00       $  ANS000:748 03 22 FE 26 00 00 00 00

  $  000.中控开锁       $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@000a;else if((x&0x04)==0x04)y=@0045;else y=@0003;
  $  001.中控闭锁       $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@000a;else if((x&0x08)==0x08)y=@0045;else y=@0003;

  $)  14.电喇叭开关
  $  14.电喇叭开关
  $  REQ000:740 03 22 FE 27 00 00 00 00       $  ANS000:748 03 22 FE 27 00 00 00 00

  $  000.电喇叭控制       $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;

  $)  15.后清洗、后雨刮控制开关
  $  15.后清洗、后雨刮控制开关
  $  REQ000:740 03 22 FE 28 00 00 00 00       $  ANS000:748 03 22 FE 28 00 00 00 00

  $  000.后清洗开关           $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@000a;else if((x&0x01)==0x01)y=@0045;else y=@0003;
  $  001.后雨刮低速开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@000a;else if((x&0x02)==0x02)y=@0045;else y=@0003;
  $  002.后雨刮间歇开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@000a;else if((x&0x04)==0x04)y=@0045;else y=@0003;

  $)  16.刹车开关
  $  16.刹车开关
  $  REQ000:740 03 22 FE 29 00 00 00 00       $  ANS000:748 03 22 FE 29 00 00 00 00

  $  000.刹车开关       $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@008f;else if((x&0x01)==0x01)y=@0090;else y=@0003;

  $)  17.启动持续时间
  $  17.启动持续时间
  $  REQ000:740 03 22 F1 F1 00 00 00 00       $  ANS000:748 03 22 F1 F1 00 00 00 00

  $  000.启动持续时间       $    $  S     $    $  ANS000.BYTE004  $  HEX(X1,X2);

  $)  18.配置
  $  18.配置
  $  REQ000:740 03 22 20 1C 00 00 00 00       $  ANS000:748 03 22 20 1C 00 00 00 00

  $  000.伴我回家功能配置方式       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@008d;else if((x&0x02)==0x02)y=@008e;else y=@0003;
  $  001.光线/雨量传感器配置        $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@008b;else if((x&0x01)==0x01)y=@008c;else y=@0003;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:740 30 00 01 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
