
    车型ID：895c

    模拟：协议模拟-->895c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:762 02 10 03 00 00 00 00 00       $~  ANS000:76A 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:762 02 3E 00 00 00 00 00 00       $!  ANS000:76A 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读当前故障码
  $#  REQ000:762 03 19 02 01 00 00 00 00       $#  ANS000:76A 03 19 02 01 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/8a000000


  $#  01.读历史故障码
  $#  REQ000:762 03 19 02 08 00 00 00 00       $#  ANS000:76A 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/8a000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:762 04 14 FF FF FF 00 00 00       $$  ANS000:76A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:762 03 22 F1 87 00 00 00 00       $%  ANS000:76A 03 22 F1 87 00 00 00 00
  $%  REQ001:762 03 22 F1 88 00 00 00 00       $%  ANS001:76A 03 22 F1 88 00 00 00 00
  $%  REQ002:762 03 22 F1 89 00 00 00 00       $%  ANS002:76A 03 22 F1 89 00 00 00 00
  $%  REQ003:762 03 22 F1 8A 00 00 00 00       $%  ANS003:76A 03 22 F1 8A 00 00 00 00
  $%  REQ004:762 03 22 F1 8C 00 00 00 00       $%  ANS004:76A 03 22 F1 8C 00 00 00 00
  $%  REQ005:762 03 22 F1 90 00 00 00 00       $%  ANS005:76A 03 22 F1 90 00 00 00 00
  $%  REQ006:762 03 22 F1 91 00 00 00 00       $%  ANS006:76A 03 22 F1 91 00 00 00 00
  $%  REQ007:762 03 22 F1 92 00 00 00 00       $%  ANS007:76A 03 22 F1 92 00 00 00 00
  $%  REQ008:762 03 22 F1 93 00 00 00 00       $%  ANS008:76A 03 22 F1 93 00 00 00 00
  $%  REQ009:762 03 22 F1 94 00 00 00 00       $%  ANS009:76A 03 22 F1 94 00 00 00 00
  $%  REQ010:762 03 22 F1 95 00 00 00 00       $%  ANS010:76A 03 22 F1 95 00 00 00 00
  $%  REQ011:762 03 22 F1 97 00 00 00 00       $%  ANS011:76A 03 22 F1 97 00 00 00 00
  $%  REQ012:762 03 22 F1 99 00 00 00 00       $%  ANS012:76A 03 22 F1 99 00 00 00 00
  $%  REQ013:762 03 22 F1 9D 00 00 00 00       $%  ANS013:76A 03 22 F1 9D 00 00 00 00
  $%  REQ014:762 03 22 FD 01 00 00 00 00       $%  ANS014:76A 03 22 FD 01 00 00 00 00
  $%  REQ015:762 03 22 FD 02 00 00 00 00       $%  ANS015:76A 03 22 FD 02 00 00 00 00
  $%  REQ016:762 03 22 FD 03 00 00 00 00       $%  ANS016:76A 03 22 FD 03 00 00 00 00
  $%  REQ017:762 03 22 FD 04 00 00 00 00       $%  ANS017:76A 03 22 FD 04 00 00 00 00
  $%  REQ018:762 03 22 FD 93 00 00 00 00       $%  ANS018:76A 03 22 FD 93 00 00 00 00
  $%  REQ019:762 03 22 FD 95 00 00 00 00       $%  ANS019:76A 03 22 FD 95 00 00 00 00

  $%  000:车厂零部件号:                        $%    $%  ANS000.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11);
  $%  001:主机厂软件编号:                      $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  002:主机厂软件版本编号:                  $%    $%  ANS002.BYTE004  $%  HEX(X1,X2);
  $%  003:供应商代码:                          $%    $%  ANS003.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  004:车身控制器序列号:                    $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  005:VIN码:                               $%    $%  ANS005.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  006:车厂硬件编号:                        $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14);
  $%  007:供应商ECU硬件编号:                   $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11);
  $%  008:供应商ECU硬件版本:                   $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  009:供应商ECU软件编号:                   $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11);
  $%  010:供应商ECU软件版本:                   $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  011:供应商ECU名称:                       $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5);
  $%  012:编程日期(年/月/日):                  $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X/%02X/%02X],X1,X2,X3,X4);
  $%  013:ECU安装日期(年/月/日):               $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%02X%02X/%02X/%02X],X1,X2,X3,X4);
  $%  014:主软件编号:                          $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  015:主软件版本:                          $%    $%  ANS015.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  016:第二软件编号:                        $%    $%  ANS016.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  017:第二软件版本:                        $%    $%  ANS017.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  018:电子转向管柱锁(ESCL)硬件版本:        $%    $%  ANS018.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  019:电子转向管柱锁(ESCL)软件版本:        $%    $%  ANS019.BYTE004  $%  HEX(X1,X2,X3,X4,X5);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读取一键启动控制系统(PEPS)配置信息
  $  00.读取一键启动控制系统(PEPS)配置信息
  $  REQ000:762 03 22 F0 10 00 00 00 00       $  ANS000:76A 03 22 F0 10 00 00 00 00
  $  REQ001:762 03 22 FD 33 00 00 00 00       $  ANS001:76A 03 22 FD 33 00 00 00 00
  $  REQ002:762 03 22 FD 37 00 00 00 00       $  ANS002:76A 03 22 FD 37 00 00 00 00
  $  REQ003:762 03 22 FD 38 00 00 00 00       $  ANS003:76A 03 22 FD 38 00 00 00 00
  $  REQ004:762 03 22 FD 22 00 00 00 00       $  ANS004:76A 03 22 FD 22 00 00 00 00

  $  000.变速箱类型                            $    $           $    $  ANS000.BYTE004  $  if((x&0x03)==0x00)y=@0037;else if((x&0x03)==0x01)y=@0036;else if((x&0x03)==0x02)y=@00df;else if((x&0x03)==0x03)y=@00a3;else y=@0003;
  $  001.车型型号                              $    $           $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@00e0;else if((x&0x04)==0x04)y=@00e1;else y=@0003;
  $  002.备份电源功能                          $    $           $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@00db;else if((x&0x08)==0x08)y=@00dc;else y=@0003;
  $  003.防盗功能                              $    $           $    $  ANS000.BYTE004  $  if((x&0x10)==0x00)y=@00db;else if((x&0x10)==0x10)y=@00dc;else y=@0003;
  $  004.中控功能                              $    $           $    $  ANS000.BYTE004  $  if((x&0x20)==0x00)y=@00db;else if((x&0x20)==0x20)y=@00dc;else y=@0003;
  $  005.门锁控制                              $    $           $    $  ANS000.BYTE004  $  if((x&0xc0)==0x00)y=@000e;else if((x&0xc0)==0x40)y=@00dd;else if((x&0xc0)==0x80)y=@00de;else y=@0003;
  $  006.喇叭控制                              $    $           $    $  ANS000.BYTE005  $  if((x&0x03)==0x00)y=@000e;else if((x&0x03)==0x01)y=@0015;else if((x&0x03)==0x02)y=@0028;else y=@0003;
  $  007.仪表天线                              $    $           $    $  ANS000.BYTE005  $  if((x&0x04)==0x00)y=@000e;else if((x&0x04)==0x04)y=@000f;else y=@0003;
  $  008.副仪表天线                            $    $           $    $  ANS000.BYTE005  $  if((x&0x08)==0x00)y=@000e;else if((x&0x08)==0x08)y=@000f;else y=@0003;
  $  009.行李箱前部天线                        $    $           $    $  ANS000.BYTE005  $  if((x&0x10)==0x00)y=@000e;else if((x&0x10)==0x10)y=@000f;else y=@0003;
  $  010.行李箱后部天线                        $    $           $    $  ANS000.BYTE005  $  if((x&0x20)==0x00)y=@000e;else if((x&0x20)==0x20)y=@000f;else y=@0003;
  $  011.左前门天线                            $    $           $    $  ANS000.BYTE006  $  if((x&0x01)==0x00)y=@000e;else if((x&0x01)==0x01)y=@000f;else y=@0003;
  $  012.左后门天线                            $    $           $    $  ANS000.BYTE006  $  if((x&0x02)==0x00)y=@000e;else if((x&0x02)==0x02)y=@000f;else y=@0003;
  $  013.右前门天线                            $    $           $    $  ANS000.BYTE006  $  if((x&0x04)==0x00)y=@000e;else if((x&0x04)==0x04)y=@000f;else y=@0003;
  $  014.右后门天线                            $    $           $    $  ANS000.BYTE006  $  if((x&0x08)==0x00)y=@000e;else if((x&0x08)==0x08)y=@000f;else y=@0003;
  $  015.后背门/行李箱天线                     $    $           $    $  ANS000.BYTE006  $  if((x&0x10)==0x00)y=@000e;else if((x&0x10)==0x10)y=@000f;else y=@0003;
  $  016.电子转向管柱锁(ESCL)闭锁条件          $    $           $    $  ANS000.BYTE006  $  if((x&0x20)==0x00)y=@00d9;else if((x&0x20)==0x20)y=@00da;else y=@0003;
  $  017.系统电源从OFF切换到ACC/ON的条件       $    $           $    $  ANS000.BYTE006  $  if((x&0x40)==0x00)y=@00d7;else if((x&0x40)==0x40)y=@00d8;else y=@0003;
  $  018.紧急启停车速                          $    $  km/h     $    $  ANS001.BYTE004  $  y=x1*0.05625;
  $  019.电子转向管柱锁(ESCL)锁车速限制        $    $  km/h     $    $  ANS002.BYTE004  $  y=x1*0.05625;
  $  020.防抱死刹车系统(ABS)睡眠时间           $    $  s        $    $  ANS003.BYTE004  $  y=x1;
  $  021.ShiftP/N硬线                          $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0x00)y=@0013;else if((x&0x01)==0x01)y=@00d6;else y=@0003;
  $  022.ShiftP/NCAN                           $    $           $    $  ANS004.BYTE004  $  if((x&0x02)==0x00)y=@0013;else if((x&0x02)==0x02)y=@00d6;else y=@0003;

  $)  01.读取一键启动控制系统(PEPS)系统状态
  $  01.读取一键启动控制系统(PEPS)系统状态
  $  REQ000:762 03 22 F1 86 00 00 00 00       $  ANS000:76A 03 22 F1 86 00 00 00 00
  $  REQ001:762 03 22 FD 18 00 00 00 00       $  ANS001:76A 03 22 FD 18 00 00 00 00
  $  REQ002:762 03 22 FD 41 00 00 00 00       $  ANS002:76A 03 22 FD 41 00 00 00 00
  $  REQ003:762 03 22 FC 04 00 00 00 00       $  ANS003:76A 03 22 FC 04 00 00 00 00
  $  REQ004:762 03 22 FC 09 00 00 00 00       $  ANS004:76A 03 22 FC 09 00 00 00 00
  $  REQ005:762 03 22 FC 14 00 00 00 00       $  ANS005:76A 03 22 FC 14 00 00 00 00
  $  REQ006:762 03 22 FC 15 00 00 00 00       $  ANS006:76A 03 22 FC 15 00 00 00 00
  $  REQ007:762 03 22 FC 16 00 00 00 00       $  ANS007:76A 03 22 FC 16 00 00 00 00
  $  REQ008:762 03 22 FC 1D 00 00 00 00       $  ANS008:76A 03 22 FC 1D 00 00 00 00
  $  REQ009:762 03 22 FC 1E 00 00 00 00       $  ANS009:76A 03 22 FC 1E 00 00 00 00
  $  REQ010:762 03 22 FC 1F 00 00 00 00       $  ANS010:76A 03 22 FC 1F 00 00 00 00
  $  REQ011:762 03 22 FC 23 00 00 00 00       $  ANS011:76A 03 22 FC 23 00 00 00 00
  $  REQ012:762 03 22 FC 24 00 00 00 00       $  ANS012:76A 03 22 FC 24 00 00 00 00
  $  REQ013:762 03 22 FE 07 00 00 00 00       $  ANS013:76A 03 22 FE 07 00 00 00 00

  $  000.诊断模式                                         $    $           $    $  ANS000.BYTE004  $  if((x&0xff)==0x01)y=@0008;else if((x&0xff)==0x02)y=@003b;else if((x&0xff)==0x04)y=@0009;else if((x&0xff)==0x08)y=@00d1;else if((x&0xff)==0x10)y=@00d2;else y=@0003;
  $  001.系统电压                                         $    $  V        $    $  ANS001.BYTE004  $  y=x1*5*26.8*5.12/(6.8*1024);
  $  002.一键启动控制系统(PEPS)锁住                       $    $           $    $  ANS002.BYTE004  $  if((x&0x80)==0x00)y=@00a7;else if((x&0x80)==0x80)y=@00d5;else y=@0003;
  $  003.VIN                                              $    $           $    $  ANS002.BYTE004  $  if((x&0x40)==0x00)y=@00a0;else if((x&0x40)==0x40)y=@009f;else y=@0003;
  $  004.PIN                                              $    $           $    $  ANS002.BYTE004  $  if((x&0x20)==0x00)y=@00a0;else if((x&0x20)==0x20)y=@009f;else y=@0003;
  $  005.ESK                                              $    $           $    $  ANS002.BYTE004  $  if((x&0x10)==0x00)y=@00a0;else if((x&0x10)==0x10)y=@009f;else y=@0003;
  $  006.VSK                                              $    $           $    $  ANS002.BYTE009  $  if((x&0x08)==0x00)y=@00a0;else if((x&0x08)==0x08)y=@009f;else y=@0003;
  $  007.TSK                                              $    $           $    $  ANS002.BYTE004  $  if((x&0x04)==0x00)y=@00a0;else if((x&0x04)==0x04)y=@009f;else y=@0003;
  $  008.ISK                                              $    $           $    $  ANS002.BYTE004  $  if((x&0x02)==0x00)y=@00a0;else if((x&0x02)==0x02)y=@009f;else y=@0003;
  $  009.全部锁止                                         $    $           $    $  ANS002.BYTE005  $  if((x&0x80)==0x00)y=@00a7;else if((x&0x80)==0x80)y=@00d5;else y=@0003;
  $  010.电子转向管柱锁(ESCL)                             $    $           $    $  ANS002.BYTE005  $  if((x&0x04)==0x00)y=@00a0;else if((x&0x04)==0x04)y=@009f;else y=@0003;
  $  011.钥匙2                                            $    $           $    $  ANS002.BYTE005  $  if((x&0x02)==0x00)y=@00a0;else if((x&0x02)==0x02)y=@009f;else y=@0003;
  $  012.钥匙1                                            $    $           $    $  ANS002.BYTE005  $  if((x&0x01)==0x00)y=@00a0;else if((x&0x01)==0x01)y=@009f;else y=@0003;
  $  013.绿色LED状态                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x01)==0x00)y=@0021;else if((x&0x01)==0x01)y=@00d0;else y=@0003;
  $  014.红色LED状态                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x02)==0x00)y=@0021;else if((x&0x02)==0x02)y=@00d0;else y=@0003;
  $  015.背光LED状态                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x04)==0x00)y=@0021;else if((x&0x04)==0x04)y=@00d0;else y=@0003;
  $  016.启动开关1状态                                    $    $           $    $  ANS003.BYTE004  $  if((x&0x08)==0x00)y=@0021;else if((x&0x08)==0x08)y=@00d0;else y=@0003;
  $  017.启动开关2状态                                    $    $           $    $  ANS003.BYTE004  $  if((x&0x10)==0x00)y=@0021;else if((x&0x10)==0x10)y=@00d0;else y=@0003;
  $  018.智能钥匙电池电压状态                             $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0x00)y=@00c8;else if((x&0x01)==0x01)y=@00c9;else y=@0003;
  $  019.智能钥匙认证结果                                 $    $           $    $  ANS005.BYTE004  $  if((x&0xff)==0x00)y=@000e;else if((x&0xff)==0x01)y=@00c5;else if((x&0xff)==0x02)y=@00c6;else if((x&0xff)==0x03)y=@00c7;else y=@0003;
  $  020.整车控制器(VCU)认证结果                          $    $           $    $  ANS006.BYTE004  $  if((x&0xff)==0x00)y=@000e;else if((x&0xff)==0x01)y=@00cf;else if((x&0xff)==0x02)y=@00b4;else y=@0003;
  $  021.电子转向管柱锁(ESCL)认证结果                     $    $           $    $  ANS007.BYTE004  $  if((x&0xff)==0x00)y=@000e;else if((x&0xff)==0x01)y=@00cf;else if((x&0xff)==0x02)y=@00b4;else y=@0003;
  $  022.最新的遥控无钥匙进入(RKE)命令类型                $    $           $    $  ANS008.BYTE004  $  if((x&0xff)==0x00)y=@00ca;else if((x&0xff)==0x01)y=@00cb;else if((x&0xff)==0x02)y=@00cc;else if((x&0xff)==0x03)y=@00cd;else if((x&0xff)==0x04)y=@00ce;else if((x&0xff)==0x05)y=@00bf;else if((x&0xff)==0x06)y=@00c0;else y=@0003;
  $  023.当前存储的智能钥匙数                             $    $           $    $  ANS009.BYTE004  $  y=x1;
  $  024.最新收到的智能钥匙命令                           $    $           $    $  ANS010.BYTE004  $  if((x&0xff)==0x00)y=@00b8;else if((x&0xff)==0x01)y=@00b1;else if((x&0xff)==0x02)y=@00b0;else if((x&0xff)==0x03)y=@02ba;else if((x&0xff)==0x04)y=@00ba;else if((x&0xff)==0x05)y=@00bb;else if((x&0xff)==0x06)y=@00bc;else if((x&0xff)==0x07)y=@00bd;else if((x&0xff)==0x08)y=@00be;else if((x&0xff)==0x09)y=@00bf;else if((x&0xff)==0x0a)y=@00c0;else y=@0003;
  $  025.一键启动控制系统(PEPS)跛行回家信号输出状态       $    $           $    $  ANS011.BYTE004  $  if((x&0xff)==0x00)y=@00b6;else if((x&0xff)==0x01)y=@00b7;else y=@0003;
  $  026.备份电源跛行回家信号输入状态                     $    $           $    $  ANS012.BYTE004  $  if((x&0xff)==0x00)y=@00c1;else if((x&0xff)==0x01)y=@00c2;else if((x&0xff)==0x02)y=@00c3;else if((x&0xff)==0x03)y=@00c4;else y=@0003;
  $  027.车速                                             $    $  km/h     $    $  ANS013.BYTE004  $  y=x1;

  $)  02.读取门锁及门开关状态
  $  02.读取门锁及门开关状态
  $  REQ000:762 03 22 FC 06 00 00 00 00       $  ANS000:76A 03 22 FC 06 00 00 00 00
  $  REQ001:762 03 22 FC 07 00 00 00 00       $  ANS001:76A 03 22 FC 07 00 00 00 00

  $  000.左前门锁状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@00b0;else if((x&0x01)==0x01)y=@00b1;else y=@0003;
  $  001.右前门锁状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@00b0;else if((x&0x02)==0x02)y=@00b1;else y=@0003;
  $  002.左后门锁状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@00b0;else if((x&0x04)==0x04)y=@00b1;else y=@0003;
  $  003.右后门锁状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@00b0;else if((x&0x08)==0x08)y=@00b1;else y=@0003;
  $  004.后背门锁状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x10)==0x00)y=@00b0;else if((x&0x10)==0x10)y=@00b1;else y=@0003;
  $  005.左前门开关状态       $    $       $    $  ANS001.BYTE004  $  if((x&0x01)==0x00)y=@0045;else if((x&0x01)==0x01)y=@000a;else y=@0003;
  $  006.右前门开关状态       $    $       $    $  ANS001.BYTE004  $  if((x&0x02)==0x00)y=@0045;else if((x&0x02)==0x02)y=@000a;else y=@0003;
  $  007.左后门开关状态       $    $       $    $  ANS001.BYTE004  $  if((x&0x04)==0x00)y=@0045;else if((x&0x04)==0x04)y=@000a;else y=@0003;
  $  008.右后门开关状态       $    $       $    $  ANS001.BYTE004  $  if((x&0x08)==0x00)y=@0045;else if((x&0x08)==0x08)y=@000a;else y=@0003;
  $  009.后背门开关状态       $    $       $    $  ANS001.BYTE004  $  if((x&0x10)==0x00)y=@0045;else if((x&0x10)==0x10)y=@000a;else y=@0003;

  $)  03.读取电子转向管柱锁(ESCL)状态
  $  03.读取电子转向管柱锁(ESCL)状态
  $  REQ000:762 03 22 FC 17 00 00 00 00       $  ANS000:76A 03 22 FC 17 00 00 00 00

  $  000.电子转向管柱锁(ESCL)解锁状态             $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@00f4;else if((x&0x01)==0x00)y=@00f5;else y=@0003;
  $  001.电子转向管柱锁(ESCL)上锁状态             $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@00f2;else if((x&0x02)==0x00)y=@00f3;else y=@0003;
  $  002.电子转向管柱锁(ESCL)忙碌状态             $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@00f6;else if((x&0x04)==0x00)y=@00f7;else y=@0003;
  $  003.电子转向管柱锁(ESCL)电机供电状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@0028;else if((x&0x08)==0x00)y=@00ed;else y=@0003;
  $  004.电子转向管柱锁(ESCL)解锁使能状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@0028;else if((x&0x10)==0x00)y=@00ed;else y=@0003;
  $  005.电子转向管柱锁(ESCL)电机保护状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@00eb;else if((x&0x20)==0x00)y=@00ec;else y=@0003;
  $  006.电子转向管柱锁(ESCL)门闩堵塞状态         $    $       $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@00f0;else if((x&0x40)==0x00)y=@00f1;else y=@0003;
  $  007.电子转向管柱锁(ESCL)主芯片复位状态       $    $       $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@00ee;else if((x&0x80)==0x00)y=@00ef;else y=@0003;
  $  008.电子转向管柱锁(ESCL)诊断状态             $    $       $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@00ea;else if((x&0x01)==0x00)y=@00e7;else y=@0003;
  $  009.电子转向管柱锁(ESCL)解锁确认状态         $    $       $    $  ANS000.BYTE005  $  if((x&0x02)==0x02)y=@00e8;else if((x&0x02)==0x00)y=@00e9;else y=@0003;
  $  010.电子转向管柱锁(ESCL)上锁开关状态         $    $       $    $  ANS000.BYTE005  $  if((x&0x04)==0x04)y=@000a;else if((x&0x04)==0x00)y=@0045;else y=@0003;
  $  011.电子转向管柱锁(ESCL)解锁开关状态         $    $       $    $  ANS000.BYTE005  $  if((x&0x08)==0x08)y=@000a;else if((x&0x08)==0x00)y=@0045;else y=@0003;
  $  012.电子转向管柱锁(ESCL)认证状态             $    $       $    $  ANS000.BYTE005  $  if((x&0x20)==0x20)y=@00e6;else if((x&0x20)==0x00)y=@00e7;else y=@0003;
  $  013.电子转向管柱锁(ESCL)学习状态             $    $       $    $  ANS000.BYTE005  $  if((x&0x80)==0x80)y=@009f;else if((x&0x80)==0x00)y=@00a0;else y=@0003;

  $)  04.读取电子转向管柱锁(ESCL)诊断数据
  $  04.读取电子转向管柱锁(ESCL)诊断数据
  $  REQ000:762 03 22 FC 18 00 00 00 00       $  ANS000:76A 03 22 FC 18 00 00 00 00

  $  000.电子转向管柱锁(ESCL)随机存储器(RAM)/只读存储器(ROM)故障状态           $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@00e5;else if((x&0x01)==0x00)y=@00e2;else y=@0003;
  $  001.电子转向管柱锁(ESCL)随机存储器(RAM)/只读存储器(ROM)故障诊断状态       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@00e3;else if((x&0x02)==0x00)y=@00e4;else y=@0003;
  $  002.电子转向管柱锁(ESCL)低电压故障状态                                    $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@00e5;else if((x&0x04)==0x00)y=@00e2;else y=@0003;
  $  003.电子转向管柱锁(ESCL)低电压故障诊断状态                                $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@00e3;else if((x&0x08)==0x00)y=@00e4;else y=@0003;
  $  004.电子转向管柱锁(ESCL)上锁开关故障状态                                  $    $       $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@00e5;else if((x&0x10)==0x00)y=@00e2;else y=@0003;
  $  005.电子转向管柱锁(ESCL)上锁开关故障诊断状态                              $    $       $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@00e3;else if((x&0x20)==0x00)y=@00e4;else y=@0003;
  $  006.电子转向管柱锁(ESCL)解锁开关故障状态                                  $    $       $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@00e5;else if((x&0x40)==0x00)y=@00e2;else y=@0003;
  $  007.电子转向管柱锁(ESCL)解锁开关故障诊断状态                              $    $       $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@00e3;else if((x&0x80)==0x00)y=@00e4;else y=@0003;
  $  008.电子转向管柱锁(ESCL)上锁使能低电压故障状态                            $    $       $    $  ANS000.BYTE006  $  if((x&0x01)==0x01)y=@00e5;else if((x&0x01)==0x00)y=@00e2;else y=@0003;
  $  009.电子转向管柱锁(ESCL)上锁使能低电压故障诊断状态                        $    $       $    $  ANS000.BYTE006  $  if((x&0x02)==0x02)y=@00e3;else if((x&0x02)==0x00)y=@00e4;else y=@0003;
  $  010.电子转向管柱锁(ESCL)上锁使能高电压故障状态                            $    $       $    $  ANS000.BYTE006  $  if((x&0x04)==0x04)y=@00e5;else if((x&0x04)==0x00)y=@00e2;else y=@0003;
  $  011.电子转向管柱锁(ESCL)上锁使能高电压故障诊断状态                        $    $       $    $  ANS000.BYTE006  $  if((x&0x08)==0x08)y=@00e3;else if((x&0x08)==0x00)y=@00e4;else y=@0003;
  $  012.电子转向管柱锁(ESCL)电机使能低电压故障状态                            $    $       $    $  ANS000.BYTE006  $  if((x&0x10)==0x10)y=@00e5;else if((x&0x10)==0x00)y=@00e2;else y=@0003;
  $  013.电子转向管柱锁(ESCL)电机使能低电压故障诊断状态                        $    $       $    $  ANS000.BYTE006  $  if((x&0x20)==0x20)y=@00e3;else if((x&0x20)==0x00)y=@00e4;else y=@0003;
  $  014.电子转向管柱锁(ESCL)电机使能高电压故障状态                            $    $       $    $  ANS000.BYTE006  $  if((x&0x40)==0x40)y=@00e5;else if((x&0x40)==0x00)y=@00e2;else y=@0003;
  $  015.电子转向管柱锁(ESCL)电机使能高电压故障诊断状态                        $    $       $    $  ANS000.BYTE006  $  if((x&0x80)==0x80)y=@00e3;else if((x&0x80)==0x00)y=@00e4;else y=@0003;
  $  016.电子转向管柱锁(ESCL)高边驱动故障状态                                  $    $       $    $  ANS000.BYTE007  $  if((x&0x01)==0x01)y=@00e5;else if((x&0x01)==0x00)y=@00e2;else y=@0003;
  $  017.电子转向管柱锁(ESCL)高边驱动故障诊断状态                              $    $       $    $  ANS000.BYTE007  $  if((x&0x02)==0x02)y=@00e3;else if((x&0x02)==0x00)y=@00e4;else y=@0003;
  $  018.电子转向管柱锁(ESCL)低边驱动故障状态                                  $    $       $    $  ANS000.BYTE007  $  if((x&0x04)==0x04)y=@00e5;else if((x&0x04)==0x00)y=@00e2;else y=@0003;
  $  019.电子转向管柱锁(ESCL)低边驱动故障诊断状态                              $    $       $    $  ANS000.BYTE007  $  if((x&0x08)==0x08)y=@00e3;else if((x&0x08)==0x00)y=@00e4;else y=@0003;
  $  020.电子转向管柱锁(ESCL)上锁高边控制故障状态                              $    $       $    $  ANS000.BYTE007  $  if((x&0x10)==0x10)y=@00e5;else if((x&0x10)==0x00)y=@00e2;else y=@0003;
  $  021.电子转向管柱锁(ESCL)上锁高边控制故障诊断状态                          $    $       $    $  ANS000.BYTE007  $  if((x&0x20)==0x20)y=@00e3;else if((x&0x20)==0x00)y=@00e4;else y=@0003;

  $)  05.读取电源继电器驱动电路故障状态
  $  05.读取电源继电器驱动电路故障状态
  $  REQ000:762 03 22 FC 21 00 00 00 00       $  ANS000:76A 03 22 FC 21 00 00 00 00

  $  000.点火1继电器驱动       $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@00e2;else if((x&0x01)==0x01)y=@00ac;else y=@0003;
  $  001.点火2继电器驱动       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@00e2;else if((x&0x02)==0x02)y=@00ac;else y=@0003;
  $  002.ACC继电器驱动         $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@00e2;else if((x&0x04)==0x04)y=@00ac;else y=@0003;

  $)  06.读取备用电源继电器驱动电路故障状态
  $  06.读取备用电源继电器驱动电路故障状态
  $  REQ000:762 03 22 FC 22 00 00 00 00       $  ANS000:76A 03 22 FC 22 00 00 00 00

  $  000.ACC继电器驱动         $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@00e2;else if((x&0x01)==0x01)y=@00ac;else y=@0003;
  $  001.点火1继电器驱动       $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@00e2;else if((x&0x02)==0x02)y=@00ac;else y=@0003;
  $  002.点火2继电器驱动       $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x00)y=@00e2;else if((x&0x04)==0x04)y=@00ac;else y=@0003;

  $)  07.读取离散高边低边输入
  $  07.读取离散高边低边输入
  $  REQ000:762 03 22 FE 05 00 00 00 00       $  ANS000:76A 03 22 FE 05 00 00 00 00
  $  REQ001:762 03 22 FE 06 00 00 00 00       $  ANS001:76A 03 22 FE 06 00 00 00 00

  $  000.点火2反馈                          $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x00)y=@0013;else if((x&0x08)==0x08)y=@00d6;else y=@0003;
  $  001.点火1反馈                          $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x00)y=@0013;else if((x&0x02)==0x02)y=@00d6;else y=@0003;
  $  002.ACC反馈                            $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x00)y=@0013;else if((x&0x01)==0x01)y=@00d6;else y=@0003;
  $  003.电子转向管柱锁(ESCL)解锁确认       $    $       $    $  ANS000.BYTE005  $  if((x&0x10)==0x00)y=@0013;else if((x&0x10)==0x10)y=@00d6;else y=@0003;
  $  004.刹车踏板2                          $    $       $    $  ANS000.BYTE005  $  if((x&0x08)==0x00)y=@0013;else if((x&0x08)==0x08)y=@00d6;else y=@0003;
  $  005.刹车踏板1                          $    $       $    $  ANS000.BYTE005  $  if((x&0x04)==0x00)y=@0013;else if((x&0x04)==0x04)y=@00d6;else y=@0003;
  $  006.SSB_SW2                            $    $       $    $  ANS000.BYTE005  $  if((x&0x02)==0x00)y=@0013;else if((x&0x02)==0x02)y=@00d6;else y=@0003;
  $  007.SSB_SW1                            $    $       $    $  ANS000.BYTE005  $  if((x&0x01)==0x00)y=@0013;else if((x&0x01)==0x01)y=@00d6;else y=@0003;
  $  008.背箱开锁信号                       $    $       $    $  ANS001.BYTE005  $  if((x&0x04)==0x00)y=@0013;else if((x&0x04)==0x04)y=@00d6;else y=@0003;
  $  009.左前门开关信号                     $    $       $    $  ANS001.BYTE005  $  if((x&0x02)==0x00)y=@0013;else if((x&0x02)==0x02)y=@00d6;else y=@0003;
  $  010.右前门开关信号                     $    $       $    $  ANS001.BYTE005  $  if((x&0x01)==0x00)y=@0013;else if((x&0x01)==0x01)y=@00d6;else y=@0003;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:762 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
