
    车型ID：5771

    模拟：协议模拟-->5771

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~791

进入命令:

  $~  REQ000:711 02 10 03 00 00 00 00 00       $~  ANS000:791 02 10 03 00 00 00 00 00
  $~~ REQ001:711 02 27 01 00 00 00 00 00       $~~ ANS001:791 02 27 01 00 00 00 00 00
  $~~ REQ002:711 06 27 02 DE C5 63 28 00       $~~ ANS002:791 06 27 02 DE C5 63 28 00

空闲命令:

  $!  REQ000:711 02 3E 00 00 00 00 00 00       $!  ANS000:791 02 3E 00 00 00 00 00 00

退出命令:

  $@  REQ000:711 02 10 01 00 00 00 00 00       $@  ANS000:791 02 10 01 00 00 00 00 00


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:711 03 19 02 2F 00 00 00 00       $#  ANS000:791 03 19 02 2F 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/57000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:711 04 14 FF FF FF 00 00 00       $$  ANS000:791 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:711 03 22 F1 87 00 00 00 00       $%  ANS000:791 03 22 F1 87 00 00 00 00
  $%  REQ001:711 03 22 F1 88 00 00 00 00       $%  ANS001:791 03 22 F1 88 00 00 00 00
  $%  REQ002:711 03 22 F1 8A 00 00 00 00       $%  ANS002:791 03 22 F1 8A 00 00 00 00
  $%  REQ003:711 03 22 F1 97 00 00 00 00       $%  ANS003:791 03 22 F1 97 00 00 00 00
  $%  REQ004:711 03 22 F1 91 00 00 00 00       $%  ANS004:791 03 22 F1 91 00 00 00 00
  $%  REQ005:711 03 22 F1 8C 00 00 00 00       $%  ANS005:791 03 22 F1 8C 00 00 00 00
  $%  REQ006:711 03 22 F1 90 00 00 00 00       $%  ANS006:791 03 22 F1 90 00 00 00 00
  $%  REQ007:711 03 22 F1 5E 00 00 00 00       $%  ANS007:791 03 22 F1 5E 00 00 00 00
  $%  REQ008:711 03 22 F1 60 00 00 00 00       $%  ANS008:791 03 22 F1 60 00 00 00 00
  $%  REQ009:711 03 22 F1 63 00 00 00 00       $%  ANS009:791 03 22 F1 63 00 00 00 00
  $%  REQ010:711 03 22 F1 9E 00 00 00 00       $%  ANS010:791 03 22 F1 9E 00 00 00 00
  $%  REQ011:711 03 22 F1 5B 00 00 00 00       $%  ANS011:791 03 22 F1 5B 00 00 00 00
  $%  REQ012:711 03 22 F1 93 00 00 00 00       $%  ANS012:791 03 22 F1 93 00 00 00 00
  $%  REQ013:711 03 22 F1 95 00 00 00 00       $%  ANS013:791 03 22 F1 95 00 00 00 00

  $%  000:控制器总零件号:           $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  001:主芯片(MCU)软件号:        $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:供应商识别号:             $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7);
  $%  003:系统识别号:               $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:硬件号:                   $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:序列号:                   $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18);
  $%  006:车辆识别编码(VIN):        $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:网络数据库标识符:         $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  008:配置文件号:               $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  009:驱动软件号:               $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:ODX文件号:                $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:读软件指纹:               $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  012:供应商硬件版本号:         $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  013:供应商软件版本号:         $%    $%  ANS013.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:711 03 22 CF 00 00 00 00 00       $  ANS000:791 03 22 CF 00 00 00 00 00
  $  REQ001:711 03 22 CF 01 00 00 00 00       $  ANS001:791 03 22 CF 01 00 00 00 00
  $  REQ002:711 03 22 CF 02 00 00 00 00       $  ANS002:791 03 22 CF 02 00 00 00 00
  $  REQ003:711 03 22 CF 03 00 00 00 00       $  ANS003:791 03 22 CF 03 00 00 00 00
  $  REQ004:711 03 22 CF 04 00 00 00 00       $  ANS004:791 03 22 CF 04 00 00 00 00
  $  REQ005:711 03 22 13 09 00 00 00 00       $  ANS005:791 03 22 13 09 00 00 00 00
  $  REQ006:711 03 22 F1 14 00 00 00 00       $  ANS006:791 03 22 F1 14 00 00 00 00
  $  REQ007:711 03 22 13 02 00 00 00 00       $  ANS007:791 03 22 13 02 00 00 00 00
  $  REQ008:711 03 22 13 03 00 00 00 00       $  ANS008:791 03 22 13 03 00 00 00 00
  $  REQ009:711 03 22 13 04 00 00 00 00       $  ANS009:791 03 22 13 04 00 00 00 00
  $  REQ010:711 03 22 13 05 00 00 00 00       $  ANS010:791 03 22 13 05 00 00 00 00
  $  REQ011:711 03 22 13 06 00 00 00 00       $  ANS011:791 03 22 13 06 00 00 00 00

  $  000.控制器电源模式                          $    $           $    $  ANS000.BYTE004  $  switxh(x&0x03) 0x00:y=OFF;0x01:y=ACC_Reserved;0x02:y=ON;default: y=START;
  $  001.车速                                    $    $  Km/h     $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  002.控制器电源电压                          $    $  V        $    $  ANS002.BYTE004  $  y=x*0.1;
  $  003.第一次故障的里程值                      $    $  km       $    $  ANS003.BYTE004  $  y=(x1*256+x2)*256+x3;
  $  004.最后一次故障的里程值                    $    $  km       $    $  ANS004.BYTE004  $  y=(x1*256+x2)*256+x3;
  $  005.上一次收到射频信号获得的钥匙IDE号       $    $           $    $  ANS005.BYTE004  $  y=ASCII(x1,x2,x3,x4);
  $  006.读取钥匙数量                            $    $           $    $  ANS006.BYTE004  $  switxh(x) 0x03:y=已经学满2把钥匙;0x00:y=还有钥匙未学;0x01:y=还有钥匙未学;0x02:y=还有钥匙未学;default: y=错误;
  $  007.左前-胎压传感器ID                       $    $           $    $  ANS007.BYTE004  $  y=HEX(x1,x2,x3,x4);
  $  008.右前-胎压传感器ID                       $    $           $    $  ANS007.BYTE008  $  y=HEX(x1,x2,x3,x4);
  $  009.左后-胎压传感器ID                       $    $           $    $  ANS007.BYTE012  $  y=HEX(x1,x2,x3,x4);
  $  010.右后-胎压传感器ID                       $    $           $    $  ANS007.BYTE016  $  y=HEX(x1,x2,x3,x4);
  $  011.输入状态-制动踏板信号                   $    $           $    $  ANS008.BYTE004  $  switxh(x&0x01) 0x00:y=制动失效;default: y=制动有效;
  $  012.前雨刮回退开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x80) 0x00:y=正常;default: y=接地;
  $  013.后雨刮回退开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x10) 0x00:y=正常;default: y=接地;
  $  014.主驾车门开关                            $    $           $    $  ANS008.BYTE004  $  switxh(x&0x20) 0x00:y=闭合;default: y=打开;
  $  015.副驾车门开关                            $    $           $    $  ANS008.BYTE004  $  switxh(x&0x40) 0x00:y=闭合;default: y=打开;
  $  016.左后车门开关                            $    $           $    $  ANS008.BYTE004  $  switxh(x&0x80) 0x00:y=闭合;default: y=打开;
  $  017.右后车门开关                            $    $           $    $  ANS008.BYTE004  $  switxh(x&0x01) 0x00:y=闭合;default: y=打开;
  $  018.后备箱开关                              $    $           $    $  ANS008.BYTE004  $  switxh(x&0x02) 0x00:y=闭合;default: y=打开;
  $  019.前舱开关                                $    $           $    $  ANS008.BYTE004  $  switxh(x&0x04) 0x00:y=闭合;default: y=打开;
  $  020.机械钥匙锁和解锁开关                    $    $           $    $  ANS008.BYTE004  $  switxh(x&0x08) 0x00:y=打开;default: y=锁定;
  $  021.危险警告灯开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x10) 0x00:y=未激活;default: y=激活;
  $  022.后雨刮开关                              $    $           $    $  ANS008.BYTE004  $  switxh(x&0x01) 0x00:y=未激活;default: y=激活;
  $  023.后车窗洗涤开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x02) 0x00:y=未激活;default: y=激活;
  $  024.前雨刮组合开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x04) 0x00:y=未激活;default: y=激活;
  $  025.KL15输入1                               $    $           $    $  ANS008.BYTE004  $  switxh(x&0x10) 0x00:y=未激活;default: y=激活;
  $  026.KL15输入2                               $    $           $    $  ANS008.BYTE004  $  switxh(x&0x80) 0x00:y=未激活;default: y=激活;
  $  027.主驾门把手开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x02) 0x00:y=未激活;default: y=激活;
  $  028.气囊起爆信号                            $    $           $    $  ANS008.BYTE004  $  switxh(x&0x04) 0x00:y=未碰撞;default: y=碰撞;
  $  029.左后门把手开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x08) 0x00:y=未激活;default: y=激活;
  $  030.右后门把手开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x10) 0x00:y=未激活;default: y=激活;
  $  031.尾门把手开关                            $    $           $    $  ANS008.BYTE004  $  switxh(x&0x20) 0x00:y=未激活;default: y=激活;
  $  032.启动/停止开关1-控制器1                  $    $           $    $  ANS008.BYTE004  $  switxh(x&0x40) 0x00:y=未激活;default: y=激活;
  $  033.启动/停止开关2-控制器2                  $    $           $    $  ANS008.BYTE004  $  switxh(x&0x80) 0x00:y=未激活;default: y=激活;
  $  034.环境光线传感器                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x01) 0x00:y=未激活;default: y=激活;
  $  035.左前车内灯开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x02) 0x00:y=未激活;default: y=激活;
  $  036.左前车内灯开关                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x04) 0x00:y=未激活;default: y=激活;
  $  037.电子管柱锁反馈                          $    $           $    $  ANS008.BYTE004  $  switxh(x&0x08) 0x00:y=未激活;default: y=激活;
  $  038.钥匙信息编号 IDE1                       $    $           $    $  ANS009.BYTE004  $  y=HEX(x1,x2,x3,x4);
  $  039.钥匙信息编号IDE2                        $    $           $    $  ANS010.BYTE004  $  y=HEX(x1,x2,x3,x4);
  $  040.车辆电压                                $    $           $    $  ANS011.BYTE004  $  y=x*0.05+6;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:711 30 00 01 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
