
    车型ID：577f

    模拟：协议模拟-->577f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7B6

进入命令:

  $~  REQ000:736 02 10 03 00 00 00 00 00       $~  ANS000:7B6 02 10 03 00 00 00 00 00
  $~~ REQ001:736 02 27 01 00 00 00 00 00       $~~ ANS001:7B6 02 27 01 00 00 00 00 00
  $~~ REQ002:736 06 27 02 E6 F7 C0 AA 00       $~~ ANS002:7B6 06 27 02 E6 F7 C0 AA 00

空闲命令:

  $!  REQ000:736 02 3E 00 00 00 00 00 00       $!  ANS000:7B6 02 3E 00 00 00 00 00 00

退出命令:

  $@  REQ000:736 02 10 01 00 00 00 00 00       $@  ANS000:7B6 02 10 01 00 00 00 00 00


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:736 03 19 02 09 00 00 00 00       $#  ANS000:7B6 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/57000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:736 04 14 FF FF FF 00 00 00       $$  ANS000:7B6 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:736 03 22 F1 87 00 00 00 00       $%  ANS000:7B6 03 22 F1 87 00 00 00 00
  $%  REQ001:736 03 22 F1 88 00 00 00 00       $%  ANS001:7B6 03 22 F1 88 00 00 00 00
  $%  REQ002:736 03 22 F1 8A 00 00 00 00       $%  ANS002:7B6 03 22 F1 8A 00 00 00 00
  $%  REQ003:736 03 22 F1 97 00 00 00 00       $%  ANS003:7B6 03 22 F1 97 00 00 00 00
  $%  REQ004:736 03 22 F1 91 00 00 00 00       $%  ANS004:7B6 03 22 F1 91 00 00 00 00
  $%  REQ005:736 03 22 F1 8C 00 00 00 00       $%  ANS005:7B6 03 22 F1 8C 00 00 00 00
  $%  REQ006:736 03 22 F1 90 00 00 00 00       $%  ANS006:7B6 03 22 F1 90 00 00 00 00
  $%  REQ007:736 03 22 F1 5E 00 00 00 00       $%  ANS007:7B6 03 22 F1 5E 00 00 00 00
  $%  REQ008:736 03 22 F1 60 00 00 00 00       $%  ANS008:7B6 03 22 F1 60 00 00 00 00
  $%  REQ009:736 03 22 F1 63 00 00 00 00       $%  ANS009:7B6 03 22 F1 63 00 00 00 00
  $%  REQ010:736 03 22 F1 9E 00 00 00 00       $%  ANS010:7B6 03 22 F1 9E 00 00 00 00
  $%  REQ011:736 03 22 F1 5B 00 00 00 00       $%  ANS011:7B6 03 22 F1 5B 00 00 00 00

  $%  000:控制器总零件号:        $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  001:控制器软件号:          $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:供应商标识信息:        $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  003:系统名称:              $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:控制器硬件号:          $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  005:控制器序列号:          $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18);
  $%  006:车架号（VIN）:         $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:网络配置号:            $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  008:配置文件号:            $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  009:驱动文件号:            $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:ODX文件号:             $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  011:读取软件指纹:          $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:736 03 22 CF 00 00 00 00 00       $  ANS000:7B6 03 22 CF 00 00 00 00 00
  $  REQ001:736 03 22 CF 01 00 00 00 00       $  ANS001:7B6 03 22 CF 01 00 00 00 00
  $  REQ002:736 03 22 CF 02 00 00 00 00       $  ANS002:7B6 03 22 CF 02 00 00 00 00
  $  REQ003:736 03 22 CF 03 00 00 00 00       $  ANS003:7B6 03 22 CF 03 00 00 00 00
  $  REQ004:736 03 22 CF 04 00 00 00 00       $  ANS004:7B6 03 22 CF 04 00 00 00 00
  $  REQ005:736 03 22 CF 20 00 00 00 00       $  ANS005:7B6 03 22 CF 20 00 00 00 00
  $  REQ006:736 03 22 CF 21 00 00 00 00       $  ANS006:7B6 03 22 CF 21 00 00 00 00
  $  REQ007:736 03 22 02 00 00 00 00 00       $  ANS007:7B6 03 22 02 00 00 00 00 00
  $  REQ008:736 03 22 02 01 00 00 00 00       $  ANS008:7B6 03 22 02 01 00 00 00 00
  $  REQ009:736 03 22 F1 86 00 00 00 00       $  ANS009:7B6 03 22 F1 86 00 00 00 00
  $  REQ010:736 03 22 F1 8B 00 00 00 00       $  ANS010:7B6 03 22 F1 8B 00 00 00 00
  $  REQ011:736 03 22 F1 93 00 00 00 00       $  ANS011:7B6 03 22 F1 93 00 00 00 00
  $  REQ012:736 03 22 F1 95 00 00 00 00       $  ANS012:7B6 03 22 F1 95 00 00 00 00
  $  REQ013:736 03 22 F1 82 00 00 00 00       $  ANS013:7B6 03 22 F1 82 00 00 00 00
  $  REQ014:736 03 22 CF 06 00 00 00 00       $  ANS014:7B6 03 22 CF 06 00 00 00 00
  $  REQ015:736 03 22 CF 07 00 00 00 00       $  ANS015:7B6 03 22 CF 07 00 00 00 00
  $  REQ016:736 03 22 CF 05 00 00 00 00       $  ANS016:7B6 03 22 CF 05 00 00 00 00
  $  REQ017:736 03 22 CF 09 00 00 00 00       $  ANS017:7B6 03 22 CF 09 00 00 00 00
  $  REQ018:736 03 22 0D 00 00 00 00 00       $  ANS018:7B6 03 22 0D 00 00 00 00 00
  $  REQ019:736 03 22 0D 01 00 00 00 00       $  ANS019:7B6 03 22 0D 01 00 00 00 00
  $  REQ020:736 03 22 0D 02 00 00 00 00       $  ANS020:7B6 03 22 0D 02 00 00 00 00
  $  REQ021:736 03 22 0D 03 00 00 00 00       $  ANS021:7B6 03 22 0D 03 00 00 00 00
  $  REQ022:736 03 22 0D 04 00 00 00 00       $  ANS022:7B6 03 22 0D 04 00 00 00 00
  $  REQ023:736 03 22 0D 05 00 00 00 00       $  ANS023:7B6 03 22 0D 05 00 00 00 00
  $  REQ024:736 03 22 0D 06 00 00 00 00       $  ANS024:7B6 03 22 0D 06 00 00 00 00

  $  000.控制器电源模式                              $    $           $    $  ANS000.BYTE004  $  switxh(x) 0x00:y= OFF;0x01:y= ACC_Reserved;0x02:y=ON;0x03:y= START;default: y=无效;
  $  001.车速                                        $    $  Km/h     $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  002.控制器电源电压                              $    $  V        $    $  ANS002.BYTE004  $  y=x*0.1;
  $  003.第一次故障的里程值                          $    $  km       $    $  ANS003.BYTE004  $  y=(x1*256+x2)*256+x3;
  $  004.上一次故障的里程值                          $    $  km       $    $  ANS004.BYTE004  $  y=(x1*256+x2)*256+x3;
  $  005.错误计数                                    $    $  km       $    $  ANS005.BYTE004  $  y=x;
  $  006.历史计数                                    $    $           $    $  ANS006.BYTE004  $  y=x;
  $  007.编程计数器                                  $    $           $    $  ANS007.BYTE004  $  y=x;
  $  008.编程尝试次数                                $    $           $    $  ANS008.BYTE004  $  y=x;
  $  009.当前诊断会话层                              $    $           $    $  ANS009.BYTE004  $  y=x;
  $  010.控制器制造日期                              $    $           $    $  ANS010.BYTE004  $  y=ASCII(x1,x2,x3,x4,x5,x6);
  $  011.供应商控制器硬件号                          $    $           $    $  ANS011.BYTE004  $  y=HEX(x1,x2);
  $  012.控制器软件号                                $    $           $    $  ANS012.BYTE004  $  y=HEX(x1,x2);
  $  013.应用软件号                                  $    $           $    $  ANS013.BYTE004  $  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $  014.控制器温度                                  $    $  °C      $    $  ANS014.BYTE004  $  y=x;
  $  015.系统运行时间                                $    $  秒       $    $  ANS015.BYTE004  $  y=(x1*256+x2)*65535+x3*256+x4;
  $  016.动力系统当前运行模式                        $    $           $    $  ANS016.BYTE004  $  switxh(x) 0x00:y=OFF;0x01:y=Standby;0x02:y=PT Ready;0x03:y=Emergency shutdown;default: y=预留;
  $  017.当前时间戳                                  $    $           $    $  ANS017.BYTE004  $  y=SPRINTF([%02x/%02x/%02x %02x:%02x:%02x],x1,x2,x3,x4,x5,x6);
  $  018.车身高度-轮舱边缘左前方                     $    $  mm       $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.25;
  $  019.车身高度-轮毂边缘右前方                     $    $  mm       $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.25;
  $  020.车身高度-轮舱边缘左后方                     $    $  mm       $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.25;
  $  021.车身高度-轮毂边缘右后方                     $    $  mm       $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.25;
  $  022.标定板与前轴的距离                          $    $  mm       $    $  ANS019.BYTE004  $  y=x1*256+x2;
  $  023.当前标定的英里数                            $    $  Km       $    $  ANS020.BYTE004  $  y=(x1*256+x2)*65535+x3*256+x4;
  $  024.当前标定的初始状态                          $    $           $    $  ANS020.BYTE008  $  switxh(x) 0x00:y=静态校准不准确;0x02:y=静态校准准确;0x04:y=动态校准不准确;0x05:y=动态校准准确;default: y=备用;
  $  025.标定反馈代码                                $    $           $    $  ANS020.BYTE009  $  switxh(x) 0x00:y=无误差;0x01:y=校准未启动;0x02:y=照明太亮;0x03:y=光照不均匀;0x04:y=照明太暗;0x05:y=对比度太低;0x06:y=摄像头高度无效;0x07:y=视觉信号无效;0x08:y=校准位置错误;0x09:y=系统处于非睡眠状态;0x0A:y=标记检测不完整;0x0B:y=安装位置错误;0x0C:y=校准目标不匹配;0x0D:y=左侧目标未能检测到;0x0E:y=中间目标未能检测到;default: y=校准未完成;
  $  026.时间戳 - 年                                 $    $           $    $  ANS020.BYTE010  $  y=x+2000;
  $  027.时间戳 - 月                                 $    $           $    $  ANS020.BYTE011  $  y=x;
  $  028.时间戳 - 日                                 $    $           $    $  ANS020.BYTE012  $  y=x;
  $  029.时间戳 - 时                                 $    $           $    $  ANS020.BYTE013  $  y=x;
  $  030.时间戳 - 分                                 $    $           $    $  ANS020.BYTE014  $  y=x;
  $  031.时间戳 - 秒                                 $    $           $    $  ANS020.BYTE015  $  y=x;
  $  032.初始标定细节-摄像头高度                     $    $           $    $  ANS021.BYTE004  $  y=x1*256+x2;
  $  033.初始标定细节-滚动角度                       $    $           $    $  ANS021.BYTE006  $  y=0.349-(x1*256+x2)*0.00001745;
  $  034.初始标定细节-峰值角度                       $    $           $    $  ANS021.BYTE008  $  y=0.349-(x1*256+x2)*0.00001745;
  $  035.初始标定细节-偏航角度                       $    $           $    $  ANS021.BYTE010  $  y=0.349-(x1*256+x2)*0.00001745;
  $  036.初始标定细节-摄像头高度质量                 $    $           $    $  ANS021.BYTE012  $  y=(x1*256+x2)*0.0001;
  $  037.初始标定细节-滚动角度量                     $    $           $    $  ANS021.BYTE014  $  y=(x1*256+x2)*0.0001;
  $  038.初始标定细节-峰值角度量                     $    $           $    $  ANS021.BYTE016  $  y=(x1*256+x2)*0.0001;
  $  039.初始标定细节-偏航角度                       $    $           $    $  ANS021.BYTE018  $  y=(x1*256+x2)*0.0001;
  $  040.初始在线标定-行驶距离                       $    $           $    $  ANS022.BYTE004  $  y=(x1*256+x2)*65535+x3;
  $  041.初始在线标定-上一次标定反馈代码的秒数       $    $           $    $  ANS023.BYTE004  $  switxh(x) 0x00:y=无误差;0x01:y=校准未启动;0x02:y=照明太亮;0x03:y=光照不均匀;0x04:y=照明太暗;0x05:y=对比度太低;0x06:y=摄像头高度无效;0x07:y=视觉信号无效;0x08:y=校准位置错误;0x09:y=系统处于非睡眠状态;0x0A:y=标记检测不完整;0x0B:y=安装位置错误;0x0C:y=校准目标不匹配;0x0D:y=左侧目标未能检测到;0x0E:y=中间目标未能检测到;default: y=校准未完成;
  $  042.初始在线标定-上三次标定反馈的               $    $           $    $  ANS023.BYTE005  $  switxh(x) 0x00:y=无误差;0x01:y=校准未启动;0x02:y=照明太亮;0x03:y=光照不均匀;0x04:y=照明太暗;0x05:y=对比度太低;0x06:y=摄像头高度无效;0x07:y=视觉信号无效;0x08:y=校准位置错误;0x09:y=系统处于非睡眠状态;0x0A:y=标记检测不完整;0x0B:y=安装位置错误;0x0C:y=校准目标不匹配;0x0D:y=左侧目标未能检测到;0x0E:y=中间目标未能检测到;default: y=校准未完成;
  $  043.初始在线标定-运行中                         $    $           $    $  ANS024.BYTE004  $  switxh(x) 0x01:y=激活;default: y=未激活;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:736 30 00 01 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
