
    车型ID：0015

    模拟：协议模拟-->0015

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7BC

进入命令:

  $~  REQ000:73C 02 10 01 00 00 00 00 00       $~  ANS000:7BC 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:73C 02 3E 80 00 00 00 00 00       $!  ANS000:7BC 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:73C 03 19 02 09 00 00 00 00       $#  ANS000:7BC 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/14000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:73C 04 14 FF FF FF 00 00 00       $$  ANS000:7BC 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:73C 03 22 F1 80 00 00 00 00       $%  ANS000:7BC 03 22 F1 80 00 00 00 00
  $%  REQ001:73C 03 22 F1 87 00 00 00 00       $%  ANS001:7BC 03 22 F1 87 00 00 00 00
  $%  REQ002:73C 03 22 F1 8A 00 00 00 00       $%  ANS002:7BC 03 22 F1 8A 00 00 00 00
  $%  REQ003:73C 03 22 F1 97 00 00 00 00       $%  ANS003:7BC 03 22 F1 97 00 00 00 00
  $%  REQ004:73C 03 22 F1 93 00 00 00 00       $%  ANS004:7BC 03 22 F1 93 00 00 00 00
  $%  REQ005:73C 03 22 F1 95 00 00 00 00       $%  ANS005:7BC 03 22 F1 95 00 00 00 00
  $%  REQ006:73C 03 22 F1 8C 00 00 00 00       $%  ANS006:7BC 03 22 F1 8C 00 00 00 00
  $%  REQ007:73C 03 22 F1 90 00 00 00 00       $%  ANS007:7BC 03 22 F1 90 00 00 00 00
  $%  REQ008:73C 03 22 2F 01 00 00 00 00       $%  ANS008:7BC 03 22 2F 01 00 00 00 00
  $%  REQ009:73C 03 22 2F 02 00 00 00 00       $%  ANS009:7BC 03 22 2F 02 00 00 00 00

  $%  000:引导加载程序版本号:          $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  001:零件号:                      $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  002:系统供应商号:                $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:系统名称:                    $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:系统供应商硬件版本号:        $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商软件版本号:        $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21);
  $%  006:ECU序列号:                   $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  007:VIN码:                       $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  008:生产日期:                    $%    $%  ANS008.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  009:软件烧写日期:                $%    $%  ANS009.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:73C 03 22 2F 00 00 00 00 00       $  ANS000:7BC 03 22 2F 00 00 00 00 00
  $  REQ001:73C 03 22 2F 01 00 00 00 00       $  ANS001:7BC 03 22 2F 01 00 00 00 00
  $  REQ002:73C 03 22 2F 02 00 00 00 00       $  ANS002:7BC 03 22 2F 02 00 00 00 00
  $  REQ003:73C 03 22 2F 03 00 00 00 00       $  ANS003:7BC 03 22 2F 03 00 00 00 00
  $  REQ004:73C 03 22 2F 04 00 00 00 00       $  ANS004:7BC 03 22 2F 04 00 00 00 00
  $  REQ005:73C 03 22 2F 05 00 00 00 00       $  ANS005:7BC 03 22 2F 05 00 00 00 00
  $  REQ006:73C 03 22 2F 06 00 00 00 00       $  ANS006:7BC 03 22 2F 06 00 00 00 00
  $  REQ007:73C 03 22 2F 07 00 00 00 00       $  ANS007:7BC 03 22 2F 07 00 00 00 00
  $  REQ008:73C 03 22 2F 08 00 00 00 00       $  ANS008:7BC 03 22 2F 08 00 00 00 00
  $  REQ009:73C 03 22 2F 09 00 00 00 00       $  ANS009:7BC 03 22 2F 09 00 00 00 00
  $  REQ010:73C 03 22 2F 0A 00 00 00 00       $  ANS010:7BC 03 22 2F 0A 00 00 00 00
  $  REQ011:73C 03 22 2F 0B 00 00 00 00       $  ANS011:7BC 03 22 2F 0B 00 00 00 00
  $  REQ012:73C 03 22 2F 0C 00 00 00 00       $  ANS012:7BC 03 22 2F 0C 00 00 00 00
  $  REQ013:73C 03 22 2F 0D 00 00 00 00       $  ANS013:7BC 03 22 2F 0D 00 00 00 00
  $  REQ014:73C 03 22 2F 0E 00 00 00 00       $  ANS014:7BC 03 22 2F 0E 00 00 00 00
  $  REQ015:73C 03 22 2F 0F 00 00 00 00       $  ANS015:7BC 03 22 2F 0F 00 00 00 00
  $  REQ016:73C 03 22 2F 10 00 00 00 00       $  ANS016:7BC 03 22 2F 10 00 00 00 00
  $  REQ017:73C 03 22 2F 11 00 00 00 00       $  ANS017:7BC 03 22 2F 11 00 00 00 00
  $  REQ018:73C 03 22 2F 12 00 00 00 00       $  ANS018:7BC 03 22 2F 12 00 00 00 00
  $  REQ019:73C 03 22 2F 13 00 00 00 00       $  ANS019:7BC 03 22 2F 13 00 00 00 00
  $  REQ020:73C 03 22 2F 14 00 00 00 00       $  ANS020:7BC 03 22 2F 14 00 00 00 00
  $  REQ021:73C 03 22 2F 15 00 00 00 00       $  ANS021:7BC 03 22 2F 15 00 00 00 00
  $  REQ022:73C 03 22 2F 16 00 00 00 00       $  ANS022:7BC 03 22 2F 16 00 00 00 00
  $  REQ023:73C 03 22 2F 17 00 00 00 00       $  ANS023:7BC 03 22 2F 17 00 00 00 00
  $  REQ024:73C 03 22 2F 18 00 00 00 00       $  ANS024:7BC 03 22 2F 18 00 00 00 00
  $  REQ025:73C 03 22 2F 19 00 00 00 00       $  ANS025:7BC 03 22 2F 19 00 00 00 00
  $  REQ026:73C 03 22 2F 1A 00 00 00 00       $  ANS026:7BC 03 22 2F 1A 00 00 00 00
  $  REQ027:73C 03 22 2F 1B 00 00 00 00       $  ANS027:7BC 03 22 2F 1B 00 00 00 00
  $  REQ028:73C 03 22 2F 1C 00 00 00 00       $  ANS028:7BC 03 22 2F 1C 00 00 00 00
  $  REQ029:73C 03 22 2F 1D 00 00 00 00       $  ANS029:7BC 03 22 2F 1D 00 00 00 00
  $  REQ030:73C 03 22 2F 1E 00 00 00 00       $  ANS030:7BC 03 22 2F 1E 00 00 00 00
  $  REQ031:73C 03 22 2F 1F 00 00 00 00       $  ANS031:7BC 03 22 2F 1F 00 00 00 00
  $  REQ032:73C 03 22 2F 20 00 00 00 00       $  ANS032:7BC 03 22 2F 20 00 00 00 00

  $  000.最终自检结果                                     $    $            $    $  ANS000.BYTE004  $  if(((x1>>0)&1)) y=@00df;else y=@00e0;
  $  001.电机温度传感器自检结果                           $    $            $    $  ANS000.BYTE004  $  if(((x1>>1)&1)) y=@00df;else y=@00e0;
  $  002.IGBT(绝缘栅双极型晶体管)温度传感器自检结果       $    $            $    $  ANS000.BYTE004  $  if(((x1>>2)&1)) y=@00df;else y=@00e0;
  $  003.EEP自检结果                                      $    $            $    $  ANS000.BYTE004  $  if(((x1>>3)&1)) y=@00df;else y=@00e0;
  $  004.低压自检结果                                     $    $            $    $  ANS000.BYTE004  $  if(((x1>>4)&1)) y=@00df;else y=@00e0;
  $  005.IGBT(绝缘栅双极型晶体管)驱动电压自检结果         $    $            $    $  ANS000.BYTE004  $  if(((x1>>5)&1)) y=@00df;else y=@00e0;
  $  006.相电流传感器自检结果                             $    $            $    $  ANS000.BYTE004  $  if(((x1>>6)&1)) y=@00df;else y=@00e0;
  $  007.母线电流传感器自检结果                           $    $            $    $  ANS000.BYTE004  $  if(((x1>>7)&1)) y=@00df;else y=@00e0;
  $  008.IGBT(绝缘栅双极型晶体管)自检结果-U相             $    $            $    $  ANS000.BYTE005  $  if(((x1>>0)&1)) y=@00df;else y=@00e0;
  $  009.IGBT(绝缘栅双极型晶体管)自检结果-V相             $    $            $    $  ANS000.BYTE005  $  if(((x1>>1)&1)) y=@00df;else y=@00e0;
  $  010.IGBT(绝缘栅双极型晶体管)自检结果-W相             $    $            $    $  ANS000.BYTE005  $  if(((x1>>2)&1)) y=@00df;else y=@00e0;
  $  011.旋变自检结果                                     $    $            $    $  ANS000.BYTE005  $  if(((x1>>3)&1)) y=@00df;else y=@00e0;
  $  012.电机厂商                                         $    $            $    $  ANS000.BYTE006  $  y = SPRINTF([%02x], x1);
  $  013.电机极对数                                       $    $            $    $  ANS000.BYTE007  $  y = SPRINTF([%d], (x1&15));
  $  014.电机温度传感器类型                               $    $            $    $  ANS000.BYTE007  $  switxh((x1>>4)&0x03) 0x00: y=@0011; 0x01: y=@00db; 0x02: y=@00dc; 0x03: y=@004a;
  $  015.旋变方向                                         $    $            $    $  ANS000.BYTE007  $  if(((x1>>6)&1)) y=@00dd;else y=@00de;
  $  016.初始位置角                                       $    $            $    $  ANS000.BYTE008  $  y = SPRINTF([%d], (x1*256+x2));
  $  017.生产日期-年                                      $    $            $    $  ANS001.BYTE004  $  y = SPRINTF([%04d], (x1*256+x2));
  $  018.生产日期-月                                      $    $            $    $  ANS001.BYTE006  $  y = SPRINTF([%02d], x1);
  $  019.生产日期-日                                      $    $            $    $  ANS001.BYTE007  $  y = SPRINTF([%02d], x1);
  $  020.软件烧写日期-年                                  $    $            $    $  ANS002.BYTE004  $  y = SPRINTF([%04d], (x1*256+x2));
  $  021.软件烧写日期-月                                  $    $            $    $  ANS002.BYTE006  $  y = SPRINTF([%02d], x1);
  $  022.软件烧写日期-日                                  $    $            $    $  ANS002.BYTE007  $  y = SPRINTF([%02d], x1);
  $  023.控制器温度                                       $    $  deg C     $    $  ANS003.BYTE004  $  if(x1<128) y=(x1*256+x2)-40; else y=(x1*256+x2)-65536-40;
  $  024.电机温度                                         $    $  deg C     $    $  ANS004.BYTE004  $  if(x1<128) y=(x1*256+x2)-40; else y=(x1*256+x2)-65536-40;
  $  025.蓄电池电压                                       $    $  V         $    $  ANS005.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  026.5V电压                                           $    $  V         $    $  ANS006.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  027.驱动电压                                         $    $  V         $    $  ANS007.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  028.母线电压                                         $    $  V         $    $  ANS008.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  029.母线电流                                         $    $  A         $    $  ANS009.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  030.母线观测电流                                     $    $  A         $    $  ANS010.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  031.相电压                                           $    $  V         $    $  ANS011.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  032.相电流                                           $    $  A         $    $  ANS012.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  033.电机转速                                         $    $  rpm       $    $  ANS013.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  034.指令转矩                                         $    $  N.m       $    $  ANS014.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  035.输出转矩                                         $    $  N.m       $    $  ANS015.BYTE004  $  y = SPRINTF([%d], (x1*256+x2*256+x3*256+x4));
  $  036.转子电角度                                       $    $            $    $  ANS016.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  037.开管状态                                         $    $            $    $  ANS017.BYTE005  $  if(((x1>>0)&1)) y=@00d9;else y=@00da;
  $  038.预充允许                                         $    $            $    $  ANS017.BYTE005  $  if(((x1>>1)&1)) y=@00d3;else y=@00d4;
  $  039.高压状态                                         $    $            $    $  ANS017.BYTE005  $  switxh((x1>>2)&0x03) 0x00: y=@00d5; 0x01: y=@00d6; 0x02: y=@00d7; 0x03: y=@00d8;
  $  040.故障状态                                         $    $            $    $  ANS017.BYTE005  $  if(((x1>>4)&1)) y=@00c8;else y=@00c9;
  $  041.主动放电状态                                     $    $            $    $  ANS017.BYTE005  $  switxh((x1>>4)&0x0F) 0x00: y=@00ca; 0x01: y=@00cb; 0x02: y=@00cc; 0x03: y=@00cd; 0x04: y=@00ce; 0x05: y=@00cf; 0x06: y=@00d0; 0x07: y=@00d1; default: y=@00d2;
  $  042.电机模式                                         $    $            $    $  ANS017.BYTE004  $  switxh(x1&0x03) 0x00: y=@00c2; 0x01: y=@00c3; 0x02: y=@00c4; 0x03: y=@00c5;
  $  043.电机状态                                         $    $            $    $  ANS017.BYTE004  $  if(((x1>>2)&1)) y=@00c6;else y=@00c7;
  $  044.开管允许                                         $    $            $    $  ANS017.BYTE004  $  if(((x1>>3)&1)) y=@00c0;else y=@00c1;
  $  045.关管允许                                         $    $            $    $  ANS017.BYTE004  $  if(((x1>>4)&1)) y=@00c0;else y=@00c1;
  $  046.对位置角状态                                     $    $            $    $  ANS017.BYTE004  $  switxh((x1>>5)&0x07) 0x00: y=@004d; 0x01: y=@00ba; 0x02: y=@00bb; 0x03: y=@00bc; 0x04: y=@00bd; 0x05: y=@00be; default: y=@00bf;
  $  047.IGBT(绝缘栅双极型晶体管)硬件故障-U+              $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>0)&1));
  $  048.IGBT(绝缘栅双极型晶体管)硬件故障-U-              $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>1)&1));
  $  049.IGBT(绝缘栅双极型晶体管)硬件故障-V+              $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>2)&1));
  $  050.IGBT(绝缘栅双极型晶体管)硬件故障-V-              $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>3)&1));
  $  051.IGBT(绝缘栅双极型晶体管)硬件故障-W+              $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>4)&1));
  $  052.IGBT(绝缘栅双极型晶体管)硬件故障-W-              $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>5)&1));
  $  053.旋变丢失                                         $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>6)&1));
  $  054.旋变降级                                         $    $            $    $  ANS018.BYTE004  $  y = SPRINTF([%d], ((x>>7)&1));
  $  055.硬件关管                                         $    $            $    $  ANS018.BYTE005  $  y = SPRINTF([%d], ((x>>0)&1));
  $  056.母线过压                                         $    $            $    $  ANS018.BYTE005  $  y = SPRINTF([%d], ((x>>1)&1));
  $  057.IGBT(绝缘栅双极型晶体管)相过流-U                 $    $            $    $  ANS018.BYTE005  $  y = SPRINTF([%d], ((x>>2)&1));
  $  058.IGBT(绝缘栅双极型晶体管)相过流-V                 $    $            $    $  ANS018.BYTE005  $  y = SPRINTF([%d], ((x>>3)&1));
  $  059.IGBT(绝缘栅双极型晶体管)相过流-W                 $    $            $    $  ANS018.BYTE005  $  y = SPRINTF([%d], ((x>>4)&1));
  $  060.母线过流                                         $    $            $    $  ANS018.BYTE005  $  y = SPRINTF([%d], ((x>>5)&1));
  $  061.外部唤醒                                         $    $            $    $  ANS018.BYTE006  $  y = SPRINTF([%d], ((x>>0)&1));
  $  062.旋变方向                                         $    $            $    $  ANS018.BYTE006  $  y = SPRINTF([%d], ((x>>1)&1));
  $  063.外部输入1                                        $    $            $    $  ANS018.BYTE006  $  y = SPRINTF([%d], ((x>>2)&1));
  $  064.外部输入2                                        $    $            $    $  ANS018.BYTE006  $  y = SPRINTF([%d], ((x>>3)&1));
  $  065.CAN下载使能                                      $    $            $    $  ANS018.BYTE007  $  y = SPRINTF([%d], ((x>>0)&1));
  $  066.SCI下载使能                                      $    $            $    $  ANS018.BYTE007  $  y = SPRINTF([%d], ((x>>1)&1));
  $  067.弱点维持                                         $    $            $    $  ANS018.BYTE007  $  y = SPRINTF([%d], ((x>>2)&1));
  $  068.故障自锁                                         $    $            $    $  ANS018.BYTE007  $  y = SPRINTF([%d], ((x>>3)&1));
  $  069.驱动电源使能                                     $    $            $    $  ANS018.BYTE007  $  y = SPRINTF([%d], ((x>>4)&1));
  $  070.电机类型                                         $    $            $    $  ANS019.BYTE004  $  y = SPRINTF([%.4X], (x1*256+x2));
  $  071.电机温度传感器类型                               $    $            $    $  ANS020.BYTE004  $  y = SPRINTF([%.4X], (x1*256+x2));
  $  072.电机极对数                                       $    $            $    $  ANS021.BYTE004  $  y = SPRINTF([%.4X], (x1*256+x2));
  $  073.旋变极对数                                       $    $            $    $  ANS022.BYTE004  $  y = SPRINTF([%.4X], (x1*256+x2));
  $  074.旋变初始角                                       $    $            $    $  ANS023.BYTE004  $  y = SPRINTF([%.4X], (x1*256+x2));
  $  075.旋变方向                                         $    $            $    $  ANS024.BYTE004  $  y = SPRINTF([%.4X], (x1*256+x2));
  $  076.B相AD值                                          $    $            $    $  ANS025.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  077.C相AD值                                          $    $            $    $  ANS026.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  078.母线电流AD值                                     $    $            $    $  ANS027.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  079.母线电压AD值                                     $    $            $    $  ANS028.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  080.IGBT1温度                                        $    $  deg C     $    $  ANS029.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  081.IGBT2温度                                        $    $  deg C     $    $  ANS030.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  082.IGBT3温度                                        $    $  deg C     $    $  ANS031.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;
  $  083.电机1温度                                        $    $  deg C     $    $  ANS032.BYTE004  $  if(x1<128) y=(x1*256+x2); else y=(x1*256+x2)-65536;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:73C 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
