
    车型ID：0037

    模拟：协议模拟-->0037

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k$~7E9

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 00 00 00 00 00 00       $!  ANS000:7E9 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/28000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 87 00 00 00 00       $%  ANS000:7E9 03 22 F1 87 00 00 00 00
  $%  REQ001:7E1 03 22 F1 8A 00 00 00 00       $%  ANS001:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ002:7E1 03 22 F1 93 00 00 00 00       $%  ANS002:7E9 03 22 F1 93 00 00 00 00
  $%  REQ003:7E1 03 22 F1 95 00 00 00 00       $%  ANS003:7E9 03 22 F1 95 00 00 00 00
  $%  REQ004:7E1 03 22 F1 9D 00 00 00 00       $%  ANS004:7E9 03 22 F1 9D 00 00 00 00
  $%  REQ005:7E1 03 22 F1 8B 00 00 00 00       $%  ANS005:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ006:7E1 03 22 F1 90 00 00 00 00       $%  ANS006:7E9 03 22 F1 90 00 00 00 00
  $%  REQ007:7E1 03 22 F1 84 00 00 00 00       $%  ANS007:7E9 03 22 F1 84 00 00 00 00
  $%  REQ008:7E1 03 22 F1 8C 00 00 00 00       $%  ANS008:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ009:7E1 03 22 F1 98 00 00 00 00       $%  ANS009:7E9 03 22 F1 98 00 00 00 00
  $%  REQ010:7E1 03 22 05 2D 00 00 00 00       $%  ANS010:7E9 03 22 05 2D 00 00 00 00

  $%  000:零部件件号:                     $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  001:系统供应商代码:                 $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  002:系统供应商ECU硬件版本号:        $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  003:系统供应商ECU软件版本号:        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:ECU安装日期:                    $%    $%  ANS004.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  005:ECU制造日期:                    $%    $%  ANS005.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  006:VIN:                            $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:指纹数据标识符:                 $%    $%  ANS007.BYTE004  $%  y = SPRINTF([%02X%02X%02X%02X%c%c%c%c%c%c%c%c%c%c],x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14);
  $%  008:ECU序列号:                      $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  009:维修店代码/测试仪序列号:        $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:电池模组制造日期:               $%    $%  ANS010.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 05 01 00 00 00 00       $  ANS000:7E9 03 22 05 01 00 00 00 00
  $  REQ001:7E1 03 22 05 02 00 00 00 00       $  ANS001:7E9 03 22 05 02 00 00 00 00
  $  REQ002:7E1 03 22 05 03 00 00 00 00       $  ANS002:7E9 03 22 05 03 00 00 00 00
  $  REQ003:7E1 03 22 05 04 00 00 00 00       $  ANS003:7E9 03 22 05 04 00 00 00 00
  $  REQ004:7E1 03 22 05 05 00 00 00 00       $  ANS004:7E9 03 22 05 05 00 00 00 00
  $  REQ005:7E1 03 22 05 06 00 00 00 00       $  ANS005:7E9 03 22 05 06 00 00 00 00
  $  REQ006:7E1 03 22 05 07 00 00 00 00       $  ANS006:7E9 03 22 05 07 00 00 00 00
  $  REQ007:7E1 03 22 05 08 00 00 00 00       $  ANS007:7E9 03 22 05 08 00 00 00 00
  $  REQ008:7E1 03 22 05 09 00 00 00 00       $  ANS008:7E9 03 22 05 09 00 00 00 00
  $  REQ009:7E1 03 22 05 0A 00 00 00 00       $  ANS009:7E9 03 22 05 0A 00 00 00 00
  $  REQ010:7E1 03 22 05 0B 00 00 00 00       $  ANS010:7E9 03 22 05 0B 00 00 00 00
  $  REQ011:7E1 03 22 05 0C 00 00 00 00       $  ANS011:7E9 03 22 05 0C 00 00 00 00
  $  REQ012:7E1 03 22 05 0D 00 00 00 00       $  ANS012:7E9 03 22 05 0D 00 00 00 00
  $  REQ013:7E1 03 22 05 0E 00 00 00 00       $  ANS013:7E9 03 22 05 0E 00 00 00 00
  $  REQ014:7E1 03 22 05 0F 00 00 00 00       $  ANS014:7E9 03 22 05 0F 00 00 00 00
  $  REQ015:7E1 03 22 05 10 00 00 00 00       $  ANS015:7E9 03 22 05 10 00 00 00 00
  $  REQ016:7E1 03 22 05 11 00 00 00 00       $  ANS016:7E9 03 22 05 11 00 00 00 00
  $  REQ017:7E1 03 22 05 12 00 00 00 00       $  ANS017:7E9 03 22 05 12 00 00 00 00
  $  REQ018:7E1 03 22 05 13 00 00 00 00       $  ANS018:7E9 03 22 05 13 00 00 00 00
  $  REQ019:7E1 03 22 05 14 00 00 00 00       $  ANS019:7E9 03 22 05 14 00 00 00 00
  $  REQ020:7E1 03 22 05 15 00 00 00 00       $  ANS020:7E9 03 22 05 15 00 00 00 00
  $  REQ021:7E1 03 22 05 16 00 00 00 00       $  ANS021:7E9 03 22 05 16 00 00 00 00
  $  REQ022:7E1 03 22 05 17 00 00 00 00       $  ANS022:7E9 03 22 05 17 00 00 00 00
  $  REQ023:7E1 03 22 05 18 00 00 00 00       $  ANS023:7E9 03 22 05 18 00 00 00 00
  $  REQ024:7E1 03 22 05 19 00 00 00 00       $  ANS024:7E9 03 22 05 19 00 00 00 00
  $  REQ025:7E1 03 22 05 1A 00 00 00 00       $  ANS025:7E9 03 22 05 1A 00 00 00 00
  $  REQ026:7E1 03 22 05 1B 00 00 00 00       $  ANS026:7E9 03 22 05 1B 00 00 00 00
  $  REQ027:7E1 03 22 05 1C 00 00 00 00       $  ANS027:7E9 03 22 05 1C 00 00 00 00
  $  REQ028:7E1 03 22 05 1D 00 00 00 00       $  ANS028:7E9 03 22 05 1D 00 00 00 00
  $  REQ029:7E1 03 22 05 1E 00 00 00 00       $  ANS029:7E9 03 22 05 1E 00 00 00 00
  $  REQ030:7E1 03 22 05 1F 00 00 00 00       $  ANS030:7E9 03 22 05 1F 00 00 00 00
  $  REQ031:7E1 03 22 05 20 00 00 00 00       $  ANS031:7E9 03 22 05 20 00 00 00 00
  $  REQ032:7E1 03 22 05 21 00 00 00 00       $  ANS032:7E9 03 22 05 21 00 00 00 00
  $  REQ033:7E1 03 22 05 22 00 00 00 00       $  ANS033:7E9 03 22 05 22 00 00 00 00
  $  REQ034:7E1 03 22 05 23 00 00 00 00       $  ANS034:7E9 03 22 05 23 00 00 00 00
  $  REQ035:7E1 03 22 05 24 00 00 00 00       $  ANS035:7E9 03 22 05 24 00 00 00 00
  $  REQ036:7E1 03 22 05 25 00 00 00 00       $  ANS036:7E9 03 22 05 25 00 00 00 00
  $  REQ037:7E1 03 22 05 26 00 00 00 00       $  ANS037:7E9 03 22 05 26 00 00 00 00
  $  REQ038:7E1 03 22 05 27 00 00 00 00       $  ANS038:7E9 03 22 05 27 00 00 00 00
  $  REQ039:7E1 03 22 05 28 00 00 00 00       $  ANS039:7E9 03 22 05 28 00 00 00 00
  $  REQ040:7E1 03 22 05 29 00 00 00 00       $  ANS040:7E9 03 22 05 29 00 00 00 00
  $  REQ041:7E1 03 22 05 2A 00 00 00 00       $  ANS041:7E9 03 22 05 2A 00 00 00 00
  $  REQ042:7E1 03 22 05 2B 00 00 00 00       $  ANS042:7E9 03 22 05 2B 00 00 00 00
  $  REQ043:7E1 03 22 05 2C 00 00 00 00       $  ANS043:7E9 03 22 05 2C 00 00 00 00

  $  000.低压供电电压                  $    $  V       $    $  ANS000.BYTE004  $  y = SPRINTF([%.1f], x1*0.1);
  $  001.总电压                        $    $  V       $    $  ANS001.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1);
  $  002.总电流                        $    $  A       $    $  ANS002.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1-500);
  $  003.电池系统状态                  $    $          $    $  ANS003.BYTE004  $  if(x1==0) y=@001d;else if(x1==1) y=@001e;else if(x1==2) y=@001f;else if(x1==3) y=@0020;else y=@0004;
  $  004.最大单体电压                  $    $  V       $    $  ANS004.BYTE004  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  005.最大单体电压编号              $    $          $    $  ANS005.BYTE004  $  y = SPRINTF([%d], x1);
  $  006.最小单体电压                  $    $  V       $    $  ANS006.BYTE004  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  007.最小单体电压编号              $    $          $    $  ANS007.BYTE004  $  y = SPRINTF([%d], x1);
  $  008.最大温度                      $    $  ℃      $    $  ANS008.BYTE004  $  y = SPRINTF([%d], x1-40);
  $  009.最大温度编号                  $    $          $    $  ANS009.BYTE004  $  y = SPRINTF([%d], x1);
  $  010.最小温度                      $    $  ℃      $    $  ANS010.BYTE004  $  y = SPRINTF([%d], x1-40);
  $  011.最小温度编号                  $    $          $    $  ANS011.BYTE004  $  y = SPRINTF([%d], x1);
  $  012.SOH值                         $    $  %       $    $  ANS012.BYTE004  $  y = SPRINTF([%d], x1);
  $  013.BMS充电状态                   $    $          $    $  ANS013.BYTE004  $  if(x1==0) y=@0077;else if(x1==1) y=@0078;else if(x1==2) y=@0079;else if(x1==3) y=@000f;else y=@0004;
  $  014.快充正极继电器状态            $    $          $    $  ANS014.BYTE004  $  if(x1==0) y=@0062;else if(x1==1) y=@0063;else if(x1==2) y=@0030;else y=@0004;
  $  015.总负极继电器状态              $    $          $    $  ANS015.BYTE004  $  if(x1==0) y=@0062;else if(x1==1) y=@0063;else if(x1==2) y=@0030;else y=@0004;
  $  016.慢充继电器状态                $    $          $    $  ANS016.BYTE004  $  if(x1==0) y=@0062;else if(x1==1) y=@0063;else if(x1==2) y=@0030;else y=@0004;
  $  017.SOC值                         $    $  %       $    $  ANS017.BYTE004  $  y = SPRINTF([%d], x1);
  $  018.最大允许充电电压              $    $  V       $    $  ANS018.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1);
  $  019.最大允许充电电流              $    $  A       $    $  ANS019.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1);
  $  020.电池充电控制状态              $    $          $    $  ANS020.BYTE004  $  if(x1==0) y=@0015;else if(x1==1) y=@0016;else y=@0004;
  $  021.最大脉冲充电功率              $    $  KW      $    $  ANS021.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.5);
  $  022.最大脉冲回馈功率              $    $  KW      $    $  ANS022.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.5);
  $  023.最大持续充电功率              $    $  KW      $    $  ANS023.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.5);
  $  024.最大持续回馈功率              $    $  KW      $    $  ANS024.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.5);
  $  025.BMS绝缘阻值                   $    $  KΩ     $    $  ANS025.BYTE004  $  y = SPRINTF([%d], (x1*256+x2));
  $  026.平均温度                      $    $  ℃      $    $  ANS026.BYTE004  $  y = SPRINTF([%d], x1-40);
  $  027.电池一般状态                  $    $          $    $  ANS027.BYTE004  $  if(x1==0) y=@0017;else if(x1==1) y=@0018;else if(x1==2) y=@0019;else if(x1==3) y=@001a;else if(x1==4) y=@001b;else if(x1==5) y=@001c;else y=@0004;
  $  028.快充电压                      $    $  V       $    $  ANS028.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1);
  $  029.快充电流                      $    $  A       $    $  ANS029.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1-500);
  $  030.慢充充电电压请求              $    $  V       $    $  ANS030.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1);
  $  031.慢充充电电流请求              $    $  A       $    $  ANS031.BYTE004  $  y = SPRINTF([%.1f], (x1*256+x2)*0.1);
  $  032.慢充充电允许控制              $    $          $    $  ANS032.BYTE004  $  if(x1==0) y=@000f;else if(x1==1) y=@0010;else y=@0004;
  $  033.充电模式控制                  $    $          $    $  ANS033.BYTE004  $  if(x1==0) y=@0011;else if(x1==1) y=@0012;else if(x1==2) y=@0013;else if(x1==3) y=@0014;else y=@0004;
  $  034.加热故障                      $    $          $    $  ANS034.BYTE004  $  if(x1==0) y=@0009;else if(x1==1) y=@000a;else if(x1==2) y=@000b;else if(x1==3) y=@000c;else y=@0004;
  $  035.快充枪连接状态                $    $          $    $  ANS035.BYTE004  $  if(x1==0) y=@000d;else if(x1==1) y=@000e;else y=@0004;
  $  036.电池包冷却状态                $    $          $    $  ANS036.BYTE004  $  if(x1==0) y=@0027;else if(x1==1) y=@0028;else if(x1==2) y=@0029;else if(x1==3) y=@002a;else y=@0004;
  $  037.电池加热/冷却/均衡 中断       $    $          $    $  ANS037.BYTE004  $  if(x1==0) y=@0017;else if(x1==1) y=@002b;else y=@0004;
  $  038.瞬时功率                      $    $  KW      $    $  ANS038.BYTE004  $  y = SPRINTF([%.1f], x1*0.5);
  $  039.CP信号占空比                  $    $          $    $  ANS039.BYTE004  $  y = SPRINTF([%d], x1);
  $  040.CC信号状态                    $    $          $    $  ANS040.BYTE004  $  if(x1==0) y=@0021;else if(x1==1) y=@0022;else if(x1==2) y=@0023;else if(x1==3) y=@0023;else if(x1==4) y=@0024;else if(x1==5) y=@0024;else if(x1==6) y=@0025;else if(x1==7) y=@0025;else if(x1==8) y=@0026;else if(x1==9) y=@0026;else y=@0004;
  $  041.慢充枪连接状态                $    $          $    $  ANS041.BYTE004  $  if(x1==0) y=@000d;else if(x1==1) y=@000e;else y=@0004;
  $  042.1号单体电压                   $    $  V       $    $  ANS042.BYTE004  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  043.2号单体电压                   $    $  V       $    $  ANS042.BYTE006  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  044.3号单体电压                   $    $  V       $    $  ANS042.BYTE008  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  045.4号单体电压                   $    $  V       $    $  ANS042.BYTE010  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  046.5号单体电压                   $    $  V       $    $  ANS042.BYTE012  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  047.6号单体电压                   $    $  V       $    $  ANS042.BYTE014  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  048.7号单体电压                   $    $  V       $    $  ANS042.BYTE016  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  049.8号单体电压                   $    $  V       $    $  ANS042.BYTE018  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  050.9号单体电压                   $    $  V       $    $  ANS042.BYTE020  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  051.10号单体电压                  $    $  V       $    $  ANS042.BYTE022  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  052.11号单体电压                  $    $  V       $    $  ANS042.BYTE024  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  053.12号单体电压                  $    $  V       $    $  ANS042.BYTE026  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  054.13号单体电压                  $    $  V       $    $  ANS042.BYTE028  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  055.14号单体电压                  $    $  V       $    $  ANS042.BYTE030  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  056.15号单体电压                  $    $  V       $    $  ANS042.BYTE032  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  057.16号单体电压                  $    $  V       $    $  ANS042.BYTE034  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  058.17号单体电压                  $    $  V       $    $  ANS042.BYTE036  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  059.18号单体电压                  $    $  V       $    $  ANS042.BYTE038  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  060.19号单体电压                  $    $  V       $    $  ANS042.BYTE040  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  061.20号单体电压                  $    $  V       $    $  ANS042.BYTE042  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  062.21号单体电压                  $    $  V       $    $  ANS042.BYTE044  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  063.22号单体电压                  $    $  V       $    $  ANS042.BYTE046  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  064.23号单体电压                  $    $  V       $    $  ANS042.BYTE048  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  065.24号单体电压                  $    $  V       $    $  ANS042.BYTE050  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  066.25号单体电压                  $    $  V       $    $  ANS042.BYTE052  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  067.26号单体电压                  $    $  V       $    $  ANS042.BYTE054  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  068.27号单体电压                  $    $  V       $    $  ANS042.BYTE056  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  069.28号单体电压                  $    $  V       $    $  ANS042.BYTE058  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  070.29号单体电压                  $    $  V       $    $  ANS042.BYTE060  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  071.30号单体电压                  $    $  V       $    $  ANS042.BYTE062  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  072.31号单体电压                  $    $  V       $    $  ANS042.BYTE064  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  073.32号单体电压                  $    $  V       $    $  ANS042.BYTE066  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  074.33号单体电压                  $    $  V       $    $  ANS042.BYTE068  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  075.34号单体电压                  $    $  V       $    $  ANS042.BYTE070  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  076.35号单体电压                  $    $  V       $    $  ANS042.BYTE072  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  077.36号单体电压                  $    $  V       $    $  ANS042.BYTE074  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  078.37号单体电压                  $    $  V       $    $  ANS042.BYTE076  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  079.38号单体电压                  $    $  V       $    $  ANS042.BYTE078  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  080.39号单体电压                  $    $  V       $    $  ANS042.BYTE080  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  081.40号单体电压                  $    $  V       $    $  ANS042.BYTE082  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  082.41号单体电压                  $    $  V       $    $  ANS042.BYTE084  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  083.42号单体电压                  $    $  V       $    $  ANS042.BYTE086  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  084.43号单体电压                  $    $  V       $    $  ANS042.BYTE088  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  085.44号单体电压                  $    $  V       $    $  ANS042.BYTE090  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  086.45号单体电压                  $    $  V       $    $  ANS042.BYTE092  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  087.46号单体电压                  $    $  V       $    $  ANS042.BYTE094  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  088.47号单体电压                  $    $  V       $    $  ANS042.BYTE096  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  089.48号单体电压                  $    $  V       $    $  ANS042.BYTE098  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  090.49号单体电压                  $    $  V       $    $  ANS042.BYTE100  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  091.50号单体电压                  $    $  V       $    $  ANS042.BYTE102  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  092.51号单体电压                  $    $  V       $    $  ANS042.BYTE104  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  093.52号单体电压                  $    $  V       $    $  ANS042.BYTE106  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  094.53号单体电压                  $    $  V       $    $  ANS042.BYTE108  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  095.54号单体电压                  $    $  V       $    $  ANS042.BYTE110  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  096.55号单体电压                  $    $  V       $    $  ANS042.BYTE112  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  097.56号单体电压                  $    $  V       $    $  ANS042.BYTE114  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  098.57号单体电压                  $    $  V       $    $  ANS042.BYTE116  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  099.58号单体电压                  $    $  V       $    $  ANS042.BYTE118  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  100.59号单体电压                  $    $  V       $    $  ANS042.BYTE120  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  101.60号单体电压                  $    $  V       $    $  ANS042.BYTE122  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  102.61号单体电压                  $    $  V       $    $  ANS042.BYTE124  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  103.62号单体电压                  $    $  V       $    $  ANS042.BYTE126  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  104.63号单体电压                  $    $  V       $    $  ANS042.BYTE128  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  105.64号单体电压                  $    $  V       $    $  ANS042.BYTE130  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  106.65号单体电压                  $    $  V       $    $  ANS042.BYTE132  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  107.66号单体电压                  $    $  V       $    $  ANS042.BYTE134  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  108.67号单体电压                  $    $  V       $    $  ANS042.BYTE136  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  109.68号单体电压                  $    $  V       $    $  ANS042.BYTE138  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  110.69号单体电压                  $    $  V       $    $  ANS042.BYTE140  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  111.70号单体电压                  $    $  V       $    $  ANS042.BYTE142  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  112.71号单体电压                  $    $  V       $    $  ANS042.BYTE144  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  113.72号单体电压                  $    $  V       $    $  ANS042.BYTE146  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  114.73号单体电压                  $    $  V       $    $  ANS042.BYTE148  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  115.74号单体电压                  $    $  V       $    $  ANS042.BYTE150  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  116.75号单体电压                  $    $  V       $    $  ANS042.BYTE152  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  117.76号单体电压                  $    $  V       $    $  ANS042.BYTE154  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  118.77号单体电压                  $    $  V       $    $  ANS042.BYTE156  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  119.78号单体电压                  $    $  V       $    $  ANS042.BYTE158  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  120.79号单体电压                  $    $  V       $    $  ANS042.BYTE160  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  121.80号单体电压                  $    $  V       $    $  ANS042.BYTE162  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  122.81号单体电压                  $    $  V       $    $  ANS042.BYTE164  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  123.82号单体电压                  $    $  V       $    $  ANS042.BYTE166  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  124.83号单体电压                  $    $  V       $    $  ANS042.BYTE168  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  125.84号单体电压                  $    $  V       $    $  ANS042.BYTE170  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  126.85号单体电压                  $    $  V       $    $  ANS042.BYTE172  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  127.86号单体电压                  $    $  V       $    $  ANS042.BYTE174  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  128.87号单体电压                  $    $  V       $    $  ANS042.BYTE176  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  129.88号单体电压                  $    $  V       $    $  ANS042.BYTE178  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  130.89号单体电压                  $    $  V       $    $  ANS042.BYTE180  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  131.90号单体电压                  $    $  V       $    $  ANS042.BYTE182  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  132.91号单体电压                  $    $  V       $    $  ANS042.BYTE184  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  133.92号单体电压                  $    $  V       $    $  ANS042.BYTE186  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  134.93号单体电压                  $    $  V       $    $  ANS042.BYTE188  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  135.94号单体电压                  $    $  V       $    $  ANS042.BYTE190  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  136.95号单体电压                  $    $  V       $    $  ANS042.BYTE192  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  137.96号单体电压                  $    $  V       $    $  ANS042.BYTE194  $  y = SPRINTF([%.3f], (x1*256+x2)*0.001);
  $  138.1号温度点温度                 $    $  ℃      $    $  ANS043.BYTE004  $  y = SPRINTF([%d], x1-40);
  $  139.2号温度点温度                 $    $  ℃      $    $  ANS043.BYTE005  $  y = SPRINTF([%d], x1-40);
  $  140.3号温度点温度                 $    $  ℃      $    $  ANS043.BYTE006  $  y = SPRINTF([%d], x1-40);
  $  141.4号温度点温度                 $    $  ℃      $    $  ANS043.BYTE007  $  y = SPRINTF([%d], x1-40);
  $  142.5号温度点温度                 $    $  ℃      $    $  ANS043.BYTE008  $  y = SPRINTF([%d], x1-40);
  $  143.6号温度点温度                 $    $  ℃      $    $  ANS043.BYTE009  $  y = SPRINTF([%d], x1-40);
  $  144.7号温度点温度                 $    $  ℃      $    $  ANS043.BYTE010  $  y = SPRINTF([%d], x1-40);
  $  145.8号温度点温度                 $    $  ℃      $    $  ANS043.BYTE011  $  y = SPRINTF([%d], x1-40);
  $  146.9号温度点温度                 $    $  ℃      $    $  ANS043.BYTE012  $  y = SPRINTF([%d], x1-40);
  $  147.10号温度点温度                $    $  ℃      $    $  ANS043.BYTE013  $  y = SPRINTF([%d], x1-40);
  $  148.11号温度点温度                $    $  ℃      $    $  ANS043.BYTE014  $  y = SPRINTF([%d], x1-40);
  $  149.12号温度点温度                $    $  ℃      $    $  ANS043.BYTE015  $  y = SPRINTF([%d], x1-40);
  $  150.13号温度点温度                $    $  ℃      $    $  ANS043.BYTE016  $  y = SPRINTF([%d], x1-40);
  $  151.14号温度点温度                $    $  ℃      $    $  ANS043.BYTE017  $  y = SPRINTF([%d], x1-40);
  $  152.15号温度点温度                $    $  ℃      $    $  ANS043.BYTE018  $  y = SPRINTF([%d], x1-40);
  $  153.16号温度点温度                $    $  ℃      $    $  ANS043.BYTE019  $  y = SPRINTF([%d], x1-40);
  $  154.17号温度点温度                $    $  ℃      $    $  ANS043.BYTE020  $  y = SPRINTF([%d], x1-40);
  $  155.18号温度点温度                $    $  ℃      $    $  ANS043.BYTE021  $  y = SPRINTF([%d], x1-40);
  $  156.19号温度点温度                $    $  ℃      $    $  ANS043.BYTE022  $  y = SPRINTF([%d], x1-40);
  $  157.20号温度点温度                $    $  ℃      $    $  ANS043.BYTE023  $  y = SPRINTF([%d], x1-40);
  $  158.21号温度点温度                $    $  ℃      $    $  ANS043.BYTE024  $  y = SPRINTF([%d], x1-40);
  $  159.22号温度点温度                $    $  ℃      $    $  ANS043.BYTE025  $  y = SPRINTF([%d], x1-40);
  $  160.23号温度点温度                $    $  ℃      $    $  ANS043.BYTE026  $  y = SPRINTF([%d], x1-40);
  $  161.24号温度点温度                $    $  ℃      $    $  ANS043.BYTE027  $  y = SPRINTF([%d], x1-40);
  $  162.25号温度点温度                $    $  ℃      $    $  ANS043.BYTE028  $  y = SPRINTF([%d], x1-40);
  $  163.26号温度点温度                $    $  ℃      $    $  ANS043.BYTE029  $  y = SPRINTF([%d], x1-40);
  $  164.27号温度点温度                $    $  ℃      $    $  ANS043.BYTE030  $  y = SPRINTF([%d], x1-40);
  $  165.28号温度点温度                $    $  ℃      $    $  ANS043.BYTE031  $  y = SPRINTF([%d], x1-40);
  $  166.29号温度点温度                $    $  ℃      $    $  ANS043.BYTE032  $  y = SPRINTF([%d], x1-40);
  $  167.30号温度点温度                $    $  ℃      $    $  ANS043.BYTE033  $  y = SPRINTF([%d], x1-40);
  $  168.31号温度点温度                $    $  ℃      $    $  ANS043.BYTE034  $  y = SPRINTF([%d], x1-40);
  $  169.32号温度点温度                $    $  ℃      $    $  ANS043.BYTE035  $  y = SPRINTF([%d], x1-40);
  $  170.33号温度点温度                $    $  ℃      $    $  ANS043.BYTE036  $  y = SPRINTF([%d], x1-40);
  $  171.34号温度点温度                $    $  ℃      $    $  ANS043.BYTE037  $  y = SPRINTF([%d], x1-40);
  $  172.35号温度点温度                $    $  ℃      $    $  ANS043.BYTE038  $  y = SPRINTF([%d], x1-40);
  $  173.36号温度点温度                $    $  ℃      $    $  ANS043.BYTE039  $  y = SPRINTF([%d], x1-40);
  $  174.37号温度点温度                $    $  ℃      $    $  ANS043.BYTE040  $  y = SPRINTF([%d], x1-40);
  $  175.38号温度点温度                $    $  ℃      $    $  ANS043.BYTE041  $  y = SPRINTF([%d], x1-40);
  $  176.39号温度点温度                $    $  ℃      $    $  ANS043.BYTE042  $  y = SPRINTF([%d], x1-40);
  $  177.40号温度点温度                $    $  ℃      $    $  ANS043.BYTE043  $  y = SPRINTF([%d], x1-40);
  $  178.41号温度点温度                $    $  ℃      $    $  ANS043.BYTE044  $  y = SPRINTF([%d], x1-40);
  $  179.42号温度点温度                $    $  ℃      $    $  ANS043.BYTE045  $  y = SPRINTF([%d], x1-40);
  $  180.43号温度点温度                $    $  ℃      $    $  ANS043.BYTE046  $  y = SPRINTF([%d], x1-40);
  $  181.44号温度点温度                $    $  ℃      $    $  ANS043.BYTE047  $  y = SPRINTF([%d], x1-40);
  $  182.45号温度点温度                $    $  ℃      $    $  ANS043.BYTE048  $  y = SPRINTF([%d], x1-40);
  $  183.46号温度点温度                $    $  ℃      $    $  ANS043.BYTE049  $  y = SPRINTF([%d], x1-40);
  $  184.47号温度点温度                $    $  ℃      $    $  ANS043.BYTE050  $  y = SPRINTF([%d], x1-40);
  $  185.48号温度点温度                $    $  ℃      $    $  ANS043.BYTE051  $  y = SPRINTF([%d], x1-40);
  $  186.49号温度点温度                $    $  ℃      $    $  ANS043.BYTE052  $  y = SPRINTF([%d], x1-40);
  $  187.50号温度点温度                $    $  ℃      $    $  ANS043.BYTE053  $  y = SPRINTF([%d], x1-40);
  $  188.51号温度点温度                $    $  ℃      $    $  ANS043.BYTE054  $  y = SPRINTF([%d], x1-40);
  $  189.52号温度点温度                $    $  ℃      $    $  ANS043.BYTE055  $  y = SPRINTF([%d], x1-40);
  $  190.53号温度点温度                $    $  ℃      $    $  ANS043.BYTE056  $  y = SPRINTF([%d], x1-40);
  $  191.54号温度点温度                $    $  ℃      $    $  ANS043.BYTE057  $  y = SPRINTF([%d], x1-40);
  $  192.55号温度点温度                $    $  ℃      $    $  ANS043.BYTE058  $  y = SPRINTF([%d], x1-40);
  $  193.56号温度点温度                $    $  ℃      $    $  ANS043.BYTE059  $  y = SPRINTF([%d], x1-40);
  $  194.57号温度点温度                $    $  ℃      $    $  ANS043.BYTE060  $  y = SPRINTF([%d], x1-40);
  $  195.58号温度点温度                $    $  ℃      $    $  ANS043.BYTE061  $  y = SPRINTF([%d], x1-40);
  $  196.59号温度点温度                $    $  ℃      $    $  ANS043.BYTE062  $  y = SPRINTF([%d], x1-40);
  $  197.60号温度点温度                $    $  ℃      $    $  ANS043.BYTE063  $  y = SPRINTF([%d], x1-40);
  $  198.61号温度点温度                $    $  ℃      $    $  ANS043.BYTE064  $  y = SPRINTF([%d], x1-40);
  $  199.62号温度点温度                $    $  ℃      $    $  ANS043.BYTE065  $  y = SPRINTF([%d], x1-40);
  $  200.63号温度点温度                $    $  ℃      $    $  ANS043.BYTE066  $  y = SPRINTF([%d], x1-40);
  $  201.64号温度点温度                $    $  ℃      $    $  ANS043.BYTE067  $  y = SPRINTF([%d], x1-40);
  $  202.65号温度点温度                $    $  ℃      $    $  ANS043.BYTE068  $  y = SPRINTF([%d], x1-40);
  $  203.66号温度点温度                $    $  ℃      $    $  ANS043.BYTE069  $  y = SPRINTF([%d], x1-40);
  $  204.67号温度点温度                $    $  ℃      $    $  ANS043.BYTE070  $  y = SPRINTF([%d], x1-40);
  $  205.68号温度点温度                $    $  ℃      $    $  ANS043.BYTE071  $  y = SPRINTF([%d], x1-40);
  $  206.69号温度点温度                $    $  ℃      $    $  ANS043.BYTE072  $  y = SPRINTF([%d], x1-40);
  $  207.70号温度点温度                $    $  ℃      $    $  ANS043.BYTE073  $  y = SPRINTF([%d], x1-40);
  $  208.71号温度点温度                $    $  ℃      $    $  ANS043.BYTE074  $  y = SPRINTF([%d], x1-40);
  $  209.72号温度点温度                $    $  ℃      $    $  ANS043.BYTE075  $  y = SPRINTF([%d], x1-40);
  $  210.73号温度点温度                $    $  ℃      $    $  ANS043.BYTE076  $  y = SPRINTF([%d], x1-40);
  $  211.74号温度点温度                $    $  ℃      $    $  ANS043.BYTE077  $  y = SPRINTF([%d], x1-40);
  $  212.75号温度点温度                $    $  ℃      $    $  ANS043.BYTE078  $  y = SPRINTF([%d], x1-40);
  $  213.76号温度点温度                $    $  ℃      $    $  ANS043.BYTE079  $  y = SPRINTF([%d], x1-40);
  $  214.77号温度点温度                $    $  ℃      $    $  ANS043.BYTE080  $  y = SPRINTF([%d], x1-40);
  $  215.78号温度点温度                $    $  ℃      $    $  ANS043.BYTE081  $  y = SPRINTF([%d], x1-40);
  $  216.79号温度点温度                $    $  ℃      $    $  ANS043.BYTE082  $  y = SPRINTF([%d], x1-40);
  $  217.80号温度点温度                $    $  ℃      $    $  ANS043.BYTE083  $  y = SPRINTF([%d], x1-40);
  $  218.81号温度点温度                $    $  ℃      $    $  ANS043.BYTE084  $  y = SPRINTF([%d], x1-40);
  $  219.82号温度点温度                $    $  ℃      $    $  ANS043.BYTE085  $  y = SPRINTF([%d], x1-40);
  $  220.83号温度点温度                $    $  ℃      $    $  ANS043.BYTE086  $  y = SPRINTF([%d], x1-40);
  $  221.84号温度点温度                $    $  ℃      $    $  ANS043.BYTE087  $  y = SPRINTF([%d], x1-40);
  $  222.85号温度点温度                $    $  ℃      $    $  ANS043.BYTE088  $  y = SPRINTF([%d], x1-40);
  $  223.86号温度点温度                $    $  ℃      $    $  ANS043.BYTE089  $  y = SPRINTF([%d], x1-40);
  $  224.87号温度点温度                $    $  ℃      $    $  ANS043.BYTE090  $  y = SPRINTF([%d], x1-40);
  $  225.88号温度点温度                $    $  ℃      $    $  ANS043.BYTE091  $  y = SPRINTF([%d], x1-40);
  $  226.89号温度点温度                $    $  ℃      $    $  ANS043.BYTE092  $  y = SPRINTF([%d], x1-40);
  $  227.90号温度点温度                $    $  ℃      $    $  ANS043.BYTE093  $  y = SPRINTF([%d], x1-40);
  $  228.91号温度点温度                $    $  ℃      $    $  ANS043.BYTE094  $  y = SPRINTF([%d], x1-40);
  $  229.92号温度点温度                $    $  ℃      $    $  ANS043.BYTE095  $  y = SPRINTF([%d], x1-40);
  $  230.93号温度点温度                $    $  ℃      $    $  ANS043.BYTE096  $  y = SPRINTF([%d], x1-40);
  $  231.94号温度点温度                $    $  ℃      $    $  ANS043.BYTE097  $  y = SPRINTF([%d], x1-40);
  $  232.95号温度点温度                $    $  ℃      $    $  ANS043.BYTE098  $  y = SPRINTF([%d], x1-40);
  $  233.96号温度点温度                $    $  ℃      $    $  ANS043.BYTE099  $  y = SPRINTF([%d], x1-40);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
