
     系统名称:TCM (波箱控制模块)

     系统ID:00004387

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 03 00 00 00 00 00       $~ ANS000:7E9 02 10 03 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 01 00 00 00 00 00       $~ ANS000:7E9 02 10 01 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10150994&quot;: &quot;00004386&quot;, &quot;24288779&quot;: &quot;00004387&quot;, &quot;24297178&quot;: &quot;00004387&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10150994&quot;: &quot;00004386&quot;, &quot;24288779&quot;: &quot;00004387&quot;, &quot;24297178&quot;: &quot;00004387&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E1 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/00004387

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E1 03 22 F1 87 00 00 00 00            $%  
  $%  REQ002:7E1 03 22 F1 91 00 00 00 00            $%  
  $%  REQ003:7E1 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ004:7E1 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ005:7E1 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ006:7E1 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ007:7E1 03 22 F1 A9 00 00 00 00            $%  
  $%  REQ008:7E1 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ009:7E1 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ010:7E1 03 22 F1 83 00 00 00 00            $%  
  $%  REQ011:7E1 03 22 F1 8A 00 00 00 00            $%  
  $%  REQ012:7E1 03 22 F1 92 00 00 00 00            $%  
  $%  REQ013:7E1 03 22 F1 94 00 00 00 00            $%  
  $%  REQ014:7E1 03 22 F1 98 00 00 00 00            $%  
  $%  REQ015:7E1 03 22 F1 A2 00 00 00 00            $%  
  $%  REQ016:7E1 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ017:7E1 03 22 F1 BA 00 00 00 00            $%  
  $%  REQ018:7E1 03 22 AA 29 00 00 00 00            $%  

  $%  000:车辆识别码(VIN)                 $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:电控单元零件号                  $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  002:电控单元硬件号                  $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元应用软件号              $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元标定软件号              $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元序列号                  $%    $%  ANS005.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  006:电控单元制造日期                $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:电控单元配置文件号              $%    $%  ANS007.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  008:电控单元索引信息                $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3); 
  $%  009:电控单元刷新过程文件号          $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  010:电控单元基础软件参考号          $%    $%  ANS010.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  011:系统供应商标识号                $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  012:供应商电控单元硬件参考号        $%    $%  ANS012.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  013:电控单元软件参考号              $%    $%  ANS013.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10); 
  $%  014:配置跟踪域                      $%    $%  ANS014.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 
  $%  015:电控单元网络参考号              $%    $%  ANS015.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8); 
  $%  016:车辆特征信息(FK)                $%    $%  ANS016.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  017:电控单元标定软件号3             $%    $%  ANS017.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  018:刷新历史-条目数                 $%    $%  ANS018.BYTE003  $%  y=(x)*1; 
  $%  019:刷新历史-缓存锁定               $%    $%  ANS018.BYTE004  $%  y=(x&0x80)>>7; 
  $%  020:刷新历史0-零件号                $%    $%  ANS018.BYTE005  $%  HEX(x1,x2,x3,x4); 
  $%  021:刷新历史0-标定验证号CVN         $%    $%  ANS018.BYTE009  $%  HEX(x1,x2,x3,x4); 
  $%  022:刷新历史0-刷新次数              $%    $%  ANS018.BYTE013  $%  y=(x)*1; 
  $%  023:刷新历史1-零件号                $%    $%  ANS018.BYTE014  $%  HEX(x1,x2,x3,x4); 
  $%  024:刷新历史1-标定验证号CVN         $%    $%  ANS018.BYTE018  $%  HEX(x1,x2,x3,x4); 
  $%  025:刷新历史1-刷新次数              $%    $%  ANS018.BYTE022  $%  y=(x)*1; 
  $%  026:刷新历史2-零件号                $%    $%  ANS018.BYTE023  $%  HEX(x1,x2,x3,x4); 
  $%  027:刷新历史2-标定验证号CVN         $%    $%  ANS018.BYTE027  $%  HEX(x1,x2,x3,x4); 
  $%  028:刷新历史2-刷新次数              $%    $%  ANS018.BYTE031  $%  y=(x)*1; 
  $%  029:刷新历史3-零件号                $%    $%  ANS018.BYTE032  $%  HEX(x1,x2,x3,x4); 
  $%  030:刷新历史3-标定验证号CVN         $%    $%  ANS018.BYTE036  $%  HEX(x1,x2,x3,x4); 
  $%  031:刷新历史3-刷新次数              $%    $%  ANS018.BYTE040  $%  y=(x)*1; 
  $%  032:刷新历史4-零件号                $%    $%  ANS018.BYTE041  $%  HEX(x1,x2,x3,x4); 
  $%  033:刷新历史4–标定验证号CVN        $%    $%  ANS018.BYTE045  $%  HEX(x1,x2,x3,x4); 
  $%  034:刷新历史4-刷新次数              $%    $%  ANS018.BYTE049  $%  y=(x)*1; 
  $%  035:刷新历史5-零件号                $%    $%  ANS018.BYTE050  $%  HEX(x1,x2,x3,x4); 
  $%  036:刷新历史5-标定验证号CVN         $%    $%  ANS018.BYTE054  $%  HEX(x1,x2,x3,x4); 
  $%  037:刷新历史5-刷新次数              $%    $%  ANS018.BYTE058  $%  y=(x)*1; 
  $%  038:刷新历史6-零件号                $%    $%  ANS018.BYTE059  $%  HEX(x1,x2,x3,x4); 
  $%  039:刷新历史6-标定验证号CVN         $%    $%  ANS018.BYTE063  $%  HEX(x1,x2,x3,x4); 
  $%  040:刷新历史6-刷新次数              $%    $%  ANS018.BYTE067  $%  y=(x)*1; 
  $%  041:刷新历史7-零件号                $%    $%  ANS018.BYTE068  $%  HEX(x1,x2,x3,x4); 
  $%  042:刷新历史7-标定验证号CVN         $%    $%  ANS018.BYTE072  $%  HEX(x1,x2,x3,x4); 
  $%  043:刷新历史7-刷新次数              $%    $%  ANS018.BYTE076  $%  y=(x)*1; 
  $%  044:刷新历史8-零件号                $%    $%  ANS018.BYTE077  $%  HEX(x1,x2,x3,x4); 
  $%  045:刷新历史8-标定验证号CVN         $%    $%  ANS018.BYTE081  $%  HEX(x1,x2,x3,x4); 
  $%  046:刷新历史8-刷新次数              $%    $%  ANS018.BYTE085  $%  y=(x)*1; 
  $%  047:刷新历史9-零件号                $%    $%  ANS018.BYTE086  $%  HEX(x1,x2,x3,x4); 
  $%  048:刷新历史9-标定验证号CVN         $%    $%  ANS018.BYTE090  $%  HEX(x1,x2,x3,x4); 
  $%  049:刷新历史9-刷新次数              $%    $%  ANS018.BYTE094  $%  y=(x)*1; 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E1 03 22 28 10 00 00 00 00            $  
  $  REQ001:7E1 03 22 28 62 00 00 00 00            $  
  $  REQ002:7E1 03 22 AA 4A 00 00 00 00            $  
  $  REQ003:7E1 03 22 AA 4B 00 00 00 00            $  
  $  REQ004:7E1 03 22 AA 4C 00 00 00 00            $  
  $  REQ005:7E1 03 22 AA 4D 00 00 00 00            $  
  $  REQ006:7E1 03 22 AA 4E 00 00 00 00            $  
  $  REQ007:7E1 03 22 00 42 00 00 00 00            $  
  $  REQ008:7E1 03 22 1A 2D 00 00 00 00            $  
  $  REQ009:7E1 03 22 00 0C 00 00 00 00            $  
  $  REQ010:7E1 03 22 28 17 00 00 00 00            $  
  $  REQ011:7E1 03 22 28 11 00 00 00 00            $  
  $  REQ012:7E1 03 22 28 18 00 00 00 00            $  
  $  REQ013:7E1 03 22 28 12 00 00 00 00            $  
  $  REQ014:7E1 03 22 28 19 00 00 00 00            $  
  $  REQ015:7E1 03 22 28 13 00 00 00 00            $  
  $  REQ016:7E1 03 22 28 1A 00 00 00 00            $  
  $  REQ017:7E1 03 22 28 14 00 00 00 00            $  
  $  REQ018:7E1 03 22 28 1B 00 00 00 00            $  
  $  REQ019:7E1 03 22 28 15 00 00 00 00            $  
  $  REQ020:7E1 03 22 11 41 00 00 00 00            $  
  $  REQ021:7E1 03 22 28 04 00 00 00 00            $  
  $  REQ022:7E1 03 22 28 1E 00 00 00 00            $  
  $  REQ023:7E1 03 22 28 1C 00 00 00 00            $  
  $  REQ024:7E1 03 22 28 16 00 00 00 00            $  
  $  REQ025:7E1 03 22 19 91 00 00 00 00            $  
  $  REQ026:7E1 03 22 28 0C 00 00 00 00            $  
  $  REQ027:7E1 03 22 AA 49 00 00 00 00            $  
  $  REQ028:7E1 03 22 19 93 00 00 00 00            $  
  $  REQ029:7E1 03 22 19 94 00 00 00 00            $  
  $  REQ030:7E1 03 22 19 95 00 00 00 00            $  
  $  REQ031:7E1 03 22 19 4C 00 00 00 00            $  
  $  REQ032:7E1 03 22 28 0A 00 00 00 00            $  
  $  REQ033:7E1 03 22 28 0F 00 00 00 00            $  
  $  REQ034:7E1 03 22 28 24 00 00 00 00            $  
  $  REQ035:7E1 03 22 19 9A 00 00 00 00            $  
  $  REQ036:7E1 03 22 28 26 00 00 00 00            $  
  $  REQ037:7E1 03 22 28 0D 00 00 00 00            $  
  $  REQ038:7E1 03 22 28 1D 00 00 00 00            $  
  $  REQ039:7E1 03 22 19 A1 00 00 00 00            $  
  $  REQ040:7E1 03 22 19 41 00 00 00 00            $  
  $  REQ041:7E1 03 22 AA 5F 00 00 00 00            $  
  $  REQ042:7E1 03 22 19 40 00 00 00 00            $  
  $  REQ043:7E1 03 22 19 42 00 00 00 00            $  
  $  REQ044:7E1 03 22 19 4F 00 00 00 00            $  
  $  REQ045:7E1 03 22 19 51 00 00 00 00            $  
  $  REQ046:7E1 03 22 AA 50 00 00 00 00            $  
  $  REQ047:7E1 03 22 19 7E 00 00 00 00            $  
  $  REQ048:7E1 03 22 19 92 00 00 00 00            $  
  $  REQ049:7E1 03 22 00 0D 00 00 00 00            $  

  $  000.油门踏板位置                                 $    $  百分比      $    $  ANS000.BYTE003  $  y=(x)*0.390625; 
  $  001.变速器主油路压力计算值                       $    $  千帕        $    $  ANS001.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  002.快速学习离合器1充填完成                      $    $              $    $  ANS002.BYTE017  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  003.快速学习离合器1完全冲压充填完成              $    $              $    $  ANS002.BYTE017  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  004.快速学习离合器1压力偏差计算完成              $    $              $    $  ANS002.BYTE017  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  005.快速学习离合器2充填完成                      $    $              $    $  ANS003.BYTE017  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  006.快速学习离合器2完全冲压充填完成              $    $              $    $  ANS003.BYTE017  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  007.快速学习离合器2压力偏差计算完成              $    $              $    $  ANS003.BYTE017  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  008.快速学习离合器3充填完成                      $    $              $    $  ANS004.BYTE017  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  009.快速学习离合器3完全冲压充填完成              $    $              $    $  ANS004.BYTE017  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  010.快速学习离合器3压力偏差计算完成              $    $              $    $  ANS004.BYTE017  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  011.快速学习离合器4充填完成                      $    $              $    $  ANS005.BYTE017  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  012.快速学习离合器4完全冲压充填完成              $    $              $    $  ANS005.BYTE017  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  013.快速学习离合器4压力偏差计算完成              $    $              $    $  ANS005.BYTE017  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  014.快速学习离合器5充填完成                      $    $              $    $  ANS006.BYTE017  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  015.快速学习离合器5完全冲压充填完成              $    $              $    $  ANS006.BYTE017  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  016.快速学习离合器5压力偏差计算完成              $    $              $    $  ANS006.BYTE017  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  017.系统电压                                     $    $  伏          $    $  ANS007.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  018.发动机实际过程静态扭矩                       $    $  牛米        $    $  ANS008.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.25;elsey=(x1*256+x2-0xFFFF)*0.25; 
  $  019.发动机转速                                   $    $  转/分       $    $  ANS009.BYTE003  $  y=(x1*256+x2)*0.25+1; 
  $  020.压力控制电磁阀指令压力-PCS1                  $    $  千帕        $    $  ANS010.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  021.压力控制电磁阀测试状态-PCS1-合理性测试       $    $              $    $  ANS011.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  022.压力控制电磁阀测试状态-PCS1-高电压测试       $    $              $    $  ANS011.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  023.压力控制电磁阀测试状态-PCS1-低电压测试       $    $              $    $  ANS011.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  024.压力控制电磁阀指令压力-PCS2                  $    $  千帕        $    $  ANS012.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  025.压力控制电磁阀测试状态-PCS2-合理性测试       $    $              $    $  ANS013.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  026.压力控制电磁阀测试状态-PCS2-高电压测试       $    $              $    $  ANS013.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  027.压力控制电磁阀测试状态-PCS2-低电压测试       $    $              $    $  ANS013.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  028.压力控制电磁阀指令压力-PCS3                  $    $  千帕        $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  029.压力控制电磁阀测试状态-PCS3-合理性测试       $    $              $    $  ANS015.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  030.压力控制电磁阀测试状态-PCS3-高电压测试       $    $              $    $  ANS015.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  031.压力控制电磁阀测试状态-PCS3-低电压测试       $    $              $    $  ANS015.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  032.压力控制电磁阀指令压力-PCS4                  $    $  千帕        $    $  ANS016.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  033.压力控制电磁阀测试状态-PCS4-合理性测试       $    $              $    $  ANS017.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  034.压力控制电磁阀测试状态-PCS4-高电压测试       $    $              $    $  ANS017.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  035.压力控制电磁阀测试状态-PCS4-低电压测试       $    $              $    $  ANS017.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  036.压力控制电磁阀指令压力-PCS5                  $    $  千帕        $    $  ANS018.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  037.压力控制电磁阀测试状态-PCS5-合理性测试       $    $              $    $  ANS019.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  038.压力控制电磁阀测试状态-PCS5-高电压测试       $    $              $    $  ANS019.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  039.压力控制电磁阀测试状态-PCS5-低电压测试       $    $              $    $  ANS019.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  040.KL15点火开关电路电压                         $    $  伏          $    $  ANS020.BYTE003  $  y=(x)*0.1; 
  $  041.电磁阀供电电路高压驱动1打开                  $    $              $    $  ANS021.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  042.电磁阀供电测试状态-HSD1-开路测试             $    $              $    $  ANS021.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  043.电磁阀供电测试状态-HSD1-对地短路测试         $    $              $    $  ANS021.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  044.电磁阀供电测试状态-HSD1-对电源短路测试       $    $              $    $  ANS021.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  045.换挡电磁阀1指令打开                          $    $              $    $  ANS022.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  046.换挡电磁阀测试状态-S1-开路测试               $    $              $    $  ANS022.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  047.换挡电磁阀测试状态-S1-对地短路测试           $    $              $    $  ANS022.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  048.换挡电磁阀测试状态-S1-对电源短路测试         $    $              $    $  ANS022.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  049.压力控制电磁阀指令压力-TCC                   $    $  千帕        $    $  ANS023.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  050.压力控制电磁阀测试状态-TCC-合理性测试        $    $              $    $  ANS024.BYTE003  $  switxh(x&0x03)0x00:@008d;0x01:@01b1;0x03:@0cb9; 
  $  051.压力控制电磁阀测试状态-TCC-高电压测试        $    $              $    $  ANS024.BYTE003  $  switxh(x&0x0C)0x00:@008d;0x04:@01b1;0x0C:@0cb9; 
  $  052.压力控制电磁阀测试状态-TCC-低电压测试        $    $              $    $  ANS024.BYTE003  $  switxh(x&0x30)0x00:@008d;0x10:@01b1;0x30:@0cb9; 
  $  053.变矩器离合器滑磨量                           $    $  转/分钟     $    $  ANS025.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.125;elsey=(x1*256+x2-0xFFFF)*0.125; 
  $  054.变矩器离合器控制电磁阀指令打开               $    $              $    $  ANS026.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  055.变速器下线编程完成                           $    $              $    $  ANS027.BYTE007  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  056.变速箱升挡时间-1至2                          $    $  秒          $    $  ANS028.BYTE003  $  y=(x)*0.025; 
  $  057.变速箱升挡时间-2至3                          $    $  秒          $    $  ANS029.BYTE003  $  y=(x)*0.025; 
  $  058.变速箱升挡时间-3至4                          $    $  秒          $    $  ANS030.BYTE003  $  y=(x)*0.025; 
  $  059.变速箱升挡时间-4至5                          $    $  秒          $    $  ANS031.BYTE003  $  y=(x)*0.025; 
  $  060.变速箱升挡时间-5至6                          $    $  秒          $    $  ANS032.BYTE003  $  y=(x)*0.025; 
  $  061.变速器基础模式                               $    $              $    $  ANS033.BYTE003  $  switxh(x)0x00:@0cfa;0x01:@0cfb;0x02:@0cfc;0x03:@0cfd;0x04:@052f;0x05:@0cfe;0x06:@0cff;0x07:@0d00;0x08:@0d01;0x09:@0d02;0x0A:@0d03;0x0B:@027d;0x0C:@0d04;0x0D:@0d05;0x0E:@0cfb;0x0F:@0d06; 
  $  062.变速器清洁程序完成                           $    $              $    $  ANS034.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  063.变速器目标挡位                               $    $              $    $  ANS035.BYTE003  $  switxh(x)0x00:@007c;0x01:@0010;0x02:@0011;0x02:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x07:@0069;0x08:@04fa;0x41:@0d25;0x42:@0d26;0x43:@0d27;0x44:@0d28; 
  $  064.电控单元启动温度                             $    $  摄氏度      $    $  ANS036.BYTE003  $  y=(x)*1-40; 
  $  065.ECU温度                                      $    $  摄氏度      $    $  ANS037.BYTE003  $  y=(x)*1-40; 
  $  066.变速器油压开关1                              $    $              $    $  ANS038.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  067.变速器油压开关2                              $    $              $    $  ANS038.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  068.变速器油压开关3                              $    $              $    $  ANS038.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  069.变速器油压开关4                              $    $              $    $  ANS038.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  070.齿速比                                       $    $              $    $  ANS039.BYTE003  $  y=(x)*0.015625; 
  $  071.供电层输入轴转速                             $    $  转/分钟     $    $  ANS040.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  072.变速器油液剩余可使用时间                     $    $  百分比      $    $  ANS041.BYTE003  $  y=(x)*0.390625; 
  $  073.变速箱油液温度                               $    $  摄氏度      $    $  ANS042.BYTE003  $  y=(x)*1-40; 
  $  074.变速器输出速度                               $    $  转/分钟     $    $  ANS043.BYTE003  $  y=(x1*256+x2)*0.125; 
  $  075.内部模式开关挡位信息                         $    $              $    $  ANS044.BYTE003  $  switxh(x)0x00:@0027;0x01:@0939;0x02:@0912;0x04:@007c;0x06:@0015;0x08:@0014;0x10:@0013;0x20:@0012;0x40:@0011;0x80:@0010; 
  $  076.内部模式开关A                                $    $              $    $  ANS045.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  077.内部模式开关B                                $    $              $    $  ANS045.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  078.内部模式开关C                                $    $              $    $  ANS045.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  079.内部模式开关信号无效                         $    $              $    $  ANS045.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  080.内部模式开关P                                $    $              $    $  ANS045.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  081.稳态压力自适应值-5挡-变矩器离合器关          $    $  千帕        $    $  ANS046.BYTE012  $  y=(x)*2; 
  $  082.稳态压力自适应值-5挡-变矩器离合器开          $    $  千帕        $    $  ANS046.BYTE013  $  y=(x)*2; 
  $  083.稳态压力自适应值-1挡-变矩器离合器关          $    $  千帕        $    $  ANS046.BYTE004  $  y=(x)*2; 
  $  084.稳态压力自适应值-1挡-变矩器离合器开          $    $  千帕        $    $  ANS046.BYTE005  $  y=(x)*2; 
  $  085.稳态压力自适应值-4挡-变矩器离合器关          $    $  千帕        $    $  ANS046.BYTE010  $  y=(x)*2; 
  $  086.稳态压力自适应值-4挡-变矩器离合器开          $    $  千帕        $    $  ANS046.BYTE011  $  y=(x)*2; 
  $  087.稳态压力自适应值-倒档                        $    $  千帕        $    $  ANS046.BYTE003  $  y=(x)*2; 
  $  088.稳态压力自适应值-2挡-变矩器离合器关          $    $  千帕        $    $  ANS046.BYTE006  $  y=(x)*2; 
  $  089.稳态压力自适应值-2挡-变矩器离合器开          $    $  千帕        $    $  ANS046.BYTE007  $  y=(x)*2; 
  $  090.稳态压力自适应值-6挡-变矩器离合器关          $    $  千帕        $    $  ANS046.BYTE014  $  y=(x)*2; 
  $  091.稳态压力自适应值-6挡-变矩器离合器开          $    $  千帕        $    $  ANS046.BYTE015  $  y=(x)*2; 
  $  092.稳态压力自适应值-3挡-变矩器离合器关          $    $  千帕        $    $  ANS046.BYTE008  $  y=(x)*2; 
  $  093.稳态压力自适应值-3挡-变矩器离合器开          $    $  千帕        $    $  ANS046.BYTE009  $  y=(x)*2; 
  $  094.变速器手动换挡模式开关激活                   $    $              $    $  ANS047.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  095.变速器降挡开关激活                           $    $              $    $  ANS047.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  096.变速器手动换挡模式开关失效                   $    $              $    $  ANS047.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  097.变速器升挡开关激活                           $    $              $    $  ANS047.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  098.变速箱升挡时间                               $    $  秒          $    $  ANS048.BYTE003  $  y=(x)*0.025; 
  $  099.车速                                         $    $  千米/时     $    $  ANS049.BYTE003  $  y=(x)*1+1; 

;******************************************************************************************************************************************************

