
     系统名称:TCM (波箱控制模块)

     系统ID:00004386

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 03 00 00 00 00 00       $~ ANS000:7E9 02 10 03 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E9,718,748

进入命令:

  $~ REQ000:7E1 02 10 01 00 00 00 00 00       $~ ANS000:7E9 02 10 01 00 00 00 00 00
  $~ REQ001:7E1 03 22 F1 91 00 00 00 00       $~ ANS001:7E9 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E1 02 3E 00 00 00 00 00 00       $! ANS000:7E9 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10150994&quot;: &quot;00004386&quot;, &quot;24288779&quot;: &quot;00004387&quot;, &quot;24297178&quot;: &quot;00004387&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10150994&quot;: &quot;00004386&quot;, &quot;24288779&quot;: &quot;00004387&quot;, &quot;24297178&quot;: &quot;00004387&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E1 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/00004386

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E1 03 22 F1 87 00 00 00 00            $%  
  $%  REQ002:7E1 03 22 F1 91 00 00 00 00            $%  
  $%  REQ003:7E1 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ004:7E1 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ005:7E1 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ006:7E1 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ007:7E1 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ008:7E1 03 22 F1 AA 00 00 00 00            $%  
  $%  REQ009:7E1 03 22 F1 10 00 00 00 00            $%  
  $%  REQ010:7E1 03 22 B4 E6 00 00 00 00            $%  
  $%  REQ011:7E1 03 22 B4 19 00 00 00 00            $%  
  $%  REQ012:7E1 03 22 B4 23 00 00 00 00            $%  

  $%  000:车辆识别代码(VIN)             $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:电控单元零件号                $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  002:电控单元硬件号                $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元应用软件号            $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元标定软件号            $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元制造日期              $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3); 
  $%  006:电控单元索引信息              $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:电控单元序列号                $%    $%  ANS007.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  008:电控单元刷新过程文件号        $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  009:刷新工具参考号记录            $%    $%  ANS009.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  010:刷新里程数记录                $%    $%  ANS009.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 
  $%  011:变速器SubROM版本号            $%    $%  ANS010.BYTE003  $%  y=(x1*16777216+x2*65536+x3*256+x4)*1; 
  $%  012:变速箱部件标编号              $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8); 
  $%  013:变速箱下线时间                $%    $%  ANS012.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E1 03 22 B4 DB 00 00 00 00            $  
  $  REQ001:7E1 03 22 B4 DC 00 00 00 00            $  
  $  REQ002:7E1 03 22 B4 DD 00 00 00 00            $  
  $  REQ003:7E1 03 22 B4 DE 00 00 00 00            $  
  $  REQ004:7E1 03 22 B4 CC 00 00 00 00            $  
  $  REQ005:7E1 03 22 B4 01 00 00 00 00            $  
  $  REQ006:7E1 03 22 B4 9E 00 00 00 00            $  
  $  REQ007:7E1 03 22 B4 9D 00 00 00 00            $  
  $  REQ008:7E1 03 22 B4 DA 00 00 00 00            $  
  $  REQ009:7E1 03 22 B4 D1 00 00 00 00            $  
  $  REQ010:7E1 03 22 B4 85 00 00 00 00            $  
  $  REQ011:7E1 03 22 B4 8C 00 00 00 00            $  
  $  REQ012:7E1 03 22 E4 00 00 00 00 00            $  
  $  REQ013:7E1 03 22 E4 01 00 00 00 00            $  
  $  REQ014:7E1 03 22 E4 03 00 00 00 00            $  
  $  REQ015:7E1 03 22 E4 02 00 00 00 00            $  
  $  REQ016:7E1 03 22 B4 00 00 00 00 00            $  
  $  REQ017:7E1 03 22 B4 D4 00 00 00 00            $  
  $  REQ018:7E1 03 22 B4 C9 00 00 00 00            $  
  $  REQ019:7E1 03 22 B4 9A 00 00 00 00            $  
  $  REQ020:7E1 03 22 B4 92 00 00 00 00            $  
  $  REQ021:7E1 03 22 B4 98 00 00 00 00            $  
  $  REQ022:7E1 03 22 B4 8F 00 00 00 00            $  
  $  REQ023:7E1 03 22 B4 95 00 00 00 00            $  
  $  REQ024:7E1 03 22 B4 D3 00 00 00 00            $  
  $  REQ025:7E1 03 22 E4 07 00 00 00 00            $  
  $  REQ026:7E1 03 22 E4 06 00 00 00 00            $  
  $  REQ027:7E1 03 22 B4 7D 00 00 00 00            $  
  $  REQ028:7E1 03 22 B4 7F 00 00 00 00            $  
  $  REQ029:7E1 03 22 B4 81 00 00 00 00            $  
  $  REQ030:7E1 03 22 B4 83 00 00 00 00            $  
  $  REQ031:7E1 03 22 B4 88 00 00 00 00            $  
  $  REQ032:7E1 03 22 B4 DF 00 00 00 00            $  
  $  REQ033:7E1 03 22 B4 E0 00 00 00 00            $  
  $  REQ034:7E1 03 22 B4 E1 00 00 00 00            $  
  $  REQ035:7E1 03 22 E4 05 00 00 00 00            $  
  $  REQ036:7E1 03 22 E4 04 00 00 00 00            $  
  $  REQ037:7E1 03 22 B4 26 00 00 00 00            $  
  $  REQ038:7E1 03 22 B4 08 00 00 00 00            $  
  $  REQ039:7E1 03 22 B4 09 00 00 00 00            $  
  $  REQ040:7E1 03 22 B4 7C 00 00 00 00            $  
  $  REQ041:7E1 03 22 B4 7B 00 00 00 00            $  
  $  REQ042:7E1 03 22 B4 25 00 00 00 00            $  
  $  REQ043:7E1 03 22 B4 89 00 00 00 00            $  
  $  REQ044:7E1 03 22 B4 A0 00 00 00 00            $  
  $  REQ045:7E1 03 22 B4 A1 00 00 00 00            $  

  $  000.5伏传感器供电1电压               $    $  伏          $    $  ANS000.BYTE003  $  y=(x)*0.25; 
  $  001.5伏传感器供电2电压               $    $  伏          $    $  ANS001.BYTE003  $  y=(x)*0.25; 
  $  002.9伏传感器供电1电压               $    $  伏          $    $  ANS002.BYTE003  $  y=(x)*0.25; 
  $  003.9伏传感器供电2电压               $    $  伏          $    $  ANS003.BYTE003  $  y=(x)*0.25; 
  $  004.油门踏板位置                     $    $  百分比      $    $  ANS004.BYTE003  $  y=(x)*0.392156862745098; 
  $  005.空调压缩机离合器状态             $    $              $    $  ANS005.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  006.偶数挡离合器压力                 $    $  伏          $    $  ANS006.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  007.奇数挡离合器压力                 $    $  巴          $    $  ANS007.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  008.蓄电池电压                       $    $  伏          $    $  ANS008.BYTE003  $  y=(x)*0.25; 
  $  009.制动踏板制动压力                 $    $  千帕        $    $  ANS009.BYTE003  $  y=(x)*75; 
  $  010.离合器分离请求                   $    $              $    $  ANS005.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  011.离合器油液温度                   $    $  摄氏度      $    $  ANS010.BYTE003  $  y=(x)*1-40; 
  $  012.发动机转速                       $    $  转/分       $    $  ANS011.BYTE003  $  y=(x1*256+x2)*1; 
  $  013.巡航控制 激活                    $    $              $    $  ANS005.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  014.换档电磁阀1电流                  $    $  安培        $    $  ANS012.BYTE003  $  y=(x1*256+x2)*0.0001; 
  $  015.换档电磁阀2电流                  $    $  安培        $    $  ANS013.BYTE003  $  y=(x1*256+x2)*0.0001; 
  $  016.润滑油路压力电磁阀电流           $    $  安培        $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.0001; 
  $  017.主油路压力电磁阀电流             $    $  安培        $    $  ANS015.BYTE003  $  y=(x1*256+x2)*0.0001; 
  $  018.手动降挡模式激活                 $    $              $    $  ANS016.BYTE003  $  switxh(x&0x10)0x00:@002e;0x10:@0037; 
  $  019.发动机起停状态                   $    $              $    $  ANS017.BYTE003  $  switxh(x&0x03)0x00:@0093;0x01:@0094;0x02:@0095;0x03:@0096; 
  $  020.发动机暖机状态                   $    $              $    $  ANS005.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  021.发动机运行状态网络信号           $    $              $    $  ANS005.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  022.发动机转速                       $    $  转/分       $    $  ANS018.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  023.偶数挡离合器压力                 $    $  巴          $    $  ANS019.BYTE003  $  y=(x)*0.125; 
  $  024.偶数挡输入轴转速                 $    $  转/分       $    $  ANS020.BYTE003  $  y=(x1*256+x2)*1; 
  $  025.奇数挡离合器压力                 $    $  巴          $    $  ANS021.BYTE003  $  y=(x)*0.125; 
  $  026.奇数挡输入轴转速                 $    $  转/分       $    $  ANS022.BYTE003  $  y=(x1*256+x2)*1; 
  $  027.输出轴转速                       $    $  转/分       $    $  ANS023.BYTE003  $  y=(x1*256+x2)*1; 
  $  028.环境温度                         $    $  摄氏度      $    $  ANS024.BYTE003  $  y=(x)*0.5-40; 
  $  029.多路电磁阀2请求                  $    $              $    $  ANS025.BYTE003  $  switxh(x)0x00:@002e;0x01:@0037; 
  $  030.多路电磁阀1请求                  $    $              $    $  ANS026.BYTE003  $  switxh(x)0x00:@002e;0x01:@0037; 
  $  031.换挡拨叉（1/3挡）位置            $    $  百分比      $    $  ANS027.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  032.换挡拨叉（2/4挡）位置            $    $  百分比      $    $  ANS028.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  033.换挡拨叉（5/N挡）位置            $    $  百分比      $    $  ANS029.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  034.换挡拨叉（6/R挡）位置            $    $  百分比      $    $  ANS030.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  035.电磁阀油液温度                   $    $  摄氏度      $    $  ANS031.BYTE003  $  y=(x)*1-40; 
  $  036.电磁阀供电1电压                  $    $  伏          $    $  ANS032.BYTE003  $  y=(x)*0.25; 
  $  037.电磁阀供电2电压                  $    $  伏          $    $  ANS033.BYTE003  $  y=(x)*0.25; 
  $  038.电磁阀供电3电压                  $    $  伏          $    $  ANS034.BYTE003  $  y=(x)*0.25; 
  $  039.偶数挡离合器控制电磁阀电流       $    $  安培        $    $  ANS035.BYTE003  $  y=(x1*256+x2)*0.0001; 
  $  040.奇数挡离合器控制电磁阀电流       $    $  安培        $    $  ANS036.BYTE003  $  y=(x1*256+x2)*0.0001; 
  $  041.换档杆位置                       $    $              $    $  ANS037.BYTE003  $  switxh(x)0x05:@0935;0x03:@0532;0x06:@007c;0x08:@0939;0x07:@0912;0x0A:@09c9;0x09:@09c8;0x00:@01b6;0x01:@020b;0x02:@020c; 
  $  042.期望分离挡位                     $    $              $    $  ANS038.BYTE003  $  switxh(x&0x0F)0x01:@0010;0x02:@0011;0x03:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x00:@01b1;0x08:@0912;0x07:@0912; 
  $  043.期望啮合挡位                     $    $              $    $  ANS039.BYTE003  $  switxh(x&0x0F)0x01:@0010;0x02:@0011;0x03:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x00:@01b1;0x08:@0912;0x07:@0912; 
  $  044.变速箱偶数挡同步档位             $    $              $    $  ANS040.BYTE003  $  switxh(x&0x0F)0x01:@0010;0x02:@0011;0x03:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x00:@007c;0x07:@0912;0x08:@0912; 
  $  045.变速箱奇数挡同步档位             $    $              $    $  ANS041.BYTE003  $  switxh(x&0x0F)0x01:@0010;0x02:@0011;0x03:@0012;0x04:@0013;0x05:@0014;0x06:@0015;0x00:@007c;0x07:@0912;0x08:@0912; 
  $  046.牵引控制激活                     $    $              $    $  ANS005.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  047.牵引控制启用                     $    $              $    $  ANS005.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  048.输入轴转速                       $    $  转/分       $    $  ANS042.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  049.手动加挡模式激活                 $    $              $    $  ANS016.BYTE003  $  switxh(x&0x20)0x00:@002e;0x20:@0037; 
  $  050.阀体温度                         $    $  摄氏度      $    $  ANS043.BYTE003  $  y=(x)*1-40; 
  $  051.车速                             $    $  千米/时     $    $  ANS044.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.01;elsey=(x1*256+x2-0xFFFF)*0.01; 
  $  052.车辆坡度                         $    $  百分比      $    $  ANS045.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 

;******************************************************************************************************************************************************

