
    车型ID：9d01

    模拟：协议模拟-->9d01

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7CF

进入命令:

  $~  REQ000:78F 02 10 01 00 00 00 00 00       $~  ANS000:7CF 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:78F 02 3E 00 00 00 00 00 00       $!  ANS000:7CF 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:78F 03 19 02 2B 00 00 00 00       $#  ANS000:7CF 03 19 02 2B 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/01000000


  $#  01.读冻结帧
  $#  REQ000:78F 03 19 02 2B 00 00 00 00       $#  ANS000:7CF 03 19 02 2B 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/01000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:78F 04 14 FF FF FF 00 00 00       $$  ANS000:7CF 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:78F 03 22 F0 20 00 00 00 00       $%  ANS000:7CF 03 22 F0 20 00 00 00 00
  $%  REQ001:78F 03 22 F0 21 00 00 00 00       $%  ANS001:7CF 03 22 F0 21 00 00 00 00
  $%  REQ002:78F 03 22 F1 8A 00 00 00 00       $%  ANS002:7CF 03 22 F1 8A 00 00 00 00
  $%  REQ003:78F 03 22 F1 8C 00 00 00 00       $%  ANS003:7CF 03 22 F1 8C 00 00 00 00
  $%  REQ004:78F 03 22 F1 90 00 00 00 00       $%  ANS004:7CF 03 22 F1 90 00 00 00 00
  $%  REQ005:78F 03 22 F1 8B 00 00 00 00       $%  ANS005:7CF 03 22 F1 8B 00 00 00 00
  $%  REQ006:78F 03 22 F1 93 00 00 00 00       $%  ANS006:7CF 03 22 F1 93 00 00 00 00
  $%  REQ007:78F 03 22 F1 95 00 00 00 00       $%  ANS007:7CF 03 22 F1 95 00 00 00 00
  $%  REQ008:78F 03 22 F1 83 00 00 00 00       $%  ANS008:7CF 03 22 F1 83 00 00 00 00
  $%  REQ009:78F 03 22 F1 A1 00 00 00 00       $%  ANS009:7CF 03 22 F1 A1 00 00 00 00
  $%  REQ010:78F 03 22 F1 87 00 00 00 00       $%  ANS010:7CF 03 22 F1 87 00 00 00 00
  $%  REQ011:78F 03 22 F1 84 00 00 00 00       $%  ANS011:7CF 03 22 F1 84 00 00 00 00

  $%  000:Matrix表版本信息:                    $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  001:诊断信息表版本信息:                  $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  002:ECU(电控单元)供应商ID:               $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:ECU(电控单元)串码:                   $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  004:车辆识别码(VIN码):                   $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  005:ECU(电控单元)生产日期:               $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02x%02x骞%02x鏈%02x鏃,x1,x2,x3,x4);
  $%  006:ECU(电控单元)硬件版本号:             $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $%  007:ECU(电控单元)应用软件版本号:         $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  008:ECU(电控单元) 底层软件版本号:        $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  009:车型配置:                            $%    $%  ANS009.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  010:ECU(电控单元) 零件号:                $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  011:诊断仪指纹_日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02x骞%02x鏈%02x鏃,x1,x2,x3);
  $%  012:诊断仪指纹_设备:                     $%    $%  ANS011.BYTE007  $%  ASCII(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:78F 03 22 20 60 00 00 00 00       $  ANS000:7CF 03 22 20 60 00 00 00 00
  $  REQ001:78F 03 22 20 70 00 00 00 00       $  ANS001:7CF 03 22 20 70 00 00 00 00
  $  REQ002:78F 03 22 20 10 00 00 00 00       $  ANS002:7CF 03 22 20 10 00 00 00 00
  $  REQ003:78F 03 22 20 20 00 00 00 00       $  ANS003:7CF 03 22 20 20 00 00 00 00
  $  REQ004:78F 03 22 20 30 00 00 00 00       $  ANS004:7CF 03 22 20 30 00 00 00 00
  $  REQ005:78F 03 22 20 40 00 00 00 00       $  ANS005:7CF 03 22 20 40 00 00 00 00
  $  REQ006:78F 03 22 20 36 00 00 00 00       $  ANS006:7CF 03 22 20 36 00 00 00 00
  $  REQ007:78F 03 22 20 32 00 00 00 00       $  ANS007:7CF 03 22 20 32 00 00 00 00
  $  REQ008:78F 03 22 20 F0 00 00 00 00       $  ANS008:7CF 03 22 20 F0 00 00 00 00

  $  000.ACU(安全气囊控制单元)维修日期                                      $    $          $    $  ANS000.BYTE004  $  y=SPRINTF([%02x%02x骞%02x鏈%02x鏃,x1,x2,x3,x4);
  $  001.ACU(安全气囊控制单元)锁定状态                                      $    $          $    $  ANS001.BYTE004  $  HEX(x1);
  $  002.ACU(安全气囊控制单元)配置参数版本号                                $    $          $    $  ANS002.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $  003.ACU(安全气囊控制单元)运行时长                                      $    $  s       $    $  ANS003.BYTE004  $  HEX(x1,x2,x3,x4);
  $  004.ACU(安全气囊控制单元)点火储能电压值                                $    $  V       $    $  ANS004.BYTE004  $  y=x/5.987;
  $  005.ACU(安全气囊控制单元)点火回路电阻值-驾驶员气囊电阻值               $    $  Ohm     $    $  ANS005.BYTE004  $  y=x/20.00;
  $  006.ACU(安全气囊控制单元)点火回路电阻值-副驾驶员气囊电阻值             $    $  Ohm     $    $  ANS005.BYTE005  $  y=x/20.00;
  $  007.ACU(安全气囊控制单元)点火回路电阻值-驾驶员安全带预紧电阻值         $    $  Ohm     $    $  ANS005.BYTE006  $  y=x/20.00;
  $  008.ACU(安全气囊控制单元)点火回路电阻值-副驾驶员安全带预紧电阻值       $    $  Ohm     $    $  ANS005.BYTE007  $  y=x/20.00;
  $  009.ACU(安全气囊控制单元)点火回路电阻值-驾驶员侧气囊电阻值             $    $  Ohm     $    $  ANS005.BYTE008  $  y=x/20.00;
  $  010.ACU(安全气囊控制单元)点火回路电阻值-副驾驶员侧气囊电阻值           $    $  Ohm     $    $  ANS005.BYTE009  $  y=x/20.00;
  $  011.ACU(安全气囊控制单元)点火回路电阻值-驾驶员侧气帘电阻值             $    $  Ohm     $    $  ANS005.BYTE010  $  y=x/20.00;
  $  012.ACU(安全气囊控制单元)点火回路电阻值-副驾驶员侧气帘电阻值           $    $  Ohm     $    $  ANS005.BYTE011  $  y=x/20.00;
  $  013.ACU(安全气囊控制单元)故障指示灯状态                                $    $          $    $  ANS006.BYTE004  $  if(x==0x00) y=@0011;else if(x==0x01) y=@0012;else y=@0004;
  $  014.ACU(安全气囊控制单元)电源电压                                      $    $  V       $    $  ANS007.BYTE004  $  y=x/9.09;
  $  015.ACU(安全气囊控制单元)配置信息                                      $    $          $    $  ANS008.BYTE004  $  HEX(x1,x2,x3,x4,X5,X6);

;******************************************************************************************************************************************************

动作测试:

$^00:ACU(安全气囊控制单元)状态指示灯控制
$^TYPE:0
$^BUTTON:打开
$^:78F 05 2F FA 20 03 01 00 00     $^

$^BUTTON:关闭
$^:78F 05 2F FA 20 03 00 00 00     $^

$^BUTTON:退出
$^:78F 04 2F FA 20 00 00 00 00     $^

$^01:ACU(安全气囊控制单元)碰撞输出信号控制
$^TYPE:0
$^BUTTON:打开
$^:78F 05 2F FA 30 03 01 00 00     $^

$^BUTTON:关闭
$^:78F 05 2F FA 30 03 00 00 00     $^

$^BUTTON:退出
$^:78F 04 2F FA 30 00 00 00 00     $^

30帧:

  $FC REQ000:78F 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
