
    车型ID：9d02

    模拟：协议模拟-->9d02

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7D8

进入命令:

  $~  REQ000:7D0 02 10 01 00 00 00 00 00       $~  ANS000:7D8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7D0 02 3E 00 00 00 00 00 00       $!  ANS000:7D8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  00.读故障码
  $#  REQ000:7D0 03 19 02 2B 00 00 00 00       $#  ANS000:7D8 03 19 02 2B 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/02000000


  $#  01.读冻结帧
  $#  REQ000:7D0 03 19 02 2B 00 00 00 00       $#  ANS000:7D8 03 19 02 2B 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/02000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7D0 04 14 FF FF FF 00 00 00       $$  ANS000:7D8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7D0 03 22 F0 10 00 00 00 00       $%  ANS000:7D8 03 22 F0 10 00 00 00 00
  $%  REQ001:7D0 03 22 F0 20 00 00 00 00       $%  ANS001:7D8 03 22 F0 20 00 00 00 00
  $%  REQ002:7D0 03 22 F0 21 00 00 00 00       $%  ANS002:7D8 03 22 F0 21 00 00 00 00
  $%  REQ003:7D0 03 22 F1 83 00 00 00 00       $%  ANS003:7D8 03 22 F1 83 00 00 00 00
  $%  REQ004:7D0 03 22 F1 87 00 00 00 00       $%  ANS004:7D8 03 22 F1 87 00 00 00 00
  $%  REQ005:7D0 03 22 F1 8A 00 00 00 00       $%  ANS005:7D8 03 22 F1 8A 00 00 00 00
  $%  REQ006:7D0 03 22 F1 8B 00 00 00 00       $%  ANS006:7D8 03 22 F1 8B 00 00 00 00
  $%  REQ007:7D0 03 22 F1 8C 00 00 00 00       $%  ANS007:7D8 03 22 F1 8C 00 00 00 00
  $%  REQ008:7D0 03 22 F1 90 00 00 00 00       $%  ANS008:7D8 03 22 F1 90 00 00 00 00
  $%  REQ009:7D0 03 22 F1 93 00 00 00 00       $%  ANS009:7D8 03 22 F1 93 00 00 00 00
  $%  REQ010:7D0 03 22 F1 95 00 00 00 00       $%  ANS010:7D8 03 22 F1 95 00 00 00 00
  $%  REQ011:7D0 03 22 F1 A1 00 00 00 00       $%  ANS011:7D8 03 22 F1 A1 00 00 00 00

  $%  000:ECU(电控单元)条码:                   $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  001:Matrix表版本信息:                    $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  002:诊断信息表版本信息:                  $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  003:ECU(电控单元) 底层软件版本号:        $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  004:系统零部件号:                        $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  005:系统供应商公司代码:                  $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  006:ECU(电控单元)生产日期:               $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02x%02x骞%02x鏈%02x鏃,x1,x2,x3,x4);
  $%  007:ECU(电控单元)串码:                   $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  008:车辆识别码(VIN码):                   $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:ECU(电控单元)硬件版本号:             $%    $%  ANS009.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $%  010:ECU(电控单元)应用软件版本号:         $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  011:车型配置:                            $%    $%  ANS011.BYTE004  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7D0 03 22 FD 02 00 00 00 00       $  ANS000:7D8 03 22 FD 02 00 00 00 00
  $  REQ001:7D0 03 22 FD 09 00 00 00 00       $  ANS001:7D8 03 22 FD 09 00 00 00 00
  $  REQ002:7D0 03 22 FD 0A 00 00 00 00       $  ANS002:7D8 03 22 FD 0A 00 00 00 00
  $  REQ003:7D0 03 22 FD 10 00 00 00 00       $  ANS003:7D8 03 22 FD 10 00 00 00 00
  $  REQ004:7D0 03 22 FD 56 00 00 00 00       $  ANS004:7D8 03 22 FD 56 00 00 00 00
  $  REQ005:7D0 03 22 FD 80 00 00 00 00       $  ANS005:7D8 03 22 FD 80 00 00 00 00

  $  000.加注状态                                                 $    $       $    $  ANS000.BYTE004  $  if(x==0x00) y=@0005; else if(x==0xAA) y=@0006; else if(x==0xEE) y=@0007; else y=@0004;
  $  001.左前轮进液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>0)&1)) y=@0002;else y=@0003;
  $  002.左前轮出液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>1)&1)) y=@0002;else y=@0003;
  $  003.右前轮进液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>2)&1)) y=@0002;else y=@0003;
  $  004.右前轮出液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>3)&1)) y=@0002;else y=@0003;
  $  005.左后轮进液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>4)&1)) y=@0002;else y=@0003;
  $  006.左后轮出液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>5)&1)) y=@0002;else y=@0003;
  $  007.右后轮进液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>6)&1)) y=@0002;else y=@0003;
  $  008.右后轮出液阀状态                                         $    $       $    $  ANS001.BYTE004  $  if(((x>>7)&1)) y=@0002;else y=@0003;
  $  009.调压阀0(仅限ESC(电子稳定控制单元))                       $    $       $    $  ANS001.BYTE005  $  if(((x>>0)&1)) y=@0002;else y=@0003;
  $  010.调压阀1(仅限ESC(电子稳定控制单元))                       $    $       $    $  ANS001.BYTE005  $  if(((x>>1)&1)) y=@0002;else y=@0003;
  $  011.供油阀0(仅限ESC(电子稳定控制单元))                       $    $       $    $  ANS001.BYTE005  $  if(((x>>2)&1)) y=@0002;else y=@0003;
  $  012.供油阀1(仅限ESC(电子稳定控制单元))                       $    $       $    $  ANS001.BYTE005  $  if(((x>>3)&1)) y=@0002;else y=@0003;
  $  013.阀组继电器状态(仅限ESC(电子稳定控制单元))                $    $       $    $  ANS002.BYTE004  $  if(x==0x00) y=@0002; else if(x==0xFF) y=@0003; else y=@0004;
  $  014.马达状态                                                 $    $       $    $  ANS003.BYTE004  $  if(x==0x00) y=@0002; else if(x==0xFF) y=@0003; else y=@0004;
  $  015.IMU(惯性测量单元)偏移量(仅限ESC(电子稳定控制单元))       $    $       $    $  ANS004.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $  016.ECU(电控单元)标识符                                      $    $       $    $  ANS005.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29);

;******************************************************************************************************************************************************

动作测试:

$^00:信号控制-电机（泵）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 01 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 01 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 01 00 00 00 00     $^

$^01:信号控制-前左油阀（入口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 02 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 02 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 02 00 00 00 00     $^

$^02:信号控制-前右油阀（入口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 03 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 03 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 03 00 00 00 00     $^

$^03:信号控制-后左油阀（入口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 04 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 04 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 04 00 00 00 00     $^

$^04:信号控制-后右油阀（入口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 05 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 05 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 05 00 00 00 00     $^

$^05:信号控制-前左油阀（出口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 06 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 06 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 06 00 00 00 00     $^

$^06:信号控制-前右油阀（出口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 07 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 07 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 07 00 00 00 00     $^

$^07:信号控制-后左油阀（出口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 08 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 08 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 08 00 00 00 00     $^

$^08:信号控制-后右油阀（出口）
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 09 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 09 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 09 00 00 00 00     $^

$^09:信号控制-USV1
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 0A 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 0A 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 0A 00 00 00 00     $^

$^10:信号控制-USV2
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 0B 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 0B 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 0B 00 00 00 00     $^

$^11:信号控制-HSV1
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 0E 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 0E 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 0E 00 00 00 00     $^

$^12:信号控制-HSV2
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 0F 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 0F 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 0F 00 00 00 00     $^

$^13:信号控制-解除速度限制
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 1E 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 1E 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 1E 00 00 00 00     $^

$^14:信号控制-使能油阀继电器
$^TYPE:0
$^BUTTON:使能
$^:7D0 04 2F FE 1F 03 00 00 00     $^

$^BUTTON:未使能
$^:7D0 04 2F FE 1F 01 00 00 00     $^

$^BUTTON:退出
$^:7D0 04 2F FE 1F 00 00 00 00     $^

30帧:

  $FC REQ000:7D0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
