
    车型ID：9d13

    模拟：协议模拟-->9d13

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k$~7A1

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:7A1 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 00 00 00 00 00 00       $!  ANS000:7A1 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:7A1 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/13000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:7A1 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F0 20 00 00 00 00       $%  ANS000:7A1 03 22 F0 20 00 00 00 00
  $%  REQ001:761 03 22 F0 21 00 00 00 00       $%  ANS001:7A1 03 22 F0 21 00 00 00 00
  $%  REQ002:761 03 22 F1 8A 00 00 00 00       $%  ANS002:7A1 03 22 F1 8A 00 00 00 00
  $%  REQ003:761 03 22 F1 8C 00 00 00 00       $%  ANS003:7A1 03 22 F1 8C 00 00 00 00
  $%  REQ004:761 03 22 F1 90 00 00 00 00       $%  ANS004:7A1 03 22 F1 90 00 00 00 00
  $%  REQ005:761 03 22 F1 8B 00 00 00 00       $%  ANS005:7A1 03 22 F1 8B 00 00 00 00
  $%  REQ006:761 03 22 F1 93 00 00 00 00       $%  ANS006:7A1 03 22 F1 93 00 00 00 00
  $%  REQ007:761 03 22 F1 95 00 00 00 00       $%  ANS007:7A1 03 22 F1 95 00 00 00 00
  $%  REQ008:761 03 22 F1 83 00 00 00 00       $%  ANS008:7A1 03 22 F1 83 00 00 00 00
  $%  REQ009:761 03 22 F1 A1 00 00 00 00       $%  ANS009:7A1 03 22 F1 A1 00 00 00 00
  $%  REQ010:761 03 22 F1 87 00 00 00 00       $%  ANS010:7A1 03 22 F1 87 00 00 00 00
  $%  REQ011:761 03 22 F1 84 00 00 00 00       $%  ANS011:7A1 03 22 F1 84 00 00 00 00

  $%  000:Matrix表版本信息:                   $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  001:诊断信息表版本信息:                 $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4);
  $%  002:ECU(电控单元)供应商ID:              $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:ECU(电控单元)串码:                  $%    $%  ANS003.BYTE004  $%  ASCII(x1,x2);
  $%  004:生产线编号：                        $%    $%  ANS003.BYTE006  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  005:生产序列号：                        $%    $%  ANS003.BYTE012  $%  ASCII(x1,x2,x3,x4);
  $%  006:车辆识别码(VIN码):                  $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  007:ECU(电控单元)生产日期:              $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02x%02x骞%02x鏈%02x鏃,x1,x2,x3,x4);
  $%  008:ECU硬件版本号:                      $%    $%  ANS006.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7);
  $%  009:ECU(电控单元)应用软件版本号:        $%    $%  ANS007.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  010:ECU(电控单元)底层软件版本号:        $%    $%  ANS008.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  011:车型配置:                           $%    $%  ANS009.BYTE004  $%  HEX(x1,x2,x3,x4);
  $%  012:ECU(电控单元)零件号:                $%    $%  ANS010.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  013:诊断仪指纹日期:                     $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%02x骞%02x鏈%02x鏃,x1,x2,x3);
  $%  014:诊断仪指纹:                         $%    $%  ANS011.BYTE007  $%  ASCII(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 02 00 00 00 00 00       $  ANS000:7A1 03 22 02 00 00 00 00 00
  $  REQ001:761 03 22 02 01 00 00 00 00       $  ANS001:7A1 03 22 02 01 00 00 00 00
  $  REQ002:761 03 22 02 02 00 00 00 00       $  ANS002:7A1 03 22 02 02 00 00 00 00
  $  REQ003:761 03 22 02 03 00 00 00 00       $  ANS003:7A1 03 22 02 03 00 00 00 00
  $  REQ004:761 03 22 02 04 00 00 00 00       $  ANS004:7A1 03 22 02 04 00 00 00 00
  $  REQ005:761 03 22 02 05 00 00 00 00       $  ANS005:7A1 03 22 02 05 00 00 00 00
  $  REQ006:761 03 22 02 06 00 00 00 00       $  ANS006:7A1 03 22 02 06 00 00 00 00
  $  REQ007:761 03 22 02 07 00 00 00 00       $  ANS007:7A1 03 22 02 07 00 00 00 00
  $  REQ008:761 03 22 02 08 00 00 00 00       $  ANS008:7A1 03 22 02 08 00 00 00 00
  $  REQ009:761 03 22 02 09 00 00 00 00       $  ANS009:7A1 03 22 02 09 00 00 00 00
  $  REQ010:761 03 22 02 0A 00 00 00 00       $  ANS010:7A1 03 22 02 0A 00 00 00 00
  $  REQ011:761 03 22 02 0B 00 00 00 00       $  ANS011:7A1 03 22 02 0B 00 00 00 00
  $  REQ012:761 03 22 02 0C 00 00 00 00       $  ANS012:7A1 03 22 02 0C 00 00 00 00
  $  REQ013:761 03 22 02 0D 00 00 00 00       $  ANS013:7A1 03 22 02 0D 00 00 00 00
  $  REQ014:761 03 22 02 0E 00 00 00 00       $  ANS014:7A1 03 22 02 0E 00 00 00 00
  $  REQ015:761 03 22 02 0F 00 00 00 00       $  ANS015:7A1 03 22 02 0F 00 00 00 00

  $  000.电机运行状态信息                                              $    $          $    $  ANS000.BYTE004  $  if((x&0x07)==0x00)y=@006b;else if((x&0x07)==0x01)y=@006c;else if((x&0x07)==0x02)y=@005e;else if((x&0x07)==0x03)y=@0056;else if((x&0x07)==0x04)y=@005e;else if((x&0x07)==0x05)y=@005e;else if((x&0x07)==0x06)y=@005e;else if((x&0x07)==0x07)y=@0038;
  $  001.油门1踩压角度                                                 $    $          $    $  ANS001.BYTE004  $  if((x&0xFF)==0xFB)y=@001a;else if((x&0xFF)==0xFC)y=@001a;else if((x&0xFF)==0xFD)y=@001a;else if((x&0xFF)==0xFE)y=@001a;else if((x&0xFF)==0xFF)y=@001a;else y=x*0.4;
  $  002.油门1踩压信息                                                 $    $          $    $  ANS001.BYTE005  $  if((x&0x01)==0x01)y=@0097;else if((x&0x00)==0x00)y=@0098;
  $  003.油门2踩压角度                                                 $    $          $    $  ANS001.BYTE006  $  if((x&0xFF)==0xFB)y=@001a;else if((x&0xFF)==0xFC)y=@001a;else if((x&0xFF)==0xFD)y=@001a;else if((x&0xFF)==0xFE)y=@001a;else if((x&0xFF)==0xFF)y=@001a;else y=x*0.4;
  $  004.油门2踩压信息                                                 $    $          $    $  ANS001.BYTE007  $  if((x&0x01)==0x01)y=@0095;else if((x&0x00)==0x00)y=@0096;
  $  005.刹车踏板1踩压角度                                             $    $  %       $    $  ANS002.BYTE004  $  if((x&0xFF)==0xFB)y=@001a;else if((x&0xFF)==0xFC)y=@001a;else if((x&0xFF)==0xFD)y=@001a;else if((x&0xFF)==0xFE)y=@001a;else if((x&0xFF)==0xFF)y=@001a;else y=x*0.4;
  $  006.刹车1踩压信息                                                 $    $          $    $  ANS002.BYTE005  $  if((x&0x01)==0x01)y=@0093;else if((x&0x00)==0x00)y=@0094;
  $  007.刹车踏板2踩压角度                                             $    $  %       $    $  ANS002.BYTE006  $  if((x&0xFF)==0xFB)y=@001a;else if((x&0xFF)==0xFC)y=@001a;else if((x&0xFF)==0xFD)y=@001a;else if((x&0xFF)==0xFE)y=@001a;else if((x&0xFF)==0xFF)y=@001a;else y=x*0.4;
  $  008.刹车2踩压信息                                                 $    $          $    $  ANS002.BYTE007  $  if((x&0x01)==0x01)y=@0091;else if((x&0x00)==0x00)y=@0092;
  $  009.变速器的当前档位信息                                          $    $          $    $  ANS003.BYTE004  $  if((x&0x03)==0x00)y=@000e;else if((x&0x03)==0x01)y=@000f;else if((x&0x03)==0x02)y=@0010;else if((x&0x03)==0x03)y=@0090;else y=@005e;
  $  010.VCU(整车控制系统)请求转矩和实际电机转矩(MSB)                  $    $          $    $  ANS004.BYTE004  $  ASCII(x1);
  $  011.VCU(整车控制系统)请求转矩和实际电机转矩(LSB)                  $    $          $    $  ANS004.BYTE005  $  ASCII(x1);
  $  012.VCU(整车控制系统)请求转矩和实际电机转矩状态信息               $    $          $    $  ANS004.BYTE006  $  if((x&0x01)==0x01)y=@008e;else if((x&0x00)==0x00)y=@008f;
  $  013.VCU(整车控制系统)请求转矩和实际电机转矩(MSB)                  $    $          $    $  ANS004.BYTE007  $  ASCII(x1);
  $  014.VCU(整车控制系统)需求，转矩和实际转矩需求字节（低字节）       $    $          $    $  ANS004.BYTE008  $  ASCII(x1);
  $  015.VCU(整车控制系统)需求，转矩和实际转矩需求状态信息             $    $          $    $  ANS004.BYTE009  $  if((x&0x01)==0x01)y=@008c;else if((x&0x00)==0x00)y=@008d;
  $  016.电机实际转速（高字节）                                        $    $          $    $  ANS005.BYTE004  $  ASCII(x1);
  $  017.电机实际转速（低字节）                                        $    $          $    $  ANS005.BYTE005  $  ASCII(x1);
  $  018.电机实际转速(RPM)状态                                         $    $          $    $  ANS005.BYTE006  $  if((x&0x01)==0x01)y=@001a;else if((x&0x00)==0x00)y=@0081;
  $  019.VCU(整车控制系统)测量的电池电压                               $    $  V       $    $  ANS006.BYTE004  $  switxh(x) 0xff:y=@007e;default:y=x;
  $  020.VCU(整车控制系统)测量的电池电压状态信息                       $    $          $    $  ANS006.BYTE005  $  if((x&0x01)==0x01)y=@001a;else if((x&0x00)==0x00)y=@0081;
  $  021.VCU(整车控制系统)提示当前车速                                 $    $  KPH     $    $  ANS007.BYTE004  $  y=x1;
  $  022.巡航或ASLD控制状态                                            $    $          $    $  ANS008.BYTE004  $  if((x&0x07)==0x00)y=@0084;else if((x&0x07)==0x01)y=@0085;else if((x&0x07)==0x02)y=@0086;else if((x&0x07)==0x03)y=@0087;else if((x&0x07)==0x04)y=@0088;else if((x&0x07)==0x05)y=@0089;else if((x&0x07)==0x06)y=@008a;else if((x&0x07)==0x07)y=@008b;
  $  023.巡航开关状态                                                  $    $          $    $  ANS008.BYTE005  $  if((x&0x01)==0x01)y=@0083;else if((x&0x00)==0x00)y=@0082;
  $  024.巡航状态:                                                     $    $          $    $  ANS008.BYTE006  $  if((x&0x03)==0x00)y=@0080;else if((x&0x03)==0x01)y=@0081;else if((x&0x03)==0x02)y=@0082;else if((x&0x03)==0x03)y=@005e;
  $  025.READY(待机)灯状态:                                            $    $          $    $  ANS008.BYTE007  $  if((x&0x01)==0x01)y=@007e;else if((x&0x00)==0x00)y=@007f;
  $  026.ECO灯状态:                                                    $    $          $    $  ANS008.BYTE008  $  if((x&0x03)==0x00)y=@00a5;else if((x&0x03)==0x01)y=@00ae;else if((x&0x03)==0x02)y=@00af;else if((x&0x03)==0x03)y=@005e;
  $  027.CP通信线充电站状态：                                          $    $          $    $  ANS009.BYTE004  $  if((x&0x07)==0x00)y=@00a7;else if((x&0x07)==0x01)y=@00a9;else if((x&0x07)==0x02)y=@00aa;else if((x&0x07)==0x03)y=@00ab;else if((x&0x07)==0x07)y=@00ac;else y=@00ad;
  $  028.CC通信线充电站状态                                            $    $          $    $  ANS009.BYTE005  $  if((x&0x01)==0x01)y=@00a7;else if((x&0x01)==0x00)y=@00a8;
  $  029.高压互锁状态                                                  $    $          $    $  ANS010.BYTE004  $  if((x&0x01)==0x01)y=@00a6;else if((x&0x01)==0x00)y=@00a5;
  $  030.功率限制指示                                                  $    $          $    $  ANS011.BYTE004  $  if((x&0x01)==0x01)y=@00a4;else if((x&0x01)==0x00)y=@00a5;
  $  031.电源或点火状态                                                $    $          $    $  ANS012.BYTE004  $  if((x&0x01)==0x01)y=@0099;else if((x&0x00)==0x00)y=@009a;
  $  032.动力电池馈电状态                                              $    $          $    $  ANS013.BYTE004  $  if((x&0x01)==0x01)y=@00a2;else if((x&0x01)==0x00)y=@00a3;
  $  033.车辆状态                                                      $    $          $    $  ANS014.BYTE004  $  if((x&0x03)==0x00)y=@001a;else if((x&0x03)==0x01)y=@009f;else if((x&0x03)==0x02)y=@00a0;else if((x&0x03)==0x03)y=@00a1;
  $  034.上高压过程控制                                                $    $          $    $  ANS015.BYTE004  $  if((x&0x03)==0x00)y=@009b;else if((x&0x03)==0x01)y=@009c;else if((x&0x03)==0x02)y=@009d;else if((x&0x03)==0x03)y=@009e;

;******************************************************************************************************************************************************

动作测试:

$^00:Single control(单独控制)–水泵输出
$^TYPE:2
$^DSP:单一控制 –水泵输出
$^IN_F:y=x;
$^RANGE:[0,100]

$^BUTTON:输入
$^:761 05 2F FD 07 03 XX 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 07 00 00 00 00     $^

$^01:Single control(单独控制)–低速冷却风扇输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 08 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 08 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 08 00 00 00 00     $^

$^02:Single control(单独控制)–高速冷却风扇输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 09 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 09 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 09 00 00 00 00     $^

$^03:Single control(单独控制)–预充电继电器输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 0A 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 0A 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 0A 00 00 00 00     $^

$^04:Single control(单独控制)–主驱动接触器输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 0B 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 0B 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 0B 00 00 00 00     $^

$^05:Single control(单独控制)–压缩机预充电继电器输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 0C 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 0C 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 0C 00 00 00 00     $^

$^06:Single control(单独控制)–压缩机控制继电器输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 0D 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 0D 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 0D 00 00 00 00     $^

$^07:Single control(单独控制)–真空泵继电器输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 0E 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 0E 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 0E 00 00 00 00     $^

$^08:Single control(单独控制)–低压主继电器输出
$^TYPE:0
$^BUTTON:开启
$^:761 05 2F FD 0F 03 01 00 00     $^

$^BUTTON:关闭
$^:761 05 2F FD 0F 03 00 00 00     $^

$^BUTTON:退出
$^:761 04 2F FD 0F 00 00 00 00     $^

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
