
    车型ID：1620

    模拟：协议模拟-->1620

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~729

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00
  $~  REQ001:721 02 10 01 00 00 00 00 00       $~  ANS001:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 03 19 02 09 00 00 00 00       $#  ANS000:729 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/feff0000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 03 14 00 FF 00 00 00 00       $$  ANS000:729 03 14 00 FF 00 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 F1 93 00 00 00 00       $%  ANS000:729 03 22 F1 93 00 00 00 00
  $%  REQ001:721 03 22 F1 94 00 00 00 00       $%  ANS001:729 03 22 F1 94 00 00 00 00
  $%  REQ002:721 03 22 F1 95 00 00 00 00       $%  ANS002:729 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1/100,(x1/10)%10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([20%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%.2d.%.2d],(x1*256+x2)/10000,((x1*256+x2)%10000)/100,(x1*256+x2)%100);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([20%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000.左前门灯开关                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x01)y=@001d;else y=@001e;
  $  001.右前门灯开关                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x02)y=@001d;else y=@001e;
  $  002.左后门灯开关                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x04)y=@001d;else y=@001e;
  $  003.右后门灯开关                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x08)y=@001d;else y=@001e;
  $  004.后背门开关                   $    $       $    $  ANS000.BYTE004  $  if(x1&0x10)y=@001d;else y=@001e;
  $  005.左前门锁状态                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x20)y=@000a;else y=@0009;
  $  006.左后门锁状态                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x40)y=@000a;else y=@0009;
  $  007.右前门锁状态                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x80)y=@000a;else y=@0009;
  $  008.右后门锁状态                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@000a;else y=@0009;
  $  009.后背门锁状态                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@000a;else y=@0009;
  $  010.发动机前舱盖状态             $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@001d;else y=@001e;
  $  011.安全带状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@002c;else y=@002d;
  $  012.12V制动信号状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0002;else y=@0003;
  $  013.0V制动灯开关状态             $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0002;else y=@0003;
  $  014.启动按钮1脚状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@000b;else y=@009d;
  $  015.启动按钮4脚状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@000b;else y=@009d;
  $  016.左前中控锁闭锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@000b;else y=@0003;
  $  017.左前中控锁解锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@000b;else y=@0003;
  $  018.右前中控锁闭锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@000b;else y=@0003;
  $  019.右前中控锁解锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@000b;else y=@0003;
  $  020.IG1(点火1)电状态             $    $       $    $  ANS000.BYTE006  $  if(x1&0x80)y=@001d;else y=@001e;
  $  021.ACC电状态                    $    $       $    $  ANS000.BYTE007  $  if(x1&0x01)y=@001d;else y=@001e;
  $  022.外后视镜折叠开关状态         $    $       $    $  ANS000.BYTE007  $  switxh(x1&0x07) 0:y=@03ef;1:y=@03ef;2:y=@03f0;3:y=@03f0;4:y=@03f1;5:y=@03f1;6:y=@0003;7:y=@0003;default:y=@0525;
  $  023.自锁式告警开关状态           $    $       $    $  ANS000.BYTE007  $  if(x1&0x80)y=@000b;else y=@0003;
  $  024.电动外后视镜翻转调节         $    $       $    $  ANS000.BYTE008  $  switxh(x1&0x0F)0:y=@009f;1:y=@00a0;2:y=@00a1;3:y=@00a2;4:y=@00a3;5:y=@00a4;6:y=@00a5;7:y=@00a6;8:y=@00a7;default: y =@0001;
  $  025.电动外后视镜左右选择         $    $       $    $  ANS000.BYTE008  $  switxh(x1&0x30)0x10:y=@00ae;0x20:y=@00af;0x30:y=@0001;default: y =@0003;
  $  026.门锁保护状态                 $    $       $    $  ANS000.BYTE009  $  switxh(x1&0x18)0x00: y = @0078;0x08: y = @00ab;0x10: y = @00ac;0x18: y = @00ad;default:y=@0525;
  $  027.碰撞信号状态                 $    $       $    $  ANS000.BYTE009  $  if((x1&0xC0)==0x00)y=@00a8;else if((x1&0xC0)==0x40)y=@00a9;else if((x1&0xC0)==0x80)y=@00aa;else y=@0001;

  $)  01.历史记录-报警记录
  $  01.历史记录-报警记录
  $  REQ000:721 03 22 01 09 00 00 00 00       $  ANS000:729 03 22 01 09 00 00 00 00

  $  000.报警记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  if(x1==0x11)y=@0091;else y=@0092;
  $  001.报警记录1-主驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0093;else y=@0003;
  $  002.报警记录1-副驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0093;else y=@0003;
  $  003.报警记录1-左后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0093;else y=@0003;
  $  004.报警记录1-右后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0093;else y=@0003;
  $  005.报警记录1-行李箱盖                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0093;else y=@0003;
  $  006.报警记录1-IG1(点火1)电               $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0093;else y=@0003;
  $  007.报警记录1-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0093;else y=@0003;
  $  008.报警记录1-主驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0093;else y=@0003;
  $  009.报警记录1-左后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0093;else y=@0003;
  $  010.报警记录1-副驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0093;else y=@0003;
  $  011.报警记录1-右后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0093;else y=@0003;
  $  012.报警记录1-前舱盖                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@0093;else y=@0003;
  $  013.报警记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  014.报警记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  if(x1==0x11)y=@0091;else y=@0092;
  $  015.报警记录2-主驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0093;else y=@0003;
  $  016.报警记录2-副驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0093;else y=@0003;
  $  017.报警记录2-左后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0093;else y=@0003;
  $  018.报警记录2-右后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0093;else y=@0003;
  $  019.报警记录2-行李箱盖                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0093;else y=@0003;
  $  020.报警记录2-IG1(点火1)电               $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0093;else y=@0003;
  $  021.报警记录2-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0093;else y=@0003;
  $  022.报警记录2-主驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0093;else y=@0003;
  $  023.报警记录2-左后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0093;else y=@0003;
  $  024.报警记录2-副驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0093;else y=@0003;
  $  025.报警记录2-右后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@0093;else y=@0003;
  $  026.报警记录2-前舱盖                     $    $       $    $  ANS000.BYTE010  $  if(x1&0x20)y=@0093;else y=@0003;
  $  027.报警记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  028.报警记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  if(x1==0x11)y=@0091;else y=@0092;
  $  029.报警记录3-主驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0093;else y=@0003;
  $  030.报警记录3-副驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0093;else y=@0003;
  $  031.报警记录3-左后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0093;else y=@0003;
  $  032.报警记录3-右后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0093;else y=@0003;
  $  033.报警记录3-行李箱盖                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0093;else y=@0003;
  $  034.报警记录3-IG1(点火1)电               $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0093;else y=@0003;
  $  035.报警记录3-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0093;else y=@0003;
  $  036.报警记录3-主驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0093;else y=@0003;
  $  037.报警记录3-左后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0093;else y=@0003;
  $  038.报警记录3-副驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@0093;else y=@0003;
  $  039.报警记录3-右后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x08)y=@0093;else y=@0003;
  $  040.报警记录3-前舱盖                     $    $       $    $  ANS000.BYTE014  $  if(x1&0x20)y=@0093;else y=@0003;
  $  041.报警记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  042.报警记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  if(x1==0x11)y=@0091;else y=@0092;
  $  043.报警记录4-主驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0093;else y=@0003;
  $  044.报警记录4-副驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0093;else y=@0003;
  $  045.报警记录4-左后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0093;else y=@0003;
  $  046.报警记录4-右后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0093;else y=@0003;
  $  047.报警记录4-行李箱盖                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0093;else y=@0003;
  $  048.报警记录4-IG1(点火1)电               $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0093;else y=@0003;
  $  049.报警记录4-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0093;else y=@0003;
  $  050.报警记录4-主驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0093;else y=@0003;
  $  051.报警记录4-左后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0093;else y=@0003;
  $  052.报警记录4-副驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@0093;else y=@0003;
  $  053.报警记录4-右后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x08)y=@0093;else y=@0003;
  $  054.报警记录4-前舱盖                     $    $       $    $  ANS000.BYTE018  $  if(x1&0x20)y=@0093;else y=@0003;
  $  055.报警记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  056.报警记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  if(x1==0x11)y=@0091;else y=@0092;
  $  057.报警记录5-主驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0093;else y=@0003;
  $  058.报警记录5-副驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0093;else y=@0003;
  $  059.报警记录5-左后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0093;else y=@0003;
  $  060.报警记录5-右后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0093;else y=@0003;
  $  061.报警记录5-行李箱盖                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0093;else y=@0003;
  $  062.报警记录5-IG1(点火1)电               $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0093;else y=@0003;
  $  063.报警记录5-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0093;else y=@0003;
  $  064.报警记录5-主驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0093;else y=@0003;
  $  065.报警记录5-左后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0093;else y=@0003;
  $  066.报警记录5-副驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@0093;else y=@0003;
  $  067.报警记录5-右后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x08)y=@0093;else y=@0003;
  $  068.报警记录5-前舱盖                     $    $       $    $  ANS000.BYTE022  $  if(x1&0x20)y=@0093;else y=@0003;
  $  069.报警记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  070.报警记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  if(x1==0x11)y=@0091;else y=@0092;
  $  071.报警记录6-主驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0093;else y=@0003;
  $  072.报警记录6-副驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0093;else y=@0003;
  $  073.报警记录6-左后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0093;else y=@0003;
  $  074.报警记录6-右后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0093;else y=@0003;
  $  075.报警记录6-行李箱盖                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0093;else y=@0003;
  $  076.报警记录6-IG1(点火1)电               $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0093;else y=@0003;
  $  077.报警记录6-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0093;else y=@0003;
  $  078.报警记录6-主驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0093;else y=@0003;
  $  079.报警记录6-左后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0093;else y=@0003;
  $  080.报警记录6-副驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@0093;else y=@0003;
  $  081.报警记录6-右后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0093;else y=@0003;
  $  082.报警记录6-前舱盖                     $    $       $    $  ANS000.BYTE026  $  if(x1&0x20)y=@0093;else y=@0003;
  $  083.报警记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  084.报警记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  if(x1==0x11)y=@0091;else y=@0092;
  $  085.报警记录7-主驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0093;else y=@0003;
  $  086.报警记录7-副驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0093;else y=@0003;
  $  087.报警记录7-左后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0093;else y=@0003;
  $  088.报警记录7-右后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0093;else y=@0003;
  $  089.报警记录7-行李箱盖                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0093;else y=@0003;
  $  090.报警记录7-IG1(点火1)电               $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0093;else y=@0003;
  $  091.报警记录7-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0093;else y=@0003;
  $  092.报警记录7-主驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0093;else y=@0003;
  $  093.报警记录7-左后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0093;else y=@0003;
  $  094.报警记录7-副驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@0093;else y=@0003;
  $  095.报警记录7-右后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x08)y=@0093;else y=@0003;
  $  096.报警记录7-前舱盖                     $    $       $    $  ANS000.BYTE030  $  if(x1&0x20)y=@0093;else y=@0003;
  $  097.报警记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  098.报警记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  if(x1==0x11)y=@0091;else y=@0092;
  $  099.报警记录8-主驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0093;else y=@0003;
  $  100.报警记录8-副驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0093;else y=@0003;
  $  101.报警记录8-左后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0093;else y=@0003;
  $  102.报警记录8-右后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0093;else y=@0003;
  $  103.报警记录8-行李箱盖                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0093;else y=@0003;
  $  104.报警记录8-IG1(点火1)电               $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0093;else y=@0003;
  $  105.报警记录8-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0093;else y=@0003;
  $  106.报警记录8-主驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0093;else y=@0003;
  $  107.报警记录8-左后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0093;else y=@0003;
  $  108.报警记录8-副驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@0093;else y=@0003;
  $  109.报警记录8-右后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x08)y=@0093;else y=@0003;
  $  110.报警记录8-前舱盖                     $    $       $    $  ANS000.BYTE034  $  if(x1&0x20)y=@0093;else y=@0003;
  $  111.报警记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.历史记录-闭锁记录
  $  02.历史记录-闭锁记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00

  $  000.闭锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  if(x1==0x12)y=@0091;else y=@0092;
  $  001.闭锁记录1-副驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0093;else y=@0003;
  $  002.闭锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0093;else y=@0003;
  $  003.闭锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0093;else y=@0003;
  $  004.闭锁记录1-超速                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0093;else y=@0003;
  $  005.闭锁记录1-自动返回防盗         $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0093;else y=@0003;
  $  006.闭锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0093;else y=@0003;
  $  007.闭锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0093;else y=@0003;
  $  008.闭锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0093;else y=@0003;
  $  009.闭锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0093;else y=@0003;
  $  010.闭锁记录1-自动设定防盗         $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0093;else y=@0003;
  $  011.闭锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  012.闭锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  if(x1==0x12)y=@0091;else y=@0092;
  $  013.闭锁记录2-副驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0093;else y=@0003;
  $  014.闭锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0093;else y=@0003;
  $  015.闭锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0093;else y=@0003;
  $  016.闭锁记录2-超速                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0093;else y=@0003;
  $  017.闭锁记录2-自动返回防盗         $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0093;else y=@0003;
  $  018.闭锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0093;else y=@0003;
  $  019.闭锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@0093;else y=@0003;
  $  020.闭锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0093;else y=@0003;
  $  021.闭锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0093;else y=@0003;
  $  022.闭锁记录2-自动设定防盗         $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0093;else y=@0003;
  $  023.闭锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  024.闭锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  if(x1==0x12)y=@0091;else y=@0092;
  $  025.闭锁记录3-副驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0093;else y=@0003;
  $  026.闭锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0093;else y=@0003;
  $  027.闭锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0093;else y=@0003;
  $  028.闭锁记录3-超速                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0093;else y=@0003;
  $  029.闭锁记录3-自动返回防盗         $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0093;else y=@0003;
  $  030.闭锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0093;else y=@0003;
  $  031.闭锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@0093;else y=@0003;
  $  032.闭锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0093;else y=@0003;
  $  033.闭锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0093;else y=@0003;
  $  034.闭锁记录3-自动设定防盗         $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0093;else y=@0003;
  $  035.闭锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  036.闭锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  if(x1==0x12)y=@0091;else y=@0092;
  $  037.闭锁记录4-副驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0093;else y=@0003;
  $  038.闭锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0093;else y=@0003;
  $  039.闭锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0093;else y=@0003;
  $  040.闭锁记录4-超速                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0093;else y=@0003;
  $  041.闭锁记录4-自动返回防盗         $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0093;else y=@0003;
  $  042.闭锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0093;else y=@0003;
  $  043.闭锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@0093;else y=@0003;
  $  044.闭锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0093;else y=@0003;
  $  045.闭锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0093;else y=@0003;
  $  046.闭锁记录4-自动设定防盗         $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0093;else y=@0003;
  $  047.闭锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  048.闭锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  if(x1==0x12)y=@0091;else y=@0092;
  $  049.闭锁记录5-副驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0093;else y=@0003;
  $  050.闭锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0093;else y=@0003;
  $  051.闭锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0093;else y=@0003;
  $  052.闭锁记录5-超速                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0093;else y=@0003;
  $  053.闭锁记录5-自动返回防盗         $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0093;else y=@0003;
  $  054.闭锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0093;else y=@0003;
  $  055.闭锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@0093;else y=@0003;
  $  056.闭锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0093;else y=@0003;
  $  057.闭锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0093;else y=@0003;
  $  058.闭锁记录5-自动设定防盗         $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0093;else y=@0003;
  $  059.闭锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  060.闭锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  if(x1==0x12)y=@0091;else y=@0092;
  $  061.闭锁记录6-副驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0093;else y=@0003;
  $  062.闭锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0093;else y=@0003;
  $  063.闭锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0093;else y=@0003;
  $  064.闭锁记录6-超速                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0093;else y=@0003;
  $  065.闭锁记录6-自动返回防盗         $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0093;else y=@0003;
  $  066.闭锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0093;else y=@0003;
  $  067.闭锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0093;else y=@0003;
  $  068.闭锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0093;else y=@0003;
  $  069.闭锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0093;else y=@0003;
  $  070.闭锁记录6-自动设定防盗         $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0093;else y=@0003;
  $  071.闭锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  072.闭锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  if(x1==0x12)y=@0091;else y=@0092;
  $  073.闭锁记录7-副驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0093;else y=@0003;
  $  074.闭锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0093;else y=@0003;
  $  075.闭锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0093;else y=@0003;
  $  076.闭锁记录7-超速                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0093;else y=@0003;
  $  077.闭锁记录7-自动返回防盗         $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0093;else y=@0003;
  $  078.闭锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0093;else y=@0003;
  $  079.闭锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@0093;else y=@0003;
  $  080.闭锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0093;else y=@0003;
  $  081.闭锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0093;else y=@0003;
  $  082.闭锁记录7-自动设定防盗         $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0093;else y=@0003;
  $  083.闭锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  084.闭锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  if(x1==0x12)y=@0091;else y=@0092;
  $  085.闭锁记录8-副驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0093;else y=@0003;
  $  086.闭锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0093;else y=@0003;
  $  087.闭锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0093;else y=@0003;
  $  088.闭锁记录8-超速                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0093;else y=@0003;
  $  089.闭锁记录8-自动返回防盗         $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0093;else y=@0003;
  $  090.闭锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0093;else y=@0003;
  $  091.闭锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@0093;else y=@0003;
  $  092.闭锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0093;else y=@0003;
  $  093.闭锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0093;else y=@0003;
  $  094.闭锁记录8-自动设定防盗         $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0093;else y=@0003;
  $  095.闭锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.历史记录-解锁记录
  $  03.历史记录-解锁记录
  $  REQ000:721 03 22 01 0B 00 00 00 00       $  ANS000:729 03 22 01 0B 00 00 00 00

  $  000.解锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  if(x1==0x13)y=@0091;else y=@0092;
  $  001.解锁记录1-副驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0093;else y=@0003;
  $  002.解锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0093;else y=@0003;
  $  003.解锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0093;else y=@0003;
  $  004.解锁记录1-退电                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0093;else y=@0003;
  $  005.解锁记录1-碰撞信号             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0093;else y=@0003;
  $  006.解锁记录1-钥匙在车内           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0093;else y=@0003;
  $  007.解锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0093;else y=@0003;
  $  008.解锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0093;else y=@0003;
  $  009.解锁记录1-锁定防止             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0093;else y=@0003;
  $  010.解锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0093;else y=@0003;
  $  011.解锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0093;else y=@0003;
  $  012.解锁记录1-硬线碰撞信号         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0093;else y=@0003;
  $  013.解锁记录1-CAN线碰撞信号        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@0093;else y=@0003;
  $  014.解锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  015.解锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  if(x1==0x13)y=@0091;else y=@0092;
  $  016.解锁记录2-副驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0093;else y=@0003;
  $  017.解锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0093;else y=@0003;
  $  018.解锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0093;else y=@0003;
  $  019.解锁记录2-退电                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0093;else y=@0003;
  $  020.解锁记录2-碰撞信号             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0093;else y=@0003;
  $  021.解锁记录2-钥匙在车内           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0093;else y=@0003;
  $  022.解锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@0093;else y=@0003;
  $  023.解锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0093;else y=@0003;
  $  024.解锁记录2-锁定防止             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0093;else y=@0003;
  $  025.解锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0093;else y=@0003;
  $  026.解锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0093;else y=@0003;
  $  027.解锁记录2-硬线碰撞信号         $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@0093;else y=@0003;
  $  028.解锁记录2-CAN线碰撞信号        $    $       $    $  ANS000.BYTE010  $  if(x1&0x10)y=@0093;else y=@0003;
  $  029.解锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  030.解锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  if(x1==0x13)y=@0091;else y=@0092;
  $  031.解锁记录3-副驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0093;else y=@0003;
  $  032.解锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0093;else y=@0003;
  $  033.解锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0093;else y=@0003;
  $  034.解锁记录3-退电                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0093;else y=@0003;
  $  035.解锁记录3-碰撞信号             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0093;else y=@0003;
  $  036.解锁记录3-钥匙在车内           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0093;else y=@0003;
  $  037.解锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@0093;else y=@0003;
  $  038.解锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0093;else y=@0003;
  $  039.解锁记录3-锁定防止             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0093;else y=@0003;
  $  040.解锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0093;else y=@0003;
  $  041.解锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@0093;else y=@0003;
  $  042.解锁记录3-硬线碰撞信号         $    $       $    $  ANS000.BYTE014  $  if(x1&0x08)y=@0093;else y=@0003;
  $  043.解锁记录3-CAN线碰撞信号        $    $       $    $  ANS000.BYTE014  $  if(x1&0x10)y=@0093;else y=@0003;
  $  044.解锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  045.解锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  if(x1==0x13)y=@0091;else y=@0092;
  $  046.解锁记录4-副驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0093;else y=@0003;
  $  047.解锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0093;else y=@0003;
  $  048.解锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0093;else y=@0003;
  $  049.解锁记录4-退电                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0093;else y=@0003;
  $  050.解锁记录4-碰撞信号             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0093;else y=@0003;
  $  051.解锁记录4-钥匙在车内           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0093;else y=@0003;
  $  052.解锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@0093;else y=@0003;
  $  053.解锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0093;else y=@0003;
  $  054.解锁记录4-锁定防止             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0093;else y=@0003;
  $  055.解锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0093;else y=@0003;
  $  056.解锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@0093;else y=@0003;
  $  057.解锁记录4-硬线碰撞信号         $    $       $    $  ANS000.BYTE018  $  if(x1&0x08)y=@0093;else y=@0003;
  $  058.解锁记录4-CAN线碰撞信号        $    $       $    $  ANS000.BYTE018  $  if(x1&0x10)y=@0093;else y=@0003;
  $  059.解锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  060.解锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  if(x1==0x13)y=@0091;else y=@0092;
  $  061.解锁记录5-副驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0093;else y=@0003;
  $  062.解锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0093;else y=@0003;
  $  063.解锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0093;else y=@0003;
  $  064.解锁记录5-退电                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0093;else y=@0003;
  $  065.解锁记录5-碰撞信号             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0093;else y=@0003;
  $  066.解锁记录5-钥匙在车内           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0093;else y=@0003;
  $  067.解锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@0093;else y=@0003;
  $  068.解锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0093;else y=@0003;
  $  069.解锁记录5-锁定防止             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0093;else y=@0003;
  $  070.解锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0093;else y=@0003;
  $  071.解锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@0093;else y=@0003;
  $  072.解锁记录5-硬线碰撞信号         $    $       $    $  ANS000.BYTE022  $  if(x1&0x08)y=@0093;else y=@0003;
  $  073.解锁记录5-CAN线碰撞信号        $    $       $    $  ANS000.BYTE022  $  if(x1&0x10)y=@0093;else y=@0003;
  $  074.解锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  075.解锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  if(x1==0x13)y=@0091;else y=@0092;
  $  076.解锁记录6-副驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0093;else y=@0003;
  $  077.解锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0093;else y=@0003;
  $  078.解锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0093;else y=@0003;
  $  079.解锁记录6-退电                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0093;else y=@0003;
  $  080.解锁记录6-碰撞信号             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0093;else y=@0003;
  $  081.解锁记录6-钥匙在车内           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0093;else y=@0003;
  $  082.解锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0093;else y=@0003;
  $  083.解锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0093;else y=@0003;
  $  084.解锁记录6-锁定防止             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0093;else y=@0003;
  $  085.解锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0093;else y=@0003;
  $  086.解锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@0093;else y=@0003;
  $  087.解锁记录6-硬线碰撞信号         $    $       $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0093;else y=@0003;
  $  088.解锁记录6-CAN线碰撞信号        $    $       $    $  ANS000.BYTE026  $  if(x1&0x10)y=@0093;else y=@0003;
  $  089.解锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  090.解锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  if(x1==0x13)y=@0091;else y=@0092;
  $  091.解锁记录7-副驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0093;else y=@0003;
  $  092.解锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0093;else y=@0003;
  $  093.解锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0093;else y=@0003;
  $  094.解锁记录7-退电                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0093;else y=@0003;
  $  095.解锁记录7-碰撞信号             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0093;else y=@0003;
  $  096.解锁记录7-钥匙在车内           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0093;else y=@0003;
  $  097.解锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@0093;else y=@0003;
  $  098.解锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0093;else y=@0003;
  $  099.解锁记录7-锁定防止             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0093;else y=@0003;
  $  100.解锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0093;else y=@0003;
  $  101.解锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@0093;else y=@0003;
  $  102.解锁记录7-硬线碰撞信号         $    $       $    $  ANS000.BYTE030  $  if(x1&0x08)y=@0093;else y=@0003;
  $  103.解锁记录7-CAN线碰撞信号        $    $       $    $  ANS000.BYTE030  $  if(x1&0x10)y=@0093;else y=@0003;
  $  104.解锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  105.解锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  if(x1==0x13)y=@0091;else y=@0092;
  $  106.解锁记录8-副驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0093;else y=@0003;
  $  107.解锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0093;else y=@0003;
  $  108.解锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0093;else y=@0003;
  $  109.解锁记录8-退电                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0093;else y=@0003;
  $  110.解锁记录8-碰撞信号             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0093;else y=@0003;
  $  111.解锁记录8-钥匙在车内           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0093;else y=@0003;
  $  112.解锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@0093;else y=@0003;
  $  113.解锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0093;else y=@0003;
  $  114.解锁记录8-锁定防止             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0093;else y=@0003;
  $  115.解锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0093;else y=@0003;
  $  116.解锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@0093;else y=@0003;
  $  117.解锁记录8-硬线碰撞信号         $    $       $    $  ANS000.BYTE034  $  if(x1&0x08)y=@0093;else y=@0003;
  $  118.解锁记录8-CAN线碰撞信号        $    $       $    $  ANS000.BYTE034  $  if(x1&0x10)y=@0093;else y=@0003;
  $  119.解锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.历史记录-行李箱解锁记录
  $  04.历史记录-行李箱解锁记录
  $  REQ000:721 03 22 01 0C 00 00 00 00       $  ANS000:729 03 22 01 0C 00 00 00 00

  $  000.行李箱解锁记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  if(x1==0x14)y=@0091;else y=@0092;
  $  001.行李箱解锁记录1-遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0093;else y=@0003;
  $  002.行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0093;else y=@0003;
  $  003.行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0093;else y=@0003;
  $  004.行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0093;else y=@0003;
  $  005.行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0093;else y=@0003;
  $  006.行李箱解锁记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007.行李箱解锁记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  if(x1==0x14)y=@0091;else y=@0092;
  $  008.行李箱解锁记录2-遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0093;else y=@0003;
  $  009.行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0093;else y=@0003;
  $  010.行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0093;else y=@0003;
  $  011.行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0093;else y=@0003;
  $  012.行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0093;else y=@0003;
  $  013.行李箱解锁记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014.行李箱解锁记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  if(x1==0x14)y=@0091;else y=@0092;
  $  015.行李箱解锁记录3-遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0093;else y=@0003;
  $  016.行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0093;else y=@0003;
  $  017.行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0093;else y=@0003;
  $  018.行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0093;else y=@0003;
  $  019.行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0093;else y=@0003;
  $  020.行李箱解锁记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021.行李箱解锁记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  if(x1==0x14)y=@0091;else y=@0092;
  $  022.行李箱解锁记录4-遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0093;else y=@0003;
  $  023.行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0093;else y=@0003;
  $  024.行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0093;else y=@0003;
  $  025.行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0093;else y=@0003;
  $  026.行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0093;else y=@0003;
  $  027.行李箱解锁记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028.行李箱解锁记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  if(x1==0x14)y=@0091;else y=@0092;
  $  029.行李箱解锁记录5-遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0093;else y=@0003;
  $  030.行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0093;else y=@0003;
  $  031.行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0093;else y=@0003;
  $  032.行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0093;else y=@0003;
  $  033.行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0093;else y=@0003;
  $  034.行李箱解锁记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035.行李箱解锁记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  if(x1==0x14)y=@0091;else y=@0092;
  $  036.行李箱解锁记录6-遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0093;else y=@0003;
  $  037.行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0093;else y=@0003;
  $  038.行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0093;else y=@0003;
  $  039.行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0093;else y=@0003;
  $  040.行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0093;else y=@0003;
  $  041.行李箱解锁记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042.行李箱解锁记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  if(x1==0x14)y=@0091;else y=@0092;
  $  043.行李箱解锁记录7-遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0093;else y=@0003;
  $  044.行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0093;else y=@0003;
  $  045.行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0093;else y=@0003;
  $  046.行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0093;else y=@0003;
  $  047.行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0093;else y=@0003;
  $  048.行李箱解锁记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049.行李箱解锁记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  if(x1==0x14)y=@0091;else y=@0092;
  $  050.行李箱解锁记录8-遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0093;else y=@0003;
  $  051.行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0093;else y=@0003;
  $  052.行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0093;else y=@0003;
  $  053.行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0093;else y=@0003;
  $  054.行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0093;else y=@0003;
  $  055.行李箱解锁记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.历史记录-启动失败记录
  $  05.历史记录-启动失败记录
  $  REQ000:721 03 22 01 0D 00 00 00 00       $  ANS000:729 03 22 01 0D 00 00 00 00

  $  000.启动失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  if(x1==0x15)y=@0091;else y=@0092;
  $  001.启动失败记录1-启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  002.启动失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.启动失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  if(x1==0x15)y=@0091;else y=@0092;
  $  004.启动失败记录2-启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  005.启动失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.启动失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  if(x1==0x15)y=@0091;else y=@0092;
  $  007.启动失败记录3-启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  008.启动失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.启动失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  if(x1==0x15)y=@0091;else y=@0092;
  $  010.启动失败记录4-启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  011.启动失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.启动失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  if(x1==0x15)y=@0091;else y=@0092;
  $  013.启动失败记录5-启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  014.启动失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.启动失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  if(x1==0x15)y=@0091;else y=@0092;
  $  016.启动失败记录6-启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  017.启动失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.启动失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  if(x1==0x15)y=@0091;else y=@0092;
  $  019.启动失败记录7-启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  020.启动失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.启动失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  if(x1==0x15)y=@0091;else y=@0092;
  $  022.启动失败记录8-启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@008c;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@008d;else if(x1==0x07) y=@0854;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0A) y=@009b;else if(x1==0x0B) y=@009c;else y=@0001;
  $  023.启动失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.历史记录-退电失败记录
  $  06.历史记录-退电失败记录
  $  REQ000:721 03 22 01 0E 00 00 00 00       $  ANS000:729 03 22 01 0E 00 00 00 00

  $  000.退电失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  if(x1==0x16)y=@0091;else y=@0092;
  $  001.退电失败记录1-退电失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  002.退电失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.退电失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  if(x1==0x16)y=@0091;else y=@0092;
  $  004.退电失败记录2-退电失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  005.退电失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.退电失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  if(x1==0x16)y=@0091;else y=@0092;
  $  007.退电失败记录3-退电失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  008.退电失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.退电失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  if(x1==0x16)y=@0091;else y=@0092;
  $  010.退电失败记录4-退电失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  011.退电失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.退电失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  if(x1==0x16)y=@0091;else y=@0092;
  $  013.退电失败记录5-退电失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  014.退电失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.退电失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  if(x1==0x16)y=@0091;else y=@0092;
  $  016.退电失败记录6-退电失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  017.退电失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.退电失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  if(x1==0x16)y=@0091;else y=@0092;
  $  019.退电失败记录7-退电失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  020.退电失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.退电失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  if(x1==0x16)y=@0091;else y=@0092;
  $  022.退电失败记录8-退电失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@008c;else if(x1==0x03) y=@008d;else if(x1==0x04) y=@008e;else if(x1==0x05) y=@008f;else if(x1==0x06) y=@0090;else y=@0001;
  $  023.退电失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:721 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
