
    车型ID：2c2c

    模拟：协议模拟-->2c2c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7BF

进入命令:

  $~  REQ000:7B7 02 10 01 00 00 00 00 00       $~  ANS000:7BF 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7B7 02 3E 80 00 00 00 00 00       $!  ANS000:7BF 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7B7 03 19 02 09 00 00 00 00       $#  ANS000:7BF 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/28000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7B7 04 14 FF FF FF 00 00 00       $$  ANS000:7BF 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7B7 03 22 F1 93 00 00 00 00       $%  ANS000:7BF 03 22 F1 93 00 00 00 00
  $%  REQ001:7B7 03 22 F1 94 00 00 00 00       $%  ANS001:7BF 03 22 F1 94 00 00 00 00
  $%  REQ002:7B7 03 22 F1 95 00 00 00 00       $%  ANS002:7BF 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7B7 03 22 01 08 00 00 00 00       $  ANS000:7BF 03 22 01 08 00 00 00 00
  $  REQ001:7B7 03 22 01 20 00 00 00 00       $  ANS001:7BF 03 22 01 20 00 00 00 00
  $  REQ002:7B7 03 22 01 21 00 00 00 00       $  ANS002:7BF 03 22 01 21 00 00 00 00

  $  000.左儿童锁闭锁状态               $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@000a;else y=@0009;
  $  001.右儿童锁闭锁状态               $    $       $    $  ANS000.BYTE007  $  if(x1&0x02) y=@000a;else y=@0009;
  $  002.交流充电口状态                 $    $       $    $  ANS000.BYTE007  $  if(x1&0x04) y=@001d;else y=@001e;
  $  003.交流充电口照明灯状态           $    $       $    $  ANS000.BYTE007  $  if(x1&0x08) y=@001d;else y=@001e;
  $  004.行李箱解锁开关状态             $    $       $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0002;else y=@0003;
  $  005.行李箱灯开关状态               $    $       $    $  ANS000.BYTE007  $  if(x1&0x20) y=@001d;else y=@001e;
  $  006.行李箱状态                     $    $       $    $  ANS000.BYTE007  $  if(x1&0x40) y=@001d;else y=@001e;
  $  007.行李箱灯状态                   $    $       $    $  ANS000.BYTE007  $  if(x1&0x80) y=@001d;else y=@001e;
  $  008.油箱口盖状态                   $    $       $    $  ANS000.BYTE008  $  if(x1&0x01) y=@001d;else y=@001e;
  $  009.后雨刮复位信号                 $    $       $    $  ANS000.BYTE008  $  if(x1&0x02) y=@0002;else y=@0003;
  $  010.后小灯状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x04) y=@001d;else y=@001e;
  $  011.倒车灯状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x08) y=@001d;else y=@001e;
  $  012.后雾灯状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x10) y=@001d;else y=@001e;
  $  013.报警器状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x20) y=@001d;else y=@001e;
  $  014.后除霜状态                     $    $       $    $  ANS000.BYTE008  $  if(x1&0x40) y=@001d;else y=@001e;
  $  015.后舱ACC电状态                  $    $       $    $  ANS000.BYTE008  $  if(x1&0x80) y=@001d;else y=@001e;
  $  016.后雨刮开关状态                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@001d;else y=@001e;
  $  017.后鼓风机状态                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@001d;else y=@001e;
  $  018.后洗涤状态                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@001d;else y=@001e;
  $  019.前洗涤状态                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@001d;else y=@001e;
  $  020.直流充电口盖状态               $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@001d;else y=@001e;
  $  021.直流充电口照明状态             $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@001d;else y=@001e;
  $  022.交流充电枪连接状态             $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@05d7;else y=@0254;
  $  023.直流充电枪连接状态             $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@05d7;else y=@0254;
  $  024.交流充电枪闭锁位置             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@000a;else y=@0009;
  $  025.直流充电枪闭锁位置             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@000a;else y=@0009;
  $  026.告警灯状态                     $    $       $    $  ANS000.BYTE010  $  switxh(x1&0x0C)0x00: y=@0003;0x04: y=@05ce;0x08: y=@05cf;0x0C: y=@05d6;default: y=@0001;
  $  027.左转向灯开关状态               $    $       $    $  ANS000.BYTE010  $  switxh(x1&0x30)0x00: y=@0003;0x10: y=@05d1;0x20: y=@05d2;0x30: y=@007b;default: y=@0001;
  $  028.右转向灯开关状态               $    $       $    $  ANS000.BYTE010  $  switxh(x1&0xC0)0x00: y=@0003;0x40: y=@05d1;0x80: y=@05d2;0xC0: y=@007b;default: y=@0001;
  $  029.左后转向灯故障                 $    $       $    $  ANS000.BYTE011  $  if(x1&0x01) y=@0167;else y=@0078;
  $  030.右后转向灯故障                 $    $       $    $  ANS000.BYTE011  $  if(x1&0x02) y=@0167;else y=@0078;
  $  031.左后二排安全带状态             $    $       $    $  ANS000.BYTE011  $  if(x1&0x04) y=@05cb;else y=@05cc;
  $  032.左后二排座椅乘客有无状态       $    $       $    $  ANS000.BYTE011  $  if(x1&0x08) y=@002e;else y=@05ca;
  $  033.右后二排安全带状态             $    $       $    $  ANS000.BYTE011  $  if(x1&0x10) y=@05cb;else y=@05cc;
  $  034.右后二排座椅乘客有无状态       $    $       $    $  ANS000.BYTE011  $  if(x1&0x20) y=@002e;else y=@05ca;
  $  035.中后二排安全带状态             $    $       $    $  ANS000.BYTE011  $  if(x1&0x40) y=@05cb;else y=@05cc;
  $  036.中后二排座椅乘客有无状态       $    $       $    $  ANS000.BYTE011  $  if(x1&0x80) y=@002e;else y=@05ca;
  $  037.记录有效性-                    $    $       $    $  ANS001.BYTE004  $  switxh(x1)0x21: y=@0091;default: y=@0092;
  $  038.窗控左儿童锁闭锁指令-          $    $       $    $  ANS001.BYTE005  $  if(x1&0x01) y=@0002;else y=@0003;
  $  039.窗控右儿童锁闭锁指令-          $    $       $    $  ANS001.BYTE005  $  if(x1&0x02) y=@0002;else y=@0003;
  $  040.IO控制左儿童锁闭锁指令-        $    $       $    $  ANS001.BYTE005  $  if(x1&0x04) y=@0002;else y=@0003;
  $  041.IO控制右儿童锁闭锁指令-        $    $       $    $  ANS001.BYTE005  $  if(x1&0x08) y=@0002;else y=@0003;
  $  042.数据索引-                      $    $       $    $  ANS001.BYTE006  $  switxh(x1)0x00: y=@0003;0x01: y=@0002;default: y=@0003;
  $  043.儿童锁闭锁触发时间标识-        $    $       $    $  ANS001.BYTE007  $  switxh(x1)0x00: y=@0003;0x01: y=@0002;default: y=@0001;
  $  044.触发时间-                      $    $       $    $  ANS001.BYTE008  $  y=SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0198,x2,@0199,x3,@02ab,x4,@0212);
  $  045.数据索引-                      $    $       $    $  ANS001.BYTE012  $  y=x1;
  $  046.记录有效性-                    $    $       $    $  ANS002.BYTE004  $  switxh(x1)0x21: y=@0091;default: y=@0092;
  $  047.窗控左儿童锁解锁指令-          $    $       $    $  ANS002.BYTE005  $  if(x1&0x01) y=@0002;else y=@0003;
  $  048.窗控右儿童锁解锁指令-          $    $       $    $  ANS002.BYTE005  $  if(x1&0x02) y=@0002;else y=@0003;
  $  049.IO控制左儿童锁解锁指令-        $    $       $    $  ANS002.BYTE005  $  if(x1&0x04) y=@0002;else y=@0003;
  $  050.IO控制右儿童锁解锁指令-        $    $       $    $  ANS002.BYTE005  $  if(x1&0x08) y=@0002;else y=@0003;
  $  051.数据索引-                      $    $       $    $  ANS002.BYTE006  $  switxh(x1)0x00: y=@0003;0x01: y=@0002;default: y=@0003;
  $  052.儿童锁解锁触发时间标识-        $    $       $    $  ANS002.BYTE007  $  switxh(x1)0x00: y=@0003;0x01: y=@0002;default: y=@0001;
  $  053.触发时间-                      $    $       $    $  ANS002.BYTE008  $  y=SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0198,x2,@0199,x3,@02ab,x4,@0212);
  $  054.数据索引-                      $    $       $    $  ANS002.BYTE012  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7B7 30 01 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
