
    车型ID：320a

    模拟：协议模拟-->320a

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~728

进入命令:

  $~  REQ000:781 02 10 01 00 00 00 00 00       $~  ANS000:728 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:781 02 3E 80 00 00 00 00 00       $!  ANS000:728 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:781 03 19 02 09 00 00 00 00       $#  ANS000:728 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/26000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:781 04 14 FF FF FF 00 00 00       $$  ANS000:728 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:781 03 22 F1 93 00 00 00 00       $%  ANS000:728 03 22 F1 93 00 00 00 00
  $%  REQ001:781 03 22 F1 94 00 00 00 00       $%  ANS001:728 03 22 F1 94 00 00 00 00
  $%  REQ002:781 03 22 F1 95 00 00 00 00       $%  ANS002:728 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:781 03 22 00 02 00 00 00 00       $  ANS000:728 03 22 00 02 00 00 00 00
  $  REQ001:781 03 22 00 0A 00 00 00 00       $  ANS001:728 03 22 00 0A 00 00 00 00
  $  REQ002:781 03 22 00 0D 00 00 00 00       $  ANS002:728 03 22 00 0D 00 00 00 00
  $  REQ003:781 03 22 80 10 00 00 00 00       $  ANS003:728 03 22 80 10 00 00 00 00
  $  REQ004:781 03 22 90 00 00 00 00 00       $  ANS004:728 03 22 90 00 00 00 00 00
  $  REQ005:781 03 22 40 00 00 00 00 00       $  ANS005:728 03 22 40 00 00 00 00 00
  $  REQ006:781 03 22 40 01 00 00 00 00       $  ANS006:728 03 22 40 01 00 00 00 00
  $  REQ007:781 03 22 40 02 00 00 00 00       $  ANS007:728 03 22 40 02 00 00 00 00
  $  REQ008:781 03 22 40 03 00 00 00 00       $  ANS008:728 03 22 40 03 00 00 00 00
  $  REQ009:781 03 22 40 04 00 00 00 00       $  ANS009:728 03 22 40 04 00 00 00 00
  $  REQ010:781 03 22 50 00 00 00 00 00       $  ANS010:728 03 22 50 00 00 00 00 00
  $  REQ011:781 03 22 8A 06 00 00 00 00       $  ANS011:728 03 22 8A 06 00 00 00 00
  $  REQ012:781 03 22 8A 07 00 00 00 00       $  ANS012:728 03 22 8A 07 00 00 00 00
  $  REQ013:781 03 22 20 05 00 00 00 00       $  ANS013:728 03 22 20 05 00 00 00 00
  $  REQ014:781 03 22 20 06 00 00 00 00       $  ANS014:728 03 22 20 06 00 00 00 00
  $  REQ015:781 03 22 20 07 00 00 00 00       $  ANS015:728 03 22 20 07 00 00 00 00
  $  REQ016:781 03 22 20 08 00 00 00 00       $  ANS016:728 03 22 20 08 00 00 00 00

  $  000.序列号                                    $    $          $    $  ANS000.BYTE004  $  y=SPRINTF([%02X %02X %02X %02X %02X %02X],x1,x2,x3,x4,x5,x6);
  $  001.已匹配钥匙数                              $    $          $    $  ANS001.BYTE004  $  switxh(x1)0x00: y=@00e5;0x01: y=@00e6;0x02: y=@00e7;0x03: y=@00e8;0x04: y=@00e9;default: y=@0001;
  $  002.内部供电状况                              $    $          $    $  ANS002.BYTE004  $  switxh(x1)0x00: y=@00cb;0xFF: y=@00cc;default: y=@0001;
  $  003.钥匙状态                                  $    $          $    $  ANS002.BYTE007  $  switxh(x1)0x02: y=@00cd;0x03: y=@00ce;0x04: y=@00cf;0x06: y=@00d0;default: y=@0001;
  $  004.钥匙ID                                    $    $          $    $  ANS002.BYTE008  $  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $  005.钥匙序号                                  $    $          $    $  ANS002.BYTE012  $  HEX(x1);
  $  006.左前门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x01) y=@001d;else y=@001e;
  $  007.右前门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x02) y=@001d;else y=@001e;
  $  008.左后门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x04) y=@001d;else y=@001e;
  $  009.右后门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x08) y=@001d;else y=@001e;
  $  010.后背门开关                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x10) y=@001d;else y=@001e;
  $  011.前舱盖状态                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x20) y=@001d;else y=@001e;
  $  012.左前门锁状态                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x40) y=@000a;else y=@0009;
  $  013.左后门锁状态                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x80) y=@000a;else y=@0009;
  $  014.右前门锁状态                              $    $          $    $  ANS003.BYTE005  $  if(x1&0x01) y=@000a;else y=@0009;
  $  015.右后门锁状态                              $    $          $    $  ANS003.BYTE005  $  if(x1&0x02) y=@000a;else y=@0009;
  $  016.行李箱解锁开关状态                        $    $          $    $  ANS003.BYTE005  $  if(x1&0x04) y=@000a;else y=@0009;
  $  017.硬线中控锁闭锁开关状态                    $    $          $    $  ANS003.BYTE005  $  if(x1&0x08) y=@000b;else y=@0003;
  $  018.硬线中控锁解锁开关状态                    $    $          $    $  ANS003.BYTE005  $  if(x1&0x10) y=@000b;else y=@0003;
  $  019.碰撞信号状态(OPWM)                        $    $          $    $  ANS003.BYTE005  $  switxh(x1&0x60)0x00: y=@00a8;0x20: y=@00a9;0x40: y=@00aa;0x60: y=@007b;default: y=@0001;
  $  020.门锁保护状态                              $    $          $    $  ANS003.BYTE006  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@00ab;0x02: y=@00ac;0x03: y=@00ad;default: y=@0001;
  $  021.12V制动信号状态                           $    $          $    $  ANS003.BYTE006  $  if(x1&0x04) y=@0002;else y=@0003;
  $  022.0V制动灯开关状态                          $    $          $    $  ANS003.BYTE006  $  if(x1&0x08) y=@0002;else y=@0003;
  $  023.启动信号1状态                             $    $          $    $  ANS003.BYTE006  $  if(x1&0x10) y=@000b;else y=@009d;
  $  024.启动信号2状态                             $    $          $    $  ANS003.BYTE006  $  if(x1&0x20) y=@000b;else y=@009d;
  $  025.ACC电状态                                 $    $          $    $  ANS003.BYTE006  $  if(x1&0x40) y=@0010;else y=@0012;
  $  026.IG1(点火1)电状态                          $    $          $    $  ANS003.BYTE006  $  if(x1&0x80) y=@0010;else y=@0012;
  $  027.IG2(点火2)电状态                          $    $          $    $  ANS003.BYTE007  $  if(x1&0x01) y=@0010;else y=@0012;
  $  028.IG3(点火3)电状态                          $    $          $    $  ANS003.BYTE007  $  if(x1&0x02) y=@0010;else y=@0012;
  $  029.IG4(点火4)电状态                          $    $          $    $  ANS003.BYTE007  $  if(x1&0x04) y=@0010;else y=@0012;
  $  030.自复位告警开关状态                        $    $          $    $  ANS003.BYTE007  $  if(x1&0x08) y=@000b;else y=@0003;
  $  031.近光灯开关状态                            $    $          $    $  ANS003.BYTE007  $  if(x1&0x20) y=@0002;else y=@0003;
  $  032.主驾安全带未系信号检测                    $    $          $    $  ANS003.BYTE008  $  if(x1&0x20) y=@02ee;else y=@02ef;
  $  033.喇叭开关状态                              $    $          $    $  ANS003.BYTE009  $  if(x1&0x01) y=@000b;else y=@0003;
  $  034.交流充电枪电锁状态                        $    $          $    $  ANS003.BYTE009  $  if(x1&0x02) y=@02db;else y=@02dc;
  $  035.前雨刮HI(高速)档状态                      $    $          $    $  ANS003.BYTE009  $  if(x1&0x04) y=@0002;else y=@0003;
  $  036.前雨刮复位状态                            $    $          $    $  ANS003.BYTE009  $  if(x1&0x08) y=@0002;else y=@0003;
  $  037.转向轴锁配置情况                          $    $          $    $  ANS003.BYTE009  $  if(x1&0x20) y=@00b0;else y=@00b3;
  $  038.驻车辅助系统配置类型                      $    $          $    $  ANS004.BYTE004  $  switxh(x1)0x00: y=@02d6;0x01: y=@02d7;0x02: y=@02d8;0x03: y=@02d9;0x04: y=@02da;default: y=@0001;
  $  039.读取风速                                  $    $  级      $    $  ANS005.BYTE004  $  y=x1&0x0F;
  $  040.读取模式                                  $    $          $    $  ANS005.BYTE004  $  switxh(x1&0xF0)0x00: y=@006d;0x10: y=@006e;0x20: y=@006f;0x30: y=@0070;0x40: y=@0071;0x50: y=@0072;default: y=@0001;
  $  041.读取模式电机位置百分比                    $    $          $    $  ANS005.BYTE005  $  y=x1;
  $  042.压力状态                                  $    $          $    $  ANS005.BYTE008  $  switxh(x1&0x03)0x00: y=@0003;0x01: y=@02df;0x02: y=@02e0;0x03: y=@02cf;default: y=@0001;
  $  043.空调风扇需求档位                          $    $          $    $  ANS005.BYTE008  $  switxh(x1&0x1C)0x00: y=@0003;0x04: y=@001e;0x08: y=@02dd;0x0C: y=@02de;0x10: y=@02cf;default: y=@0001;
  $  044.冷暖电机位置百分比                        $    $          $    $  ANS005.BYTE009  $  y=x1;
  $  045.新风循环电机位置百分比                    $    $          $    $  ANS005.BYTE010  $  y=x1;
  $  046.目标蒸发器温度                            $    $  ℃      $    $  ANS005.BYTE011  $  if((x1>=(0-20))&&(x1<=40)) y=x1;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  047.实际蒸发器温度                            $    $  ℃      $    $  ANS006.BYTE004  $  if((x1>=(0-20))&&(x1<=40)) y=x1;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  048.目标通道温度                              $    $  ℃      $    $  ANS006.BYTE005  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  049.实际主驾吹面通道温度                      $    $  ℃      $    $  ANS006.BYTE006  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  050.实际主驾吹脚通道温度                      $    $  ℃      $    $  ANS006.BYTE007  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  051.工作电源电压                              $    $  V       $    $  ANS006.BYTE008  $  if((x1>=90)&&(x1<=159)) y=SPRINTF([%.1f],x1/10);else if(x1==160) y=@02cd;else if(x1==208) y=@02ce;else y=@0001;
  $  052.BMS(电池管理器)允许空调高压放电状态       $    $          $    $  ANS006.BYTE009  $  switxh(x1&0x03)0x00: y=@0003;0x01: y=@006a;0x02: y=@006b;default: y=@0001;
  $  053.空调高压模块状态                          $    $          $    $  ANS006.BYTE009  $  switxh(x1&0x1C)0x00: y=@02c9;0x04: y=@02ca;0x08: y=@02cb;0x0C: y=@02cc;default: y=@0001;
  $  054.电动压缩机需求占空比                      $    $  %       $    $  ANS006.BYTE010  $  y=x1;
  $  055.蒸发器端电子膨胀阀位置                    $    $  %       $    $  ANS007.BYTE004  $  y=x1;
  $  056.蒸发器出口冷媒温度                        $    $  ℃      $    $  ANS007.BYTE005  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=800)) y=SPRINTF([%.1f],(x2*256+x1)/10);else if(((x2*256+x1)>=65136)&&((x2*256+x1)<=65535)) y=SPRINTF([%.1f],((x2*256+x1)-65536)/10);else if((x2*256+x1)==32764) y=@01e4;else if((x2*256+x1)==32765) y=@01e3;else y=@0001;
  $  057.蒸发器出口压力                            $    $          $    $  ANS007.BYTE007  $  y=SPRINTF([%.1f],(x2*256+x1)*0.01);
  $  058.蒸发器出口冷媒过热度                      $    $  ℃      $    $  ANS007.BYTE009  $  if(x2<0x80) y=SPRINTF([%d],(x2*256+x1)*0.1);else y=SPRINTF([%d],((x2-256)*256+x1)*0.1);
  $  059.电池热管理需求                            $    $          $    $  ANS008.BYTE004  $  if(x1==0) y=@0060;else if(x1==1) y=@02d0;else if(x1==2) y=@02d1;else if(x1==3) y=@02d2;else if(x1==4) y=@02d3;else if(x1==5) y=@02d4;else if(x1==6) y=@02d5;else if(x1==7) y=@004c;else y=@0001;
  $  060.电池热管理实际响应状态                    $    $          $    $  ANS008.BYTE004  $  if(x1==0) y=@001e;else if(x1==1) y=@02d0;else if(x1==2) y=@02d1;else if(x1==3) y=@004b;else if(x1==4) y=@007b;else if(x1==5) y=@007b;else if(x1==6) y=@02d5;else if(x1==7) y=@004c;else y=@0001;
  $  061.板换端电子膨胀阀位置                      $    $  %       $    $  ANS008.BYTE005  $  y=x1;
  $  062.板换出口侧冷却液温度信息                  $    $  ℃      $    $  ANS008.BYTE006  $  if((x1>=0)&&(x1<=90)) y=x1-20;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else y=@0001;
  $  063.空调发送的电池热管理电动水泵占空比        $    $  %       $    $  ANS008.BYTE007  $  y=x1;
  $  064.电池热管理电动水泵反馈转速                $    $  rpm     $    $  ANS008.BYTE008  $  y=SPRINTF([%d],x1*100);
  $  065.采暖目标PTC(辅助加热)水温                 $    $  ℃      $    $  ANS009.BYTE004  $  if((x1>=0)&&(x1<=160)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else y=@0001;
  $  066.当前实际PTC(辅助加热)水温                 $    $  ℃      $    $  ANS009.BYTE005  $  if((x1>=0)&&(x1<=170)) y=x1-50;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else y=@0001;
  $  067.PTC(辅助加热)水加热器目标占空比           $    $  %       $    $  ANS009.BYTE006  $  y=x1;
  $  068.空调采暖电动水泵继电器控制                $    $          $    $  ANS009.BYTE007  $  switxh(x1&0x03)0x00: y=@0003;0x01: y=@002b;0x02: y=@002a;default: y=@0001;
  $  069.电池加热四通阀位置                        $    $          $    $  ANS009.BYTE007  $  if(x1==0) y=@02eb;else if(x1==1) y=@02ec;else if(x1==2) y=@02ed;else if(x1==3) y=@007b;else y=@0001;
  $  070.AVAS(引擎音模拟器)工作状态                $    $          $    $  ANS010.BYTE004  $  if(x1==0) y=@0078;else if(x1==1) y=@0167;else y=@0001;
  $  071.AVAS(引擎音模拟器)开关状态                $    $          $    $  ANS010.BYTE004  $  if(x1==0) y=@00d9;else if(x1==1) y=@001e;else y=@0001;
  $  072.音源类型                                  $    $          $    $  ANS010.BYTE004  $  if(x1==0) y=@02e3;else if(x1==1) y=@02e4;else if(x1==2) y=@02e5;else if(x1==3) y=@02e6;else y=@0001;
  $  073.音源可调                                  $    $          $    $  ANS010.BYTE004  $  if(x1==0) y=@02e1;else if(x1==1) y=@02e2;else y=@0001;
  $  074.法规类型                                  $    $          $    $  ANS010.BYTE004  $  if(x1==0) y=@00d1;else if(x1==1) y=@00d2;else if(x1==2) y=@00d3;else if(x1==3) y=@00d4;else y=@0001;
  $  075.遥控升降窗命令/数据标识                   $    $          $    $  ANS011.BYTE004  $  if(x1==23) y=@02e9;else y=@02ea;
  $  076.遥控降窗                                  $    $          $    $  ANS011.BYTE005  $  if(x1==1) y=@02e8;else if(x1==0) y=@0003;else y=@0001;
  $  077.遥控升窗                                  $    $          $    $  ANS011.BYTE005  $  if(x1==1) y=@02e7;else if(x1==0) y=@0003;else y=@0001;
  $  078.发生事件点/月                             $    $          $    $  ANS011.BYTE006  $  y=SPRINTF([%02d%s],x1,@0198);
  $  079.发生事件点/日                             $    $          $    $  ANS011.BYTE007  $  y=SPRINTF([%02d%s],x1,@0199);
  $  080.发生事件点/时                             $    $          $    $  ANS011.BYTE008  $  y=SPRINTF([%02d%s],x1,@02ab);
  $  081.发生事件点/分                             $    $          $    $  ANS011.BYTE009  $  y=SPRINTF([%02d%s],x1,@0212);
  $  082.数据索引                                  $    $          $    $  ANS011.BYTE010  $  y=x1;
  $  083.数据标识                                  $    $          $    $  ANS012.BYTE004  $  if(x1==34) y=@02aa;else y=@0092;
  $  084.IG3(点火3)继电器断开原因                  $    $          $    $  ANS012.BYTE005  $  if(x1==1) y=@02ac;else if(x1==0) y=@0003;else if(x1==2) y=@02ad;else if(x1==3) y=@02ae;else if(x1==4) y=@02af;else if(x1==5) y=@02b0;else if(x1==6) y=@02b1;else if(x1==7) y=@02b2;else if(x1==8) y=@02b3;else if(x1==9) y=@02b4;else if(x1==10) y=@02b5;else if(x1==11) y=@02b6;else if(x1==12) y=@02b7;else if(x1==13) y=@02b8;else if(x1==14) y=@02b9;else if(x1==15) y=@02ba;else if(x1==16) y=@02bb;else if(x1==17) y=@02bc;else if(x1==18) y=@02bd;else if(x1==19) y=@02be;else if(x1==20) y=@02bf;else y=@0001;
  $  085.IG3(点火3)继电器断开时间点                $    $          $    $  ANS012.BYTE006  $  y=SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0198,x2,@0199,x3,@02ab,x4,@0212);
  $  086.数据索引                                  $    $          $    $  ANS012.BYTE010  $  y=x1;
  $  087.车型颜色                                  $    $          $    $  ANS013.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@00b4;else if(x1==2) y=@00b5;else if(x1==3) y=@00b6;else if(x1==4) y=@00b7;else if(x1==5) y=@00b8;else if(x1==6) y=@00b9;else if(x1==7) y=@00ba;else if(x1==8) y=@00bb;else if(x1==9) y=@00bc;else if(x1==10) y=@00bd;else if(x1==11) y=@00be;else if(x1==12) y=@00bf;else if(x1==13) y=@00c0;else if(x1==14) y=@00c1;else if(x1==15) y=@00c2;else if(x1==16) y=@00c3;else if(x1==17) y=@00c4;else if(x1==18) y=@00c5;else if(x1==19) y=@00c6;else if(x1==20) y=@00c7;else if(x1==21) y=@00c8;else y=@0001;
  $  088.车顶行李架                                $    $          $    $  ANS014.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@00b0;else if(x1==2) y=@00b3;else if(x1==3) y=@007b;else y=@0001;
  $  089.外置天线                                  $    $          $    $  ANS015.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@00b0;else if(x1==2) y=@00b3;else if(x1==3) y=@007b;else y=@0001;
  $  090.天窗                                      $    $          $    $  ANS016.BYTE004  $  if(x1==0) y=@0003;else if(x1==1) y=@00b0;else if(x1==2) y=@00b1;else if(x1==3) y=@00b2;else y=@0001;

  $)  01.报警记录
  $  01.报警记录
  $  REQ000:781 03 22 8A 00 00 00 00 00       $  ANS000:728 03 22 8A 00 00 00 00 00

  $  000.报警记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  001.报警记录1-主驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.报警记录1-副驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.报警记录1-左后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.报警记录1-右后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.报警记录1-行李箱盖                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.报警记录1-IG1(点火1)电               $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.报警记录1-蓄电池掉电触发             $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  008.报警记录1-主驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  009.报警记录1-左后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  010.报警记录1-副驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  011.报警记录1-右后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  012.报警记录1-前舱盖                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  013.报警记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  014.报警记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  015.报警记录2-主驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  016.报警记录2-副驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  017.报警记录2-左后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  018.报警记录2-右后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  019.报警记录2-行李箱盖                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  020.报警记录2-IG1(点火1)电               $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  021.报警记录2-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  022.报警记录2-主驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.报警记录2-左后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.报警记录2-副驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.报警记录2-右后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  026.报警记录2-前舱盖                     $    $       $    $  ANS000.BYTE010  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  027.报警记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  028.报警记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  029.报警记录3-主驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  030.报警记录3-副驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  031.报警记录3-左后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  032.报警记录3-右后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  033.报警记录3-行李箱盖                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  034.报警记录3-IG1(点火1)电               $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  035.报警记录3-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  036.报警记录3-主驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  037.报警记录3-左后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  038.报警记录3-副驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  039.报警记录3-右后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  040.报警记录3-前舱盖                     $    $       $    $  ANS000.BYTE014  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  041.报警记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  042.报警记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  043.报警记录4-主驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  044.报警记录4-副驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  045.报警记录4-左后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  046.报警记录4-右后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  047.报警记录4-行李箱盖                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  048.报警记录4-IG1(点火1)电               $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  049.报警记录4-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  050.报警记录4-主驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  051.报警记录4-左后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  052.报警记录4-副驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  053.报警记录4-右后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  054.报警记录4-前舱盖                     $    $       $    $  ANS000.BYTE018  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  055.报警记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  056.报警记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  057.报警记录5-主驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  058.报警记录5-副驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  059.报警记录5-左后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  060.报警记录5-右后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  061.报警记录5-行李箱盖                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  062.报警记录5-IG1(点火1)电               $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  063.报警记录5-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  064.报警记录5-主驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  065.报警记录5-左后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  066.报警记录5-副驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  067.报警记录5-右后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  068.报警记录5-前舱盖                     $    $       $    $  ANS000.BYTE022  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  069.报警记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  070.报警记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  071.报警记录6-主驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  072.报警记录6-副驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  073.报警记录6-左后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  074.报警记录6-右后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  075.报警记录6-行李箱盖                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  076.报警记录6-IG1(点火1)电               $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  077.报警记录6-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  078.报警记录6-主驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  079.报警记录6-左后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  080.报警记录6-副驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  081.报警记录6-右后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  082.报警记录6-前舱盖                     $    $       $    $  ANS000.BYTE026  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  083.报警记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  084.报警记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  085.报警记录7-主驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  086.报警记录7-副驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  087.报警记录7-左后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  088.报警记录7-右后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  089.报警记录7-行李箱盖                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  090.报警记录7-IG1(点火1)电               $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  091.报警记录7-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  092.报警记录7-主驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  093.报警记录7-左后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  094.报警记录7-副驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  095.报警记录7-右后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  096.报警记录7-前舱盖                     $    $       $    $  ANS000.BYTE030  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  097.报警记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  098.报警记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x11: y=@02a9;default: y=@0092;
  $  099.报警记录8-主驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  100.报警记录8-副驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  101.报警记录8-左后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  102.报警记录8-右后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  103.报警记录8-行李箱盖                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  104.报警记录8-IG1(点火1)电               $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  105.报警记录8-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  106.报警记录8-主驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  107.报警记录8-左后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  108.报警记录8-副驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  109.报警记录8-右后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  110.报警记录8-前舱盖                     $    $       $    $  ANS000.BYTE034  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  111.报警记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.闭锁记录
  $  02.闭锁记录
  $  REQ000:781 03 22 8A 01 00 00 00 00       $  ANS000:728 03 22 8A 01 00 00 00 00

  $  000.闭锁记录1-记录有效性               $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  001.闭锁记录1-副驶中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.闭锁记录1-主驾中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.闭锁记录1-遥控                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.闭锁记录1-超速                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.闭锁记录1-自动返回防盗             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.闭锁记录1-左前门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.闭锁记录1-右前门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  008.闭锁记录1-后背门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  009.闭锁记录1-远程控制                 $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  010.闭锁记录1-自动设定防盗             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  011.闭锁记录1-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  012.闭锁记录1-数据索引                 $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013.闭锁记录2-记录有效性               $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  014.闭锁记录2-副驶中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  015.闭锁记录2-主驾中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  016.闭锁记录2-遥控                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  017.闭锁记录2-超速                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  018.闭锁记录2-自动返回防盗             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  019.闭锁记录2-左前门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  020.闭锁记录2-右前门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  021.闭锁记录2-后背门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  022.闭锁记录2-远程控制                 $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.闭锁记录2-自动设定防盗             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.闭锁记录2-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.闭锁记录2-数据索引                 $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026.闭锁记录3-记录有效性               $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  027.闭锁记录3-副驶中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  028.闭锁记录3-主驾中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  029.闭锁记录3-遥控                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  030.闭锁记录3-超速                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  031.闭锁记录3-自动返回防盗             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  032.闭锁记录3-左前门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  033.闭锁记录3-右前门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  034.闭锁记录3-后背门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  035.闭锁记录3-远程控制                 $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  036.闭锁记录3-自动设定防盗             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  037.闭锁记录3-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  038.闭锁记录3-数据索引                 $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039.闭锁记录4-记录有效性               $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  040.闭锁记录4-副驶中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  041.闭锁记录4-主驾中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  042.闭锁记录4-遥控                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  043.闭锁记录4-超速                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  044.闭锁记录4-自动返回防盗             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  045.闭锁记录4-左前门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  046.闭锁记录4-右前门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  047.闭锁记录4-后背门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  048.闭锁记录4-远程控制                 $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  049.闭锁记录4-自动设定防盗             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  050.闭锁记录4-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  051.闭锁记录4-数据索引                 $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052.闭锁记录5-记录有效性               $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  053.闭锁记录5-副驶中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  054.闭锁记录5-主驾中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  055.闭锁记录5-遥控                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  056.闭锁记录5-超速                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  057.闭锁记录5-自动返回防盗             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  058.闭锁记录5-左前门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  059.闭锁记录5-右前门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  060.闭锁记录5-后背门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  061.闭锁记录5-远程控制                 $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  062.闭锁记录5-自动设定防盗             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  063.闭锁记录5-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  064.闭锁记录5-数据索引                 $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065.闭锁记录6-记录有效性               $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  066.闭锁记录6-副驶中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  067.闭锁记录6-主驾中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  068.闭锁记录6-遥控                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  069.闭锁记录6-超速                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  070.闭锁记录6-自动返回防盗             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  071.闭锁记录6-左前门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  072.闭锁记录6-右前门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  073.闭锁记录6-后背门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  074.闭锁记录6-远程控制                 $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  075.闭锁记录6-自动设定防盗             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  076.闭锁记录6-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  077.闭锁记录6-数据索引                 $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078.闭锁记录7-记录有效性               $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  079.闭锁记录7-副驶中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  080.闭锁记录7-主驾中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  081.闭锁记录7-遥控                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  082.闭锁记录7-超速                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  083.闭锁记录7-自动返回防盗             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  084.闭锁记录7-左前门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  085.闭锁记录7-右前门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  086.闭锁记录7-后背门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  087.闭锁记录7-远程控制                 $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  088.闭锁记录7-自动设定防盗             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  089.闭锁记录7-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  090.闭锁记录7-数据索引                 $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091.闭锁记录8-记录有效性               $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x12: y=@02c5;default: y=@0092;
  $  092.闭锁记录8-副驶中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  093.闭锁记录8-主驾中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  094.闭锁记录8-遥控                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  095.闭锁记录8-超速                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  096.闭锁记录8-自动返回防盗             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  097.闭锁记录8-左前门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  098.闭锁记录8-右前门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  099.闭锁记录8-后背门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  100.闭锁记录8-远程控制                 $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  101.闭锁记录8-自动设定防盗             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  102.闭锁记录8-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  103.闭锁记录8-数据索引                 $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.解锁记录
  $  03.解锁记录
  $  REQ000:781 03 22 8A 02 00 00 00 00       $  ANS000:728 03 22 8A 02 00 00 00 00

  $  000.解锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  001.解锁记录1-副驶中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.解锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.解锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.解锁记录1-退电                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.解锁记录1-碰撞信号             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.解锁记录1-钥匙在车内           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.解锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  008.解锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  009.解锁记录1-锁定防止             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  010.解锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  011.解锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  012.解锁记录1-硬线碰撞信号         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  013.解锁记录1-CAN线碰撞信号        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  014.解锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  015.解锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  016.解锁记录2-副驶中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  017.解锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  018.解锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  019.解锁记录2-退电                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  020.解锁记录2-碰撞信号             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  021.解锁记录2-钥匙在车内           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  022.解锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  023.解锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  024.解锁记录2-锁定防止             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  025.解锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  026.解锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  027.解锁记录2-硬线碰撞信号         $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  028.解锁记录2-CAN线碰撞信号        $    $       $    $  ANS000.BYTE010  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  029.解锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  030.解锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  031.解锁记录3-副驶中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  032.解锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  033.解锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  034.解锁记录3-退电                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  035.解锁记录3-碰撞信号             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  036.解锁记录3-钥匙在车内           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  037.解锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  038.解锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  039.解锁记录3-锁定防止             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  040.解锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  041.解锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  042.解锁记录3-硬线碰撞信号         $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  043.解锁记录3-CAN线碰撞信号        $    $       $    $  ANS000.BYTE014  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  044.解锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  045.解锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  046.解锁记录4-副驶中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  047.解锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  048.解锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  049.解锁记录4-退电                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  050.解锁记录4-碰撞信号             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  051.解锁记录4-钥匙在车内           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  052.解锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  053.解锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  054.解锁记录4-锁定防止             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  055.解锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  056.解锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  057.解锁记录4-硬线碰撞信号         $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  058.解锁记录4-CAN线碰撞信号        $    $       $    $  ANS000.BYTE018  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  059.解锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  060.解锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  061.解锁记录5-副驶中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  062.解锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  063.解锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  064.解锁记录5-退电                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  065.解锁记录5-碰撞信号             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  066.解锁记录5-钥匙在车内           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  067.解锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  068.解锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  069.解锁记录5-锁定防止             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  070.解锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  071.解锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  072.解锁记录5-硬线碰撞信号         $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  073.解锁记录5-CAN线碰撞信号        $    $       $    $  ANS000.BYTE022  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  074.解锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  075.解锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  076.解锁记录6-副驶中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  077.解锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  078.解锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  079.解锁记录6-退电                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  080.解锁记录6-碰撞信号             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  081.解锁记录6-钥匙在车内           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  082.解锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  083.解锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  084.解锁记录6-锁定防止             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  085.解锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  086.解锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  087.解锁记录6-硬线碰撞信号         $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  088.解锁记录6-CAN线碰撞信号        $    $       $    $  ANS000.BYTE026  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  089.解锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  090.解锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  091.解锁记录7-副驶中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  092.解锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  093.解锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  094.解锁记录7-退电                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  095.解锁记录7-碰撞信号             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  096.解锁记录7-钥匙在车内           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  097.解锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  098.解锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  099.解锁记录7-锁定防止             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  100.解锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  101.解锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  102.解锁记录7-硬线碰撞信号         $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  103.解锁记录7-CAN线碰撞信号        $    $       $    $  ANS000.BYTE030  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  104.解锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  105.解锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x13: y=@02c4;default: y=@0092;
  $  106.解锁记录8-副驶中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  107.解锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  108.解锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  109.解锁记录8-退电                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  110.解锁记录8-碰撞信号             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  111.解锁记录8-钥匙在车内           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  112.解锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  113.解锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  114.解锁记录8-锁定防止             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  115.解锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  116.解锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  117.解锁记录8-硬线碰撞信号         $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  118.解锁记录8-CAN线碰撞信号        $    $       $    $  ANS000.BYTE034  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  119.解锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.行李箱解锁记录
  $  04.行李箱解锁记录
  $  REQ000:781 03 22 8A 03 00 00 00 00       $  ANS000:728 03 22 8A 03 00 00 00 00

  $  000.行李箱解锁记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  001.行李箱解锁记录1-遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.行李箱解锁记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007.行李箱解锁记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  008.行李箱解锁记录2-遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  009.行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  010.行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  011.行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  012.行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  013.行李箱解锁记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014.行李箱解锁记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  015.行李箱解锁记录3-遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  016.行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  017.行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  018.行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  019.行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  020.行李箱解锁记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021.行李箱解锁记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  022.行李箱解锁记录4-遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  026.行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  027.行李箱解锁记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028.行李箱解锁记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  029.行李箱解锁记录5-遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  030.行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  031.行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  032.行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  033.行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  034.行李箱解锁记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035.行李箱解锁记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  036.行李箱解锁记录6-遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  037.行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  038.行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  039.行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  040.行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  041.行李箱解锁记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042.行李箱解锁记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  043.行李箱解锁记录7-遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  044.行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  045.行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  046.行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  047.行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  048.行李箱解锁记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049.行李箱解锁记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x14: y=@02c4;default: y=@0092;
  $  050.行李箱解锁记录8-遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  051.行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  052.行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  053.行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  054.行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  055.行李箱解锁记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.启动失败记录
  $  05.启动失败记录
  $  REQ000:781 03 22 8A 04 00 00 00 00       $  ANS000:728 03 22 8A 04 00 00 00 00

  $  000.启动失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  001.启动失败记录1-启动失败原因       $    $       $    $  ANS000.BYTE005  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  002.启动失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.启动失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  004.启动失败记录2-启动失败原因       $    $       $    $  ANS000.BYTE009  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  005.启动失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.启动失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  007.启动失败记录3-启动失败原因       $    $       $    $  ANS000.BYTE013  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  008.启动失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.启动失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  010.启动失败记录4-启动失败原因       $    $       $    $  ANS000.BYTE017  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  011.启动失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.启动失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  013.启动失败记录5-启动失败原因       $    $       $    $  ANS000.BYTE021  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  014.启动失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.启动失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  016.启动失败记录6-启动失败原因       $    $       $    $  ANS000.BYTE025  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  017.启动失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.启动失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  019.启动失败记录7-启动失败原因       $    $       $    $  ANS000.BYTE029  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  020.启动失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.启动失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x15: y=@02c8;default: y=@0092;
  $  022.启动失败记录8-启动失败原因       $    $       $    $  ANS000.BYTE033  $  switxh(x1)0x00: y=@0003;0x01: y=@0094;0x02: y=@0095;0x03: y=@02c1;0x04: y=@0096;0x05: y=@0097;0x06: y=@008d;0x07: y=@0098;0x08: y=@0099;0x09: y=@009a;0x0A: y=@009b;0x0B: y=@009c;0x0C: y=@007b;0x0D: y=@02c7;default: y=@0001;
  $  023.启动失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.退电失败记录
  $  06.退电失败记录
  $  REQ000:781 03 22 8A 05 00 00 00 00       $  ANS000:728 03 22 8A 05 00 00 00 00

  $  000.退电失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  001.退电失败记录1-退电失败原因       $    $       $    $  ANS000.BYTE005  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  002.退电失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.退电失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  004.退电失败记录2-退电失败原因       $    $       $    $  ANS000.BYTE009  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  005.退电失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.退电失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  007.退电失败记录3-退电失败原因       $    $       $    $  ANS000.BYTE013  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  008.退电失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.退电失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  010.退电失败记录4-退电失败原因       $    $       $    $  ANS000.BYTE017  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  011.退电失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.退电失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  013.退电失败记录5-退电失败原因       $    $       $    $  ANS000.BYTE021  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  014.退电失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.退电失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  016.退电失败记录6-退电失败原因       $    $       $    $  ANS000.BYTE025  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  017.退电失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.退电失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  019.退电失败记录7-退电失败原因       $    $       $    $  ANS000.BYTE029  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  020.退电失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.退电失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x16: y=@02c6;default: y=@0092;
  $  022.退电失败记录8-退电失败原因       $    $       $    $  ANS000.BYTE033  $  switxh(x1)0x00: y=@0003;0x01: y=@02c0;0x02: y=@02c1;0x03: y=@008d;0x04: y=@02c2;0x05: y=@02c3;0x06: y=@0090;default: y=@0001;
  $  023.退电失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:781 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
