
    车型ID：3b5b

    模拟：协议模拟-->3b5b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7FA

进入命令:

  $~  REQ000:7F2 02 10 01 00 00 00 00 00       $~  ANS000:7FA 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7F2 02 3E 80 00 00 00 00 00       $!  ANS000:7FA 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7F2 03 19 02 09 00 00 00 00       $#  ANS000:7FA 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/19000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7F2 04 14 FF FF FF 00 00 00       $$  ANS000:7FA 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7F2 03 22 F1 93 00 00 00 00       $%  ANS000:7FA 03 22 F1 93 00 00 00 00
  $%  REQ001:7F2 03 22 F1 94 00 00 00 00       $%  ANS001:7FA 03 22 F1 94 00 00 00 00
  $%  REQ002:7F2 03 22 F1 95 00 00 00 00       $%  ANS002:7FA 03 22 F1 95 00 00 00 00
  $%  REQ003:7F2 03 22 F1 80 00 00 00 00       $%  ANS003:7FA 03 22 F1 80 00 00 00 00
  $%  REQ004:7F2 03 22 FF 94 00 00 00 00       $%  ANS004:7FA 03 22 FF 94 00 00 00 00
  $%  REQ005:7F2 03 22 FF 95 00 00 00 00       $%  ANS005:7FA 03 22 FF 95 00 00 00 00
  $%  REQ006:7F2 03 22 FF 96 00 00 00 00       $%  ANS006:7FA 03 22 FF 96 00 00 00 00
  $%  REQ007:7F2 03 22 FF 97 00 00 00 00       $%  ANS007:7FA 03 22 FF 97 00 00 00 00

  $%  000:硬件版本:                           $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:                           $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:                           $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:                           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:                           $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:                           $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:引导程序软件版本号/日期(年):        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02d%s%02d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  007:软件版本:                           $%    $%  ANS003.BYTE007  $%  y=SPRINTF([%d.%d.%d.],x1,x2,x3);
  $%  008:日期:                               $%    $%  ANS003.BYTE010  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  009:软件编号:                           $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  010:软件版本:                           $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  011:软件日期:                           $%    $%  ANS005.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  012:修改次数:                           $%    $%  ANS005.BYTE009  $%  y=x1;
  $%  013:格式版本:                           $%    $%  ANS006.BYTE004  $%  HEX(x1,x2);
  $%  014:数据集状态:                         $%    $%  ANS007.BYTE004  $%  if(x1==0) y=@0049;else if(x1==1) y=@0631;else if(x1==2) y=@0632;else if(x1==3) y=@0633;else y=@0001;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7F2 03 22 01 03 00 00 00 00       $  ANS000:7FA 03 22 01 03 00 00 00 00
  $  REQ001:7F2 03 22 02 85 00 00 00 00       $  ANS001:7FA 03 22 02 85 00 00 00 00
  $  REQ002:7F2 03 22 02 8D 00 00 00 00       $  ANS002:7FA 03 22 02 8D 00 00 00 00
  $  REQ003:7F2 03 22 10 11 00 00 00 00       $  ANS003:7FA 03 22 10 11 00 00 00 00
  $  REQ004:7F2 03 22 10 12 00 00 00 00       $  ANS004:7FA 03 22 10 12 00 00 00 00
  $  REQ005:7F2 03 22 12 34 00 00 00 00       $  ANS005:7FA 03 22 12 34 00 00 00 00
  $  REQ006:7F2 03 22 F1 A1 00 00 00 00       $  ANS006:7FA 03 22 F1 A1 00 00 00 00

  $  000.无效密钥计数                      $    $           $    $  ANS000.BYTE004  $  y=x1;
  $  001.电源电压                          $    $  V        $    $  ANS001.BYTE004  $  y=SPRINTF([%.1f],x1*0.1);
  $  002.ECU温度                           $    $  ℃       $    $  ANS002.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],x1+50);else y=SPRINTF([%d],(x1-256)+50);
  $  003.车速                              $    $  m/s      $    $  ANS003.BYTE004  $  y=SPRINTF([%.2f],(x1*256+x2)*0.01);
  $  004.加速度                            $    $  m/s2     $    $  ANS004.BYTE004  $  y=SPRINTF([%.2f],((x1*256+x2)-25)*0.01);
  $  005.MRR(自适应巡航系统)校准状态       $    $           $    $  ANS005.BYTE004  $  switxh(x1)0x00: y=@03dd;0x01: y=@030b;default: y=@0001;
  $  006.配置读取协议                      $    $           $    $  ANS006.BYTE004  $  HEX(x1,x2,x3,x4,x5,x6,x7,x8);

  $)  01.AEB数据流
  $  01.AEB数据流
  $  REQ000:7F2 03 22 34 0C 00 00 00 00       $  ANS000:7FA 03 22 34 0C 00 00 00 00
  $  REQ001:7F2 03 22 34 0D 00 00 00 00       $  ANS001:7FA 03 22 34 0D 00 00 00 00
  $  REQ002:7F2 03 22 34 0E 00 00 00 00       $  ANS002:7FA 03 22 34 0E 00 00 00 00
  $  REQ003:7F2 03 22 34 0F 00 00 00 00       $  ANS003:7FA 03 22 34 0F 00 00 00 00
  $  REQ004:7F2 03 22 34 25 00 00 00 00       $  ANS004:7FA 03 22 34 25 00 00 00 00
  $  REQ005:7F2 03 22 34 26 00 00 00 00       $  ANS005:7FA 03 22 34 26 00 00 00 00
  $  REQ006:7F2 03 22 34 27 00 00 00 00       $  ANS006:7FA 03 22 34 27 00 00 00 00
  $  REQ007:7F2 03 22 34 28 00 00 00 00       $  ANS007:7FA 03 22 34 28 00 00 00 00
  $  REQ008:7F2 03 22 34 29 00 00 00 00       $  ANS008:7FA 03 22 34 29 00 00 00 00
  $  REQ009:7F2 03 22 34 30 00 00 00 00       $  ANS009:7FA 03 22 34 30 00 00 00 00
  $  REQ010:7F2 03 22 34 31 00 00 00 00       $  ANS010:7FA 03 22 34 31 00 00 00 00

  $  000.AEB-M针对静止物体的启动次数          $    $       $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.EBA启动次数                          $    $       $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  002.AEB-M针对静止物体的启动次数          $    $       $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.AEB-M针对移动物体的启动次数          $    $       $    $  ANS003.BYTE004  $  y=(x1*256+x2);
  $  004.预报警针对静止物体的启动次数         $    $       $    $  ANS004.BYTE004  $  y=(x1*256+x2);
  $  005.预报警针对移动物体的启动次数         $    $       $    $  ANS005.BYTE004  $  y=(x1*256+x2);
  $  006.紧急报警针对静止物体的启动次数       $    $       $    $  ANS006.BYTE004  $  y=(x1*256+x2);
  $  007.紧急报警针对移动物体的启动次数       $    $       $    $  ANS007.BYTE004  $  y=(x1*256+x2);
  $  008.AEB-P针对静止物体的启动次数          $    $       $    $  ANS008.BYTE004  $  y=(x1*256+x2);
  $  009.行人保护预报警的启动次数             $    $       $    $  ANS009.BYTE004  $  y=(x1*256+x2);
  $  010.行人保护AEB的启动次数                $    $       $    $  ANS010.BYTE004  $  y=(x1*256+x2);

  $)  02.倒数第二次的预报警情况记录
  $  02.倒数第二次的预报警情况记录
  $  REQ000:7F2 03 22 34 10 00 00 00 00       $  ANS000:7FA 03 22 34 10 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  03.最近一次的预报警情况记录
  $  03.最近一次的预报警情况记录
  $  REQ000:7F2 03 22 34 11 00 00 00 00       $  ANS000:7FA 03 22 34 11 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  04.倒数第三次的预报警情况记录
  $  04.倒数第三次的预报警情况记录
  $  REQ000:7F2 03 22 34 1A 00 00 00 00       $  ANS000:7FA 03 22 34 1A 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  05.倒数第二次的紧急报警情况记录
  $  05.倒数第二次的紧急报警情况记录
  $  REQ000:7F2 03 22 34 12 00 00 00 00       $  ANS000:7FA 03 22 34 12 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  06.最近一次的紧急报警情况记录
  $  06.最近一次的紧急报警情况记录
  $  REQ000:7F2 03 22 34 13 00 00 00 00       $  ANS000:7FA 03 22 34 13 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  07.倒数第三次的紧急报警情况记录
  $  07.倒数第三次的紧急报警情况记录
  $  REQ000:7F2 03 22 34 1B 00 00 00 00       $  ANS000:7FA 03 22 34 1B 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  08.倒数第二次的EBA报警情况记录
  $  08.倒数第二次的EBA报警情况记录
  $  REQ000:7F2 03 22 34 14 00 00 00 00       $  ANS000:7FA 03 22 34 14 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  09.最近一次的EBA报警情况记录
  $  09.最近一次的EBA报警情况记录
  $  REQ000:7F2 03 22 34 15 00 00 00 00       $  ANS000:7FA 03 22 34 15 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  10.倒数第三次的EBA报警情况记录
  $  10.倒数第三次的EBA报警情况记录
  $  REQ000:7F2 03 22 34 1C 00 00 00 00       $  ANS000:7FA 03 22 34 1C 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  11.倒数第二次的AEB-P报警情况记录
  $  11.倒数第二次的AEB-P报警情况记录
  $  REQ000:7F2 03 22 34 16 00 00 00 00       $  ANS000:7FA 03 22 34 16 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  12.最近一次的AEB-P报警情况记录
  $  12.最近一次的AEB-P报警情况记录
  $  REQ000:7F2 03 22 34 17 00 00 00 00       $  ANS000:7FA 03 22 34 17 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  13.倒数第三次的AEB-P报警情况记录
  $  13.倒数第三次的AEB-P报警情况记录
  $  REQ000:7F2 03 22 34 1D 00 00 00 00       $  ANS000:7FA 03 22 34 1D 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  14.倒数第二次的AEB-M报警情况记录
  $  14.倒数第二次的AEB-M报警情况记录
  $  REQ000:7F2 03 22 34 18 00 00 00 00       $  ANS000:7FA 03 22 34 18 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  15.最近一次的AEB-M报警情况记录
  $  15.最近一次的AEB-M报警情况记录
  $  REQ000:7F2 03 22 34 19 00 00 00 00       $  ANS000:7FA 03 22 34 19 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  16.倒数第三次的AEB-M报警情况记录
  $  16.倒数第三次的AEB-M报警情况记录
  $  REQ000:7F2 03 22 34 1E 00 00 00 00       $  ANS000:7FA 03 22 34 1E 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  17.倒数第二次行人保护预报警情况记录
  $  17.倒数第二次行人保护预报警情况记录
  $  REQ000:7F2 03 22 34 32 00 00 00 00       $  ANS000:7FA 03 22 34 32 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  18.最近一次行人保护预报警情况记录
  $  18.最近一次行人保护预报警情况记录
  $  REQ000:7F2 03 22 34 33 00 00 00 00       $  ANS000:7FA 03 22 34 33 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  19.倒数第三次行人保护预报警情况记录
  $  19.倒数第三次行人保护预报警情况记录
  $  REQ000:7F2 03 22 34 34 00 00 00 00       $  ANS000:7FA 03 22 34 34 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  20.倒数第二次行人保护AEB情况记录
  $  20.倒数第二次行人保护AEB情况记录
  $  REQ000:7F2 03 22 34 35 00 00 00 00       $  ANS000:7FA 03 22 34 35 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  21.最近一次行人保护AEB情况记录
  $  21.最近一次行人保护AEB情况记录
  $  REQ000:7F2 03 22 34 36 00 00 00 00       $  ANS000:7FA 03 22 34 36 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  22.倒数第三次行人保护AEB情况记录
  $  22.倒数第三次行人保护AEB情况记录
  $  REQ000:7F2 03 22 34 37 00 00 00 00       $  ANS000:7FA 03 22 34 37 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  23.倒数第二次自行车部分制动情况记录
  $  23.倒数第二次自行车部分制动情况记录
  $  REQ000:7F2 03 22 34 43 00 00 00 00       $  ANS000:7FA 03 22 34 43 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  24.最近一次自行车部分制动情况记录
  $  24.最近一次自行车部分制动情况记录
  $  REQ000:7F2 03 22 34 44 00 00 00 00       $  ANS000:7FA 03 22 34 44 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  25.倒数第三次自行车部分制动情况记录
  $  25.倒数第三次自行车部分制动情况记录
  $  REQ000:7F2 03 22 34 45 00 00 00 00       $  ANS000:7FA 03 22 34 45 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  26.倒数第二次行车保护AEB情况记录
  $  26.倒数第二次行车保护AEB情况记录
  $  REQ000:7F2 03 22 34 46 00 00 00 00       $  ANS000:7FA 03 22 34 46 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  27.最近一次行车保护AEB情况记录
  $  27.最近一次行车保护AEB情况记录
  $  REQ000:7F2 03 22 34 47 00 00 00 00       $  ANS000:7FA 03 22 34 47 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

  $)  28.倒数第三次行车保护AEB情况记录
  $  28.倒数第三次行车保护AEB情况记录
  $  REQ000:7F2 03 22 34 48 00 00 00 00       $  ANS000:7FA 03 22 34 48 00 00 00 00

  $  000.事件发生时间                                                       $    $            $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                                 $    $            $    $  ANS000.BYTE008  $  if((x1&0x38)==0x00) y=@062c;else if((x1&0x38)==0x08) y=@062d;else if((x1&0x38)==0x10) y=@062e;else if((x1&0x38)==0x18) y=@062f;else if((x1&0x38)==0x20) y=@0630;else y=@0001;
  $  002.油门踏板开度                                                       $    $  %         $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                           $    $  bar       $    $  ANS000.BYTE010  $  y=x1;
  $  004.方向盘转角                                                         $    $  deg       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                     $    $  deg/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                       $    $  m/s       $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE014  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  008.车辆侧向加速度                                                     $    $  m/s2      $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角                                                         $    $  deg       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                                 $    $  m         $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                                 $    $  m         $    $  ANS000.BYTE018  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  012.与目标车辆相对纵向速度                                             $    $  m/s       $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                             $    $  m/s       $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                           $    $  m/s2      $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                           $    $  m/s2      $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                     $    $  %         $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                       $    $  bar       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                                   $    $  deg       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                     $    $  %         $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                       $    $  bar       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                                   $    $  deg       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                               $    $  deg/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                                   $    $  m/s2      $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                                   $    $  m/s2      $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                     $    $  s         $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                       $    $  m/s       $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                       $    $  m/s       $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x80)==0x00) y=@0181;else if((x1&0x80)==0x80) y=@00f2;else y=@0001;
  $  032.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE038  $  if((x1&0x40)==0x00) y=@0181;else if((x1&0x40)==0x40) y=@00f2;else y=@0001;
  $  033.事件发生时，车辆的行驶里程                                         $    $  km        $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                           $    $  m         $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离           $    $  m         $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间               $    $  s         $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);
  $  037.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE044  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  038.从fgs锁定目标，到功能触发，fgs目标的高度的最大值                   $    $  m         $    $  ANS000.BYTE045  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  039.事件发生时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE046  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  040.事件结束时，目标的高度值                                           $    $  m         $    $  ANS000.BYTE047  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  041.事件发生时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE048  $  y=SPRINTF([%.2f],x1*0.01);
  $  042.事件结束时，目标是可靠障碍物的概率                                 $    $            $    $  ANS000.BYTE049  $  y=SPRINTF([%.2f],x1*0.01);
  $  043.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最大值       $    $            $    $  ANS000.BYTE050  $  y=SPRINTF([%.2f],x1*0.01);
  $  044.从fgs锁定目标，到功能触发，fgs目标是可靠障碍物的概率的最小值       $    $            $    $  ANS000.BYTE051  $  y=SPRINTF([%.2f],x1*0.01);
  $  045.事件发生时，目标存在的概率                                         $    $            $    $  ANS000.BYTE052  $  y=SPRINTF([%.2f],x1*0.01);
  $  046.事件结束时，目标的存在概率                                         $    $            $    $  ANS000.BYTE053  $  y=SPRINTF([%.2f],x1*0.01);
  $  047.从fgs锁定目标，到功能触发，fgs目标存在的概率的最大的值             $    $            $    $  ANS000.BYTE054  $  y=SPRINTF([%.2f],x1*0.01);
  $  048.从fgs锁定目标，到功能触发，fgs目标存在的概率的最小的值             $    $            $    $  ANS000.BYTE055  $  y=SPRINTF([%.2f],x1*0.01);
  $  049.在一定时间内，自动制动激活                                         $    $            $    $  ANS000.BYTE056  $  if((x1&0xF0)==0x00) y=@001b;else if((x1&0xF0)==0x30) y=@0636;else if((x1&0xF0)==0x50) y=@0637;else if((x1&0xF0)==0x70) y=@0638;else if((x1&0xF0)==0x90) y=@0639;else y=@0001;
  $  050.事件发生时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x08)==0x00) y=@0634;else if((x1&0x08)==0x08) y=@0635;else y=@0001;
  $  051.事件发生时，驾驶员是否注意力集中                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x04)==0x00) y=@0634;else if((x1&0x04)==0x04) y=@0635;else y=@0001;
  $  052.事件结束时，驾驶员是否有override                                   $    $            $    $  ANS000.BYTE056  $  if((x1&0x02)==0x00) y=@0634;else if((x1&0x02)==0x02) y=@0635;else y=@0001;
  $  053.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE056  $  if((x1&0x01)==0x00) y=@0634;else if((x1&0x01)==0x01) y=@0635;else y=@0001;
  $  054.事件结束时，自车对目标driverby的概率                               $    $            $    $  ANS000.BYTE057  $  y=SPRINTF([%.2f],x1*0.05);
  $  055.事件结束时，自车与目标的overlap                                    $    $            $    $  ANS000.BYTE058  $  y=SPRINTF([%.2f],x1*0.05);
  $  056.事件发生时，目标纵向加速度的方差                                   $    $  m/s2      $    $  ANS000.BYTE059  $  y=SPRINTF([%.2f],x1*0.01);
  $  057.事件发生时，目标存在的时长                                         $    $            $    $  ANS000.BYTE060  $  y=x1;
  $  058.事件发生时，目标纵向距离的方差                                     $    $  m         $    $  ANS000.BYTE061  $  y=SPRINTF([%.2f],x1*0.01);
  $  059.事件发生时，目标纵向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE062  $  y=SPRINTF([%.2f],x1*0.01);
  $  060.事件发生时，目标横向速度的方差                                     $    $  m/s       $    $  ANS000.BYTE063  $  y=SPRINTF([%.2f],x1*0.01);
  $  061.事件发生时，目标是否属于道路边缘的概率值                           $    $            $    $  ANS000.BYTE064  $  y=SPRINTF([%.2f],x1*0.01);
  $  062.事件发生时，目标是否在运动的概率值                                 $    $            $    $  ANS000.BYTE065  $  y=SPRINTF([%.2f],x1*0.01);
  $  063.事件发生时，目标曾经运动过的概率值                                 $    $            $    $  ANS000.BYTE066  $  y=SPRINTF([%.2f],x1*0.01);
  $  064.事件结束时，目标是否被fusion上                                     $    $            $    $  ANS000.BYTE067  $  if((x1&0x03)==0x00) y=@063a;else if((x1&0x03)==0x01) y=@063b;else if((x1&0x03)==0x02) y=@063c;else y=@0001;
  $  065.事件发生时，目标的反射能量                                         $    $            $    $  ANS000.BYTE068  $  y=x1;
  $  066.事件结束时，目标的反射能量                                         $    $            $    $  ANS000.BYTE069  $  y=x1;
  $  067.从fgs锁定目标，到功能触发，fgs目标的反射能量的最大值               $    $            $    $  ANS000.BYTE070  $  y=x1;
  $  068.从fgs锁定目标，到功能触发，fgs目标的反射能量的最小值               $    $            $    $  ANS000.BYTE071  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7F2 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
