
    车型ID：3ba7

    模拟：协议模拟-->3ba7

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7FA

进入命令:

  $~  REQ000:7F2 02 10 01 00 00 00 00 00       $~  ANS000:7FA 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7F2 02 3E 80 00 00 00 00 00       $!  ANS000:7FA 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7F2 03 19 02 09 00 00 00 00       $#  ANS000:7FA 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/5f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7F2 04 14 FF FF FF 00 00 00       $$  ANS000:7FA 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7F2 03 22 F1 93 00 00 00 00       $%  ANS000:7FA 03 22 F1 93 00 00 00 00
  $%  REQ001:7F2 03 22 F1 94 00 00 00 00       $%  ANS001:7FA 03 22 F1 94 00 00 00 00
  $%  REQ002:7F2 03 22 F1 95 00 00 00 00       $%  ANS002:7FA 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7F2 03 22 12 34 00 00 00 00       $  ANS000:7FA 03 22 12 34 00 00 00 00
  $  REQ001:7F2 03 22 34 01 00 00 00 00       $  ANS001:7FA 03 22 34 01 00 00 00 00
  $  REQ002:7F2 03 22 F1 86 00 00 00 00       $  ANS002:7FA 03 22 F1 86 00 00 00 00
  $  REQ003:7F2 03 22 34 20 00 00 00 00       $  ANS003:7FA 03 22 34 20 00 00 00 00
  $  REQ004:7F2 03 22 F0 10 00 00 00 00       $  ANS004:7FA 03 22 F0 10 00 00 00 00
  $  REQ005:7F2 03 22 F0 11 00 00 00 00       $  ANS005:7FA 03 22 F0 11 00 00 00 00
  $  REQ006:7F2 03 22 02 85 00 00 00 00       $  ANS006:7FA 03 22 02 85 00 00 00 00
  $  REQ007:7F2 03 22 02 8D 00 00 00 00       $  ANS007:7FA 03 22 02 8D 00 00 00 00
  $  REQ008:7F2 03 22 10 11 00 00 00 00       $  ANS008:7FA 03 22 10 11 00 00 00 00
  $  REQ009:7F2 03 22 10 12 00 00 00 00       $  ANS009:7FA 03 22 10 12 00 00 00 00
  $  REQ010:7F2 03 22 34 06 00 00 00 00       $  ANS010:7FA 03 22 34 06 00 00 00 00
  $  REQ011:7F2 03 22 34 07 00 00 00 00       $  ANS011:7FA 03 22 34 07 00 00 00 00
  $  REQ012:7F2 03 22 34 08 00 00 00 00       $  ANS012:7FA 03 22 34 08 00 00 00 00
  $  REQ013:7F2 03 22 34 09 00 00 00 00       $  ANS013:7FA 03 22 34 09 00 00 00 00
  $  REQ014:7F2 03 22 34 0A 00 00 00 00       $  ANS014:7FA 03 22 34 0A 00 00 00 00
  $  REQ015:7F2 03 22 34 0B 00 00 00 00       $  ANS015:7FA 03 22 34 0B 00 00 00 00
  $  REQ016:7F2 03 22 F1 8B 00 00 00 00       $  ANS016:7FA 03 22 F1 8B 00 00 00 00
  $  REQ017:7F2 03 22 02 00 00 00 00 00       $  ANS017:7FA 03 22 02 00 00 00 00 00

  $  000.校准状态                                    $    $         $    $  ANS000.BYTE004  $  switxh(x1)0x00: y=@03dd;0x01: y=@030b;default: y=@0001;
  $  001.生产方式                                    $    $         $    $  ANS001.BYTE004  $  switxh(x1)0x00: y=@00f2;0x01: y=@0181;default: y=@0001;
  $  002.诊断会话模式                                $    $         $    $  ANS002.BYTE004  $  switxh(x1)0x00: y=@03de;0x01: y=@03df;0x02: y=@03e0;default: y=@0001;
  $  003.雷达加热                                    $    $         $    $  ANS003.BYTE004  $  switxh(x1)0x00: y=@0214;0x01: y=@00f2;default: y=@0001;
  $  004.EOL垂直偏差角度                             $    $         $    $  ANS004.BYTE004  $  y=SPRINTF([%.3f],((x1*256+x2)-300)*0.001);
  $  005.EOL水平偏差角度                             $    $         $    $  ANS005.BYTE004  $  y=SPRINTF([%.3f],((x1*256+x2)-300)*0.001);
  $  006.雷达供电电压                                $    $         $    $  ANS006.BYTE004  $  y=SPRINTF([%.1f],x1*0.1);
  $  007.雷达温度                                    $    $         $    $  ANS007.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  008.车速                                        $    $         $    $  ANS008.BYTE004  $  y=SPRINTF([%.2f],(x1*256+x2)*0.01);
  $  009.加速度                                      $    $         $    $  ANS009.BYTE004  $  y=SPRINTF([%.2f],((x1*256+x2)-25)*0.01);
  $  010.校准水平偏差                                $    $  °     $    $  ANS010.BYTE004  $  y=SPRINTF([%.2f],57.2958/1638*(x1*256+x2));
  $  011.校准竖直偏差                                $    $  °     $    $  ANS011.BYTE004  $  y=SPRINTF([%.2f],57.2958/1638*(x1*256+x2));
  $  012.校准板的位置                                $    $         $    $  ANS012.BYTE004  $  switxh(x1)0x00: y=@05d8;0x01: y=@05d9;0x02: y=@05da;0x03: y=@05db;0x04: y=@05dc;default: y=@0001;
  $  013.标准板需要调整的位置                        $    $         $    $  ANS013.BYTE004  $  switxh(x1)0x00: y=@05e1;0x01: y=@05e2;0x02: y=@05e3;0x03: y=@05e4;0x04: y=@05e5;0x05: y=@05e6;default: y=@0001;
  $  014.垂直方向调整操作-右下螺栓调整方向           $    $         $    $  ANS014.BYTE004  $  switxh(x1)0x00: y=@05de;0x01: y=@05df;0x02: y=@05e0;default: y=@0001;
  $  015.垂直方向调整操作-右下螺栓调整旋转圈数       $    $         $    $  ANS014.BYTE005  $  y=SPRINTF([%.2f],x1/4);
  $  016.水平方向调整操作-左上螺栓调整方向           $    $         $    $  ANS015.BYTE004  $  switxh(x1)0x00: y=@05de;0x01: y=@05df;0x02: y=@05e0;default: y=@0001;
  $  017.水平方向调整操作-左上螺栓旋转圈数           $    $         $    $  ANS015.BYTE005  $  y=SPRINTF([%.2f],x1/4);
  $  018.校准结果                                    $    $         $    $  ANS015.BYTE004  $  y=@05dd;
  $  019.ECU生产日期                                 $    $         $    $  ANS016.BYTE004  $  HEX(x1,x2,x3,x4);
  $  020.程序运行计数器                              $    $         $    $  ANS017.BYTE004  $  y=x1;

  $)  01.AEB启动次数
  $  01.AEB启动次数
  $  REQ000:7F2 03 22 FD 36 00 00 00 00       $  ANS000:7FA 03 22 FD 36 00 00 00 00
  $  REQ001:7F2 03 22 FD 37 00 00 00 00       $  ANS001:7FA 03 22 FD 37 00 00 00 00
  $  REQ002:7F2 03 22 FD 38 00 00 00 00       $  ANS002:7FA 03 22 FD 38 00 00 00 00
  $  REQ003:7F2 03 22 FD 39 00 00 00 00       $  ANS003:7FA 03 22 FD 39 00 00 00 00

  $  000.AEB-P针对移动物体启动次数         $    $       $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.EBA启动次数                       $    $       $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  002.AEB-M针对静止物体的启动次数       $    $       $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.AEB-M针对移动物体的启动次数       $    $       $    $  ANS003.BYTE004  $  y=(x1*256+x2);

  $)  02.倒数第二次预报警
  $  02.倒数第二次预报警
  $  REQ000:7F2 03 22 FD 3A 00 00 00 00       $  ANS000:7FA 03 22 FD 3A 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=x1;else y=x1-256;
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.5);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.5);else y=@0001;
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.16);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.16);else y=@0001;
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.3);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.3);else y=@0001;
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  03.最近一次预报警
  $  03.最近一次预报警
  $  REQ000:7F2 03 22 FD 3B 00 00 00 00       $  ANS000:7FA 03 22 FD 3B 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=x1;else y=x1-256;
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.5);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.5);else y=@0001;
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.16);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.16);else y=@0001;
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.3);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.3);else y=@0001;
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  04.倒数第二次紧急预警
  $  04.倒数第二次紧急预警
  $  REQ000:7F2 03 22 FD 3C 00 00 00 00       $  ANS000:7FA 03 22 FD 3C 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=x1;else y=x1-256;
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.5);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.5);else y=@0001;
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.16);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.16);else y=@0001;
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.3);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.3);else y=@0001;
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  05.最近一次紧急预警
  $  05.最近一次紧急预警
  $  REQ000:7F2 03 22 FD 3D 00 00 00 00       $  ANS000:7FA 03 22 FD 3D 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  y=SPRINTF([%.1f],x1*0.2);
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  y=SPRINTF([%.2f],x1*0.15);
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=SPRINTF([%d],(x1*256*256+x2*256+x3)*0.01);
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%d],x1*0.2);else y=SPRINTF([%d],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%d],x1*0.15);else y=SPRINTF([%d],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  06.倒数第二次EBA
  $  06.倒数第二次EBA
  $  REQ000:7F2 03 22 FD 3E 00 00 00 00       $  ANS000:7FA 03 22 FD 3E 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  y=SPRINTF([%.1f],x1*0.2);
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  y=SPRINTF([%.2f],x1*0.15);
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=SPRINTF([%d],(x1*256*256+x2*256+x3)*0.01);
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%d],x1*0.2);else y=SPRINTF([%d],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.15);else y=SPRINTF([%.2f],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  07.最近一次EBA
  $  07.最近一次EBA
  $  REQ000:7F2 03 22 FD 3F 00 00 00 00       $  ANS000:7FA 03 22 FD 3F 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  y=SPRINTF([%.1f],x1*0.2);
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.5);else y=SPRINTF([%.1f],(x1-256)*0.5);
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  y=SPRINTF([%.2f],x1*0.15);
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.1);else y=SPRINTF([%.1f],(x1-256)*0.1);
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if(x1<0x80) y=SPRINTF([%.2f],x1*0.16);else y=SPRINTF([%.2f],(x1-256)*0.16);
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],x1*5);else y=SPRINTF([%d],(x1-256)*5);
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.2);else y=SPRINTF([%.1f],(x1-256)*0.2);
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if(x1<0x80) y=SPRINTF([%.1f],x1*0.3);else y=SPRINTF([%.1f],(x1-256)*0.3);
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if(x1<0x80) y=SPRINTF([%d],x1);else y=SPRINTF([%d],(x1-256));
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=SPRINTF([%d],(x1*256*256+x2*256+x3)*0.01);
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if(x1<0x80) y=SPRINTF([%d],x1*0.2);else y=SPRINTF([%d],(x1-256)*0.2);
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if(x1<0x80) y=SPRINTF([%d],x1*0.15);else y=SPRINTF([%d],(x1-256)*0.15);
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  08.倒数第二次的AEB-P
  $  08.倒数第二次的AEB-P
  $  REQ000:7F2 03 22 FD 40 00 00 00 00       $  ANS000:7FA 03 22 FD 40 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=x1;else y=x1-256;
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.5);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.5);else y=@0001;
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.16);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.16);else y=@0001;
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.3);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.3);else y=@0001;
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  09.最近一次的AEB-P
  $  09.最近一次的AEB-P
  $  REQ000:7F2 03 22 FD 41 00 00 00 00       $  ANS000:7FA 03 22 FD 41 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=x1;else y=x1-256;
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.5);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.5);else y=@0001;
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.16);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.16);else y=@0001;
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.3);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.3);else y=@0001;
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  10.倒数第二次的AEB-M
  $  10.倒数第二次的AEB-M
  $  REQ000:7F2 03 22 FD 42 00 00 00 00       $  ANS000:7FA 03 22 FD 42 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=x1;else y=x1-256;
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.5);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.5);else y=@0001;
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.16);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.16);else y=@0001;
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.3);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.3);else y=@0001;
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

  $)  11.最近一次的AEB-M
  $  11.最近一次的AEB-M
  $  REQ000:7F2 03 22 FD 43 00 00 00 00       $  ANS000:7FA 03 22 FD 43 00 00 00 00

  $  000.事件发生时间：                                                 $    $           $    $  ANS000.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s%d%s%d%s%d%s],(((x2&0x7F)<<1) + (x3>>7)) + 2000,@0197,(x1>>3)&0x1F,@0199,(((x1&0x07)<<1) + (x2>>7)),@0198,(x3>>2)&0x1F,@0211,(((x3&0x03)<<4) + (x4>>4)),@0212,(((x4&0x0F)<<2) + (x5>>6)),@0213);
  $  001.目标车辆的运动状态                                             $    $           $    $  ANS000.BYTE008  $  switxh(x1&0x1C)0x00: y=@020c;0x04: y=@020d;0x08: y=@020e;0x0C: y=@020f;0x10: y=@0210;default: y=@0001;
  $  002.油门踏板开度                                                   $    $  %        $    $  ANS000.BYTE009  $  y=x1;
  $  003.主缸压力                                                       $    $  巴       $    $  ANS000.BYTE010  $  y=(x1>>5)&0x07;
  $  004.方向盘转角                                                     $    $  °       $    $  ANS000.BYTE011  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  005.方向盘转角速度                                                 $    $  °/s     $    $  ANS000.BYTE012  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  006.车辆纵向速度                                                   $    $  m/s      $    $  ANS000.BYTE013  $  if(x1<0x80) y=x1;else y=x1-256;
  $  007.车辆纵向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE014  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  008.车辆侧向加速度                                                 $    $  m/s2     $    $  ANS000.BYTE015  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  009.校准偏差角·                                                   $    $  °       $    $  ANS000.BYTE016  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  010.与目标车辆纵向距离                                             $    $  m        $    $  ANS000.BYTE017  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.5);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.5);else y=@0001;
  $  011.与目标车辆侧向距离                                             $    $  m        $    $  ANS000.BYTE018  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  012.与目标车辆相对纵向速度                                         $    $  m/s      $    $  ANS000.BYTE019  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  013.与目标车辆相对侧向速度                                         $    $  m/s      $    $  ANS000.BYTE020  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  014.与目标车辆相对纵向加速度                                       $    $  m/s2     $    $  ANS000.BYTE021  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.1);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.1);else y=@0001;
  $  015.与目标车辆相对侧向加速度                                       $    $  m/s2     $    $  ANS000.BYTE022  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.16);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.16);else y=@0001;
  $  016.在一定时间内，车辆最大油门开度                                 $    $  %        $    $  ANS000.BYTE023  $  y=x1;
  $  017.在一定时间内，车辆最大制动力                                   $    $  巴       $    $  ANS000.BYTE024  $  y=x1;
  $  018.在一定时间内，车辆最大转向盘转角                               $    $  °       $    $  ANS000.BYTE025  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  019.在一定时间内，车辆最大转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE026  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  020.在一定时间内，车辆最小油门开度                                 $    $  %        $    $  ANS000.BYTE027  $  y=x1;
  $  021.在一定时间内，车辆最小制动力                                   $    $  巴       $    $  ANS000.BYTE028  $  y=x1;
  $  022.在一定时间内，车辆最小转向盘转角                               $    $  °       $    $  ANS000.BYTE029  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  023.在一定时间内，车辆最小转向盘转角速度                           $    $  °/s     $    $  ANS000.BYTE030  $  if((x1>=0)&&(x1<=127)) y=x1*5;else if((x1>=128)&&(x1<=255)) y=(x1-256)*5;else y=@0001;
  $  024.在一定时间内，车辆最大纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE031  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  025.在一定时间内，车辆最小纵向加速度                               $    $  m/s2     $    $  ANS000.BYTE032  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  026.在一定时间内，车辆最大侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE033  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  027.在一定时间内，车辆最小侧向加速度                               $    $  m/s2     $    $  ANS000.BYTE034  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  028.事件的持续时间                                                 $    $  s        $    $  ANS000.BYTE035  $  y=SPRINTF([%d],x1*20);
  $  029.在一定时间内，车辆当前速度差                                   $    $  m/s      $    $  ANS000.BYTE036  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.3);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.3);else y=@0001;
  $  030.在一定时间内，与目标车辆的相对纵向速度最大值                   $    $  m/s      $    $  ANS000.BYTE037  $  if((x1>=0)&&(x1<=127)) y=x1;else if((x1>=128)&&(x1<=255)) y=(0-1)*x1;else y=@0001;
  $  031.在一定时间内，短促制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x80) y=@00f2;else y=@0214;
  $  032.在一定时间内，自动制动激活                                     $    $           $    $  ANS000.BYTE038  $  if(x1&0x40) y=@00f2;else y=@0214;
  $  033.事件发生时，车辆的行驶里程                                     $    $  km       $    $  ANS000.BYTE038  $  y=(x1*256*256+x2*256+x3)&0xFFFFF;
  $  034.在一定时间内，与目标车辆纵向距离的最小值                       $    $  m        $    $  ANS000.BYTE041  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.1f],x1*0.2);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.1f],(x1-256)*0.2);else y=@0001;
  $  035.当车辆与目标车辆的纵向距离到达最小值时，两者间的侧向距离       $    $  m        $    $  ANS000.BYTE042  $  if((x1>=0)&&(x1<=127)) y=SPRINTF([%.2f],x1*0.15);else if((x1>=128)&&(x1<=255)) y=SPRINTF([%.2f],(x1-256)*0.15);else y=@0001;
  $  036.从事件开始直至两车辆的纵向距离到达最小值时的持续时间           $    $  s        $    $  ANS000.BYTE043  $  if(x1<0x80) y=SPRINTF([%d],x1*20);else y=SPRINTF([%d],(x1-256)*20);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7F2 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
