
    车型ID：3ba9

    模拟：协议模拟-->3ba9

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~78F

进入命令:

  $~  REQ000:787 02 10 01 00 00 00 00 00       $~  ANS000:78F 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:787 02 3E 80 00 00 00 00 00       $!  ANS000:78F 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:787 03 19 02 09 00 00 00 00       $#  ANS000:78F 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/61000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:787 04 14 FF FF FF 00 00 00       $$  ANS000:78F 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:787 03 22 F1 93 00 00 00 00       $%  ANS000:78F 03 22 F1 93 00 00 00 00
  $%  REQ001:787 03 22 F1 94 00 00 00 00       $%  ANS001:78F 03 22 F1 94 00 00 00 00
  $%  REQ002:787 03 22 F1 95 00 00 00 00       $%  ANS002:78F 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:787 03 22 00 01 00 00 00 00       $  ANS000:78F 03 22 00 01 00 00 00 00
  $  REQ001:787 03 22 00 02 00 00 00 00       $  ANS001:78F 03 22 00 02 00 00 00 00
  $  REQ002:787 03 22 00 03 00 00 00 00       $  ANS002:78F 03 22 00 03 00 00 00 00
  $  REQ003:787 03 22 00 04 00 00 00 00       $  ANS003:78F 03 22 00 04 00 00 00 00
  $  REQ004:787 03 22 00 05 00 00 00 00       $  ANS004:78F 03 22 00 05 00 00 00 00
  $  REQ005:787 03 22 00 06 00 00 00 00       $  ANS005:78F 03 22 00 06 00 00 00 00
  $  REQ006:787 03 22 00 10 00 00 00 00       $  ANS006:78F 03 22 00 10 00 00 00 00
  $  REQ007:787 03 22 00 11 00 00 00 00       $  ANS007:78F 03 22 00 11 00 00 00 00
  $  REQ008:787 03 22 00 12 00 00 00 00       $  ANS008:78F 03 22 00 12 00 00 00 00
  $  REQ009:787 03 22 00 13 00 00 00 00       $  ANS009:78F 03 22 00 13 00 00 00 00
  $  REQ010:787 03 22 00 14 00 00 00 00       $  ANS010:78F 03 22 00 14 00 00 00 00

  $  000.档位系统状态                      $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x00: y=@0078;0x01: y=@0167;default: y=@0001;
  $  001.档位识别状态                      $    $       $    $  ANS001.BYTE004  $  switxh(x1)0x00: y=@03a2;0x01: y=@010f;0x02: y=@0110;0x03: y=@0111;0x04: y=@0112;0x05: y=@0113;0x06: y=@0115;0x07: y=@0116;default: y=@0001;
  $  002.P档按键状态                       $    $       $    $  ANS002.BYTE004  $  switxh(x1)0x00: y=@001e;0x01: y=@001d;0x02: y=@0578;0x03: y=@0346;0x04: y=@01e3;0x05: y=@052b;default: y=@0001;
  $  003.UNLOCK(解锁)键状态                $    $       $    $  ANS003.BYTE004  $  switxh(x1)0x00: y=@001e;0x01: y=@001d;0x02: y=@0578;0x03: y=@0346;0x04: y=@01e3;0x05: y=@052b;default: y=@0001;
  $  004.档位对应的Hall IC位置判断         $    $       $    $  ANS004.BYTE004  $  switxh(x1)0x1F: y=@056e;0x1E: y=@056f;0x1C: y=@0570;0x1D: y=@0571;0x19: y=@0572;0x1B: y=@0573;0x13: y=@0574;0x17: y=@0575;0x07: y=@0576;0x0F: y=@0577;default: y=@0001;
  $  005.霍尔输出占空比（1路）             $    $       $    $  ANS005.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/15000);
  $  006.霍尔输出占空比（2路）             $    $       $    $  ANS005.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/15000);
  $  007.P档指示灯高亮控制占空比           $    $       $    $  ANS006.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  008.P档指示灯低亮控制占空比           $    $       $    $  ANS006.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  009.P档指示灯背光0档控制占空比        $    $       $    $  ANS006.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  010.P档指示灯背光1档控制占空比        $    $       $    $  ANS006.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  011.P档指示灯背光2档控制占空比        $    $       $    $  ANS006.BYTE012  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  012.P档指示灯背光3档控制占空比        $    $       $    $  ANS006.BYTE014  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  013.P档指示灯背光4档控制占空比        $    $       $    $  ANS006.BYTE016  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  014.P档指示灯背光5档控制占空比        $    $       $    $  ANS006.BYTE018  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  015.P档指示灯背光6档控制占空比        $    $       $    $  ANS006.BYTE020  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  016.P档指示灯背光7档控制占空比        $    $       $    $  ANS006.BYTE022  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  017.P档指示灯背光8档控制占空比        $    $       $    $  ANS006.BYTE024  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  018.P档指示灯背光9档控制占空比        $    $       $    $  ANS006.BYTE026  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  019.P档指示灯背光10档控制占空比       $    $       $    $  ANS006.BYTE028  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  020.R档指示灯高亮控制占空比           $    $       $    $  ANS007.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  021.R档指示灯低亮控制占空比           $    $       $    $  ANS007.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  022.R档指示灯背光0档控制占空比        $    $       $    $  ANS007.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  023.R档指示灯背光1档控制占空比        $    $       $    $  ANS007.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  024.R档指示灯背光2档控制占空比        $    $       $    $  ANS007.BYTE012  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  025.R档指示灯背光3档控制占空比        $    $       $    $  ANS007.BYTE014  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  026.R档指示灯背光4档控制占空比        $    $       $    $  ANS007.BYTE016  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  027.R档指示灯背光5档控制占空比        $    $       $    $  ANS007.BYTE018  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  028.R档指示灯背光6档控制占空比        $    $       $    $  ANS007.BYTE020  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  029.R档指示灯背光7档控制占空比        $    $       $    $  ANS007.BYTE022  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  030.R档指示灯背光8档控制占空比        $    $       $    $  ANS007.BYTE024  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  031.R档指示灯背光9档控制占空比        $    $       $    $  ANS007.BYTE026  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  032.R档指示灯背光10档控制占空比       $    $       $    $  ANS007.BYTE028  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  033.N档指示灯高亮控制占空比           $    $       $    $  ANS008.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  034.N档指示灯低亮控制占空比           $    $       $    $  ANS008.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  035.N档指示灯背光0档控制占空比        $    $       $    $  ANS008.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  036.N档指示灯背光1档控制占空比        $    $       $    $  ANS008.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  037.N档指示灯背光2档控制占空比        $    $       $    $  ANS008.BYTE012  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  038.N档指示灯背光3档控制占空比        $    $       $    $  ANS008.BYTE014  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  039.N档指示灯背光4档控制占空比        $    $       $    $  ANS008.BYTE016  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  040.N档指示灯背光5档控制占空比        $    $       $    $  ANS008.BYTE018  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  041.N档指示灯背光6档控制占空比        $    $       $    $  ANS008.BYTE020  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  042.N档指示灯背光7档控制占空比        $    $       $    $  ANS008.BYTE022  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  043.N档指示灯背光8档控制占空比        $    $       $    $  ANS008.BYTE024  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  044.N档指示灯背光9档控制占空比        $    $       $    $  ANS008.BYTE026  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  045.N档指示灯背光10档控制占空比       $    $       $    $  ANS008.BYTE028  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  046.D档指示灯高亮控制占空比           $    $       $    $  ANS009.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  047.D档指示灯低亮控制占空比           $    $       $    $  ANS009.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  048.D档指示灯背光0档控制占空比        $    $       $    $  ANS009.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  049.D档指示灯背光1档控制占空比        $    $       $    $  ANS009.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  050.D档指示灯背光2档控制占空比        $    $       $    $  ANS009.BYTE012  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  051.D档指示灯背光3档控制占空比        $    $       $    $  ANS009.BYTE014  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  052.D档指示灯背光4档控制占空比        $    $       $    $  ANS009.BYTE016  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  053.D档指示灯背光5档控制占空比        $    $       $    $  ANS009.BYTE018  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  054.D档指示灯背光6档控制占空比        $    $       $    $  ANS009.BYTE020  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  055.D档指示灯背光7档控制占空比        $    $       $    $  ANS009.BYTE022  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  056.D档指示灯背光8档控制占空比        $    $       $    $  ANS009.BYTE024  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  057.D档指示灯背光9档控制占空比        $    $       $    $  ANS009.BYTE026  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  058.D档指示灯背光10档控制占空比       $    $       $    $  ANS009.BYTE028  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  059.氛围灯最低亮度占空比              $    $       $    $  ANS010.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/32768);
  $  060.氛围灯最高亮度占空比              $    $       $    $  ANS010.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/32768);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:787 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
