
    车型ID：3bf0

    模拟：协议模拟-->3bf0

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~74F

进入命令:

  $~  REQ000:747 02 10 01 00 00 00 00 00       $~  ANS000:74F 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:747 02 3E 80 00 00 00 00 00       $!  ANS000:74F 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:747 03 19 02 09 00 00 00 00       $#  ANS000:74F 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/99000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:747 04 14 FF FF FF 00 00 00       $$  ANS000:74F 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:747 03 22 F1 93 00 00 00 00       $%  ANS000:74F 03 22 F1 93 00 00 00 00
  $%  REQ001:747 03 22 F1 94 00 00 00 00       $%  ANS001:74F 03 22 F1 94 00 00 00 00
  $%  REQ002:747 03 22 F1 95 00 00 00 00       $%  ANS002:74F 03 22 F1 95 00 00 00 00
  $%  REQ003:747 03 22 F1 80 00 00 00 00       $%  ANS003:74F 03 22 F1 80 00 00 00 00
  $%  REQ004:747 03 22 FF 94 00 00 00 00       $%  ANS004:74F 03 22 FF 94 00 00 00 00
  $%  REQ005:747 03 22 FF 95 00 00 00 00       $%  ANS005:74F 03 22 FF 95 00 00 00 00
  $%  REQ006:747 03 22 F1 00 00 00 00 00       $%  ANS006:74F 03 22 F1 00 00 00 00 00
  $%  REQ007:747 03 22 F1 01 00 00 00 00       $%  ANS007:74F 03 22 F1 01 00 00 00 00
  $%  REQ008:747 03 22 F1 02 00 00 00 00       $%  ANS008:74F 03 22 F1 02 00 00 00 00
  $%  REQ009:747 03 22 F1 03 00 00 00 00       $%  ANS009:74F 03 22 F1 03 00 00 00 00
  $%  REQ010:747 03 22 F1 04 00 00 00 00       $%  ANS010:74F 03 22 F1 04 00 00 00 00
  $%  REQ011:747 03 22 F1 05 00 00 00 00       $%  ANS011:74F 03 22 F1 05 00 00 00 00
  $%  REQ012:747 03 22 F1 06 00 00 00 00       $%  ANS012:74F 03 22 F1 06 00 00 00 00
  $%  REQ013:747 03 22 F1 07 00 00 00 00       $%  ANS013:74F 03 22 F1 07 00 00 00 00

  $%  000:硬件版本:                       $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:                       $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:                       $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:                       $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:                       $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:                       $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:引导程序软件版本号/日期:        $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  007:软件版本:                       $%    $%  ANS003.BYTE007  $%  y=SPRINTF([%d.%d],(x1%1000-x1%10)/10,x1%10);
  $%  008:次要信息:                       $%    $%  ANS003.BYTE008  $%  HEX(x1);
  $%  009:MCU型号:                        $%    $%  ANS003.BYTE009  $%  HEX(x1);
  $%  010:日期:                           $%    $%  ANS003.BYTE010  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $%  011:参数标定文件软件编码:           $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  012:参数标定文件软件版本:           $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  013:软件日期:                       $%    $%  ANS005.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  014:修改次数:                       $%    $%  ANS005.BYTE009  $%  y=x1;
  $%  015:操作系统软件编号:               $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  016:操作系统软件版本:               $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  017:软件日期:                       $%    $%  ANS007.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  018:修改次数:                       $%    $%  ANS007.BYTE009  $%  y=x1;
  $%  019:操作系统服务软件编号:           $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  020:操作系统服务软件版本:           $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  021:软件日期:                       $%    $%  ANS009.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  022:修改次数:                       $%    $%  ANS009.BYTE009  $%  y=x1;
  $%  023:片内驱动软件编号:               $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  024:片内驱动软件版本:               $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  025:软件日期:                       $%    $%  ANS011.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  026:修改次数:                       $%    $%  ANS011.BYTE009  $%  y=x1;
  $%  027:片外驱动软件编号:               $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  028:片外驱动软件版本:               $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  029:软件日期:                       $%    $%  ANS013.BYTE006  $%  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $%  030:修改次数:                       $%    $%  ANS013.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.前大灯系统数据流
  $  00.前大灯系统数据流
  $  REQ000:747 03 22 20 0A 00 00 00 00       $  ANS000:74F 03 22 20 0A 00 00 00 00
  $  REQ001:747 03 22 20 0B 00 00 00 00       $  ANS001:74F 03 22 20 0B 00 00 00 00

  $  000.右前位置灯工作时长       $    $  h     $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.右昼行灯工作时长         $    $  h     $    $  ANS001.BYTE004  $  y=(x1*256+x2);

  $)  01.车内氛围灯系统数据流
  $  01.车内氛围灯系统数据流
  $  REQ000:747 03 22 F2 D3 00 00 00 00       $  ANS000:74F 03 22 F2 D3 00 00 00 00
  $  REQ001:747 03 22 F2 D4 00 00 00 00       $  ANS001:74F 03 22 F2 D4 00 00 00 00
  $  REQ002:747 03 22 F2 D5 00 00 00 00       $  ANS002:74F 03 22 F2 D5 00 00 00 00
  $  REQ003:747 03 22 F2 D0 00 00 00 00       $  ANS003:74F 03 22 F2 D0 00 00 00 00
  $  REQ004:747 03 22 F2 F3 00 00 00 00       $  ANS004:74F 03 22 F2 F3 00 00 00 00
  $  REQ005:747 03 22 F2 F4 00 00 00 00       $  ANS005:74F 03 22 F2 F4 00 00 00 00
  $  REQ006:747 03 22 F2 F5 00 00 00 00       $  ANS006:74F 03 22 F2 F5 00 00 00 00
  $  REQ007:747 03 22 F2 F0 00 00 00 00       $  ANS007:74F 03 22 F2 F0 00 00 00 00
  $  REQ008:747 03 22 F3 03 00 00 00 00       $  ANS008:74F 03 22 F3 03 00 00 00 00
  $  REQ009:747 03 22 F3 04 00 00 00 00       $  ANS009:74F 03 22 F3 04 00 00 00 00
  $  REQ010:747 03 22 F3 05 00 00 00 00       $  ANS010:74F 03 22 F3 05 00 00 00 00
  $  REQ011:747 03 22 F3 00 00 00 00 00       $  ANS011:74F 03 22 F3 00 00 00 00 00
  $  REQ012:747 03 22 F3 23 00 00 00 00       $  ANS012:74F 03 22 F3 23 00 00 00 00
  $  REQ013:747 03 22 F3 24 00 00 00 00       $  ANS013:74F 03 22 F3 24 00 00 00 00
  $  REQ014:747 03 22 F3 25 00 00 00 00       $  ANS014:74F 03 22 F3 25 00 00 00 00
  $  REQ015:747 03 22 F3 20 00 00 00 00       $  ANS015:74F 03 22 F3 20 00 00 00 00
  $  REQ016:747 03 22 F3 43 00 00 00 00       $  ANS016:74F 03 22 F3 43 00 00 00 00
  $  REQ017:747 03 22 F3 44 00 00 00 00       $  ANS017:74F 03 22 F3 44 00 00 00 00
  $  REQ018:747 03 22 F3 45 00 00 00 00       $  ANS018:74F 03 22 F3 45 00 00 00 00
  $  REQ019:747 03 22 F3 40 00 00 00 00       $  ANS019:74F 03 22 F3 40 00 00 00 00

  $  000.仪表板左氛围灯灯头硬件编码                                           $    $       $    $  ANS000.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  001.仪表板左氛围灯灯头硬件日期                                           $    $       $    $  ANS000.BYTE005  $  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $  002.仪表板左氛围灯灯头软件编码                                           $    $       $    $  ANS001.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  003.仪表板左氛围灯灯头软件版本                                           $    $       $    $  ANS002.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  004.仪表板左氛围灯灯头软件日期                                           $    $       $    $  ANS002.BYTE006  $  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $  005.仪表板左氛围灯灯头修改次数                                           $    $       $    $  ANS002.BYTE009  $  y=x1;
  $  006.仪表板左氛围灯灯头引导程序软件版本号/日期                            $    $       $    $  ANS003.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  007.仪表板左氛围灯灯头引导程序软件版本号/软件版本                        $    $       $    $  ANS003.BYTE007  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  008.仪表板左氛围灯灯头引导程序软件版本号/次要信息                        $    $       $    $  ANS003.BYTE008  $  HEX(x1);
  $  009.仪表板左氛围灯灯头引导程序软件版本号/MCU(前电机控制器)型号           $    $       $    $  ANS003.BYTE009  $  HEX(x1);
  $  010.仪表板左氛围灯灯头引导程序软件版本号/日期                            $    $       $    $  ANS003.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  011.仪表板右氛围灯左灯头硬件编码                                         $    $       $    $  ANS004.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  012.仪表板右氛围灯左灯头硬件日期                                         $    $       $    $  ANS004.BYTE005  $  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $  013.仪表板右氛围灯左灯头软件编码                                         $    $       $    $  ANS005.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  014.仪表板右氛围灯左灯头软件版本                                         $    $       $    $  ANS006.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  015.仪表板右氛围灯左灯头软件日期                                         $    $       $    $  ANS006.BYTE006  $  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $  016.仪表板右氛围灯左灯头修改次数                                         $    $       $    $  ANS006.BYTE009  $  y=x1;
  $  017.仪表板右氛围灯左灯头引导程序软件版本号/日期                          $    $       $    $  ANS007.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  018.仪表板右氛围灯左灯头引导程序软件版本号/软件版本                      $    $       $    $  ANS007.BYTE007  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  019.仪表板右氛围灯左灯头引导程序软件版本号/次要信息                      $    $       $    $  ANS007.BYTE008  $  HEX(x1);
  $  020.仪表板右氛围灯左灯头引导程序软件版本号/MCU(前电机控制器)型号         $    $       $    $  ANS007.BYTE009  $  HEX(x1);
  $  021.仪表板右氛围灯左灯头引导程序软件版本号/日期                          $    $       $    $  ANS007.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  022.仪表板右氛围灯右灯头硬件编码                                         $    $       $    $  ANS008.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  023.仪表板右氛围灯右灯头硬件日期                                         $    $       $    $  ANS008.BYTE005  $  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $  024.仪表板右氛围灯右灯头软件编码                                         $    $       $    $  ANS009.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  025.仪表板右氛围灯右灯头软件版本                                         $    $       $    $  ANS010.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  026.仪表板右氛围灯右灯头软件日期                                         $    $       $    $  ANS010.BYTE006  $  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $  027.仪表板右氛围灯右灯头修改次数                                         $    $       $    $  ANS010.BYTE009  $  y=x1;
  $  028.仪表板右氛围灯右灯头引导程序软件版本号/日期                          $    $       $    $  ANS011.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  029.仪表板右氛围灯右灯头引导程序软件版本号/软件版本                      $    $       $    $  ANS011.BYTE007  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  030.仪表板右氛围灯右灯头引导程序软件版本号/次要信息                      $    $       $    $  ANS011.BYTE008  $  HEX(x1);
  $  031.仪表板右氛围灯右灯头引导程序软件版本号/MCU(前电机控制器)型号         $    $       $    $  ANS011.BYTE009  $  HEX(x1);
  $  032.仪表板右氛围灯右灯头引导程序软件版本号/日期                          $    $       $    $  ANS011.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  033.副仪表板左氛围灯后灯头硬件编码                                       $    $       $    $  ANS012.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  034.副仪表板左氛围灯后灯头硬件日期                                       $    $       $    $  ANS012.BYTE005  $  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $  035.副仪表板左氛围灯后灯头软件编码                                       $    $       $    $  ANS013.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  036.副仪表板左氛围灯后灯头软件版本                                       $    $       $    $  ANS014.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  037.副仪表板左氛围灯后灯头软件日期                                       $    $       $    $  ANS014.BYTE006  $  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $  038.副仪表板左氛围灯后灯头修改次数                                       $    $       $    $  ANS014.BYTE009  $  y=x1;
  $  039.副仪表板左氛围灯后灯头引导程序软件版本号/日期                        $    $       $    $  ANS015.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  040.副仪表板左氛围灯后灯头引导程序软件版本号/软件版本                    $    $       $    $  ANS015.BYTE007  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  041.副仪表板左氛围灯后灯头引导程序软件版本号/次要信息                    $    $       $    $  ANS015.BYTE008  $  HEX(x1);
  $  042.副仪表板左氛围灯后灯头引导程序软件版本号/MCU(前电机控制器)型号       $    $       $    $  ANS015.BYTE009  $  HEX(x1);
  $  043.副仪表板左氛围灯后灯头引导程序软件版本号/日期                        $    $       $    $  ANS015.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);
  $  044.副仪表板右氛围灯后灯头硬件编码                                       $    $       $    $  ANS016.BYTE004  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  045.副仪表板右氛围灯后灯头硬件日期                                       $    $       $    $  ANS016.BYTE005  $  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $  046.副仪表板右氛围灯后灯头软件编码                                       $    $       $    $  ANS017.BYTE004  $  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $  047.副仪表板右氛围灯后灯头软件版本                                       $    $       $    $  ANS018.BYTE004  $  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $  048.副仪表板右氛围灯后灯头软件日期                                       $    $       $    $  ANS018.BYTE006  $  y=SPRINTF([%02d.%02d.%02d],x1,x2,x3);
  $  049.副仪表板右氛围灯后灯头修改次数                                       $    $       $    $  ANS018.BYTE009  $  y=x1;
  $  050.副仪表板右氛围灯后灯头引导程序软件版本号/日期                        $    $       $    $  ANS019.BYTE004  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $  051.副仪表板右氛围灯后灯头引导程序软件版本号/软件版本                    $    $       $    $  ANS019.BYTE007  $  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $  052.副仪表板右氛围灯后灯头引导程序软件版本号/次要信息                    $    $       $    $  ANS019.BYTE008  $  HEX(x1);
  $  053.副仪表板右氛围灯后灯头引导程序软件版本号/MCU(前电机控制器)型号       $    $       $    $  ANS019.BYTE009  $  HEX(x1);
  $  054.副仪表板右氛围灯后灯头引导程序软件版本号/日期                        $    $       $    $  ANS019.BYTE010  $  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@0198,x3,@0199);

  $)  02.车窗控制系统数据流
  $  02.车窗控制系统数据流
  $  REQ000:747 03 22 22 C9 00 00 00 00       $  ANS000:74F 03 22 22 C9 00 00 00 00
  $  REQ001:747 03 22 22 CA 00 00 00 00       $  ANS001:74F 03 22 22 CA 00 00 00 00
  $  REQ002:747 03 22 22 CB 00 00 00 00       $  ANS002:74F 03 22 22 CB 00 00 00 00
  $  REQ003:747 03 22 22 CF 00 00 00 00       $  ANS003:74F 03 22 22 CF 00 00 00 00
  $  REQ004:747 03 22 22 D0 00 00 00 00       $  ANS004:74F 03 22 22 D0 00 00 00 00
  $  REQ005:747 03 22 22 D1 00 00 00 00       $  ANS005:74F 03 22 22 D1 00 00 00 00
  $  REQ006:747 03 22 22 D3 00 00 00 00       $  ANS006:74F 03 22 22 D3 00 00 00 00
  $  REQ007:747 03 22 22 D4 00 00 00 00       $  ANS007:74F 03 22 22 D4 00 00 00 00
  $  REQ008:747 03 22 22 D5 00 00 00 00       $  ANS008:74F 03 22 22 D5 00 00 00 00
  $  REQ009:747 03 22 22 D6 00 00 00 00       $  ANS009:74F 03 22 22 D6 00 00 00 00

  $  000.右前自动下降开关信号           $    $       $    $  ANS000.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  001.右前手动上升开关信号           $    $       $    $  ANS001.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  002.右前车窗手动下降开关信号       $    $       $    $  ANS002.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  003.右后自动下降开关信号           $    $       $    $  ANS003.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  004.右后手动上升开关信号           $    $       $    $  ANS004.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  005.右后车窗手动下降开关信号       $    $       $    $  ANS005.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  006.右前车窗自动上升开关信号       $    $       $    $  ANS006.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  007.右前车窗防夹电机耐久次数       $    $       $    $  ANS007.BYTE004  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=25000)) y=(x2*256+x1);else if((x2*256+x1)==65534) y=@069e;else if((x2*256+x1)==65535) y=@0000;else y=@0001;
  $  008.右后自动上升开关信号           $    $       $    $  ANS008.BYTE004  $  if(x1==0) y=@0010;else if(x1==1) y=@0012;else y=@0001;
  $  009.右后车窗防夹电机耐久次数       $    $       $    $  ANS009.BYTE004  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=25000)) y=(x2*256+x1);else if((x2*256+x1)==65534) y=@069e;else if((x2*256+x1)==65535) y=@0000;else y=@0001;

  $)  03.口盖控制系统数据流
  $  03.口盖控制系统数据流
  $  REQ000:747 03 22 23 92 00 00 00 00       $  ANS000:74F 03 22 23 92 00 00 00 00
  $  REQ001:747 03 22 23 93 00 00 00 00       $  ANS001:74F 03 22 23 93 00 00 00 00

  $  000.馈电解锁发生的次数             $    $       $    $  ANS000.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=65534)) y=(x1*256+x2);else if((x1*256+x2)==65535) y=@06de;else y=@0001;
  $  001.上次充电口盖馈电解锁时间       $    $       $    $  ANS001.BYTE004  $  y=SPRINTF([%d%s%02d%s%02d%s%02d%s%02d%s%02d%s],x1+2000,@0197,x2,@0198,x3,@0199,x4,@02ab,x5,@0212,x6,@0213);

  $)  04.空调系统数据流
  $  04.空调系统数据流
  $  REQ000:747 03 22 28 82 00 00 00 00       $  ANS000:74F 03 22 28 82 00 00 00 00
  $  REQ001:747 03 22 28 83 00 00 00 00       $  ANS001:74F 03 22 28 83 00 00 00 00
  $  REQ002:747 03 22 28 84 00 00 00 00       $  ANS002:74F 03 22 28 84 00 00 00 00
  $  REQ003:747 03 22 28 85 00 00 00 00       $  ANS003:74F 03 22 28 85 00 00 00 00
  $  REQ004:747 03 22 28 86 00 00 00 00       $  ANS004:74F 03 22 28 86 00 00 00 00
  $  REQ005:747 03 22 28 87 00 00 00 00       $  ANS005:74F 03 22 28 87 00 00 00 00
  $  REQ006:747 03 22 28 88 00 00 00 00       $  ANS006:74F 03 22 28 88 00 00 00 00
  $  REQ007:747 03 22 28 89 00 00 00 00       $  ANS007:74F 03 22 28 89 00 00 00 00
  $  REQ008:747 03 22 28 8A 00 00 00 00       $  ANS008:74F 03 22 28 8A 00 00 00 00
  $  REQ009:747 03 22 28 8B 00 00 00 00       $  ANS009:74F 03 22 28 8B 00 00 00 00
  $  REQ010:747 03 22 28 8C 00 00 00 00       $  ANS010:74F 03 22 28 8C 00 00 00 00
  $  REQ011:747 03 22 28 8D 00 00 00 00       $  ANS011:74F 03 22 28 8D 00 00 00 00
  $  REQ012:747 03 22 28 8E 00 00 00 00       $  ANS012:74F 03 22 28 8E 00 00 00 00
  $  REQ013:747 03 22 28 8F 00 00 00 00       $  ANS013:74F 03 22 28 8F 00 00 00 00
  $  REQ014:747 03 22 28 90 00 00 00 00       $  ANS014:74F 03 22 28 90 00 00 00 00
  $  REQ015:747 03 22 28 91 00 00 00 00       $  ANS015:74F 03 22 28 91 00 00 00 00
  $  REQ016:747 03 22 28 92 00 00 00 00       $  ANS016:74F 03 22 28 92 00 00 00 00
  $  REQ017:747 03 22 28 95 00 00 00 00       $  ANS017:74F 03 22 28 95 00 00 00 00
  $  REQ018:747 03 22 28 96 00 00 00 00       $  ANS018:74F 03 22 28 96 00 00 00 00
  $  REQ019:747 03 22 28 97 00 00 00 00       $  ANS019:74F 03 22 28 97 00 00 00 00
  $  REQ020:747 03 22 28 98 00 00 00 00       $  ANS020:74F 03 22 28 98 00 00 00 00
  $  REQ021:747 03 22 28 99 00 00 00 00       $  ANS021:74F 03 22 28 99 00 00 00 00
  $  REQ022:747 03 22 28 9A 00 00 00 00       $  ANS022:74F 03 22 28 9A 00 00 00 00
  $  REQ023:747 03 22 28 9B 00 00 00 00       $  ANS023:74F 03 22 28 9B 00 00 00 00
  $  REQ024:747 03 22 28 9C 00 00 00 00       $  ANS024:74F 03 22 28 9C 00 00 00 00
  $  REQ025:747 03 22 28 9D 00 00 00 00       $  ANS025:74F 03 22 28 9D 00 00 00 00
  $  REQ026:747 03 22 28 9E 00 00 00 00       $  ANS026:74F 03 22 28 9E 00 00 00 00
  $  REQ027:747 03 22 28 9F 00 00 00 00       $  ANS027:74F 03 22 28 9F 00 00 00 00
  $  REQ028:747 03 22 28 A0 00 00 00 00       $  ANS028:74F 03 22 28 A0 00 00 00 00
  $  REQ029:747 03 22 28 A1 00 00 00 00       $  ANS029:74F 03 22 28 A1 00 00 00 00
  $  REQ030:747 03 22 28 A2 00 00 00 00       $  ANS030:74F 03 22 28 A2 00 00 00 00
  $  REQ031:747 03 22 28 A3 00 00 00 00       $  ANS031:74F 03 22 28 A3 00 00 00 00
  $  REQ032:747 03 22 28 A4 00 00 00 00       $  ANS032:74F 03 22 28 A4 00 00 00 00
  $  REQ033:747 03 22 28 A5 00 00 00 00       $  ANS033:74F 03 22 28 A5 00 00 00 00
  $  REQ034:747 03 22 28 A6 00 00 00 00       $  ANS034:74F 03 22 28 A6 00 00 00 00
  $  REQ035:747 03 22 28 A7 00 00 00 00       $  ANS035:74F 03 22 28 A7 00 00 00 00
  $  REQ036:747 03 22 28 A8 00 00 00 00       $  ANS036:74F 03 22 28 A8 00 00 00 00
  $  REQ037:747 03 22 28 A9 00 00 00 00       $  ANS037:74F 03 22 28 A9 00 00 00 00
  $  REQ038:747 03 22 28 AA 00 00 00 00       $  ANS038:74F 03 22 28 AA 00 00 00 00
  $  REQ039:747 03 22 28 AB 00 00 00 00       $  ANS039:74F 03 22 28 AB 00 00 00 00
  $  REQ040:747 03 22 28 AC 00 00 00 00       $  ANS040:74F 03 22 28 AC 00 00 00 00
  $  REQ041:747 03 22 28 AD 00 00 00 00       $  ANS041:74F 03 22 28 AD 00 00 00 00
  $  REQ042:747 03 22 28 AE 00 00 00 00       $  ANS042:74F 03 22 28 AE 00 00 00 00
  $  REQ043:747 03 22 28 AF 00 00 00 00       $  ANS043:74F 03 22 28 AF 00 00 00 00

  $  000.车外温度                                    $    $  ℃       $    $  ANS000.BYTE004  $  y=SPRINTF([%.1f],x1*0.5-40);
  $  001.车内温度                                    $    $  ℃       $    $  ANS001.BYTE004  $  y=SPRINTF([%.1f],x1*0.5-40);
  $  002.蒸发器温度                                  $    $  ℃       $    $  ANS002.BYTE004  $  y=SPRINTF([%.1f],x1*0.5-40);
  $  003.主驾吹面通道温度                            $    $  ℃       $    $  ANS003.BYTE004  $  y=SPRINTF([%.1f],x1*0.5-40);
  $  004.主驾吹脚通道温度                            $    $  ℃       $    $  ANS004.BYTE004  $  y=SPRINTF([%.1f],x1*0.5-40);
  $  005.副驾吹面通道温度                            $    $  ℃       $    $  ANS005.BYTE004  $  y=SPRINTF([%.1f],x1*0.5-40);
  $  006.副驾吹脚通道温度                            $    $  ℃       $    $  ANS006.BYTE004  $  y=SPRINTF([%.1f],x1*0.5-40);
  $  007.鼓风机PWM(脉宽调制)                         $    $  %        $    $  ANS007.BYTE004  $  y=x1;
  $  008.鼓风机两端反馈电压                          $    $  V        $    $  ANS008.BYTE004  $  y=SPRINTF([%d],x1*0.1);
  $  009.模式电机当前位置                            $    $  %        $    $  ANS009.BYTE004  $  y=x1;
  $  010.内外循环电机当前位置                        $    $  %        $    $  ANS010.BYTE004  $  y=x1;
  $  011.主驾冷暖电机当前位置                        $    $  %        $    $  ANS011.BYTE004  $  y=x1;
  $  012.副驾冷暖电机当前位置                        $    $  %        $    $  ANS012.BYTE004  $  y=x1;
  $  013.AC(空调控制器)请求状态                      $    $           $    $  ANS013.BYTE004  $  switxh(x1)0x00: y=@0044;0x01: y=@003f;default: y=@0001;
  $  014.电源电压                                    $    $           $    $  ANS014.BYTE004  $  if((x1>=90)&&(x1<=159)) y=SPRINTF([%.1f%],x1*0.1);else if(x1==160) y=@01e9;else if(x1==208) y=@01e8;else y=@0001;
  $  015.主驾设置温度                                $    $  ℃       $    $  ANS015.BYTE004  $  y=SPRINTF([%d],x1);
  $  016.副驾设置温度                                $    $  ℃       $    $  ANS016.BYTE004  $  y=SPRINTF([%d],x1);
  $  017.蒸发器设置温度                              $    $  ℃       $    $  ANS017.BYTE004  $  y=SPRINTF([%.1f],x1-20);
  $  018.风速LEVEL                                   $    $           $    $  ANS018.BYTE004  $  switxh(x1)0x00: y=@001e;0x01: y=@077b;0x02: y=@077c;0x03: y=@077d;0x04: y=@077e;0x05: y=@077f;0x06: y=@0780;0x07: y=@0781;default: y=@0001;
  $  019.出风模式                                    $    $           $    $  ANS019.BYTE004  $  switxh(x1)0x00: y=@006d;0x01: y=@006e;0x02: y=@006f;0x03: y=@0070;0x04: y=@0071;0x05: y=@0072;0x06: y=@0073;0x07: y=@0074;default: y=@0001;
  $  020.高压压力值                                  $    $           $    $  ANS020.BYTE004  $  y=SPRINTF([%.2f%s],(x1*256+x2)*0.01,@077a);
  $  021.空调散热风扇需求占空比                      $    $  %        $    $  ANS021.BYTE004  $  y=x1;
  $  022.BMS(电池管理系统)允许空调开启高压模块       $    $           $    $  ANS022.BYTE004  $  switxh(x1)0x00: y=@0003;0x01: y=@0196;0x02: y=@0195;0x03: y=@006c;default: y=@0001;
  $  023.OK灯状态                                    $    $           $    $  ANS023.BYTE004  $  switxh(x1)0x00: y=@0067;0x01: y=@0068;0x02: y=@0069;default: y=@0001;
  $  024.电池热管理需求                              $    $           $    $  ANS024.BYTE004  $  switxh(x1)0x00: y=@0060;0x01: y=@02d0;0x02: y=@02d1;0x03: y=@02d2;0x04: y=@02d3;0x05: y=@02d4;0x06: y=@02d5;0x07: y=@004c;default: y=@0001;
  $  025.直冷板出口冷媒压力/低压PT压力               $    $  Mpa      $    $  ANS025.BYTE004  $  y=SPRINTF([%.2f],(x1*256+x2)*0.01);
  $  026.直冷板出口冷媒温度/低压PT温度               $    $  ℃       $    $  ANS026.BYTE004  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1-20);
  $  027.电磁阀状态                                  $    $           $    $  ANS027.BYTE004  $  switxh(x1)0x00: y=@002a;0x01: y=@002b;default: y=@0001;
  $  028.电子膨胀阀位置                              $    $  %        $    $  ANS028.BYTE004  $  y=SPRINTF([%d],(x1*256+x2));
  $  029.空调请求开启发动机                          $    $           $    $  ANS029.BYTE004  $  switxh(x1)0x01: y=@0044;0x00: y=@003f;default: y=@0001;
  $  030.空调请求开发动机原因                        $    $           $    $  ANS030.BYTE004  $  switxh(x1)0x00: y=@03bd;0x01: y=@0785;0x02: y=@0786;0x03: y=@0787;0x04: y=@0788;0x05: y=@03c1;0x06: y=@0789;0x07: y=@078a;0x08: y=@078b;0x09: y=@078c;default: y=@0001;
  $  031.暖风水泵工作状态                            $    $           $    $  ANS031.BYTE004  $  if(x1==0) y=@004d;else if(x1==1) y=@004e;else if(x1==255) y=@069e;else y=@0001;
  $  032.电池冷却系统开启状态                        $    $           $    $  ANS032.BYTE004  $  if(x1==0) y=@0049;else if(x1==1) y=@004a;else if(x1==2) y=@004b;else if(x1==3) y=@004c;else if(x1==4) y=@001e;else y=@0001;
  $  033.主驾阳光传感器                              $    $           $    $  ANS033.BYTE004  $  if((x1>=0)&&(x1<=254)) y=SPRINTF([%.1fW/M2],x1*5);else if(x1==255) y=@069e;else y=@0001;
  $  034.电池热管理需求响应情况                      $    $           $    $  ANS034.BYTE004  $  if(x1==0) y=@0060;else if(x1==1) y=@03c8;else if(x1==2) y=@03c9;else if(x1==3) y=@004b;else if(x1==4) y=@004c;else if(x1==5) y=@078d;else if(x1==6) y=@078e;else y=@0001;
  $  035.板式换热器出口冷媒过热度                    $    $  ℃       $    $  ANS035.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=2046)) y=SPRINTF([%.1f],(x1*256+x2)*0.1);else y=@0003;
  $  036.电池热管理需求                              $    $           $    $  ANS036.BYTE004  $  if(x1==0) y=@0060;else if(x1==1) y=@02d0;else if(x1==2) y=@02d1;else if(x1==3) y=@03f9;else if(x1==4) y=@03fa;else if(x1==5) y=@03fb;else if(x1==6) y=@02d5;else if(x1==7) y=@004c;else y=@0001;
  $  037.玻璃温度信号                                $    $  %        $    $  ANS037.BYTE004  $  if((x1>=0)&&(x1<=200)) y=SPRINTF([%.1f],x1*0.5);else if(x1==255) y=@069e;else y=@0001;
  $  038.玻璃湿度信号                                $    $  %        $    $  ANS038.BYTE004  $  if((x1>=0)&&(x1<=200)) y=SPRINTF([%.1f],x1*0.5);else if(x1==255) y=@069e;else y=@0001;
  $  039.右侧阳光值                                  $    $  w/m2     $    $  ANS039.BYTE004  $  if((x1>=0)&&(x1<=254)) y=SPRINTF([%.5f],x1*4.01575);else if(x1==255) y=@069e;else y=@0001;
  $  040.左侧阳光值                                  $    $  w/m2     $    $  ANS040.BYTE004  $  if((x1>=0)&&(x1<=254)) y=SPRINTF([%.5f],x1*4.01575);else if(x1==255) y=@069e;else y=@0001;
  $  041.低压PTC(辅助加热)继电器A状态                $    $           $    $  ANS041.BYTE004  $  if(x1==0) y=@002a;else if(x1==1) y=@002b;else if(x1==255) y=@069e;else y=@0001;
  $  042.低压PTC(辅助加热)继电器B状态                $    $           $    $  ANS042.BYTE004  $  if(x1==0) y=@002a;else if(x1==1) y=@002b;else if(x1==255) y=@069e;else y=@0001;
  $  043.低压PTC(辅助加热)继电器C状态                $    $           $    $  ANS043.BYTE004  $  if(x1==0) y=@002a;else if(x1==1) y=@002b;else if(x1==255) y=@069e;else y=@0001;

  $)  05.内后视镜系统数据流
  $  05.内后视镜系统数据流
  $  REQ000:747 03 22 24 E2 00 00 00 00       $  ANS000:74F 03 22 24 E2 00 00 00 00
  $  REQ001:747 03 22 24 E3 00 00 00 00       $  ANS001:74F 03 22 24 E3 00 00 00 00

  $  000.内后视镜防眩工作状态         $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x00: y=@0782;0x01: y=@0783;0x02: y=@039c;0x03: y=@0784;default: y=@0001;
  $  001.内后视镜后光照强度AD值       $    $       $    $  ANS001.BYTE004  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=4094)) y=(x2*256+x1);else if((x2*256+x1)==4095) y=@0003;else y=@0001;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:747 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
