
    车型ID：3c0b

    模拟：协议模拟-->3c0b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7EB

进入命令:

  $~  REQ000:7E3 02 10 01 00 00 00 00 00       $~  ANS000:7EB 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E3 02 3E 80 00 00 00 00 00       $!  ANS000:7EB 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E3 03 19 02 09 00 00 00 00       $#  ANS000:7EB 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E3 04 14 FF FF FF 00 00 00       $$  ANS000:7EB 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E3 03 22 F1 93 00 00 00 00       $%  ANS000:7EB 03 22 F1 93 00 00 00 00
  $%  REQ001:7E3 03 22 F1 94 00 00 00 00       $%  ANS001:7EB 03 22 F1 94 00 00 00 00
  $%  REQ002:7E3 03 22 F1 95 00 00 00 00       $%  ANS002:7EB 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7E3 03 22 00 01 00 00 00 00       $  ANS000:7EB 03 22 00 01 00 00 00 00
  $  REQ001:7E3 03 22 00 02 00 00 00 00       $  ANS001:7EB 03 22 00 02 00 00 00 00
  $  REQ002:7E3 03 22 00 03 00 00 00 00       $  ANS002:7EB 03 22 00 03 00 00 00 00
  $  REQ003:7E3 03 22 00 04 00 00 00 00       $  ANS003:7EB 03 22 00 04 00 00 00 00
  $  REQ004:7E3 03 22 00 05 00 00 00 00       $  ANS004:7EB 03 22 00 05 00 00 00 00
  $  REQ005:7E3 03 22 00 06 00 00 00 00       $  ANS005:7EB 03 22 00 06 00 00 00 00
  $  REQ006:7E3 03 22 00 07 00 00 00 00       $  ANS006:7EB 03 22 00 07 00 00 00 00
  $  REQ007:7E3 03 22 00 08 00 00 00 00       $  ANS007:7EB 03 22 00 08 00 00 00 00
  $  REQ008:7E3 03 22 00 09 00 00 00 00       $  ANS008:7EB 03 22 00 09 00 00 00 00
  $  REQ009:7E3 03 22 00 0A 00 00 00 00       $  ANS009:7EB 03 22 00 0A 00 00 00 00
  $  REQ010:7E3 03 22 00 0B 00 00 00 00       $  ANS010:7EB 03 22 00 0B 00 00 00 00
  $  REQ011:7E3 03 22 00 0C 00 00 00 00       $  ANS011:7EB 03 22 00 0C 00 00 00 00
  $  REQ012:7E3 03 22 00 0D 00 00 00 00       $  ANS012:7EB 03 22 00 0D 00 00 00 00
  $  REQ013:7E3 03 22 00 0E 00 00 00 00       $  ANS013:7EB 03 22 00 0E 00 00 00 00
  $  REQ014:7E3 03 22 00 0F 00 00 00 00       $  ANS014:7EB 03 22 00 0F 00 00 00 00
  $  REQ015:7E3 03 22 00 10 00 00 00 00       $  ANS015:7EB 03 22 00 10 00 00 00 00
  $  REQ016:7E3 03 22 00 11 00 00 00 00       $  ANS016:7EB 03 22 00 11 00 00 00 00
  $  REQ017:7E3 03 22 00 12 00 00 00 00       $  ANS017:7EB 03 22 00 12 00 00 00 00

  $  000.驱动电机状态                                           $    $           $    $  ANS000.BYTE004  $  switxh((x1*256+x2))0x00: y=@0773;0x01: y=@0774;0x02: y=@0775;default: y=@0001;
  $  001.驱动电机控制器启动允许                                 $    $           $    $  ANS001.BYTE004  $  switxh((x1*256+x2))0x00: y=@013f;0x01: y=@01c5;default: y=@0001;
  $  002.驱动电机母线电压                                       $    $  V        $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.驱动电机转速                                           $    $  RPM      $    $  ANS003.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)-30000);
  $  004.驱动电机扭矩                                           $    $  N·M     $    $  ANS004.BYTE004  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1-500);
  $  005.驱动电机功率                                           $    $  kw       $    $  ANS005.BYTE004  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1-100);
  $  006.驱动电机控制器IGBT(绝缘栅双极型晶体管)散热器温度       $    $  ℃       $    $  ANS006.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)-40);
  $  007.驱动电机温度                                           $    $  ℃       $    $  ANS007.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)-40);
  $  008.驱动电机控制器IGBT(绝缘栅双极型晶体管)温度             $    $  ℃       $    $  ANS008.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)-40);
  $  009.驱动电机A相电流                                        $    $  A        $    $  ANS009.BYTE004  $  y=(x1*256+x2);
  $  010.驱动电机B相电流                                        $    $  A        $    $  ANS010.BYTE004  $  y=(x1*256+x2);
  $  011.驱动电机C相电流                                        $    $  A        $    $  ANS011.BYTE004  $  y=(x1*256+x2);
  $  012.驱动电机过载系数                                       $    $  %        $    $  ANS012.BYTE004  $  y=(x1*256+x2);
  $  013.桥臂状态                                               $    $           $    $  ANS013.BYTE004  $  if((x1*256+x2)==0) y=@0078;else if((x1*256+x2)==1) y=@017c;else if((x1*256+x2)==2) y=@017d;else if((x1*256+x2)==3) y=@017e;else y=@0001;
  $  014.售后软件版本号                                         $    $           $    $  ANS014.BYTE004  $  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $  015.电机零位值                                             $    $           $    $  ANS015.BYTE004  $  HEX(x1,x2);
  $  016.电机零位标定状态                                       $    $           $    $  ANS016.BYTE004  $  if((x1*256+x2)==0) y=@0776;else if((x1*256+x2)==1) y=@0221;else if((x1*256+x2)==2) y=@0777;else y=@0001;
  $  017.电机型号                                               $    $           $    $  ANS017.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $  018.电机流水号                                             $    $           $    $  ANS017.BYTE016  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);

  $)  01.OBD(车载诊断系统)信息
  $  01.OBD(车载诊断系统)信息
  $  REQ000:7E3 02 01 01 00 00 00 00 00       $  ANS000:7EB 02 01 01 00 00 00 00 00
  $  REQ001:7E3 02 01 05 00 00 00 00 00       $  ANS001:7EB 02 01 05 00 00 00 00 00
  $  REQ002:7E3 02 01 0C 00 00 00 00 00       $  ANS002:7EB 02 01 0C 00 00 00 00 00
  $  REQ003:7E3 02 01 0D 00 00 00 00 00       $  ANS003:7EB 02 01 0D 00 00 00 00 00
  $  REQ004:7E3 02 01 1C 00 00 00 00 00       $  ANS004:7EB 02 01 1C 00 00 00 00 00
  $  REQ005:7E3 02 01 41 00 00 00 00 00       $  ANS005:7EB 02 01 41 00 00 00 00 00
  $  REQ006:7E3 02 01 42 00 00 00 00 00       $  ANS006:7EB 02 01 42 00 00 00 00 00
  $  REQ007:7E3 02 02 02 00 00 00 00 00       $  ANS007:7EB 02 02 02 00 00 00 00 00
  $  REQ008:7E3 02 02 05 00 00 00 00 00       $  ANS008:7EB 02 02 05 00 00 00 00 00
  $  REQ009:7E3 02 02 0C 00 00 00 00 00       $  ANS009:7EB 02 02 0C 00 00 00 00 00
  $  REQ010:7E3 02 02 0D 00 00 00 00 00       $  ANS010:7EB 02 02 0D 00 00 00 00 00
  $  REQ011:7E3 02 02 41 00 00 00 00 00       $  ANS011:7EB 02 02 41 00 00 00 00 00
  $  REQ012:7E3 02 02 42 00 00 00 00 00       $  ANS012:7EB 02 02 42 00 00 00 00 00
  $  REQ013:7E3 02 09 04 00 00 00 00 00       $  ANS013:7EB 02 09 04 00 00 00 00 00
  $  REQ014:7E3 02 09 06 00 00 00 00 00       $  ANS014:7EB 02 09 06 00 00 00 00 00
  $  REQ015:7E3 02 09 0A 00 00 00 00 00       $  ANS015:7EB 02 09 0A 00 00 00 00 00

  $  000.存储的确认故障数量（故障信息清除后的监测状态）                  $    $           $    $  ANS000.BYTE003  $  y=x1&0x7F;
  $  001.模块指示的MIL(故障指示灯)状态（故障信息清除后的监测状态）       $    $           $    $  ANS000.BYTE003  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  002.失火监测支持（故障信息清除后的监测状态）                        $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  003.燃油系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  004.综合部件监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  005.失火监测准备（故障信息清除后的监测状态）                        $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  006.燃油系统监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  007.综合部件监测准备（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  008.催化器监测支持（故障信息清除后的监测状态）                      $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  009.加热型催化器监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  010.蒸发系统监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  011.二次空气系统监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  012.氧传感器监测支持（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  013.氧传感器加热监测支持（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  014.EGR/VVT监测支持（故障信息清除后的监测状态）                     $    $           $    $  ANS000.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  015.催化器监测完成（故障信息清除后的监测状态）                      $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  016.加热型催化器监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  017.蒸发系统监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  018.二次空气系统监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  019.氧传感器监测完成（故障信息清除后的监测状态）                    $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  020.氧传感器加热监测完成（故障信息清除后的监测状态）                $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  021.EGR/VVT监测完成（故障信息清除后的监测状态）                     $    $           $    $  ANS000.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  022.发动机出水冷却液温度                                            $    $  ℃       $    $  ANS001.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  023.发动机转速                                                      $    $  rpm      $    $  ANS002.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.25);
  $  024.车速                                                            $    $  Km/h     $    $  ANS003.BYTE003  $  y=x1;
  $  025.OBD(车载诊断系统)类型定义                                       $    $           $    $  ANS004.BYTE003  $  if(x1==1) y=@064d;else if(x1==2) y=@064e;else if(x1==3) y=@064f;else if(x1==4) y=@0650;else if(x1==5) y=@0651;else if(x1==6) y=@0652;else if(x1==7) y=@0653;else if(x1==8) y=@0654;else if(x1==9) y=@0655;else if(x1==10) y=@0656;else if(x1==11) y=@0657;else if(x1==12) y=@0658;else if(x1==13) y=@0659;else if(x1==14) y=@065a;else if(x1==15) y=@065b;else if(x1==16) y=@065c;else if(x1==17) y=@065d;else if(x1==18) y=@065e;else if(x1==19) y=@065f;else if(x1==20) y=@0660;else if(x1==21) y=@0661;else if(x1==22) y=@065c;else if(x1==23) y=@0662;else if(x1==24) y=@0663;else if(x1==25) y=@0664;else if(x1==26) y=@0665;else if(x1==27) y=@065c;else if(x1==28) y=@0666;else if(x1==29) y=@0667;else if(x1==30) y=@0668;else if(x1==31) y=@0669;else if(x1==32) y=@066a;else if(x1==33) y=@066b;else if(x1==34) y=@066c;else if(x1==35) y=@066d;else if(x1==36) y=@066e;else if(x1==37) y=@066f;else if(x1==38) y=@0670;else if(x1==39) y=@0671;else if(x1==40) y=@0672;else if(x1==41) y=@0673;else if(x1==42) y=@0674;else if(x1==43) y=@0675;else if((x1>=44)&&(x1<=250)) y=@0676;else if((x1>=250)&&(x1<=255)) y=@0677;else y=@0001;
  $  026.失火监测支持（当前驾驶循环的监测状态）                          $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  027.燃油系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  028.综合部件监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  029.失火监测准备（当前驾驶循环的监测状态）                          $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  030.燃油系统监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  031.综合部件监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  032.催化器监测支持（当前驾驶循环的监测状态）                        $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  033.加热型催化器监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  034.蒸发系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  035.二次空气系统监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  036.氧传感器监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  037.氧传感器加热监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  038.EGR/VVT监测支持（当前驾驶循环的监测状态）                       $    $           $    $  ANS005.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  039.催化器监测完成（当前驾驶循环的监测状态）                        $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  040.加热型催化器监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  041.蒸发系统监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  042.二次空气系统监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  043.氧传感器监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  044.氧传感器加热监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  045.EGR/VVT监测完成（当前驾驶循环的监测状态）                       $    $           $    $  ANS005.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  046.控制模块电压                                                    $    $  V        $    $  ANS006.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  047.造成冻结帧存储的故障代码                                        $    $           $    $  ANS007.BYTE003  $  HEX(x1,x2);
  $  048.发动机出水冷却液温度                                            $    $  ℃       $    $  ANS008.BYTE003  $  y=SPRINTF([%d],x1-40);
  $  049.发动机转速                                                      $    $  rpm      $    $  ANS009.BYTE003  $  y=SPRINTF([%.2f],(x1*256+x2)*0.25);
  $  050.车速                                                            $    $  Km/h     $    $  ANS010.BYTE003  $  y=x1;
  $  051.失火监测支持（当前驾驶循环的监测状态）                          $    $           $    $  ANS011.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  052.燃油系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  053.综合部件监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE004  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  054.失火监测准备（当前驾驶循环的监测状态）                          $    $           $    $  ANS011.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  055.燃油系统监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  056.综合部件监测准备（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE004  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  057.催化器监测支持（当前驾驶循环的监测状态）                        $    $           $    $  ANS011.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  058.加热型催化器监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS011.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  059.蒸发系统监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  060.二次空气系统监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS011.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  061.氧传感器监测支持（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  062.氧传感器加热监测支持（当前驾驶循环的监测状态）                  $    $           $    $  ANS011.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  063.EGR/VVT监测支持（当前驾驶循环的监测状态）                       $    $           $    $  ANS011.BYTE005  $  if(x1==0) y=@0606;else if(x1==1) y=@0755;else y=@0001;
  $  064.催化器监测完成（当前驾驶循环的监测状态）                        $    $           $    $  ANS011.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  065.加热型催化器监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS011.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  066.蒸发系统监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  067.二次空气系统监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS011.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  068.氧传感器监测完成（当前驾驶循环的监测状态）                      $    $           $    $  ANS011.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  069.氧传感器加热监测完成（当前驾驶循环的监测状态）                  $    $           $    $  ANS011.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  070.EGR/VVT监测完成（当前驾驶循环的监测状态）                       $    $           $    $  ANS011.BYTE006  $  if(x1==0) y=@0754;else if(x1==1) y=@03dd;else y=@0001;
  $  071.控制模块电压                                                    $    $  V        $    $  ANS012.BYTE003  $  y=SPRINTF([%.3f],(x1*256+x2)*0.001);
  $  072.标定识别符                                                      $    $           $    $  ANS013.BYTE003  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $  073.校验码                                                          $    $           $    $  ANS014.BYTE003  $  HEX(x1,x2,x3,x4);
  $  074.ECU名称                                                         $    $           $    $  ANS015.BYTE003  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E3 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
