
    车型ID：3c87

    模拟：协议模拟-->3c87

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~728

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:728 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 80 00 00 00 00 00       $!  ANS000:728 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:728 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/0e000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:728 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 93 00 00 00 00       $%  ANS000:728 03 22 F1 93 00 00 00 00
  $%  REQ001:720 03 22 F1 94 00 00 00 00       $%  ANS001:728 03 22 F1 94 00 00 00 00
  $%  REQ002:720 03 22 F1 95 00 00 00 00       $%  ANS002:728 03 22 F1 95 00 00 00 00
  $%  REQ003:720 03 22 F1 80 00 00 00 00       $%  ANS003:728 03 22 F1 80 00 00 00 00
  $%  REQ004:720 03 22 70 03 00 00 00 00       $%  ANS004:728 03 22 70 03 00 00 00 00
  $%  REQ005:720 03 22 60 03 00 00 00 00       $%  ANS005:728 03 22 60 03 00 00 00 00

  $%  000:硬件版本:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:              $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  002:软件编号:              $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:              $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  005:修改次数:              $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:boot版本号:            $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0197,x2,@019a,x3,@019b);
  $%  007:boot版本信息:          $%    $%  ANS003.BYTE007  $%  y=SPRINTF([%d.%d-%c-%c],x1/10,x1%10,x2,x3);
  $%  008:发布日期:              $%    $%  ANS003.BYTE010  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  009:显示板选择显示:        $%    $%  ANS004.BYTE004  $%  switxh(x1)0x00: y=@0507;0x01: y=@0508;0x02: y=@0509;0x03: y=@050a;default: y=@0001;
  $%  010:路由版本:              $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  011:版本号日期:            $%    $%  ANS005.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0197,x2,@0198,x3,@0199);
  $%  012:修改次数:              $%    $%  ANS005.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:720 03 22 00 02 00 00 00 00       $  ANS000:728 03 22 00 02 00 00 00 00
  $  REQ001:720 03 22 00 0A 00 00 00 00       $  ANS001:728 03 22 00 0A 00 00 00 00
  $  REQ002:720 03 22 00 0D 00 00 00 00       $  ANS002:728 03 22 00 0D 00 00 00 00
  $  REQ003:720 03 22 80 10 00 00 00 00       $  ANS003:728 03 22 80 10 00 00 00 00
  $  REQ004:720 03 22 90 00 00 00 00 00       $  ANS004:728 03 22 90 00 00 00 00 00
  $  REQ005:720 03 22 40 00 00 00 00 00       $  ANS005:728 03 22 40 00 00 00 00 00
  $  REQ006:720 03 22 40 01 00 00 00 00       $  ANS006:728 03 22 40 01 00 00 00 00
  $  REQ007:720 03 22 40 05 00 00 00 00       $  ANS007:728 03 22 40 05 00 00 00 00
  $  REQ008:720 03 22 40 02 00 00 00 00       $  ANS008:728 03 22 40 02 00 00 00 00
  $  REQ009:720 03 22 40 03 00 00 00 00       $  ANS009:728 03 22 40 03 00 00 00 00
  $  REQ010:720 03 22 40 04 00 00 00 00       $  ANS010:728 03 22 40 04 00 00 00 00
  $  REQ011:720 03 22 40 06 00 00 00 00       $  ANS011:728 03 22 40 06 00 00 00 00
  $  REQ012:720 03 22 40 07 00 00 00 00       $  ANS012:728 03 22 40 07 00 00 00 00

  $  000.序列号                                      $    $          $    $  ANS000.BYTE004  $  y=SPRINTF([%02X %02X %02X %02X %02X %02X],x6,x5,x4,x3,x2,x1);
  $  001.已匹配钥匙数                                $    $          $    $  ANS001.BYTE004  $  switxh(x1)0x00: y=@00e5;0x01: y=@00e6;0x02: y=@00e7;0x03: y=@00e8;0x04: y=@00e9;default: y=@0001;
  $  002.内部供电状况                                $    $          $    $  ANS002.BYTE004  $  switxh(x1)0x00: y=@00cb;0xFF: y=@00cc;default: y=@0001;
  $  003.钥匙状态                                    $    $          $    $  ANS002.BYTE007  $  switxh(x1)0x02: y=@00cd;0x03: y=@00ce;0x04: y=@00cf;0x06: y=@00d0;default: y=@0001;
  $  004.钥匙ID                                      $    $          $    $  ANS002.BYTE008  $  y=SPRINTF([%02X %02X %02X %02X],x4,x3,x2,x1);
  $  005.钥匙序号                                    $    $          $    $  ANS002.BYTE012  $  HEX(x1);
  $  006.左前门灯开关                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x01) y=@001d;else y=@001e;
  $  007.右前门灯开关                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x02) y=@001d;else y=@001e;
  $  008.左后门灯开关                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x04) y=@001d;else y=@001e;
  $  009.右后门灯开关                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x08) y=@001d;else y=@001e;
  $  010.后背门开关                                  $    $          $    $  ANS003.BYTE004  $  if(x1&0x10) y=@001d;else y=@001e;
  $  011.前舱盖状态                                  $    $          $    $  ANS003.BYTE004  $  if(x1&0x20) y=@001d;else y=@001e;
  $  012.左前门锁状态                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x40) y=@000a;else y=@0009;
  $  013.左后门锁状态                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x80) y=@000a;else y=@0009;
  $  014.右前门锁状态                                $    $          $    $  ANS003.BYTE005  $  if(x1&0x01) y=@000a;else y=@0009;
  $  015.右后门锁状态                                $    $          $    $  ANS003.BYTE005  $  if(x1&0x02) y=@000a;else y=@0009;
  $  016.行李箱解锁开关状态                          $    $          $    $  ANS003.BYTE005  $  if(x1&0x04) y=@000a;else y=@0009;
  $  017.硬线中控锁闭锁开关状态                      $    $          $    $  ANS003.BYTE005  $  if(x1&0x08) y=@000b;else y=@0003;
  $  018.硬线中控锁解锁开关状态                      $    $          $    $  ANS003.BYTE005  $  if(x1&0x10) y=@000b;else y=@0003;
  $  019.碰撞信号状态(PWM(脉宽调制))                 $    $          $    $  ANS003.BYTE005  $  switxh(x1&0x60)0x00: y=@00a8;0x20: y=@00a9;0x40: y=@00aa;0x60: y=@007b;default: y=@0001;
  $  020.门锁保护状态                                $    $          $    $  ANS003.BYTE006  $  switxh(x1&0x03)0x00: y=@0078;0x01: y=@00ab;0x02: y=@00ac;0x03: y=@00ad;default: y=@0001;
  $  021.12V制动信号状态                             $    $          $    $  ANS003.BYTE006  $  if(x1&0x04) y=@0002;else y=@0003;
  $  022.0V制动灯开关状态                            $    $          $    $  ANS003.BYTE006  $  if(x1&0x08) y=@0002;else y=@0003;
  $  023.启动信号1状态                               $    $          $    $  ANS003.BYTE006  $  if(x1&0x10) y=@000b;else y=@009d;
  $  024.启动信号2状态                               $    $          $    $  ANS003.BYTE006  $  if(x1&0x20) y=@000b;else y=@009d;
  $  025.ACC电状态                                   $    $          $    $  ANS003.BYTE006  $  if(x1&0x40) y=@001d;else y=@001e;
  $  026.IG1(点火1)电状态                            $    $          $    $  ANS003.BYTE006  $  if(x1&0x80) y=@001d;else y=@001e;
  $  027.IG2(点火2)电状态                            $    $          $    $  ANS003.BYTE007  $  if(x1&0x01) y=@001d;else y=@001e;
  $  028.IG3(点火3)电状态                            $    $          $    $  ANS003.BYTE007  $  if(x1&0x02) y=@001d;else y=@001e;
  $  029.IG4(点火4)电状态                            $    $          $    $  ANS003.BYTE007  $  if(x1&0x04) y=@001d;else y=@001e;
  $  030.自复位告警开关状态                          $    $          $    $  ANS003.BYTE007  $  if(x1&0x08) y=@000b;else y=@0003;
  $  031.小灯开关状态                                $    $          $    $  ANS003.BYTE007  $  if(x1&0x10) y=@0002;else y=@0003;
  $  032.近光灯开关状态                              $    $          $    $  ANS003.BYTE007  $  if(x1&0x20) y=@0002;else y=@0003;
  $  033.远光灯开关状态                              $    $          $    $  ANS003.BYTE007  $  if(x1&0x40) y=@0002;else y=@0003;
  $  034.超车灯开关状态                              $    $          $    $  ANS003.BYTE007  $  if(x1&0x80) y=@0002;else y=@0003;
  $  035.后雾灯开关状态                              $    $          $    $  ANS003.BYTE008  $  if(x1&0x01) y=@0002;else y=@0003;
  $  036.左转向灯开关状态                            $    $          $    $  ANS003.BYTE008  $  if(x1&0x02) y=@0002;else y=@0003;
  $  037.右转向灯开关状态                            $    $          $    $  ANS003.BYTE008  $  if(x1&0x04) y=@0002;else y=@0003;
  $  038.AUTO(自动)灯开关状态                        $    $          $    $  ANS003.BYTE008  $  if(x1&0x08) y=@0002;else y=@0003;
  $  039.充电口盖开关状态                            $    $          $    $  ANS003.BYTE008  $  if(x1&0x10) y=@001d;else y=@001e;
  $  040.主驾安全带未系信号检测                      $    $          $    $  ANS003.BYTE008  $  if(x1&0x20) y=@02ee;else y=@02ef;
  $  041.副驾安全带未系信号检测                      $    $          $    $  ANS003.BYTE008  $  if(x1&0x40) y=@02ee;else y=@02ef;
  $  042.副驾座椅传感器信号采集                      $    $          $    $  ANS003.BYTE008  $  if(x1&0x80) y=@032a;else y=@032b;
  $  043.喇叭开关状态                                $    $          $    $  ANS003.BYTE009  $  if(x1&0x01) y=@000b;else y=@0003;
  $  044.交流充电枪电锁状态                          $    $          $    $  ANS003.BYTE009  $  if(x1&0x02) y=@02db;else y=@02dc;
  $  045.前雨刮HI(高速)档状态                        $    $          $    $  ANS003.BYTE009  $  if(x1&0x04) y=@0002;else y=@0003;
  $  046.前雨刮复位状态                              $    $          $    $  ANS003.BYTE009  $  if(x1&0x08) y=@0002;else y=@0003;
  $  047.后雨刮复位状态                              $    $          $    $  ANS003.BYTE009  $  if(x1&0x10) y=@0002;else y=@0003;
  $  048.转向轴锁配置情况                            $    $          $    $  ANS003.BYTE009  $  if(x1&0x20) y=@00b0;else y=@00b3;
  $  049.车型                                        $    $          $    $  ANS003.BYTE010  $  switxh(x1)0x00: y=@034b;0x01: y=@034c;0x02: y=@034d;0x03: y=@034e;0x04: y=@034f;0x05: y=@0350;0x06: y=@0351;0x07: y=@0352;0x08: y=@0353;0x09: y=@0354;0x0A: y=@0355;0x0B: y=@0356;0x0C: y=@0357;0x0D: y=@0358;0x0E: y=@0359;0x0F: y=@035a;0x10: y=@0359;0x11: y=@035b;0x12: y=@0359;0x13: y=@035c;0x14: y=@035d;0x15: y=@0359;0x16: y=@035e;0x17: y=@035f;0x18: y=@0360;0x19: y=@0361;0x1A: y=@0362;0x1B: y=@0817;0x1C: y=@0364;0x1D: y=@0365;0x1E: y=@0366;0x1F: y=@0367;0x20: y=@0818;0x21: y=@0369;0x22: y=@036a;0x23: y=@036b;0x24: y=@036c;0x25: y=@036d;0x26: y=@036e;0x27: y=@036f;0x28: y=@0370;0x29: y=@0371;0x2A: y=@0819;0x2B: y=@081a;0x2C: y=@0374;0x2D: y=@0359;0x2E: y=@0375;0x2F: y=@081b;0x30: y=@0377;0x31: y=@0378;0x32: y=@0379;0x33: y=@037a;0x34: y=@0359;0x35: y=@0359;0x36: y=@037b;0x37: y=@0359;0x38: y=@0359;0x39: y=@0359;0x3A: y=@037c;0x3B: y=@0359;0x3C: y=@0359;0x3D: y=@0359;0x3E: y=@037d;0x3F: y=@0359;0x40: y=@0359;0x41: y=@0359;0x42: y=@037e;0x43: y=@0359;0x44: y=@037f;0x45: y=@081c;0x46: y=@081d;0x47: y=@0359;0x48: y=@0359;0x49: y=@0382;0x4A: y=@0359;0x4B: y=@028f;0x4C: y=@0383;0x4D: y=@0384;0x4E: y=@0385;0x4F: y=@0386;0x50: y=@0387;0x51: y=@0359;0x52: y=@0388;0x53: y=@081e;0x54: y=@038a;0x55: y=@038b;0x56: y=@0359;0x57: y=@081f;0x58: y=@0820;0x59: y=@0359;0x5A: y=@0359;0x5B: y=@0359;0x5C: y=@038e;0x5D: y=@038f;0x5E: y=@0821;0x5F: y=@0391;0x60: y=@0291;0x61: y=@0392;0x62: y=@0290;0x63: y=@0393;0x64: y=@0588;0x65: y=@0589;0x66: y=@058a;0x67: y=@058b;0x68: y=@058c;0x69: y=@058d;0x6A: y=@0293;0x6B: y=@0359;0x6C: y=@0359;0x6D: y=@058e;0x6E: y=@058f;0x6F: y=@0590;0x70: y=@0591;0x71: y=@0592;0x72: y=@0593;0x73: y=@0594;0x74: y=@0595;0x75: y=@0596;0x76: y=@0597;0x77: y=@0598;0x78: y=@0599;0x79: y=@082e;default: y=@0001;
  $  050.驻车辅助系统配置类型                        $    $          $    $  ANS004.BYTE004  $  switxh(x1)0x00: y=@053a;0x01: y=@007b;0x02: y=@053b;0x03: y=@053c;0x04: y=@053d;0x05: y=@053e;0x06: y=@053f;0x07: y=@007b;0x08: y=@0540;default: y=@0001;
  $  051.读取风速                                    $    $  级      $    $  ANS005.BYTE004  $  y=x1&0x0F;
  $  052.读取模式                                    $    $          $    $  ANS005.BYTE004  $  switxh(x1&0xF0)0x00: y=@006d;0x10: y=@006e;0x20: y=@006f;0x30: y=@0070;0x40: y=@0071;0x50: y=@0072;0x60: y=@0073;0x70: y=@0074;default: y=@0001;
  $  053.模式电机位置百分比                          $    $  %       $    $  ANS005.BYTE005  $  if((x1>0)&&(x1<100)) y=x1;else if(x1==0) y=@082f;else if(x1==100) y=@0830;else if(x1==255) y=@0831;else y=@0001;
  $  054.车外温度                                    $    $  ℃      $    $  ANS005.BYTE006  $  if((x1>=88)&&(x1<=178)) y=x1-128;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else y=@0001;
  $  055.车内温度                                    $    $  ℃      $    $  ANS005.BYTE007  $  if((x1>=88)&&(x1<=207)) y=x1-128;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else y=@0001;
  $  056.压力信息（压力开关）                        $    $          $    $  ANS005.BYTE008  $  switxh(x1&0x03)0x00: y=@0003;0x01: y=@02df;0x02: y=@02e0;0x03: y=@02cf;default: y=@0001;
  $  057.空调风扇需求档位                            $    $          $    $  ANS005.BYTE008  $  switxh(x1&0x1C)0x00: y=@0003;0x04: y=@001e;0x08: y=@02dd;0x0C: y=@0837;0x10: y=@02cf;default: y=@0001;
  $  058.内外循环电机位置百分比                      $    $  %       $    $  ANS005.BYTE010  $  if((x1>0)&&(x1<100)) y=x1;else if(x1==0) y=@0838;else if(x1==100) y=@0839;else if(x1==255) y=@0831;else y=@0001;
  $  059.目标蒸发器温度                              $    $  ℃      $    $  ANS005.BYTE011  $  if((x1>=0)&&(x1<=60)) y=x1-20;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  060.实际蒸发器温度                              $    $  ℃      $    $  ANS006.BYTE004  $  if((x1>=0)&&(x1<=60)) y=x1-20;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  061.目标通道温度                                $    $  ℃      $    $  ANS006.BYTE005  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  062.主驾吹面通道温度                            $    $  ℃      $    $  ANS006.BYTE006  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  063.主驾吹脚通道温度                            $    $  ℃      $    $  ANS006.BYTE007  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  064.BMS(电池管理系统)允许空调高压放电状态       $    $          $    $  ANS006.BYTE009  $  switxh(x1&0x03)0x00: y=@0003;0x01: y=@0196;0x02: y=@0195;default: y=@0001;
  $  065.空调高压模块状态                            $    $          $    $  ANS006.BYTE009  $  switxh(x1&0x1C)0x00: y=@02c9;0x04: y=@02ca;0x08: y=@02cb;0x0C: y=@02cc;default: y=@0001;
  $  066.电动压缩机状态                              $    $          $    $  ANS006.BYTE009  $  if(x1&0x20) y=@0044;else y=@003f;
  $  067.电动压缩机需求占空比                        $    $  %       $    $  ANS006.BYTE010  $  y=x1;
  $  068.副驾冷暖电机位置百分比                      $    $  %       $    $  ANS007.BYTE009  $  if((x1>=1)&&(x1<=99)) y=x1;else if(x1==0) y=@0835;else if(x1==100) y=@0836;else if(x1==255) y=@0834;else y=@0001;
  $  069.蒸发器端电子膨胀阀位置                      $    $  %       $    $  ANS008.BYTE004  $  if((x1>=1)&&(x1<=99)) y=x1;else if(x1==0) y=@0832;else if(x1==100) y=@0833;else if(x1==255) y=@0834;else y=@0001;
  $  070.蒸发器出口冷媒温度                          $    $  ℃      $    $  ANS008.BYTE005  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=32763)) y=SPRINTF([%.1f],(x2*256+x1)*0.1);else if((x2*256+x1)==32764) y=@01e4;else if((x2*256+x1)==32765) y=@01e3;else if(((x2*256+x1)>=32766)&&((x2*256+x1)<=65535)) y=SPRINTF([%.1f],((x2*256+x1)-65535)*0.1);else y=@0001;
  $  071.蒸发器出口压力                              $    $  MPA     $    $  ANS008.BYTE007  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=65534)) y=SPRINTF([%.3f],(x2*256+x1)*0.001);else y=@0003;
  $  072.蒸发器出口冷媒过热度                        $    $  ℃      $    $  ANS008.BYTE009  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=32766)) y=SPRINTF([%.1f],(x2*256+x1)*0.1);else if(((x2*256+x1)>=32768)&&((x2*256+x1)<=65535)) y=SPRINTF([%.1f],((x2*256+x1)-65535)*0.1);else if((x2*256+x1)==32767) y=@00da;else y=@0001;
  $  073.电池热管理需求                              $    $          $    $  ANS009.BYTE004  $  if((x1&0x07)==0x00) y=@0060;else if((x1&0x07)==0x01) y=@02d0;else if((x1&0x07)==0x02) y=@02d1;else if((x1&0x07)==0x03) y=@02d2;else if((x1&0x07)==0x04) y=@02d3;else if((x1&0x07)==0x05) y=@02d4;else if((x1&0x07)==0x06) y=@02d5;else if((x1&0x07)==0x07) y=@004c;else y=@0001;
  $  074.电池热管理实际响应状态                      $    $          $    $  ANS009.BYTE004  $  if((x1&0x38)==0x00) y=@001e;else if((x1&0x38)==0x08) y=@02d0;else if((x1&0x38)==0x10) y=@02d1;else if((x1&0x38)==0x18) y=@004b;else if((x1&0x38)==0x20) y=@007b;else if((x1&0x38)==0x28) y=@007b;else if((x1&0x38)==0x30) y=@02d5;else if((x1&0x38)==0x38) y=@004c;else y=@0001;
  $  075.板换端电子膨胀阀位置                        $    $  %       $    $  ANS009.BYTE005  $  if((x1>=1)&&(x1<=99)) y=x1;else if(x1==0) y=@0832;else if(x1==100) y=@0833;else if(x1==255) y=@0834;else y=@0001;
  $  076.板换出口侧冷却液温度信息                    $    $  ℃      $    $  ANS009.BYTE006  $  if((x1>=0)&&(x1<=90)) y=x1-20;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else y=@0001;
  $  077.电池热管理电动水泵占空比                    $    $  %       $    $  ANS009.BYTE007  $  y=x1;
  $  078.电池热管理电动水泵反馈转速                  $    $  rpm     $    $  ANS009.BYTE008  $  y=SPRINTF([%d],x1*100);
  $  079.采暖目标PTC(辅助加热)水温                   $    $  ℃      $    $  ANS010.BYTE004  $  if((x1>=0)&&(x1<=160)) y=x1-40;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  080.当前实际PTC(辅助加热)水温                   $    $  ℃      $    $  ANS010.BYTE005  $  if((x1>=0)&&(x1<=170)) y=x1-50;else if(x1==208) y=@01e4;else if(x1==216) y=@01e3;else if(x1==255) y=@02cf;else y=@0001;
  $  081.PTC(辅助加热)水加热器目标占空比             $    $  %       $    $  ANS010.BYTE006  $  if((x1>=0)&&(x1<=100)) y=x1;else if(x1==255) y=@02cf;else y=@0001;
  $  082.空调采暖电动水泵继电器控制                  $    $          $    $  ANS010.BYTE007  $  if((x1&0x03)==0x00) y=@0003;else if((x1&0x03)==0x01) y=@002b;else if((x1&0x03)==0x02) y=@002a;else if((x1&0x03)==0xFF) y=@02cf;else y=@0001;
  $  083.电池加热四通阀位置                          $    $          $    $  ANS010.BYTE007  $  if((x1&0x0C)==0x00) y=@02eb;else if((x1&0x0C)==0x04) y=@02ec;else if((x1&0x0C)==0x08) y=@02ed;else if((x1&0x0C)==0x0C) y=@02cf;else y=@0001;
  $  084.热管理水泵启停命令                          $    $          $    $  ANS011.BYTE006  $  if(x1==0) y=@004d;else if(x1==1) y=@004e;else y=@0001;
  $  085.风加热主驾PTC(辅助加热)占空比               $    $  %       $    $  ANS011.BYTE005  $  y=x1;
  $  086.热管理水泵启停命令                          $    $          $    $  ANS012.BYTE006  $  if(x1==0) y=@004d;else if(x1==1) y=@004e;else y=@0001;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
