
    车型ID：a27b

    模拟：协议模拟-->a27b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~729

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 01 00 00 00 00 00       $!  ANS000:729 02 3E 01 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 04 18 00 00 FF 00 00 00       $#  ANS000:729 04 18 00 00 FF 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE02 控制故障码个数，从$#ANS000.BYTE3$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a27b0000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 03 14 00 FF 00 00 00 00       $$  ANS000:729 03 14 00 FF 00 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 00 01 00 00 00 00       $%  ANS000:729 03 22 00 01 00 00 00 00
  $%  REQ001:721 03 22 00 03 00 00 00 00       $%  ANS001:729 03 22 00 03 00 00 00 00

  $%  000:软件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  001:软件版本:        $%    $%  ANS000.BYTE007  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  002:硬件版本:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  003:硬件日期:        $%    $%  ANS001.BYTE007  $%  y=SPRINTF([%d/%d/%d],x1,x2,x3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000.左前门灯开关监测               $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@001d; else y=@001e;
  $  001.右前门灯开关监测               $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@001d; else y=@001e;
  $  002.左后门灯开关监测               $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@001d; else y=@001e;
  $  003.右后门灯开关监测               $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@001d; else y=@001e;
  $  004.行李箱开关监测                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@001d; else y=@001e;
  $  005.左前门锁状态                   $    $       $    $  ANS000.BYTE004  $  if(x1&0x20) y=@000a; else y=@0009;
  $  006.左后门锁状态                   $    $       $    $  ANS000.BYTE004  $  if(x1&0x40) y=@000a; else y=@0009;
  $  007.右前门锁状态                   $    $       $    $  ANS000.BYTE004  $  if(x1&0x80) y=@000a; else y=@0009;
  $  008.右后门锁状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@000a; else y=@0009;
  $  009.行李箱微动开关                 $    $       $    $  ANS000.BYTE005  $  if(((x1&0x03)==0)||((x1&0x03)==1)) y=@000b;else y=@009d;
  $  010.发动机前舱盖状态               $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@001d; else y=@001e;
  $  011.安全带未系信号监测             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@04ed; else y=@0b46;
  $  012.12V制动信号状态                $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0002; else y=@0003;
  $  013.0V制动灯开关状态               $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0002; else y=@0003;
  $  014.启动按钮1脚状态                $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@000b; else y=@0b47;
  $  015.启动按钮4脚状态                $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@000b; else y=@009d;
  $  016.离合踏板状态                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0118; else y=@0117;
  $  017.起动机继电器状态               $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@002b; else y=@002a;
  $  018.左前门中控锁闭锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@000b; else y=@0003;
  $  019.左前门中控锁解锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@000b; else y=@0003;
  $  020.右前门中控锁闭锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@000b; else y=@0003;
  $  021.右前门中控锁解锁开关状态       $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@000b; else y=@0003;
  $  022.硬件碰撞信号状态               $    $       $    $  ANS000.BYTE006  $  if(x1&0x40) y=@03eb; else y=@03ec;
  $  023.IG1(点火1)电状态               $    $       $    $  ANS000.BYTE006  $  if(x1&0x80) y=@0010; else y=@0012;
  $  024.ACC电状态                      $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0010; else y=@0012;
  $  025.外后视镜折叠开关状态           $    $       $    $  ANS000.BYTE007  $  if(((x1&0x0F)>0x03)&&((x1&0x0F)<0x08)) y=@03f0;else if(((x1&0x0F)>0x07)&&((x1&0x0F)<0x0C)) y=@03f1;else y=@0003;
  $  026.机械钥匙闭锁开关状态           $    $       $    $  ANS000.BYTE007  $  if((x1&0x0F)<0x08) y=@0003;else y=@0009;
  $  027.机械钥匙解锁开关状态           $    $       $    $  ANS000.BYTE007  $  if((x1&0x1F)<0x10) y=@0003;else y=@000a;
  $  028.行李箱安全系统开启状态         $    $       $    $  ANS000.BYTE007  $  if(x1&0x20) y=@001d; else y=@001e;
  $  029.自复位开关告警状态             $    $       $    $  ANS000.BYTE007  $  if(x1&0x40) y=@000b; else y=@0003;
  $  030.自锁式告警开关状态             $    $       $    $  ANS000.BYTE007  $  if(x1&0x80) y=@000b; else y=@0003;
  $  031.电动外后视镜翻转调节           $    $       $    $  ANS000.BYTE008  $  if((x1&0x0F)==0) y=@009f;else if((x1&0x0F)==1) y=@04e5;else if((x1&0x0F)==2) y=@04e6;else if((x1&0x0F)==3) y=@04e7;else if((x1&0x0F)==4) y=@04e8;else if((x1&0x0F)==5) y=@04e9;else if((x1&0x0F)==6) y=@04ea;else if((x1&0x0F)==7) y=@04eb;else if((x1&0x0F)==8) y=@04ec;else y=@0525;
  $  032.电动外后视镜左右选择           $    $       $    $  ANS000.BYTE008  $  if((x1&0x7F)<0x20) y=@0003;else if((x1&0x7F)<0x40) y=@04e3;else if((x1&0x7F)<0x60) y=@04e4;else y=@0525;
  $  033.门锁保护状态                   $    $       $    $  ANS000.BYTE009  $  if((x1&0x3F)<0x10) y=@0078;else if((x1&0x7F)<0x20) y=@04e1;else if((x1&0x7F)<0x30) y=@01ef;else y=@0af0;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:721 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
