
    车型ID：a2ad

    模拟：协议模拟-->a2ad

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~729

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 04 18 00 00 FF 00 00 00       $#  ANS000:729 04 18 00 00 FF 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE3$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a2ad0000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 03 14 00 FF 00 00 00 00       $$  ANS000:729 03 14 00 FF 00 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 00 01 00 00 00 00       $%  ANS000:729 03 22 00 01 00 00 00 00
  $%  REQ001:721 03 22 00 03 00 00 00 00       $%  ANS001:729 03 22 00 03 00 00 00 00

  $%  000:软件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  001:软件日期:        $%    $%  ANS000.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);
  $%  002:硬件版本:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  003:硬件日期:        $%    $%  ANS001.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000.左前门灯开关检测                  $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@001d;else y=@001e;
  $  001.右前门灯开关检测                  $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@001d;else y=@001e;
  $  002.左后门灯开关检测                  $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@001d;else y=@001e;
  $  003.右后门灯开关检测                  $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@001d;else y=@001e;
  $  004.行李箱开关检测                    $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@001d;else y=@001e;
  $  005.左前门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x20) y=@000a;else y=@0009;
  $  006.左后门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x40) y=@000a;else y=@0009;
  $  007.右前门锁状态                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x80) y=@000a;else y=@0009;
  $  008.右后门锁状态                      $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@000a;else y=@0009;
  $  009.行李箱开关状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0b47;else y=@000b;
  $  010.发动机前舱盖状态                  $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@001d;else y=@001e;
  $  011.安全带未系信号检测                $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@04ed;else y=@002d;
  $  012.12V制动信号状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0002;else y=@0003;
  $  013.0V制动灯开关状态                  $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0002;else y=@0003;
  $  014.启动按钮1脚状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@009d;else y=@000b;
  $  015.启动按钮4脚状态                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@009d;else y=@000b;
  $  016.离合踏板状态                      $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0118;else y=@0117;
  $  017.起动机继电器状态                  $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@002b;else y=@002a;
  $  018.左前中枢锁闭锁开关状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@000b;else y=@0003;
  $  019.左前门中控锁解锁开关状态          $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@000b;else y=@0003;
  $  020.右前门中控锁闭锁开关状态          $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@000b;else y=@0003;
  $  021.右前门中控锁解锁开关状态          $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@000b;else y=@0003;
  $  022.IG1(点火1)电状态                  $    $       $    $  ANS000.BYTE006  $  if(x1&0x80) y=@0173;else y=@0172;
  $  023.ACC电状态                         $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0173;else y=@0172;
  $  024.外后视镜折叠开关状态              $    $       $    $  ANS000.BYTE007  $  if((x1&0x06)==0) y=@03ef;else if((x1&0x06)==2) y=@03f0;else if((x1&0x06)==4) y=@03f1;else y=@0003;
  $  025.行李箱安全系统开启状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x20) y=@001d;else y=@001e;
  $  026.自复位开关告警状态                $    $       $    $  ANS000.BYTE007  $  if(x1&0x40) y=@000b;else y=@0003;
  $  027.自锁式告警开关状态                $    $       $    $  ANS000.BYTE007  $  if(x1&0x80) y=@000b;else y=@0003;
  $  028.电动外后视镜翻转调节              $    $       $    $  ANS000.BYTE008  $  if((x1&0x0f)==0) y=@009f;else if((x1&0x0f)==0x01) y=@04e5;else if((x1&0x0f)==0x02) y=@04e6;else if((x1&0x0f)==0x03) y=@04e7;else if((x1&0x0f)==0x04) y=@04e8;else if((x1&0x0f)==0x05) y=@04e9;else if((x1&0x0f)==0x06) y=@04ea;else if((x1&0x0f)==0x07) y=@04eb;else if((x1&0x0f)==0x08) y=@04ec;else y=@0525;
  $  029.电动外后视镜左右选择              $    $       $    $  ANS000.BYTE008  $  if((x1&0x30)==0x10) y=@04e3;else if((x1&0x30)==0x20) y=@04e4;else if((x1&0x30)==0) y=@0003;else y=@0525;
  $  030.近光灯硬件开关状态                $    $       $    $  ANS000.BYTE008  $  if(x1&0x40) y=@000b;else y=@0003;
  $  031.雨刮复位状态                      $    $       $    $  ANS000.BYTE008  $  if(x1&0x80) y=@0b4e;else y=@0b4f;
  $  032.远光灯执行状态反馈                $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@001d;else y=@001e;
  $  033.近光灯执行状态反馈                $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@000b;else y=@009d;
  $  034.前雨刮硬件信号驱动状态            $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@000b;else y=@0003;
  $  035.门锁保护状态                      $    $       $    $  ANS000.BYTE009  $  if((x1&0x18)==0) y=@0078;else if((x1&0x18)==0x10) y=@01ef;else y=@0a79;
  $  036.碰撞信号状态(PWM(脉宽调制))       $    $       $    $  ANS000.BYTE009  $  if((x1&0xc0)==0x40) y=@0200;else if((x1&0xc0)==0x80) y=@0087;else if((x1&0xc0)==0xc0) y=@0003;else y=@0078;

  $)  01.防盗报警记录
  $  01.防盗报警记录
  $  REQ000:721 03 22 01 09 00 00 00 00       $  ANS000:729 03 22 01 09 00 00 00 00

  $  000.数据标识             $    $       $    $  ANS000.BYTE004  $  if(x1==0x11) y=@0002;else y=@0003;
  $  001.驾驶侧车门           $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.副驾驶侧车门         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.左后车门             $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.右后车门             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.行李箱盖             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.IG1(点火1)电         $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.驾驶侧车门锁         $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  008.左后门锁             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  009.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  010.右后车门锁           $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  011.前舱盖               $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  012.数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013.数据标识             $    $       $    $  ANS000.BYTE008  $  if(x1==0x11) y=@0002;else y=@0003;
  $  014.驾驶侧车门           $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  015.副驾驶侧车门         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  016.左后车门             $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  017.右后车门             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  018.行李箱盖             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  019.IG1(点火1)电         $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  020.驾驶侧车门锁         $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  021.左后门锁             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  022.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  023.右后车门锁           $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  024.前舱盖               $    $       $    $  ANS000.BYTE010  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  025.数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026.数据标识             $    $       $    $  ANS000.BYTE012  $  if(x1==0x11) y=@0002;else y=@0003;
  $  027.驾驶侧车门           $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  028.副驾驶侧车门         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  029.左后车门             $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  030.右后车门             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  031.行李箱盖             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  032.IG1(点火1)电         $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  033.驾驶侧车门锁         $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  034.左后门锁             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  035.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  036.右后车门锁           $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  037.前舱盖               $    $       $    $  ANS000.BYTE014  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  038.数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039.数据标识             $    $       $    $  ANS000.BYTE016  $  if(x1==0x11) y=@0002;else y=@0003;
  $  040.驾驶侧车门           $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  041.副驾驶侧车门         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  042.左后车门             $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  043.右后车门             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  044.行李箱盖             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  045.IG1(点火1)电         $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  046.驾驶侧车门锁         $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  047.左后门锁             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  048.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  049.右后车门锁           $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  050.前舱盖               $    $       $    $  ANS000.BYTE018  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  051.数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052.数据标识             $    $       $    $  ANS000.BYTE020  $  if(x1==0x11) y=@0002;else y=@0003;
  $  053.驾驶侧车门           $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  054.副驾驶侧车门         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  055.左后车门             $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  056.右后车门             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  057.行李箱盖             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  058.IG1(点火1)电         $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  059.驾驶侧车门锁         $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  060.左后门锁             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  061.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  062.右后车门锁           $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  063.前舱盖               $    $       $    $  ANS000.BYTE022  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  064.数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065.数据标识             $    $       $    $  ANS000.BYTE024  $  if(x1==0x11) y=@0002;else y=@0003;
  $  066.驾驶侧车门           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  067.副驾驶侧车门         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  068.左后车门             $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  069.右后车门             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  070.行李箱盖             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  071.IG1(点火1)电         $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  072.驾驶侧车门锁         $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  073.左后门锁             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  074.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  075.右后车门锁           $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  076.前舱盖               $    $       $    $  ANS000.BYTE026  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  077.数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078.数据标识             $    $       $    $  ANS000.BYTE028  $  if(x1==0x11) y=@0002;else y=@0003;
  $  079.驾驶侧车门           $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  080.副驾驶侧车门         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  081.左后车门             $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  082.右后车门             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  083.行李箱盖             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  084.IG1(点火1)电         $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  085.驾驶侧车门锁         $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  086.左后门锁             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  087.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  088.右后车门锁           $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  089.前舱盖               $    $       $    $  ANS000.BYTE030  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  090.数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091.数据标识             $    $       $    $  ANS000.BYTE032  $  if(x1==0x11) y=@0002;else y=@0003;
  $  092.驾驶侧车门           $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  093.副驾驶侧车门         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  094.左后车门             $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  095.右后车门             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  096.行李箱盖             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  097.IG1(点火1)电         $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  098.驾驶侧车门锁         $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  099.左后门锁             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  100.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  101.右后车门锁           $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  102.前舱盖               $    $       $    $  ANS000.BYTE034  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  103.数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.门锁闭锁记录
  $  02.门锁闭锁记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00

  $  000.数据标识               $    $       $    $  ANS000.BYTE004  $  if(x1==0x12) y=@0002;else y=@0003;
  $  001.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.驾驶侧中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.遥控信号               $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.超速闭锁               $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.自动返回防盗           $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.左前门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.右前门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  008.后背门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  009.远程遥控闭锁           $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  010.数据索引               $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  011.数据标识               $    $       $    $  ANS000.BYTE008  $  if(x1==0x12) y=@0002;else y=@0003;
  $  012.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  013.驾驶侧中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  014.遥控信号               $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  015.超速闭锁               $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  016.自动返回防盗           $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  017.左前门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  018.右前门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  019.后背门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  020.远程遥控闭锁           $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  021.数据索引               $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  022.数据标识               $    $       $    $  ANS000.BYTE012  $  if(x1==0x12) y=@0002;else y=@0003;
  $  023.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  024.驾驶侧中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  025.遥控信号               $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  026.超速闭锁               $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  027.自动返回防盗           $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  028.左前门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  029.右前门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  030.后背门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  031.远程遥控闭锁           $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  032.数据索引               $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  033.数据标识               $    $       $    $  ANS000.BYTE016  $  if(x1==0x12) y=@0002;else y=@0003;
  $  034.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  035.驾驶侧中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  036.遥控信号               $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  037.超速闭锁               $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  038.自动返回防盗           $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  039.左前门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  040.右前门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  041.后背门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  042.远程遥控闭锁           $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  043.数据索引               $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  044.数据标识               $    $       $    $  ANS000.BYTE020  $  if(x1==0x12) y=@0002;else y=@0003;
  $  045.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  046.驾驶侧中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  047.遥控信号               $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  048.超速闭锁               $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  049.自动返回防盗           $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  050.左前门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  051.右前门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  052.后背门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  053.远程遥控闭锁           $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  054.数据索引               $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  055.数据标识               $    $       $    $  ANS000.BYTE024  $  if(x1==0x12) y=@0002;else y=@0003;
  $  056.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  057.驾驶侧中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  058.遥控信号               $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  059.超速闭锁               $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  060.自动返回防盗           $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  061.左前门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  062.右前门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  063.后背门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  064.远程遥控闭锁           $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  065.数据索引               $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  066.数据标识               $    $       $    $  ANS000.BYTE028  $  if(x1==0x12) y=@0002;else y=@0003;
  $  067.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  068.驾驶侧中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  069.遥控信号               $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  070.超速闭锁               $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  071.自动返回防盗           $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  072.左前门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  073.右前门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  074.后背门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  075.远程遥控闭锁           $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  076.数据索引               $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  077.数据标识               $    $       $    $  ANS000.BYTE032  $  if(x1==0x12) y=@0002;else y=@0003;
  $  078.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  079.驾驶侧中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  080.遥控信号               $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  081.超速闭锁               $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  082.自动返回防盗           $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  083.左前门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  084.右前门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  085.后背门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  086.远程遥控闭锁           $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  087.数据索引               $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.门锁解锁记录
  $  03.门锁解锁记录
  $  REQ000:721 03 22 01 0B 00 00 00 00       $  ANS000:729 03 22 01 0B 00 00 00 00

  $  000.数据标识                   $    $       $    $  ANS000.BYTE004  $  if(x1==0x13) y=@0002;else y=@0003;
  $  001.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.驾驶侧中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.退电解锁                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.碰撞信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.钥匙在车内                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  007.左前门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  008.右前门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  009.锁定防止                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  010.后背门微动开关             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  011.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  012.数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013.数据标识                   $    $       $    $  ANS000.BYTE008  $  if(x1==0x13) y=@0002;else y=@0003;
  $  014.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  015.驾驶侧中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  016.遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  017.退电解锁                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  018.碰撞信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  019.钥匙在车内                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  020.左前门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  021.右前门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  022.锁定防止                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.后背门微动开关             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026.数据标识                   $    $       $    $  ANS000.BYTE012  $  if(x1==0x13) y=@0002;else y=@0003;
  $  027.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  028.驾驶侧中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  029.遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  030.退电解锁                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  031.碰撞信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  032.钥匙在车内                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  033.左前门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  034.右前门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  035.锁定防止                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  036.后背门微动开关             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  037.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  038.数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039.数据标识                   $    $       $    $  ANS000.BYTE016  $  if(x1==0x13) y=@0002;else y=@0003;
  $  040.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  041.驾驶侧中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  042.遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  043.退电解锁                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  044.碰撞信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  045.钥匙在车内                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  046.左前门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  047.右前门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  048.锁定防止                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  049.后背门微动开关             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  050.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  051.数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052.数据标识                   $    $       $    $  ANS000.BYTE020  $  if(x1==0x13) y=@0002;else y=@0003;
  $  053.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  054.驾驶侧中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  055.遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  056.退电解锁                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  057.碰撞信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  058.钥匙在车内                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  059.左前门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  060.右前门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  061.锁定防止                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  062.后背门微动开关             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  063.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  064.数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065.数据标识                   $    $       $    $  ANS000.BYTE024  $  if(x1==0x13) y=@0002;else y=@0003;
  $  066.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  067.驾驶侧中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  068.遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  069.退电解锁                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  070.碰撞信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  071.钥匙在车内                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  072.左前门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  073.右前门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  074.锁定防止                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  075.后背门微动开关             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  076.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  077.数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078.数据标识                   $    $       $    $  ANS000.BYTE028  $  if(x1==0x13) y=@0002;else y=@0003;
  $  079.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  080.驾驶侧中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  081.遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  082.退电解锁                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  083.碰撞信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  084.钥匙在车内                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  085.左前门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  086.右前门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  087.锁定防止                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  088.后背门微动开关             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  089.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  090.数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091.数据标识                   $    $       $    $  ANS000.BYTE032  $  if(x1==0x13) y=@0002;else y=@0003;
  $  092.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  093.驾驶侧中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  094.遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  095.退电解锁                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  096.碰撞信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  097.钥匙在车内                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@02a8;else y=@0003;
  $  098.左前门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@02a8;else y=@0003;
  $  099.右前门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@02a8;else y=@0003;
  $  100.锁定防止                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  101.后背门微动开关             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  102.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  103.数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.行李箱解锁记录
  $  04.行李箱解锁记录
  $  REQ000:721 03 22 01 0C 00 00 00 00       $  ANS000:729 03 22 01 0C 00 00 00 00

  $  000.数据标识                   $    $       $    $  ANS000.BYTE004  $  if(x1==0x14) y=@0002;else y=@0003;
  $  001.遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  002.行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  003.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  004.后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  005.远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  006.数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007.数据标识                   $    $       $    $  ANS000.BYTE008  $  if(x1==0x14) y=@0002;else y=@0003;
  $  008.遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  009.行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  010.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  011.后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  012.远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  013.数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014.数据标识                   $    $       $    $  ANS000.BYTE012  $  if(x1==0x14) y=@0002;else y=@0003;
  $  015.遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  016.行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  017.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  018.后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  019.远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  020.数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021.数据标识                   $    $       $    $  ANS000.BYTE016  $  if(x1==0x14) y=@0002;else y=@0003;
  $  022.遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  023.行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  024.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  025.后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  026.远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  027.数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028.数据标识                   $    $       $    $  ANS000.BYTE020  $  if(x1==0x14) y=@0002;else y=@0003;
  $  029.遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  030.行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  031.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  032.后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  033.远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  034.数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035.数据标识                   $    $       $    $  ANS000.BYTE024  $  if(x1==0x14) y=@0002;else y=@0003;
  $  036.遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  037.行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  038.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  039.后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  040.远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  041.数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042.数据标识                   $    $       $    $  ANS000.BYTE028  $  if(x1==0x14) y=@0002;else y=@0003;
  $  043.遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  044.行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  045.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  046.后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  047.远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  048.数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049.数据标识                   $    $       $    $  ANS000.BYTE032  $  if(x1==0x14) y=@0002;else y=@0003;
  $  050.遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@02a8;else y=@0003;
  $  051.行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@02a8;else y=@0003;
  $  052.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@02a8;else y=@0003;
  $  053.后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@02a8;else y=@0003;
  $  054.远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@02a8;else y=@0003;
  $  055.数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.启动失败原因记录
  $  05.启动失败原因记录
  $  REQ000:721 03 22 01 0D 00 00 00 00       $  ANS000:729 03 22 01 0D 00 00 00 00

  $  000.数据标识           $    $       $    $  ANS000.BYTE004  $  if(x1==0x15) y=@0002;else y=@0003;
  $  001.启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  002.数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.数据标识           $    $       $    $  ANS000.BYTE008  $  if(x1==0x15) y=@0002;else y=@0003;
  $  004.启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  005.数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.数据标识           $    $       $    $  ANS000.BYTE012  $  if(x1==0x15) y=@0002;else y=@0003;
  $  007.启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  008.数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.数据标识           $    $       $    $  ANS000.BYTE016  $  if(x1==0x15) y=@0002;else y=@0003;
  $  010.启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  011.数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.数据标识           $    $       $    $  ANS000.BYTE020  $  if(x1==0x15) y=@0002;else y=@0003;
  $  013.启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  014.数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.数据标识           $    $       $    $  ANS000.BYTE024  $  if(x1==0x15) y=@0002;else y=@0003;
  $  016.启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  017.数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.数据标识           $    $       $    $  ANS000.BYTE028  $  if(x1==0x15) y=@0002;else y=@0003;
  $  019.启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  020.数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.数据标识           $    $       $    $  ANS000.BYTE032  $  if(x1==0x15) y=@0002;else y=@0003;
  $  022.启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0) y=@0003;else if(x1==0x01) y=@0094;else if(x1==0x02) y=@0852;else if(x1==0x03) y=@0b4a;else if(x1==0x04) y=@0853;else if(x1==0x05) y=@0097;else if(x1==0x06) y=@0b4b;else if(x1==0x07) y=@0098;else if(x1==0x08) y=@0855;else if(x1==0x09) y=@009a;else if(x1==0x0a) y=@009b;else if(x1==0x0b) y=@009c;else  y=@007b;
  $  023.数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.退电失败记录
  $  06.退电失败记录
  $  REQ000:721 03 22 01 0E 00 00 00 00       $  ANS000:729 03 22 01 0E 00 00 00 00

  $  000.数据标识           $    $       $    $  ANS000.BYTE004  $  if(x1==0x16) y=@0002;else y=@0003;
  $  001.退电失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  002.数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.数据标识           $    $       $    $  ANS000.BYTE008  $  if(x1==0x16) y=@0002;else y=@0003;
  $  004.退电失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  005.数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.数据标识           $    $       $    $  ANS000.BYTE012  $  if(x1==0x16) y=@0002;else y=@0003;
  $  007.退电失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  008.数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.数据标识           $    $       $    $  ANS000.BYTE016  $  if(x1==0x16) y=@0002;else y=@0003;
  $  010.退电失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  011.数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.数据标识           $    $       $    $  ANS000.BYTE020  $  if(x1==0x16) y=@0002;else y=@0003;
  $  013.退电失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  014.数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.数据标识           $    $       $    $  ANS000.BYTE024  $  if(x1==0x16) y=@0002;else y=@0003;
  $  016.退电失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  017.数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.数据标识           $    $       $    $  ANS000.BYTE028  $  if(x1==0x16) y=@0002;else y=@0003;
  $  019.退电失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  020.数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.数据标识           $    $       $    $  ANS000.BYTE032  $  if(x1==0x16) y=@0002;else y=@0003;
  $  022.退电失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0) y=@0003;else if(x1==0x01) y=@008b;else if(x1==0x02) y=@0b4c;else if(x1==0x03) y=@0b4b;else if(x1==0x04) y=@02c2;else if(x1==0x05) y=@0b4d;else if(x1==0x06) y=@0090;else y=@007b;
  $  023.数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:721 30 01 04 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
