
    车型ID：a310

    模拟：协议模拟-->a310

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 19 12 FF 00 B0       $#  ANS000:84 11 F1 19 12 FF 00 B0

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a3100000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 FF 00 98       $$  ANS000:83 11 F1 14 FF 00 98

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 21 03 A8       $%  ANS000:82 11 F1 21 03 A8
  $%  REQ001:82 11 F1 21 04 A9       $%  ANS001:82 11 F1 21 04 A9
  $%  REQ002:82 11 F1 1A 99 37       $%  ANS002:82 11 F1 1A 99 37
  $%  REQ003:83 11 F1 22 00 1C C3       $%  ANS003:83 11 F1 22 00 1C C3
  $%  REQ004:82 11 F1 1A B0 4E       $%  ANS004:82 11 F1 1A B0 4E

  $%  000:ECU软件编号:         $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%02d%02d%02d%02d],x1,x2,x3,x4);
  $%  001:ECU硬件编号:         $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02d%02d%02d%02d],x1,x2,x3,x4);
  $%  002:编程日期:            $%    $%  ANS002.BYTE005  $%  HEX(x1,x2,x3,x4);
  $%  003:诊断系统类型:        $%    $%  ANS003.BYTE005  $%  switxh(x1) 0x01: y=@0bb4;0x02: y=@0b7b;0x03: y=@0ba6;0x04: y=@0bb5;0x05: y=@0bb6;0x06: y=@0745;default: y=@007b;
  $%  004:软件发布名称:        $%    $%  ANS004.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:83 11 F1 22 00 04 AB       $  ANS000:83 11 F1 22 00 04 AB
  $  REQ001:83 11 F1 22 00 05 AC       $  ANS001:83 11 F1 22 00 05 AC
  $  REQ002:83 11 F1 22 00 06 AD       $  ANS002:83 11 F1 22 00 06 AD
  $  REQ003:83 11 F1 22 00 07 AE       $  ANS003:83 11 F1 22 00 07 AE
  $  REQ004:83 11 F1 22 00 0B B2       $  ANS004:83 11 F1 22 00 0B B2
  $  REQ005:83 11 F1 22 00 0C B3       $  ANS005:83 11 F1 22 00 0C B3
  $  REQ006:83 11 F1 22 00 0D B4       $  ANS006:83 11 F1 22 00 0D B4
  $  REQ007:83 11 F1 22 00 0E B5       $  ANS007:83 11 F1 22 00 0E B5
  $  REQ008:83 11 F1 22 00 0F B6       $  ANS008:83 11 F1 22 00 0F B6
  $  REQ009:83 11 F1 22 00 11 B8       $  ANS009:83 11 F1 22 00 11 B8
  $  REQ010:83 11 F1 22 00 14 BB       $  ANS010:83 11 F1 22 00 14 BB
  $  REQ011:83 11 F1 22 00 15 BC       $  ANS011:83 11 F1 22 00 15 BC
  $  REQ012:83 11 F1 22 00 21 C8       $  ANS012:83 11 F1 22 00 21 C8
  $  REQ013:83 11 F1 22 00 45 EC       $  ANS013:83 11 F1 22 00 45 EC
  $  REQ014:83 11 F1 22 11 41 F9       $  ANS014:83 11 F1 22 11 41 F9
  $  REQ015:83 11 F1 22 11 43 FB       $  ANS015:83 11 F1 22 11 43 FB
  $  REQ016:83 11 F1 22 11 44 FC       $  ANS016:83 11 F1 22 11 44 FC
  $  REQ017:83 11 F1 22 11 4B 03       $  ANS017:83 11 F1 22 11 4B 03
  $  REQ018:83 11 F1 22 11 52 0A       $  ANS018:83 11 F1 22 11 52 0A
  $  REQ019:83 11 F1 22 11 55 0D       $  ANS019:83 11 F1 22 11 55 0D
  $  REQ020:83 11 F1 22 11 6F 27       $  ANS020:83 11 F1 22 11 6F 27
  $  REQ021:83 11 F1 22 11 71 29       $  ANS021:83 11 F1 22 11 71 29
  $  REQ022:83 11 F1 22 11 76 2E       $  ANS022:83 11 F1 22 11 76 2E
  $  REQ023:83 11 F1 22 11 92 4A       $  ANS023:83 11 F1 22 11 92 4A
  $  REQ024:83 11 F1 22 11 93 4B       $  ANS024:83 11 F1 22 11 93 4B
  $  REQ025:83 11 F1 22 11 9B 53       $  ANS025:83 11 F1 22 11 9B 53
  $  REQ026:83 11 F1 22 11 9E 56       $  ANS026:83 11 F1 22 11 9E 56
  $  REQ027:83 11 F1 22 11 A1 59       $  ANS027:83 11 F1 22 11 A1 59
  $  REQ028:83 11 F1 22 11 A3 5B       $  ANS028:83 11 F1 22 11 A3 5B
  $  REQ029:83 11 F1 22 11 BB 73       $  ANS029:83 11 F1 22 11 BB 73
  $  REQ030:83 11 F1 22 11 BD 75       $  ANS030:83 11 F1 22 11 BD 75
  $  REQ031:83 11 F1 22 11 BE 76       $  ANS031:83 11 F1 22 11 BE 76
  $  REQ032:83 11 F1 22 11 C0 78       $  ANS032:83 11 F1 22 11 C0 78
  $  REQ033:83 11 F1 22 11 C1 79       $  ANS033:83 11 F1 22 11 C1 79
  $  REQ034:83 11 F1 22 11 D7 8F       $  ANS034:83 11 F1 22 11 D7 8F
  $  REQ035:83 11 F1 22 12 12 CB       $  ANS035:83 11 F1 22 12 12 CB
  $  REQ036:83 11 F1 22 12 1A D3       $  ANS036:83 11 F1 22 12 1A D3
  $  REQ037:83 11 F1 22 12 1E D7       $  ANS037:83 11 F1 22 12 1E D7
  $  REQ038:83 11 F1 22 12 3F F8       $  ANS038:83 11 F1 22 12 3F F8
  $  REQ039:83 11 F1 22 12 41 FA       $  ANS039:83 11 F1 22 12 41 FA
  $  REQ040:83 11 F1 22 12 43 FC       $  ANS040:83 11 F1 22 12 43 FC
  $  REQ041:83 11 F1 22 12 C5 7E       $  ANS041:83 11 F1 22 12 C5 7E
  $  REQ042:83 11 F1 22 12 D4 8D       $  ANS042:83 11 F1 22 12 D4 8D
  $  REQ043:83 11 F1 22 12 E2 9B       $  ANS043:83 11 F1 22 12 E2 9B
  $  REQ044:83 11 F1 22 12 E5 9E       $  ANS044:83 11 F1 22 12 E5 9E
  $  REQ045:83 11 F1 22 12 ED A6       $  ANS045:83 11 F1 22 12 ED A6
  $  REQ046:83 11 F1 22 12 EF A8       $  ANS046:83 11 F1 22 12 EF A8
  $  REQ047:83 11 F1 22 13 3C F6       $  ANS047:83 11 F1 22 13 3C F6
  $  REQ048:83 11 F1 22 13 3D F7       $  ANS048:83 11 F1 22 13 3D F7
  $  REQ049:83 11 F1 22 13 3E F8       $  ANS049:83 11 F1 22 13 3E F8
  $  REQ050:83 11 F1 22 13 3F F9       $  ANS050:83 11 F1 22 13 3F F9
  $  REQ051:83 11 F1 22 15 00 BC       $  ANS051:83 11 F1 22 15 00 BC
  $  REQ052:83 11 F1 22 15 01 BD       $  ANS052:83 11 F1 22 15 01 BD
  $  REQ053:83 11 F1 22 15 09 C5       $  ANS053:83 11 F1 22 15 09 C5
  $  REQ054:83 11 F1 22 15 0B C7       $  ANS054:83 11 F1 22 15 0B C7
  $  REQ055:83 11 F1 22 16 90 4D       $  ANS055:83 11 F1 22 16 90 4D
  $  REQ056:83 11 F1 22 16 91 4E       $  ANS056:83 11 F1 22 16 91 4E
  $  REQ057:83 11 F1 22 16 92 4F       $  ANS057:83 11 F1 22 16 92 4F
  $  REQ058:83 11 F1 22 16 93 50       $  ANS058:83 11 F1 22 16 93 50
  $  REQ059:83 11 F1 22 11 00 B8       $  ANS059:83 11 F1 22 11 00 B8
  $  REQ060:83 11 F1 22 11 01 B9       $  ANS060:83 11 F1 22 11 01 B9
  $  REQ061:83 11 F1 22 11 03 BB       $  ANS061:83 11 F1 22 11 03 BB
  $  REQ062:82 11 F1 21 B2 57       $  ANS062:82 11 F1 21 B2 57

  $  000.累计的负荷值                              $    $  %            $    $  ANS000.BYTE006  $  y=x1*100/255;
  $  001.当前冷却液温度                            $    $  degree C     $    $  ANS001.BYTE006  $  y=x1-40;
  $  002.短期燃油修正(1组)                         $    $  %            $    $  ANS002.BYTE006  $  y=x1*199/255;
  $  003.长期燃油修正(1组)                         $    $  %            $    $  ANS003.BYTE006  $  y=x1*199/255;
  $  004.进气歧管绝对压力                          $    $  kPa          $    $  ANS004.BYTE006  $  y=x1;
  $  005.发动机转速                                $    $  rpm          $    $  ANS005.BYTE006  $  if((x1*64+x2*63/255)<64) y=0;else y=x1*64+x2*63/255;
  $  006.车速                                      $    $  km/h         $    $  ANS006.BYTE006  $  y=x1;
  $  007.指令点火提前角(#1)                        $    $  °           $    $  ANS007.BYTE006  $  y=x1*127/255-64;
  $  008.进气温度                                  $    $  degree C     $    $  ANS008.BYTE006  $  y=x1-40;
  $  009.节气门的绝对位置A                         $    $  %            $    $  ANS009.BYTE006  $  y=x1*100/255;
  $  010.氧传感器电压(B1S1)                        $    $  V            $    $  ANS010.BYTE006  $  y=x1*1.27/255;
  $  011.燃油短期修正(B1S1)                        $    $  %            $    $  ANS010.BYTE007  $  y=x1*199/255;
  $  012.氧传感器电压(B1S2)                        $    $  V            $    $  ANS011.BYTE006  $  y=x1*1.27/255;
  $  013.故障里程                                  $    $  km           $    $  ANS012.BYTE006  $  y=x1*256+x2;
  $  014.相对节气门位置                            $    $  %            $    $  ANS013.BYTE006  $  y=x1*156/255;
  $  015.点火电压                                  $    $  V            $    $  ANS014.BYTE006  $  y=x1*0.1;
  $  016.节气门位置(A/D)                           $    $  V            $    $  ANS015.BYTE006  $  y=x1*5.0/255;
  $  017.A/C电压(A/D)                              $    $  V            $    $  ANS016.BYTE006  $  y=x1*5.0/255;
  $  018.EGR(废气再循环)阀反馈电压(A/D)            $    $  V            $    $  ANS017.BYTE006  $  y=x1*5.0/255;
  $  019.当前EGR(废气再循环)阀开度                 $    $  %            $    $  ANS018.BYTE006  $  y=x1*100/255;
  $  020.燃油液面高度传感器                        $    $  %            $    $  ANS019.BYTE006  $  y=x1*5.0/255;
  $  021.启动时冷却液温度值                        $    $  degree C     $    $  ANS020.BYTE006  $  y=x1-40;
  $  022.EGR(废气再循环)阀占空比                   $    $  %            $    $  ANS021.BYTE006  $  y=x1*99/255;
  $  023.步进电机基本设置                          $    $               $    $  ANS022.BYTE006  $  y=x1;
  $  024.目标怠速                                  $    $  rpm          $    $  ANS023.BYTE006  $  y=x1*3187/255;
  $  025.输出喷油脉宽                              $    $  毫秒         $    $  ANS024.BYTE006  $  y=x1*996/255+x2*3/255;
  $  026.EGR(废气再循环)阀目标开度                 $    $  %            $    $  ANS025.BYTE006  $  y=x1*100/255;
  $  027.空燃比                                    $    $               $    $  ANS026.BYTE006  $  y=x1*0.1;
  $  028.发动机运行时间                            $    $  秒           $    $  ANS027.BYTE006  $  y=x1*256+x2;
  $  029.催化转换器温度                            $    $  degree C     $    $  ANS028.BYTE006  $  y=x1*3+300;
  $  030.EGR(废气再循环)阀零位位置                 $    $  %            $    $  ANS029.BYTE006  $  y=x1*199/255;
  $  031.EGR(废气再循环)阀流量检测执行次数         $    $               $    $  ANS030.BYTE006  $  y=x1;
  $  032.EGR(废气再循环)阀流量检测失效限值         $    $               $    $  ANS031.BYTE006  $  y=x1*256+x2;
  $  033.EGR(废气再循环)阀流量检测结果             $    $               $    $  ANS032.BYTE006  $  y=x1*256+x2;
  $  034.EGR(废气再循环)阀开度错误计数             $    $               $    $  ANS033.BYTE006  $  y=x1*398/255+x2/255;
  $  035.氧传感器稀浓转换次数                      $    $               $    $  ANS034.BYTE006  $  y=x1*256+x2;
  $  036.氧传感器稀/浓反应比率                     $    $               $    $  ANS035.BYTE006  $  y=x1*127/255;
  $  037.氧传感器浓稀转换次数                      $    $               $    $  ANS036.BYTE006  $  y=x1*256+x2;
  $  038.发动机里程表                              $    $  km           $    $  ANS037.BYTE006  $  y=x1*2560+x2*10;
  $  039.氧稀转浓时间B1S1                          $    $  毫秒         $    $  ANS038.BYTE006  $  y=x1*509836/255+x2*1991/255;
  $  040.氧浓转稀时间B1S1                          $    $  毫秒         $    $  ANS039.BYTE006  $  y=x1*509836/255+x2*1991/255;
  $  041.氧稀转浓平均时间B1S1                      $    $  毫秒         $    $  ANS040.BYTE006  $  y=x1*127/255;
  $  042.燃油液面高度的输出                        $    $  %            $    $  ANS041.BYTE006  $  y=x1*100/255;
  $  043.氧浓转稀平均时间B1S1                      $    $  毫秒         $    $  ANS042.BYTE006  $  y=x1*127/255;
  $  044.进气温度传感器温度                        $    $  degree C     $    $  ANS043.BYTE006  $  y=x1-40;
  $  045.进气压力                                  $    $  kPa          $    $  ANS044.BYTE006  $  y=x1*510/255+x2*258/255-256;
  $  046.G传感器电压                               $    $  V            $    $  ANS045.BYTE006  $  y=x1*159/255-80;
  $  047.TEC学习次数                               $    $               $    $  ANS046.BYTE006  $  y=x1;
  $  048.TEC学习值#1                               $    $               $    $  ANS047.BYTE006  $  y=x1*256+x2;
  $  049.TEC学习值#2                               $    $               $    $  ANS048.BYTE006  $  y=x1*256+x2;
  $  050.TEC学习值#3                               $    $               $    $  ANS049.BYTE006  $  y=x1*256+x2;
  $  051.TEC学习值#4                               $    $               $    $  ANS050.BYTE006  $  y=x1*256+x2;
  $  052.ICMD最低催化温度                          $    $  degree C     $    $  ANS051.BYTE006  $  y=x1*16+x2*516/255-500;
  $  053.ICMD最高催化温度                          $    $  degree C     $    $  ANS052.BYTE006  $  y=x1*16+x2*516/255-500;
  $  054.怠速催化监测时间                          $    $  秒           $    $  ANS053.BYTE006  $  y=x1*4+x2*3/256;
  $  055.阶段怠速催化监测时间                      $    $  秒           $    $  ANS054.BYTE006  $  y=x1*4+x2*3/256;
  $  056.起动次数                                  $    $               $    $  ANS055.BYTE006  $  y=x1*65536+x2*256+x3;
  $  057.电池荷电状态                              $    $  %            $    $  ANS056.BYTE006  $  y=x1;
  $  058.SOC(荷电状态)状态                         $    $               $    $  ANS056.BYTE007  $  y=x1;
  $  059.电池起动状态1                             $    $  V            $    $  ANS056.BYTE008  $  y=x1*15.93/255;
  $  060.S0F1状态                                  $    $               $    $  ANS056.BYTE009  $  y=x1;
  $  061.电池起动状态2                             $    $  V            $    $  ANS056.BYTE010  $  y=x1*15.93/255;
  $  062.S0F2状态                                  $    $               $    $  ANS056.BYTE011  $  y=x1;
  $  063.真空度                                    $    $  kPa          $    $  ANS057.BYTE007  $  y=x1*254.59/255+x2*0.99/255;
  $  064.发动机未停机原因(需查表)                  $    $               $    $  ANS058.BYTE006  $  y=x1;
  $  065.节气门处于怠速位置                        $    $               $    $  ANS059.BYTE006  $  if(x1&0x01) y=@0185;else y=@0186;
  $  066.空调请求激活                              $    $               $    $  ANS059.BYTE006  $  if(x1&0x10) y=@0185;else y=@0186;
  $  067.空调压缩机状态                            $    $               $    $  ANS059.BYTE006  $  if(x1&0x20) y=@0185;else y=@0186;
  $  068.催化剂保护模式                            $    $               $    $  ANS059.BYTE006  $  if(x1&0x40) y=@0185;else y=@0186;
  $  069.燃油泵开启命令                            $    $               $    $  ANS059.BYTE006  $  if(x1&0x80) y=@0185;else y=@0186;
  $  070.MIL(故障指示灯)/SVS(系统维修指示灯)       $    $               $    $  ANS060.BYTE006  $  if((x1&0x0C)==0x04) y=@0bbe;else if((x1&0x0C)==0x08) y=@0bbf;else if((x1&0x0C)==0x0C) y=@0bc0;else y=@0bc1;
  $  071.低速风扇/高速风扇                         $    $               $    $  ANS061.BYTE006  $  if((x1&0x03)==0x01) y=@0bba;else if((x1&0x03)==0x02) y=@0bbb;else if((x1&0x03)==0x03) y=@0bbc;else y=@0bbd;
  $  072.空档状态                                  $    $               $    $  ANS057.BYTE006  $  if(x1&0x01) y=@0bb8;else y=@0bb9;
  $  073.离合踏板%10状态                           $    $               $    $  ANS057.BYTE006  $  if(x1&0x02) y=@0118;else y=@0182;
  $  074.离合踏板%90状态                           $    $               $    $  ANS057.BYTE006  $  if(x1&0x04) y=@0118;else y=@0182;
  $  075.当前AC(空调控制器)是否关联                $    $               $    $  ANS057.BYTE006  $  if(x1&0x04) y=@05a9;else y=@0bb7;
  $  076.设置的AC(空调控制器)是否关联              $    $               $    $  ANS062.BYTE005  $  if(x1==0x01) y=@05a9;else if(x1==0x02) y=@05aa;else y=@007b;

;******************************************************************************************************************************************************

