
    车型ID：a313

    模拟：协议模拟-->a313

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 00 00 9E       $#  ANS000:84 11 F1 18 00 00 00 9E

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a3130000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 00 00 99       $$  ANS000:83 11 F1 14 00 00 99

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 80 1E       $%  ANS000:82 11 F1 1A 80 1E

  $%  000:车辆识别号:          $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:客户ECU编号:         $%    $%  ANS000.BYTE022  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:系统软件号:          $%    $%  ANS000.BYTE052  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:车型信息:            $%    $%  ANS000.BYTE064  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:引擎类型:            $%    $%  ANS000.BYTE072  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  005:测试序列号:          $%    $%  ANS000.BYTE078  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  006:编程日期:            $%    $%  ANS000.BYTE088  $%  HEX(x1,x2,x3,x4);
  $%  007:诊断系统标识:        $%    $%  ANS000.BYTE092  $%  HEX(x1,x2);
  $%  008:数据文件编号:        $%    $%  ANS000.BYTE094  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  009:联电硬件编号:        $%    $%  ANS000.BYTE122  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 11 F1 22 01 A7       $  ANS000:82 11 F1 22 01 A7
  $  REQ001:82 11 F1 22 04 AA       $  ANS001:82 11 F1 22 04 AA

  $  000.蓄电池电压                                   $    $  V            $    $  ANS000.BYTE036  $  y=x1*18.7/255;
  $  001.发动机转速                                   $    $  rpm          $    $  ANS000.BYTE037  $  y=x2*63/255+x1*16320/255;
  $  002.目标怠速                                     $    $  rpm          $    $  ANS000.BYTE039  $  y=x1*10;
  $  003.汽车速度                                     $    $  km/h         $    $  ANS000.BYTE041  $  y=x1;
  $  004.进气压力                                     $    $  hPa          $    $  ANS000.BYTE052  $  y=x1*10;
  $  005.进气温度                                     $    $  degree C     $    $  ANS000.BYTE046  $  y=x1-40;
  $  006.进气量                                       $    $  kg/h         $    $  ANS000.BYTE053  $  y=x1*25.6+x2*0.1;
  $  007.冷却液温度                                   $    $  degree C     $    $  ANS000.BYTE044  $  y=x1-40;
  $  008.节气门位置                                   $    $  %            $    $  ANS000.BYTE060  $  y=x1*100/255;
  $  009.步进电机目标位置                             $    $               $    $  ANS000.BYTE055  $  y=x1;
  $  010.前氧传感器电压                               $    $  mV           $    $  ANS000.BYTE089  $  y=x1*4980.4/255;
  $  011.后氧传感器电压                               $    $  mV           $    $  ANS000.BYTE090  $  y=x1*4980.4/255;
  $  012.氧传感器短期修正                             $    $               $    $  ANS000.BYTE087  $  y=x1*1.99/255;
  $  013.氧传感器长期修正                             $    $               $    $  ANS000.BYTE093  $  y=x1*1.99/255;
  $  014.碳罐阀占空比                                 $    $  %            $    $  ANS000.BYTE065  $  y=x1*99/255;
  $  015.喷油脉宽                                     $    $  毫秒         $    $  ANS000.BYTE070  $  y=x1*25/255;
  $  016.1缸点火提前角                                $    $  °           $    $  ANS000.BYTE071  $  y=x1*127/255-64;
  $  017.燃油容积流量                                 $    $  L/h          $    $  ANS000.BYTE075  $  y=(x1%0x78)*64/0x75;
  $  018.碳罐相对喷油量                               $    $  %            $    $  ANS000.BYTE106  $  if(x1<0x80) y=x1*1524/127+x2*11/255;else y=x1*1524/127-3059+x2*11/255;
  $  019.怠速扭矩自学习                               $    $  %            $    $  ANS000.BYTE102  $  if(x1<0x80) y=x1*99/127;else y=x1*99/127-255*99/127;
  $  020.怠速转速控制扭矩修正                         $    $  %            $    $  ANS000.BYTE104  $  if(x1<0x80) y=x1*99/127;else y=x1*99/127-255*99/127;
  $  021.里程累计数                                   $    $  km           $    $  ANS000.BYTE111  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  022.运转时间                                     $    $  分           $    $  ANS000.BYTE115  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  023.冷却风扇#1                                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x01) y=@0173;else y=@0172;
  $  024.冷却风扇#2                                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x02) y=@0173;else y=@0172;
  $  025.节气门处于怠速位置                           $    $               $    $  ANS000.BYTE026  $  if(x1&0x01) y=@0185;else y=@0186;
  $  026.节气门处于全负荷位置                         $    $               $    $  ANS000.BYTE026  $  if(x1&0x02) y=@0185;else y=@0186;
  $  027.激活减速断油                                 $    $               $    $  ANS000.BYTE026  $  if(x1&0x08) y=@0185;else y=@0186;
  $  028.激活加速加浓                                 $    $               $    $  ANS000.BYTE026  $  if(x1&0x10) y=@0185;else y=@0186;
  $  029.节气门位置未知或错误                         $    $               $    $  ANS000.BYTE031  $  if(x1&0x01) y=@0185;else y=@0186;
  $  030.AT转换离合器激活                             $    $               $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0185;else y=@0186;
  $  031.λ控制激活                                   $    $               $    $  ANS000.BYTE027  $  if(x1&0x01) y=@0185;else y=@0186;
  $  032.碳罐控制阀激活                               $    $               $    $  ANS000.BYTE027  $  if(x1&0x04) y=@0185;else y=@0186;
  $  033.减速断油激活                                 $    $               $    $  ANS000.BYTE027  $  if(x1&0x08) y=@0185;else y=@0186;
  $  034.催化转换器保护加浓                           $    $               $    $  ANS000.BYTE027  $  if(x1&0x10) y=@0185;else y=@0186;
  $  035.混合气自学习条件激活                         $    $               $    $  ANS000.BYTE027  $  if(x1&0x20) y=@0185;else y=@0186;
  $  036.点火接线端15                                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0173;else y=@0172;
  $  037.主继电器工作                                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0185;else y=@0186;
  $  038.燃油泵继电器工作                             $    $               $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0185;else y=@0186;
  $  039.起动机工作                                   $    $               $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0185;else y=@0186;
  $  040.达到怠速转速                                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0185;else y=@0186;
  $  041.同步条件                                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0185;else y=@0186;
  $  042.达到发动机工作温度                           $    $               $    $  ANS000.BYTE025  $  if(x1&0x40) y=@0185;else y=@0186;
  $  043.车辆行驶                                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x80) y=@0185;else y=@0186;
  $  044.氧传感器1信号浓                              $    $               $    $  ANS000.BYTE028  $  if(x1&0x01) y=@0185;else y=@0186;
  $  045.氧传感器2信号稀                              $    $               $    $  ANS000.BYTE028  $  if(x1&0x02) y=@0185;else y=@0186;
  $  046.氧传感器1加热激活                            $    $               $    $  ANS000.BYTE028  $  if(x1&0x10) y=@0185;else y=@0186;
  $  047.氧传感器2加热激活                            $    $               $    $  ANS000.BYTE028  $  if(x1&0x20) y=@0185;else y=@0186;
  $  048.空调请求激活                                 $    $               $    $  ANS000.BYTE032  $  if(x1&0x02) y=@0185;else y=@0186;
  $  049.空调压缩机                                   $    $               $    $  ANS000.BYTE032  $  if(x1&0x04) y=@0172;else y=@0173;
  $  050.空调断开或无空调                             $    $               $    $  ANS000.BYTE032  $  if(x1&0x08) y=@0185;else y=@0186;
  $  051.空调因温度断开                               $    $               $    $  ANS000.BYTE032  $  if(x1&0x10) y=@0185;else y=@0186;
  $  052.怠速转速因空调而增加                         $    $               $    $  ANS000.BYTE032  $  if(x1&0x20) y=@0185;else y=@0186;
  $  053.因全负荷关闭空调压缩机                       $    $               $    $  ANS000.BYTE032  $  if(x1&0x40) y=@0185;else y=@0186;
  $  054.空调中压开关                                 $    $               $    $  ANS000.BYTE032  $  if(x1&0x80) y=@0173;else y=@0172;
  $  055.故障指示灯激活                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x01) y=@0185;else y=@0186;
  $  056.故障指示灯闪烁                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x02) y=@0185;else y=@0186;
  $  057.立即检修灯激活                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x10) y=@0185;else y=@0186;
  $  058.立即检修灯闪烁                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x20) y=@0185;else y=@0186;
  $  059.立即检修灯存在故障                           $    $               $    $  ANS000.BYTE030  $  if(x1&0x40) y=@0185;else y=@0186;
  $  060.氧传感器1短期修正                            $    $  %            $    $  ANS000.BYTE087  $  y=x1*199/255;
  $  061.氧传感器2长期修正                            $    $  %            $    $  ANS000.BYTE093  $  y=x1*1.99/255;
  $  062.EGR(废气再循环)位置反馈电压                  $    $  V            $    $  ANS001.BYTE005  $  y=x1*318.7/255+x2*1.2/255;
  $  063.EGR(废气再循环)开放百分比                    $    $  %            $    $  ANS001.BYTE007  $  y=x1*99.7/255;
  $  064.EGR(废气再循环)工作使能                      $    $               $    $  ANS001.BYTE009  $  if(x1==0) y=@04a0;else if(x1==1) y=@0014;else y=@001b;
  $  065.EGR(废气再循环)定点位置设定                  $    $  %            $    $  ANS001.BYTE010  $  y=x1*103/255;
  $  066.EGR(废气再循环)闭环控制积分部分              $    $  %            $    $  ANS001.BYTE012  $  y=x1*256+x2;
  $  067.EGR(废气再循环)闭环控制比例部分              $    $  %            $    $  ANS001.BYTE014  $  if(x1<0x80) y=x1*99/127;else y=(x1-128)*99/127-99;
  $  068.EGR(废气再循环)闭环控制微分部分              $    $  %            $    $  ANS001.BYTE016  $  if(x1<0x80) y=x1*99/127;else y=(x1-128)*99/127-99;
  $  069.EGR(废气再循环)率                            $    $  %            $    $  ANS001.BYTE018  $  if((x1==0xFF)&&(x2==0xFF)) y=100;else y=x1*99/255;
  $  070.EGR(废气再循环)电压故障计数延时              $    $  秒           $    $  ANS001.BYTE020  $  y=x1*25/255;
  $  071.EGR(废气再循环)信号故障计数延时              $    $  秒           $    $  ANS001.BYTE021  $  y=x1*25/255;
  $  072.EGR(废气再循环)驱动PWM(脉宽调制)占空比       $    $  %            $    $  ANS001.BYTE022  $  y=x1*99/255;
  $  073.VVL(可变气门升程阀)控制标志                  $    $               $    $  ANS001.BYTE023  $  if(x1==0) y=@04a0;else if(x1==1) y=@0014;else y=@001b;
  $  074.VVL(可变气门升程阀)工作温度界限              $    $  degree C     $    $  ANS001.BYTE024  $  y=x1*191/255-48;
  $  075.VVL(可变气门升程阀)工作档位限制              $    $               $    $  ANS001.BYTE025  $  y=x1;

;******************************************************************************************************************************************************

