
    车型ID：a314

    模拟：协议模拟-->a314

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 00 00 9E       $#  ANS000:84 11 F1 18 00 00 00 9E

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a3130000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 00 00 99       $$  ANS000:83 11 F1 14 00 00 99

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 80 1E       $%  ANS000:82 11 F1 1A 80 1E

  $%  000:车辆识别号:          $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:客户ECU编号:         $%    $%  ANS000.BYTE022  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:系统软件号:          $%    $%  ANS000.BYTE052  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:车型信息:            $%    $%  ANS000.BYTE064  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:引擎类型:            $%    $%  ANS000.BYTE072  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  005:测试序列号:          $%    $%  ANS000.BYTE078  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  006:编程日期:            $%    $%  ANS000.BYTE088  $%  HEX(x1,x2,x3,x4);
  $%  007:诊断系统标识:        $%    $%  ANS000.BYTE092  $%  HEX(x1,x2);
  $%  008:数据文件编号:        $%    $%  ANS000.BYTE094  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  009:联电硬件编号:        $%    $%  ANS000.BYTE122  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6
  $  REQ001:82 11 F1 21 04 A9       $  ANS001:82 11 F1 21 04 A9

  $  000.蓄电池电压                                   $    $  V            $    $  ANS000.BYTE036  $  y=x1*18.7/255;
  $  001.发动机转速                                   $    $  rpm          $    $  ANS000.BYTE037  $  y=(x1*256+x2)*16383/65535;
  $  002.目标怠速                                     $    $  rpm          $    $  ANS000.BYTE039  $  y=x1*10;
  $  003.汽车速度                                     $    $  km/h         $    $  ANS000.BYTE041  $  y=x1;
  $  004.进气压力                                     $    $  hPa          $    $  ANS000.BYTE052  $  y=x1*10;
  $  005.进气温度                                     $    $  degree C     $    $  ANS000.BYTE046  $  y=x1-40;
  $  006.进气量                                       $    $  千克/时      $    $  ANS000.BYTE053  $  y=(x1*256+x2)*1.0/10;
  $  007.冷却液温度                                   $    $  degree C     $    $  ANS000.BYTE044  $  y=x1-40;
  $  008.节气门位置                                   $    $  %            $    $  ANS000.BYTE060  $  y=x1*100/255;
  $  009.步进电机目标位置                             $    $               $    $  ANS000.BYTE055  $  y=x1;
  $  010.前氧传感器电压                               $    $  mV           $    $  ANS000.BYTE089  $  y=x1*4980.4/255;
  $  011.后氧传感器电压                               $    $  mV           $    $  ANS000.BYTE090  $  y=x1*4980.4/255;
  $  012.氧传感器短期修正                             $    $               $    $  ANS000.BYTE087  $  y=x1*1.99/255;
  $  013.氧传感器长期修正                             $    $               $    $  ANS000.BYTE093  $  y=x1*1.99/255;
  $  014.碳罐阀占空比                                 $    $  %            $    $  ANS000.BYTE065  $  y=x1*100/256;
  $  015.喷油脉宽                                     $    $  毫秒         $    $  ANS000.BYTE070  $  y=x1*5/51;
  $  016.1缸点火提前角                                $    $  度           $    $  ANS000.BYTE071  $  y=x1*127/255-64;
  $  017.燃油容积流量                                 $    $  升/时        $    $  ANS000.BYTE075  $  if(x1<0x77)y=x1*65/119;else if(x1>0xee)y=(x1-238)*65/119;else y=(x1-119)*65/119;
  $  018.碳罐相对喷油量                               $    $  %            $    $  ANS000.BYTE106  $  if(x1<0x80)y=(x1*256+x2)*1535/32767;else y=((x1-256)*256+x2)*1535/32767;
  $  019.怠速扭矩自学习                               $    $  %            $    $  ANS000.BYTE102  $  if(x1<0x80)y=(x1*256+x2)*100/32768;else y=((x1-256)*256+x2)*100/32768;
  $  020.怠速转速控制扭矩修正                         $    $  %            $    $  ANS000.BYTE104  $  if(x1<0x80)y=(x1*256+x2)*100/32768;else y=((x1-256)*256+x2)*100/32768;
  $  021.里程累计数                                   $    $  km           $    $  ANS000.BYTE111  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  022.运转时间                                     $    $  分钟         $    $  ANS000.BYTE115  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  023.冷却风扇#1                                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x01)y=@0173;else y=@0172;
  $  024.冷却风扇#2                                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x02)y=@0173;else y=@0172;
  $  025.节气门处于怠速位置                           $    $               $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0185;else y=@0186;
  $  026.节气门处于全负荷位置                         $    $               $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0185;else y=@0186;
  $  027.激活减速断油                                 $    $               $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0185;else y=@0186;
  $  028.激活加速加浓                                 $    $               $    $  ANS000.BYTE026  $  if(x1&0x10)y=@0185;else y=@0186;
  $  029.节气门位置未知或错误                         $    $               $    $  ANS000.BYTE031  $  if(x1&0x01)y=@0185;else y=@0186;
  $  030.AT转换离合器激活                             $    $               $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0185;else y=@0186;
  $  031.λ控制激活                                   $    $               $    $  ANS000.BYTE027  $  if(x1&0x01)y=@0185;else y=@0186;
  $  032.碳罐控制阀激活                               $    $               $    $  ANS000.BYTE027  $  if(x1&0x04)y=@0185;else y=@0186;
  $  033.减速断油激活                                 $    $               $    $  ANS000.BYTE027  $  if(x1&0x08)y=@0185;else y=@0186;
  $  034.催化转换器保护加浓                           $    $               $    $  ANS000.BYTE027  $  if(x1&0x10)y=@0185;else y=@0186;
  $  035.混合气自学习条件激活                         $    $               $    $  ANS000.BYTE027  $  if(x1&0x20)y=@0185;else y=@0186;
  $  036.点火接线端15                                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0173;else y=@0172;
  $  037.主继电器工作                                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0185;else y=@0186;
  $  038.燃油泵继电器工作                             $    $               $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0185;else y=@0186;
  $  039.起动机工作                                   $    $               $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0185;else y=@0186;
  $  040.达到怠速转速                                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0185;else y=@0186;
  $  041.同步条件                                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0185;else y=@0186;
  $  042.达到发动机工作温度                           $    $               $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0185;else y=@0186;
  $  043.车辆行驶                                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0185;else y=@0186;
  $  044.氧传感器1信号浓                              $    $               $    $  ANS000.BYTE028  $  if(x1&0x01)y=@0185;else y=@0186;
  $  045.氧传感器2信号稀                              $    $               $    $  ANS000.BYTE028  $  if(x1&0x02)y=@0185;else y=@0186;
  $  046.氧传感器1加热激活                            $    $               $    $  ANS000.BYTE028  $  if(x1&0x10)y=@0185;else y=@0186;
  $  047.氧传感器2加热激活                            $    $               $    $  ANS000.BYTE028  $  if(x1&0x20)y=@0185;else y=@0186;
  $  048.空调请求激活                                 $    $               $    $  ANS000.BYTE032  $  if(x1&0x02)y=@0185;else y=@0186;
  $  049.空调压缩机                                   $    $               $    $  ANS000.BYTE032  $  if(x1&0x04)y=@0172;else y=@0173;
  $  050.空调断开或无空调                             $    $               $    $  ANS000.BYTE032  $  if(x1&0x08)y=@0185;else y=@0186;
  $  051.空调因温度断开                               $    $               $    $  ANS000.BYTE032  $  if(x1&0x10)y=@0185;else y=@0186;
  $  052.怠速转速因空调而增加                         $    $               $    $  ANS000.BYTE032  $  if(x1&0x20)y=@0185;else y=@0186;
  $  053.因全负荷关闭空调压缩机                       $    $               $    $  ANS000.BYTE032  $  if(x1&0x40)y=@0185;else y=@0186;
  $  054.空调中压开关                                 $    $               $    $  ANS000.BYTE032  $  if(x1&0x80)y=@0173;else y=@0172;
  $  055.故障指示灯激活                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0185;else y=@0186;
  $  056.故障指示灯闪烁                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0185;else y=@0186;
  $  057.立即检修灯激活                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x10)y=@0185;else y=@0186;
  $  058.立即检修灯闪烁                               $    $               $    $  ANS000.BYTE030  $  if(x1&0x20)y=@0185;else y=@0186;
  $  059.立即检修灯存在故障                           $    $               $    $  ANS000.BYTE030  $  if(x1&0x40)y=@0185;else y=@0186;
  $  060.氧传感器1短期修正                            $    $  %            $    $  ANS000.BYTE087  $  y=x1*200/256;
  $  061.氧传感器1长期修正                            $    $               $    $  ANS000.BYTE093  $  y=x1*1.00*2/256;
  $  062.EGR(废气再循环)位置反馈电压                  $    $  V            $    $  ANS001.BYTE005  $  y=(x1*256+x2)*319.9/65535;
  $  063.EGR(废气再循环)开放百分比                    $    $  %            $    $  ANS001.BYTE007  $  y=(x1*256+x2)*99.9/65535;
  $  064.EGR(废气再循环)工作使能                      $    $               $    $  ANS001.BYTE009  $  if(x1==0x00)y=@04a0;else if(x1==0x01)y=@0014;else y=@001b;
  $  065.EGR(废气再循环)定点位置设定                  $    $  %            $    $  ANS001.BYTE010  $  y=(x1*256+x2)*103/65535;
  $  066.EGR(废气再循环)闭环控制积分部分              $    $  %            $    $  ANS001.BYTE012  $  y=(x1*256+x2);
  $  067.EGR(废气再循环)闭环控制比例部分              $    $  %            $    $  ANS001.BYTE014  $  if(x1<0x80)y=x1*99/127;else y=(x1-255)*99/127;
  $  068.EGR(废气再循环)闭环控制微分部分              $    $  %            $    $  ANS001.BYTE016  $  if(x1<0x80)y=x1*99/127;else y=(x1-255)*99/127;
  $  069.EGR(废气再循环)率                            $    $  %            $    $  ANS001.BYTE018  $  y=x1*100/256;
  $  070.EGR(废气再循环)电压故障计数延时              $    $  秒           $    $  ANS001.BYTE020  $  y=x1*25/255;
  $  071.EGR(废气再循环)信号故障计数延时              $    $  秒           $    $  ANS001.BYTE021  $  y=x1*25/255;
  $  072.EGR(废气再循环)驱动PWM(脉宽调制)占空比       $    $  %            $    $  ANS001.BYTE022  $  y=x1*100/256;
  $  073.VVL(可变气门升程阀)控制标志                  $    $               $    $  ANS001.BYTE023  $  if(x1==0x00)y=@04a0;else if(x1==0x01)y=@0014;else y=@001b;
  $  074.VVL(可变气门升程阀)工作温度界限              $    $  degree C     $    $  ANS001.BYTE024  $  y=x1*191/255-48;
  $  075.VVL(可变气门升程阀)工作挡位限制              $    $               $    $  ANS001.BYTE025  $  y=x1;

  $)  01.启停数据流
  $  01.启停数据流
  $  REQ000:82 11 F1 21 A2 47       $  ANS000:82 11 F1 21 A2 47
  $  REQ001:82 11 F1 21 A3 48       $  ANS001:82 11 F1 21 A3 48
  $  REQ002:82 11 F1 21 A4 49       $  ANS002:82 11 F1 21 A4 49
  $  REQ003:82 11 F1 21 A5 4A       $  ANS003:82 11 F1 21 A5 4A
  $  REQ004:82 11 F1 22 A5 4B       $  ANS004:82 11 F1 22 A5 4B
  $  REQ005:82 11 F1 23 A5 4C       $  ANS005:82 11 F1 23 A5 4C
  $  REQ006:82 11 F1 21 A6 4B       $  ANS006:82 11 F1 21 A6 4B
  $  REQ007:82 11 F1 21 B2 57       $  ANS007:82 11 F1 21 B2 57

  $  000.前舱盖未合上                            $    $               $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0185;else y=@0186;
  $  001.驾驶员不在座                            $    $               $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0185;else y=@0186;
  $  002.电池启动能力不足                        $    $               $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0185;else y=@0186;
  $  003.制动负压过低                            $    $               $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0185;else y=@0186;
  $  004.空调请求发动机运行                      $    $               $    $  ANS000.BYTE006  $  if(x1&0x10)y=@0185;else y=@0186;
  $  005.启动机过热                              $    $               $    $  ANS000.BYTE006  $  if(x1&0x20)y=@0185;else y=@0186;
  $  006.离合器低位开关预检未结束                $    $               $    $  ANS000.BYTE006  $  if(x1&0x40)y=@0185;else y=@0186;
  $  007.离合器高位开关预检未结束                $    $               $    $  ANS000.BYTE006  $  if(x1&0x80)y=@0185;else y=@0186;
  $  008.传动链继电器黏着                        $    $               $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0185;else y=@0186;
  $  009.发动机故障                              $    $               $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0185;else y=@0186;
  $  010.TCU(自动变速箱控制器)禁止自动停机       $    $               $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0185;else y=@0186;
  $  011.BCM(车身控制系统)禁止自动停机           $    $               $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0185;else y=@0186;
  $  012.海拔高度过高                            $    $               $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0185;else y=@0186;
  $  013.碳罐负荷过高                            $    $               $    $  ANS000.BYTE008  $  if(x1&0x01)y=@0185;else y=@0186;
  $  014.扭矩损失自学习未完成                    $    $               $    $  ANS000.BYTE008  $  if(x1&0x02)y=@0185;else y=@0186;
  $  015.停机后可能造成热起动                    $    $               $    $  ANS000.BYTE008  $  if(x1&0x04)y=@0185;else y=@0186;
  $  016.本驾驶循环标志位尚未置位                $    $               $    $  ANS000.BYTE008  $  if(x1&0x08)y=@0185;else y=@0186;
  $  017.碳罐阀诊断为完成                        $    $               $    $  ANS000.BYTE008  $  if(x1&0x10)y=@0185;else y=@0186;
  $  018.增压系统部允许停机                      $    $               $    $  ANS000.BYTE008  $  if(x1&0x20)y=@0185;else y=@0186;
  $  019.发动机水温过高或过低                    $    $               $    $  ANS000.BYTE008  $  if(x1&0x40)y=@0185;else y=@0186;
  $  020.催化器未达到工作温度                    $    $               $    $  ANS000.BYTE008  $  if(x1&0x80)y=@0185;else y=@0186;
  $  021.发动机混合器自学习未完成                $    $               $    $  ANS000.BYTE007  $  if(x1&0x01)y=@0185;else y=@0186;
  $  022.催化器正处于加热状态                    $    $               $    $  ANS000.BYTE007  $  if(x1&0x02)y=@0185;else y=@0186;
  $  023.节气门自学习未完成                      $    $               $    $  ANS000.BYTE007  $  if(x1&0x04)y=@0185;else y=@0186;
  $  024.节气门故障                              $    $               $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0185;else y=@0186;
  $  025.冷却水温传感器故障                      $    $               $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0185;else y=@0186;
  $  026.诊断出发动机启动时间过长                $    $               $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0185;else y=@0186;
  $  027.相位传感器故障                          $    $               $    $  ANS000.BYTE010  $  if(x1&0x08)y=@0185;else y=@0186;
  $  028.齿缺同步信号故障                        $    $               $    $  ANS000.BYTE010  $  if(x1&0x10)y=@0185;else y=@0186;
  $  029.PWM(脉宽调制)发电机相关故障             $    $               $    $  ANS000.BYTE010  $  if(x1&0x20)y=@0185;else y=@0186;
  $  030.VVT(可变气门正时)故障                   $    $               $    $  ANS000.BYTE010  $  if(x1&0x40)y=@0185;else y=@0186;
  $  031.转速传感器相关故障                      $    $               $    $  ANS000.BYTE010  $  if(x1&0x80)y=@0185;else y=@0186;
  $  032.发动机主负荷传感器故障                  $    $               $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0185;else y=@0186;
  $  033.电机起动次数                            $    $               $    $  ANS001.BYTE005  $  y=(x1*65536)+(x2*256)+x3;
  $  034.电池荷电状态                            $    $  %            $    $  ANS002.BYTE005  $  y=x1;
  $  035.SOC(荷电状态)状态                       $    $               $    $  ANS002.BYTE006  $  y=x1;
  $  036.电池起动状态1                           $    $  V            $    $  ANS002.BYTE007  $  y=x1*16;
  $  037.S0F1状态                                $    $               $    $  ANS002.BYTE008  $  y=x1;
  $  038.电池起动状态2                           $    $  V            $    $  ANS002.BYTE009  $  y=x1*16;
  $  039.S0F2状态                                $    $               $    $  ANS002.BYTE010  $  y=x1;
  $  040.空档状态                                $    $               $    $  ANS003.BYTE005  $  if(x1&0x01)y=@0185;else y=@0186;
  $  041.离合踏板10%状态                         $    $               $    $  ANS004.BYTE005  $  if(x1&0x02)y=@0185;else y=@0186;
  $  042.离合踏板90%状态                         $    $               $    $  ANS005.BYTE005  $  if(x1&0x04)y=@0185;else y=@0186;
  $  043.真空度                                  $    $               $    $  ANS005.BYTE006  $  y=(x1*1673846/255)+(x2*6538/255);
  $  044.电池温度                                $    $  degree C     $    $  ANS006.BYTE005  $  y=x1-40;
  $  045.AC(空调控制器)是否关联配置              $    $               $    $  ANS007.BYTE005  $  if(x1&0x01)y=@0185;else y=@0186;

;******************************************************************************************************************************************************

