
    车型ID：a31b

    模拟：协议模拟-->a31b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00
  $~  REQ001:7E0 03 22 F1 94 00 00 00 00       $~  ANS001:7E8 03 22 F1 94 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 02 19 FF 00 00 00 00 00       $#  ANS000:7E8 02 19 FF 00 00 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/feff0000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 92 00 00 00 00       $%  ANS000:7E8 03 22 F1 92 00 00 00 00
  $%  REQ001:7E0 03 22 F1 94 00 00 00 00       $%  ANS001:7E8 03 22 F1 94 00 00 00 00
  $%  REQ002:7E0 03 22 F1 95 00 00 00 00       $%  ANS002:7E8 03 22 F1 95 00 00 00 00
  $%  REQ003:7E0 03 22 F1 99 00 00 00 00       $%  ANS003:7E8 03 22 F1 99 00 00 00 00
  $%  REQ004:7E0 03 22 F1 8B 00 00 00 00       $%  ANS004:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E0 03 22 F1 90 00 00 00 00       $%  ANS005:7E8 03 22 F1 90 00 00 00 00

  $%  000:硬件编号:                       $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  001:软件编号:                       $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:软件版本号:                     $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2);
  $%  003:编程日期:                       $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $%  004:ECU生产日期:                    $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $%  005:学习到的VIN(车辆识别码):        $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000.发动机转速                                  $    $  rpm          $    $  ANS000.BYTE036  $  y = x1*64+x2*64.0/255;
  $  001.电源电压                                    $    $  V            $    $  ANS000.BYTE035  $  y = x1*0.1;
  $  002.目标怠速(有补偿)                            $    $  rpm          $    $  ANS000.BYTE039  $  y = x1*10;
  $  003.进气压力                                    $    $  kPa          $    $  ANS000.BYTE046  $  y = x1;
  $  004.冷却液温度                                  $    $  degree C     $    $  ANS000.BYTE042  $  y = x1-40;
  $  005.节气门开度                                  $    $  %            $    $  ANS000.BYTE055  $  y =(x1*256+x2)*0.1;
  $  006.节气门目标开度                              $    $  %            $    $  ANS000.BYTE049  $  y =(x1*256+x2)*0.1;
  $  007.加速踏板位置                                $    $  %            $    $  ANS000.BYTE105  $  y =(x1*256+x2)*0.1;
  $  008.制动助力器压力                              $    $  kPa          $    $  ANS000.BYTE112  $  y = x1;
  $  009.充磁时间                                    $    $  毫秒         $    $  ANS000.BYTE063  $  y = x1*0.1;
  $  010.喷油脉宽                                    $    $  毫秒         $    $  ANS000.BYTE064  $  y = x1*0.1;
  $  011.进气流量                                    $    $  kg/h         $    $  ANS000.BYTE047  $  y =(x1*256+x2)*0.1;
  $  012.车速                                        $    $  km/h         $    $  ANS000.BYTE040  $  y = x1;
  $  013.运行里程                                    $    $  km           $    $  ANS000.BYTE092  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  014.运行时间                                    $    $  分           $    $  ANS000.BYTE096  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  015.进气温度                                    $    $  degree C     $    $  ANS000.BYTE044  $  y = x1-40;
  $  016.大气压力值                                  $    $  kPa          $    $  ANS000.BYTE120  $  y = x1;
  $  017.点火提前角                                  $    $  °           $    $  ANS000.BYTE065  $  y = x1-50;
  $  018.空燃比                                      $    $  %            $    $  ANS000.BYTE128  $  y = x1*0.1;
  $  019.爆震传感器1                                 $    $               $    $  ANS000.BYTE069  $  y =(x1*256+x2);
  $  020.1组氧传感器电压,传感器1(氧传感器1)          $    $  V            $    $  ANS000.BYTE081  $  y = x1*1.000/255;
  $  021.1组氧传感器电压,传感器2(氧传感器2)          $    $  V            $    $  ANS000.BYTE082  $  y = x1*1.000/255;
  $  022.1组氧传感器积分值(短期修正)                 $    $               $    $  ANS000.BYTE079  $  y = x1*2.0/255;
  $  023.1组氧传感器积分值(长期修正)                 $    $               $    $  ANS000.BYTE085  $  y = x1*2.0/255;
  $  024.1缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE073  $  y = x1*0.1;
  $  025.2缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE074  $  y = x1*0.1;
  $  026.3缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE075  $  y = x1*0.1;
  $  027.4缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE076  $  y = x1*0.1;
  $  028.发电机励磁开度                              $    $  %            $    $  ANS000.BYTE144  $  y = x1*100.0/255;
  $  029.故障里程                                    $    $  km           $    $  ANS000.BYTE134  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  030.燃油位置输出                                $    $  L            $    $  ANS000.BYTE138  $  y = x1;
  $  031.EGR(废气再循环)开度                         $    $  %            $    $  ANS000.BYTE139  $  y =(x1*256+x2)*0.1;
  $  032.节气门电机PWM(脉宽调制)                     $    $  %            $    $  ANS000.BYTE058  $  y = x1*100.0/255;
  $  033.碳罐阀占空比                                $    $  %            $    $  ANS000.BYTE062  $  y = x1*100.0/255;
  $  034.巡航车速                                    $    $  km/h         $    $  ANS000.BYTE139  $  y = x1*0.1;
  $  035.电池传感器电压(LIN(本地互联网络))           $    $  V            $    $  ANS000.BYTE157  $  y = x1*0.1;
  $  036.电池电量                                    $    $  %            $    $  ANS000.BYTE165  $  y = x1*100.0/255;
  $  037.电池温度                                    $    $  degree C     $    $  ANS000.BYTE169  $  y = x1-40;
  $  038.EGR(废气再循环)阀位置传感器                 $    $  V            $    $  ANS000.BYTE141  $  y = x1*5.0/255;
  $  039.冷却液温度传感器                            $    $  V            $    $  ANS000.BYTE041  $  y = x1*5.0/255;
  $  040.进气温度传感器                              $    $  V            $    $  ANS000.BYTE043  $  y = x1*5.0/255;
  $  041.进气压力传感器                              $    $  V            $    $  ANS000.BYTE045  $  y = x1*5.0/255;
  $  042.节气门位置传感器1                           $    $  V            $    $  ANS000.BYTE051  $  y = x1*5.0/255;
  $  043.节气门位置传感器2                           $    $  V            $    $  ANS000.BYTE053  $  y = x1*5.0/255;
  $  044.加速踏板1信号                               $    $  V            $    $  ANS000.BYTE103  $  y = x1*5.0/255;
  $  045.加速踏板2信号                               $    $  V            $    $  ANS000.BYTE104  $  y = x1*5.0/255;
  $  046.巡航开关传感器                              $    $  V            $    $  ANS000.BYTE143  $  y = x1*5.0/255;
  $  047.启停控制1-启停功能主开关                    $    $               $    $  ANS000.BYTE021  $  if(x1&0x01)y=@001d;else y=@001e;
  $  048.启停控制1-AC关联                            $    $               $    $  ANS000.BYTE021  $  if(x1&0x02)y=@05a9;else y=@05aa;
  $  049.启停控制1-车速条件                          $    $               $    $  ANS000.BYTE021  $  if(x1&0x04)y=@088e;else y=@088f;
  $  050.启停控制1-水温条件                          $    $               $    $  ANS000.BYTE021  $  if(x1&0x08)y=@088e;else y=@088f;
  $  051.启停控制1-室外温度条件                      $    $               $    $  ANS000.BYTE021  $  if(x1&0x10)y=@088e;else y=@088f;
  $  052.启停控制1-空调条件                          $    $               $    $  ANS000.BYTE021  $  if(x1&0x20)y=@088e;else y=@088f;
  $  053.启停控制1-电池能力条件                      $    $               $    $  ANS000.BYTE021  $  if(x1&0x40)y=@088e;else y=@088f;
  $  054.启停控制1-真空度条件                        $    $               $    $  ANS000.BYTE021  $  if(x1&0x80)y=@088e;else y=@088f;
  $  055.启停控制2-安全条件导致失效                  $    $               $    $  ANS000.BYTE019  $  if(x1&0x01)y=@088e;else y=@088f;
  $  056.启停控制2-发动机故障导致失效                $    $               $    $  ANS000.BYTE019  $  if(x1&0x02)y=@088e;else y=@088f;
  $  057.启停控制2-前舱盖条件                        $    $               $    $  ANS000.BYTE019  $  if(x1&0x04)y=@088e;else y=@088f;
  $  058.启停控制2-左前门条件                        $    $               $    $  ANS000.BYTE019  $  if(x1&0x08)y=@088e;else y=@088f;
  $  059.启停控制2-拖动无超时                        $    $               $    $  ANS000.BYTE019  $  if(x1&0x10)y=@088e;else y=@088f;
  $  060.启停控制2-节气门无故障                      $    $               $    $  ANS000.BYTE019  $  if(x1&0x20)y=@088e;else y=@088f;
  $  061.启停控制2-水温无故障                        $    $               $    $  ANS000.BYTE019  $  if(x1&0x40)y=@088e;else y=@088f;
  $  062.启停控制2-进气压力无故障                    $    $               $    $  ANS000.BYTE019  $  if(x1&0x80)y=@088e;else y=@088f;
  $  063.发动机防盗解锁-ECU发送码验证结果            $    $               $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0191;else y=@0192;
  $  064.发动机防盗解锁-IKey发送码验证结果           $    $               $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0191;else y=@0192;
  $  065.发动机防盗解锁-ECU新旧状态                  $    $               $    $  ANS000.BYTE022  $  if(x1&0x04)y=@00ef;else y=@00ee;
  $  066.发动机冷却系统-高速风扇是否开启             $    $               $    $  ANS000.BYTE023  $  if(x1&0x02)y=@0185;else y=@0186;
  $  067.发动机稳态工况-点火电源开启                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x01)y=@0185;else y=@0186;
  $  068.发动机稳态工况-主继电器工作                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x02)y=@0185;else y=@0186;
  $  069.发动机稳态工况-燃油泵状态                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x04)y=@001d;else y=@001e;
  $  070.发动机动态工况-节气门处于怠速位置           $    $               $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0185;else y=@0186;
  $  071.发动机动态工况-节气门处于部分打开位置       $    $               $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0185;else y=@0186;
  $  072.发动机动态工况-节气门处于全开位置           $    $               $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0185;else y=@0186;
  $  073.发动机动态工况-激活减速断油                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x08)y=@00f2;else y=@0181;
  $  074.发动机动态工况-激活加速加浓                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x10)y=@00f2;else y=@0181;
  $  075.发动机动态工况-是否D档(前进挡)              $    $               $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0185;else y=@0186;
  $  076.发动机动态工况-是否R档(后退挡)              $    $               $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0185;else y=@0186;
  $  077.发动机动态工况-是否N档(空挡)                $    $               $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0185;else y=@0186;
  $  078.排放控制-氧传感器1信号                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x01)y=@017f;else y=@0180;
  $  079.排放控制-氧传感器2信号                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x02)y=@017f;else y=@0180;
  $  080.排放控制-氧传感器1加热                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x10)y=@0183;else y=@0184;
  $  081.排放控制-氧传感器2加热                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x20)y=@0183;else y=@0184;
  $  082.发动机怠速-制动器状态                       $    $               $    $  ANS000.BYTE028  $  if(x1&0x02)y=@0118;else y=@0182;
  $  083.发动机怠速-是否有空调请求                   $    $               $    $  ANS000.BYTE028  $  if(x1&0x04)y=@0185;else y=@0186;
  $  084.发动机怠速-动力转向开关                     $    $               $    $  ANS000.BYTE028  $  if(x1&0x10)y=@001d;else y=@001e;
  $  085.指示灯SVS/MIL-MIL(故障指示灯)激活           $    $               $    $  ANS000.BYTE029  $  if(x1&0x01)y=@00f2;else y=@0181;
  $  086.指示灯SVS/MIL-MIL(故障指示灯)闪烁           $    $               $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0185;else y=@0186;
  $  087.指示灯SVS/MIL-SVS(系统维修指示灯)激活       $    $               $    $  ANS000.BYTE029  $  if(x1&0x10)y=@00f2;else y=@0181;
  $  088.指示灯SVS/MIL-SVS(系统维修指示灯)闪烁       $    $               $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0185;else y=@0186;
  $  089.空调系统-空调请求激活                       $    $               $    $  ANS000.BYTE031  $  if(x1&0x02)y=@00f2;else y=@0181;
  $  090.空调系统-空调压缩机开                       $    $               $    $  ANS000.BYTE031  $  if(x1&0x04)y=@0185;else y=@0186;
  $  091.空调系统-怠速转速因空调而增加               $    $               $    $  ANS000.BYTE031  $  if(x1&0x20)y=@0185;else y=@0186;
  $  092.空调系统-全负荷时关闭空调压缩机             $    $               $    $  ANS000.BYTE031  $  if(x1&0x40)y=@0185;else y=@0186;
  $  093.空调系统-空调中压开关开                     $    $               $    $  ANS000.BYTE031  $  if(x1&0x80)y=@0185;else y=@0186;
  $  094.发动机状态-刹车开关激活                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x01)y=@00f2;else y=@0181;
  $  095.巡航控制-按键状态                           $    $               $    $  ANS000.BYTE033  $  if((x1&0x1F)<0x04)y=@018b;else if((x1&0x1F)<0x08)y=@018c;else if((x1&0x1F)<0x0C)y=@018d;else if((x1&0x1F)<0x10)y=@018e;else if((x1&0x1F)<0x14)y=@018f;else if((x1&0x1F)<0x18)y=@0190;else y=@0001;
  $  096.发动机状态-刹车灯激活                       $    $               $    $  ANS000.BYTE034  $  if(x1&0x02)y=@00f2;else y=@0181;
  $  097.发动机状态-防盗锁定状态                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x20)y=@000a;else y=@0459;
  $  098.发动机状态-燃油反馈状态                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x40)y=@0189;else y=@018a;
  $  099.发动机状态-可变气门升程阀状态(VVL阀)        $    $               $    $  ANS000.BYTE034  $  if(x1&0x80)y=@001d;else y=@001e;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
