
    车型ID：a506

    模拟：协议模拟-->a506

;******************************************************************************************************************************************************

    通讯线: $~12$~12$~10400

进入命令:

  $~  REQ000:81 28 F1 81 1B       $~  ANS000:81 28 F1 81 1B

空闲命令:

  $!  REQ000:81 28 F1 3E D8       $!  ANS000:81 28 F1 3E D8

退出命令:

  $@  REQ000:81 28 F1 82 1C       $@  ANS000:81 28 F1 82 1C


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 28 F1 18 00 FF 00 B4       $#  ANS000:84 28 F1 18 00 FF 00 B4

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/44010000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 28 F1 14 FF 00 AF       $$  ANS000:83 28 F1 14 FF 00 AF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 28 F1 1A 80 35       $%  ANS000:82 28 F1 1A 80 35

  $%  000:ECU基本车型零件编号:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%d%d%d%d],x1,x2,x3,x4);
  $%  001:ECU校准零件编号:            $%    $%  ANS000.BYTE009  $%  HEX(x1,x2,x3,x4);
  $%  002:ECU软件编号:                $%    $%  ANS000.BYTE013  $%  HEX(x1,x2,x3,x4);
  $%  003:ECU部件识别设备:            $%    $%  ANS000.BYTE017  $%  ASCII(x1,x2);
  $%  004:ECU产地:                    $%    $%  ANS000.BYTE019  $%  ASCII(x1);
  $%  005:ECU供应商代码:              $%    $%  ANS000.BYTE020  $%  ASCII(x1);
  $%  006:ECU制造代码:                $%    $%  ANS000.BYTE021  $%  ASCII(x1);
  $%  007:ECU生产日期代码:            $%    $%  ANS000.BYTE022  $%  ASCII(x1,x2,x3,x4);
  $%  008:ECU生产序列号:              $%    $%  ANS000.BYTE026  $%  ASCII(x1,x2,x3,x4);
  $%  009:ECU模块零件编号:            $%    $%  ANS000.BYTE030  $%  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.系统常规信息
  $  00.系统常规信息
  $  REQ000:82 28 F1 21 01 BD       $  ANS000:82 28 F1 21 01 BD

  $  000.左前轮速                              $    $  km/h     $    $  ANS000.BYTE005  $  if(((x1*0x100+x2)*0.0078125)>255.0) y=@0525;else y=(x1*256.0+x2)*0.0078125;
  $  001.右前轮速                              $    $  km/h     $    $  ANS000.BYTE007  $  if(((x1*0x100+x2)*0.0078125)>255.0) y=@0525;else y=(x1*256.0+x2)*0.0078125;
  $  002.左后轮速                              $    $  km/h     $    $  ANS000.BYTE009  $  if(((x1*0x100+x2)*0.0078125)>255.0) y=@0525;else y=(x1*256.0+x2)*0.0078125;
  $  003.右后轮速                              $    $  km/h     $    $  ANS000.BYTE011  $  if(((x1*0x100+x2)*0.0078125)>255.0) y=@0525;else y=(x1*256.0+x2)*0.0078125;
  $  004.车速                                  $    $  km/h     $    $  ANS000.BYTE013  $  if(((x1*0x100+x2)*0.015625)>255.0) y=@0525;else y=(x1*256.0+x2)*0.015625;
  $  005.恶劣路况参数                          $    $  g        $    $  ANS000.BYTE015  $  y=x1*0.00392;
  $  006.电子比例阀(DRP(电子比例阀))故障       $    $           $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0185; else y=@0186;
  $  007.ABS(防抱死刹车系统)故障               $    $           $    $  ANS000.BYTE017  $  if(x1&0x01) y=@0185; else y=@0186;
  $  008.电子比例阀(DRP(电子比例阀))作用       $    $           $    $  ANS000.BYTE019  $  if(x1&0x02) y=@0185; else y=@0186;
  $  009.ABS(防抱死刹车系统)作用               $    $           $    $  ANS000.BYTE019  $  if(x1&0x01) y=@0185; else y=@0186;
  $  010.采用ABS(防抱死刹车系统)制动开关       $    $           $    $  ANS000.BYTE020  $  if(x1&0x10) y=@0185; else y=@0186;
  $  011.电子比例阀警告灯                      $    $           $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0173; else y=@0172;
  $  012.ABS(防抱死刹车系统)告警灯             $    $           $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0173; else y=@0172;
  $  013.系统继电器指令状态                    $    $           $    $  ANS000.BYTE022  $  if(x1&0x80) y=@0173; else y=@0172;
  $  014.系统继电器反馈状态                    $    $           $    $  ANS000.BYTE022  $  if(x1&0x40) y=@0173; else y=@0172;
  $  015.马达指令状态                          $    $           $    $  ANS000.BYTE022  $  if(x1&0x20) y=@0173; else y=@0172;
  $  016.马达反馈状态                          $    $           $    $  ANS000.BYTE022  $  if(x1&0x10) y=@0173; else y=@0172;
  $  017.点火电压                              $    $  V        $    $  ANS000.BYTE024  $  if(((x1*0x100+x2)*0.000488281)>19.0) y=@0525;else y=(x1*256.0+x2)*0.000488281;
  $  018.转换的系统电瓶电压                    $    $  V        $    $  ANS000.BYTE026  $  if(((x1*0x100+x2)*0.000976563)>19.0) y=@0525;else y=(x1*256.0+x2)*0.000976563;
  $  019.泵电压交叉反馈                        $    $  V        $    $  ANS000.BYTE028  $  if(((x1*0x100+x2)*0.000976563)>19.0) y=@0525;else y=(x1*256.0+x2)*0.000976563;
  $  020.转换的马达电压                        $    $  V        $    $  ANS000.BYTE030  $  if(((x1*0x100+x2)*0.000976563)>19.0) y=@0525;else y=(x1*256.0+x2)*0.000976563;
  $  021.右后释放电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x80) y=@0173; else y=@0172;
  $  022.右后保持电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x40) y=@0173; else y=@0172;
  $  023.左后释放电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x20) y=@0173; else y=@0172;
  $  024.左后保持电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x10) y=@0173; else y=@0172;
  $  025.右前释放电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0173; else y= @0172;
  $  026.右前保持电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x04) y=@0173; else y= @0172;
  $  027.左前释放电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0173; else y=@0172;
  $  028.左前保持电磁阀激励                    $    $           $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0173; else y=@0172;

  $)  01.高级诊断信息
  $  01.高级诊断信息
  $  REQ000:82 28 F1 21 03 BF       $  ANS000:82 28 F1 21 03 BF

  $  000.最后一个故障码                                                   $    $       $    $  ANS000.BYTE005  $  if((x1==0x00) && (x2==0x00)) y=@0525;else if(x1<0x40) y=SPRINTF([P%02x%02x],x1,x2); else if(x1<0x80) y=SPRINTF([C%02x%02x],x1-0x40,x2); else if(x1<0xc0) y=SPRINTF([B%02x%02x],x1-0x80,x2);else y=SPRINTF([U%02x%02x],x1-0xC0,x2);
  $  001.当最后一个故障码最后一次出现时,DRP(电子比例阀)起作用             $    $       $    $  ANS000.BYTE007  $  if(x1&0x02) y=@0185;else y=@0186;
  $  002.当最后一个故障码最后一次出现时,ABS(防抱死刹车系统)起作用         $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0185;else y=@0186;
  $  003.当最后一个故障码最后一次出现时,制动开关打开                      $    $       $    $  ANS000.BYTE008  $  if(x1&0x10) y=@0185;else y=@0186;
  $  004.当最后一个故障码最后一次出现时的车速                             $    $       $    $  ANS000.BYTE009  $  y=(x1*256.0+x2)*0.015625;
  $  005.从最后一个故障码最后一次出现时起的点火周期                       $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.从最后一个故障码第一次出现时起的点火周期                         $    $       $    $  ANS000.BYTE012  $  y=x1;
  $  007.最后一个故障码出现次数                                           $    $       $    $  ANS000.BYTE013  $  y=x1;
  $  008.倒数第二个故障码                                                 $    $       $    $  ANS000.BYTE025  $  if((x1==0x00) && (x2==0x00)) y=@0525;else if(x1<0x40) y=SPRINTF([P%02x%02x],x1,x2); else if(x1<0x80) y=SPRINTF([C%02x%02x],x1-0x40,x2); else if(x1<0xc0) y=SPRINTF([B%02x%02x],x1-0x80,x2);else y=SPRINTF([U%02x%02x],x1-0xC0,x2);
  $  009.当倒数第二个故障码最后一次出现时,DRP(电子比例阀)起作用           $    $       $    $  ANS000.BYTE027  $  if(x1&0x02) y=@0185;else y=@0186;
  $  010.当倒数第二个故障码最后一次出现时,ABS(防抱死刹车系统)起作用       $    $       $    $  ANS000.BYTE027  $  if(x1&0x01) y=@0185;else y=@0186;
  $  011.当倒数第二个故障码最后一次出现时,制动开关ON(打开)                $    $       $    $  ANS000.BYTE028  $  if(x1&0x10) y=@0185;else y=@0186;
  $  012.当倒数第二个故障码最后一次出现时的车速                           $    $       $    $  ANS000.BYTE029  $  y=(x1*256.0+x2)*0.015625;
  $  013.从倒数第二个故障码最后一次出现时起的点火周期                     $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  014.从倒数第二个故障码第一次出现时起的点火周期                       $    $       $    $  ANS000.BYTE032  $  y=x1;
  $  015.倒数第二个故障码出现次数                                         $    $       $    $  ANS000.BYTE033  $  y=x1;
  $  016.倒数第三个故障码                                                 $    $       $    $  ANS000.BYTE034  $  if((x1==0x00) && (x2==0x00)) y=@0525;else if(x1<0x40) y=SPRINTF([P%02x%02x],x1,x2); else if(x1<0x80) y=SPRINTF([C%02x%02x],x1-0x40,x2); else if(x1<0xc0) y=SPRINTF([B%02x%02x],x1-0x80,x2);else y=SPRINTF([U%02x%02x],x1-0xC0,x2);
  $  017.当倒数第三个故障码最后一次出现时,DRP(电子比例阀)起作用           $    $       $    $  ANS000.BYTE036  $  if(x1&0x02) y=@0185;else y=@0186;
  $  018.当倒数第三个故障码最后一次出现时,ABS(防抱死刹车系统)起作用       $    $       $    $  ANS000.BYTE036  $  if(x1&0x01) y=@0185;else y=@0186;
  $  019.当倒数第三个故障码最后一次出现时,制动开关打开                    $    $       $    $  ANS000.BYTE037  $  if(x1&0x10) y=@0185;else y=@0186;
  $  020.当倒数第三个故障码最后一次出现时的车速                           $    $       $    $  ANS000.BYTE038  $  y=(x1*256.0+x2)*0.015625;
  $  021.从倒数第三个故障码最后一次出现时起的点火周期                     $    $       $    $  ANS000.BYTE040  $  y=x1;
  $  022.从倒数第三个故障码第一次出现时起的点火周期                       $    $       $    $  ANS000.BYTE041  $  y=x1;
  $  023.倒数第三个故障码出现次数                                         $    $       $    $  ANS000.BYTE042  $  y=x1;

;******************************************************************************************************************************************************

