
    车型ID：ad03

    模拟：协议模拟-->ad03

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~789

进入命令:

  $~  REQ000:781 02 10 01 00 00 00 00 00       $~  ANS000:789 02 10 01 00 00 00 00 00
  $~  REQ001:781 02 10 03 00 00 00 00 00       $~  ANS001:789 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:781 02 3E 80 00 00 00 00 00       $!  ANS000:789 02 3E 80 00 00 00 00 00

退出命令:

  $@  REQ000:781 02 10 01 00 00 00 00 00       $@  ANS000:789 02 10 01 00 00 00 00 00


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:781 05 18 00 FF FF FF 00 00       $#  ANS000:789 05 18 00 FF FF FF 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  ANS000.BYTE02 控制故障码个数，从$#ANS000.BYTE3$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/fe000000


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:781 04 14 FF FF FF 00 00 00       $$  ANS000:789 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:781 03 22 00 01 00 00 00 00       $%  ANS000:789 03 22 00 01 00 00 00 00
  $%  REQ001:781 03 22 00 03 00 00 00 00       $%  ANS001:789 03 22 00 03 00 00 00 00
  $%  REQ002:781 03 22 1F FF 00 00 00 00       $%  ANS002:789 03 22 1F FF 00 00 00 00
  $%  REQ003:781 03 22 1F FD 00 00 00 00       $%  ANS003:789 03 22 1F FD 00 00 00 00

  $%  000:硬件版本:                             $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d.%d],x1,x2,x3,x4);
  $%  001:软件版本:                             $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%d.%d.%d.%d],x1,x2,x3,x4);
  $%  002:BMS(电池管理系统)工作状态:            $%    $%  ANS002.BYTE004  $%  if(x1==0x00)y=@0442;else if(x1==0x01)y=@0be5;else y=@00da;
  $%  003:电池包实际SOC(荷电状态)标定值:        $%    $%  ANS003.BYTE004  $%  y=(x2*256+x1)/100;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:781 03 22 00 04 00 00 00 00       $  ANS000:789 03 22 00 04 00 00 00 00
  $  REQ001:781 03 22 00 05 00 00 00 00       $  ANS001:789 03 22 00 05 00 00 00 00
  $  REQ002:781 03 22 00 06 00 00 00 00       $  ANS002:789 03 22 00 06 00 00 00 00
  $  REQ003:781 03 22 00 07 00 00 00 00       $  ANS003:789 03 22 00 07 00 00 00 00
  $  REQ004:781 03 22 00 08 00 00 00 00       $  ANS004:789 03 22 00 08 00 00 00 00
  $  REQ005:781 03 22 00 09 00 00 00 00       $  ANS005:789 03 22 00 09 00 00 00 00
  $  REQ006:781 03 22 00 0A 00 00 00 00       $  ANS006:789 03 22 00 0A 00 00 00 00
  $  REQ007:781 03 22 00 0B 00 00 00 00       $  ANS007:789 03 22 00 0B 00 00 00 00
  $  REQ008:781 03 22 00 0C 00 00 00 00       $  ANS008:789 03 22 00 0C 00 00 00 00
  $  REQ009:781 03 22 00 0D 00 00 00 00       $  ANS009:789 03 22 00 0D 00 00 00 00
  $  REQ010:781 03 22 00 0E 00 00 00 00       $  ANS010:789 03 22 00 0E 00 00 00 00
  $  REQ011:781 03 22 00 0F 00 00 00 00       $  ANS011:789 03 22 00 0F 00 00 00 00
  $  REQ012:781 03 22 00 10 00 00 00 00       $  ANS012:789 03 22 00 10 00 00 00 00
  $  REQ013:781 03 22 00 11 00 00 00 00       $  ANS013:789 03 22 00 11 00 00 00 00
  $  REQ014:781 03 22 00 12 00 00 00 00       $  ANS014:789 03 22 00 12 00 00 00 00
  $  REQ015:781 03 22 00 13 00 00 00 00       $  ANS015:789 03 22 00 13 00 00 00 00
  $  REQ016:781 03 22 00 14 00 00 00 00       $  ANS016:789 03 22 00 14 00 00 00 00
  $  REQ017:781 03 22 00 15 00 00 00 00       $  ANS017:789 03 22 00 15 00 00 00 00
  $  REQ018:781 03 22 00 16 00 00 00 00       $  ANS018:789 03 22 00 16 00 00 00 00
  $  REQ019:781 03 22 00 17 00 00 00 00       $  ANS019:789 03 22 00 17 00 00 00 00
  $  REQ020:781 03 22 00 18 00 00 00 00       $  ANS020:789 03 22 00 18 00 00 00 00
  $  REQ021:781 03 22 00 19 00 00 00 00       $  ANS021:789 03 22 00 19 00 00 00 00
  $  REQ022:781 03 22 00 1A 00 00 00 00       $  ANS022:789 03 22 00 1A 00 00 00 00
  $  REQ023:781 03 22 00 1B 00 00 00 00       $  ANS023:789 03 22 00 1B 00 00 00 00
  $  REQ024:781 03 22 00 1C 00 00 00 00       $  ANS024:789 03 22 00 1C 00 00 00 00
  $  REQ025:781 03 22 00 1D 00 00 00 00       $  ANS025:789 03 22 00 1D 00 00 00 00
  $  REQ026:781 03 22 00 1E 00 00 00 00       $  ANS026:789 03 22 00 1E 00 00 00 00
  $  REQ027:781 03 22 00 20 00 00 00 00       $  ANS027:789 03 22 00 20 00 00 00 00
  $  REQ028:781 03 22 00 21 00 00 00 00       $  ANS028:789 03 22 00 21 00 00 00 00
  $  REQ029:781 03 22 01 31 00 00 00 00       $  ANS029:789 03 22 01 31 00 00 00 00
  $  REQ030:781 03 22 00 23 00 00 00 00       $  ANS030:789 03 22 00 23 00 00 00 00
  $  REQ031:781 03 22 00 24 00 00 00 00       $  ANS031:789 03 22 00 24 00 00 00 00
  $  REQ032:781 03 22 00 25 00 00 00 00       $  ANS032:789 03 22 00 25 00 00 00 00
  $  REQ033:781 03 22 00 26 00 00 00 00       $  ANS033:789 03 22 00 26 00 00 00 00
  $  REQ034:781 03 22 01 32 00 00 00 00       $  ANS034:789 03 22 01 32 00 00 00 00
  $  REQ035:781 03 22 00 27 00 00 00 00       $  ANS035:789 03 22 00 27 00 00 00 00
  $  REQ036:781 03 22 00 28 00 00 00 00       $  ANS036:789 03 22 00 28 00 00 00 00
  $  REQ037:781 03 22 00 29 00 00 00 00       $  ANS037:789 03 22 00 29 00 00 00 00
  $  REQ038:781 03 22 00 2A 00 00 00 00       $  ANS038:789 03 22 00 2A 00 00 00 00
  $  REQ039:781 03 22 00 2C 00 00 00 00       $  ANS039:789 03 22 00 2C 00 00 00 00
  $  REQ040:781 03 22 00 2D 00 00 00 00       $  ANS040:789 03 22 00 2D 00 00 00 00
  $  REQ041:781 03 22 00 2E 00 00 00 00       $  ANS041:789 03 22 00 2E 00 00 00 00
  $  REQ042:781 03 22 00 2F 00 00 00 00       $  ANS042:789 03 22 00 2F 00 00 00 00
  $  REQ043:781 03 22 00 30 00 00 00 00       $  ANS043:789 03 22 00 30 00 00 00 00
  $  REQ044:781 03 22 00 31 00 00 00 00       $  ANS044:789 03 22 00 31 00 00 00 00
  $  REQ045:781 03 22 00 32 00 00 00 00       $  ANS045:789 03 22 00 32 00 00 00 00
  $  REQ046:781 03 22 00 33 00 00 00 00       $  ANS046:789 03 22 00 33 00 00 00 00
  $  REQ047:781 03 22 00 34 00 00 00 00       $  ANS047:789 03 22 00 34 00 00 00 00
  $  REQ048:781 03 22 00 35 00 00 00 00       $  ANS048:789 03 22 00 35 00 00 00 00
  $  REQ049:781 03 22 00 36 00 00 00 00       $  ANS049:789 03 22 00 36 00 00 00 00

  $  000.充电是否允许                        $    $               $    $  ANS000.BYTE004  $  if(x1==0x00)y=@0195;else if(x1==0x01)y=@0196;else y=@0001;
  $  001.充电感应信号                        $    $               $    $  ANS001.BYTE004  $  if(x1==0x00)y=@01f8;else if(x1==0x01)y=@01f9;else y=@0001;
  $  002.低温标志                            $    $               $    $  ANS002.BYTE004  $  if(x1==0x00)y=@01f8;else if(x1==0x01)y=@01f9;else y=@0001;
  $  003.电池包品检代号                      $    $               $    $  ANS003.BYTE004  $  if(x1==0x00)y=@01f8;else if(x1==0x01)y=@01f9;else y=@0001;
  $  004.放电是否允许                        $    $               $    $  ANS004.BYTE004  $  if(x1==0x00)y=@0195;else if(x1==0x01)y=@0196;else y=@0001;
  $  005.放电主接触器状态                    $    $               $    $  ANS005.BYTE004  $  if(x1==0x00)y=@002a;else if(x1==0x01)y=@002b;else y=@0001;
  $  006.预充接触器状态                      $    $               $    $  ANS006.BYTE004  $  if(x1==0x00)y=@002a;else if(x1==0x01)y=@002b;else y=@0001;
  $  007.充电接触器状态                      $    $               $    $  ANS007.BYTE004  $  if(x1==0x00)y=@002a;else if(x1==0x01)y=@002b;else y=@0001;
  $  008.负极接触器状态                      $    $               $    $  ANS008.BYTE004  $  if(x1==0x00)y=@002a;else if(x1==0x01)y=@002b;else y=@0001;
  $  009.分压接触器1状态                     $    $               $    $  ANS009.BYTE004  $  if(x1==0x01)y=@002a;else if(x1==0x02)y=@002b;else y=@0001;
  $  010.分压接触器2状态                     $    $               $    $  ANS010.BYTE004  $  if(x1==0x01)y=@002a;else if(x1==0x02)y=@002b;else y=@0001;
  $  011.分压接触器3状态                     $    $               $    $  ANS011.BYTE004  $  if(x1==0x01)y=@002a;else if(x1==0x02)y=@002b;else y=@0001;
  $  012.分压接触器4状态                     $    $               $    $  ANS012.BYTE004  $  if(x1==0x01)y=@002a;else if(x1==0x02)y=@002b;else y=@0001;
  $  013.高压互锁状态                        $    $               $    $  ANS013.BYTE004  $  if(x1==0x00)y=@01ef;else if(x1==0x01)y=@01f0;else y=@0001;
  $  014.放电主接触器烧结故障报警            $    $               $    $  ANS014.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@0426;else y=@0001;
  $  015.负极接触器烧结故障报警              $    $               $    $  ANS015.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@0426;else y=@0001;
  $  016.高压系统状态                        $    $               $    $  ANS016.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@01ed;else if(x1==0x02)y=@01ee;else y=@0001;
  $  017.电池组电量状态                      $    $               $    $  ANS017.BYTE004  $  if(x1==0x00)y=@08cd;else if(x1==0x01)y=@08ce;else y=@0001;
  $  018.湿度状态                            $    $               $    $  ANS018.BYTE004  $  if(x1==0x00)y=@0812;else if(x1==0x01)y=@0813;else y=@0001;
  $  019.过流状态                            $    $               $    $  ANS019.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@08cc;else y=@0001;
  $  020.单节电池温度状态                    $    $               $    $  ANS020.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@0be8;else if(x1==0x02)y=@0be9;else y=@0001;
  $  021.单节电池电压过低报警状态            $    $               $    $  ANS021.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@0be6;else if(x1==0x02)y=@0be7;else y=@0001;
  $  022.单节电池电压过高报警状态            $    $               $    $  ANS022.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@0bec;else if(x1==0x02)y=@0be7;else y=@0001;
  $  023.碰撞信号报警状态                    $    $               $    $  ANS023.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@0beb;else y=@0001;
  $  024.碰撞报警仪表信号状态                $    $               $    $  ANS024.BYTE004  $  if(x1==0x00)y=@0078;else if(x1==0x01)y=@0bea;else y=@0001;
  $  025.电池组当前总电压                    $    $  V            $    $  ANS025.BYTE004  $  y=x1+x2*256;
  $  026.电池组当前总电流                    $    $  A            $    $  ANS026.BYTE004  $  y=(x1+x2*256)*0.1-500;
  $  027.SOC(荷电状态)                       $    $  %            $    $  ANS027.BYTE004  $  y=x1;
  $  028.电池组平均温度                      $    $  degree C     $    $  ANS028.BYTE004  $  y=x1-40;
  $  029.低温标志                            $    $               $    $  ANS029.BYTE004  $  y=x1-40;
  $  030.最低电池电压编号                    $    $               $    $  ANS030.BYTE004  $  y=x1+1;
  $  031.最低单节电池电压                    $    $  V            $    $  ANS031.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  032.最高电池电压编号                    $    $               $    $  ANS032.BYTE004  $  y=x1+1;
  $  033.最高单节电池电压                    $    $  V            $    $  ANS033.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  034.平均温度                            $    $  degree C     $    $  ANS034.BYTE004  $  y=x1-40;
  $  035.最低温度电池编号                    $    $               $    $  ANS035.BYTE004  $  y=x1+1;
  $  036.最低单节电池温度                    $    $  degree C     $    $  ANS036.BYTE004  $  y=x1-40;
  $  037.最高温度电池编号                    $    $               $    $  ANS037.BYTE004  $  y=x1+1;
  $  038.最高单节电池温度                    $    $  degree C     $    $  ANS038.BYTE004  $  y=x1-40;
  $  039.充电次数                            $    $               $    $  ANS039.BYTE004  $  y=x1+x2*256;
  $  040.单次充电容量                        $    $               $    $  ANS040.BYTE004  $  y=x1;
  $  041.累计充电容量                        $    $               $    $  ANS041.BYTE004  $  y=x1+x2*256+x3*256*256;
  $  042.累计放电容量                        $    $               $    $  ANS042.BYTE004  $  y=x1+x2*256+x3*256*256;
  $  043.充电容量修正次数                    $    $               $    $  ANS043.BYTE004  $  y=x1+x2*256;
  $  044.放电容量修正次数                    $    $               $    $  ANS044.BYTE004  $  y=x1+x2*256;
  $  045.最大允许放电功率                    $    $  kw           $    $  ANS045.BYTE004  $  y=(x1+x2*256)*0.1;
  $  046.最大允许充电功率                    $    $  kw           $    $  ANS046.BYTE004  $  y=(x1+x2*256)*0.1;
  $  047.BMS(电池管理系统)12V电源电压        $    $  V            $    $  ANS047.BYTE004  $  y=x1*0.1;
  $  048.BMS(电池管理系统)+15V电源电压       $    $  V            $    $  ANS048.BYTE004  $  y=x1*0.1;
  $  049.BMS(电池管理系统)-15V电源电压       $    $  V            $    $  ANS049.BYTE004  $  y=x1*0.1;

  $)  01.模组信息
  $  01.模组信息
  $  REQ000:781 03 22 00 E1 00 00 00 00       $  ANS000:789 03 22 00 E1 00 00 00 00
  $  REQ001:781 03 22 00 E2 00 00 00 00       $  ANS001:789 03 22 00 E2 00 00 00 00
  $  REQ002:781 03 22 00 E3 00 00 00 00       $  ANS002:789 03 22 00 E3 00 00 00 00
  $  REQ003:781 03 22 00 E4 00 00 00 00       $  ANS003:789 03 22 00 E4 00 00 00 00
  $  REQ004:781 03 22 00 E5 00 00 00 00       $  ANS004:789 03 22 00 E5 00 00 00 00
  $  REQ005:781 03 22 00 E6 00 00 00 00       $  ANS005:789 03 22 00 E6 00 00 00 00
  $  REQ006:781 03 22 00 E7 00 00 00 00       $  ANS006:789 03 22 00 E7 00 00 00 00
  $  REQ007:781 03 22 00 E8 00 00 00 00       $  ANS007:789 03 22 00 E8 00 00 00 00
  $  REQ008:781 03 22 00 E9 00 00 00 00       $  ANS008:789 03 22 00 E9 00 00 00 00
  $  REQ009:781 03 22 00 EA 00 00 00 00       $  ANS009:789 03 22 00 EA 00 00 00 00
  $  REQ010:781 03 22 00 EB 00 00 00 00       $  ANS010:789 03 22 00 EB 00 00 00 00
  $  REQ011:781 03 22 00 EC 00 00 00 00       $  ANS011:789 03 22 00 EC 00 00 00 00
  $  REQ012:781 03 22 00 ED 00 00 00 00       $  ANS012:789 03 22 00 ED 00 00 00 00
  $  REQ013:781 03 22 00 EE 00 00 00 00       $  ANS013:789 03 22 00 EE 00 00 00 00
  $  REQ014:781 03 22 00 EF 00 00 00 00       $  ANS014:789 03 22 00 EF 00 00 00 00
  $  REQ015:781 03 22 00 F0 00 00 00 00       $  ANS015:789 03 22 00 F0 00 00 00 00
  $  REQ016:781 03 22 00 F1 00 00 00 00       $  ANS016:789 03 22 00 F1 00 00 00 00
  $  REQ017:781 03 22 00 F2 00 00 00 00       $  ANS017:789 03 22 00 F2 00 00 00 00
  $  REQ018:781 03 22 00 F3 00 00 00 00       $  ANS018:789 03 22 00 F3 00 00 00 00
  $  REQ019:781 03 22 00 F4 00 00 00 00       $  ANS019:789 03 22 00 F4 00 00 00 00
  $  REQ020:781 03 22 00 F5 00 00 00 00       $  ANS020:789 03 22 00 F5 00 00 00 00
  $  REQ021:781 03 22 00 F6 00 00 00 00       $  ANS021:789 03 22 00 F6 00 00 00 00
  $  REQ022:781 03 22 00 F7 00 00 00 00       $  ANS022:789 03 22 00 F7 00 00 00 00
  $  REQ023:781 03 22 00 F8 00 00 00 00       $  ANS023:789 03 22 00 F8 00 00 00 00
  $  REQ024:781 03 22 00 F9 00 00 00 00       $  ANS024:789 03 22 00 F9 00 00 00 00
  $  REQ025:781 03 22 00 FA 00 00 00 00       $  ANS025:789 03 22 00 FA 00 00 00 00
  $  REQ026:781 03 22 00 FB 00 00 00 00       $  ANS026:789 03 22 00 FB 00 00 00 00
  $  REQ027:781 03 22 00 FC 00 00 00 00       $  ANS027:789 03 22 00 FC 00 00 00 00
  $  REQ028:781 03 22 00 FD 00 00 00 00       $  ANS028:789 03 22 00 FD 00 00 00 00
  $  REQ029:781 03 22 00 FE 00 00 00 00       $  ANS029:789 03 22 00 FE 00 00 00 00
  $  REQ030:781 03 22 00 FF 00 00 00 00       $  ANS030:789 03 22 00 FF 00 00 00 00
  $  REQ031:781 03 22 01 00 00 00 00 00       $  ANS031:789 03 22 01 00 00 00 00 00
  $  REQ032:781 03 22 01 01 00 00 00 00       $  ANS032:789 03 22 01 01 00 00 00 00
  $  REQ033:781 03 22 01 02 00 00 00 00       $  ANS033:789 03 22 01 02 00 00 00 00
  $  REQ034:781 03 22 01 03 00 00 00 00       $  ANS034:789 03 22 01 03 00 00 00 00
  $  REQ035:781 03 22 01 04 00 00 00 00       $  ANS035:789 03 22 01 04 00 00 00 00
  $  REQ036:781 03 22 01 05 00 00 00 00       $  ANS036:789 03 22 01 05 00 00 00 00
  $  REQ037:781 03 22 01 06 00 00 00 00       $  ANS037:789 03 22 01 06 00 00 00 00
  $  REQ038:781 03 22 01 07 00 00 00 00       $  ANS038:789 03 22 01 07 00 00 00 00
  $  REQ039:781 03 22 01 08 00 00 00 00       $  ANS039:789 03 22 01 08 00 00 00 00
  $  REQ040:781 03 22 01 09 00 00 00 00       $  ANS040:789 03 22 01 09 00 00 00 00
  $  REQ041:781 03 22 01 0A 00 00 00 00       $  ANS041:789 03 22 01 0A 00 00 00 00
  $  REQ042:781 03 22 01 0B 00 00 00 00       $  ANS042:789 03 22 01 0B 00 00 00 00
  $  REQ043:781 03 22 01 0C 00 00 00 00       $  ANS043:789 03 22 01 0C 00 00 00 00
  $  REQ044:781 03 22 01 0D 00 00 00 00       $  ANS044:789 03 22 01 0D 00 00 00 00
  $  REQ045:781 03 22 01 0E 00 00 00 00       $  ANS045:789 03 22 01 0E 00 00 00 00
  $  REQ046:781 03 22 01 0F 00 00 00 00       $  ANS046:789 03 22 01 0F 00 00 00 00
  $  REQ047:781 03 22 01 10 00 00 00 00       $  ANS047:789 03 22 01 10 00 00 00 00
  $  REQ048:781 03 22 01 11 00 00 00 00       $  ANS048:789 03 22 01 11 00 00 00 00
  $  REQ049:781 03 22 01 12 00 00 00 00       $  ANS049:789 03 22 01 12 00 00 00 00
  $  REQ050:781 03 22 01 13 00 00 00 00       $  ANS050:789 03 22 01 13 00 00 00 00
  $  REQ051:781 03 22 01 14 00 00 00 00       $  ANS051:789 03 22 01 14 00 00 00 00
  $  REQ052:781 03 22 01 15 00 00 00 00       $  ANS052:789 03 22 01 15 00 00 00 00
  $  REQ053:781 03 22 01 16 00 00 00 00       $  ANS053:789 03 22 01 16 00 00 00 00
  $  REQ054:781 03 22 01 17 00 00 00 00       $  ANS054:789 03 22 01 17 00 00 00 00
  $  REQ055:781 03 22 01 18 00 00 00 00       $  ANS055:789 03 22 01 18 00 00 00 00
  $  REQ056:781 03 22 01 19 00 00 00 00       $  ANS056:789 03 22 01 19 00 00 00 00
  $  REQ057:781 03 22 01 1A 00 00 00 00       $  ANS057:789 03 22 01 1A 00 00 00 00
  $  REQ058:781 03 22 01 1B 00 00 00 00       $  ANS058:789 03 22 01 1B 00 00 00 00
  $  REQ059:781 03 22 01 1C 00 00 00 00       $  ANS059:789 03 22 01 1C 00 00 00 00
  $  REQ060:781 03 22 01 1D 00 00 00 00       $  ANS060:789 03 22 01 1D 00 00 00 00
  $  REQ061:781 03 22 01 1E 00 00 00 00       $  ANS061:789 03 22 01 1E 00 00 00 00
  $  REQ062:781 03 22 01 1F 00 00 00 00       $  ANS062:789 03 22 01 1F 00 00 00 00
  $  REQ063:781 03 22 01 20 00 00 00 00       $  ANS063:789 03 22 01 20 00 00 00 00
  $  REQ064:781 03 22 01 21 00 00 00 00       $  ANS064:789 03 22 01 21 00 00 00 00
  $  REQ065:781 03 22 01 22 00 00 00 00       $  ANS065:789 03 22 01 22 00 00 00 00
  $  REQ066:781 03 22 01 23 00 00 00 00       $  ANS066:789 03 22 01 23 00 00 00 00
  $  REQ067:781 03 22 01 24 00 00 00 00       $  ANS067:789 03 22 01 24 00 00 00 00
  $  REQ068:781 03 22 01 25 00 00 00 00       $  ANS068:789 03 22 01 25 00 00 00 00
  $  REQ069:781 03 22 01 26 00 00 00 00       $  ANS069:789 03 22 01 26 00 00 00 00
  $  REQ070:781 03 22 01 27 00 00 00 00       $  ANS070:789 03 22 01 27 00 00 00 00
  $  REQ071:781 03 22 01 28 00 00 00 00       $  ANS071:789 03 22 01 28 00 00 00 00
  $  REQ072:781 03 22 01 29 00 00 00 00       $  ANS072:789 03 22 01 29 00 00 00 00
  $  REQ073:781 03 22 01 2A 00 00 00 00       $  ANS073:789 03 22 01 2A 00 00 00 00
  $  REQ074:781 03 22 01 2B 00 00 00 00       $  ANS074:789 03 22 01 2B 00 00 00 00
  $  REQ075:781 03 22 01 2C 00 00 00 00       $  ANS075:789 03 22 01 2C 00 00 00 00
  $  REQ076:781 03 22 01 2D 00 00 00 00       $  ANS076:789 03 22 01 2D 00 00 00 00
  $  REQ077:781 03 22 01 2E 00 00 00 00       $  ANS077:789 03 22 01 2E 00 00 00 00
  $  REQ078:781 03 22 01 2F 00 00 00 00       $  ANS078:789 03 22 01 2F 00 00 00 00
  $  REQ079:781 03 22 01 30 00 00 00 00       $  ANS079:789 03 22 01 30 00 00 00 00

  $  000.模组1最低电压电池编号        $    $               $    $  ANS000.BYTE004  $  y=x1+1;
  $  001.模组1最低单节电池电压        $    $  V            $    $  ANS001.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  002.模组1最高电压电池编号        $    $               $    $  ANS002.BYTE004  $  y=x1+1;
  $  003.模组1最高单节电池电压        $    $  V            $    $  ANS003.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  004.模组1最低温度电池号          $    $               $    $  ANS004.BYTE004  $  y=x1+1;
  $  005.模组1最低单节电池温度        $    $  degree C     $    $  ANS005.BYTE004  $  y=x1-40;
  $  006.模组1最高温度电池号          $    $               $    $  ANS006.BYTE004  $  y=x1+1;
  $  007.模组1最高单节电池温度        $    $  degree C     $    $  ANS007.BYTE004  $  y=x1-40;
  $  008.模组2最低电压电池编号        $    $               $    $  ANS008.BYTE004  $  y=x1+1;
  $  009.模组2最低单节电池电压        $    $  V            $    $  ANS009.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  010.模组2最高电压电池编号        $    $               $    $  ANS010.BYTE004  $  y=x1+1;
  $  011.模组2最高单节电池电压        $    $  V            $    $  ANS011.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  012.模组2最低温度电池号          $    $               $    $  ANS012.BYTE004  $  y=x1+1;
  $  013.模组2最低单节电池温度        $    $  degree C     $    $  ANS013.BYTE004  $  y=x1-40;
  $  014.模组2最高温度电池号          $    $               $    $  ANS014.BYTE004  $  y=x1+1;
  $  015.模组2最高单节电池温度        $    $  degree C     $    $  ANS015.BYTE004  $  y=x1-40;
  $  016.模组3最低电压电池编号        $    $               $    $  ANS016.BYTE004  $  y=x1+1;
  $  017.模组3最低单节电池电压        $    $  V            $    $  ANS017.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  018.模组3最高电压电池编号        $    $               $    $  ANS018.BYTE004  $  y=x1+1;
  $  019.模组3最高单节电池电压        $    $  V            $    $  ANS019.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  020.模组3最低温度电池号          $    $               $    $  ANS020.BYTE004  $  y=x1+1;
  $  021.模组3最低单节电池温度        $    $  degree C     $    $  ANS021.BYTE004  $  y=x1-40;
  $  022.模组3最高温度电池号          $    $               $    $  ANS022.BYTE004  $  y=x1+1;
  $  023.模组3最高单节电池温度        $    $  degree C     $    $  ANS023.BYTE004  $  y=x1-40;
  $  024.模组4最低电压电池编号        $    $               $    $  ANS024.BYTE004  $  y=x1+1;
  $  025.模组4最低单节电池电压        $    $  V            $    $  ANS025.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  026.模组4最高电压电池编号        $    $               $    $  ANS026.BYTE004  $  y=x1+1;
  $  027.模组4最高单节电池电压        $    $  V            $    $  ANS027.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  028.模组4最低温度电池号          $    $               $    $  ANS028.BYTE004  $  y=x1+1;
  $  029.模组4最低单节电池温度        $    $  degree C     $    $  ANS029.BYTE004  $  y=x1-40;
  $  030.模组4最高温度电池号          $    $               $    $  ANS030.BYTE004  $  y=x1+1;
  $  031.模组4最高单节电池温度        $    $  degree C     $    $  ANS031.BYTE004  $  y=x1-40;
  $  032.模组5最低电压电池编号        $    $               $    $  ANS032.BYTE004  $  y=x1+1;
  $  033.模组5最低单节电池电压        $    $  V            $    $  ANS033.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  034.模组5最高电压电池编号        $    $               $    $  ANS034.BYTE004  $  y=x1+1;
  $  035.模组5最高单节电池电压        $    $  V            $    $  ANS035.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  036.模组5最低温度电池号          $    $               $    $  ANS036.BYTE004  $  y=x1+1;
  $  037.模组5最低单节电池温度        $    $  degree C     $    $  ANS037.BYTE004  $  y=x1-40;
  $  038.模组5最高温度电池号          $    $               $    $  ANS038.BYTE004  $  y=x1+1;
  $  039.模组5最高单节电池温度        $    $  degree C     $    $  ANS039.BYTE004  $  y=x1-40;
  $  040.模组6最低电压电池编号        $    $               $    $  ANS040.BYTE004  $  y=x1+1;
  $  041.模组6最低单节电池电压        $    $  V            $    $  ANS041.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  042.模组6最高电压电池编号        $    $               $    $  ANS042.BYTE004  $  y=x1+1;
  $  043.模组6最高单节电池电压        $    $  V            $    $  ANS043.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  044.模组6最低温度电池号          $    $               $    $  ANS044.BYTE004  $  y=x1+1;
  $  045.模组6最低单节电池温度        $    $  degree C     $    $  ANS045.BYTE004  $  y=x1-40;
  $  046.模组6最高温度电池号          $    $               $    $  ANS046.BYTE004  $  y=x1+1;
  $  047.模组6最高单节电池温度        $    $  degree C     $    $  ANS047.BYTE004  $  y=x1-40;
  $  048.模组7最低电压电池编号        $    $               $    $  ANS048.BYTE004  $  y=x1+1;
  $  049.模组7最低单节电池电压        $    $  V            $    $  ANS049.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  050.模组7最高电压电池编号        $    $               $    $  ANS050.BYTE004  $  y=x1+1;
  $  051.模组7最高单节电池电压        $    $  V            $    $  ANS051.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  052.模组7最低温度电池号          $    $               $    $  ANS052.BYTE004  $  y=x1+1;
  $  053.模组7最低单节电池温度        $    $  degree C     $    $  ANS053.BYTE004  $  y=x1-40;
  $  054.模组7最高温度电池号          $    $               $    $  ANS054.BYTE004  $  y=x1+1;
  $  055.模组7最高单节电池温度        $    $  degree C     $    $  ANS055.BYTE004  $  y=x1-40;
  $  056.模组8最低电压电池编号        $    $               $    $  ANS056.BYTE004  $  y=x1+1;
  $  057.模组8最低单节电池电压        $    $  V            $    $  ANS057.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  058.模组8最高电压电池编号        $    $               $    $  ANS058.BYTE004  $  y=x1+1;
  $  059.模组8最高单节电池电压        $    $  V            $    $  ANS059.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  060.模组8最低温度电池号          $    $               $    $  ANS060.BYTE004  $  y=x1+1;
  $  061.模组8最低单节电池温度        $    $  degree C     $    $  ANS061.BYTE004  $  y=x1-40;
  $  062.模组8最高温度电池号          $    $               $    $  ANS062.BYTE004  $  y=x1+1;
  $  063.模组8最高单节电池温度        $    $  degree C     $    $  ANS063.BYTE004  $  y=x1-40;
  $  064.模组9最低电压电池编号        $    $               $    $  ANS064.BYTE004  $  y=x1+1;
  $  065.模组9最低单节电池电压        $    $  V            $    $  ANS065.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  066.模组9最高电压电池编号        $    $               $    $  ANS066.BYTE004  $  y=x1+1;
  $  067.模组9最高单节电池电压        $    $  V            $    $  ANS067.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  068.模组9最低温度电池号          $    $               $    $  ANS068.BYTE004  $  y=x1+1;
  $  069.模组9最低单节电池温度        $    $  degree C     $    $  ANS069.BYTE004  $  y=x1-40;
  $  070.模组9最高温度电池号          $    $               $    $  ANS070.BYTE004  $  y=x1+1;
  $  071.模组9最高单节电池温度        $    $  degree C     $    $  ANS071.BYTE004  $  y=x1-40;
  $  072.模组10最低电压电池编号       $    $               $    $  ANS072.BYTE004  $  y=x1+1;
  $  073.模组10最低单节电池电压       $    $  V            $    $  ANS073.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  074.模组10最高电压电池编号       $    $               $    $  ANS074.BYTE004  $  y=x1+1;
  $  075.模组10最高单节电池电压       $    $  V            $    $  ANS075.BYTE004  $  y=3F((x1+x2*256)*0.001);
  $  076.模组10最低温度电池号         $    $               $    $  ANS076.BYTE004  $  y=x1+1;
  $  077.模组10最低单节电池温度       $    $  degree C     $    $  ANS077.BYTE004  $  y=x1-40;
  $  078.模组10最高温度电池号         $    $               $    $  ANS078.BYTE004  $  y=x1+1;
  $  079.模组10最高单节电池温度       $    $  degree C     $    $  ANS079.BYTE004  $  y=x1-40;

  $)  02.均衡电路状态
  $  02.均衡电路状态
  $  REQ000:781 03 22 00 3F 00 00 00 00       $  ANS000:789 03 22 00 3F 00 00 00 00
  $  REQ001:781 03 22 00 40 00 00 00 00       $  ANS001:789 03 22 00 40 00 00 00 00
  $  REQ002:781 03 22 00 41 00 00 00 00       $  ANS002:789 03 22 00 41 00 00 00 00
  $  REQ003:781 03 22 00 42 00 00 00 00       $  ANS003:789 03 22 00 42 00 00 00 00
  $  REQ004:781 03 22 00 43 00 00 00 00       $  ANS004:789 03 22 00 43 00 00 00 00

  $  000.1号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  001.2号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  002.3号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  003.4号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  004.5号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  005.6号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  006.7号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  007.8号电池均衡电路状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  008.9号电池均衡电路状态         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  009.10号电池均衡电路状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  010.11号电池均衡电路状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  011.12号电池均衡电路状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  012.13号电池均衡电路状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  013.14号电池均衡电路状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  014.15号电池均衡电路状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  015.16号电池均衡电路状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  016.17号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  017.18号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  018.19号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  019.20号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  020.21号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  021.22号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  022.23号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  023.24号电池均衡电路状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  024.25号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  025.26号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  026.27号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  027.28号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  028.29号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  029.30号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  030.31号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  031.32号电池均衡电路状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  032.33号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  033.34号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  034.35号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  035.36号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  036.37号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  037.38号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  038.39号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  039.40号电池均衡电路状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  040.41号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  041.42号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  042.43号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  043.44号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  044.45号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  045.46号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  046.47号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  047.48号电池均衡电路状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  048.49号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  049.50号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  050.51号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  051.52号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  052.53号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  053.54号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  054.55号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  055.56号电池均衡电路状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  056.57号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  057.58号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  058.59号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  059.60号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  060.61号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  061.62号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  062.63号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  063.64号电池均衡电路状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  064.65号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  065.66号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  066.67号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  067.68号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  068.69号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  069.70号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  070.71号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  071.72号电池均衡电路状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  072.73号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  073.74号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  074.75号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  075.76号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  076.77号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  077.78号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  078.79号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  079.80号电池均衡电路状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  080.81号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  081.82号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  082.83号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  083.84号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  084.85号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  085.86号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  086.87号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  087.88号电池均衡电路状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  088.89号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  089.90号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  090.91号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  091.92号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  092.93号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  093.94号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  094.95号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  095.96号电池均衡电路状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  096.97号电池均衡电路状态        $    $       $    $  ANS003.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  097.98号电池均衡电路状态        $    $       $    $  ANS003.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  098.99号电池均衡电路状态        $    $       $    $  ANS003.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  099.100号电池均衡电路状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  100.101号电池均衡电路状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  101.102号电池均衡电路状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  102.103号电池均衡电路状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  103.104号电池均衡电路状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  104.105号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  105.106号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  106.107号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  107.108号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  108.109号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  109.110号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  110.111号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  111.112号电池均衡电路状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  112.113号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  113.114号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  114.115号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  115.116号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  116.117号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  117.118号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  118.119号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  119.120号电池均衡电路状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  120.121号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  121.122号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  122.123号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  123.124号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  124.125号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  125.126号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  126.127号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  127.128号电池均衡电路状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  128.129号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  129.130号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  130.131号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  131.132号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  132.133号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  133.134号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  134.135号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  135.136号电池均衡电路状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  136.137号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  137.138号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  138.139号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  139.140号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  140.141号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  141.142号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  142.143号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  143.144号电池均衡电路状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  144.145号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  145.146号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  146.147号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  147.148号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  148.149号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  149.150号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  150.151号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  151.152号电池均衡电路状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;

  $)  03.均衡状态
  $  03.均衡状态
  $  REQ000:781 03 22 00 44 00 00 00 00       $  ANS000:789 03 22 00 44 00 00 00 00
  $  REQ001:781 03 22 00 45 00 00 00 00       $  ANS001:789 03 22 00 45 00 00 00 00
  $  REQ002:781 03 22 00 46 00 00 00 00       $  ANS002:789 03 22 00 46 00 00 00 00
  $  REQ003:781 03 22 00 47 00 00 00 00       $  ANS003:789 03 22 00 47 00 00 00 00
  $  REQ004:781 03 22 00 48 00 00 00 00       $  ANS004:789 03 22 00 48 00 00 00 00

  $  000.1号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  001.2号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  002.3号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  003.4号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  004.5号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  005.6号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  006.7号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  007.8号电池均衡状态         $    $       $    $  ANS000.BYTE004  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  008.9号电池均衡状态         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  009.10号电池均衡状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  010.11号电池均衡状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  011.12号电池均衡状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  012.13号电池均衡状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  013.14号电池均衡状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  014.15号电池均衡状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  015.16号电池均衡状态        $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  016.17号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  017.18号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  018.19号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  019.20号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  020.21号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  021.22号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  022.23号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  023.24号电池均衡状态        $    $       $    $  ANS000.BYTE006  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  024.25号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  025.26号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  026.27号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  027.28号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  028.29号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  029.30号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  030.31号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  031.32号电池均衡状态        $    $       $    $  ANS000.BYTE007  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  032.33号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  033.34号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  034.35号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  035.36号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  036.37号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  037.38号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  038.39号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  039.40号电池均衡状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  040.41号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  041.42号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  042.43号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  043.44号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  044.45号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  045.46号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  046.47号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  047.48号电池均衡状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  048.49号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  049.50号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  050.51号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  051.52号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  052.53号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  053.54号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  054.55号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  055.56号电池均衡状态        $    $       $    $  ANS001.BYTE006  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  056.57号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  057.58号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  058.59号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  059.60号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  060.61号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  061.62号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  062.63号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  063.64号电池均衡状态        $    $       $    $  ANS001.BYTE007  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  064.65号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  065.66号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  066.67号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  067.68号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  068.69号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  069.70号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  070.71号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  071.72号电池均衡状态        $    $       $    $  ANS002.BYTE004  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  072.73号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  073.74号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  074.75号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  075.76号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  076.77号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  077.78号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  078.79号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  079.80号电池均衡状态        $    $       $    $  ANS002.BYTE005  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  080.81号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  081.82号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  082.83号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  083.84号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  084.85号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  085.86号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  086.87号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  087.88号电池均衡状态        $    $       $    $  ANS002.BYTE006  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  088.89号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  089.90号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  090.91号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  091.92号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  092.93号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  093.94号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  094.95号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  095.96号电池均衡状态        $    $       $    $  ANS002.BYTE007  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  096.97号电池均衡状态        $    $       $    $  ANS003.BYTE004  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  097.98号电池均衡状态        $    $       $    $  ANS003.BYTE004  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  098.99号电池均衡状态        $    $       $    $  ANS003.BYTE004  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  099.100号电池均衡状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  100.101号电池均衡状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  101.102号电池均衡状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  102.103号电池均衡状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  103.104号电池均衡状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  104.105号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  105.106号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  106.107号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  107.108号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  108.109号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  109.110号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  110.111号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  111.112号电池均衡状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  112.113号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  113.114号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  114.115号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  115.116号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  116.117号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  117.118号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  118.119号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  119.120号电池均衡状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  120.121号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  121.122号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  122.123号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  123.124号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  124.125号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  125.126号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  126.127号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  127.128号电池均衡状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  128.129号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  129.130号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  130.131号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  131.132号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  132.133号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  133.134号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  134.135号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  135.136号电池均衡状态       $    $       $    $  ANS004.BYTE004  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  136.137号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  137.138号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  138.139号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  139.140号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  140.141号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  141.142号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  142.143号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  143.144号电池均衡状态       $    $       $    $  ANS004.BYTE005  $  if(x1&0x80)y=@00d9;else y=@001e;
  $  144.145号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x01)y=@00d9;else y=@001e;
  $  145.146号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x02)y=@00d9;else y=@001e;
  $  146.147号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x04)y=@00d9;else y=@001e;
  $  147.148号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x08)y=@00d9;else y=@001e;
  $  148.149号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x10)y=@00d9;else y=@001e;
  $  149.150号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x20)y=@00d9;else y=@001e;
  $  150.151号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x40)y=@00d9;else y=@001e;
  $  151.152号电池均衡状态       $    $       $    $  ANS004.BYTE006  $  if(x1&0x80)y=@00d9;else y=@001e;

  $)  04.均衡累计时间
  $  04.均衡累计时间
  $  REQ000:781 03 22 00 49 00 00 00 00       $  ANS000:789 03 22 00 49 00 00 00 00
  $  REQ001:781 03 22 00 4A 00 00 00 00       $  ANS001:789 03 22 00 4A 00 00 00 00
  $  REQ002:781 03 22 00 4B 00 00 00 00       $  ANS002:789 03 22 00 4B 00 00 00 00
  $  REQ003:781 03 22 00 4C 00 00 00 00       $  ANS003:789 03 22 00 4C 00 00 00 00
  $  REQ004:781 03 22 00 4D 00 00 00 00       $  ANS004:789 03 22 00 4D 00 00 00 00
  $  REQ005:781 03 22 00 4E 00 00 00 00       $  ANS005:789 03 22 00 4E 00 00 00 00
  $  REQ006:781 03 22 00 4F 00 00 00 00       $  ANS006:789 03 22 00 4F 00 00 00 00
  $  REQ007:781 03 22 00 50 00 00 00 00       $  ANS007:789 03 22 00 50 00 00 00 00
  $  REQ008:781 03 22 00 51 00 00 00 00       $  ANS008:789 03 22 00 51 00 00 00 00
  $  REQ009:781 03 22 00 52 00 00 00 00       $  ANS009:789 03 22 00 52 00 00 00 00
  $  REQ010:781 03 22 00 53 00 00 00 00       $  ANS010:789 03 22 00 53 00 00 00 00
  $  REQ011:781 03 22 00 54 00 00 00 00       $  ANS011:789 03 22 00 54 00 00 00 00
  $  REQ012:781 03 22 00 55 00 00 00 00       $  ANS012:789 03 22 00 55 00 00 00 00
  $  REQ013:781 03 22 00 56 00 00 00 00       $  ANS013:789 03 22 00 56 00 00 00 00
  $  REQ014:781 03 22 00 57 00 00 00 00       $  ANS014:789 03 22 00 57 00 00 00 00
  $  REQ015:781 03 22 00 58 00 00 00 00       $  ANS015:789 03 22 00 58 00 00 00 00
  $  REQ016:781 03 22 00 59 00 00 00 00       $  ANS016:789 03 22 00 59 00 00 00 00
  $  REQ017:781 03 22 00 5A 00 00 00 00       $  ANS017:789 03 22 00 5A 00 00 00 00
  $  REQ018:781 03 22 00 5B 00 00 00 00       $  ANS018:789 03 22 00 5B 00 00 00 00
  $  REQ019:781 03 22 00 5C 00 00 00 00       $  ANS019:789 03 22 00 5C 00 00 00 00
  $  REQ020:781 03 22 00 5D 00 00 00 00       $  ANS020:789 03 22 00 5D 00 00 00 00
  $  REQ021:781 03 22 00 5E 00 00 00 00       $  ANS021:789 03 22 00 5E 00 00 00 00
  $  REQ022:781 03 22 00 5F 00 00 00 00       $  ANS022:789 03 22 00 5F 00 00 00 00
  $  REQ023:781 03 22 00 60 00 00 00 00       $  ANS023:789 03 22 00 60 00 00 00 00
  $  REQ024:781 03 22 00 61 00 00 00 00       $  ANS024:789 03 22 00 61 00 00 00 00
  $  REQ025:781 03 22 00 62 00 00 00 00       $  ANS025:789 03 22 00 62 00 00 00 00
  $  REQ026:781 03 22 00 63 00 00 00 00       $  ANS026:789 03 22 00 63 00 00 00 00
  $  REQ027:781 03 22 00 64 00 00 00 00       $  ANS027:789 03 22 00 64 00 00 00 00
  $  REQ028:781 03 22 00 65 00 00 00 00       $  ANS028:789 03 22 00 65 00 00 00 00
  $  REQ029:781 03 22 00 66 00 00 00 00       $  ANS029:789 03 22 00 66 00 00 00 00
  $  REQ030:781 03 22 00 67 00 00 00 00       $  ANS030:789 03 22 00 67 00 00 00 00
  $  REQ031:781 03 22 00 68 00 00 00 00       $  ANS031:789 03 22 00 68 00 00 00 00
  $  REQ032:781 03 22 00 69 00 00 00 00       $  ANS032:789 03 22 00 69 00 00 00 00
  $  REQ033:781 03 22 00 6A 00 00 00 00       $  ANS033:789 03 22 00 6A 00 00 00 00
  $  REQ034:781 03 22 00 6B 00 00 00 00       $  ANS034:789 03 22 00 6B 00 00 00 00
  $  REQ035:781 03 22 00 6C 00 00 00 00       $  ANS035:789 03 22 00 6C 00 00 00 00
  $  REQ036:781 03 22 00 6D 00 00 00 00       $  ANS036:789 03 22 00 6D 00 00 00 00
  $  REQ037:781 03 22 00 6E 00 00 00 00       $  ANS037:789 03 22 00 6E 00 00 00 00
  $  REQ038:781 03 22 00 6F 00 00 00 00       $  ANS038:789 03 22 00 6F 00 00 00 00
  $  REQ039:781 03 22 00 70 00 00 00 00       $  ANS039:789 03 22 00 70 00 00 00 00
  $  REQ040:781 03 22 00 71 00 00 00 00       $  ANS040:789 03 22 00 71 00 00 00 00
  $  REQ041:781 03 22 00 72 00 00 00 00       $  ANS041:789 03 22 00 72 00 00 00 00
  $  REQ042:781 03 22 00 73 00 00 00 00       $  ANS042:789 03 22 00 73 00 00 00 00
  $  REQ043:781 03 22 00 74 00 00 00 00       $  ANS043:789 03 22 00 74 00 00 00 00
  $  REQ044:781 03 22 00 75 00 00 00 00       $  ANS044:789 03 22 00 75 00 00 00 00
  $  REQ045:781 03 22 00 76 00 00 00 00       $  ANS045:789 03 22 00 76 00 00 00 00
  $  REQ046:781 03 22 00 77 00 00 00 00       $  ANS046:789 03 22 00 77 00 00 00 00
  $  REQ047:781 03 22 00 78 00 00 00 00       $  ANS047:789 03 22 00 78 00 00 00 00
  $  REQ048:781 03 22 00 79 00 00 00 00       $  ANS048:789 03 22 00 79 00 00 00 00
  $  REQ049:781 03 22 00 7A 00 00 00 00       $  ANS049:789 03 22 00 7A 00 00 00 00
  $  REQ050:781 03 22 00 7B 00 00 00 00       $  ANS050:789 03 22 00 7B 00 00 00 00
  $  REQ051:781 03 22 00 7C 00 00 00 00       $  ANS051:789 03 22 00 7C 00 00 00 00
  $  REQ052:781 03 22 00 7D 00 00 00 00       $  ANS052:789 03 22 00 7D 00 00 00 00
  $  REQ053:781 03 22 00 7E 00 00 00 00       $  ANS053:789 03 22 00 7E 00 00 00 00
  $  REQ054:781 03 22 00 7F 00 00 00 00       $  ANS054:789 03 22 00 7F 00 00 00 00
  $  REQ055:781 03 22 00 80 00 00 00 00       $  ANS055:789 03 22 00 80 00 00 00 00
  $  REQ056:781 03 22 00 81 00 00 00 00       $  ANS056:789 03 22 00 81 00 00 00 00
  $  REQ057:781 03 22 00 82 00 00 00 00       $  ANS057:789 03 22 00 82 00 00 00 00
  $  REQ058:781 03 22 00 83 00 00 00 00       $  ANS058:789 03 22 00 83 00 00 00 00
  $  REQ059:781 03 22 00 84 00 00 00 00       $  ANS059:789 03 22 00 84 00 00 00 00
  $  REQ060:781 03 22 00 85 00 00 00 00       $  ANS060:789 03 22 00 85 00 00 00 00
  $  REQ061:781 03 22 00 86 00 00 00 00       $  ANS061:789 03 22 00 86 00 00 00 00
  $  REQ062:781 03 22 00 87 00 00 00 00       $  ANS062:789 03 22 00 87 00 00 00 00
  $  REQ063:781 03 22 00 88 00 00 00 00       $  ANS063:789 03 22 00 88 00 00 00 00
  $  REQ064:781 03 22 00 89 00 00 00 00       $  ANS064:789 03 22 00 89 00 00 00 00
  $  REQ065:781 03 22 00 8A 00 00 00 00       $  ANS065:789 03 22 00 8A 00 00 00 00
  $  REQ066:781 03 22 00 8B 00 00 00 00       $  ANS066:789 03 22 00 8B 00 00 00 00
  $  REQ067:781 03 22 00 8C 00 00 00 00       $  ANS067:789 03 22 00 8C 00 00 00 00
  $  REQ068:781 03 22 00 8D 00 00 00 00       $  ANS068:789 03 22 00 8D 00 00 00 00
  $  REQ069:781 03 22 00 8E 00 00 00 00       $  ANS069:789 03 22 00 8E 00 00 00 00
  $  REQ070:781 03 22 00 8F 00 00 00 00       $  ANS070:789 03 22 00 8F 00 00 00 00
  $  REQ071:781 03 22 00 90 00 00 00 00       $  ANS071:789 03 22 00 90 00 00 00 00
  $  REQ072:781 03 22 00 91 00 00 00 00       $  ANS072:789 03 22 00 91 00 00 00 00
  $  REQ073:781 03 22 00 92 00 00 00 00       $  ANS073:789 03 22 00 92 00 00 00 00
  $  REQ074:781 03 22 00 93 00 00 00 00       $  ANS074:789 03 22 00 93 00 00 00 00
  $  REQ075:781 03 22 00 94 00 00 00 00       $  ANS075:789 03 22 00 94 00 00 00 00
  $  REQ076:781 03 22 00 95 00 00 00 00       $  ANS076:789 03 22 00 95 00 00 00 00
  $  REQ077:781 03 22 00 96 00 00 00 00       $  ANS077:789 03 22 00 96 00 00 00 00
  $  REQ078:781 03 22 00 97 00 00 00 00       $  ANS078:789 03 22 00 97 00 00 00 00
  $  REQ079:781 03 22 00 98 00 00 00 00       $  ANS079:789 03 22 00 98 00 00 00 00
  $  REQ080:781 03 22 00 99 00 00 00 00       $  ANS080:789 03 22 00 99 00 00 00 00
  $  REQ081:781 03 22 00 9A 00 00 00 00       $  ANS081:789 03 22 00 9A 00 00 00 00
  $  REQ082:781 03 22 00 9B 00 00 00 00       $  ANS082:789 03 22 00 9B 00 00 00 00
  $  REQ083:781 03 22 00 9C 00 00 00 00       $  ANS083:789 03 22 00 9C 00 00 00 00
  $  REQ084:781 03 22 00 9D 00 00 00 00       $  ANS084:789 03 22 00 9D 00 00 00 00
  $  REQ085:781 03 22 00 9E 00 00 00 00       $  ANS085:789 03 22 00 9E 00 00 00 00
  $  REQ086:781 03 22 00 9F 00 00 00 00       $  ANS086:789 03 22 00 9F 00 00 00 00
  $  REQ087:781 03 22 00 A0 00 00 00 00       $  ANS087:789 03 22 00 A0 00 00 00 00
  $  REQ088:781 03 22 00 A1 00 00 00 00       $  ANS088:789 03 22 00 A1 00 00 00 00
  $  REQ089:781 03 22 00 A2 00 00 00 00       $  ANS089:789 03 22 00 A2 00 00 00 00
  $  REQ090:781 03 22 00 A3 00 00 00 00       $  ANS090:789 03 22 00 A3 00 00 00 00
  $  REQ091:781 03 22 00 A4 00 00 00 00       $  ANS091:789 03 22 00 A4 00 00 00 00
  $  REQ092:781 03 22 00 A5 00 00 00 00       $  ANS092:789 03 22 00 A5 00 00 00 00
  $  REQ093:781 03 22 00 A6 00 00 00 00       $  ANS093:789 03 22 00 A6 00 00 00 00
  $  REQ094:781 03 22 00 A7 00 00 00 00       $  ANS094:789 03 22 00 A7 00 00 00 00
  $  REQ095:781 03 22 00 A8 00 00 00 00       $  ANS095:789 03 22 00 A8 00 00 00 00
  $  REQ096:781 03 22 00 A9 00 00 00 00       $  ANS096:789 03 22 00 A9 00 00 00 00
  $  REQ097:781 03 22 00 AA 00 00 00 00       $  ANS097:789 03 22 00 AA 00 00 00 00
  $  REQ098:781 03 22 00 AB 00 00 00 00       $  ANS098:789 03 22 00 AB 00 00 00 00
  $  REQ099:781 03 22 00 AC 00 00 00 00       $  ANS099:789 03 22 00 AC 00 00 00 00
  $  REQ100:781 03 22 00 AD 00 00 00 00       $  ANS100:789 03 22 00 AD 00 00 00 00
  $  REQ101:781 03 22 00 AE 00 00 00 00       $  ANS101:789 03 22 00 AE 00 00 00 00
  $  REQ102:781 03 22 00 AF 00 00 00 00       $  ANS102:789 03 22 00 AF 00 00 00 00
  $  REQ103:781 03 22 00 B0 00 00 00 00       $  ANS103:789 03 22 00 B0 00 00 00 00
  $  REQ104:781 03 22 00 B1 00 00 00 00       $  ANS104:789 03 22 00 B1 00 00 00 00
  $  REQ105:781 03 22 00 B2 00 00 00 00       $  ANS105:789 03 22 00 B2 00 00 00 00
  $  REQ106:781 03 22 00 B3 00 00 00 00       $  ANS106:789 03 22 00 B3 00 00 00 00
  $  REQ107:781 03 22 00 B4 00 00 00 00       $  ANS107:789 03 22 00 B4 00 00 00 00
  $  REQ108:781 03 22 00 B5 00 00 00 00       $  ANS108:789 03 22 00 B5 00 00 00 00
  $  REQ109:781 03 22 00 B6 00 00 00 00       $  ANS109:789 03 22 00 B6 00 00 00 00
  $  REQ110:781 03 22 00 B7 00 00 00 00       $  ANS110:789 03 22 00 B7 00 00 00 00
  $  REQ111:781 03 22 00 B8 00 00 00 00       $  ANS111:789 03 22 00 B8 00 00 00 00
  $  REQ112:781 03 22 00 B9 00 00 00 00       $  ANS112:789 03 22 00 B9 00 00 00 00
  $  REQ113:781 03 22 00 BA 00 00 00 00       $  ANS113:789 03 22 00 BA 00 00 00 00
  $  REQ114:781 03 22 00 BB 00 00 00 00       $  ANS114:789 03 22 00 BB 00 00 00 00
  $  REQ115:781 03 22 00 BC 00 00 00 00       $  ANS115:789 03 22 00 BC 00 00 00 00
  $  REQ116:781 03 22 00 BD 00 00 00 00       $  ANS116:789 03 22 00 BD 00 00 00 00
  $  REQ117:781 03 22 00 BE 00 00 00 00       $  ANS117:789 03 22 00 BE 00 00 00 00
  $  REQ118:781 03 22 00 BF 00 00 00 00       $  ANS118:789 03 22 00 BF 00 00 00 00
  $  REQ119:781 03 22 00 C0 00 00 00 00       $  ANS119:789 03 22 00 C0 00 00 00 00
  $  REQ120:781 03 22 00 C1 00 00 00 00       $  ANS120:789 03 22 00 C1 00 00 00 00
  $  REQ121:781 03 22 00 C2 00 00 00 00       $  ANS121:789 03 22 00 C2 00 00 00 00
  $  REQ122:781 03 22 00 C3 00 00 00 00       $  ANS122:789 03 22 00 C3 00 00 00 00
  $  REQ123:781 03 22 00 C4 00 00 00 00       $  ANS123:789 03 22 00 C4 00 00 00 00
  $  REQ124:781 03 22 00 C5 00 00 00 00       $  ANS124:789 03 22 00 C5 00 00 00 00
  $  REQ125:781 03 22 00 C6 00 00 00 00       $  ANS125:789 03 22 00 C6 00 00 00 00
  $  REQ126:781 03 22 00 C7 00 00 00 00       $  ANS126:789 03 22 00 C7 00 00 00 00
  $  REQ127:781 03 22 00 C8 00 00 00 00       $  ANS127:789 03 22 00 C8 00 00 00 00
  $  REQ128:781 03 22 00 C9 00 00 00 00       $  ANS128:789 03 22 00 C9 00 00 00 00
  $  REQ129:781 03 22 00 CA 00 00 00 00       $  ANS129:789 03 22 00 CA 00 00 00 00
  $  REQ130:781 03 22 00 CB 00 00 00 00       $  ANS130:789 03 22 00 CB 00 00 00 00
  $  REQ131:781 03 22 00 CC 00 00 00 00       $  ANS131:789 03 22 00 CC 00 00 00 00
  $  REQ132:781 03 22 00 CD 00 00 00 00       $  ANS132:789 03 22 00 CD 00 00 00 00
  $  REQ133:781 03 22 00 CE 00 00 00 00       $  ANS133:789 03 22 00 CE 00 00 00 00
  $  REQ134:781 03 22 00 CF 00 00 00 00       $  ANS134:789 03 22 00 CF 00 00 00 00
  $  REQ135:781 03 22 00 D0 00 00 00 00       $  ANS135:789 03 22 00 D0 00 00 00 00
  $  REQ136:781 03 22 00 D1 00 00 00 00       $  ANS136:789 03 22 00 D1 00 00 00 00
  $  REQ137:781 03 22 00 D2 00 00 00 00       $  ANS137:789 03 22 00 D2 00 00 00 00
  $  REQ138:781 03 22 00 D3 00 00 00 00       $  ANS138:789 03 22 00 D3 00 00 00 00
  $  REQ139:781 03 22 00 D4 00 00 00 00       $  ANS139:789 03 22 00 D4 00 00 00 00
  $  REQ140:781 03 22 00 D5 00 00 00 00       $  ANS140:789 03 22 00 D5 00 00 00 00
  $  REQ141:781 03 22 00 D6 00 00 00 00       $  ANS141:789 03 22 00 D6 00 00 00 00
  $  REQ142:781 03 22 00 D7 00 00 00 00       $  ANS142:789 03 22 00 D7 00 00 00 00
  $  REQ143:781 03 22 00 D8 00 00 00 00       $  ANS143:789 03 22 00 D8 00 00 00 00
  $  REQ144:781 03 22 00 D9 00 00 00 00       $  ANS144:789 03 22 00 D9 00 00 00 00
  $  REQ145:781 03 22 00 DA 00 00 00 00       $  ANS145:789 03 22 00 DA 00 00 00 00
  $  REQ146:781 03 22 00 DB 00 00 00 00       $  ANS146:789 03 22 00 DB 00 00 00 00
  $  REQ147:781 03 22 00 DC 00 00 00 00       $  ANS147:789 03 22 00 DC 00 00 00 00
  $  REQ148:781 03 22 00 DD 00 00 00 00       $  ANS148:789 03 22 00 DD 00 00 00 00
  $  REQ149:781 03 22 00 DE 00 00 00 00       $  ANS149:789 03 22 00 DE 00 00 00 00
  $  REQ150:781 03 22 00 DF 00 00 00 00       $  ANS150:789 03 22 00 DF 00 00 00 00
  $  REQ151:781 03 22 00 E0 00 00 00 00       $  ANS151:789 03 22 00 E0 00 00 00 00

  $  000.第1节电池均衡累计时间         $    $  小时     $    $  ANS000.BYTE004  $  y=x1+x2*256;
  $  001.第2节电池均衡累计时间         $    $  小时     $    $  ANS001.BYTE004  $  y=x1+x2*256;
  $  002.第3节电池均衡累计时间         $    $  小时     $    $  ANS002.BYTE004  $  y=x1+x2*256;
  $  003.第4节电池均衡累计时间         $    $  小时     $    $  ANS003.BYTE004  $  y=x1+x2*256;
  $  004.第5节电池均衡累计时间         $    $  小时     $    $  ANS004.BYTE004  $  y=x1+x2*256;
  $  005.第6节电池均衡累计时间         $    $  小时     $    $  ANS005.BYTE004  $  y=x1+x2*256;
  $  006.第7节电池均衡累计时间         $    $  小时     $    $  ANS006.BYTE004  $  y=x1+x2*256;
  $  007.第8节电池均衡累计时间         $    $  小时     $    $  ANS007.BYTE004  $  y=x1+x2*256;
  $  008.第9节电池均衡累计时间         $    $  小时     $    $  ANS008.BYTE004  $  y=x1+x2*256;
  $  009.第10节电池均衡累计时间        $    $  小时     $    $  ANS009.BYTE004  $  y=x1+x2*256;
  $  010.第11节电池均衡累计时间        $    $  小时     $    $  ANS010.BYTE004  $  y=x1+x2*256;
  $  011.第12节电池均衡累计时间        $    $  小时     $    $  ANS011.BYTE004  $  y=x1+x2*256;
  $  012.第13节电池均衡累计时间        $    $  小时     $    $  ANS012.BYTE004  $  y=x1+x2*256;
  $  013.第14节电池均衡累计时间        $    $  小时     $    $  ANS013.BYTE004  $  y=x1+x2*256;
  $  014.第15节电池均衡累计时间        $    $  小时     $    $  ANS014.BYTE004  $  y=x1+x2*256;
  $  015.第16节电池均衡累计时间        $    $  小时     $    $  ANS015.BYTE004  $  y=x1+x2*256;
  $  016.第17节电池均衡累计时间        $    $  小时     $    $  ANS016.BYTE004  $  y=x1+x2*256;
  $  017.第18节电池均衡累计时间        $    $  小时     $    $  ANS017.BYTE004  $  y=x1+x2*256;
  $  018.第19节电池均衡累计时间        $    $  小时     $    $  ANS018.BYTE004  $  y=x1+x2*256;
  $  019.第20节电池均衡累计时间        $    $  小时     $    $  ANS019.BYTE004  $  y=x1+x2*256;
  $  020.第21节电池均衡累计时间        $    $  小时     $    $  ANS020.BYTE004  $  y=x1+x2*256;
  $  021.第22节电池均衡累计时间        $    $  小时     $    $  ANS021.BYTE004  $  y=x1+x2*256;
  $  022.第23节电池均衡累计时间        $    $  小时     $    $  ANS022.BYTE004  $  y=x1+x2*256;
  $  023.第24节电池均衡累计时间        $    $  小时     $    $  ANS023.BYTE004  $  y=x1+x2*256;
  $  024.第25节电池均衡累计时间        $    $  小时     $    $  ANS024.BYTE004  $  y=x1+x2*256;
  $  025.第26节电池均衡累计时间        $    $  小时     $    $  ANS025.BYTE004  $  y=x1+x2*256;
  $  026.第27节电池均衡累计时间        $    $  小时     $    $  ANS026.BYTE004  $  y=x1+x2*256;
  $  027.第28节电池均衡累计时间        $    $  小时     $    $  ANS027.BYTE004  $  y=x1+x2*256;
  $  028.第29节电池均衡累计时间        $    $  小时     $    $  ANS028.BYTE004  $  y=x1+x2*256;
  $  029.第30节电池均衡累计时间        $    $  小时     $    $  ANS029.BYTE004  $  y=x1+x2*256;
  $  030.第31节电池均衡累计时间        $    $  小时     $    $  ANS030.BYTE004  $  y=x1+x2*256;
  $  031.第32节电池均衡累计时间        $    $  小时     $    $  ANS031.BYTE004  $  y=x1+x2*256;
  $  032.第33节电池均衡累计时间        $    $  小时     $    $  ANS032.BYTE004  $  y=x1+x2*256;
  $  033.第34节电池均衡累计时间        $    $  小时     $    $  ANS033.BYTE004  $  y=x1+x2*256;
  $  034.第35节电池均衡累计时间        $    $  小时     $    $  ANS034.BYTE004  $  y=x1+x2*256;
  $  035.第36节电池均衡累计时间        $    $  小时     $    $  ANS035.BYTE004  $  y=x1+x2*256;
  $  036.第37节电池均衡累计时间        $    $  小时     $    $  ANS036.BYTE004  $  y=x1+x2*256;
  $  037.第38节电池均衡累计时间        $    $  小时     $    $  ANS037.BYTE004  $  y=x1+x2*256;
  $  038.第39节电池均衡累计时间        $    $  小时     $    $  ANS038.BYTE004  $  y=x1+x2*256;
  $  039.第40节电池均衡累计时间        $    $  小时     $    $  ANS039.BYTE004  $  y=x1+x2*256;
  $  040.第41节电池均衡累计时间        $    $  小时     $    $  ANS040.BYTE004  $  y=x1+x2*256;
  $  041.第42节电池均衡累计时间        $    $  小时     $    $  ANS041.BYTE004  $  y=x1+x2*256;
  $  042.第43节电池均衡累计时间        $    $  小时     $    $  ANS042.BYTE004  $  y=x1+x2*256;
  $  043.第44节电池均衡累计时间        $    $  小时     $    $  ANS043.BYTE004  $  y=x1+x2*256;
  $  044.第45节电池均衡累计时间        $    $  小时     $    $  ANS044.BYTE004  $  y=x1+x2*256;
  $  045.第46节电池均衡累计时间        $    $  小时     $    $  ANS045.BYTE004  $  y=x1+x2*256;
  $  046.第47节电池均衡累计时间        $    $  小时     $    $  ANS046.BYTE004  $  y=x1+x2*256;
  $  047.第48节电池均衡累计时间        $    $  小时     $    $  ANS047.BYTE004  $  y=x1+x2*256;
  $  048.第49节电池均衡累计时间        $    $  小时     $    $  ANS048.BYTE004  $  y=x1+x2*256;
  $  049.第50节电池均衡累计时间        $    $  小时     $    $  ANS049.BYTE004  $  y=x1+x2*256;
  $  050.第51节电池均衡累计时间        $    $  小时     $    $  ANS050.BYTE004  $  y=x1+x2*256;
  $  051.第52节电池均衡累计时间        $    $  小时     $    $  ANS051.BYTE004  $  y=x1+x2*256;
  $  052.第53节电池均衡累计时间        $    $  小时     $    $  ANS052.BYTE004  $  y=x1+x2*256;
  $  053.第54节电池均衡累计时间        $    $  小时     $    $  ANS053.BYTE004  $  y=x1+x2*256;
  $  054.第55节电池均衡累计时间        $    $  小时     $    $  ANS054.BYTE004  $  y=x1+x2*256;
  $  055.第56节电池均衡累计时间        $    $  小时     $    $  ANS055.BYTE004  $  y=x1+x2*256;
  $  056.第57节电池均衡累计时间        $    $  小时     $    $  ANS056.BYTE004  $  y=x1+x2*256;
  $  057.第58节电池均衡累计时间        $    $  小时     $    $  ANS057.BYTE004  $  y=x1+x2*256;
  $  058.第59节电池均衡累计时间        $    $  小时     $    $  ANS058.BYTE004  $  y=x1+x2*256;
  $  059.第60节电池均衡累计时间        $    $  小时     $    $  ANS059.BYTE004  $  y=x1+x2*256;
  $  060.第61节电池均衡累计时间        $    $  小时     $    $  ANS060.BYTE004  $  y=x1+x2*256;
  $  061.第62节电池均衡累计时间        $    $  小时     $    $  ANS061.BYTE004  $  y=x1+x2*256;
  $  062.第63节电池均衡累计时间        $    $  小时     $    $  ANS062.BYTE004  $  y=x1+x2*256;
  $  063.第64节电池均衡累计时间        $    $  小时     $    $  ANS063.BYTE004  $  y=x1+x2*256;
  $  064.第65节电池均衡累计时间        $    $  小时     $    $  ANS064.BYTE004  $  y=x1+x2*256;
  $  065.第66节电池均衡累计时间        $    $  小时     $    $  ANS065.BYTE004  $  y=x1+x2*256;
  $  066.第67节电池均衡累计时间        $    $  小时     $    $  ANS066.BYTE004  $  y=x1+x2*256;
  $  067.第68节电池均衡累计时间        $    $  小时     $    $  ANS067.BYTE004  $  y=x1+x2*256;
  $  068.第69节电池均衡累计时间        $    $  小时     $    $  ANS068.BYTE004  $  y=x1+x2*256;
  $  069.第70节电池均衡累计时间        $    $  小时     $    $  ANS069.BYTE004  $  y=x1+x2*256;
  $  070.第71节电池均衡累计时间        $    $  小时     $    $  ANS070.BYTE004  $  y=x1+x2*256;
  $  071.第72节电池均衡累计时间        $    $  小时     $    $  ANS071.BYTE004  $  y=x1+x2*256;
  $  072.第73节电池均衡累计时间        $    $  小时     $    $  ANS072.BYTE004  $  y=x1+x2*256;
  $  073.第74节电池均衡累计时间        $    $  小时     $    $  ANS073.BYTE004  $  y=x1+x2*256;
  $  074.第75节电池均衡累计时间        $    $  小时     $    $  ANS074.BYTE004  $  y=x1+x2*256;
  $  075.第76节电池均衡累计时间        $    $  小时     $    $  ANS075.BYTE004  $  y=x1+x2*256;
  $  076.第77节电池均衡累计时间        $    $  小时     $    $  ANS076.BYTE004  $  y=x1+x2*256;
  $  077.第78节电池均衡累计时间        $    $  小时     $    $  ANS077.BYTE004  $  y=x1+x2*256;
  $  078.第79节电池均衡累计时间        $    $  小时     $    $  ANS078.BYTE004  $  y=x1+x2*256;
  $  079.第80节电池均衡累计时间        $    $  小时     $    $  ANS079.BYTE004  $  y=x1+x2*256;
  $  080.第81节电池均衡累计时间        $    $  小时     $    $  ANS080.BYTE004  $  y=x1+x2*256;
  $  081.第82节电池均衡累计时间        $    $  小时     $    $  ANS081.BYTE004  $  y=x1+x2*256;
  $  082.第83节电池均衡累计时间        $    $  小时     $    $  ANS082.BYTE004  $  y=x1+x2*256;
  $  083.第84节电池均衡累计时间        $    $  小时     $    $  ANS083.BYTE004  $  y=x1+x2*256;
  $  084.第85节电池均衡累计时间        $    $  小时     $    $  ANS084.BYTE004  $  y=x1+x2*256;
  $  085.第86节电池均衡累计时间        $    $  小时     $    $  ANS085.BYTE004  $  y=x1+x2*256;
  $  086.第87节电池均衡累计时间        $    $  小时     $    $  ANS086.BYTE004  $  y=x1+x2*256;
  $  087.第88节电池均衡累计时间        $    $  小时     $    $  ANS087.BYTE004  $  y=x1+x2*256;
  $  088.第89节电池均衡累计时间        $    $  小时     $    $  ANS088.BYTE004  $  y=x1+x2*256;
  $  089.第90节电池均衡累计时间        $    $  小时     $    $  ANS089.BYTE004  $  y=x1+x2*256;
  $  090.第91节电池均衡累计时间        $    $  小时     $    $  ANS090.BYTE004  $  y=x1+x2*256;
  $  091.第92节电池均衡累计时间        $    $  小时     $    $  ANS091.BYTE004  $  y=x1+x2*256;
  $  092.第93节电池均衡累计时间        $    $  小时     $    $  ANS092.BYTE004  $  y=x1+x2*256;
  $  093.第94节电池均衡累计时间        $    $  小时     $    $  ANS093.BYTE004  $  y=x1+x2*256;
  $  094.第95节电池均衡累计时间        $    $  小时     $    $  ANS094.BYTE004  $  y=x1+x2*256;
  $  095.第96节电池均衡累计时间        $    $  小时     $    $  ANS095.BYTE004  $  y=x1+x2*256;
  $  096.第97节电池均衡累计时间        $    $  小时     $    $  ANS096.BYTE004  $  y=x1+x2*256;
  $  097.第98节电池均衡累计时间        $    $  小时     $    $  ANS097.BYTE004  $  y=x1+x2*256;
  $  098.第99节电池均衡累计时间        $    $  小时     $    $  ANS098.BYTE004  $  y=x1+x2*256;
  $  099.第100节电池均衡累计时间       $    $  小时     $    $  ANS099.BYTE004  $  y=x1+x2*256;
  $  100.第101节电池均衡累计时间       $    $  小时     $    $  ANS100.BYTE004  $  y=x1+x2*256;
  $  101.第102节电池均衡累计时间       $    $  小时     $    $  ANS101.BYTE004  $  y=x1+x2*256;
  $  102.第103节电池均衡累计时间       $    $  小时     $    $  ANS102.BYTE004  $  y=x1+x2*256;
  $  103.第104节电池均衡累计时间       $    $  小时     $    $  ANS103.BYTE004  $  y=x1+x2*256;
  $  104.第105节电池均衡累计时间       $    $  小时     $    $  ANS104.BYTE004  $  y=x1+x2*256;
  $  105.第106节电池均衡累计时间       $    $  小时     $    $  ANS105.BYTE004  $  y=x1+x2*256;
  $  106.第107节电池均衡累计时间       $    $  小时     $    $  ANS106.BYTE004  $  y=x1+x2*256;
  $  107.第108节电池均衡累计时间       $    $  小时     $    $  ANS107.BYTE004  $  y=x1+x2*256;
  $  108.第109节电池均衡累计时间       $    $  小时     $    $  ANS108.BYTE004  $  y=x1+x2*256;
  $  109.第110节电池均衡累计时间       $    $  小时     $    $  ANS109.BYTE004  $  y=x1+x2*256;
  $  110.第111节电池均衡累计时间       $    $  小时     $    $  ANS110.BYTE004  $  y=x1+x2*256;
  $  111.第112节电池均衡累计时间       $    $  小时     $    $  ANS111.BYTE004  $  y=x1+x2*256;
  $  112.第113节电池均衡累计时间       $    $  小时     $    $  ANS112.BYTE004  $  y=x1+x2*256;
  $  113.第114节电池均衡累计时间       $    $  小时     $    $  ANS113.BYTE004  $  y=x1+x2*256;
  $  114.第115节电池均衡累计时间       $    $  小时     $    $  ANS114.BYTE004  $  y=x1+x2*256;
  $  115.第116节电池均衡累计时间       $    $  小时     $    $  ANS115.BYTE004  $  y=x1+x2*256;
  $  116.第117节电池均衡累计时间       $    $  小时     $    $  ANS116.BYTE004  $  y=x1+x2*256;
  $  117.第118节电池均衡累计时间       $    $  小时     $    $  ANS117.BYTE004  $  y=x1+x2*256;
  $  118.第119节电池均衡累计时间       $    $  小时     $    $  ANS118.BYTE004  $  y=x1+x2*256;
  $  119.第120节电池均衡累计时间       $    $  小时     $    $  ANS119.BYTE004  $  y=x1+x2*256;
  $  120.第121节电池均衡累计时间       $    $  小时     $    $  ANS120.BYTE004  $  y=x1+x2*256;
  $  121.第122节电池均衡累计时间       $    $  小时     $    $  ANS121.BYTE004  $  y=x1+x2*256;
  $  122.第123节电池均衡累计时间       $    $  小时     $    $  ANS122.BYTE004  $  y=x1+x2*256;
  $  123.第124节电池均衡累计时间       $    $  小时     $    $  ANS123.BYTE004  $  y=x1+x2*256;
  $  124.第125节电池均衡累计时间       $    $  小时     $    $  ANS124.BYTE004  $  y=x1+x2*256;
  $  125.第126节电池均衡累计时间       $    $  小时     $    $  ANS125.BYTE004  $  y=x1+x2*256;
  $  126.第127节电池均衡累计时间       $    $  小时     $    $  ANS126.BYTE004  $  y=x1+x2*256;
  $  127.第128节电池均衡累计时间       $    $  小时     $    $  ANS127.BYTE004  $  y=x1+x2*256;
  $  128.第129节电池均衡累计时间       $    $  小时     $    $  ANS128.BYTE004  $  y=x1+x2*256;
  $  129.第130节电池均衡累计时间       $    $  小时     $    $  ANS129.BYTE004  $  y=x1+x2*256;
  $  130.第131节电池均衡累计时间       $    $  小时     $    $  ANS130.BYTE004  $  y=x1+x2*256;
  $  131.第132节电池均衡累计时间       $    $  小时     $    $  ANS131.BYTE004  $  y=x1+x2*256;
  $  132.第133节电池均衡累计时间       $    $  小时     $    $  ANS132.BYTE004  $  y=x1+x2*256;
  $  133.第134节电池均衡累计时间       $    $  小时     $    $  ANS133.BYTE004  $  y=x1+x2*256;
  $  134.第135节电池均衡累计时间       $    $  小时     $    $  ANS134.BYTE004  $  y=x1+x2*256;
  $  135.第136节电池均衡累计时间       $    $  小时     $    $  ANS135.BYTE004  $  y=x1+x2*256;
  $  136.第137节电池均衡累计时间       $    $  小时     $    $  ANS136.BYTE004  $  y=x1+x2*256;
  $  137.第138节电池均衡累计时间       $    $  小时     $    $  ANS137.BYTE004  $  y=x1+x2*256;
  $  138.第139节电池均衡累计时间       $    $  小时     $    $  ANS138.BYTE004  $  y=x1+x2*256;
  $  139.第140节电池均衡累计时间       $    $  小时     $    $  ANS139.BYTE004  $  y=x1+x2*256;
  $  140.第141节电池均衡累计时间       $    $  小时     $    $  ANS140.BYTE004  $  y=x1+x2*256;
  $  141.第142节电池均衡累计时间       $    $  小时     $    $  ANS141.BYTE004  $  y=x1+x2*256;
  $  142.第143节电池均衡累计时间       $    $  小时     $    $  ANS142.BYTE004  $  y=x1+x2*256;
  $  143.第144节电池均衡累计时间       $    $  小时     $    $  ANS143.BYTE004  $  y=x1+x2*256;
  $  144.第145节电池均衡累计时间       $    $  小时     $    $  ANS144.BYTE004  $  y=x1+x2*256;
  $  145.第146节电池均衡累计时间       $    $  小时     $    $  ANS145.BYTE004  $  y=x1+x2*256;
  $  146.第147节电池均衡累计时间       $    $  小时     $    $  ANS146.BYTE004  $  y=x1+x2*256;
  $  147.第148节电池均衡累计时间       $    $  小时     $    $  ANS147.BYTE004  $  y=x1+x2*256;
  $  148.第149节电池均衡累计时间       $    $  小时     $    $  ANS148.BYTE004  $  y=x1+x2*256;
  $  149.第150节电池均衡累计时间       $    $  小时     $    $  ANS149.BYTE004  $  y=x1+x2*256;
  $  150.第151节电池均衡累计时间       $    $  小时     $    $  ANS150.BYTE004  $  y=x1+x2*256;
  $  151.第152节电池均衡累计时间       $    $  小时     $    $  ANS151.BYTE004  $  y=x1+x2*256;

  $)  05.采样信息
  $  05.采样信息
  $  REQ000:781 03 22 00 37 00 00 00 00       $  ANS000:789 03 22 00 37 00 00 00 00
  $  REQ001:781 03 22 00 38 00 00 00 00       $  ANS001:789 03 22 00 38 00 00 00 00
  $  REQ002:781 03 22 00 39 00 00 00 00       $  ANS002:789 03 22 00 39 00 00 00 00
  $  REQ003:781 03 22 00 3A 00 00 00 00       $  ANS003:789 03 22 00 3A 00 00 00 00
  $  REQ004:781 03 22 00 3B 00 00 00 00       $  ANS004:789 03 22 00 3B 00 00 00 00
  $  REQ005:781 03 22 00 3C 00 00 00 00       $  ANS005:789 03 22 00 3C 00 00 00 00
  $  REQ006:781 03 22 00 3D 00 00 00 00       $  ANS006:789 03 22 00 3D 00 00 00 00
  $  REQ007:781 03 22 00 3E 00 00 00 00       $  ANS007:789 03 22 00 3E 00 00 00 00

  $  000.1号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  001.2号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  002.3号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  003.4号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  004.5号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  005.6号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  006.7号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  007.8号温度采样状态             $    $       $    $  ANS000.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  008.9号温度采样状态             $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  009.10号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  010.11号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  011.12号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  012.13号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  013.14号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  014.15号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  015.16号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  016.17号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  017.18号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  018.19号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  019.20号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  020.21号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  021.22号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  022.23号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  023.24号温度采样状态            $    $       $    $  ANS000.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  024.25号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  025.26号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  026.27号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  027.28号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  028.29号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  029.30号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  030.31号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  031.32号温度采样状态            $    $       $    $  ANS000.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  032.33号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  033.34号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  034.35号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  035.36号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  036.37号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  037.38号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  038.39号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  039.40号温度采样状态            $    $       $    $  ANS001.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  040.41号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  041.42号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  042.43号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  043.44号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  044.45号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  045.46号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  046.47号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  047.48号温度采样状态            $    $       $    $  ANS001.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  048.49号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  049.50号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  050.51号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  051.52号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  052.53号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  053.54号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  054.55号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  055.56号温度采样状态            $    $       $    $  ANS001.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  056.57号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  057.58号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  058.59号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  059.60号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  060.61号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  061.62号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  062.63号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  063.64号温度采样状态            $    $       $    $  ANS001.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  064.65号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  065.66号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  066.67号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  067.68号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  068.69号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  069.70号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  070.71号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  071.72号温度采样状态            $    $       $    $  ANS002.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  072.73号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  073.74号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  074.75号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  075.76号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  076.77号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  077.78号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  078.79号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  079.80号温度采样状态            $    $       $    $  ANS002.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  080.81号温度采样状态            $    $       $    $  ANS002.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  081.82号温度采样状态            $    $       $    $  ANS002.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  082.83号温度采样状态            $    $       $    $  ANS002.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  083.84号温度采样状态            $    $       $    $  ANS002.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  084.85号温度采样状态            $    $       $    $  ANS002.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  085.86号温度采样状态            $    $       $    $  ANS002.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  086.1号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  087.2号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  088.3号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  089.4号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  090.5号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  091.6号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  092.7号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  093.8号电池电压采样状态         $    $       $    $  ANS003.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  094.9号电池电压采样状态         $    $       $    $  ANS003.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  095.10号电池电压采样状态        $    $       $    $  ANS003.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  096.11号电池电压采样状态        $    $       $    $  ANS003.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  097.12号电池电压采样状态        $    $       $    $  ANS003.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  098.13号电池电压采样状态        $    $       $    $  ANS003.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  099.14号电池电压采样状态        $    $       $    $  ANS003.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  100.15号电池电压采样状态        $    $       $    $  ANS003.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  101.16号电池电压采样状态        $    $       $    $  ANS003.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  102.17号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  103.18号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  104.19号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  105.20号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  106.21号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  107.22号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  108.23号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  109.24号电池电压采样状态        $    $       $    $  ANS003.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  110.25号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  111.26号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  112.27号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  113.28号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  114.29号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  115.30号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  116.31号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  117.32号电池电压采样状态        $    $       $    $  ANS003.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  118.33号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  119.34号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  120.35号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  121.36号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  122.37号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  123.38号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  124.39号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  125.40号电池电压采样状态        $    $       $    $  ANS004.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  126.41号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  127.42号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  128.43号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  129.44号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  130.45号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  131.46号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  132.47号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  133.48号电池电压采样状态        $    $       $    $  ANS004.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  134.49号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  135.50号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  136.51号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  137.52号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  138.53号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  139.54号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  140.55号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  141.56号电池电压采样状态        $    $       $    $  ANS004.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  142.57号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  143.58号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  144.59号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  145.60号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  146.61号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  147.62号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  148.63号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  149.64号电池电压采样状态        $    $       $    $  ANS004.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  150.65号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  151.66号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  152.67号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  153.68号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  154.69号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  155.70号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  156.71号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  157.72号电池电压采样状态        $    $       $    $  ANS005.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  158.73号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  159.74号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  160.75号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  161.76号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  162.77号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  163.78号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  164.79号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  165.80号电池电压采样状态        $    $       $    $  ANS005.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  166.81号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  167.82号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  168.83号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  169.84号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  170.85号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  171.86号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  172.87号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  173.88号电池电压采样状态        $    $       $    $  ANS005.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  174.89号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  175.90号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  176.91号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  177.92号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  178.93号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  179.94号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  180.95号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  181.96号电池电压采样状态        $    $       $    $  ANS005.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  182.97号电池电压采样状态        $    $       $    $  ANS006.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  183.98号电池电压采样状态        $    $       $    $  ANS006.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  184.99号电池电压采样状态        $    $       $    $  ANS006.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  185.100号电池电压采样状态       $    $       $    $  ANS006.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  186.101号电池电压采样状态       $    $       $    $  ANS006.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  187.102号电池电压采样状态       $    $       $    $  ANS006.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  188.103号电池电压采样状态       $    $       $    $  ANS006.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  189.104号电池电压采样状态       $    $       $    $  ANS006.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  190.105号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  191.106号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  192.107号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  193.108号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  194.109号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  195.110号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  196.111号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  197.112号电池电压采样状态       $    $       $    $  ANS006.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  198.113号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  199.114号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  200.115号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  201.116号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  202.117号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  203.118号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  204.119号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  205.120号电池电压采样状态       $    $       $    $  ANS006.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;
  $  206.121号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x01)y=@0087;else y=@0078;
  $  207.122号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x02)y=@0087;else y=@0078;
  $  208.123号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x04)y=@0087;else y=@0078;
  $  209.124号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x08)y=@0087;else y=@0078;
  $  210.125号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x10)y=@0087;else y=@0078;
  $  211.126号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x20)y=@0087;else y=@0078;
  $  212.127号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x40)y=@0087;else y=@0078;
  $  213.128号电池电压采样状态       $    $       $    $  ANS006.BYTE007  $  if(x1&0x80)y=@0087;else y=@0078;
  $  214.129号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x01)y=@0087;else y=@0078;
  $  215.130号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x02)y=@0087;else y=@0078;
  $  216.131号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x04)y=@0087;else y=@0078;
  $  217.132号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x08)y=@0087;else y=@0078;
  $  218.133号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x10)y=@0087;else y=@0078;
  $  219.134号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x20)y=@0087;else y=@0078;
  $  220.135号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x40)y=@0087;else y=@0078;
  $  221.136号电池电压采样状态       $    $       $    $  ANS007.BYTE004  $  if(x1&0x80)y=@0087;else y=@0078;
  $  222.137号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x01)y=@0087;else y=@0078;
  $  223.138号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x02)y=@0087;else y=@0078;
  $  224.139号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x04)y=@0087;else y=@0078;
  $  225.140号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x08)y=@0087;else y=@0078;
  $  226.141号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x10)y=@0087;else y=@0078;
  $  227.142号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x20)y=@0087;else y=@0078;
  $  228.143号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x40)y=@0087;else y=@0078;
  $  229.144号电池电压采样状态       $    $       $    $  ANS007.BYTE005  $  if(x1&0x80)y=@0087;else y=@0078;
  $  230.145号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x01)y=@0087;else y=@0078;
  $  231.146号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x02)y=@0087;else y=@0078;
  $  232.147号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x04)y=@0087;else y=@0078;
  $  233.148号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x08)y=@0087;else y=@0078;
  $  234.149号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x10)y=@0087;else y=@0078;
  $  235.150号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x20)y=@0087;else y=@0078;
  $  236.151号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x40)y=@0087;else y=@0078;
  $  237.152号电池电压采样状态       $    $       $    $  ANS007.BYTE006  $  if(x1&0x80)y=@0087;else y=@0078;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:781 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
