
    车型ID：ad0c

    模拟：协议模拟-->ad0c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00
  $~  REQ001:7E0 02 10 03 00 00 00 00 00       $~  ANS001:7E8 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:

  $@  REQ000:7E0 02 10 01 00 00 00 00 00       $@  ANS000:7E8 02 10 01 00 00 00 00 00


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 02 19 FF 00 00 00 00 00       $#  ANS000:7E8 02 19 FF 00 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE5$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/fe000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 92 00 00 00 00       $%  ANS000:7E8 03 22 F1 92 00 00 00 00
  $%  REQ001:7E0 03 22 F1 94 00 00 00 00       $%  ANS001:7E8 03 22 F1 94 00 00 00 00
  $%  REQ002:7E0 03 22 F1 95 00 00 00 00       $%  ANS002:7E8 03 22 F1 95 00 00 00 00
  $%  REQ003:7E0 03 22 F1 99 00 00 00 00       $%  ANS003:7E8 03 22 F1 99 00 00 00 00
  $%  REQ004:7E0 03 22 F1 8B 00 00 00 00       $%  ANS004:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E0 03 22 F1 90 00 00 00 00       $%  ANS005:7E8 03 22 F1 90 00 00 00 00

  $%  000:硬件编号:                       $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  001:软件编号:                       $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:软件版本号:                     $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2);
  $%  003:编程日期:                       $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X],x1,x2,x3,x4);
  $%  004:ECU生产日期:                    $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X],x1,x2,x3,x4);
  $%  005:学习到的VIN(车辆识别码):        $%    $%  ANS005.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000.发动机转速                                  $    $  rpm          $    $  ANS000.BYTE036  $  y = x1*64+x2*64.0/255;
  $  001.电源电压                                    $    $  V            $    $  ANS000.BYTE035  $  y = x1*0.1;
  $  002.目标怠速(有补偿)                            $    $  rpm          $    $  ANS000.BYTE039  $  y = x1*10;
  $  003.进气压力                                    $    $  kPa          $    $  ANS000.BYTE046  $  y=x1;
  $  004.冷却液温度                                  $    $  degree C     $    $  ANS000.BYTE042  $  y = x1-40;
  $  005.充磁时间                                    $    $  毫秒         $    $  ANS000.BYTE063  $  y = x1*0.1;
  $  006.喷油脉宽                                    $    $  毫秒         $    $  ANS000.BYTE064  $  y = x1*0.1;
  $  007.进气流量                                    $    $  kg/h         $    $  ANS000.BYTE047  $  y =(x1*256+x2)*0.1;
  $  008.车速                                        $    $  km/h         $    $  ANS000.BYTE040  $  y=x1;
  $  009.运行里程                                    $    $  km           $    $  ANS000.BYTE092  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  010.运行时间                                    $    $  分           $    $  ANS000.BYTE096  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  011.进气温度                                    $    $  degree C     $    $  ANS000.BYTE044  $  y = x1-40;
  $  012.大气压力值                                  $    $  kPa          $    $  ANS000.BYTE120  $  y=x1;
  $  013.点火提前角                                  $    $  °           $    $  ANS000.BYTE065  $  y = x1-50;
  $  014.空燃比                                      $    $  %            $    $  ANS000.BYTE128  $  y = x1*0.1;
  $  015.爆震传感器1                                 $    $               $    $  ANS000.BYTE069  $  y =(x1*256+x2);
  $  016.1组氧传感器电压,传感器1(氧传感器1)          $    $  V            $    $  ANS000.BYTE081  $  y = x1*1.000/255;
  $  017.1组氧传感器电压,传感器2(氧传感器2)          $    $  V            $    $  ANS000.BYTE082  $  y = x1*1.000/255;
  $  018.1组氧传感器积分值(短期修正)                 $    $               $    $  ANS000.BYTE079  $  y = x1*1.992/255;
  $  019.1组氧传感器积分值(长期修正)                 $    $               $    $  ANS000.BYTE085  $  y = x1*1.992/255;
  $  020.1缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE073  $  y = x1*0.1;
  $  021.2缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE074  $  y = x1*0.1;
  $  022.3缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE075  $  y = x1*0.1;
  $  023.4缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE076  $  y = x1*0.1;
  $  024.故障里程                                    $    $  km           $    $  ANS000.BYTE134  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  025.EGR(废气再循环)开度                         $    $  %            $    $  ANS000.BYTE139  $  y =(x1*256+x2)*0.1;
  $  026.碳罐阀占空比                                $    $  %            $    $  ANS000.BYTE062  $  y = x1*100.0/255;
  $  027.节气门位置                                  $    $  %            $    $  ANS000.BYTE154  $  y =(x1*256+x2)*0.1;
  $  028.EGR(废气再循环)阀位置传感器                 $    $  V            $    $  ANS000.BYTE141  $  y = x1*5.0/255;
  $  029.怠速空气控制阀步长                          $    $               $    $  ANS000.BYTE151  $  y =(x1*256+x2);
  $  030.冷却液温度传感器                            $    $  V            $    $  ANS000.BYTE041  $  y = x1*5.0/255;
  $  031.进气温度传感器                              $    $  V            $    $  ANS000.BYTE043  $  y = x1*5.0/255;
  $  032.进气压力传感器                              $    $  V            $    $  ANS000.BYTE045  $  y = x1*5.0/255;
  $  033.节气门位置传感器1                           $    $  V            $    $  ANS000.BYTE051  $  y = x1*5.0/255;
  $  034.发动机防盗解锁-ECU发送码验证结果            $    $               $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0191;else y=@0192;
  $  035.发动机防盗解锁-IKey发送码验证结果           $    $               $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0191;else y=@0192;
  $  036.发动机防盗解锁-ECU新旧状态                  $    $               $    $  ANS000.BYTE022  $  if(x1&0x04)y=@00ef;else y=@00ee;
  $  037.发动机冷却系统-低速风扇是否开启             $    $               $    $  ANS000.BYTE023  $  if(x1&0x01)y=@0185;else y=@0186;
  $  038.发动机冷却系统-高速风扇是否开启             $    $               $    $  ANS000.BYTE023  $  if(x1&0x02)y=@0185;else y=@0186;
  $  039.发动机稳态工况-点火电源开启                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x01)y=@0185;else y=@0186;
  $  040.发动机稳态工况-主继电器工作                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x02)y=@0185;else y=@0186;
  $  041.发动机稳态工况-燃油泵状态                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x04)y=@001d;else y=@001e;
  $  042.发动机动态工况-节气门处于怠速位置           $    $               $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0185;else y=@0186;
  $  043.发动机动态工况-节气门处于部分打开位置       $    $               $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0185;else y=@0186;
  $  044.发动机动态工况-节气门处于全开位置           $    $               $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0185;else y=@0186;
  $  045.发动机动态工况-激活减速断油                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x08)y=@00f2;else y=@0181;
  $  046.发动机动态工况-激活加速加浓                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x10)y=@00f2;else y=@0181;
  $  047.排放控制-氧传感器1信号                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x01)y=@017f;else y=@0180;
  $  048.排放控制-氧传感器2信号                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x02)y=@017f;else y=@0180;
  $  049.排放控制-氧传感器1加热                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x10)y=@0183;else y=@0184;
  $  050.排放控制-氧传感器2加热                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x20)y=@0183;else y=@0184;
  $  051.发动机怠速-是否有空调请求                   $    $               $    $  ANS000.BYTE028  $  if(x1&0x04)y=@0185;else y=@0186;
  $  052.发动机怠速-动力转向开关                     $    $               $    $  ANS000.BYTE028  $  if(x1&0x10)y=@001d;else y=@001e;
  $  053.指示灯SVS/MIL-MIL(故障指示灯)激活           $    $               $    $  ANS000.BYTE029  $  if(x1&0x01)y=@00f2;else y=@0181;
  $  054.空调系统-空调请求激活                       $    $               $    $  ANS000.BYTE031  $  if(x1&0x02)y=@00f2;else y=@0181;
  $  055.空调系统-空调压缩机开                       $    $               $    $  ANS000.BYTE031  $  if(x1&0x04)y=@0185;else y=@0186;
  $  056.空调系统-怠速转速因空调而增加               $    $               $    $  ANS000.BYTE031  $  if(x1&0x20)y=@0185;else y=@0186;
  $  057.空调系统-全负荷时关闭空调压缩机             $    $               $    $  ANS000.BYTE031  $  if(x1&0x40)y=@0185;else y=@0186;
  $  058.空调系统-空调中压开关开                     $    $               $    $  ANS000.BYTE031  $  if(x1&0x80)y=@0185;else y=@0186;
  $  059.发动机状态-防盗锁定状态                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x20)y=@000a;else y=@0459;
  $  060.发动机状态-燃油反馈状态                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x40)y=@0189;else y=@018a;
  $  061.发动机状态-可变气门升程阀状态(VVL阀)        $    $               $    $  ANS000.BYTE034  $  if(x1&0x80)y=@001d;else y=@001e;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
