
    车型ID：7229

    模拟：协议模拟-->7229

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 00 00 00 00 00 00       $!  ANS000:7E8 02 3E 00 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 03 19 02 0C 00 00 00 00       $#  ANS000:7E8 03 19 02 0C 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 83 00 00 00 00       $%  ANS000:7E8 03 22 F1 83 00 00 00 00
  $%  REQ001:7E0 03 22 F1 87 00 00 00 00       $%  ANS001:7E8 03 22 F1 87 00 00 00 00
  $%  REQ002:7E0 03 22 F1 90 00 00 00 00       $%  ANS002:7E8 03 22 F1 90 00 00 00 00
  $%  REQ003:7E0 03 22 F1 92 00 00 00 00       $%  ANS003:7E8 03 22 F1 92 00 00 00 00
  $%  REQ004:7E0 03 22 F1 93 00 00 00 00       $%  ANS004:7E8 03 22 F1 93 00 00 00 00
  $%  REQ005:7E0 03 22 F1 94 00 00 00 00       $%  ANS005:7E8 03 22 F1 94 00 00 00 00
  $%  REQ006:7E0 03 22 F1 95 00 00 00 00       $%  ANS006:7E8 03 22 F1 95 00 00 00 00
  $%  REQ007:7E0 03 22 F1 99 00 00 00 00       $%  ANS007:7E8 03 22 F1 99 00 00 00 00
  $%  REQ008:7E0 03 22 F1 9C 00 00 00 00       $%  ANS008:7E8 03 22 F1 9C 00 00 00 00
  $%  REQ009:7E0 03 22 F1 9D 00 00 00 00       $%  ANS009:7E8 03 22 F1 9D 00 00 00 00
  $%  REQ010:7E0 03 22 F1 80 00 00 00 00       $%  ANS010:7E8 03 22 F1 80 00 00 00 00
  $%  REQ011:7E0 03 22 F1 A1 00 00 00 00       $%  ANS011:7E8 03 22 F1 A1 00 00 00 00
  $%  REQ012:7E0 03 22 F1 98 00 00 00 00       $%  ANS012:7E8 03 22 F1 98 00 00 00 00
  $%  REQ013:7E0 03 22 F1 81 00 00 00 00       $%  ANS013:7E8 03 22 F1 81 00 00 00 00
  $%  REQ014:7E0 03 22 F1 89 00 00 00 00       $%  ANS014:7E8 03 22 F1 89 00 00 00 00
  $%  REQ015:7E0 03 22 F1 8C 00 00 00 00       $%  ANS015:7E8 03 22 F1 8C 00 00 00 00
  $%  REQ016:7E0 03 22 F1 91 00 00 00 00       $%  ANS016:7E8 03 22 F1 91 00 00 00 00
  $%  REQ017:7E0 03 22 F1 A4 00 00 00 00       $%  ANS017:7E8 03 22 F1 A4 00 00 00 00
  $%  REQ018:7E0 03 22 F1 A5 00 00 00 00       $%  ANS018:7E8 03 22 F1 A5 00 00 00 00
  $%  REQ019:7E0 03 22 F1 A6 00 00 00 00       $%  ANS019:7E8 03 22 F1 A6 00 00 00 00

  $%  000:供应商ECU(电子控制器) Boot(引导)软件版本号:        $%    $%  ANS000.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  001:零件号:                                            $%    $%  ANS001.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  002:VIN码:                                             $%    $%  ANS002.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  003:供应商ECU(电子控制器)硬件号:                       $%    $%  ANS003.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19);
  $%  004:供应商ECU(电子控制器)硬件版本号:                   $%    $%  ANS004.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  005:供应商ECU(电子控制器)软件号:                       $%    $%  ANS005.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  006:供应商ECU(电子控制器)软件版本号:                   $%    $%  ANS006.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  007:编程日期:                                          $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);
  $%  008:标定软件版本号:                                    $%    $%  ANS008.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  009:ECU(电子控制器)安装日期:                           $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);
  $%  010:ECU(电子控制器) Boot(引导)软件版本信息:            $%    $%  ANS010.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  011:配置信息:                                          $%    $%  ANS011.BYTE004  $%  Y=HEX(X1,X2,X3);
  $%  012:诊断仪序列号:                                      $%    $%  ANS012.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:ECU(电子控制器)应用软件版本号:                     $%    $%  ANS013.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  014:ECU(电子控制器)软件版本号:                         $%    $%  ANS014.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  015:ECU(电子控制器)序列号:                             $%    $%  ANS015.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  016:ECU(电子控制器)硬件版本号:                         $%    $%  ANS016.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  017:供应商ECU(电子控制器)标定软件版本号:               $%    $%  ANS017.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $%  018:车辆规格号:                                        $%    $%  ANS018.BYTE004  $%  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18);
  $%  019:在生产线上的车辆生产日期:                          $%    $%  ANS019.BYTE004  $%  y=SPRINTF([%02x%02x-%02x-%02x],x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:7E0 03 22 02 02 00 00 00 00       $  ANS000:7E8 03 22 02 02 00 00 00 00
  $  REQ001:7E0 03 22 02 01 00 00 00 00       $  ANS001:7E8 03 22 02 01 00 00 00 00
  $  REQ002:7E0 03 22 02 03 00 00 00 00       $  ANS002:7E8 03 22 02 03 00 00 00 00
  $  REQ003:7E0 03 22 02 04 00 00 00 00       $  ANS003:7E8 03 22 02 04 00 00 00 00
  $  REQ004:7E0 03 22 02 05 00 00 00 00       $  ANS004:7E8 03 22 02 05 00 00 00 00
  $  REQ005:7E0 03 22 02 08 00 00 00 00       $  ANS005:7E8 03 22 02 08 00 00 00 00
  $  REQ006:7E0 03 22 02 09 00 00 00 00       $  ANS006:7E8 03 22 02 09 00 00 00 00
  $  REQ007:7E0 03 22 02 0A 00 00 00 00       $  ANS007:7E8 03 22 02 0A 00 00 00 00
  $  REQ008:7E0 03 22 02 0D 00 00 00 00       $  ANS008:7E8 03 22 02 0D 00 00 00 00
  $  REQ009:7E0 03 22 02 0E 00 00 00 00       $  ANS009:7E8 03 22 02 0E 00 00 00 00
  $  REQ010:7E0 03 22 02 10 00 00 00 00       $  ANS010:7E8 03 22 02 10 00 00 00 00
  $  REQ011:7E0 03 22 02 11 00 00 00 00       $  ANS011:7E8 03 22 02 11 00 00 00 00
  $  REQ012:7E0 03 22 02 1E 00 00 00 00       $  ANS012:7E8 03 22 02 1E 00 00 00 00
  $  REQ013:7E0 03 22 02 20 00 00 00 00       $  ANS013:7E8 03 22 02 20 00 00 00 00
  $  REQ014:7E0 03 22 02 23 00 00 00 00       $  ANS014:7E8 03 22 02 23 00 00 00 00
  $  REQ015:7E0 03 22 02 25 00 00 00 00       $  ANS015:7E8 03 22 02 25 00 00 00 00
  $  REQ016:7E0 03 22 02 2C 00 00 00 00       $  ANS016:7E8 03 22 02 2C 00 00 00 00
  $  REQ017:7E0 03 22 02 2D 00 00 00 00       $  ANS017:7E8 03 22 02 2D 00 00 00 00
  $  REQ018:7E0 03 22 02 2F 00 00 00 00       $  ANS018:7E8 03 22 02 2F 00 00 00 00
  $  REQ019:7E0 03 22 02 31 00 00 00 00       $  ANS019:7E8 03 22 02 31 00 00 00 00
  $  REQ020:7E0 03 22 02 32 00 00 00 00       $  ANS020:7E8 03 22 02 32 00 00 00 00
  $  REQ021:7E0 03 22 02 36 00 00 00 00       $  ANS021:7E8 03 22 02 36 00 00 00 00
  $  REQ022:7E0 03 22 02 37 00 00 00 00       $  ANS022:7E8 03 22 02 37 00 00 00 00
  $  REQ023:7E0 03 22 02 3A 00 00 00 00       $  ANS023:7E8 03 22 02 3A 00 00 00 00
  $  REQ024:7E0 03 22 02 3C 00 00 00 00       $  ANS024:7E8 03 22 02 3C 00 00 00 00
  $  REQ025:7E0 03 22 02 3D 00 00 00 00       $  ANS025:7E8 03 22 02 3D 00 00 00 00
  $  REQ026:7E0 03 22 02 3F 00 00 00 00       $  ANS026:7E8 03 22 02 3F 00 00 00 00
  $  REQ027:7E0 03 22 02 40 00 00 00 00       $  ANS027:7E8 03 22 02 40 00 00 00 00
  $  REQ028:7E0 03 22 02 41 00 00 00 00       $  ANS028:7E8 03 22 02 41 00 00 00 00
  $  REQ029:7E0 03 22 02 45 00 00 00 00       $  ANS029:7E8 03 22 02 45 00 00 00 00
  $  REQ030:7E0 03 22 02 47 00 00 00 00       $  ANS030:7E8 03 22 02 47 00 00 00 00
  $  REQ031:7E0 03 22 02 48 00 00 00 00       $  ANS031:7E8 03 22 02 48 00 00 00 00
  $  REQ032:7E0 03 22 02 49 00 00 00 00       $  ANS032:7E8 03 22 02 49 00 00 00 00
  $  REQ033:7E0 03 22 02 52 00 00 00 00       $  ANS033:7E8 03 22 02 52 00 00 00 00
  $  REQ034:7E0 03 22 02 56 00 00 00 00       $  ANS034:7E8 03 22 02 56 00 00 00 00
  $  REQ035:7E0 03 22 02 58 00 00 00 00       $  ANS035:7E8 03 22 02 58 00 00 00 00
  $  REQ036:7E0 03 22 02 57 00 00 00 00       $  ANS036:7E8 03 22 02 57 00 00 00 00
  $  REQ037:7E0 03 22 02 5B 00 00 00 00       $  ANS037:7E8 03 22 02 5B 00 00 00 00
  $  REQ038:7E0 03 22 02 5C 00 00 00 00       $  ANS038:7E8 03 22 02 5C 00 00 00 00
  $  REQ039:7E0 03 22 02 60 00 00 00 00       $  ANS039:7E8 03 22 02 60 00 00 00 00
  $  REQ040:7E0 03 22 02 62 00 00 00 00       $  ANS040:7E8 03 22 02 62 00 00 00 00
  $  REQ041:7E0 03 22 02 63 00 00 00 00       $  ANS041:7E8 03 22 02 63 00 00 00 00
  $  REQ042:7E0 03 22 02 65 00 00 00 00       $  ANS042:7E8 03 22 02 65 00 00 00 00
  $  REQ043:7E0 03 22 02 66 00 00 00 00       $  ANS043:7E8 03 22 02 66 00 00 00 00
  $  REQ044:7E0 03 22 02 6E 00 00 00 00       $  ANS044:7E8 03 22 02 6E 00 00 00 00
  $  REQ045:7E0 03 22 02 8B 00 00 00 00       $  ANS045:7E8 03 22 02 8B 00 00 00 00
  $  REQ046:7E0 03 22 02 8C 00 00 00 00       $  ANS046:7E8 03 22 02 8C 00 00 00 00
  $  REQ047:7E0 03 22 02 8D 00 00 00 00       $  ANS047:7E8 03 22 02 8D 00 00 00 00
  $  REQ048:7E0 03 22 01 63 00 00 00 00       $  ANS048:7E8 03 22 01 63 00 00 00 00
  $  REQ049:7E0 03 22 02 90 00 00 00 00       $  ANS049:7E8 03 22 02 90 00 00 00 00
  $  REQ050:7E0 03 22 02 91 00 00 00 00       $  ANS050:7E8 03 22 02 91 00 00 00 00
  $  REQ051:7E0 03 22 02 92 00 00 00 00       $  ANS051:7E8 03 22 02 92 00 00 00 00
  $  REQ052:7E0 03 22 02 93 00 00 00 00       $  ANS052:7E8 03 22 02 93 00 00 00 00
  $  REQ053:7E0 03 22 02 94 00 00 00 00       $  ANS053:7E8 03 22 02 94 00 00 00 00
  $  REQ054:7E0 03 22 02 95 00 00 00 00       $  ANS054:7E8 03 22 02 95 00 00 00 00
  $  REQ055:7E0 03 22 02 9A 00 00 00 00       $  ANS055:7E8 03 22 02 9A 00 00 00 00
  $  REQ056:7E0 03 22 02 D1 00 00 00 00       $  ANS056:7E8 03 22 02 D1 00 00 00 00
  $  REQ057:7E0 03 22 02 D2 00 00 00 00       $  ANS057:7E8 03 22 02 D2 00 00 00 00
  $  REQ058:7E0 03 22 02 D3 00 00 00 00       $  ANS058:7E8 03 22 02 D3 00 00 00 00
  $  REQ059:7E0 03 22 02 D4 00 00 00 00       $  ANS059:7E8 03 22 02 D4 00 00 00 00
  $  REQ060:7E0 03 22 02 E1 00 00 00 00       $  ANS060:7E8 03 22 02 E1 00 00 00 00
  $  REQ061:7E0 03 22 02 E2 00 00 00 00       $  ANS061:7E8 03 22 02 E2 00 00 00 00
  $  REQ062:7E0 03 22 02 E3 00 00 00 00       $  ANS062:7E8 03 22 02 E3 00 00 00 00
  $  REQ063:7E0 03 22 02 E4 00 00 00 00       $  ANS063:7E8 03 22 02 E4 00 00 00 00
  $  REQ064:7E0 03 22 02 7C 00 00 00 00       $  ANS064:7E8 03 22 02 7C 00 00 00 00
  $  REQ065:7E0 03 22 02 7D 00 00 00 00       $  ANS065:7E8 03 22 02 7D 00 00 00 00
  $  REQ066:7E0 03 22 02 7E 00 00 00 00       $  ANS066:7E8 03 22 02 7E 00 00 00 00
  $  REQ067:7E0 03 22 02 7F 00 00 00 00       $  ANS067:7E8 03 22 02 7F 00 00 00 00
  $  REQ068:7E0 03 22 02 F1 00 00 00 00       $  ANS068:7E8 03 22 02 F1 00 00 00 00
  $  REQ069:7E0 03 22 02 F2 00 00 00 00       $  ANS069:7E8 03 22 02 F2 00 00 00 00
  $  REQ070:7E0 03 22 02 F3 00 00 00 00       $  ANS070:7E8 03 22 02 F3 00 00 00 00
  $  REQ071:7E0 03 22 02 F4 00 00 00 00       $  ANS071:7E8 03 22 02 F4 00 00 00 00
  $  REQ072:7E0 03 22 02 89 00 00 00 00       $  ANS072:7E8 03 22 02 89 00 00 00 00
  $  REQ073:7E0 03 22 02 00 00 00 00 00       $  ANS073:7E8 03 22 02 00 00 00 00 00
  $  REQ074:7E0 03 22 02 0B 00 00 00 00       $  ANS074:7E8 03 22 02 0B 00 00 00 00
  $  REQ075:7E0 03 22 02 84 00 00 00 00       $  ANS075:7E8 03 22 02 84 00 00 00 00
  $  REQ076:7E0 03 22 02 85 00 00 00 00       $  ANS076:7E8 03 22 02 85 00 00 00 00
  $  REQ077:7E0 03 22 02 C2 00 00 00 00       $  ANS077:7E8 03 22 02 C2 00 00 00 00
  $  REQ078:7E0 03 22 F1 A7 00 00 00 00       $  ANS078:7E8 03 22 F1 A7 00 00 00 00

  $  000.期望指示扭矩                                                  $    $  %           $    $  ANS000.BYTE004  $  Y=(X1*256+X2)*0.001525879;
  $  001.实际指示扭矩                                                  $    $  %           $    $  ANS001.BYTE004  $  Y=(X1*256+X2)*0.001525879;
  $  002.发动机温度                                                    $    $  degC        $    $  ANS002.BYTE004  $  Y=X1*0.75-48;
  $  003.发动机转速                                                    $    $  rpm         $    $  ANS003.BYTE004  $  Y=(X1*256+X2)/4;
  $  004.启动结束后时间                                                $    $  s           $    $  ANS004.BYTE004  $  Y=(X1*256+X2)*0.1;
  $  005.车速                                                          $    $  km/h        $    $  ANS005.BYTE004  $  Y=(X1*256+X2)*0.0078125;
  $  006.环境压力                                                      $    $  hPa         $    $  ANS006.BYTE004  $  Y=(X1*256+X2)*0.0390625;
  $  007.电瓶电压                                                      $    $  V           $    $  ANS007.BYTE004  $  Y=(X1*256+X2)*0.000390625;
  $  008.进气温度                                                      $    $  degC        $    $  ANS008.BYTE004  $  Y=X1*0.75-48;
  $  009.环境温度                                                      $    $  degC        $    $  ANS009.BYTE004  $  Y=X1*0.75-48;
  $  010.标准化加速踏板角度                                            $    $  %PED        $    $  ANS010.BYTE004  $  Y=(X1*256+X2)*0.001525879;
  $  011.燃油流量                                                      $    $  mL/s        $    $  ANS011.BYTE004  $  Y=(X1*256+X2)*0.000596046;
  $  012.相对负荷 (参考J1979)                                          $    $  %           $    $  ANS012.BYTE004  $  Y=X1*0.390625;
  $  013.进气量                                                        $    $  kg/h        $    $  ANS013.BYTE004  $  Y=X1*4;
  $  014.下游氧传感器输出电压                                          $    $  V           $    $  ANS014.BYTE004  $  Y=X1*0.005228758-0.2;
  $  015.相对负荷                                                      $    $  %           $    $  ANS015.BYTE004  $  Y=X1*0.75;
  $  016.相对于机械下止点的目标节气门开度                              $    $  %DK         $    $  ANS016.BYTE004  $  Y=X1*0.392156863;
  $  017.催化器下游废弃温度                                            $    $  degC        $    $  ANS017.BYTE004  $  Y=X1*5-50;
  $  018.冷却液温度计算值                                              $    $  degC        $    $  ANS018.BYTE004  $  Y=X1*0.75-48;
  $  019.功能监控中的计算扭矩                                          $    $  %           $    $  ANS019.BYTE004  $  Y=X1*0.390625;
  $  020.档位                                                          $    $              $    $  ANS020.BYTE004  $  Y=X1;
  $  021.实际点火角                                                    $    $  Grad KW     $    $  ANS021.BYTE004  $  Y=X1*0.75;
  $  022.质量流量负荷信号修正系数                                      $    $              $    $  ANS022.BYTE004  $  Y=(X1*256+x2)*0.0000610352;
  $  023.节气门电位计1的位置信号                                       $    $  %DK         $    $  ANS023.BYTE004  $  Y=(X1*256+X2)*0.024414063;
  $  024.节气门体控制信号占空比                                        $    $  %           $    $  ANS024.BYTE004  $  Y=(X1*256+X2)*0.001525879;
  $  025.模型模式下节气门位置                                          $    $  %DK         $    $  ANS025.BYTE004  $  Y=X1*0.392156863;
  $  026.跛行模式下，节气门电位计1电压信号                             $    $  V           $    $  ANS026.BYTE004  $  Y=(X1*256+X2)*0.001220703;
  $  027.机械下止点处的节气门电位计1电压信号                           $    $  V           $    $  ANS027.BYTE004  $  Y=X1*0.01953125;
  $  028.车辆加速度                                                    $    $  m/s^2       $    $  ANS028.BYTE004  $  Y=X1*0.217;
  $  029.绝对进气歧管压力                                              $    $  hPa         $    $  ANS029.BYTE004  $  Y=(X1*256+X2)*0.0390625;
  $  030.进气温度计算值                                                $    $  degC        $    $  ANS030.BYTE004  $  Y=X1*0.75-48;
  $  031.车速输出值                                                    $    $  km/h        $    $  ANS031.BYTE004  $  Y=(X1*256+X2)*0.0078125;
  $  032.电瓶电压采样值                                                $    $  V           $    $  ANS032.BYTE004  $  Y=(X1*256+X2)*0.004882813;
  $  033.期望进气阀相对于LWOT的开度角                                  $    $  Grad KW     $    $  ANS033.BYTE004  $  Y=(X1*256+X2)*0.0078125;
  $  034.油温                                                          $    $  degC        $    $  ANS034.BYTE004  $  Y=(X1*256+X2)*0.0234375-273.15;
  $  035.长期燃油加法修正                                              $    $              $    $  ANS035.BYTE004  $  Y=(X1*256+X2)*0.0000305176;
  $  036.短期燃油修正系数                                              $    $              $    $  ANS036.BYTE004  $  Y=(X1*256+X2)*0.0000305176;
  $  037.节气门电位计1信号电压                                         $    $  V           $    $  ANS037.BYTE004  $  Y=(X1*256+X2)*0.001220703;
  $  038.节气门电位计2信号电压                                         $    $  V           $    $  ANS038.BYTE004  $  Y=(X1*256+X2)*0.001220703;
  $  039.混合气调整附加修正系数                                        $    $              $    $  ANS039.BYTE004  $  Y=(X1*256+X2)*0.046875;
  $  040.PWG电位计1电压                                                $    $  V           $    $  ANS040.BYTE004  $  Y=(X1*256+X2)*0.046875;
  $  041.PWG电位计2电压                                                $    $  %           $    $  ANS041.BYTE004  $  Y=(X1*256+X2)*0.004882813;
  $  042.下游氧传感器内部阻抗                                          $    $  ohm         $    $  ANS042.BYTE004  $  Y=(X1*256+X2)*2;
  $  043.模型排气温度                                                  $    $  degC        $    $  ANS043.BYTE004  $  Y=(X1*256+X2)*0.0234375-273.15;
  $  044.怠速转速                                                      $    $  rpm         $    $  ANS044.BYTE004  $  Y=X1*10;
  $  045.冷却液温度传感器电压                                          $    $              $    $  ANS045.BYTE004  $  Y=(X1*256+X2)/131072;
  $  046.进气温度传感器电压                                            $    $  V           $    $  ANS046.BYTE004  $  Y=X1*0.01953125;
  $  047.进气歧管压力传感器电压                                        $    $  V           $    $  ANS047.BYTE004  $  Y=(X1*256+X2)*0.00488288;
  $  048.排气VVT(可变气门正时)实际位置                                 $    $  oCA         $    $  ANS048.BYTE004  $  Y=(X1*256+X2)/128;
  $  049.离合器开关置位                                                $    $              $    $  ANS049.BYTE004  $  Y=X1;
  $  050.MIL(故障指示灯)亮后行驶的里程                                 $    $  km          $    $  ANS050.BYTE004  $  Y=(X1*16777216+X2*65536+X3*256+X4)*0.01;
  $  051.供油系统加法自学习值                                          $    $  %           $    $  ANS051.BYTE004  $  Y=(X1*256+X2)*0.046875;
  $  052.长期燃油修正系数                                              $    $              $    $  ANS052.BYTE004  $  Y=(X1*256+X2)*0.0000305;
  $  053.怠速扭矩自学习值                                              $    $  %           $    $  ANS053.BYTE004  $  Y=(X1*256+X2)*0.00305;
  $  054.催化器老化因子值(DKAT配置)                                    $    $              $    $  ANS054.BYTE004  $  Y=X1*0.00390625;
  $  055.增压压力                                                      $    $  hPa         $    $  ANS055.BYTE004  $  Y=(X1*256+X2)*0.0390625;
  $  056.1缸点火延迟角                                                 $    $  Grad KW     $    $  ANS056.BYTE004  $  Y=X1*0.75;
  $  057.2缸点火延迟角                                                 $    $  Grad KW     $    $  ANS057.BYTE004  $  Y=X1*0.75;
  $  058.3缸点火延迟角                                                 $    $  Grad KW     $    $  ANS058.BYTE004  $  Y=X1*0.75;
  $  059.4缸点火延迟角                                                 $    $  Grad KW     $    $  ANS059.BYTE004  $  Y=X1*0.75;
  $  060.1缸爆震传感器参考电平                                         $    $  V           $    $  ANS060.BYTE004  $  Y=(X1*256+X2)*0.0000762939;
  $  061.2缸爆震传感器参考电平                                         $    $  V           $    $  ANS061.BYTE004  $  Y=(X1*256+X2)*0.0000762939;
  $  062.3缸爆震传感器参考电平                                         $    $  V           $    $  ANS062.BYTE004  $  Y=(X1*256+X2)*0.0000762939;
  $  063.4缸爆震传感器参考电平                                         $    $  V           $    $  ANS063.BYTE004  $  Y=(X1*256+X2)*0.0000762939;
  $  064.发动机启动时的温度                                            $    $  degC        $    $  ANS064.BYTE004  $  Y=X1*0.75-48;
  $  065.标准化炭罐流量                                                $    $  kg/h        $    $  ANS065.BYTE004  $  Y=(X1*256+X2)*0.000390625;
  $  066.基本点火角                                                    $    $  Grad KW     $    $  ANS066.BYTE004  $  Y=X1*0.75;
  $  067.失火率                                                        $    $              $    $  ANS067.BYTE004  $  Y=X1*256+X2;
  $  068.1缸失火次数                                                   $    $              $    $  ANS068.BYTE004  $  Y=X1*256+X2;
  $  069.2缸失火次数                                                   $    $              $    $  ANS069.BYTE004  $  Y=X1*256+X2;
  $  070.3缸失火次数                                                   $    $              $    $  ANS070.BYTE004  $  Y=X1*256+X2;
  $  071.4缸失火次数                                                   $    $              $    $  ANS071.BYTE004  $  Y=X1*256+X2;
  $  072.怠速控制器的扭矩修正请求（PD部分）                            $    $  %           $    $  ANS072.BYTE004  $  Y=(X1*256+X2)*0.003051758;
  $  073.最大可达指示扭矩                                              $    $  %           $    $  ANS073.BYTE004  $  Y=(X1*256+X2)*0.001525879;
  $  074.节气门相对于机械下止点的开度角                                $    $  %DK         $    $  ANS074.BYTE004  $  Y=(X1*256+X2)*0.024414063;
  $  075.失火范围,最小转速                                             $    $  rpm         $    $  ANS075.BYTE004  $  Y=X1*40;
  $  076.失火范围,最大转速                                             $    $  rpm         $    $  ANS076.BYTE004  $  Y=X1*40;
  $  077.EMS(发动机管理系统)状态                                       $    $              $    $  ANS077.BYTE004  $  if(X1==0) y=@0081;else if(X1==1) y=@0082;else if(X1==2) y=@0066;else Y=@0006;
  $  078.车门一旦打开，本次驾驶循环抑制导致的禁止起机                  $    $              $    $  ANS078.BYTE004  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  079.来自STASTOCR禁止导致的无法起机                                $    $              $    $  ANS078.BYTE004  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  080.客户化抑制导致的无法起机                                      $    $              $    $  ANS078.BYTE004  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  081.TCU(自动变速箱控制器)抑制导致的无法起机                       $    $              $    $  ANS078.BYTE004  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  082.驾驶员不在座导致的无法起机                                    $    $              $    $  ANS078.BYTE005  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  083.前舱盖打开导致的无法起机                                      $    $              $    $  ANS078.BYTE005  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  084.车门打开导致的无法起机                                        $    $              $    $  ANS078.BYTE005  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  085.安全带打开导致的无法起机                                      $    $              $    $  ANS078.BYTE005  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  086.空挡和离合器开关诊断没有完成导致的无法起机                    $    $              $    $  ANS078.BYTE005  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  087.R2继电器粘着故障                                              $    $              $    $  ANS078.BYTE005  $  if(((X1>>6)&1)) Y=@003a;else Y=@0037;
  $  088.车门和安全带导致起动抑制导致的无法起机                        $    $              $    $  ANS078.BYTE005  $  if(((X1>>7)&1)) Y=@003a;else Y=@0037;
  $  089.EEM相关抑制导致的无法自动停机                                 $    $              $    $  ANS078.BYTE007  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  090.R2继电器粘着故障导致的无法自动停机                            $    $              $    $  ANS078.BYTE008  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  091.发动机相关故障导致的无法自动停机                              $    $              $    $  ANS078.BYTE008  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  092.TCU(自动变速箱控制器)抑制导致的无法自动停机                   $    $              $    $  ANS078.BYTE008  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  093.BCM(车身控制系统)抑制导致的无法自动停机                       $    $              $    $  ANS078.BYTE008  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  094.热管理抑制导致的无法自动停机                                  $    $              $    $  ANS078.BYTE008  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  095.HHC(坡道辅助系统)抑制导致的无法自动停机                       $    $              $    $  ANS078.BYTE008  $  if(((X1>>5)&1)) Y=@003a;else Y=@0037;
  $  096.泊车抑制导致的无法自动停机                                    $    $              $    $  ANS078.BYTE008  $  if(((X1>>6)&1)) Y=@003a;else Y=@0037;
  $  097.客户化抑制导致的无法自动停机                                  $    $              $    $  ANS078.BYTE008  $  if(((X1>>7)&1)) Y=@003a;else Y=@0037;
  $  098.前舱盖打开导致的无法自动停机                                  $    $              $    $  ANS078.BYTE009  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  099.驾驶员不在座导致的无法自动停机                                $    $              $    $  ANS078.BYTE009  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  100.电池不允许导致的无法自动停机                                  $    $              $    $  ANS078.BYTE009  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  101.刹车真空度不允许导致的无法自动停机                            $    $              $    $  ANS078.BYTE009  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  102.空调不允许导致的无法自动停机                                  $    $              $    $  ANS078.BYTE009  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  103.起动机过热导致的无法自动停机                                  $    $              $    $  ANS078.BYTE009  $  if(((X1>>5)&1)) Y=@003a;else Y=@0037;
  $  104.空挡和离合器开关没有诊断完成导致的无法自动停机                $    $              $    $  ANS078.BYTE009  $  if(((X1>>6)&1)) Y=@003a;else Y=@0037;
  $  105.空挡和离合器诊断完成有故障导致的无法自动停机                  $    $              $    $  ANS078.BYTE009  $  if(((X1>>7)&1)) Y=@003a;else Y=@0037;
  $  106.驾驶模式抑制导致的无法自动停机                                $    $              $    $  ANS078.BYTE010  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  107.APA(自动泊车辅助系统)模式抑制导致的无法自动停机               $    $              $    $  ANS078.BYTE010  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  108.HCU(整车控制器)抑制导致的无法自动停机                         $    $              $    $  ANS078.BYTE010  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  109.ESP(电控稳定系统)抑制导致的无法自动停机                       $    $              $    $  ANS078.BYTE010  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  110.紧急制动抑制导致的无法自动停机                                $    $              $    $  ANS078.BYTE010  $  if(((X1>>5)&1)) Y=@003a;else Y=@0037;
  $  111.环境温度抑制导致的无法自动停机                                $    $              $    $  ANS078.BYTE011  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  112.车速故障抑制导致的无法自动停机                                $    $              $    $  ANS078.BYTE011  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  113.汽车引擎盖或者制动相关客户化抑制导致的无法自动停机            $    $              $    $  ANS078.BYTE011  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  114.监控抑制导致的无法自动停机                                    $    $              $    $  ANS078.BYTE011  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  115.Dcdc(直流转换器)状态抑制导致的无法自动停机                    $    $              $    $  ANS078.BYTE011  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  116.ACC抑制导致的无法自动停机                                     $    $              $    $  ANS078.BYTE011  $  if(((X1>>6)&1)) Y=@003a;else Y=@0037;
  $  117.档杆位置抑制导致的无法自动停机                                $    $              $    $  ANS078.BYTE011  $  if(((X1>>7)&1)) Y=@003a;else Y=@0037;
  $  118.EEM请求导致的自动起机                                         $    $              $    $  ANS078.BYTE012  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  119.前机舱盖打开导致的自动起机                                    $    $              $    $  ANS078.BYTE012  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  120.来自EBS(电子制动系统)请求导致的自动起机                       $    $              $    $  ANS078.BYTE013  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  121.制动真空度请求导致的自动起机                                  $    $              $    $  ANS078.BYTE013  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  122.空调请求导致的自动起机                                        $    $              $    $  ANS078.BYTE013  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  123.泊车请求导致的自动起机                                        $    $              $    $  ANS078.BYTE013  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  124.HHC(坡道辅助系统)请求导致的自动起机                           $    $              $    $  ANS078.BYTE013  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  125.发动机层请求导致的自动起机                                    $    $              $    $  ANS078.BYTE013  $  if(((X1>>5)&1)) Y=@003a;else Y=@0037;
  $  126.热管理请求导致的自动起机                                      $    $              $    $  ANS078.BYTE013  $  if(((X1>>6)&1)) Y=@003a;else Y=@0037;
  $  127.客户化请求导致的自动起机                                      $    $              $    $  ANS078.BYTE013  $  if(((X1>>7)&1)) Y=@003a;else Y=@0037;
  $  128.驾驶员不在座触发导致的自动起机                                $    $              $    $  ANS078.BYTE014  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  129.EPB(电子驻车) autohold(自动驻车)触发导致的自动起机            $    $              $    $  ANS078.BYTE014  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  130.Auto hold(自动驻车)或者制动相关客户化请求导致的自动起机       $    $              $    $  ANS078.BYTE015  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  131.TCU(自动变速箱控制器)请求导致的自动起机                       $    $              $    $  ANS078.BYTE015  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  132.驾驶模式请求导致的自动起机                                    $    $              $    $  ANS078.BYTE015  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  133.HCU(整车控制器)请求导致的自动起机                             $    $              $    $  ANS078.BYTE015  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  134.APA(自动泊车辅助系统)请求导致的自动起机                       $    $              $    $  ANS078.BYTE015  $  if(((X1>>5)&1)) Y=@003a;else Y=@0037;
  $  135.停机时间触发导致的自动起机                                    $    $              $    $  ANS078.BYTE015  $  if(((X1>>6)&1)) Y=@003a;else Y=@0037;
  $  136.ACC请求导致的自动起机                                         $    $              $    $  ANS078.BYTE015  $  if(((X1>>7)&1)) Y=@003a;else Y=@0037;
  $  137.LIN通讯故障                                                   $    $              $    $  ANS078.BYTE016  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  138.EBS(电子制动系统)故障                                         $    $              $    $  ANS078.BYTE016  $  if(((X1>>1)&1)) Y=@003a;else Y=@0037;
  $  139.刹车伺服故障                                                  $    $              $    $  ANS078.BYTE016  $  if(((X1>>2)&1)) Y=@003a;else Y=@0037;
  $  140.车门舱盖等故障                                                $    $              $    $  ANS078.BYTE016  $  if(((X1>>3)&1)) Y=@003a;else Y=@0037;
  $  141.EEM相关故障                                                   $    $              $    $  ANS078.BYTE016  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  142.刹车故障                                                      $    $              $    $  ANS078.BYTE017  $  if(((X1>>0)&1)) Y=@003a;else Y=@0037;
  $  143.起动机继电器驱动级故障                                        $    $              $    $  ANS078.BYTE017  $  if(((X1>>5)&1)) Y=@003a;else Y=@0037;
  $  144.起动机故障                                                    $    $              $    $  ANS078.BYTE017  $  if(((X1>>4)&1)) Y=@003a;else Y=@0037;
  $  145.远程启动故障                                                  $    $              $    $  ANS078.BYTE017  $  if(((X1>>6)&1)) Y=@003a;else Y=@0037;
  $  146.车速故障                                                      $    $              $    $  ANS078.BYTE017  $  if(((X1>>7)&1)) Y=@003a;else Y=@0037;

  $)  01.IUPR数据
  $  01.IUPR数据
  $  REQ000:7E0 02 09 08 00 00 00 00 00       $  ANS000:7E8 02 09 08 00 00 00 00 00
  $  REQ001:7E0 02 09 02 00 00 00 00 00       $  ANS001:7E8 02 09 02 00 00 00 00 00
  $  REQ002:7E0 02 09 04 00 00 00 00 00       $  ANS002:7E8 02 09 04 00 00 00 00 00

  $  000.通用分母                                                               $    $       $    $  ANS000.BYTE004  $  Y=X1*256+X2;
  $  001.点火计数器                                                             $    $       $    $  ANS000.BYTE006  $  Y=X1*256+X2;
  $  002.VIN                                                                    $    $       $    $  ANS001.BYTE004  $  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $  003.软件标定识别码                                                         $    $       $    $  ANS002.BYTE004  $  Y=ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $  004.催化器分子Bank（组）1                                                  $    $       $    $  ANS000.BYTE008  $  Y=X1*256+X2;
  $  005.催化器分母Bank（组）1（此数值大于等于150有效）                         $    $       $    $  ANS000.BYTE010  $  Y=X1*256+X2;
  $  006.催化器组分子Bank（组）2                                                $    $       $    $  ANS000.BYTE012  $  Y=X1*256+X2;
  $  007.催化器组分母Bank（组）2                                                $    $       $    $  ANS000.BYTE014  $  Y=X1*256+X2;
  $  008.前氧组分子Bank（组）1                                                  $    $       $    $  ANS000.BYTE016  $  Y=X1*256+X2;
  $  009.前氧组分母Bank（组）1（此数值大于等于150有效）                         $    $       $    $  ANS000.BYTE018  $  Y=X1*256+X2;
  $  010.前氧组分子Bank（组）2                                                  $    $       $    $  ANS000.BYTE020  $  Y=X1*256+X2;
  $  011.前氧组分母Bank（组）2                                                  $    $       $    $  ANS000.BYTE022  $  Y=X1*256+X2;
  $  012.EGR(废气再循环)/VVT(可变气门正时)组分子                                $    $       $    $  ANS000.BYTE024  $  Y=X1*256+X2;
  $  013.EGR(废气再循环)/VVT(可变气门正时)组分母（此数值大于等于150有效）       $    $       $    $  ANS000.BYTE026  $  Y=X1*256+X2;
  $  014.二次空气组分子                                                         $    $       $    $  ANS000.BYTE028  $  Y=X1*256+X2;
  $  015.二次空气组分母                                                         $    $       $    $  ANS000.BYTE030  $  Y=X1*256+X2;
  $  016.蒸发系统组分子                                                         $    $       $    $  ANS000.BYTE032  $  Y=X1*256+X2;
  $  017.蒸发系统组分母（此数值大于等于75有效）                                 $    $       $    $  ANS000.BYTE034  $  Y=X1*256+X2;
  $  018.后氧组分子Bank（组）1                                                  $    $       $    $  ANS000.BYTE036  $  Y=X1*256+X2;
  $  019.后氧组分母Bank（组）1（此数值大于等于150有效）                         $    $       $    $  ANS000.BYTE038  $  Y=X1*256+X2;
  $  020.后氧组分子Bank（组）2                                                  $    $       $    $  ANS000.BYTE040  $  Y=X1*256+X2;
  $  021.后氧组分母Bank（组）2                                                  $    $       $    $  ANS000.BYTE042  $  Y=X1*256+X2;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
