
    车型ID：2b1b

    模拟：协议模拟-->2b1b

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~250K$~18AA17FF,18A906FF,18A908FF,18A910FF,10AA50A9

进入命令:


空闲命令:


退出命令:



;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:0       $%  ANS000:18AA17FF

  $%  000:厂商：             $%    $%  ANS000.BYTE0-4  $%  if(x==0x00) y=@009c;else if(x==0x01) y=@005f;else if(x==0x02) y=@0083;else if(x==0x03) y=@0084;else if(x==0x04) y=@0085;else if(x==0x05) y=@0086;else if(x==0x06) y=@0087;else if(x==0x07) y=@009d;else if(x==0x08) y=@009e;else if(x==0x0b) y=@009f;else if(x==0x0c) y=@00a0;else if(x==0x15) y=@00a1;else if(x==0x16) y=@00a2;else if(x==0x1F) y=@00a3;else if(x==0x29) y=@00a4;else if(x==0x2a) y=@00a5;else if(x==0x2b) y=@00a6;else if(x==0x33) y=@00a7;else if(x==0x37) y=@00a8;else if(x==0x3d) y=@00a9;else if(x==0x47) y=@00aa;else if(x==0x48) y=@00ab;else if(x==0x51) y=@00ac;else if(x==0x66) y=@00b0;else y=SPRINTF([%d],x);
  $%  001:硬件版本号:        $%    $%  ANS000.BYTE0-2  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  002:软件版本号:        $%    $%  ANS000.BYTE000  $%  y=SPRINTF([V%02X.%02X],X1,X2);
  $%  003:设备唯一码：       $%    $%  ANS000.BYTE000  $%  y=@0123;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:0       $  ANS000:18AA17FF

  $  000.DC-DC(直流-直流)额定输出电流       $    $  A     $    $  ANS000.BYTE0-2  $  y=(x2*0x100+x1)*0.1;
  $  001.DC-DC(直流-直流)额定输出电压       $    $  V     $    $  ANS000.BYTE0-4  $  y=x2*0x100+x1;
  $  002.DC-DC(直流-直流)输出电流           $    $  A     $    $  ANS000.BYTE0-3  $  y=x;
  $  003.DC-DC(直流-直流)输出电压           $    $  V     $    $  ANS000.BYTE0-4  $  y=0.1*x;
  $  004.DC-DC(直流-直流)开启状态           $    $        $    $  ANS000.BYTE0-1  $  if(((x>>0)&1)) y=@000e;else y=@000f;
  $  005.DC-DC(直流-直流)工作状态           $    $        $    $  ANS000.BYTE0-1  $  if(((x>>1)&1)) y=@001e;else y=@001f;
  $  006.DC-DC(直流-直流)输入状态           $    $        $    $  ANS000.BYTE000  $  if((x&0x07)==0)y=@0014; else if((x&0x07)==1)y=@0015; else if((x&0x07)==2)y=@0016;  else if((x&0x07)==4)y=@0017; else if((x&0x07)==5)y=@0018; else if((x&0x07)==6)y=@0019; else y=@0003;
  $  007.DC-DC(直流-直流)输出状态           $    $        $    $  ANS000.BYTE000  $  if((x&0x38)==0)y=@0010; else if((x&0x38)==08)y=@0011; else if((x&0x38)==10)y=@0012;  else if((x&0x38)==20)y=@0013;else y=@0003;
  $  008.DC-DC(直流-直流)温度报警           $    $        $    $  ANS000.BYTE000  $  if(((x>>6)&1))y=@001c;else y=@001d;
  $  009.DC-DC(直流-直流)硬件检测           $    $        $    $  ANS000.BYTE000  $  if(((x>>7)&1))y=@001a;else y=@001b;
  $  010.DC-DC(直流-直流)通讯状态           $    $        $    $  ANS000.BYTE001  $  if(((x>>0)&1))y=@000c;else y=@000d;
  $  011.DC-DC(直流-直流)电池电压状态       $    $        $    $  ANS000.BYTE001  $  if(((x>>1)&1))y=@000a;else y=@000b;
  $  012.DC-DC(直流-直流)使能开关状态       $    $        $    $  ANS000.BYTE0-4  $  if(((x>>0)&1))y=@000e;else y=@000f;

;******************************************************************************************************************************************************

