
    车型ID：5803

    模拟：协议模拟-->5803

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7EA

进入命令:

  $~  REQ000:7E2 02 10 81 FF FF FF FF FF       $~  ANS000:7EA 02 10 81 FF FF FF FF FF

空闲命令:

  $!  REQ000:7E2 02 3E 01 FF FF FF FF FF       $!  ANS000:7EA 02 3E 01 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E2 04 18 00 FF 00 FF FF FF       $#  ANS000:7EA 04 18 00 FF 00 FF FF FF

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE02 控制故障码个数，从$#ANS000.BYTE3$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/58030000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E2 03 14 FF 00 FF FF FF FF       $$  ANS000:7EA 03 14 FF 00 FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E2 02 1A 90 FF FF FF FF FF       $%  ANS000:7EA 02 1A 90 FF FF FF FF FF
  $%  REQ001:7E2 02 1A 93 FF FF FF FF FF       $%  ANS001:7EA 02 1A 93 FF FF FF FF FF
  $%  REQ002:7E2 02 1A 11 FF FF FF FF FF       $%  ANS002:7EA 02 1A 11 FF FF FF FF FF
  $%  REQ003:7E2 02 1A 91 FF FF FF FF FF       $%  ANS003:7EA 02 1A 91 FF FF FF FF FF
  $%  REQ004:7E2 02 1A 98 FF FF FF FF FF       $%  ANS004:7EA 02 1A 98 FF FF FF FF FF
  $%  REQ005:7E2 02 1A 92 FF FF FF FF FF       $%  ANS005:7EA 02 1A 92 FF FF FF FF FF

  $%  000:VIN码:             $%    $%  ANS000.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:硬件版本号:        $%    $%  ANS001.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  002:软件版本号:        $%    $%  ANS002.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  003:零件号:            $%    $%  ANS003.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  004:ECU序列号:         $%    $%  ANS004.BYTE003  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  005:读配置:            $%    $%  ANS005.BYTE003  $%  y=HEX(x1,x2,x3);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读取动态数据流
  $  00.读取动态数据流
  $  REQ000:7E2 02 21 01 FF FF FF FF FF       $  ANS000:7EA 02 21 01 FF FF FF FF FF
  $  REQ001:7E2 02 21 02 FF FF FF FF FF       $  ANS001:7EA 02 21 02 FF FF FF FF FF
  $  REQ002:7E2 02 21 03 FF FF FF FF FF       $  ANS002:7EA 02 21 03 FF FF FF FF FF
  $  REQ003:7E2 02 21 04 FF FF FF FF FF       $  ANS003:7EA 02 21 04 FF FF FF FF FF

  $  000.纯电剩余里程           $    $  km           $    $  ANS000.BYTE003  $  y=x1*256+x2;
  $  001.电机扭矩               $    $  Nm           $    $  ANS000.BYTE005  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/64;
  $  002.电机转速               $    $  rpm          $    $  ANS000.BYTE007  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/2;
  $  003.车速                   $    $  kph          $    $  ANS000.BYTE009  $  y=(x1*256+x2)/256;
  $  004.电池电量               $    $  %            $    $  ANS000.BYTE011  $  y=(x1*256+x2)/256;
  $  005.高压电池电压           $    $  V            $    $  ANS000.BYTE013  $  y=(x1*256+x2)/32;
  $  006.高压电池电流           $    $  A            $    $  ANS000.BYTE015  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/16;
  $  007.小电池电压             $    $  V            $    $  ANS000.BYTE017  $  y=(x1*256+x2)/1024;
  $  008.DCDC负载               $    $  A            $    $  ANS000.BYTE019  $  y=(x1*256+x2)/256;
  $  009.高压电池温度           $    $  degree C     $    $  ANS000.BYTE021  $  y=(x&0x7f)-(x&0x80);
  $  010.MCU控制器温度          $    $  degree C     $    $  ANS000.BYTE022  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  011.电机温度               $    $  degree C     $    $  ANS000.BYTE024  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  012.油门踏板深度           $    $  %            $    $  ANS000.BYTE026  $  y=(x1*256+x2)/256;
  $  013.驾驶员请求扭矩         $    $  Nm           $    $  ANS000.BYTE028  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  014.制动真空压力           $    $  Kpa          $    $  ANS000.BYTE030  $  y=(x1*256+x2)/64;
  $  015.环境温度               $    $  degree C     $    $  ANS000.BYTE034  $  y=(((x1&0x7f)-(x1&0x80))*256+x2)/128;
  $  016.设定输出电压           $    $  V            $    $  ANS000.BYTE036  $  y=(x1*256+x2)/128;
  $  017.点火信号               $    $               $    $  ANS001.BYTE003  $  switxh(x&0x01) 0x01:y=@0048;default: y=@0010;
  $  018.起动信号               $    $               $    $  ANS001.BYTE003  $  switxh(x&0x02) 0x02:y=@0048;default: y=@0010;
  $  019.逆变器使能状态         $    $               $    $  ANS001.BYTE003  $  switxh(x&0x08) 0x08:y=@0048;default: y=@0010;
  $  020.高压电池使能           $    $               $    $  ANS001.BYTE003  $  switxh(x&0x10) 0x10:y=@0048;default: y=@0010;
  $  021.刹车开关               $    $               $    $  ANS001.BYTE003  $  switxh(x&0x20) 0x20:y=@0316;default: y=@0317;
  $  022.制动真空泵使能         $    $               $    $  ANS001.BYTE003  $  switxh(x&0x40) 0x40:y=@0048;default: y=@0010;
  $  023.高压电池连接状态       $    $               $    $  ANS001.BYTE003  $  switxh(x&0x80) 0x80:y=@0175;default: y=@0176;
  $  024.档位信息               $    $               $    $  ANS001.BYTE004  $  switxh(x) 0x00:y=@0313;0x01:y=@0314;0x02:y=@0315;default: y=@0074;
  $  025.高速风扇使能信号       $    $               $    $  ANS001.BYTE005  $  switxh(x&0x04) 0x04:y=@0048;default: y=@0010;
  $  026.低速风扇使能信号       $    $               $    $  ANS001.BYTE005  $  switxh(x&0x08) 0x08:y=@0048;default: y=@0010;
  $  027.PTC使能                $    $               $    $  ANS001.BYTE005  $  switxh(x&0x10) 0x10:y=@0101;default: y=@0123;
  $  028.压缩机使能             $    $               $    $  ANS001.BYTE005  $  switxh(x&0x20) 0x20:y=@0101;default: y=@0123;
  $  029.冷却泵使能             $    $               $    $  ANS001.BYTE005  $  switxh(x&0x40) 0x40:y=@0101;default: y=@0123;
  $  030.电机_MCU环路互锁       $    $               $    $  ANS001.BYTE005  $  switxh(x&0x80) 0x80:y=@0175;default: y=@0075;
  $  031.高压附件环路互锁       $    $               $    $  ANS001.BYTE005  $  switxh(x&0x80) 0x80:y=@0175;default: y=@0075;
  $  032.电池环路互锁           $    $               $    $  ANS001.BYTE006  $  switxh(x&0x02) 0x02:y=@0075;default: y=@0175;
  $  033.DCDC使能               $    $               $    $  ANS001.BYTE006  $  switxh(x&0x04) 0x04:y=@0101;default: y=@0123;
  $  034.气囊状态信号           $    $               $    $  ANS001.BYTE006  $  switxh(x&0x20) 0x20:y=@0309;default: y=@0310;
  $  035.经济模式开关           $    $               $    $  ANS001.BYTE006  $  switxh(x&0x40) 0x40:y=@0311;default: y=@0312;
  $  036.控制器故障模式         $    $               $    $  ANS002.BYTE003  $  switxh(x) 0x01:y=@0297;0x02:y=@0298;0x04:y=@0299;0x08:y=@0300;0x10:y=@0301;0x20:y=@0302;0x40:y=@0303;0x80:y=@0304;default: y=@0074;
  $  037.MCU模式                $    $               $    $  ANS003.BYTE003  $  switxh(x) 0x00:y=@0305;0x02:y=@0184;0x05:y=@0306;0x12:y=@0307;0x1a:y=@0308;0x03:y=@0185;0x01:y=@0042;default: y=@0074;

  $)  01.VCU总线数据监听
  $  01.VCU总线数据监听
;  $  REQ000:7E2       $  ANS000:7EA

;  $  000.电机需求输出扭矩             $    $  Nm       $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.05-300;
;  $  001.电机转速                     $    $  rpm      $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.5-12000;
;  $  002.电机模式                     $    $           $    $  ANS000.BYTE004  $  switxh(x&0x1f) 0x00:y=@0010;0x01:y=@0111;0x02:y=@0287;0x03:y=@0295;0x0a:y=@0286;0x12:y=@0206;default: y=@0074;
;  $  003.电机使能信号                 $    $           $    $  ANS000.BYTE004  $  switxh(x&0x20) 0x20:y=@0101;default: y=@0296;
;  $  004.电池连接状态                 $    $           $    $  ANS000.BYTE004  $  switxh(x&0xc0) 0x00:y=@0123;0x40:y=@0177;0x80:y=@0175;default: y=@0074;
;  $  005.车速                         $    $  km/h     $    $  ANS000.BYTE001  $  y=(x1*256+x2)*0.01;
;  $  006.档位                         $    $           $    $  ANS000.BYTE004  $  switxh(x&0xf0) 0xc0:y=N;0xb0:y=D;0x50:y=N;0x60:y=N+buzz;default: y=@0074;
;  $  007.DCDC使能                     $    $           $    $  ANS000.BYTE005  $  switxh(x&0x20) 0x20:y=on;default: y=0ff;
;  $  008.允许DCDC输出电压             $    $  V        $    $  ANS000.BYTE005  $  y=(x1&3)*256*0.05+x2*0.05;
;  $  009.允许DCDC输出功率             $    $  KW       $    $  ANS000.BYTE007  $  y=x*0.01;
;  $  010.压缩机使能信号               $    $           $    $  ANS000.BYTE000  $  switxh(x&0x20) 0x20:y=@0122;default: y=@0123;
;  $  011.PTC使能信号                  $    $           $    $  ANS000.BYTE000  $  switxh(x&0x80) 0x80:y=@0122;default: y=@0123;
;  $  012.允许空调压缩机输出功率       $    $  KW       $    $  ANS000.BYTE001  $  y=x*0.04;
;  $  013.允许PTC输出功率              $    $  KW       $    $  ANS000.BYTE002  $  y=x*0.04;

  $)  02.VCU2总线数据监听
  $  02.VCU2总线数据监听
;  $  REQ000:7E2       $  ANS000:7EA

;  $  000.续航里程                           $    $  km      $    $  ANS000.BYTE003  $  y=(x1&63)*25.6+x2*0.1;
;  $  001.蓄电池电压                         $    $  V       $    $  ANS000.BYTE006  $  y=x*0.068;
;  $  002.电机转速                           $    $  rpm     $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.5-12000;
;  $  003.制动信号                           $    $          $    $  ANS000.BYTE002  $  switxh(x&0x30) 0x10:y=@0204;0x30:y=@0156;0x00:y=@0294;default: y=@0074;
;  $  004.加速踏板行程                       $    $  %       $    $  ANS000.BYTE003  $  y=x*0.392;
;  $  005.电机当前工作模式                   $    $          $    $  ANS000.BYTE004  $  switxh(x&0xf8) 0x00:y=@0010;0x08:y=@0111;0x10:y=@0290;0x18:y=@0291;0x50:y=@0204;0x58:y=@0292;0x90:y=@0206;0xd0:y=@0293;default: y=@0074;
;  $  006.电机实际输出扭矩                   $    $  Nm      $    $  ANS000.BYTE005  $  y=(x1*256+x2)*0.05-300;
;  $  007.SOC值                              $    $  %       $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.01;
;  $  008.高压母线电流                       $    $  A       $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.05-1600;
;  $  009.电池包电压                         $    $  V       $    $  ANS000.BYTE006  $  y=(x1*256+x2)*0.05;
;  $  010.整车需求扭矩                       $    $  Nm      $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.05-300;
;  $  011.当前允许输出最大驱动扭矩           $    $  Nm      $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.05;
;  $  012.当前允许输出最大能量回收扭矩       $    $  Nm      $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.025-300;
;  $  013.电机扭矩损失                       $    $  Nm      $    $  ANS000.BYTE006  $  y=x/16;

  $)  03.MCU总线数据监听
  $  03.MCU总线数据监听
;  $  REQ000:7E2       $  ANS000:7EA

;  $  000.输入电压               $    $  V            $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.05;
;  $  001.电机当前工作模式       $    $               $    $  ANS000.BYTE004  $  switxh(x&0x7c) 0x00:y=@0010;0x01:y=@0111;0x0a:y=@0286;0x12:y=@0206;0x03:y=@0039;0x02:y=@0287;0x0b:y=@0288;default: y=@0289;
;  $  002.输入电流               $    $  A            $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.05-512;
;  $  003.电机转速               $    $  rpm          $    $  ANS000.BYTE002  $  y=(x1*256+x2)*0.5-12000;
;  $  004.电机温度               $    $  KW           $    $  ANS000.BYTE007  $  y=x-48;
;  $  005.MCU温度                $    $  degree C     $    $  ANS000.BYTE006  $  y=x-48;
;  $  006.最大可输出扭矩         $    $  Nm           $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.05;
;  $  007.电机实际输出扭矩       $    $  Nm           $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.05;
;  $  008.三相环路互锁状态       $    $               $    $  ANS000.BYTE000  $  switxh(x&0x01) 0x01:y=@0175;default: y=@0176;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E2 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
