
    车型ID：5807

    模拟：协议模拟-->5807

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~73E

进入命令:

  $~  REQ000:72E 02 10 03 FF FF FF FF FF       $~  ANS000:73E 02 10 03 FF FF FF FF FF

空闲命令:

  $!  REQ000:72E 02 3E 00 FF FF FF FF FF       $!  ANS000:73E 02 3E 00 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:72E 03 19 02 09 FF FF FF FF       $#  ANS000:73E 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/5a000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:72E 04 14 FF FF FF FF FF FF       $$  ANS000:73E 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:72E 03 22 F1 91 FF FF FF FF       $%  ANS000:73E 03 22 F1 91 FF FF FF FF
  $%  REQ001:72E 03 22 F1 88 FF FF FF FF       $%  ANS001:73E 03 22 F1 88 FF FF FF FF
  $%  REQ002:72E 03 22 F1 8C FF FF FF FF       $%  ANS002:73E 03 22 F1 8C FF FF FF FF
  $%  REQ003:72E 03 22 F1 9D FF FF FF FF       $%  ANS003:73E 03 22 F1 9D FF FF FF FF
  $%  REQ004:72E 03 22 F1 8A FF FF FF FF       $%  ANS004:73E 03 22 F1 8A FF FF FF FF
  $%  REQ005:72E 03 22 F1 99 FF FF FF FF       $%  ANS005:73E 03 22 F1 99 FF FF FF FF
  $%  REQ006:72E 03 22 F1 98 FF FF FF FF       $%  ANS006:73E 03 22 F1 98 FF FF FF FF
  $%  REQ007:72E 03 22 F1 8B FF FF FF FF       $%  ANS007:73E 03 22 F1 8B FF FF FF FF
  $%  REQ008:72E 03 22 F1 80 FF FF FF FF       $%  ANS008:73E 03 22 F1 80 FF FF FF FF

  $%  000:硬件版本号:                       $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  001:应用层软件版本号:                 $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:控制器序列号:                     $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  003:ECU装配日期:                      $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  004:系统供应商代码:                   $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  005:刷新日期:                         $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  006:修复车间代码/测试者序列号:        $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  007:ECU生产日期:                      $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  008:Boot版本号:                       $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读取动态数据流
  $  00.读取动态数据流
  $  REQ000:72E 03 22 02 00 FF FF FF FF       $  ANS000:73E 03 22 02 00 FF FF FF FF
  $  REQ001:72E 03 22 02 01 FF FF FF FF       $  ANS001:73E 03 22 02 01 FF FF FF FF
  $  REQ002:72E 03 22 02 03 FF FF FF FF       $  ANS002:73E 03 22 02 03 FF FF FF FF

  $  000.电池连接状态             $    $         $    $  ANS000.BYTE004  $  y=x;
  $  001.DCDC低压输出请求压       $    $         $    $  ANS001.BYTE004  $  y=x;
  $  002.DCDC功率限制             $    $  KW     $    $  ANS002.BYTE004  $  y=x*0.01;

  $)  01.总线数据监听
  $  01.总线数据监听
;  $  REQ000:72E       $  ANS000:73E

;  $  000.DCDC输入电压                 $    $  V            $    $  ANS000.BYTE000  $  y=x*4*0.05+x2/4*0.05;
;  $  001.DCDC输出电压                 $    $  V            $    $  ANS000.BYTE001  $  y=(x1&3)*256*0.05+x2*0.05;
;  $  002.DCDC输入电流                 $    $  A            $    $  ANS000.BYTE004  $  y=x*0.1;
;  $  003.DCDC输出电流                 $    $  A            $    $  ANS000.BYTE005  $  y=x*16*0.05+x2/16*0.05;
;  $  004.DCDC当前可输出最大功率       $    $  KW           $    $  ANS000.BYTE007  $  y=x*0.01;
;  $  005.DCDC温度                     $    $  degree C     $    $  ANS000.BYTE000  $  y=x-48;
;  $  006.DCDC工作状态                 $    $               $    $  ANS000.BYTE001  $  switxh(x&0xc0) 0x00:y=off;0x40:y=@0221;0x80:y=@0263;0xc0:y=@0156;default: y=@0007;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:72E 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
