
    车型ID：5808

    模拟：协议模拟-->5808

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k$~750

进入命令:

  $~  REQ000:740 02 10 03 FF FF FF FF FF       $~  ANS000:750 02 10 03 FF FF FF FF FF

空闲命令:

  $!  REQ000:740 02 3E 00 FF FF FF FF FF       $!  ANS000:750 02 3E 00 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:740 03 19 02 09 FF FF FF FF       $#  ANS000:750 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/5b000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:740 04 14 FF FF FF FF FF FF       $$  ANS000:750 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:740 03 22 F1 91 FF FF FF FF       $%  ANS000:750 03 22 F1 91 FF FF FF FF
  $%  REQ001:740 03 22 F1 88 FF FF FF FF       $%  ANS001:750 03 22 F1 88 FF FF FF FF
  $%  REQ002:740 03 22 F1 8B FF FF FF FF       $%  ANS002:750 03 22 F1 8B FF FF FF FF
  $%  REQ003:740 03 22 F1 8C FF FF FF FF       $%  ANS003:750 03 22 F1 8C FF FF FF FF
  $%  REQ004:740 03 22 F1 9D FF FF FF FF       $%  ANS004:750 03 22 F1 9D FF FF FF FF
  $%  REQ005:740 03 22 F1 8A FF FF FF FF       $%  ANS005:750 03 22 F1 8A FF FF FF FF
  $%  REQ006:740 03 22 F1 87 FF FF FF FF       $%  ANS006:750 03 22 F1 87 FF FF FF FF
  $%  REQ007:740 03 22 F1 99 FF FF FF FF       $%  ANS007:750 03 22 F1 99 FF FF FF FF
  $%  REQ008:740 03 22 F1 98 FF FF FF FF       $%  ANS008:750 03 22 F1 98 FF FF FF FF
  $%  REQ009:740 03 22 F1 80 FF FF FF FF       $%  ANS009:750 03 22 F1 80 FF FF FF FF

  $%  000:硬件版本号:                   $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  001:软件版本号:                   $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:ECU生产日期:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  003:控制器序列号:                 $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:ECU装配日期:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  005:系统供应商代码:               $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:整车零部件号:                 $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  007:刷新日期:                     $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  008:维修代码/测试仪序列号:        $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  009:Bootloader 软件 ID:           $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:740 03 22 60 01 FF FF FF FF       $  ANS000:750 03 22 60 01 FF FF FF FF
  $  REQ001:740 03 22 60 02 FF FF FF FF       $  ANS001:750 03 22 60 02 FF FF FF FF
  $  REQ002:740 03 22 60 04 FF FF FF FF       $  ANS002:750 03 22 60 04 FF FF FF FF
  $  REQ003:740 03 22 60 05 FF FF FF FF       $  ANS003:750 03 22 60 05 FF FF FF FF
  $  REQ004:740 03 22 60 06 FF FF FF FF       $  ANS004:750 03 22 60 06 FF FF FF FF
  $  REQ005:740 03 22 60 07 FF FF FF FF       $  ANS005:750 03 22 60 07 FF FF FF FF
  $  REQ006:740 03 22 60 14 FF FF FF FF       $  ANS006:750 03 22 60 14 FF FF FF FF
  $  REQ007:740 03 22 60 15 FF FF FF FF       $  ANS007:750 03 22 60 15 FF FF FF FF
  $  REQ008:740 03 22 60 16 FF FF FF FF       $  ANS008:750 03 22 60 16 FF FF FF FF
  $  REQ009:740 03 22 60 17 FF FF FF FF       $  ANS009:750 03 22 60 17 FF FF FF FF
  $  REQ010:740 03 22 60 18 FF FF FF FF       $  ANS010:750 03 22 60 18 FF FF FF FF
  $  REQ011:740 03 22 60 19 FF FF FF FF       $  ANS011:750 03 22 60 19 FF FF FF FF

  $  000.车辆运行模式               $    $       $    $  ANS000.BYTE004  $  switxh(x) 0x01:y=@0182;0x02:y=@0331;default: y=@0059;
  $  001.位置灯                     $    $       $    $  ANS001.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  002.近光灯                     $    $       $    $  ANS001.BYTE004  $  switxh(x&0x08) 0x08:y=@0268;default: y=@0007;
  $  003.自动灯                     $    $       $    $  ANS001.BYTE004  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0007;
  $  004.闪光灯                     $    $       $    $  ANS001.BYTE004  $  switxh(x&0x10) 0x10:y=@0268;default: y=@0007;
  $  005.前雾灯                     $    $       $    $  ANS001.BYTE004  $  switxh(x&0x20) 0x20:y=@0268;default: y=@0007;
  $  006.后雾灯                     $    $       $    $  ANS001.BYTE004  $  switxh(x&0x40) 0x40:y=@0268;default: y=@0007;
  $  007.左转向灯                   $    $       $    $  ANS001.BYTE005  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  008.右转向灯                   $    $       $    $  ANS001.BYTE005  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0007;
  $  009.驾驶员侧右前车窗上升       $    $       $    $  ANS002.BYTE004  $  switxh(x&0x02) 0x02:y=@0268;default: y=@0007;
  $  010.驾驶员侧左后车窗上升       $    $       $    $  ANS002.BYTE004  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0007;
  $  011.驾驶员侧右后车窗上升       $    $       $    $  ANS002.BYTE004  $  switxh(x&0x08) 0x08:y=@0268;default: y=@0007;
  $  012.驾驶员侧左前车窗下降       $    $       $    $  ANS002.BYTE004  $  switxh(x&0x10) 0x10:y=@0268;default: y=@0007;
  $  013.驾驶员侧右前车窗下降       $    $       $    $  ANS002.BYTE004  $  switxh(x&0x20) 0x20:y=@0268;default: y=@0007;
  $  014.驾驶员侧左后车窗下降       $    $       $    $  ANS002.BYTE004  $  switxh(x&0x40) 0x40:y=@0268;default: y=@0007;
  $  015.驾驶员侧右后车窗下降       $    $       $    $  ANS002.BYTE004  $  switxh(x&0x80) 0x80:y=@0268;default: y=@0007;
  $  016.乘客侧右前车窗上升         $    $       $    $  ANS002.BYTE005  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  017.乘客侧左后车窗上升         $    $       $    $  ANS002.BYTE005  $  switxh(x&0x02) 0x02:y=@0268;default: y=@0007;
  $  018.乘客侧右后车窗上升         $    $       $    $  ANS002.BYTE005  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0007;
  $  019.气缸锁解锁                 $    $       $    $  ANS003.BYTE004  $  switxh(x&0x08) 0x08:y=@0268;default: y=@0007;
  $  020.进气                       $    $       $    $  ANS003.BYTE004  $  switxh(x&0x10) 0x10:y=@0268;default: y=@0007;
  $  021.关闭锁开关                 $    $       $    $  ANS003.BYTE004  $  switxh(x&0x20) 0x20:y=@0268;default: y=@0007;
  $  022.左前门未关                 $    $       $    $  ANS004.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  023.右前门未关                 $    $       $    $  ANS004.BYTE004  $  switxh(x&0x02) 0x02:y=@0268;default: y=@0007;
  $  024.左后门未关                 $    $       $    $  ANS004.BYTE004  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0007;
  $  025.右后门未关                 $    $       $    $  ANS004.BYTE004  $  switxh(x&0x08) 0x08:y=@0268;default: y=@0007;
  $  026.发动机舱盖未关             $    $       $    $  ANS004.BYTE004  $  switxh(x&0x10) 0x10:y=@0268;default: y=@0007;
  $  027.后备箱未关                 $    $       $    $  ANS004.BYTE004  $  switxh(x&0x20) 0x20:y=@0268;default: y=@0007;
  $  028.Key In                     $    $       $    $  ANS005.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  029.后备箱解锁                 $    $       $    $  ANS006.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  030.ESCL反馈                   $    $       $    $  ANS007.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  031.碰撞信号                   $    $       $    $  ANS008.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  032.传感器1/2S                 $    $       $    $  ANS009.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  033.传感器1/4S                 $    $       $    $  ANS009.BYTE004  $  switxh(x&0x02) 0x02:y=@0268;default: y=@0007;
  $  034.传感器1/8S                 $    $       $    $  ANS009.BYTE004  $  switxh(x&0x04) 0x04:y=@0268;default: y=@0007;
  $  035.传感器1/13S                $    $       $    $  ANS009.BYTE004  $  switxh(x&0x08) 0x08:y=@0268;default: y=@0007;
  $  036.传感器1/18S                $    $       $    $  ANS009.BYTE004  $  switxh(x&0x10) 0x10:y=@0268;default: y=@0007;
  $  037.喇叭                       $    $       $    $  ANS010.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;
  $  038.后视镜折叠                 $    $       $    $  ANS011.BYTE004  $  switxh(x&0x01) 0x01:y=@0268;default: y=@0007;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:740 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
