
    车型ID：580a

    模拟：协议模拟-->580a

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k$~730

进入命令:

  $~  REQ000:720 02 10 03 FF FF FF FF FF       $~  ANS000:730 02 10 03 FF FF FF FF FF

空闲命令:

  $!  REQ000:720 02 3E 00 FF FF FF FF FF       $!  ANS000:730 02 3E 00 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 FF FF FF FF       $#  ANS000:730 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/58070000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF FF FF FF       $$  ANS000:730 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 91 FF FF FF FF       $%  ANS000:730 03 22 F1 91 FF FF FF FF
  $%  REQ001:720 03 22 F1 88 FF FF FF FF       $%  ANS001:730 03 22 F1 88 FF FF FF FF
  $%  REQ002:720 03 22 F1 8B FF FF FF FF       $%  ANS002:730 03 22 F1 8B FF FF FF FF
  $%  REQ003:720 03 22 F1 8C FF FF FF FF       $%  ANS003:730 03 22 F1 8C FF FF FF FF
  $%  REQ004:720 03 22 F1 9D FF FF FF FF       $%  ANS004:730 03 22 F1 9D FF FF FF FF
  $%  REQ005:720 03 22 F1 9A FF FF FF FF       $%  ANS005:730 03 22 F1 9A FF FF FF FF
  $%  REQ006:720 03 22 F1 87 FF FF FF FF       $%  ANS006:730 03 22 F1 87 FF FF FF FF
  $%  REQ007:720 03 22 F1 99 FF FF FF FF       $%  ANS007:730 03 22 F1 99 FF FF FF FF

  $%  000:硬件版本号:            $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  001:软件版本号:            $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  002:ECU生产日期:           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  003:控制器序列号:          $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  004:ECU装配日期:           $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  005:系统供应商代码:        $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:整车零部件号:          $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  007:刷新日期:              $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.读取动态数据流
  $  00.读取动态数据流
  $  REQ000:720 03 22 40 00 FF FF FF FF       $  ANS000:730 03 22 40 00 FF FF FF FF
  $  REQ001:720 03 22 40 01 FF FF FF FF       $  ANS001:730 03 22 40 01 FF FF FF FF
  $  REQ002:720 03 22 40 02 FF FF FF FF       $  ANS002:730 03 22 40 02 FF FF FF FF
  $  REQ003:720 03 22 40 03 FF FF FF FF       $  ANS003:730 03 22 40 03 FF FF FF FF
  $  REQ004:720 03 22 40 04 FF FF FF FF       $  ANS004:730 03 22 40 04 FF FF FF FF
  $  REQ005:720 03 22 40 05 FF FF FF FF       $  ANS005:730 03 22 40 05 FF FF FF FF
  $  REQ006:720 03 22 40 06 FF FF FF FF       $  ANS006:730 03 22 40 06 FF FF FF FF
  $  REQ007:720 03 22 40 07 FF FF FF FF       $  ANS007:730 03 22 40 07 FF FF FF FF
  $  REQ008:720 03 22 40 08 FF FF FF FF       $  ANS008:730 03 22 40 08 FF FF FF FF

  $  000.左前轮速            $    $  kph     $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.01;
  $  001.右前轮速            $    $  kph     $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.01;
  $  002.左后轮速            $    $  kph     $    $  ANS002.BYTE004  $  y=(x1*256+x2)*0.01;
  $  003.右后轮速            $    $  kph     $    $  ANS003.BYTE004  $  y=(x1*256+x2)*0.01;
  $  004.车速                $    $  kph     $    $  ANS004.BYTE004  $  y=(x1*256+x2)*0.01;
  $  005.电压                $    $  V       $    $  ANS005.BYTE004  $  y=x*0.1;
  $  006.制动状态            $    $          $    $  ANS006.BYTE004  $  switxh(x) 0x00:y=@0332;0xff:y=@0333;default: y=@0289;
  $  007.阀指令状态          $    $          $    $  ANS007.BYTE004  $  switxh(x) 0x00:y=@0100;0x01:y=@0326;default: y=@0289;
  $  008.ABS指示灯开关       $    $          $    $  ANS008.BYTE004  $  switxh(x&0x01) 0x01:y=@0326;default: y=@0100;
  $  009.EBD指示灯开关       $    $          $    $  ANS008.BYTE004  $  switxh(x&0x02) 0x02:y=@0326;default: y=@0100;
  $  010.电机开关            $    $          $    $  ANS008.BYTE004  $  switxh(x&0x04) 0x04:y=@0326;default: y=@0100;
  $  011.继电器开关          $    $          $    $  ANS008.BYTE004  $  switxh(x&0x08) 0x08:y=@0326;default: y=@0100;

  $)  01.总线数据监听
  $  01.总线数据监听
;  $  REQ000:720       $  ANS000:730

;  $  000.原始车速                 $    $  km/h     $    $  ANS000.BYTE000  $  y=(x1*256+x2)*0.01;
;  $  001.防抱死功能启动状态       $    $           $    $  ANS000.BYTE003  $  switxh(x&0x04) 0x04:y=@0151;default: y=@0278;
;  $  002.左前轮速度               $    $  km/h     $    $  ANS000.BYTE000  $  y=x*4*0.063+x2/4*0.063;
;  $  003.右后轮速度               $    $  km/h     $    $  ANS000.BYTE002  $  y=x*4*0.063+x2/4*0.063;
;  $  004.右前轮速度               $    $  km/h     $    $  ANS000.BYTE000  $  y=x*4*0.063+x2/4*0.063;
;  $  005.左后轮速度               $    $  km/h     $    $  ANS000.BYTE002  $  y=x*4*0.063+x2/4*0.063;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
