
    车型ID：5813

    模拟：协议模拟-->5813

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~717

进入命令:

  $~  REQ000:707 02 10 03 FF FF FF FF FF       $~  ANS000:717 02 10 03 FF FF FF FF FF

空闲命令:

  $!  REQ000:707 02 3E 00 FF FF FF FF FF       $!  ANS000:717 02 3E 00 FF FF FF FF FF

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:707 03 19 02 09 FF FF FF FF       $#  ANS000:717 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/580e0000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:707 04 14 FF FF FF FF FF FF       $$  ANS000:717 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:707 03 22 F1 90 FF FF FF FF       $%  ANS000:717 03 22 F1 90 FF FF FF FF
  $%  REQ001:707 03 22 F1 87 FF FF FF FF       $%  ANS001:717 03 22 F1 87 FF FF FF FF
  $%  REQ002:707 03 22 F1 8A FF FF FF FF       $%  ANS002:717 03 22 F1 8A FF FF FF FF
  $%  REQ003:707 03 22 F1 8B FF FF FF FF       $%  ANS003:717 03 22 F1 8B FF FF FF FF
  $%  REQ004:707 03 22 F1 9D FF FF FF FF       $%  ANS004:717 03 22 F1 9D FF FF FF FF
  $%  REQ005:707 03 22 F1 8C FF FF FF FF       $%  ANS005:717 03 22 F1 8C FF FF FF FF
  $%  REQ006:707 03 22 F1 91 FF FF FF FF       $%  ANS006:717 03 22 F1 91 FF FF FF FF
  $%  REQ007:707 03 22 F1 88 FF FF FF FF       $%  ANS007:717 03 22 F1 88 FF FF FF FF
  $%  REQ008:707 03 22 F1 99 FF FF FF FF       $%  ANS008:717 03 22 F1 99 FF FF FF FF
  $%  REQ009:707 03 22 F1 98 FF FF FF FF       $%  ANS009:717 03 22 F1 98 FF FF FF FF
  $%  REQ010:707 03 22 F1 B0 FF FF FF FF       $%  ANS010:717 03 22 F1 B0 FF FF FF FF
  $%  REQ011:707 03 22 F1 BF FF FF FF FF       $%  ANS011:717 03 22 F1 BF FF FF FF FF
  $%  REQ012:707 03 22 F1 80 FF FF FF FF       $%  ANS012:717 03 22 F1 80 FF FF FF FF
  $%  REQ013:707 03 22 F2 00 FF FF FF FF       $%  ANS013:717 03 22 F2 00 FF FF FF FF

  $%  000:VIN码:                             $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:整车零部件号:                      $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  002:系统供应商代码:                    $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  003:ECU生产日期:                       $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  004:ECU装配日期:                       $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  005:控制器序列号:                      $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  006:硬件版本号:                        $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  007:软件版本号(正常升级版本):          $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  008:刷新日期:                          $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%02x%02x/%02x/%02x],x1,x2,x3,x4);
  $%  009:维修店代码或诊断设备序列号:        $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  010:软件版本号(固定版本):              $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  011:硬件版本号(固定版本):              $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  012:Bootloader软件版本号:              $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  013:电机编码:                          $%    $%  ANS013.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:707 03 22 08 19 FF FF FF FF       $  ANS000:717 03 22 08 19 FF FF FF FF
  $  REQ001:707 03 22 08 1D FF FF FF FF       $  ANS001:717 03 22 08 1D FF FF FF FF
  $  REQ002:707 03 22 08 12 FF FF FF FF       $  ANS002:717 03 22 08 12 FF FF FF FF
  $  REQ003:707 03 22 08 01 FF FF FF FF       $  ANS003:717 03 22 08 01 FF FF FF FF
  $  REQ004:707 03 22 08 10 FF FF FF FF       $  ANS004:717 03 22 08 10 FF FF FF FF
  $  REQ005:707 03 22 08 02 FF FF FF FF       $  ANS005:717 03 22 08 02 FF FF FF FF
  $  REQ006:707 03 22 08 03 FF FF FF FF       $  ANS006:717 03 22 08 03 FF FF FF FF
  $  REQ007:707 03 22 08 04 FF FF FF FF       $  ANS007:717 03 22 08 04 FF FF FF FF
  $  REQ008:707 03 22 08 05 FF FF FF FF       $  ANS008:717 03 22 08 05 FF FF FF FF
  $  REQ009:707 03 22 08 06 FF FF FF FF       $  ANS009:717 03 22 08 06 FF FF FF FF
  $  REQ010:707 03 22 08 07 FF FF FF FF       $  ANS010:717 03 22 08 07 FF FF FF FF
  $  REQ011:707 03 22 08 08 FF FF FF FF       $  ANS011:717 03 22 08 08 FF FF FF FF
  $  REQ012:707 03 22 08 09 FF FF FF FF       $  ANS012:717 03 22 08 09 FF FF FF FF
  $  REQ013:707 03 22 08 0A FF FF FF FF       $  ANS013:717 03 22 08 0A FF FF FF FF
  $  REQ014:707 03 22 08 0B FF FF FF FF       $  ANS014:717 03 22 08 0B FF FF FF FF
  $  REQ015:707 03 22 08 0C FF FF FF FF       $  ANS015:717 03 22 08 0C FF FF FF FF
  $  REQ016:707 03 22 08 0D FF FF FF FF       $  ANS016:717 03 22 08 0D FF FF FF FF
  $  REQ017:707 03 22 08 0E FF FF FF FF       $  ANS017:717 03 22 08 0E FF FF FF FF
  $  REQ018:707 03 22 08 0F FF FF FF FF       $  ANS018:717 03 22 08 0F FF FF FF FF
  $  REQ019:707 03 22 08 11 FF FF FF FF       $  ANS019:717 03 22 08 11 FF FF FF FF
  $  REQ020:707 03 22 08 13 FF FF FF FF       $  ANS020:717 03 22 08 13 FF FF FF FF
  $  REQ021:707 03 22 08 14 FF FF FF FF       $  ANS021:717 03 22 08 14 FF FF FF FF
  $  REQ022:707 03 22 08 15 FF FF FF FF       $  ANS022:717 03 22 08 15 FF FF FF FF
  $  REQ023:707 03 22 08 16 FF FF FF FF       $  ANS023:717 03 22 08 16 FF FF FF FF
  $  REQ024:707 03 22 08 17 FF FF FF FF       $  ANS024:717 03 22 08 17 FF FF FF FF
  $  REQ025:707 03 22 08 18 FF FF FF FF       $  ANS025:717 03 22 08 18 FF FF FF FF
  $  REQ026:707 03 22 08 1E FF FF FF FF       $  ANS026:717 03 22 08 1E FF FF FF FF
  $  REQ027:707 03 22 08 1F FF FF FF FF       $  ANS027:717 03 22 08 1F FF FF FF FF
  $  REQ028:707 03 22 08 20 FF FF FF FF       $  ANS028:717 03 22 08 20 FF FF FF FF
  $  REQ029:707 03 22 08 21 FF FF FF FF       $  ANS029:717 03 22 08 21 FF FF FF FF
  $  REQ030:707 03 22 08 22 FF FF FF FF       $  ANS030:717 03 22 08 22 FF FF FF FF
  $  REQ031:707 03 22 08 23 FF FF FF FF       $  ANS031:717 03 22 08 23 FF FF FF FF
  $  REQ032:707 03 22 08 24 FF FF FF FF       $  ANS032:717 03 22 08 24 FF FF FF FF
  $  REQ033:707 03 22 08 25 FF FF FF FF       $  ANS033:717 03 22 08 25 FF FF FF FF
  $  REQ034:707 03 22 08 26 FF FF FF FF       $  ANS034:717 03 22 08 26 FF FF FF FF
  $  REQ035:707 03 22 08 27 FF FF FF FF       $  ANS035:717 03 22 08 27 FF FF FF FF
  $  REQ036:707 03 22 08 2B FF FF FF FF       $  ANS036:717 03 22 08 2B FF FF FF FF
  $  REQ037:707 03 22 08 2C FF FF FF FF       $  ANS037:717 03 22 08 2C FF FF FF FF
  $  REQ038:707 03 22 08 2D FF FF FF FF       $  ANS038:717 03 22 08 2D FF FF FF FF

  $  000.钥匙信号                             $    $               $    $  ANS000.BYTE004  $  y=x;
  $  001.12蓄电池电压                         $    $  V            $    $  ANS001.BYTE004  $  y=x1*256+x2-12;
  $  002.直流母线电压                         $    $  V            $    $  ANS002.BYTE004  $  y=x1*256+x2-500;
  $  003.MCU使能命令                          $    $               $    $  ANS003.BYTE004  $  y=x;
  $  004.电机电流有效值                       $    $  A            $    $  ANS004.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  005.目标工作模式                         $    $               $    $  ANS005.BYTE004  $  y=x;
  $  006.目标转矩命令                         $    $  Nm           $    $  ANS006.BYTE004  $  y=x1*256+x2-500;
  $  007.目标转速命令                         $    $  r/min        $    $  ANS007.BYTE004  $  y=x1*256+x2-12000;
  $  008.档位信号                             $    $               $    $  ANS008.BYTE004  $  y=x;
  $  009.主动放电命令                         $    $               $    $  ANS009.BYTE004  $  y=x;
  $  010.防溜坡命令                           $    $               $    $  ANS010.BYTE004  $  y=x;
  $  011.实际工作模式                         $    $               $    $  ANS011.BYTE004  $  y=x;
  $  012.实际反馈转矩                         $    $  Nm           $    $  ANS012.BYTE004  $  y=x1*256+x2-500;
  $  013.实际反馈转速                         $    $  r/min        $    $  ANS013.BYTE004  $  y=x1*256+x2-12000;
  $  014.旋变初始偏移位置                     $    $  degree       $    $  ANS014.BYTE004  $  y=(x1*256+x2)*0.1-360;
  $  015.Id给定值                             $    $  A            $    $  ANS015.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  016.Id实际值                             $    $  A            $    $  ANS016.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  017.Iq给定值                             $    $  A            $    $  ANS017.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  018.Iq实际值                             $    $  A            $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  019.允许最大输出转矩                     $    $  Nm           $    $  ANS019.BYTE004  $  y=x1*256+x2-500;
  $  020.U相电流                              $    $  A            $    $  ANS020.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  021.V相电流                              $    $  A            $    $  ANS021.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  022.W相电流                              $    $  A            $    $  ANS022.BYTE004  $  y=(x1*256+x2)*0.125-1000;
  $  023.IGBT温度                             $    $  degree C     $    $  ANS023.BYTE004  $  y=x-40;
  $  024.电机温度                             $    $  degree C     $    $  ANS024.BYTE004  $  y=x-40;
  $  025.PWM载波频率                          $    $  Hz           $    $  ANS025.BYTE004  $  y=x1*256+x2;
  $  026.旋变故障码                           $    $               $    $  ANS026.BYTE004  $  y=x;
  $  027.输入到电机模块的直流电压             $    $  V            $    $  ANS027.BYTE004  $  y=x1*256+x2-500;
  $  028.输入到电机模块的直流电压的倒数       $    $  V            $    $  ANS028.BYTE004  $  y=(x1*256+x2)*0.01-500;
  $  029.输入到电机模块的运行模式             $    $               $    $  ANS029.BYTE004  $  y=x;
  $  030.输入到电机模块的转矩指令             $    $  Nm           $    $  ANS030.BYTE004  $  y=x1*256+x2-500;
  $  031.输入到电机模块的速度指令             $    $  r/min        $    $  ANS031.BYTE004  $  y=x1*256+x2-12000;
  $  032.输入到电机模块的速度反馈             $    $  r/min        $    $  ANS032.BYTE004  $  y=x1*256+x2-12000;
  $  033.电机模块最终给定速度                 $    $  r/min        $    $  ANS033.BYTE004  $  y=x1*256+x2-12000;
  $  034.电机模块反馈转矩                     $    $  Nm           $    $  ANS034.BYTE004  $  y=x1*256+x2-500;
  $  035.电机模块最终给定转矩                 $    $  Nm           $    $  ANS035.BYTE004  $  y=x1*256+x2-500;
  $  036.MCU总故障编码0                       $    $               $    $  ANS036.BYTE004  $  y=x1*256+x2;
  $  037.MCU总故障编码1                       $    $               $    $  ANS037.BYTE004  $  y=x1*256+x2;
  $  038.上下电状态                           $    $               $    $  ANS038.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:707 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
