
    车型ID：5844

    模拟：协议模拟-->5844

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~774

进入命令:

  $~  REQ000:764 02 10 03 FF FF FF FF FF       $~  ANS000:774 02 10 03 FF FF FF FF FF
  $~  REQ001:764 02 27 03 FF FF FF FF FF       $~  ANS001:774 02 27 03 FF FF FF FF FF
  $~  REQ002:764 04 27 04 1E B0 FF FF FF       $~  ANS002:774 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:764 02 3E 00 FF FF FF FF FF       $!  ANS000:774 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:764 02 10 01 FF FF FF FF FF       $@  ANS000:774 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:764 03 19 02 09 FF FF FF FF       $#  ANS000:774 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/80000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:764 04 14 FF FF FF FF FF FF       $$  ANS000:774 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:764 03 22 F1 80 FF FF FF FF       $%  ANS000:774 03 22 F1 80 FF FF FF FF
  $%  REQ001:764 03 22 F1 86 FF FF FF FF       $%  ANS001:774 03 22 F1 86 FF FF FF FF
  $%  REQ002:764 03 22 F1 87 FF FF FF FF       $%  ANS002:774 03 22 F1 87 FF FF FF FF
  $%  REQ003:764 03 22 F1 88 FF FF FF FF       $%  ANS003:774 03 22 F1 88 FF FF FF FF
  $%  REQ004:764 03 22 F1 B0 FF FF FF FF       $%  ANS004:774 03 22 F1 B0 FF FF FF FF
  $%  REQ005:764 03 22 F1 A2 FF FF FF FF       $%  ANS005:774 03 22 F1 A2 FF FF FF FF
  $%  REQ006:764 03 22 F1 8A FF FF FF FF       $%  ANS006:774 03 22 F1 8A FF FF FF FF
  $%  REQ007:764 03 22 F1 8B FF FF FF FF       $%  ANS007:774 03 22 F1 8B FF FF FF FF
  $%  REQ008:764 03 22 F1 8C FF FF FF FF       $%  ANS008:774 03 22 F1 8C FF FF FF FF
  $%  REQ009:764 03 22 F1 90 FF FF FF FF       $%  ANS009:774 03 22 F1 90 FF FF FF FF
  $%  REQ010:764 03 22 F1 91 FF FF FF FF       $%  ANS010:774 03 22 F1 91 FF FF FF FF
  $%  REQ011:764 03 22 F1 98 FF FF FF FF       $%  ANS011:774 03 22 F1 98 FF FF FF FF
  $%  REQ012:764 03 22 F1 99 FF FF FF FF       $%  ANS012:774 03 22 F1 99 FF FF FF FF
  $%  REQ013:764 03 22 F1 9D FF FF FF FF       $%  ANS013:774 03 22 F1 9D FF FF FF FF
  $%  REQ014:764 03 22 F1 BF FF FF FF FF       $%  ANS014:774 03 22 F1 BF FF FF FF FF
  $%  REQ015:764 03 22 F1 C0 FF FF FF FF       $%  ANS015:774 03 22 F1 C0 FF FF FF FF
  $%  REQ016:764 03 22 C1 01 FF FF FF FF       $%  ANS016:774 03 22 C1 01 FF FF FF FF
  $%  REQ017:764 03 22 C1 06 FF FF FF FF       $%  ANS017:774 03 22 C1 06 FF FF FF FF

  $%  000:软件版本号:                              $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                        $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                            $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号:                          $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:              $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:ECU标定软件号:                           $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2);
  $%  006:系统供应商代码:                          $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  007:ECU生产日期:                             $%    $%  ANS007.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  008:控制器序列号:                            $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  009:整车VIN:                                 $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  010:硬件版本号:                              $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  011:诊断设备序列号:                          $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  012:刷新日期:                                $%    $%  ANS012.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  013:ECU装配日期:                             $%    $%  ANS013.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  014:硬件版本号（固定版本）:                  $%    $%  ANS014.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  015:软件总成版本:                            $%    $%  ANS015.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  016:尾门控制器当前设定的定义开门位置:        $%    $%  ANS016.BYTE004  $%  y=x1*256+x2;
  $%  017:尾门控制器标定参数:                      $%    $%  ANS017.BYTE004  $%  y=x;

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:764 03 22 F0 20 FF FF FF FF       $  ANS000:774 03 22 F0 20 FF FF FF FF
  $  REQ001:764 03 22 F0 22 FF FF FF FF       $  ANS001:774 03 22 F0 22 FF FF FF FF
  $  REQ002:764 03 22 F0 23 FF FF FF FF       $  ANS002:774 03 22 F0 23 FF FF FF FF
  $  REQ003:764 03 22 F0 24 FF FF FF FF       $  ANS003:774 03 22 F0 24 FF FF FF FF
  $  REQ004:764 03 22 F0 43 FF FF FF FF       $  ANS004:774 03 22 F0 43 FF FF FF FF

  $  000.尾门当前的开门位置             $    $       $    $  ANS000.BYTE004  $  y=((x1&0x7f)-(x1&0x80))*256+x2;
  $  001.尾门控制器当前温度             $    $       $    $  ANS001.BYTE004  $  y=x-60;
  $  002.尾门控制器当前电压             $    $       $    $  ANS002.BYTE004  $  y=x;
  $  003.尾门控制器当前故障码信息       $    $       $    $  ANS003.BYTE004  $  y=(x1*256+x2)*65536+x3*256+x4;
  $  004.二级锁状态                     $    $       $    $  ANS004.BYTE004  $  switxh(x&0x80) 0x80:y=@0010;default: y=@0048;
  $  005.一级锁状态                     $    $       $    $  ANS004.BYTE004  $  switxh(x&0x40) 0x40:y=@0010;default: y=@0048;
  $  006.自学习状态                     $    $       $    $  ANS004.BYTE004  $  switxh(x&0x30) 0x00:y=@0049;0x10:y=@0050;0x20:y=@0051;default: y=@0007;
  $  007.设防状态                       $    $       $    $  ANS004.BYTE004  $  switxh(x&0x08) 0x08:y=@0044;default: y=@0045;
  $  008.是否工厂模式                   $    $       $    $  ANS004.BYTE004  $  switxh(x&0x04) 0x04:y=@0046;default: y=@0047;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:764 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
