
    车型ID：584b

    模拟：协议模拟-->584b

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~75B

进入命令:

  $~  REQ000:74B 02 10 03 FF FF FF FF FF       $~  ANS000:75B 02 10 03 FF FF FF FF FF
  $~  REQ001:74B 02 27 03 FF FF FF FF FF       $~  ANS001:75B 02 27 03 FF FF FF FF FF
  $~  REQ002:74B 04 27 04 1E B0 FF FF FF       $~  ANS002:75B 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:74B 02 3E 00 FF FF FF FF FF       $!  ANS000:75B 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:74B 02 10 01 FF FF FF FF FF       $@  ANS000:75B 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:74B 03 19 02 09 FF FF FF FF       $#  ANS000:75B 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/87000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:74B 04 14 FF FF FF FF FF FF       $$  ANS000:75B 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:74B 03 22 F1 80 FF FF FF FF       $%  ANS000:75B 03 22 F1 80 FF FF FF FF
  $%  REQ001:74B 03 22 F1 86 FF FF FF FF       $%  ANS001:75B 03 22 F1 86 FF FF FF FF
  $%  REQ002:74B 03 22 F1 87 FF FF FF FF       $%  ANS002:75B 03 22 F1 87 FF FF FF FF
  $%  REQ003:74B 03 22 F1 88 FF FF FF FF       $%  ANS003:75B 03 22 F1 88 FF FF FF FF
  $%  REQ004:74B 03 22 F1 B0 FF FF FF FF       $%  ANS004:75B 03 22 F1 B0 FF FF FF FF
  $%  REQ005:74B 03 22 F1 A2 FF FF FF FF       $%  ANS005:75B 03 22 F1 A2 FF FF FF FF
  $%  REQ006:74B 03 22 F1 8A FF FF FF FF       $%  ANS006:75B 03 22 F1 8A FF FF FF FF
  $%  REQ007:74B 03 22 F1 8B FF FF FF FF       $%  ANS007:75B 03 22 F1 8B FF FF FF FF
  $%  REQ008:74B 03 22 F1 8C FF FF FF FF       $%  ANS008:75B 03 22 F1 8C FF FF FF FF
  $%  REQ009:74B 03 22 F1 90 FF FF FF FF       $%  ANS009:75B 03 22 F1 90 FF FF FF FF
  $%  REQ010:74B 03 22 F1 91 FF FF FF FF       $%  ANS010:75B 03 22 F1 91 FF FF FF FF
  $%  REQ011:74B 03 22 F1 98 FF FF FF FF       $%  ANS011:75B 03 22 F1 98 FF FF FF FF
  $%  REQ012:74B 03 22 F1 99 FF FF FF FF       $%  ANS012:75B 03 22 F1 99 FF FF FF FF
  $%  REQ013:74B 03 22 F1 9D FF FF FF FF       $%  ANS013:75B 03 22 F1 9D FF FF FF FF

  $%  000:软件版本号:                        $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                  $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                      $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号:                    $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:        $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:ECU标定软件号:                     $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  006:系统供应商代码:                    $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  007:ECU生产日期:                       $%    $%  ANS007.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  008:控制器序列号:                      $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  009:整车VIN:                           $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  010:硬件版本号:                        $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  011:诊断设备序列号:                    $%    $%  ANS011.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  012:刷新日期:                          $%    $%  ANS012.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  013:ECU装配日期:                       $%    $%  ANS013.BYTE004  $%  y=HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:74B 03 22 63 00 FF FF FF FF       $  ANS000:75B 03 22 63 00 FF FF FF FF
  $  REQ001:74B 03 22 63 02 FF FF FF FF       $  ANS001:75B 03 22 63 02 FF FF FF FF
  $  REQ002:74B 03 22 63 03 FF FF FF FF       $  ANS002:75B 03 22 63 03 FF FF FF FF
  $  REQ003:74B 03 22 63 04 FF FF FF FF       $  ANS003:75B 03 22 63 04 FF FF FF FF
  $  REQ004:74B 03 22 63 05 FF FF FF FF       $  ANS004:75B 03 22 63 05 FF FF FF FF
  $  REQ005:74B 03 22 63 06 FF FF FF FF       $  ANS005:75B 03 22 63 06 FF FF FF FF
  $  REQ006:74B 03 22 63 07 FF FF FF FF       $  ANS006:75B 03 22 63 07 FF FF FF FF
  $  REQ007:74B 03 22 63 08 FF FF FF FF       $  ANS007:75B 03 22 63 08 FF FF FF FF
  $  REQ008:74B 03 22 63 09 FF FF FF FF       $  ANS008:75B 03 22 63 09 FF FF FF FF
  $  REQ009:74B 03 22 63 10 FF FF FF FF       $  ANS009:75B 03 22 63 10 FF FF FF FF
  $  REQ010:74B 03 22 63 12 FF FF FF FF       $  ANS010:75B 03 22 63 12 FF FF FF FF
  $  REQ011:74B 03 22 63 17 FF FF FF FF       $  ANS011:75B 03 22 63 17 FF FF FF FF
  $  REQ012:74B 03 22 63 18 FF FF FF FF       $  ANS012:75B 03 22 63 18 FF FF FF FF
  $  REQ013:74B 03 22 63 19 FF FF FF FF       $  ANS013:75B 03 22 63 19 FF FF FF FF

  $  000.驾驶员侧温度风门位置             $    $  %       $    $  ANS000.BYTE004  $  y=x;
  $  001.模式风门位置                     $    $          $    $  ANS001.BYTE004  $  switxh(x) 0x01:y=@0016;0x02:y=@0017;0x03:y=@0018;0x04:y=@0019;0x05:y=@0020;default: y=-;
  $  002.内外循环模式                     $    $          $    $  ANS002.BYTE004  $  switxh(x) 0x00:y=@0079;0x01:y=@0080;default: y=-;
  $  003.鼓风机档位                       $    $          $    $  ANS003.BYTE004  $  switxh(x) 0x01:y=@0081;0x02:y=@0082;0x03:y=@0083;0x04:y=@0084;0x05:y=@0085;0x06:y=@0086;0x07:y=@0087;default: y=-;
  $  004.电动压缩机状态                   $    $          $    $  ANS004.BYTE004  $  switxh(x) 0x00:y=@0013;0x01:y=@0014;0x02:y=@0015;default: y=-;
  $  005.PM2.5传感器值                    $    $          $    $  ANS005.BYTE004  $  y=x;
  $  006.负离子开启状态                   $    $          $    $  ANS006.BYTE004  $  switxh(x) 0x00:y=@0010;0x01:y=@0048;default: y=-;
  $  007.PTC工作状态                      $    $          $    $  ANS007.BYTE004  $  switxh(x) 0x00:y=@0013;0x01:y=@0014;0x02:y=@0015;default: y=-;
  $  008.电子膨胀阀开度步数               $    $  步      $    $  ANS008.BYTE004  $  y=x;
  $  009.热管理电磁阀状态                 $    $          $    $  ANS009.BYTE004  $  switxh(x) 0x00:y=@0077;0x01:y=@0078;default: y=-;
  $  010.空调高低速电子风扇运转状态       $    $          $    $  ANS010.BYTE004  $  switxh(x) 0x00:y=@0010;0x01:y=@0011;0x02:y=@0012;default: y=-;
  $  011.高压端压力传感器压力             $    $  MPa     $    $  ANS011.BYTE004  $  y=x;
  $  012.HVAC电磁阀状态                   $    $          $    $  ANS012.BYTE004  $  switxh(x) 0x00:y=@0075;0x01:y=@0076;default: y=-;
  $  013.三通水阀位置                     $    $  %       $    $  ANS013.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:74B 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
