
    车型ID：584f

    模拟：协议模拟-->584f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~777

进入命令:

  $~  REQ000:767 02 10 03 FF FF FF FF FF       $~  ANS000:777 02 10 03 FF FF FF FF FF
  $~  REQ001:767 02 27 03 FF FF FF FF FF       $~  ANS001:777 02 27 03 FF FF FF FF FF
  $~  REQ002:767 04 27 04 1E B0 FF FF FF       $~  ANS002:777 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:767 02 3E 00 FF FF FF FF FF       $!  ANS000:777 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:767 02 10 01 FF FF FF FF FF       $@  ANS000:777 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:767 03 19 02 09 FF FF FF FF       $#  ANS000:777 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/8b000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:767 04 14 FF FF FF FF FF FF       $$  ANS000:777 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:767 03 22 F1 80 FF FF FF FF       $%  ANS000:777 03 22 F1 80 FF FF FF FF
  $%  REQ001:767 03 22 F1 86 FF FF FF FF       $%  ANS001:777 03 22 F1 86 FF FF FF FF
  $%  REQ002:767 03 22 F1 87 FF FF FF FF       $%  ANS002:777 03 22 F1 87 FF FF FF FF
  $%  REQ003:767 03 22 F1 88 FF FF FF FF       $%  ANS003:777 03 22 F1 88 FF FF FF FF
  $%  REQ004:767 03 22 F1 B0 FF FF FF FF       $%  ANS004:777 03 22 F1 B0 FF FF FF FF
  $%  REQ005:767 03 22 F1 8A FF FF FF FF       $%  ANS005:777 03 22 F1 8A FF FF FF FF
  $%  REQ006:767 03 22 F1 8B FF FF FF FF       $%  ANS006:777 03 22 F1 8B FF FF FF FF
  $%  REQ007:767 03 22 F1 8C FF FF FF FF       $%  ANS007:777 03 22 F1 8C FF FF FF FF
  $%  REQ008:767 03 22 F1 90 FF FF FF FF       $%  ANS008:777 03 22 F1 90 FF FF FF FF
  $%  REQ009:767 03 22 F1 91 FF FF FF FF       $%  ANS009:777 03 22 F1 91 FF FF FF FF
  $%  REQ010:767 03 22 F1 99 FF FF FF FF       $%  ANS010:777 03 22 F1 99 FF FF FF FF
  $%  REQ011:767 03 22 F1 9D FF FF FF FF       $%  ANS011:777 03 22 F1 9D FF FF FF FF
  $%  REQ012:767 03 22 55 11 FF FF FF FF       $%  ANS012:777 03 22 55 11 FF FF FF FF
  $%  REQ013:767 03 22 55 12 FF FF FF FF       $%  ANS013:777 03 22 55 12 FF FF FF FF
  $%  REQ014:767 03 22 55 13 FF FF FF FF       $%  ANS014:777 03 22 55 13 FF FF FF FF
  $%  REQ015:767 03 22 55 14 FF FF FF FF       $%  ANS015:777 03 22 55 14 FF FF FF FF
  $%  REQ016:767 03 22 55 15 FF FF FF FF       $%  ANS016:777 03 22 55 15 FF FF FF FF
  $%  REQ017:767 03 22 90 0F FF FF FF FF       $%  ANS017:777 03 22 90 0F FF FF FF FF

  $%  000:软件版本号:                            $%    $%  ANS000.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  001:当前诊断任务模式:                      $%    $%  ANS001.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  002:整车零部件号:                          $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  003:应用软件版本号（正常升级版本）:        $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:应用软件版本号（固定版本）:            $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商代码:                        $%    $%  ANS005.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  006:ECU生产日期:                           $%    $%  ANS006.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  007:控制器序列号:                          $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  008:整车VIN:                               $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  009:应用硬件版本号（固定版本）:            $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  010:刷新日期:                              $%    $%  ANS010.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  011:ECU装配日期:                           $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  012:应用硬件版本号（固定版本）:            $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  013:MAC地址:                               $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12);
  $%  014:蓝牙SDK版本:                           $%    $%  ANS013.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  015:蓝牙协议版本:                          $%    $%  ANS014.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  016:蓝牙KEY:                               $%    $%  ANS015.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $%  017:工厂代码:                              $%    $%  ANS016.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  018:ESK:                                   $%    $%  ANS017.BYTE004  $%  y=HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:767 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
