
    车型ID：585c

    模拟：协议模拟-->585c

;******************************************************************************************************************************************************

    通讯线: $~01$~09$~500k$~756

进入命令:

  $~  REQ000:746 02 10 03 FF FF FF FF FF       $~  ANS000:756 02 10 03 FF FF FF FF FF
  $~  REQ001:746 02 27 03 FF FF FF FF FF       $~  ANS001:756 02 27 03 FF FF FF FF FF
  $~  REQ002:746 04 27 04 1E B0 FF FF FF       $~  ANS002:756 04 27 04 1E B0 FF FF FF

空闲命令:

  $!  REQ000:746 02 3E 00 FF FF FF FF FF       $!  ANS000:756 02 3E 00 FF FF FF FF FF

退出命令:

  $@  REQ000:746 02 10 01 FF FF FF FF FF       $@  ANS000:756 02 10 01 FF FF FF FF FF


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:746 03 19 02 09 FF FF FF FF       $#  ANS000:756 03 19 02 09 FF FF FF FF

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/96000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:746 04 14 FF FF FF FF FF FF       $$  ANS000:756 04 14 FF FF FF FF FF FF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:746 03 22 F1 86 FF FF FF FF       $%  ANS000:756 03 22 F1 86 FF FF FF FF
  $%  REQ001:746 03 22 F1 87 FF FF FF FF       $%  ANS001:756 03 22 F1 87 FF FF FF FF
  $%  REQ002:746 03 22 F1 88 FF FF FF FF       $%  ANS002:756 03 22 F1 88 FF FF FF FF
  $%  REQ003:746 03 22 F1 B0 FF FF FF FF       $%  ANS003:756 03 22 F1 B0 FF FF FF FF
  $%  REQ004:746 03 22 F1 8A FF FF FF FF       $%  ANS004:756 03 22 F1 8A FF FF FF FF
  $%  REQ005:746 03 22 F1 8B FF FF FF FF       $%  ANS005:756 03 22 F1 8B FF FF FF FF
  $%  REQ006:746 03 22 F1 8C FF FF FF FF       $%  ANS006:756 03 22 F1 8C FF FF FF FF
  $%  REQ007:746 03 22 F1 90 FF FF FF FF       $%  ANS007:756 03 22 F1 90 FF FF FF FF
  $%  REQ008:746 03 22 F1 91 FF FF FF FF       $%  ANS008:756 03 22 F1 91 FF FF FF FF
  $%  REQ009:746 03 22 F1 BF FF FF FF FF       $%  ANS009:756 03 22 F1 BF FF FF FF FF
  $%  REQ010:746 03 22 F1 C0 FF FF FF FF       $%  ANS010:756 03 22 F1 C0 FF FF FF FF
  $%  REQ011:746 03 22 F1 9D FF FF FF FF       $%  ANS011:756 03 22 F1 9D FF FF FF FF
  $%  REQ012:746 03 22 F1 D0 FF FF FF FF       $%  ANS012:756 03 22 F1 D0 FF FF FF FF

  $%  000:当前诊断任务模式:                      $%    $%  ANS000.BYTE004  $%  switxh(x) 0x01:y=@0384;0x02:y=@0191;0x03:y=@0385;default: y=@0007;
  $%  001:整车零部件号:                          $%    $%  ANS001.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:应用软件版本号（正常升级版本）:        $%    $%  ANS002.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  003:应用软件版本号（固定版本）:            $%    $%  ANS003.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:系统供应商代码:                        $%    $%  ANS004.BYTE004  $%  y=ASCII(x1,x2,x3);
  $%  005:ECU生产日期:                           $%    $%  ANS005.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  006:控制器序列号:                          $%    $%  ANS006.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16);
  $%  007:整车VIN:                               $%    $%  ANS007.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  008:硬件版本号:                            $%    $%  ANS008.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  009:应用硬件版本号（固定版本）:            $%    $%  ANS009.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5);
  $%  010:软件总成版本号:                        $%    $%  ANS010.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  011:ECU装配日期:                           $%    $%  ANS011.BYTE004  $%  y=HEX(x1,x2,x3,x4);
  $%  012:软件总成零件号:                        $%    $%  ANS012.BYTE004  $%  y=ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:746 30 00 01 FF FF FF FF FF  $FC 

;******************************************************************************************************************************************************
