
     系统名称:ECM (发动机控制模块)

     系统ID:0000443B

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 03 00 00 00 00 00       $~ ANS000:7E8 02 10 03 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 01 00 00 00 00 00       $~ ANS000:7E8 02 10 01 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10425930&quot;: &quot;0000443A&quot;, &quot;10385653&quot;: &quot;0000443B&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10425930&quot;: &quot;0000443A&quot;, &quot;10385653&quot;: &quot;0000443B&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E0 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/0000443B

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E0 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ002:7E0 03 22 F1 87 00 00 00 00            $%  
  $%  REQ003:7E0 03 22 F1 91 00 00 00 00            $%  
  $%  REQ004:7E0 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ005:7E0 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ006:7E0 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ007:7E0 03 22 F1 10 00 00 00 00            $%  
  $%  REQ008:7E0 03 22 F1 20 00 00 00 00            $%  
  $%  REQ009:7E0 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ010:7E0 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ011:7E0 03 22 F1 00 00 00 00 00            $%  

  $%  000:车辆识别代码(VIN)               $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:车辆特征信息 (FK)               $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  002:电控单元零件号                  $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元硬件号                  $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元应用软件号              $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元标定软件号              $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元制造日期                $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:刷新里程读数                    $%    $%  ANS007.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 
  $%  008:网络配置文件零件号出厂值        $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  009:电控单元索引信息                $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3); 
  $%  010:电控单元序列号                  $%    $%  ANS010.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  011:刷新工具参考号记录              $%    $%  ANS007.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  012:ECU软件校验号                   $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E0 03 22 B1 49 00 00 00 00            $  
  $  REQ001:7E0 03 22 B3 10 00 00 00 00            $  
  $  REQ002:7E0 03 22 B0 00 00 00 00 00            $  
  $  REQ003:7E0 03 22 B0 01 00 00 00 00            $  
  $  REQ004:7E0 03 22 B0 02 00 00 00 00            $  
  $  REQ005:7E0 03 22 B0 03 00 00 00 00            $  
  $  REQ006:7E0 03 22 B0 04 00 00 00 00            $  
  $  REQ007:7E0 03 22 B0 05 00 00 00 00            $  
  $  REQ008:7E0 03 22 B0 12 00 00 00 00            $  
  $  REQ009:7E0 03 22 B0 15 00 00 00 00            $  
  $  REQ010:7E0 03 22 B0 16 00 00 00 00            $  
  $  REQ011:7E0 03 22 B0 17 00 00 00 00            $  
  $  REQ012:7E0 03 22 B0 18 00 00 00 00            $  
  $  REQ013:7E0 03 22 B0 19 00 00 00 00            $  
  $  REQ014:7E0 03 22 B0 20 00 00 00 00            $  
  $  REQ015:7E0 03 22 B0 24 00 00 00 00            $  
  $  REQ016:7E0 03 22 B0 26 00 00 00 00            $  
  $  REQ017:7E0 03 22 B0 29 00 00 00 00            $  
  $  REQ018:7E0 03 22 B0 30 00 00 00 00            $  
  $  REQ019:7E0 03 22 B0 32 00 00 00 00            $  
  $  REQ020:7E0 03 22 B0 34 00 00 00 00            $  
  $  REQ021:7E0 03 22 B0 36 00 00 00 00            $  
  $  REQ022:7E0 03 22 B0 37 00 00 00 00            $  
  $  REQ023:7E0 03 22 B0 38 00 00 00 00            $  
  $  REQ024:7E0 03 22 B0 40 00 00 00 00            $  
  $  REQ025:7E0 03 22 B0 41 00 00 00 00            $  
  $  REQ026:7E0 03 22 B0 42 00 00 00 00            $  
  $  REQ027:7E0 03 22 B0 43 00 00 00 00            $  
  $  REQ028:7E0 03 22 B0 46 00 00 00 00            $  
  $  REQ029:7E0 03 22 B0 49 00 00 00 00            $  
  $  REQ030:7E0 03 22 B0 51 00 00 00 00            $  
  $  REQ031:7E0 03 22 B0 52 00 00 00 00            $  
  $  REQ032:7E0 03 22 B0 53 00 00 00 00            $  
  $  REQ033:7E0 03 22 B0 58 00 00 00 00            $  
  $  REQ034:7E0 03 22 B0 61 00 00 00 00            $  
  $  REQ035:7E0 03 22 B0 68 00 00 00 00            $  
  $  REQ036:7E0 03 22 B0 70 00 00 00 00            $  
  $  REQ037:7E0 03 22 B0 71 00 00 00 00            $  
  $  REQ038:7E0 03 22 B0 77 00 00 00 00            $  
  $  REQ039:7E0 03 22 B1 01 00 00 00 00            $  
  $  REQ040:7E0 03 22 B1 03 00 00 00 00            $  
  $  REQ041:7E0 03 22 B1 07 00 00 00 00            $  
  $  REQ042:7E0 03 22 B1 19 00 00 00 00            $  
  $  REQ043:7E0 03 22 B1 21 00 00 00 00            $  
  $  REQ044:7E0 03 22 B1 22 00 00 00 00            $  
  $  REQ045:7E0 03 22 B1 23 00 00 00 00            $  
  $  REQ046:7E0 03 22 B1 24 00 00 00 00            $  
  $  REQ047:7E0 03 22 B1 25 00 00 00 00            $  
  $  REQ048:7E0 03 22 B1 26 00 00 00 00            $  
  $  REQ049:7E0 03 22 B1 27 00 00 00 00            $  
  $  REQ050:7E0 03 22 B1 33 00 00 00 00            $  
  $  REQ051:7E0 03 22 B1 34 00 00 00 00            $  
  $  REQ052:7E0 03 22 B1 40 00 00 00 00            $  
  $  REQ053:7E0 03 22 B1 41 00 00 00 00            $  
  $  REQ054:7E0 03 22 B1 43 00 00 00 00            $  
  $  REQ055:7E0 03 22 B1 44 00 00 00 00            $  
  $  REQ056:7E0 03 22 B1 45 00 00 00 00            $  
  $  REQ057:7E0 03 22 B1 46 00 00 00 00            $  
  $  REQ058:7E0 03 22 B1 50 00 00 00 00            $  
  $  REQ059:7E0 03 22 B1 51 00 00 00 00            $  
  $  REQ060:7E0 03 22 B1 52 00 00 00 00            $  
  $  REQ061:7E0 03 22 B1 56 00 00 00 00            $  
  $  REQ062:7E0 03 22 B1 57 00 00 00 00            $  
  $  REQ063:7E0 03 22 B1 58 00 00 00 00            $  
  $  REQ064:7E0 03 22 B1 59 00 00 00 00            $  
  $  REQ065:7E0 03 22 B1 60 00 00 00 00            $  
  $  REQ066:7E0 03 22 B1 61 00 00 00 00            $  
  $  REQ067:7E0 03 22 B1 62 00 00 00 00            $  
  $  REQ068:7E0 03 22 B1 63 00 00 00 00            $  
  $  REQ069:7E0 03 22 B1 64 00 00 00 00            $  
  $  REQ070:7E0 03 22 B1 65 00 00 00 00            $  
  $  REQ071:7E0 03 22 B3 00 00 00 00 00            $  
  $  REQ072:7E0 03 22 B3 01 00 00 00 00            $  
  $  REQ073:7E0 03 22 B3 04 00 00 00 00            $  
  $  REQ074:7E0 03 22 B3 05 00 00 00 00            $  
  $  REQ075:7E0 03 22 B3 06 00 00 00 00            $  
  $  REQ076:7E0 03 22 B3 07 00 00 00 00            $  
  $  REQ077:7E0 03 22 B3 08 00 00 00 00            $  
  $  REQ078:7E0 03 22 B3 14 00 00 00 00            $  
  $  REQ079:7E0 03 22 B3 16 00 00 00 00            $  
  $  REQ080:7E0 03 22 B4 01 00 00 00 00            $  
  $  REQ081:7E0 03 22 B4 02 00 00 00 00            $  
  $  REQ082:7E0 03 22 B4 03 00 00 00 00            $  
  $  REQ083:7E0 03 22 B4 04 00 00 00 00            $  
  $  REQ084:7E0 03 22 B4 05 00 00 00 00            $  
  $  REQ085:7E0 03 22 B4 06 00 00 00 00            $  
  $  REQ086:7E0 03 22 B4 11 00 00 00 00            $  
  $  REQ087:7E0 03 22 B4 12 00 00 00 00            $  
  $  REQ088:7E0 03 22 B4 13 00 00 00 00            $  
  $  REQ089:7E0 03 22 B4 14 00 00 00 00            $  
  $  REQ090:7E0 03 22 B4 15 00 00 00 00            $  
  $  REQ091:7E0 03 22 B4 20 00 00 00 00            $  
  $  REQ092:7E0 03 22 B4 21 00 00 00 00            $  
  $  REQ093:7E0 03 22 B4 22 00 00 00 00            $  
  $  REQ094:7E0 03 22 B0 78 00 00 00 00            $  
  $  REQ095:7E0 03 22 B0 0A 00 00 00 00            $  
  $  REQ096:7E0 03 22 B0 0B 00 00 00 00            $  
  $  REQ097:7E0 03 22 B0 0E 00 00 00 00            $  
  $  REQ098:7E0 03 22 B0 2E 00 00 00 00            $  
  $  REQ099:7E0 03 22 B0 2F 00 00 00 00            $  
  $  REQ100:7E0 03 22 B0 3B 00 00 00 00            $  
  $  REQ101:7E0 03 22 B1 31 00 00 00 00            $  
  $  REQ102:7E0 03 22 B1 32 00 00 00 00            $  
  $  REQ103:7E0 03 22 B2 22 00 00 00 00            $  
  $  REQ104:7E0 03 22 B3 35 00 00 00 00            $  
  $  REQ105:7E0 03 22 B3 36 00 00 00 00            $  
  $  REQ106:7E0 03 22 B3 37 00 00 00 00            $  
  $  REQ107:7E0 03 22 B4 66 00 00 00 00            $  
  $  REQ108:7E0 03 22 B1 08 00 00 00 00            $  
  $  REQ109:7E0 03 22 B1 09 00 00 00 00            $  
  $  REQ110:7E0 03 22 B1 10 00 00 00 00            $  
  $  REQ111:7E0 03 22 B1 11 00 00 00 00            $  
  $  REQ112:7E0 03 22 B1 36 00 00 00 00            $  
  $  REQ113:7E0 03 22 B1 37 00 00 00 00            $  
  $  REQ114:7E0 03 22 B1 38 00 00 00 00            $  
  $  REQ115:7E0 03 22 B1 39 00 00 00 00            $  

  $  000.上游氧传感器循环时间                                           $    $  秒               $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  001.发电机负载                                                     $    $  牛米             $    $  ANS001.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  002.周围空气压力                                                   $    $  千帕             $    $  ANS002.BYTE003  $  y=(x1*256+x2)*0.0039; 
  $  003.空调压力                                                       $    $  千帕             $    $  ANS003.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.2;elsey=(x1*256+x2-0xFFFF)*0.2; 
  $  004.空调压力原始值                                                 $    $  伏               $    $  ANS004.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0002;elsey=(x1*256+x2-0xFFFF)*0.0002; 
  $  005.ECM供电电压(KL87)                                              $    $  伏               $    $  ANS005.BYTE003  $  y=(x1*256+x2)*0.024; 
  $  006.点火开关供电电压                                               $    $  伏               $    $  ANS006.BYTE003  $  y=(x)*0.094; 
  $  007.主继电器供电电压                                               $    $  伏               $    $  ANS007.BYTE003  $  y=(x)*0.1; 
  $  008.制动真空压力                                                   $    $  千帕             $    $  ANS008.BYTE003  $  y=(x1*256+x2)*0.00390625; 
  $  009.增压压力                                                       $    $  千帕             $    $  ANS009.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  010.增压器压力电压原始值                                           $    $  伏               $    $  ANS010.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  011.进气凸轮轴相位(VVT)                                            $    $  度               $    $  ANS011.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  012.排气凸轮轴相位(VVT)                                            $    $  度               $    $  ANS012.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  013.气门重叠角(VVT)                                                $    $  度               $    $  ANS013.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  014.碳罐PWM占空比                                                  $    $  百分比           $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  015.ECM内部碰撞检测计数                                            $    $  计数             $    $  ANS015.BYTE003  $  y=(x)*1; 
  $  016.油门踏板需求                                                   $    $  百分比           $    $  ANS016.BYTE003  $  y=(x)*0.392; 
  $  017.加速踏板位置1传感器电压                                        $    $  伏               $    $  ANS017.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  018.加速踏板位置2传感器电压                                        $    $  伏               $    $  ANS018.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  019.发动机冷却液温度                                               $    $  摄氏度           $    $  ANS019.BYTE003  $  y=(x)*0.75-48; 
  $  020.发动机油温度                                                   $    $  摄氏度           $    $  ANS020.BYTE003  $  y=(x)*0.75-48; 
  $  021.发动机机油压力                                                 $    $  千帕             $    $  ANS021.BYTE003  $  y=(x1*256+x2)*0.0229; 
  $  022.发动机机油压力电压原始值                                       $    $  伏               $    $  ANS022.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  023.发动机转速                                                     $    $  转/分            $    $  ANS023.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  024.电子节温器控制占空比                                           $    $  百分比           $    $  ANS024.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.01;elsey=(x1*256+x2-0xFFFF)*0.01; 
  $  025.油轨压力                                                       $    $  兆帕             $    $  ANS025.BYTE003  $  y=(x1*256+x2)*0.0005; 
  $  026.油轨压力传感器电压原始值                                       $    $  伏               $    $  ANS026.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  027.油箱油位                                                       $    $  升               $    $  ANS027.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  028.高压油泵控制阀PWM占空比                                        $    $  曲轴转角         $    $  ANS028.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  029.进气歧管空气温度                                               $    $  摄氏度           $    $  ANS029.BYTE003  $  y=(x)*0.75-48; 
  $  030.进气歧管绝对压力                                               $    $  千帕             $    $  ANS030.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  031.进气歧管绝对压力电压原始值                                     $    $  伏               $    $  ANS031.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  032.后氧传感器电压                                                 $    $  伏特             $    $  ANS032.BYTE003  $  y=(x)*0.0052-0.2; 
  $  033.下游氧传感器加热器PWM占空比                                    $    $  秒               $    $  ANS033.BYTE003  $  y=(x)*0.01; 
  $  034.车速                                                           $    $  千米/时          $    $  ANS034.BYTE003  $  y=(x)*1.25; 
  $  035.空气质量流量 （每小时）                                        $    $  千克每小时       $    $  ANS035.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  036.进气凸轮轴目标相位                                             $    $  曲轴转角         $    $  ANS036.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  037.排气凸轮轴目标相位                                             $    $  曲轴转角         $    $  ANS037.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  038.制动踏板位置                                                   $    $  百分比           $    $  ANS038.BYTE003  $  y=(x)*0.39217224204; 
  $  039.环境压力修正系数                                               $    $                   $    $  ANS039.BYTE003  $  y=(x1*256+x2)*0.000061; 
  $  040.发动机MIL灯亮后行驶里程值                                      $    $  公里             $    $  ANS040.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.01; 
  $  041.发动机控制状态-空燃比闭环控制置位                              $    $                   $    $  ANS041.BYTE003  $  switxh(x&0x10)0x00:@09b4;0x10:@0365; 
  $  042.发动机控制状态-空燃比开环控制置位                              $    $                   $    $  ANS041.BYTE003  $  switxh(x&0x20)0x00:@09b4;0x20:@0365; 
  $  043.短期油量修正平均值                                             $    $                   $    $  ANS042.BYTE003  $  y=(x1*256+x2)*0.0000305; 
  $  044.长期乘法燃油修正                                               $    $                   $    $  ANS043.BYTE003  $  y=(x1*256+x2)*0.0000305; 
  $  045.供油修正值                                                     $    $                   $    $  ANS044.BYTE003  $  y=(x1*256+x2)*0.0000305; 
  $  046.平均点火角                                                     $    $  曲轴转角         $    $  ANS045.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  047.1缸点火角                                                      $    $  千瓦*时          $    $  ANS046.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  048.2缸点火角                                                      $    $  千瓦*时          $    $  ANS047.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  049.3缸点火角                                                      $    $  千瓦*时          $    $  ANS048.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  050.4缸点火角                                                      $    $  千瓦*时          $    $  ANS049.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  051.空调长期怠速调节值                                             $    $  转/分            $    $  ANS050.BYTE003  $  y=(x)*10; 
  $  052.怠速长期调节                                                   $    $  百分比           $    $  ANS051.BYTE003  $  y=(x1*256+x2)*0.00152587890625; 
  $  053.爆震传感器电压                                                 $    $  伏特             $    $  ANS052.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.000076; 
  $  054.Lambda 设置点                                                  $    $                   $    $  ANS053.BYTE003  $  y=(x1*256+x2)*0.000244; 
  $  055.1缸超过200转/分钟的失火数                                      $    $  计数器           $    $  ANS054.BYTE003  $  y=(x1*256+x2)*1; 
  $  056.2缸失火数                                                      $    $  计数器           $    $  ANS055.BYTE003  $  y=(x1*256+x2)*1; 
  $  057.3缸失火数                                                      $    $  计数器           $    $  ANS056.BYTE003  $  y=(x1*256+x2)*1; 
  $  058.4缸失火数                                                      $    $  次               $    $  ANS057.BYTE003  $  y=(x1*256+x2)*1; 
  $  059.上游氧传感器加热器状态-上游氧传感器准备运行                    $    $                   $    $  ANS058.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  060.上游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS058.BYTE003  $  switxh(x&0x02)0x00:@09b4;0x02:@0365; 
  $  061.上游氧传感器加热器状态-非全功率加热标志位                      $    $                   $    $  ANS058.BYTE003  $  switxh(x&0x01)0x00:@09b4;0x01:@0365; 
  $  062.下游氧传感器加热器状态-下游氧传感器准备运行                    $    $                   $    $  ANS059.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  063.下游氧传感器加热器状态-全功率加热标志位                        $    $                   $    $  ANS059.BYTE003  $  switxh(x&0x04)0x00:@09b4;0x04:@0365; 
  $  064.下游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS059.BYTE003  $  switxh(x&0x02)0x00:@09b4;0x02:@0365; 
  $  065.下游氧传感器加热器状态-非全功率加热标志位                      $    $                   $    $  ANS059.BYTE003  $  switxh(x&0x01)0x00:@09b4;0x01:@0365; 
  $  066.碳罐负载水平                                                   $    $  千克/时          $    $  ANS060.BYTE003  $  y=(x1*256+x2)*0.00039; 
  $  067.节气门控制-节气门开度1                                         $    $  百分比           $    $  ANS061.BYTE003  $  y=(x)*0.392; 
  $  068.节气门控制-节气门开度2                                         $    $  百分比           $    $  ANS062.BYTE003  $  y=(x)*0.392; 
  $  069.节气门控制-节气门开度                                          $    $  百分比           $    $  ANS063.BYTE003  $  y=(x)*0.392; 
  $  070.节气门控制-节气门位置1传感器电压                               $    $  伏               $    $  ANS064.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  071.节气门控制-节气门位置2传感器电压                               $    $  伏               $    $  ANS065.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  072.电子节气门控制(ETC)-节气门相对角度                             $    $  开度             $    $  ANS066.BYTE003  $  y=(x)*0.392; 
  $  073.电子节气门控制(ETC)-跛行回家时节气门位置                       $    $  开度             $    $  ANS067.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  074.电子节气门控制(ETC)-节气门自适应设置点                         $    $  开度             $    $  ANS068.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  075.节气门控制机械下止点自适应1传感器电压                          $    $  伏               $    $  ANS069.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  076.节气门控制机械下止点自适应2传感器电压                          $    $  伏               $    $  ANS070.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  077.发动机扭矩结构-附件设备请求的扭矩                              $    $  牛米             $    $  ANS071.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  078.发动机扭矩结构-发动机内部阻力扭矩                              $    $  牛米             $    $  ANS072.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  079.发动机扭矩结构-摩擦扭矩自适应偏差值                            $    $  牛米             $    $  ANS073.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  080.发动机扭矩结构-最大可得到的指示扭矩                            $    $  牛米             $    $  ANS074.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  081.发动机扭矩结构-最小可得到的指示扭矩                            $    $  牛米             $    $  ANS075.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  082.发动机扭矩结构-空调压缩机请求的扭矩                            $    $  牛米             $    $  ANS076.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  083.发动机扭矩结构-冷却风扇请求的扭矩                              $    $  牛米             $    $  ANS077.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  084.发动机扭矩结构-发动机指示真实扭矩                              $    $  百分比           $    $  ANS078.BYTE003  $  y=(x1*256+x2)*0.00152587890625; 
  $  085.发动机扭矩结构-发动机输出有效扭矩                              $    $  牛米             $    $  ANS079.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  086.空调压缩机请求                                                 $    $                   $    $  ANS080.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  087.空调离合器继电器状态                                           $    $                   $    $  ANS080.BYTE003  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  088.错误存在-驾驶员请求命令 2                                      $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  089.错误存在-驾驶员请求命令1                                       $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  090.机动化节气门控制器故障发生                                     $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  091.机动化节气门故障发生                                           $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  092.故障发生-节气门位置2传感器                                     $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  093.故障发生-节气门位置1传感器                                     $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  094.错误发生-曲轴信号                                              $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  095.故障现象-凸轮轴信号                                            $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  096.错误发生-高压油泵控制阀                                        $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  097.燃油泵继电器故障发生                                           $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  098.喷油器4故障发生                                                $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  099.喷油器3故障发生                                                $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  100.喷油器2故障发生                                                $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  101.喷油器1故障发生                                                $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  102.错误发生-进气温度信号                                          $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  103.错误发生-增压压力信号                                          $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  104.错误发生-歧管压力传感器                                        $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  105.错误发生-空气流量信号                                          $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  106.错误发生-机油控制阀                                            $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  107.错误发生-机油压力传感器                                        $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  108.错误发生-油轨压力传感器                                        $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  109.故障发生-发动机冷却液温度传感器                                $    $                   $    $  ANS081.BYTE005  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  110.故障发生-起动挡硬线信号                                        $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  111.故障发生-附件挡硬线信号                                        $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  112.故障现象-下游氧传感器                                          $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  113.错误发生-上游氧传感器                                          $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  114.错误发生-爆震传感器                                            $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  115.故障发生-排气相位控制阀                                        $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  116.故障发生-进气相位控制阀                                        $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  117.错误发生-点火线圈                                              $    $                   $    $  ANS081.BYTE006  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  118.错误发生-输入的SDM CAN信号                                     $    $                   $    $  ANS081.BYTE007  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  119.故障发生-输入的TCCM CAN信号                                    $    $                   $    $  ANS081.BYTE007  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  120.错误发生-输入的GW CAN信号                                      $    $                   $    $  ANS081.BYTE007  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  121.故障发生-输入的TCM CAN信号                                     $    $                   $    $  ANS081.BYTE007  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  122.引入的ABS CAN帧故障发生                                        $    $                   $    $  ANS081.BYTE007  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  123.故障发生-CAN总线关闭                                           $    $                   $    $  ANS081.BYTE007  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  124.故障发生-车辆发生碰撞或碰撞信号不合理                          $    $                   $    $  ANS081.BYTE008  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  125.有故障-废气调节阀                                              $    $                   $    $  ANS081.BYTE008  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  126.错误发生-泄压阀信号                                            $    $                   $    $  ANS081.BYTE008  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  127.故障发生-空调压力传感器                                        $    $                   $    $  ANS081.BYTE008  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  128.错误发生-电子节温器                                            $    $                   $    $  ANS081.BYTE008  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  129.错误发生-冷却风扇控制                                          $    $                   $    $  ANS081.BYTE008  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  130.故障发生-碳罐脱附控制阀                                        $    $                   $    $  ANS081.BYTE009  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  131.故障发生-驻车挡/空挡硬线输入                                   $    $                   $    $  ANS081.BYTE009  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  132.错误发生-倒档开关                                              $    $                   $    $  ANS081.BYTE009  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  133.错误发生-离合器开关                                            $    $                   $    $  ANS081.BYTE009  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  134.故障发生-制动灯开关或制动位置传感器                            $    $                   $    $  ANS081.BYTE009  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  135.错误发生-起动继电器1                                           $    $                   $    $  ANS081.BYTE010  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  136.飞轮自适应学习过程完成状态                                     $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  137.飞轮自适应学习错误标志                                         $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  138.发动机正在运行                                                 $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  139.发动机喷油点火信号同步完成                                     $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  140.点火状态-起动                                                  $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  141.点火状态-运行                                                  $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  142.点火状态-附件                                                  $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  143.节气门跛行回家激活                                             $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  144.节气门关闭                                                     $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  145.发动机满负荷阶段                                               $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  146.发动机倒拖断油阶段                                             $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  147.发动机倒拖阶段                                                 $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  148.启动阶段后的发动机                                             $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  149.发动机起动阶段                                                 $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  150.下游氧传感器加热器状态-全功率加热标志位                        $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x80)0x00:@09b4;0x80:@0365; 
  $  151.下游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x20)0x00:@09b4;0x20:@0365; 
  $  152.上游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x10)0x00:@09b4;0x10:@0365; 
  $  153.下游氧传感器准备运行                                           $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  154.上游氧传感器准备运行                                           $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  155.闭环控制激活                                                   $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  156.倒档开关状态                                                   $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x80)0x00:@093d;0x80:@0208; 
  $  157.离合器顶开关状态                                               $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x40)0x00:@093d;0x40:@0208; 
  $  158.制动开关 2 状态                                                $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x20)0x00:@093d;0x20:@0208; 
  $  159.制动开关 1 状态                                                $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x10)0x00:@093d;0x10:@0208; 
  $  160.燃油泵继电器状态                                               $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x08)0x00:@093d;0x08:@0206; 
  $  161.主继电器状态                                                   $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x04)0x00:@093d;0x04:@0206; 
  $  162.起动继电器状态                                                 $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x01)0x00:@093d;0x01:@0206; 
  $  163.VCT排气执行器已就绪(VVT)                                       $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  164.VCT进气执行器已就绪(VVT)                                       $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  165.碰撞CAN信号输入状态                                            $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  166.碳罐脱附控制阀                                                 $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  167.驻车挡/空挡开关状态                                            $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x01)0x00:@093d;0x01:@0208; 
  $  168.后氧传感器加热器状态                                           $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  169.前氧传感器加热状态                                             $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  170.发动机DBW灯状态                                                $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  171.发动机MIL灯状态                                                $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  172.涡轮增压器泄压阀状态(增压)                                     $    $                   $    $  ANS083.BYTE007  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  173.发动机机油阀状态                                               $    $                   $    $  ANS083.BYTE007  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  174.发动机机油压力开关状态                                         $    $                   $    $  ANS083.BYTE007  $  switxh(x&0x08)0x00:@093d;0x08:@0208; 
  $  175.防盗状态-数据传输已存储并锁定                                  $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  176.防盗状态-数据传输已完成                                        $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  177.防盗状态-数据传输超时                                          $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  178.防盗状态-数据传输已开始                                        $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  179.防盗状态-密钥和PIN码未存储                                     $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  180.防盗状态-防盗功能激活状态                                      $    $                   $    $  ANS084.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  181.防盗状态-ECU状态                                               $    $                   $    $  ANS084.BYTE004  $  switxh(x&0x10)0x00:@001f;0x10:@06fb; 
  $  182.防盗状态-响应有效-正确的格式                                   $    $                   $    $  ANS084.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  183.防盗状态-响应无效-正确的格式                                   $    $                   $    $  ANS084.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  184.防盗状态-响应无效-错误的格式                                   $    $                   $    $  ANS084.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  185.防盗状态-报文发送                                              $    $                   $    $  ANS084.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  186.跛行回家-节气门电机故障                                        $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  187.跛行回家-节气门自适应故障                                      $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  188.跛行回家-凸轮轴传感器信号异常                                  $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  189.跛行回家-曲轴传感器信号异常                                    $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  190.变速器状态-起动允许状态                                        $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  191.变速器状态-换挡过程中                                          $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  192.变速器状态-蠕行控制功能激活                                    $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  193.变速器状态-非排放相关故障激活                                  $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  194.变速器状态-排放相关故障激活                                    $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  195.巡航控制状态                                                   $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x1C)0x00:@002e;0x04:@091c;0x08:@091d;0x0C:@091e;0x10:@0370;0x14:@0920;0x18:@0004; 
  $  196.车速控制-车速单位                                              $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x02)0x00:@06e3;0x02:@08d5; 
  $  197.车速控制-驾驶员加速踏板优先                                    $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  198.巡航控制-车速控制输入设置请求                                  $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  199.巡航控制-车速控制输入取消请求                                  $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  200.巡航控制-车速控制输入恢复请求                                  $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  201.巡航控制-车速控制输入减速请求(按下并保持)                      $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  202.巡航控制-车速控制输入减速请求(轻按)                            $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  203.巡航控制-车速控制输入加速请求(按下并保持)                      $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  204.巡航控制-车速控制输入加速请求(轻按)                            $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  205.巡航控制-巡航主开关输入                                        $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  206.巡航控制-开关信号一致性                                        $    $                   $    $  ANS087.BYTE005  $  switxh(x&0x30)0x00:@0097;0x10:@0098;0x20:@0099;0x30:@009a; 
  $  207.巡航控制-巡航激活指示灯可用                                    $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  208.巡航控制-巡航待命指示灯可用                                    $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  209.巡航禁用-制动踏板踩下                                          $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  210.巡航禁用-离合器踏板踩下                                        $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  211.巡航禁用-开关信号一致性                                        $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  212.巡航禁用-安全监控中                                            $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  213.巡航禁用-一般故障状态                                          $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  214.巡航禁用-安全气囊点爆                                          $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  215.巡航禁用-巡航主开关按下                                        $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  216.巡航禁用-车速未达到进入阀值                                    $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  217.巡航禁用-远高于巡航目标速度                                    $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  218.巡航禁用-远低于巡航目标速度                                    $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  219.巡航禁用-制动踏板踩下                                          $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  220.巡航禁用-离合器踏板踩下或挡位改变                              $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  221.巡航禁用-挡位超限                                              $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  222.巡航禁用-发动机转速超限                                        $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  223.巡航禁用-扭矩干预                                              $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  224.巡航禁用-变速器故障                                            $    $                   $    $  ANS088.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  225.巡航禁用-加速度太大                                            $    $                   $    $  ANS088.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  226.巡航禁用-加速度太小                                            $    $                   $    $  ANS088.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  227.巡航禁用-强制降挡                                              $    $                   $    $  ANS088.BYTE006  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  228.巡航禁用-蓄电池电压低                                          $    $                   $    $  ANS088.BYTE006  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  229.巡航禁用-发动机故障警告指示(DBW)灯亮                           $    $                   $    $  ANS088.BYTE006  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  230.巡航禁用-车速信号异常                                          $    $                   $    $  ANS088.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  231.巡航禁用-电子节气门控制故障                                    $    $                   $    $  ANS088.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  232.巡航禁用-驾驶员操作异常                                        $    $                   $    $  ANS088.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  233.巡航禁用-发动机转速超限                                        $    $                   $    $  ANS088.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  234.催化就绪标志                                                   $    $                   $    $  ANS089.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  235.下游氧传感器准备就绪                                           $    $                   $    $  ANS089.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  236.上游氧传感器准备就绪                                           $    $                   $    $  ANS089.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  237.燃油系统的就绪标志                                             $    $                   $    $  ANS089.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  238.B4 类失火就绪标志                                              $    $                   $    $  ANS089.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  239.B1 类失火就绪标志                                              $    $                   $    $  ANS089.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  240.A类失火就绪标志                                                $    $                   $    $  ANS089.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  241.综合零件监视状态                                               $    $                   $    $  ANS089.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  242.燃油系统监控状态                                               $    $                   $    $  ANS089.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  243.失火监控状态                                                   $    $                   $    $  ANS089.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  244.支持综合零件监视                                               $    $                   $    $  ANS089.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  245.支持燃油系统监控                                               $    $                   $    $  ANS089.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  246.支持失火监控                                                   $    $                   $    $  ANS089.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  247.氧传感器加热器监控                                             $    $                   $    $  ANS089.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  248.氧传感器监控                                                   $    $                   $    $  ANS089.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  249.催化器监控                                                     $    $                   $    $  ANS089.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  250.扭矩信号-发动机扭矩减少失效状态                                $    $                   $    $  ANS090.BYTE003  $  switxh(x&0xE0)0x00:@009b;0x20:@009c;0x40:@009d;0x60:@009e;0x80:@009f; 
  $  251.扭矩信号-电子稳定程序(ESP)请求发动机扭矩减少激活               $    $                   $    $  ANS090.BYTE003  $  switxh(x&0x04)0x00:@00e7;0x04:@008b; 
  $  252.扭矩信号-动态稳定控制系统(SCS)激活                             $    $                   $    $  ANS090.BYTE003  $  switxh(x&0x02)0x00:@00e7;0x02:@008b; 
  $  253.扭矩信号-牵引控制系统(TCS)激活                                 $    $                   $    $  ANS090.BYTE003  $  switxh(x&0x01)0x00:@00e7;0x01:@008b; 
  $  254.远程起动-系统状态-动力总成运行退出                             $    $                   $    $  ANS091.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  255.远程起动-系统状态-动力总成起动退出                             $    $                   $    $  ANS091.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  256.远程起动-系统状态-发动机运行                                   $    $                   $    $  ANS091.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  257.远程起动-系统状态-系统状态                                     $    $                   $    $  ANS091.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  258.远程起动-系统状态-系统请求                                     $    $                   $    $  ANS091.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  259.远程起动-动力总成起动退出原因-车速超过限值                     $    $                   $    $  ANS092.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  260.远程起动-动力总成起动退出原因-换挡杆不在驻车挡位置             $    $                   $    $  ANS092.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  261.远程起动-动力总成起动退出原因-车辆发生碰撞                     $    $                   $    $  ANS092.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  262.远程起动-动力总成起动退出原因-动力总成状态禁用                 $    $                   $    $  ANS092.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  263.远程起动-动力总成起动退出原因-变速器状态禁用                   $    $                   $    $  ANS092.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  264.远程起动-动力总成起动退出原因-起动机达到最大起动时间           $    $                   $    $  ANS092.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  265.远程起动-动力总成起动退出原因-发动机故障灯亮                   $    $                   $    $  ANS092.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  266.远程起动-动力总成起动退出原因-与GW或SCS/ABS或TCM失去通讯       $    $                   $    $  ANS092.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  267.远程起动-动力总成起动退出原因-燃油油量太低                     $    $                   $    $  ANS092.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  268.远程起动-动力总成起动退出原因-KL15硬线被断开                   $    $                   $    $  ANS092.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  269.远程起动-动力总成运行退出原因-与GW或SCS/ABS或TCM失去通讯       $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  270.远程起动-动力总成运行退出原因-加速踏板踩下                     $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  271.远程起动-动力总成运行退出原因-发动机转速超过限值               $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  272.远程起动-动力总成运行退出原因-车速超过限值                     $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  273.远程起动-动力总成运行退出原因-换挡杆不在驻车挡位置             $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  274.远程起动-动力总成运行退出原因-超过最大允许运行时间             $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  275.远程起动-动力总成运行退出原因-机油压力低                       $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  276.远程起动-动力总成运行退出原因-发动机过热                       $    $                   $    $  ANS093.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  277.远程起动-动力总成运行退出原因-KL15硬线被断开                   $    $                   $    $  ANS093.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  278.远程起动-动力总成运行退出原因-未知原因                         $    $                   $    $  ANS093.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  279.远程起动-动力总成运行退出原因-发动机故障灯亮                   $    $                   $    $  ANS093.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  280.远程起动-动力总成运行退出原因-车辆发生碰撞                     $    $                   $    $  ANS093.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  281.制动踏板位置传感器电压                                         $    $  伏               $    $  ANS094.BYTE003  $  y=(x1*256+x2)*0.0048828; 
  $  282.发动机冷却液温度-散热器                                        $    $  摄氏度           $    $  ANS095.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  283.发动机冷却液温度电压值-散热器                                  $    $  伏               $    $  ANS096.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0002;elsey=(x1*256+x2-0xFFFF)*0.0002; 
  $  284.周围空气温度                                                   $    $  摄氏度           $    $  ANS097.BYTE003  $  y=(x)*0.75-48; 
  $  285.清洗流量压力                                                   $    $  百帕             $    $  ANS098.BYTE003  $  y=(x1*256+x2)*0.0039; 
  $  286.清洗流量压力电压值                                             $    $  伏               $    $  ANS099.BYTE003  $  y=(x1*256+x2)*0.000305; 
  $  287.燃油箱压力电压值                                               $    $  伏               $    $  ANS100.BYTE003  $  y=(x1*256+x2)*0.0048828; 
  $  288.怠速积分器I部分                                                $    $  百分比           $    $  ANS101.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00305;elsey=(x1*256+x2-0xFFFF)*0.00305; 
  $  289.怠速调节器-PD部分                                              $    $  百分比           $    $  ANS102.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  290.怠速增压需求                                                   $    $                   $    $  ANS103.BYTE003  $  switxh(x)0x00:@0cf4;0x01:@0c7d;0x02:@00a3;0x03:@00a3; 
  $  291.自适应巡航-主动紧急制动-扭矩请求状态                           $    $                   $    $  ANS104.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0ca3; 
  $  292.自适应巡航-主动紧急制动-扭矩请求值                             $    $  牛米             $    $  ANS105.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  293.自适应巡航-主动紧急制动-减速请求状态                           $    $                   $    $  ANS106.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0c1f;0x02:@0c20; 
  $  294.主动限速控制状态                                               $    $                   $    $  ANS087.BYTE003  $  switxh(x&0xE0)0x00:@002e;0x20:@0030;0x40:@07e4;0x60:@07e5;0x80:@0452;0xA0:@0084; 
  $  295.监控安全断油标志位                                             $    $                   $    $  ANS107.BYTE003  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  296.最小扭矩激活标志位                                             $    $                   $    $  ANS107.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  297.点火开关信号标志位                                             $    $                   $    $  ANS107.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  298.催化器加热标志位                                               $    $                   $    $  ANS107.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  299.1缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS108.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  300.2缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS109.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  301.3缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS110.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  302.4缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS111.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  303.爆震点火角修正值                                               $    $  曲轴转角         $    $  ANS112.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  304.爆震窗口角度初始值                                             $    $  度               $    $  ANS113.BYTE003  $  if(0x80>x)y=(x)*0.0219731927049;elsey=(x-0xFF)*0.0219731927049; 
  $  305.爆震窗口角度                                                   $    $  秒               $    $  ANS114.BYTE003  $  if(0x80>x)y=(x)*0.0219731927049;elsey=(x-0xFF)*0.0219731927049; 
  $  306.爆震能量                                                       $    $  伏特             $    $  ANS115.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.000076; 
  $  307.电子真空泵控制状态                                             $    $                   $    $  ANS083.BYTE010  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 

;******************************************************************************************************************************************************

