
    车型ID：1c35

    模拟：协议模拟-->1c35

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~729

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 03 19 02 09 00 00 00 00       $#  ANS000:729 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/fe000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 04 14 FF FF FF 00 00 00       $$  ANS000:729 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 F1 93 00 00 00 00       $%  ANS000:729 03 22 F1 93 00 00 00 00
  $%  REQ001:721 03 22 F1 94 00 00 00 00       $%  ANS001:729 03 22 F1 94 00 00 00 00
  $%  REQ002:721 03 22 F1 95 00 00 00 00       $%  ANS002:729 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1/100,(x1/10)%10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d/%02d/%02d],x1,x2,x3);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%.2d.%.2d],(x1*256+x2)/10000,((x1*256+x2)%10000)/100,(x1*256+x2)%100);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d/%02d/%02d],x1,x2,x3);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000.左前门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@0001;else y=@0000;
  $  001.右前门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@0001;else y=@0000;
  $  002.左后门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@0001;else y=@0000;
  $  003.右后门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@0001;else y=@0000;
  $  004.行李箱开关                          $    $       $    $  ANS000.BYTE004  $  if(x1&0x10)y=@0001;else y=@0000;
  $  005.左前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x20)y=@0067;else y=@0068;
  $  006.左后门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x40)y=@0067;else y=@0068;
  $  007.右前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x80)y=@0067;else y=@0068;
  $  008.右后门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0067;else y=@0068;
  $  009.后背门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0067;else y=@0068;
  $  010.发动机前舱盖状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0001;else y=@0000;
  $  011.安全带状态                          $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0091;else y=@0092;
  $  012.12V制动信号状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0093;else y=@003f;
  $  013.0V制动灯开关状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0093;else y=@003f;
  $  014.启动按钮1脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@007b;else y=@0094;
  $  015.启动按钮4脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@007b;else y=@0094;
  $  016.左前中控锁闭锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@007b;else y=@003f;
  $  017.左前中控锁解锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@007b;else y=@003f;
  $  018.右前中控锁闭锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@007b;else y=@003f;
  $  019.右前中控锁解锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@007b;else y=@003f;
  $  020.IG1电状态                           $    $       $    $  ANS000.BYTE006  $  if(x1&0x80)y=@0001;else y=@0000;
  $  021.ACC电状态                           $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@0001;else y=@0000;
  $  022.机械钥匙闭锁开关状态                $    $       $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0068;else y=@003f;
  $  023.机械钥匙解锁开关状态                $    $       $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0067;else y=@003f;
  $  024.行李箱安全系统开启状态              $    $       $    $  ANS000.BYTE007  $  if(x1&0x20)y=@0001;else y=@0000;
  $  025.电动外后视镜翻转调节                $    $       $    $  ANS000.BYTE008  $  switxh(x1&0x0F)0:y=@0082;1:y=@0083;2:y=@0084;3:y=@0085;4:y=@0086;5:y=@0087;6:y=@0088;7:y=@0089;8:y=@008a;default: y=@0002;
  $  026.电动外后视镜左右选择                $    $       $    $  ANS000.BYTE008  $  switxh(x1&0x30)0x10:y=@0080;0x20:y=@0081;0x30:y=@0002;default: y=@003f;
  $  027.门锁保护状态                        $    $       $    $  ANS000.BYTE009  $  switxh(x1&0x18)0x00: y=@0045;0x08: y=@008e;0x10: y=@008f;0x18: y=@0090;default:y=@007f;
  $  028.前碰撞信号状态(PWM(脉宽调制))       $    $       $    $  ANS000.BYTE009  $  if(x1<0x40) y=@008b;else if(x1<0x80) y=@008c;else if(x1<0xC0) y=@008d;else y=@0002;
  $  029.前大灯洗涤开关状态                  $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0093;else y=@003f;

  $)  01.历史记录-报警记录
  $  01.历史记录-报警记录
  $  REQ000:721 03 22 01 09 00 00 00 00       $  ANS000:729 03 22 01 09 00 00 00 00

  $  000.报警记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  if(x1==0x11)y=@0096;else y=@0097;
  $  001.报警记录1-主驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0095;else y=@003f;
  $  002.报警记录1-副驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0095;else y=@003f;
  $  003.报警记录1-左后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0095;else y=@003f;
  $  004.报警记录1-右后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0095;else y=@003f;
  $  005.报警记录1-行李箱盖                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0095;else y=@003f;
  $  006.报警记录1-IG1电                      $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0095;else y=@003f;
  $  007.报警记录1-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0095;else y=@003f;
  $  008.报警记录1-主驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0095;else y=@003f;
  $  009.报警记录1-左后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0095;else y=@003f;
  $  010.报警记录1-副驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0095;else y=@003f;
  $  011.报警记录1-右后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0095;else y=@003f;
  $  012.报警记录1-前舱盖                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@0095;else y=@003f;
  $  013.报警记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  014.报警记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  if(x1==0x11)y=@0096;else y=@0097;
  $  015.报警记录2-主驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0095;else y=@003f;
  $  016.报警记录2-副驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0095;else y=@003f;
  $  017.报警记录2-左后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0095;else y=@003f;
  $  018.报警记录2-右后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0095;else y=@003f;
  $  019.报警记录2-行李箱盖                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0095;else y=@003f;
  $  020.报警记录2-IG1电                      $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0095;else y=@003f;
  $  021.报警记录2-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0095;else y=@003f;
  $  022.报警记录2-主驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0095;else y=@003f;
  $  023.报警记录2-左后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0095;else y=@003f;
  $  024.报警记录2-副驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0095;else y=@003f;
  $  025.报警记录2-右后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@0095;else y=@003f;
  $  026.报警记录2-前舱盖                     $    $       $    $  ANS000.BYTE010  $  if(x1&0x20)y=@0095;else y=@003f;
  $  027.报警记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  028.报警记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  if(x1==0x11)y=@0096;else y=@0097;
  $  029.报警记录3-主驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0095;else y=@003f;
  $  030.报警记录3-副驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0095;else y=@003f;
  $  031.报警记录3-左后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0095;else y=@003f;
  $  032.报警记录3-右后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0095;else y=@003f;
  $  033.报警记录3-行李箱盖                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0095;else y=@003f;
  $  034.报警记录3-IG1电                      $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0095;else y=@003f;
  $  035.报警记录3-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0095;else y=@003f;
  $  036.报警记录3-主驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0095;else y=@003f;
  $  037.报警记录3-左后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0095;else y=@003f;
  $  038.报警记录3-副驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@0095;else y=@003f;
  $  039.报警记录3-右后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x08)y=@0095;else y=@003f;
  $  040.报警记录3-前舱盖                     $    $       $    $  ANS000.BYTE014  $  if(x1&0x20)y=@0095;else y=@003f;
  $  041.报警记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  042.报警记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  if(x1==0x11)y=@0096;else y=@0097;
  $  043.报警记录4-主驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0095;else y=@003f;
  $  044.报警记录4-副驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0095;else y=@003f;
  $  045.报警记录4-左后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0095;else y=@003f;
  $  046.报警记录4-右后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0095;else y=@003f;
  $  047.报警记录4-行李箱盖                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0095;else y=@003f;
  $  048.报警记录4-IG1电                      $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0095;else y=@003f;
  $  049.报警记录4-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0095;else y=@003f;
  $  050.报警记录4-主驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0095;else y=@003f;
  $  051.报警记录4-左后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0095;else y=@003f;
  $  052.报警记录4-副驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@0095;else y=@003f;
  $  053.报警记录4-右后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x08)y=@0095;else y=@003f;
  $  054.报警记录4-前舱盖                     $    $       $    $  ANS000.BYTE018  $  if(x1&0x20)y=@0095;else y=@003f;
  $  055.报警记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  056.报警记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  if(x1==0x11)y=@0096;else y=@0097;
  $  057.报警记录5-主驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0095;else y=@003f;
  $  058.报警记录5-副驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0095;else y=@003f;
  $  059.报警记录5-左后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0095;else y=@003f;
  $  060.报警记录5-右后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0095;else y=@003f;
  $  061.报警记录5-行李箱盖                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0095;else y=@003f;
  $  062.报警记录5-IG1电                      $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0095;else y=@003f;
  $  063.报警记录5-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0095;else y=@003f;
  $  064.报警记录5-主驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0095;else y=@003f;
  $  065.报警记录5-左后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0095;else y=@003f;
  $  066.报警记录5-副驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@0095;else y=@003f;
  $  067.报警记录5-右后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x08)y=@0095;else y=@003f;
  $  068.报警记录5-前舱盖                     $    $       $    $  ANS000.BYTE022  $  if(x1&0x20)y=@0095;else y=@003f;
  $  069.报警记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  070.报警记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  if(x1==0x11)y=@0096;else y=@0097;
  $  071.报警记录6-主驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0095;else y=@003f;
  $  072.报警记录6-副驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0095;else y=@003f;
  $  073.报警记录6-左后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0095;else y=@003f;
  $  074.报警记录6-右后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0095;else y=@003f;
  $  075.报警记录6-行李箱盖                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0095;else y=@003f;
  $  076.报警记录6-IG1电                      $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0095;else y=@003f;
  $  077.报警记录6-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0095;else y=@003f;
  $  078.报警记录6-主驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0095;else y=@003f;
  $  079.报警记录6-左后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0095;else y=@003f;
  $  080.报警记录6-副驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@0095;else y=@003f;
  $  081.报警记录6-右后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0095;else y=@003f;
  $  082.报警记录6-前舱盖                     $    $       $    $  ANS000.BYTE026  $  if(x1&0x20)y=@0095;else y=@003f;
  $  083.报警记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  084.报警记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  if(x1==0x11)y=@0096;else y=@0097;
  $  085.报警记录7-主驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0095;else y=@003f;
  $  086.报警记录7-副驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0095;else y=@003f;
  $  087.报警记录7-左后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0095;else y=@003f;
  $  088.报警记录7-右后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0095;else y=@003f;
  $  089.报警记录7-行李箱盖                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0095;else y=@003f;
  $  090.报警记录7-IG1电                      $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0095;else y=@003f;
  $  091.报警记录7-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0095;else y=@003f;
  $  092.报警记录7-主驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0095;else y=@003f;
  $  093.报警记录7-左后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0095;else y=@003f;
  $  094.报警记录7-副驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@0095;else y=@003f;
  $  095.报警记录7-右后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x08)y=@0095;else y=@003f;
  $  096.报警记录7-前舱盖                     $    $       $    $  ANS000.BYTE030  $  if(x1&0x20)y=@0095;else y=@003f;
  $  097.报警记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  098.报警记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  if(x1==0x11)y=@0096;else y=@0097;
  $  099.报警记录8-主驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0095;else y=@003f;
  $  100.报警记录8-副驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0095;else y=@003f;
  $  101.报警记录8-左后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0095;else y=@003f;
  $  102.报警记录8-右后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0095;else y=@003f;
  $  103.报警记录8-行李箱盖                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0095;else y=@003f;
  $  104.报警记录8-IG1电                      $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0095;else y=@003f;
  $  105.报警记录8-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0095;else y=@003f;
  $  106.报警记录8-主驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0095;else y=@003f;
  $  107.报警记录8-左后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0095;else y=@003f;
  $  108.报警记录8-副驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@0095;else y=@003f;
  $  109.报警记录8-右后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x08)y=@0095;else y=@003f;
  $  110.报警记录8-前舱盖                     $    $       $    $  ANS000.BYTE034  $  if(x1&0x20)y=@0095;else y=@003f;
  $  111.报警记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.历史记录-闭锁记录
  $  02.历史记录-闭锁记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00

  $  000.闭锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  if(x1==0x12)y=@0096;else y=@0097;
  $  001.闭锁记录1-副驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0095;else y=@003f;
  $  002.闭锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0095;else y=@003f;
  $  003.闭锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0095;else y=@003f;
  $  004.闭锁记录1-超速                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0095;else y=@003f;
  $  005.闭锁记录1-自动返回防盗         $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0095;else y=@003f;
  $  006.闭锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0095;else y=@003f;
  $  007.闭锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0095;else y=@003f;
  $  008.闭锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0095;else y=@003f;
  $  009.闭锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0095;else y=@003f;
  $  010.闭锁记录1-自动设定防盗         $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0095;else y=@003f;
  $  011.闭锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  012.闭锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  if(x1==0x12)y=@0096;else y=@0097;
  $  013.闭锁记录2-副驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0095;else y=@003f;
  $  014.闭锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0095;else y=@003f;
  $  015.闭锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0095;else y=@003f;
  $  016.闭锁记录2-超速                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0095;else y=@003f;
  $  017.闭锁记录2-自动返回防盗         $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0095;else y=@003f;
  $  018.闭锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0095;else y=@003f;
  $  019.闭锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@0095;else y=@003f;
  $  020.闭锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0095;else y=@003f;
  $  021.闭锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0095;else y=@003f;
  $  022.闭锁记录2-自动设定防盗         $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0095;else y=@003f;
  $  023.闭锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  024.闭锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  if(x1==0x12)y=@0096;else y=@0097;
  $  025.闭锁记录3-副驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0095;else y=@003f;
  $  026.闭锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0095;else y=@003f;
  $  027.闭锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0095;else y=@003f;
  $  028.闭锁记录3-超速                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0095;else y=@003f;
  $  029.闭锁记录3-自动返回防盗         $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0095;else y=@003f;
  $  030.闭锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0095;else y=@003f;
  $  031.闭锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@0095;else y=@003f;
  $  032.闭锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0095;else y=@003f;
  $  033.闭锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0095;else y=@003f;
  $  034.闭锁记录3-自动设定防盗         $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0095;else y=@003f;
  $  035.闭锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  036.闭锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  if(x1==0x12)y=@0096;else y=@0097;
  $  037.闭锁记录4-副驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0095;else y=@003f;
  $  038.闭锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0095;else y=@003f;
  $  039.闭锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0095;else y=@003f;
  $  040.闭锁记录4-超速                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0095;else y=@003f;
  $  041.闭锁记录4-自动返回防盗         $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0095;else y=@003f;
  $  042.闭锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0095;else y=@003f;
  $  043.闭锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@0095;else y=@003f;
  $  044.闭锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0095;else y=@003f;
  $  045.闭锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0095;else y=@003f;
  $  046.闭锁记录4-自动设定防盗         $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0095;else y=@003f;
  $  047.闭锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  048.闭锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  if(x1==0x12)y=@0096;else y=@0097;
  $  049.闭锁记录5-副驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0095;else y=@003f;
  $  050.闭锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0095;else y=@003f;
  $  051.闭锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0095;else y=@003f;
  $  052.闭锁记录5-超速                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0095;else y=@003f;
  $  053.闭锁记录5-自动返回防盗         $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0095;else y=@003f;
  $  054.闭锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0095;else y=@003f;
  $  055.闭锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@0095;else y=@003f;
  $  056.闭锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0095;else y=@003f;
  $  057.闭锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0095;else y=@003f;
  $  058.闭锁记录5-自动设定防盗         $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0095;else y=@003f;
  $  059.闭锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  060.闭锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  if(x1==0x12)y=@0096;else y=@0097;
  $  061.闭锁记录6-副驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0095;else y=@003f;
  $  062.闭锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0095;else y=@003f;
  $  063.闭锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0095;else y=@003f;
  $  064.闭锁记录6-超速                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0095;else y=@003f;
  $  065.闭锁记录6-自动返回防盗         $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0095;else y=@003f;
  $  066.闭锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0095;else y=@003f;
  $  067.闭锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0095;else y=@003f;
  $  068.闭锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0095;else y=@003f;
  $  069.闭锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0095;else y=@003f;
  $  070.闭锁记录6-自动设定防盗         $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0095;else y=@003f;
  $  071.闭锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  072.闭锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  if(x1==0x12)y=@0096;else y=@0097;
  $  073.闭锁记录7-副驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0095;else y=@003f;
  $  074.闭锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0095;else y=@003f;
  $  075.闭锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0095;else y=@003f;
  $  076.闭锁记录7-超速                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0095;else y=@003f;
  $  077.闭锁记录7-自动返回防盗         $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0095;else y=@003f;
  $  078.闭锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0095;else y=@003f;
  $  079.闭锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@0095;else y=@003f;
  $  080.闭锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0095;else y=@003f;
  $  081.闭锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0095;else y=@003f;
  $  082.闭锁记录7-自动设定防盗         $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0095;else y=@003f;
  $  083.闭锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  084.闭锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  if(x1==0x12)y=@0096;else y=@0097;
  $  085.闭锁记录8-副驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0095;else y=@003f;
  $  086.闭锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0095;else y=@003f;
  $  087.闭锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0095;else y=@003f;
  $  088.闭锁记录8-超速                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0095;else y=@003f;
  $  089.闭锁记录8-自动返回防盗         $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0095;else y=@003f;
  $  090.闭锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0095;else y=@003f;
  $  091.闭锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@0095;else y=@003f;
  $  092.闭锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0095;else y=@003f;
  $  093.闭锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0095;else y=@003f;
  $  094.闭锁记录8-自动设定防盗         $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0095;else y=@003f;
  $  095.闭锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.历史记录-解锁记录
  $  03.历史记录-解锁记录
  $  REQ000:721 03 22 01 0B 00 00 00 00       $  ANS000:729 03 22 01 0B 00 00 00 00

  $  000.解锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  if(x1==0x13)y=@0096;else y=@0097;
  $  001.解锁记录1-副驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0095;else y=@003f;
  $  002.解锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0095;else y=@003f;
  $  003.解锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0095;else y=@003f;
  $  004.解锁记录1-退电                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0095;else y=@003f;
  $  005.解锁记录1-碰撞信号             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0095;else y=@003f;
  $  006.解锁记录1-钥匙在车内           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0095;else y=@003f;
  $  007.解锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@0095;else y=@003f;
  $  008.解锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@0095;else y=@003f;
  $  009.解锁记录1-锁定防止             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0095;else y=@003f;
  $  010.解锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0095;else y=@003f;
  $  011.解锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@0095;else y=@003f;
  $  012.解锁记录1-硬线碰撞信号         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@0095;else y=@003f;
  $  013.解锁记录1-CAN线碰撞信号        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@0095;else y=@003f;
  $  014.解锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  015.解锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  if(x1==0x13)y=@0096;else y=@0097;
  $  016.解锁记录2-副驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0095;else y=@003f;
  $  017.解锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0095;else y=@003f;
  $  018.解锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0095;else y=@003f;
  $  019.解锁记录2-退电                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0095;else y=@003f;
  $  020.解锁记录2-碰撞信号             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0095;else y=@003f;
  $  021.解锁记录2-钥匙在车内           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@0095;else y=@003f;
  $  022.解锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@0095;else y=@003f;
  $  023.解锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@0095;else y=@003f;
  $  024.解锁记录2-锁定防止             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@0095;else y=@003f;
  $  025.解锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@0095;else y=@003f;
  $  026.解锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@0095;else y=@003f;
  $  027.解锁记录2-硬线碰撞信号         $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@0095;else y=@003f;
  $  028.解锁记录2-CAN线碰撞信号        $    $       $    $  ANS000.BYTE010  $  if(x1&0x10)y=@0095;else y=@003f;
  $  029.解锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  030.解锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  if(x1==0x13)y=@0096;else y=@0097;
  $  031.解锁记录3-副驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0095;else y=@003f;
  $  032.解锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0095;else y=@003f;
  $  033.解锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0095;else y=@003f;
  $  034.解锁记录3-退电                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0095;else y=@003f;
  $  035.解锁记录3-碰撞信号             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0095;else y=@003f;
  $  036.解锁记录3-钥匙在车内           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@0095;else y=@003f;
  $  037.解锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@0095;else y=@003f;
  $  038.解锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@0095;else y=@003f;
  $  039.解锁记录3-锁定防止             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@0095;else y=@003f;
  $  040.解锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@0095;else y=@003f;
  $  041.解锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@0095;else y=@003f;
  $  042.解锁记录3-硬线碰撞信号         $    $       $    $  ANS000.BYTE014  $  if(x1&0x08)y=@0095;else y=@003f;
  $  043.解锁记录3-CAN线碰撞信号        $    $       $    $  ANS000.BYTE014  $  if(x1&0x10)y=@0095;else y=@003f;
  $  044.解锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  045.解锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  if(x1==0x13)y=@0096;else y=@0097;
  $  046.解锁记录4-副驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0095;else y=@003f;
  $  047.解锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0095;else y=@003f;
  $  048.解锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0095;else y=@003f;
  $  049.解锁记录4-退电                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0095;else y=@003f;
  $  050.解锁记录4-碰撞信号             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0095;else y=@003f;
  $  051.解锁记录4-钥匙在车内           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@0095;else y=@003f;
  $  052.解锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@0095;else y=@003f;
  $  053.解锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@0095;else y=@003f;
  $  054.解锁记录4-锁定防止             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@0095;else y=@003f;
  $  055.解锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@0095;else y=@003f;
  $  056.解锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@0095;else y=@003f;
  $  057.解锁记录4-硬线碰撞信号         $    $       $    $  ANS000.BYTE018  $  if(x1&0x08)y=@0095;else y=@003f;
  $  058.解锁记录4-CAN线碰撞信号        $    $       $    $  ANS000.BYTE018  $  if(x1&0x10)y=@0095;else y=@003f;
  $  059.解锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  060.解锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  if(x1==0x13)y=@0096;else y=@0097;
  $  061.解锁记录5-副驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0095;else y=@003f;
  $  062.解锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0095;else y=@003f;
  $  063.解锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0095;else y=@003f;
  $  064.解锁记录5-退电                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0095;else y=@003f;
  $  065.解锁记录5-碰撞信号             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0095;else y=@003f;
  $  066.解锁记录5-钥匙在车内           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@0095;else y=@003f;
  $  067.解锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@0095;else y=@003f;
  $  068.解锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@0095;else y=@003f;
  $  069.解锁记录5-锁定防止             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@0095;else y=@003f;
  $  070.解锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@0095;else y=@003f;
  $  071.解锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@0095;else y=@003f;
  $  072.解锁记录5-硬线碰撞信号         $    $       $    $  ANS000.BYTE022  $  if(x1&0x08)y=@0095;else y=@003f;
  $  073.解锁记录5-CAN线碰撞信号        $    $       $    $  ANS000.BYTE022  $  if(x1&0x10)y=@0095;else y=@003f;
  $  074.解锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  075.解锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  if(x1==0x13)y=@0096;else y=@0097;
  $  076.解锁记录6-副驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0095;else y=@003f;
  $  077.解锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0095;else y=@003f;
  $  078.解锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0095;else y=@003f;
  $  079.解锁记录6-退电                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0095;else y=@003f;
  $  080.解锁记录6-碰撞信号             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0095;else y=@003f;
  $  081.解锁记录6-钥匙在车内           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@0095;else y=@003f;
  $  082.解锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@0095;else y=@003f;
  $  083.解锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@0095;else y=@003f;
  $  084.解锁记录6-锁定防止             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@0095;else y=@003f;
  $  085.解锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@0095;else y=@003f;
  $  086.解锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@0095;else y=@003f;
  $  087.解锁记录6-硬线碰撞信号         $    $       $    $  ANS000.BYTE026  $  if(x1&0x08)y=@0095;else y=@003f;
  $  088.解锁记录6-CAN线碰撞信号        $    $       $    $  ANS000.BYTE026  $  if(x1&0x10)y=@0095;else y=@003f;
  $  089.解锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  090.解锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  if(x1==0x13)y=@0096;else y=@0097;
  $  091.解锁记录7-副驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0095;else y=@003f;
  $  092.解锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0095;else y=@003f;
  $  093.解锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0095;else y=@003f;
  $  094.解锁记录7-退电                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0095;else y=@003f;
  $  095.解锁记录7-碰撞信号             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0095;else y=@003f;
  $  096.解锁记录7-钥匙在车内           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@0095;else y=@003f;
  $  097.解锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@0095;else y=@003f;
  $  098.解锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@0095;else y=@003f;
  $  099.解锁记录7-锁定防止             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@0095;else y=@003f;
  $  100.解锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@0095;else y=@003f;
  $  101.解锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@0095;else y=@003f;
  $  102.解锁记录7-硬线碰撞信号         $    $       $    $  ANS000.BYTE030  $  if(x1&0x08)y=@0095;else y=@003f;
  $  103.解锁记录7-CAN线碰撞信号        $    $       $    $  ANS000.BYTE030  $  if(x1&0x10)y=@0095;else y=@003f;
  $  104.解锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  105.解锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  if(x1==0x13)y=@0096;else y=@0097;
  $  106.解锁记录8-副驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0095;else y=@003f;
  $  107.解锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0095;else y=@003f;
  $  108.解锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0095;else y=@003f;
  $  109.解锁记录8-退电                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0095;else y=@003f;
  $  110.解锁记录8-碰撞信号             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0095;else y=@003f;
  $  111.解锁记录8-钥匙在车内           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@0095;else y=@003f;
  $  112.解锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@0095;else y=@003f;
  $  113.解锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@0095;else y=@003f;
  $  114.解锁记录8-锁定防止             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@0095;else y=@003f;
  $  115.解锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@0095;else y=@003f;
  $  116.解锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@0095;else y=@003f;
  $  117.解锁记录8-硬线碰撞信号         $    $       $    $  ANS000.BYTE034  $  if(x1&0x08)y=@0095;else y=@003f;
  $  118.解锁记录8-CAN线碰撞信号        $    $       $    $  ANS000.BYTE034  $  if(x1&0x10)y=@0095;else y=@003f;
  $  119.解锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.历史记录-行李箱解锁记录
  $  04.历史记录-行李箱解锁记录
  $  REQ000:721 03 22 01 0C 00 00 00 00       $  ANS000:729 03 22 01 0C 00 00 00 00

  $  000.行李箱解锁记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  if(x1==0x14)y=@0096;else y=@0097;
  $  001.行李箱解锁记录1-遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0095;else y=@003f;
  $  002.行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0095;else y=@003f;
  $  003.行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0095;else y=@003f;
  $  004.行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@0095;else y=@003f;
  $  005.行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0095;else y=@003f;
  $  006.行李箱解锁记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007.行李箱解锁记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  if(x1==0x14)y=@0096;else y=@0097;
  $  008.行李箱解锁记录2-遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@0095;else y=@003f;
  $  009.行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@0095;else y=@003f;
  $  010.行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@0095;else y=@003f;
  $  011.行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@0095;else y=@003f;
  $  012.行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@0095;else y=@003f;
  $  013.行李箱解锁记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014.行李箱解锁记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  if(x1==0x14)y=@0096;else y=@0097;
  $  015.行李箱解锁记录3-遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@0095;else y=@003f;
  $  016.行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@0095;else y=@003f;
  $  017.行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@0095;else y=@003f;
  $  018.行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@0095;else y=@003f;
  $  019.行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@0095;else y=@003f;
  $  020.行李箱解锁记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021.行李箱解锁记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  if(x1==0x14)y=@0096;else y=@0097;
  $  022.行李箱解锁记录4-遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@0095;else y=@003f;
  $  023.行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@0095;else y=@003f;
  $  024.行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@0095;else y=@003f;
  $  025.行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@0095;else y=@003f;
  $  026.行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@0095;else y=@003f;
  $  027.行李箱解锁记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028.行李箱解锁记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  if(x1==0x14)y=@0096;else y=@0097;
  $  029.行李箱解锁记录5-遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@0095;else y=@003f;
  $  030.行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@0095;else y=@003f;
  $  031.行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@0095;else y=@003f;
  $  032.行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@0095;else y=@003f;
  $  033.行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@0095;else y=@003f;
  $  034.行李箱解锁记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035.行李箱解锁记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  if(x1==0x14)y=@0096;else y=@0097;
  $  036.行李箱解锁记录6-遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@0095;else y=@003f;
  $  037.行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@0095;else y=@003f;
  $  038.行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@0095;else y=@003f;
  $  039.行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@0095;else y=@003f;
  $  040.行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@0095;else y=@003f;
  $  041.行李箱解锁记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042.行李箱解锁记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  if(x1==0x14)y=@0096;else y=@0097;
  $  043.行李箱解锁记录7-遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@0095;else y=@003f;
  $  044.行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@0095;else y=@003f;
  $  045.行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@0095;else y=@003f;
  $  046.行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@0095;else y=@003f;
  $  047.行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@0095;else y=@003f;
  $  048.行李箱解锁记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049.行李箱解锁记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  if(x1==0x14)y=@0096;else y=@0097;
  $  050.行李箱解锁记录8-遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@0095;else y=@003f;
  $  051.行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@0095;else y=@003f;
  $  052.行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@0095;else y=@003f;
  $  053.行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@0095;else y=@003f;
  $  054.行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@0095;else y=@003f;
  $  055.行李箱解锁记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.历史记录-启动失败记录
  $  05.历史记录-启动失败记录
  $  REQ000:721 03 22 01 0D 00 00 00 00       $  ANS000:729 03 22 01 0D 00 00 00 00

  $  000.启动失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  if(x1==0x15)y=@0096;else y=@0097;
  $  001.启动失败记录1-启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  002.启动失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.启动失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  if(x1==0x15)y=@0096;else y=@0097;
  $  004.启动失败记录2-启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  005.启动失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.启动失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  if(x1==0x15)y=@0096;else y=@0097;
  $  007.启动失败记录3-启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  008.启动失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.启动失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  if(x1==0x15)y=@0096;else y=@0097;
  $  010.启动失败记录4-启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  011.启动失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.启动失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  if(x1==0x15)y=@0096;else y=@0097;
  $  013.启动失败记录5-启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  014.启动失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.启动失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  if(x1==0x15)y=@0096;else y=@0097;
  $  016.启动失败记录6-启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  017.启动失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.启动失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  if(x1==0x15)y=@0096;else y=@0097;
  $  019.启动失败记录7-启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  020.启动失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.启动失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  if(x1==0x15)y=@0096;else y=@0097;
  $  022.启动失败记录8-启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@0098;else if(x1==0x02) y=@0099;else if(x1==0x03) y=@009a;else if(x1==0x04) y=@009b;else if(x1==0x05) y=@009c;else if(x1==0x06) y=@009d;else if(x1==0x07) y=@009e;else if(x1==0x08) y=@009f;else if(x1==0x09) y=@00a0;else if(x1==0x0A) y=@00a1;else if(x1==0x0B) y=@00a2;else y=@0002;
  $  023.启动失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.历史记录-退电失败记录
  $  06.历史记录-退电失败记录
  $  REQ000:721 03 22 01 0E 00 00 00 00       $  ANS000:729 03 22 01 0E 00 00 00 00

  $  000.退电失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  if(x1==0x16)y=@0096;else y=@0097;
  $  001.退电失败记录1-退电失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  002.退电失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.退电失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  if(x1==0x16)y=@0096;else y=@0097;
  $  004.退电失败记录2-退电失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  005.退电失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.退电失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  if(x1==0x16)y=@0096;else y=@0097;
  $  007.退电失败记录3-退电失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  008.退电失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.退电失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  if(x1==0x16)y=@0096;else y=@0097;
  $  010.退电失败记录4-退电失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  011.退电失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.退电失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  if(x1==0x16)y=@0096;else y=@0097;
  $  013.退电失败记录5-退电失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  014.退电失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.退电失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  if(x1==0x16)y=@0096;else y=@0097;
  $  016.退电失败记录6-退电失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  017.退电失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.退电失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  if(x1==0x16)y=@0096;else y=@0097;
  $  019.退电失败记录7-退电失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  020.退电失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.退电失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  if(x1==0x16)y=@0096;else y=@0097;
  $  022.退电失败记录8-退电失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00) y=@003f;else if(x1==0x01) y=@00a3;else if(x1==0x02) y=@009a;else if(x1==0x03) y=@009d;else if(x1==0x04) y=@00a4;else if(x1==0x05) y=@00a5;else if(x1==0x06) y=@00a6;else y=@0002;
  $  023.退电失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

动作测试:

$^ 00.左前门开锁测试 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 01 03 00 00 00     $^

$^BUTTON:左前门锁开锁 
$^REQ00:721 05 2F 20 01 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.乘客门开锁测试 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 02 03 00 00 00     $^

$^BUTTON:乘客门开锁 
$^REQ00:721 05 2F 20 02 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.四门闭锁测试 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 03 03 00 00 00     $^

$^BUTTON:四门闭锁 
$^REQ00:721 05 2F 20 03 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 03.背门开锁测试 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 04 03 00 00 00     $^

$^BUTTON:背门开锁 
$^REQ00:721 05 2F 20 04 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 04.后视镜折叠测试 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 06 03 00 00 00     $^

$^BUTTON:后视镜折叠 
$^REQ00:721 05 2F 20 06 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 05.后视镜展开测试 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 07 03 00 00 00     $^

$^BUTTON:后视镜展开 
$^REQ00:721 05 2F 20 07 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 06.左前门灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 08 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 08 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 07.左后门灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 09 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 09 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 08.右前门灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0A 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0A 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 09.右后门灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0B 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0B 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 10.左转向灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0C 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0C 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 11.右转向灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0D 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0D 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 12.后雾灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0F 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0F 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 13.倒车指示灯控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 10 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 10 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 14.橙色指示灯控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 11 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 11 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 15.绿色指示灯控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 12 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 12 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 16.室内灯(开关置于DOOR状态)测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 13 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 13 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 17.外后视镜照脚灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 14 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 14 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 18.ACC/ON状态指示灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 15 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 15 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 19.IG1继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 17 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 17 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 20.IG2继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 18 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 18 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 21.P档解锁测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 1A 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 1A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 22.转向轴锁继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 1D 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 1D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 23.ACC继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 1F 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 1F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 24.预配电测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 20 03 00 00 00     $^

$^BUTTON:通电 
$^REQ00:721 05 2F 20 20 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 25.防盗指示灯B10口测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 21 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 21 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 26.紧急制动灯B2口测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 24 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 24 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 27.充电照明口A11口测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 25 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 25 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 28.杂物箱照明灯测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 27 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 27 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 29.大灯洗涤继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 28 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 28 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 30.外后视镜照脚灯(非PWM(脉宽调制))测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 33 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 33 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 31.充电枪电锁解锁测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 37 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 37 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 32.充电枪电锁闭锁测试 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 38 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 38 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 33.超速闭锁定制 
$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 00 01 08 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 00 01 08 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 34.迎宾灯点亮时间定制 
$^TYPE0
$^BUTTON:OFF(关闭) 
$^REQ00:721 05 2F 00 03 08 00 00 00     $^

$^BUTTON:8S 
$^REQ00:721 05 2F 00 03 08 01 00 00     $^

$^BUTTON:15S 
$^REQ00:721 05 2F 00 03 08 03 00 00     $^

$^BUTTON:30S 
$^REQ00:721 05 2F 00 03 08 02 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 35.解锁驾驶门方式定制 
$^TYPE0
$^BUTTON:四门同步闭锁 
$^REQ00:721 05 2F 00 05 08 01 00 00     $^

$^BUTTON:只解锁驾驶门 
$^REQ00:721 05 2F 00 05 08 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 36.室内灯点亮时间定制 
$^TYPE0
$^BUTTON:OFF(关闭) 
$^REQ00:721 05 2F 00 06 08 00 00 00     $^

$^BUTTON:8S 
$^REQ00:721 05 2F 00 06 08 01 00 00     $^

$^BUTTON:15S 
$^REQ00:721 05 2F 00 06 08 03 00 00     $^

$^BUTTON:30S 
$^REQ00:721 05 2F 00 06 08 02 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 37.自动上锁时间定制 
$^TYPE0
$^BUTTON:30S 
$^REQ00:721 05 2F 00 07 08 01 00 00     $^

$^BUTTON:60S 
$^REQ00:721 05 2F 00 07 08 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 38.所有定制信息恢复默认值 
$^TYPE0
$^BUTTON:恢复默认值 
$^REQ00:721 04 2F 10 00 01 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:721 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
