
    车型ID：210e

    模拟：协议模拟-->210e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 02 19 FF 00 00 00 00 00       $#  ANS000:7E8 02 19 FF 00 00 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  帧长控制故障码个数，从$#ANS000.BYTE5$#开始每$#4$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/ae090000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 92 00 00 00 00       $%  ANS000:7E8 03 22 F1 92 00 00 00 00
  $%  REQ001:7E0 03 22 F1 94 00 00 00 00       $%  ANS001:7E8 03 22 F1 94 00 00 00 00
  $%  REQ002:7E0 03 22 F1 95 00 00 00 00       $%  ANS002:7E8 03 22 F1 95 00 00 00 00
  $%  REQ003:7E0 03 22 F1 99 00 00 00 00       $%  ANS003:7E8 03 22 F1 99 00 00 00 00
  $%  REQ004:7E0 03 22 F1 90 00 00 00 00       $%  ANS004:7E8 03 22 F1 90 00 00 00 00

  $%  000:硬件编号:           $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  001:软件编号:           $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:软件版本号:         $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2);
  $%  003:编程日期:           $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X%02X%s%02X%s%02X%s],x1,x2,@0038,x3,@0039,x4,@003a);
  $%  004:学习到的VIN:        $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000.发动机转速                                  $    $  rpm          $    $  ANS000.BYTE036  $  y=((x1<<8)+x2)*1.0/4;
  $  001.电源电压                                    $    $  V            $    $  ANS000.BYTE035  $  y=x1*1.0/10;
  $  002.目标怠速(有补偿)                            $    $  rpm          $    $  ANS000.BYTE039  $  y=x1*10;
  $  003.进气压力                                    $    $  kPa          $    $  ANS000.BYTE046  $  y=x1;
  $  004.冷却液温度                                  $    $  degree C     $    $  ANS000.BYTE042  $  y=x1-40;
  $  005.目标油压                                    $    $  bar          $    $  ANS000.BYTE108  $  y=x1;
  $  006.实际油压                                    $    $  bar          $    $  ANS000.BYTE110  $  y=x1;
  $  007.油压调节阀占空比                            $    $  %            $    $  ANS000.BYTE111  $  y=x1*100*1.0/255;
  $  008.节气门开度                                  $    $  %            $    $  ANS000.BYTE055  $  y=((x1<<8)+x2)*1.0/10;
  $  009.节气门目标开度                              $    $  %            $    $  ANS000.BYTE049  $  y=((x1<<8)+x2)*1.0/10;
  $  010.加速踏板位置                                $    $  %            $    $  ANS000.BYTE105  $  y=((x1<<8)+x2)*1.0/10;
  $  011.充磁时间                                    $    $  毫秒         $    $  ANS000.BYTE063  $  y=x1*1.0/10;
  $  012.进气相位原始值                              $    $  °           $    $  ANS000.BYTE131  $  y=((x1<<8)+x2)-100;
  $  013.喷油脉宽                                    $    $  毫秒         $    $  ANS000.BYTE064  $  y=x1*1.0/10;
  $  014.进气流量                                    $    $  kg/h         $    $  ANS000.BYTE047  $  y=((x1<<8)+x2)*1.0/10;
  $  015.目标怠速(无补偿)                            $    $  rpm          $    $  ANS000.BYTE038  $  y=x1*10;
  $  016.车速                                        $    $  km/h         $    $  ANS000.BYTE040  $  y=x1;
  $  017.运行里程                                    $    $  km           $    $  ANS000.BYTE092  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  018.运行时间                                    $    $  分钟         $    $  ANS000.BYTE096  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  019.进气温度                                    $    $  degree C     $    $  ANS000.BYTE044  $  y=x1-40;
  $  020.增压气体温度                                $    $  degree C     $    $  ANS000.BYTE117  $  y=x1-40;
  $  021.目标增压压力                                $    $  kPa          $    $  ANS000.BYTE113  $  y=x1;
  $  022.实际增压压力                                $    $  kPa          $    $  ANS000.BYTE115  $  y=x1;
  $  023.目标进气相位                                $    $  °           $    $  ANS000.BYTE126  $  y=((x1<<8)+x2)-100;
  $  024.进气相位                                    $    $  °           $    $  ANS000.BYTE124  $  y=((x1<<8)+x2)-100;
  $  025.大气压力值                                  $    $  kPa          $    $  ANS000.BYTE120  $  y=x1;
  $  026.海拔校正                                    $    $  %            $    $  ANS000.BYTE121  $  y=x1*100*1.0/255;
  $  027.制动助力器压力                              $    $  kPa          $    $  ANS000.BYTE112  $  y=x1;
  $  028.点火提前角                                  $    $  °           $    $  ANS000.BYTE065  $  y=x1-50;
  $  029.空燃比                                      $    $  %            $    $  ANS000.BYTE128  $  y=x1*1.0/10;
  $  030.巡航设定车速                                $    $  km/h         $    $  ANS000.BYTE142  $  y=x1;
  $  031.爆震传感器1                                 $    $               $    $  ANS000.BYTE069  $  y=(x1<<8)+x2;
  $  032.爆震传感器2                                 $    $               $    $  ANS000.BYTE071  $  y=(x1<<8)+x2;
  $  033.1组氧传感器电压,传感器1(氧传感器1)          $    $  V            $    $  ANS000.BYTE081  $  y=x1*1.0/255;
  $  034.1组氧传感器电压,传感器2(氧传感器2)          $    $  V            $    $  ANS000.BYTE082  $  y=x1*1.0/255;
  $  035.1组氧传感器积分值(短期修正)                 $    $               $    $  ANS000.BYTE079  $  y=x1*1.0/128;
  $  036.1组氧传感器积分值(长期修正)                 $    $               $    $  ANS000.BYTE085  $  y=x1*1.0/128;
  $  037.1缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE073  $  y=x1*1.0/10;
  $  038.2缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE074  $  y=x1*1.0/10;
  $  039.3缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE075  $  y=x1*1.0/10;
  $  040.4缸推迟点火爆震控制                         $    $  °           $    $  ANS000.BYTE076  $  y=x1*1.0/10;
  $  041.发电机励磁开度                              $    $  %            $    $  ANS000.BYTE144  $  y=x1*100*1.0/255;
  $  042.发电机目标电压                              $    $  V            $    $  ANS000.BYTE145  $  y=x1*1.0/10;
  $  043.发电机励磁电流限值                          $    $  A            $    $  ANS000.BYTE146  $  y=x1*1.0/10;
  $  044.发电机实发电压                              $    $  V            $    $  ANS000.BYTE148  $  y=x1*1.0/10;
  $  045.发电机励磁电流                              $    $  A            $    $  ANS000.BYTE149  $  y=x1*1.0/10;
  $  046.发电机负载响应时间                          $    $  秒           $    $  ANS000.BYTE150  $  y=x1;
  $  047.电池传感器电压(LIN)                         $    $  V            $    $  ANS000.BYTE157  $  y=x1*1.0/10;
  $  048.低压油压                                    $    $  bar          $    $  ANS000.BYTE158  $  y=x1*1.0/10;
  $  049.低压油压传感器电压                          $    $  V            $    $  ANS000.BYTE159  $  y=x1*1.0/51;
  $  050.制动压力传感器电压                          $    $  V            $    $  ANS000.BYTE160  $  y=x1*1.0/51;
  $  051.排气相位                                    $    $  °           $    $  ANS000.BYTE161  $  y=((x1<<8)+x2)-100;
  $  052.目标排气相位                                $    $  °           $    $  ANS000.BYTE163  $  y=((x1<<8)+x2)-100;
  $  053.排气相位原始值                              $    $  °           $    $  ANS000.BYTE166  $  y=((x1<<8)+x2)-100;
  $  054.空调压力                                    $    $  MPa          $    $  ANS000.BYTE067  $  y=((x1<<8)+x2)*1.0/1000;
  $  055.无级风扇占空比                              $    $  %            $    $  ANS000.BYTE102  $  y=x1*100*1.0/255;
  $  056.增压压力限制阀占空比                        $    $  %            $    $  ANS000.BYTE122  $  y=x1*100*1.0/255;
  $  057.计算节气门位置                              $    $  %            $    $  ANS000.BYTE057  $  y=x1*100*1.0/255;
  $  058.节气门电机PWM(脉宽调制)                     $    $  %            $    $  ANS000.BYTE058  $  y=x1*100*1.0/255;
  $  059.碳罐阀占空比                                $    $  %            $    $  ANS000.BYTE062  $  y=x1*100*1.0/255;
  $  060.旁通气量                                    $    $               $    $  ANS000.BYTE141  $  y=(((x1&0x0F)*4096)+x2*16+x3*15.0/255);
  $  061.冷却液温度传感器                            $    $  V            $    $  ANS000.BYTE041  $  y=x1*1.0/51;
  $  062.进气温度传感器                              $    $  V            $    $  ANS000.BYTE043  $  y=x1*1.0/51;
  $  063.进气压力传感器                              $    $  V            $    $  ANS000.BYTE045  $  y=x1*1.0/51;
  $  064.节气门位置传感器1                           $    $  V            $    $  ANS000.BYTE051  $  y=((x1<<8)+x2)*1.0/13107;
  $  065.节气门位置传感器2                           $    $  V            $    $  ANS000.BYTE053  $  y=((x1<<8)+x2)*1.0/13107;
  $  066.增压压力传感器                              $    $  V            $    $  ANS000.BYTE114  $  y=x1*1.0/51;
  $  067.增压气体温度传感器                          $    $  V            $    $  ANS000.BYTE116  $  y=x1*1.0/51;
  $  068.加速踏板1信号                               $    $  V            $    $  ANS000.BYTE103  $  y=x1*1.0/51;
  $  069.加速踏板2信号                               $    $  V            $    $  ANS000.BYTE104  $  y=x1*1.0/51;
  $  070.油压传感器                                  $    $  V            $    $  ANS000.BYTE109  $  y=x1*1.0/51;
  $  071.空调压力传感器                              $    $  V            $    $  ANS000.BYTE066  $  y=x1*1.0/51;
  $  072.巡航开关电压                                $    $  V            $    $  ANS000.BYTE143  $  y=x1*1.0/51;
  $  073.自动启停控制1-启停功能主开关                $    $               $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0001;else y=@0000;
  $  074.自动启停控制1-AC关联                        $    $               $    $  ANS000.BYTE021  $  if(x1&0x02) y=@01c7;else y=@01c8;
  $  075.发动机防盗解锁-ECU发送码验证结果            $    $               $    $  ANS000.BYTE022  $  if(x1&0x01) y=@001f;else y=@0020;
  $  076.发动机防盗解锁-IKey发送码验证结果           $    $               $    $  ANS000.BYTE022  $  if(x1&0x02) y=@001f;else y=@0020;
  $  077.发动机防盗解锁-ECU新旧状态                  $    $               $    $  ANS000.BYTE022  $  if(x1&0x04) y=@0021;else y=@0022;
  $  078.发动机冷却系统-低速风扇是否开启             $    $               $    $  ANS000.BYTE023  $  if(x1&0x01) y=@001b;else y=@001c;
  $  079.发动机冷却系统-高速风扇是否开启             $    $               $    $  ANS000.BYTE023  $  if(x1&0x02) y=@001b;else y=@001c;
  $  080.发动机冷却系统-风扇类型                     $    $               $    $  ANS000.BYTE023  $  switxh(x1&0x0C)0x00: y=@0023;0x04: y=@0024;default: y=@0002;
  $  081.发动机稳态工况-点火电源开启                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x01) y=@001b;else y=@001c;
  $  082.发动机稳态工况-主继电器工作                 $    $               $    $  ANS000.BYTE024  $  if(x1&0x02) y=@001b;else y=@001c;
  $  083.发动机动态工况-节气门处于怠速位置           $    $               $    $  ANS000.BYTE025  $  if(x1&0x01) y=@001b;else y=@001c;
  $  084.发动机动态工况-节气门处于部分打开位置       $    $               $    $  ANS000.BYTE025  $  if(x1&0x02) y=@001b;else y=@001c;
  $  085.发动机动态工况-节气门处于全开位置           $    $               $    $  ANS000.BYTE025  $  if(x1&0x04) y=@001b;else y=@001c;
  $  086.发动机动态工况-激活减速断油                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x08) y=@000e;else y=@000f;
  $  087.发动机动态工况-激活加速加浓                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x10) y=@000e;else y=@000f;
  $  088.发动机动态工况-是否D档(前进档)              $    $               $    $  ANS000.BYTE025  $  if(x1&0x20) y=@001b;else y=@001c;
  $  089.发动机动态工况-是否R档(后退档)              $    $               $    $  ANS000.BYTE025  $  if(x1&0x40) y=@001b;else y=@001c;
  $  090.发动机动态工况-是否N档(空档)                $    $               $    $  ANS000.BYTE025  $  if(x1&0x80) y=@001b;else y=@001c;
  $  091.氧传感器-氧传感器1信号                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x01) y=@001d;else y=@001e;
  $  092.氧传感器-氧传感器2信号                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x02) y=@001d;else y=@001e;
  $  093.氧传感器-氧传感器1加热                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x10) y=@00be;else y=@00bf;
  $  094.氧传感器-氧传感器2加热                      $    $               $    $  ANS000.BYTE027  $  if(x1&0x20) y=@00be;else y=@00bf;
  $  095.发动机怠速-踏板位置确认怠速                 $    $               $    $  ANS000.BYTE028  $  if(x1&0x01) y=@001b;else y=@001c;
  $  096.发动机怠速-制动器状态                       $    $               $    $  ANS000.BYTE028  $  if(x1&0x02) y=@0003;else y=@00c0;
  $  097.发动机怠速-是否有空调请求                   $    $               $    $  ANS000.BYTE028  $  if(x1&0x04) y=@001b;else y=@001c;
  $  098.发动机怠速-后车窗/前风挡玻璃加热            $    $               $    $  ANS000.BYTE028  $  if(x1&0x08) y=@0001;else y=@0000;
  $  099.发动机怠速-动力转向开关                     $    $               $    $  ANS000.BYTE028  $  if(x1&0x10) y=@0001;else y=@0000;
  $  100.发动机怠速-真空泵状态                       $    $               $    $  ANS000.BYTE028  $  if(x1&0x40) y=@0001;else y=@0000;
  $  101.指示灯SVS/MIL-MIL(故障指示灯)激活           $    $               $    $  ANS000.BYTE029  $  if(x1&0x01) y=@000e;else y=@000f;
  $  102.指示灯SVS/MIL-MIL(故障指示灯)闪烁           $    $               $    $  ANS000.BYTE029  $  if(x1&0x02) y=@001b;else y=@001c;
  $  103.指示灯SVS/充电系统故障灯                    $    $               $    $  ANS000.BYTE029  $  if(x1&0x04) y=@0045;else y=@0046;
  $  104.指示灯SVS/MIL-SVS(系统维修指示灯)激活       $    $               $    $  ANS000.BYTE029  $  if(x1&0x10) y=@000e;else y=@000f;
  $  105.指示灯SVS/MIL-SVS(系统维修指示灯)闪烁       $    $               $    $  ANS000.BYTE029  $  if(x1&0x20) y=@001b;else y=@001c;
  $  106.空调系统-空调开启                           $    $               $    $  ANS000.BYTE031  $  if(x1&0x01) y=@001b;else y=@001c;
  $  107.空调系统-空调请求激活                       $    $               $    $  ANS000.BYTE031  $  if(x1&0x02) y=@000e;else y=@000f;
  $  108.空调系统-空调压缩机开                       $    $               $    $  ANS000.BYTE031  $  if(x1&0x04) y=@001b;else y=@001c;
  $  109.空调系统-空调断开或无空调                   $    $               $    $  ANS000.BYTE031  $  if(x1&0x08) y=@001b;else y=@001c;
  $  110.空调系统-空调因温度断开                     $    $               $    $  ANS000.BYTE031  $  if(x1&0x10) y=@001b;else y=@001c;
  $  111.空调系统-怠速转速因空调而增加               $    $               $    $  ANS000.BYTE031  $  if(x1&0x20) y=@001b;else y=@001c;
  $  112.空调系统-全负荷时关闭空调压缩机             $    $               $    $  ANS000.BYTE031  $  if(x1&0x40) y=@001b;else y=@001c;
  $  113.空调系统-空调中压开关开                     $    $               $    $  ANS000.BYTE031  $  if(x1&0x80) y=@001b;else y=@001c;
  $  114.AT/扭矩请求-AT转换离合器激活                $    $               $    $  ANS000.BYTE032  $  if(x1&0x08) y=@000e;else y=@000f;
  $  115.巡航控制-巡航功能                           $    $               $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0001;else y=@0000;
  $  116.巡航控制-巡航状态                           $    $               $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0093;else y=@003f;
  $  117.巡航控制-按键状态                           $    $               $    $  ANS000.BYTE033  $  switxh(x1&0x1C)0x00: y=@00b5;0x04: y=@00b6;0x08: y=@00b7;0x0C: y=@00b8;0x10: y=@00b9;0x14: y=@00ba;default: y=@0002;
  $  118.发动机状态-刹车开关激活                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x01) y=@000e;else y=@000f;
  $  119.发动机状态-刹车灯激活                       $    $               $    $  ANS000.BYTE034  $  if(x1&0x02) y=@000e;else y=@000f;
  $  120.发动机状态-涡轮增压旁通阀                   $    $               $    $  ANS000.BYTE034  $  if(x1&0x10) y=@0001;else y=@0000;
  $  121.发动机状态-防盗锁定状态                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x20) y=@0067;else y=@00bd;
  $  122.发动机状态-燃油反馈状态                     $    $               $    $  ANS000.BYTE034  $  if(x1&0x40) y=@00bb;else y=@00bc;
  $  123.发动机状态-可变气门升程阀状态(VVL阀)        $    $               $    $  ANS000.BYTE034  $  if(x1&0x80) y=@0001;else y=@0000;

;******************************************************************************************************************************************************

动作测试:

$^ 00.发动机故障(MIL)指示灯控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 10 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 10 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 10 00 00 00 00     $^

$^TIP:操作说明： 1.整车上ON档电 
;----------------------------------------------------------------------------------------------------

$^ 01.碳罐控制阀控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 01 11 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 01 11 00 00 00 00     $^

$^DSP:碳罐控制阀控制->%
$^TIP:操作说明： 1.整车上ON档电 
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1/0.39216;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 02.冷却风扇#1(低速风扇)控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 13 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 13 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 13 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 2.关闭操作时冷却液温度不能高于90℃，否则操作无效 
;----------------------------------------------------------------------------------------------------

$^ 03.冷却风扇#2(高速风扇)控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 14 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 14 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 14 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 2.关闭操作时冷却液温度不能高于90℃，否则操作无效 
;----------------------------------------------------------------------------------------------------

$^ 04.空调离合器控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 15 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 15 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 15 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 2.发动机停止工作 
;----------------------------------------------------------------------------------------------------

$^ 05.车辆立即维修(SVS)指示灯控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 18 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 18 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 18 00 00 00 00     $^

$^TIP:操作条件 1.整车上ON档电 
;----------------------------------------------------------------------------------------------------

$^ 06.禁用燃油喷射控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:禁止喷射#1缸 
$^REQ00:7E0 06 2F 01 20 03 00 01 00     $^

$^BUTTON:启动喷射#1缸 
$^REQ00:7E0 06 2F 01 20 03 FF 01 00     $^

$^BUTTON:禁止喷射#2缸 
$^REQ00:7E0 06 2F 01 20 03 00 02 00     $^

$^BUTTON:启动喷射#2缸 
$^REQ00:7E0 06 2F 01 20 03 FF 02 00     $^

$^BUTTON:禁止喷射#3缸 
$^REQ00:7E0 06 2F 01 20 03 00 03 00     $^

$^BUTTON:启动喷射#3缸 
$^REQ00:7E0 06 2F 01 20 03 FF 03 00     $^

$^BUTTON:禁止喷射#4缸 
$^REQ00:7E0 06 2F 01 20 03 00 04 00     $^

$^BUTTON:启动喷射#4缸 
$^REQ00:7E0 06 2F 01 20 03 FF 04 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 20 00 00 00 00     $^

$^TIP:操作条件： 1.发动机工作中 2.车速为0，车速传感器无故障 3.禁止同时关闭2个或以上喷油器 
;----------------------------------------------------------------------------------------------------

$^ 07.长期调整怠速转速 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 01 24 08 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 01 24 00 00 00 00     $^

$^DSP:长期调整怠速转速->转/分钟
$^TIP:操作条件： 1.发动机工作时短期调整需低于1000RPM(转/分)，停止工作时无限制 2.长期调整无限制 
$^TIP:请输入测试值(范围:500~2500) 
$^IN_F:y=((x1<<8)+x2)/10;
$^RANGE:500,2500
;----------------------------------------------------------------------------------------------------

$^ 08.短期调整怠速转速 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 01 24 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 01 24 00 00 00 00     $^

$^DSP:短期调整怠速转速->转/分钟
$^TIP:操作条件： 1.发动机工作时短期调整需低于1000RPM(转/分)，停止工作时无限制 2.长期调整无限制 
$^TIP:请输入测试值(范围:500~2500) 
$^IN_F:y=((x1<<8)+x2)/10;
$^RANGE:500,2500
;----------------------------------------------------------------------------------------------------

$^ 09.制动真空泵控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 FB 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 FB 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 FB 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电，发动机停止工作 
;----------------------------------------------------------------------------------------------------

$^ 10.涡轮增压旁通阀控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 FD 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 FD 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 FD 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电，发动机停止工作 
;----------------------------------------------------------------------------------------------------

$^ 11.无级风扇控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 01 FE 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 01 FE 00 00 00 00     $^

$^DSP:无级风扇控制->%
$^TIP:操作条件： 1.整车上ON档电，发动机停止工作 
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1/0.39216;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 12.增压压力限制阀控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 02 00 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 02 00 00 00 00 00     $^

$^DSP:增压压力限制阀控制->%
$^TIP:操作条件： 1.整车上ON档电，发动机停止工作 
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1/0.39216;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 13.节气门开度控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 02 02 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 02 02 00 00 00 00     $^

$^DSP:节气门开度控制->%
$^TIP:操作条件： 1.整车上ON档电，发动机停止工作 
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1/0.39216;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 14.清除修正值 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:清除点火提前角长期修正 
$^REQ00:7E0 05 2F 02 03 03 01 00 00     $^

$^BUTTON:清除燃油长期修正值 
$^REQ00:7E0 05 2F 02 03 03 02 00 00     $^

$^BUTTON:清除怠速长期修正 
$^REQ00:7E0 05 2F 02 03 03 03 00 00     $^

$^BUTTON:清除所有修正值 
$^REQ00:7E0 05 2F 02 03 03 FF 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 
;----------------------------------------------------------------------------------------------------

$^ 15.风扇类型设定控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:两级风扇 
$^REQ00:7E0 05 2F 02 05 03 00 00 00     $^

$^BUTTON:无级风扇 
$^REQ00:7E0 05 2F 02 05 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 02 05 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 2.发动机停止工作 
;----------------------------------------------------------------------------------------------------

$^ 16.巡航开关灯控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 02 09 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 02 09 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 02 09 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 2.发动机停止工作 
;----------------------------------------------------------------------------------------------------

$^ 17.巡航状态灯控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 02 0A 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 02 0A 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 02 0A 00 00 00 00     $^

$^TIP:操作条件 1.整车上ON档电 2.发动机停止工作 
;----------------------------------------------------------------------------------------------------

$^ 18.巡航车速设定 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 02 0B 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 02 0B 00 00 00 00     $^

$^DSP:巡航车速设定
$^TIP:操作条件 1.发动机工作中，车辆行驶中 2.巡航功能开 3.车辆处于巡航状态 
$^TIP:请输入测试值(范围:40~160) 
$^IN_F:y=x1;
$^RANGE:40,160
;----------------------------------------------------------------------------------------------------

$^ 19.启停主开关灯控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 02 0E 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 02 0E 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 02 0E 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 2.发动机停止工作 
;----------------------------------------------------------------------------------------------------

$^ 20.低压油泵占空比控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 02 0F 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 02 0F 00 00 00 00     $^

$^DSP:低压油泵占空比控制->%
$^TIP:操作条件： 1.整车上ON档电 2.发动机停止工作 
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1/0.39216;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 21.排气凸轮轴控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:7E0 05 2F 02 10 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:7E0 04 2F 02 10 00 00 00 00     $^

$^DSP:排气凸轮轴控制->%
$^TIP:操作条件： 1.整车上ON档电 2.发动机停止工作 
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1/0.39216;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 22.充电系统故障灯控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 02 11 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 02 11 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 02 11 00 00 00 00     $^

$^TIP:操作条件： 1.整车上ON档电 
;----------------------------------------------------------------------------------------------------

$^ 23.齿讯学习控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 02 12 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 02 12 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 02 12 00 00 00 00     $^

$^TIP:操作条件： 1.发动机启动中 2.整车P档位 3.快踩油门到最大并保持住，发动机转速大概会在1300rpm-3800rpm之间进行2-5个循环 4.最后在1200rpm附近趋于稳定，此时自学习完成，松开油门踏板 
;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:7E0 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
