
    车型ID：2429

    模拟：协议模拟-->2429

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~729

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 03 19 02 09 00 00 00 00       $#  ANS000:729 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f7000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 04 14 FF FF FF 00 00 00       $$  ANS000:729 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 F1 93 00 00 00 00       $%  ANS000:729 03 22 F1 93 00 00 00 00
  $%  REQ001:721 03 22 F1 94 00 00 00 00       $%  ANS001:729 03 22 F1 94 00 00 00 00
  $%  REQ002:721 03 22 F1 95 00 00 00 00       $%  ANS002:729 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1/100,(x1/10)%10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%.2d.%.2d],(x1*256+x2)/10000,((x1*256+x2)%10000)/100,(x1*256+x2)%100);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000.左前门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@0001;else y=@0000;
  $  001.右前门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@0001;else y=@0000;
  $  002.左后门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@0001;else y=@0000;
  $  003.右后门灯开关                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@0001;else y=@0000;
  $  004.后背门解锁开关                      $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@0001;else y=@0000;
  $  005.左前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x20) y=@0067;else y=@0068;
  $  006.左后门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x40) y=@0067;else y=@0068;
  $  007.右前门锁状态                        $    $       $    $  ANS000.BYTE004  $  if(x1&0x80) y=@0067;else y=@0068;
  $  008.右后门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0067;else y=@0068;
  $  009.后背门锁状态                        $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0067;else y=@0068;
  $  010.发动机前舱盖状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0001;else y=@0000;
  $  011.安全带未系信号检测状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0091;else y=@0092;
  $  012.12V制动信号状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0093;else y=@003f;
  $  013.0V制动灯开关状态                    $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0093;else y=@003f;
  $  014.启动按钮1脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@007b;else y=@0094;
  $  015.启动按钮4脚状态                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@007b;else y=@0094;
  $  016.CAN线中控锁闭锁开关状态             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@007b;else y=@003f;
  $  017.CAN线中控锁解锁开关状态             $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@007b;else y=@003f;
  $  018.硬线中控锁闭锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@007b;else y=@003f;
  $  019.硬线中控锁解锁开关状态              $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@007b;else y=@003f;
  $  020.IG1电状态                           $    $       $    $  ANS000.BYTE006  $  if(x1&0x80) y=@014d;else y=@014f;
  $  021.ACC电状态                           $    $       $    $  ANS000.BYTE007  $  if(x1&0x01) y=@014d;else y=@014f;
  $  022.机械钥匙闭锁开关状态(预留)          $    $       $    $  ANS000.BYTE007  $  if(x1&0x08) y=@0068;else y=@003f;
  $  023.机械钥匙解锁开关状态(预留)          $    $       $    $  ANS000.BYTE007  $  if(x1&0x10) y=@0067;else y=@003f;
  $  024.行李箱安全系统开启状态(预留)        $    $       $    $  ANS000.BYTE007  $  if(x1&0x20) y=@0001;else y=@0000;
  $  025.开关状态(SwitchState)               $    $       $    $  ANS000.BYTE007  $  if(x1&0x40) y=@0001;else y=@0000;
  $  026.近光灯硬件开关状态                  $    $       $    $  ANS000.BYTE008  $  if(x1&0x20) y=@0093;else y=@003f;
  $  027.门锁保护状态                        $    $       $    $  ANS000.BYTE009  $  switxh(x1&0x06)0x00: y=@0045;0x02: y=@008e;0x04: y=@008f;0x06: y=@0090;default: y=@0002;
  $  028.前碰撞信号状态(PWM(脉宽调制))       $    $       $    $  ANS000.BYTE009  $  switxh(x1&0x30)0x00: y=@008b;0x10: y=@008c;0x20: y=@008d;default: y=@0002;

  $)  01.历史记录
  $  01.历史记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00
  $  REQ001:721 03 22 01 0B 00 00 00 00       $  ANS001:729 03 22 01 0B 00 00 00 00
  $  REQ002:721 03 22 01 0C 00 00 00 00       $  ANS002:729 03 22 01 0C 00 00 00 00
  $  REQ003:721 03 22 01 0D 00 00 00 00       $  ANS003:729 03 22 01 0D 00 00 00 00
  $  REQ004:721 03 22 01 0E 00 00 00 00       $  ANS004:729 03 22 01 0E 00 00 00 00

  $  000.闭锁记录1-记录有效性                       $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  001.闭锁记录1-副驶中控开关                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@0095;else y=@003f;
  $  002.闭锁记录1-主驾中控开关                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@0095;else y=@003f;
  $  003.闭锁记录1-遥控                             $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@0095;else y=@003f;
  $  004.闭锁记录1-超速                             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@0095;else y=@003f;
  $  005.闭锁记录1-自动返回防盗                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@0095;else y=@003f;
  $  006.闭锁记录1-左前门微动开关                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@0095;else y=@003f;
  $  007.闭锁记录1-右前门微动开关                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@0095;else y=@003f;
  $  008.闭锁记录1-后背门微动开关                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@0095;else y=@003f;
  $  009.闭锁记录1-远程控制                         $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@0095;else y=@003f;
  $  010.闭锁记录1-自动设定防盗                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@0095;else y=@003f;
  $  011.闭锁记录1-数据索引                         $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  012.闭锁记录2-记录有效性                       $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  013.闭锁记录2-副驶中控开关                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@0095;else y=@003f;
  $  014.闭锁记录2-主驾中控开关                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@0095;else y=@003f;
  $  015.闭锁记录2-遥控                             $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@0095;else y=@003f;
  $  016.闭锁记录2-超速                             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@0095;else y=@003f;
  $  017.闭锁记录2-自动返回防盗                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@0095;else y=@003f;
  $  018.闭锁记录2-左前门微动开关                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@0095;else y=@003f;
  $  019.闭锁记录2-右前门微动开关                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@0095;else y=@003f;
  $  020.闭锁记录2-后背门微动开关                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@0095;else y=@003f;
  $  021.闭锁记录2-远程控制                         $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@0095;else y=@003f;
  $  022.闭锁记录2-自动设定防盗                     $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@0095;else y=@003f;
  $  023.闭锁记录2-数据索引                         $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  024.闭锁记录3-记录有效性                       $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  025.闭锁记录3-副驶中控开关                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@0095;else y=@003f;
  $  026.闭锁记录3-主驾中控开关                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@0095;else y=@003f;
  $  027.闭锁记录3-遥控                             $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@0095;else y=@003f;
  $  028.闭锁记录3-超速                             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@0095;else y=@003f;
  $  029.闭锁记录3-自动返回防盗                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@0095;else y=@003f;
  $  030.闭锁记录3-左前门微动开关                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@0095;else y=@003f;
  $  031.闭锁记录3-右前门微动开关                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@0095;else y=@003f;
  $  032.闭锁记录3-后背门微动开关                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@0095;else y=@003f;
  $  033.闭锁记录3-远程控制                         $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@0095;else y=@003f;
  $  034.闭锁记录3-自动设定防盗                     $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@0095;else y=@003f;
  $  035.闭锁记录3-数据索引                         $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  036.闭锁记录4-记录有效性                       $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  037.闭锁记录4-副驶中控开关                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@0095;else y=@003f;
  $  038.闭锁记录4-主驾中控开关                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@0095;else y=@003f;
  $  039.闭锁记录4-遥控                             $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@0095;else y=@003f;
  $  040.闭锁记录4-超速                             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@0095;else y=@003f;
  $  041.闭锁记录4-自动返回防盗                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@0095;else y=@003f;
  $  042.闭锁记录4-左前门微动开关                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@0095;else y=@003f;
  $  043.闭锁记录4-右前门微动开关                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@0095;else y=@003f;
  $  044.闭锁记录4-后背门微动开关                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@0095;else y=@003f;
  $  045.闭锁记录4-远程控制                         $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@0095;else y=@003f;
  $  046.闭锁记录4-自动设定防盗                     $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@0095;else y=@003f;
  $  047.闭锁记录4-数据索引                         $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  048.闭锁记录5-记录有效性                       $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  049.闭锁记录5-副驶中控开关                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@0095;else y=@003f;
  $  050.闭锁记录5-主驾中控开关                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@0095;else y=@003f;
  $  051.闭锁记录5-遥控                             $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@0095;else y=@003f;
  $  052.闭锁记录5-超速                             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@0095;else y=@003f;
  $  053.闭锁记录5-自动返回防盗                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@0095;else y=@003f;
  $  054.闭锁记录5-左前门微动开关                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@0095;else y=@003f;
  $  055.闭锁记录5-右前门微动开关                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@0095;else y=@003f;
  $  056.闭锁记录5-后背门微动开关                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@0095;else y=@003f;
  $  057.闭锁记录5-远程控制                         $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@0095;else y=@003f;
  $  058.闭锁记录5-自动设定防盗                     $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@0095;else y=@003f;
  $  059.闭锁记录5-数据索引                         $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  060.闭锁记录6-记录有效性                       $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  061.闭锁记录6-副驶中控开关                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@0095;else y=@003f;
  $  062.闭锁记录6-主驾中控开关                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@0095;else y=@003f;
  $  063.闭锁记录6-遥控                             $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@0095;else y=@003f;
  $  064.闭锁记录6-超速                             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@0095;else y=@003f;
  $  065.闭锁记录6-自动返回防盗                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@0095;else y=@003f;
  $  066.闭锁记录6-左前门微动开关                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@0095;else y=@003f;
  $  067.闭锁记录6-右前门微动开关                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@0095;else y=@003f;
  $  068.闭锁记录6-后背门微动开关                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@0095;else y=@003f;
  $  069.闭锁记录6-远程控制                         $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@0095;else y=@003f;
  $  070.闭锁记录6-自动设定防盗                     $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@0095;else y=@003f;
  $  071.闭锁记录6-数据索引                         $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  072.闭锁记录7-记录有效性                       $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  073.闭锁记录7-副驶中控开关                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@0095;else y=@003f;
  $  074.闭锁记录7-主驾中控开关                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@0095;else y=@003f;
  $  075.闭锁记录7-遥控                             $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@0095;else y=@003f;
  $  076.闭锁记录7-超速                             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@0095;else y=@003f;
  $  077.闭锁记录7-自动返回防盗                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@0095;else y=@003f;
  $  078.闭锁记录7-左前门微动开关                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@0095;else y=@003f;
  $  079.闭锁记录7-右前门微动开关                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@0095;else y=@003f;
  $  080.闭锁记录7-后背门微动开关                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@0095;else y=@003f;
  $  081.闭锁记录7-远程控制                         $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@0095;else y=@003f;
  $  082.闭锁记录7-自动设定防盗                     $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@0095;else y=@003f;
  $  083.闭锁记录7-数据索引                         $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  084.闭锁记录8-记录有效性                       $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x12: y=@0096;default: y=@0097;
  $  085.闭锁记录8-副驶中控开关                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@0095;else y=@003f;
  $  086.闭锁记录8-主驾中控开关                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@0095;else y=@003f;
  $  087.闭锁记录8-遥控                             $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@0095;else y=@003f;
  $  088.闭锁记录8-超速                             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@0095;else y=@003f;
  $  089.闭锁记录8-自动返回防盗                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@0095;else y=@003f;
  $  090.闭锁记录8-左前门微动开关                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@0095;else y=@003f;
  $  091.闭锁记录8-右前门微动开关                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@0095;else y=@003f;
  $  092.闭锁记录8-后背门微动开关                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@0095;else y=@003f;
  $  093.闭锁记录8-远程控制                         $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@0095;else y=@003f;
  $  094.闭锁记录8-自动设定防盗                     $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@0095;else y=@003f;
  $  095.闭锁记录8-数据索引                         $    $       $    $  ANS000.BYTE035  $  y=x1;
  $  096.解锁记录1-记录有效性                       $    $       $    $  ANS001.BYTE004  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  097.解锁记录1-副驶中控开关                     $    $       $    $  ANS001.BYTE005  $  if(x1&0x01) y=@0095;else y=@003f;
  $  098.解锁记录1-主驾中控开关                     $    $       $    $  ANS001.BYTE005  $  if(x1&0x02) y=@0095;else y=@003f;
  $  099.解锁记录1-遥控                             $    $       $    $  ANS001.BYTE005  $  if(x1&0x04) y=@0095;else y=@003f;
  $  100.解锁记录1-退电                             $    $       $    $  ANS001.BYTE005  $  if(x1&0x08) y=@0095;else y=@003f;
  $  101.解锁记录1-碰撞信号                         $    $       $    $  ANS001.BYTE005  $  if(x1&0x10) y=@0095;else y=@003f;
  $  102.解锁记录1-钥匙在车内                       $    $       $    $  ANS001.BYTE005  $  if(x1&0x20) y=@0095;else y=@003f;
  $  103.解锁记录1-左前门微动开关                   $    $       $    $  ANS001.BYTE005  $  if(x1&0x40) y=@0095;else y=@003f;
  $  104.解锁记录1-右前门微动开关                   $    $       $    $  ANS001.BYTE005  $  if(x1&0x80) y=@0095;else y=@003f;
  $  105.解锁记录1-锁定防止                         $    $       $    $  ANS001.BYTE006  $  if(x1&0x01) y=@0095;else y=@003f;
  $  106.解锁记录1-后背门微动开关                   $    $       $    $  ANS001.BYTE006  $  if(x1&0x02) y=@0095;else y=@003f;
  $  107.解锁记录1-远程控制                         $    $       $    $  ANS001.BYTE006  $  if(x1&0x04) y=@0095;else y=@003f;
  $  108.解锁记录1-硬线碰撞信号                     $    $       $    $  ANS001.BYTE006  $  if(x1&0x08) y=@0095;else y=@003f;
  $  109.解锁记录1-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE006  $  if(x1&0x10) y=@0095;else y=@003f;
  $  110.解锁记录1-数据索引                         $    $       $    $  ANS001.BYTE007  $  y=x1;
  $  111.解锁记录2-记录有效性                       $    $       $    $  ANS001.BYTE008  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  112.解锁记录2-副驶中控开关                     $    $       $    $  ANS001.BYTE009  $  if(x1&0x01) y=@0095;else y=@003f;
  $  113.解锁记录2-主驾中控开关                     $    $       $    $  ANS001.BYTE009  $  if(x1&0x02) y=@0095;else y=@003f;
  $  114.解锁记录2-遥控                             $    $       $    $  ANS001.BYTE009  $  if(x1&0x04) y=@0095;else y=@003f;
  $  115.解锁记录2-退电                             $    $       $    $  ANS001.BYTE009  $  if(x1&0x08) y=@0095;else y=@003f;
  $  116.解锁记录2-碰撞信号                         $    $       $    $  ANS001.BYTE009  $  if(x1&0x10) y=@0095;else y=@003f;
  $  117.解锁记录2-钥匙在车内                       $    $       $    $  ANS001.BYTE009  $  if(x1&0x20) y=@0095;else y=@003f;
  $  118.解锁记录2-左前门微动开关                   $    $       $    $  ANS001.BYTE009  $  if(x1&0x40) y=@0095;else y=@003f;
  $  119.解锁记录2-右前门微动开关                   $    $       $    $  ANS001.BYTE009  $  if(x1&0x80) y=@0095;else y=@003f;
  $  120.解锁记录2-锁定防止                         $    $       $    $  ANS001.BYTE010  $  if(x1&0x01) y=@0095;else y=@003f;
  $  121.解锁记录2-后背门微动开关                   $    $       $    $  ANS001.BYTE010  $  if(x1&0x02) y=@0095;else y=@003f;
  $  122.解锁记录2-远程控制                         $    $       $    $  ANS001.BYTE010  $  if(x1&0x04) y=@0095;else y=@003f;
  $  123.解锁记录2-硬线碰撞信号                     $    $       $    $  ANS001.BYTE010  $  if(x1&0x08) y=@0095;else y=@003f;
  $  124.解锁记录2-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE010  $  if(x1&0x10) y=@0095;else y=@003f;
  $  125.解锁记录2-数据索引                         $    $       $    $  ANS001.BYTE011  $  y=x1;
  $  126.解锁记录3-记录有效性                       $    $       $    $  ANS001.BYTE012  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  127.解锁记录3-副驶中控开关                     $    $       $    $  ANS001.BYTE013  $  if(x1&0x01) y=@0095;else y=@003f;
  $  128.解锁记录3-主驾中控开关                     $    $       $    $  ANS001.BYTE013  $  if(x1&0x02) y=@0095;else y=@003f;
  $  129.解锁记录3-遥控                             $    $       $    $  ANS001.BYTE013  $  if(x1&0x04) y=@0095;else y=@003f;
  $  130.解锁记录3-退电                             $    $       $    $  ANS001.BYTE013  $  if(x1&0x08) y=@0095;else y=@003f;
  $  131.解锁记录3-碰撞信号                         $    $       $    $  ANS001.BYTE013  $  if(x1&0x10) y=@0095;else y=@003f;
  $  132.解锁记录3-钥匙在车内                       $    $       $    $  ANS001.BYTE013  $  if(x1&0x20) y=@0095;else y=@003f;
  $  133.解锁记录3-左前门微动开关                   $    $       $    $  ANS001.BYTE013  $  if(x1&0x40) y=@0095;else y=@003f;
  $  134.解锁记录3-右前门微动开关                   $    $       $    $  ANS001.BYTE013  $  if(x1&0x80) y=@0095;else y=@003f;
  $  135.解锁记录3-锁定防止                         $    $       $    $  ANS001.BYTE014  $  if(x1&0x01) y=@0095;else y=@003f;
  $  136.解锁记录3-后背门微动开关                   $    $       $    $  ANS001.BYTE014  $  if(x1&0x02) y=@0095;else y=@003f;
  $  137.解锁记录3-远程控制                         $    $       $    $  ANS001.BYTE014  $  if(x1&0x04) y=@0095;else y=@003f;
  $  138.解锁记录3-硬线碰撞信号                     $    $       $    $  ANS001.BYTE014  $  if(x1&0x08) y=@0095;else y=@003f;
  $  139.解锁记录3-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE014  $  if(x1&0x10) y=@0095;else y=@003f;
  $  140.解锁记录3-数据索引                         $    $       $    $  ANS001.BYTE015  $  y=x1;
  $  141.解锁记录4-记录有效性                       $    $       $    $  ANS001.BYTE016  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  142.解锁记录4-副驶中控开关                     $    $       $    $  ANS001.BYTE017  $  if(x1&0x01) y=@0095;else y=@003f;
  $  143.解锁记录4-主驾中控开关                     $    $       $    $  ANS001.BYTE017  $  if(x1&0x02) y=@0095;else y=@003f;
  $  144.解锁记录4-遥控                             $    $       $    $  ANS001.BYTE017  $  if(x1&0x04) y=@0095;else y=@003f;
  $  145.解锁记录4-退电                             $    $       $    $  ANS001.BYTE017  $  if(x1&0x08) y=@0095;else y=@003f;
  $  146.解锁记录4-碰撞信号                         $    $       $    $  ANS001.BYTE017  $  if(x1&0x10) y=@0095;else y=@003f;
  $  147.解锁记录4-钥匙在车内                       $    $       $    $  ANS001.BYTE017  $  if(x1&0x20) y=@0095;else y=@003f;
  $  148.解锁记录4-左前门微动开关                   $    $       $    $  ANS001.BYTE017  $  if(x1&0x40) y=@0095;else y=@003f;
  $  149.解锁记录4-右前门微动开关                   $    $       $    $  ANS001.BYTE017  $  if(x1&0x80) y=@0095;else y=@003f;
  $  150.解锁记录4-锁定防止                         $    $       $    $  ANS001.BYTE018  $  if(x1&0x01) y=@0095;else y=@003f;
  $  151.解锁记录4-后背门微动开关                   $    $       $    $  ANS001.BYTE018  $  if(x1&0x02) y=@0095;else y=@003f;
  $  152.解锁记录4-远程控制                         $    $       $    $  ANS001.BYTE018  $  if(x1&0x04) y=@0095;else y=@003f;
  $  153.解锁记录4-硬线碰撞信号                     $    $       $    $  ANS001.BYTE018  $  if(x1&0x08) y=@0095;else y=@003f;
  $  154.解锁记录4-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE018  $  if(x1&0x10) y=@0095;else y=@003f;
  $  155.解锁记录4-数据索引                         $    $       $    $  ANS001.BYTE019  $  y=x1;
  $  156.解锁记录5-记录有效性                       $    $       $    $  ANS001.BYTE020  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  157.解锁记录5-副驶中控开关                     $    $       $    $  ANS001.BYTE021  $  if(x1&0x01) y=@0095;else y=@003f;
  $  158.解锁记录5-主驾中控开关                     $    $       $    $  ANS001.BYTE021  $  if(x1&0x02) y=@0095;else y=@003f;
  $  159.解锁记录5-遥控                             $    $       $    $  ANS001.BYTE021  $  if(x1&0x04) y=@0095;else y=@003f;
  $  160.解锁记录5-退电                             $    $       $    $  ANS001.BYTE021  $  if(x1&0x08) y=@0095;else y=@003f;
  $  161.解锁记录5-碰撞信号                         $    $       $    $  ANS001.BYTE021  $  if(x1&0x10) y=@0095;else y=@003f;
  $  162.解锁记录5-钥匙在车内                       $    $       $    $  ANS001.BYTE021  $  if(x1&0x20) y=@0095;else y=@003f;
  $  163.解锁记录5-左前门微动开关                   $    $       $    $  ANS001.BYTE021  $  if(x1&0x40) y=@0095;else y=@003f;
  $  164.解锁记录5-右前门微动开关                   $    $       $    $  ANS001.BYTE021  $  if(x1&0x80) y=@0095;else y=@003f;
  $  165.解锁记录5-锁定防止                         $    $       $    $  ANS001.BYTE022  $  if(x1&0x01) y=@0095;else y=@003f;
  $  166.解锁记录5-后背门微动开关                   $    $       $    $  ANS001.BYTE022  $  if(x1&0x02) y=@0095;else y=@003f;
  $  167.解锁记录5-远程控制                         $    $       $    $  ANS001.BYTE022  $  if(x1&0x04) y=@0095;else y=@003f;
  $  168.解锁记录5-硬线碰撞信号                     $    $       $    $  ANS001.BYTE022  $  if(x1&0x08) y=@0095;else y=@003f;
  $  169.解锁记录5-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE022  $  if(x1&0x10) y=@0095;else y=@003f;
  $  170.解锁记录5-数据索引                         $    $       $    $  ANS001.BYTE023  $  y=x1;
  $  171.解锁记录6-记录有效性                       $    $       $    $  ANS001.BYTE024  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  172.解锁记录6-副驶中控开关                     $    $       $    $  ANS001.BYTE025  $  if(x1&0x01) y=@0095;else y=@003f;
  $  173.解锁记录6-主驾中控开关                     $    $       $    $  ANS001.BYTE025  $  if(x1&0x02) y=@0095;else y=@003f;
  $  174.解锁记录6-遥控                             $    $       $    $  ANS001.BYTE025  $  if(x1&0x04) y=@0095;else y=@003f;
  $  175.解锁记录6-退电                             $    $       $    $  ANS001.BYTE025  $  if(x1&0x08) y=@0095;else y=@003f;
  $  176.解锁记录6-碰撞信号                         $    $       $    $  ANS001.BYTE025  $  if(x1&0x10) y=@0095;else y=@003f;
  $  177.解锁记录6-钥匙在车内                       $    $       $    $  ANS001.BYTE025  $  if(x1&0x20) y=@0095;else y=@003f;
  $  178.解锁记录6-左前门微动开关                   $    $       $    $  ANS001.BYTE025  $  if(x1&0x40) y=@0095;else y=@003f;
  $  179.解锁记录6-右前门微动开关                   $    $       $    $  ANS001.BYTE025  $  if(x1&0x80) y=@0095;else y=@003f;
  $  180.解锁记录6-锁定防止                         $    $       $    $  ANS001.BYTE026  $  if(x1&0x01) y=@0095;else y=@003f;
  $  181.解锁记录6-后背门微动开关                   $    $       $    $  ANS001.BYTE026  $  if(x1&0x02) y=@0095;else y=@003f;
  $  182.解锁记录6-远程控制                         $    $       $    $  ANS001.BYTE026  $  if(x1&0x04) y=@0095;else y=@003f;
  $  183.解锁记录6-硬线碰撞信号                     $    $       $    $  ANS001.BYTE026  $  if(x1&0x08) y=@0095;else y=@003f;
  $  184.解锁记录6-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE026  $  if(x1&0x10) y=@0095;else y=@003f;
  $  185.解锁记录6-数据索引                         $    $       $    $  ANS001.BYTE027  $  y=x1;
  $  186.解锁记录7-记录有效性                       $    $       $    $  ANS001.BYTE028  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  187.解锁记录7-副驶中控开关                     $    $       $    $  ANS001.BYTE029  $  if(x1&0x01) y=@0095;else y=@003f;
  $  188.解锁记录7-主驾中控开关                     $    $       $    $  ANS001.BYTE029  $  if(x1&0x02) y=@0095;else y=@003f;
  $  189.解锁记录7-遥控                             $    $       $    $  ANS001.BYTE029  $  if(x1&0x04) y=@0095;else y=@003f;
  $  190.解锁记录7-退电                             $    $       $    $  ANS001.BYTE029  $  if(x1&0x08) y=@0095;else y=@003f;
  $  191.解锁记录7-碰撞信号                         $    $       $    $  ANS001.BYTE029  $  if(x1&0x10) y=@0095;else y=@003f;
  $  192.解锁记录7-钥匙在车内                       $    $       $    $  ANS001.BYTE029  $  if(x1&0x20) y=@0095;else y=@003f;
  $  193.解锁记录7-左前门微动开关                   $    $       $    $  ANS001.BYTE029  $  if(x1&0x40) y=@0095;else y=@003f;
  $  194.解锁记录7-右前门微动开关                   $    $       $    $  ANS001.BYTE029  $  if(x1&0x80) y=@0095;else y=@003f;
  $  195.解锁记录7-锁定防止                         $    $       $    $  ANS001.BYTE030  $  if(x1&0x01) y=@0095;else y=@003f;
  $  196.解锁记录7-后背门微动开关                   $    $       $    $  ANS001.BYTE030  $  if(x1&0x02) y=@0095;else y=@003f;
  $  197.解锁记录7-远程控制                         $    $       $    $  ANS001.BYTE030  $  if(x1&0x04) y=@0095;else y=@003f;
  $  198.解锁记录7-硬线碰撞信号                     $    $       $    $  ANS001.BYTE030  $  if(x1&0x08) y=@0095;else y=@003f;
  $  199.解锁记录7-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE030  $  if(x1&0x10) y=@0095;else y=@003f;
  $  200.解锁记录7-数据索引                         $    $       $    $  ANS001.BYTE031  $  y=x1;
  $  201.解锁记录8-记录有效性                       $    $       $    $  ANS001.BYTE032  $  switxh(x1)0x13: y=@0096;default: y=@0097;
  $  202.解锁记录8-副驶中控开关                     $    $       $    $  ANS001.BYTE033  $  if(x1&0x01) y=@0095;else y=@003f;
  $  203.解锁记录8-主驾中控开关                     $    $       $    $  ANS001.BYTE033  $  if(x1&0x02) y=@0095;else y=@003f;
  $  204.解锁记录8-遥控                             $    $       $    $  ANS001.BYTE033  $  if(x1&0x04) y=@0095;else y=@003f;
  $  205.解锁记录8-退电                             $    $       $    $  ANS001.BYTE033  $  if(x1&0x08) y=@0095;else y=@003f;
  $  206.解锁记录8-碰撞信号                         $    $       $    $  ANS001.BYTE033  $  if(x1&0x10) y=@0095;else y=@003f;
  $  207.解锁记录8-钥匙在车内                       $    $       $    $  ANS001.BYTE033  $  if(x1&0x20) y=@0095;else y=@003f;
  $  208.解锁记录8-左前门微动开关                   $    $       $    $  ANS001.BYTE033  $  if(x1&0x40) y=@0095;else y=@003f;
  $  209.解锁记录8-右前门微动开关                   $    $       $    $  ANS001.BYTE033  $  if(x1&0x80) y=@0095;else y=@003f;
  $  210.解锁记录8-锁定防止                         $    $       $    $  ANS001.BYTE034  $  if(x1&0x01) y=@0095;else y=@003f;
  $  211.解锁记录8-后背门微动开关                   $    $       $    $  ANS001.BYTE034  $  if(x1&0x02) y=@0095;else y=@003f;
  $  212.解锁记录8-远程控制                         $    $       $    $  ANS001.BYTE034  $  if(x1&0x04) y=@0095;else y=@003f;
  $  213.解锁记录8-硬线碰撞信号                     $    $       $    $  ANS001.BYTE034  $  if(x1&0x08) y=@0095;else y=@003f;
  $  214.解锁记录8-CAN线碰撞信号                    $    $       $    $  ANS001.BYTE034  $  if(x1&0x10) y=@0095;else y=@003f;
  $  215.解锁记录8-数据索引                         $    $       $    $  ANS001.BYTE035  $  y=x1;
  $  216.行李箱解锁记录1-记录有效性                 $    $       $    $  ANS002.BYTE004  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  217.行李箱解锁记录1-遥控信号                   $    $       $    $  ANS002.BYTE005  $  if(x1&0x01) y=@0095;else y=@003f;
  $  218.行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS002.BYTE005  $  if(x1&0x02) y=@0095;else y=@003f;
  $  219.行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE005  $  if(x1&0x04) y=@0095;else y=@003f;
  $  220.行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS002.BYTE005  $  if(x1&0x08) y=@0095;else y=@003f;
  $  221.行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS002.BYTE005  $  if(x1&0x10) y=@0095;else y=@003f;
  $  222.行李箱解锁记录1-数据索引                   $    $       $    $  ANS002.BYTE007  $  y=x1;
  $  223.行李箱解锁记录2-记录有效性                 $    $       $    $  ANS002.BYTE008  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  224.行李箱解锁记录2-遥控信号                   $    $       $    $  ANS002.BYTE009  $  if(x1&0x01) y=@0095;else y=@003f;
  $  225.行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS002.BYTE009  $  if(x1&0x02) y=@0095;else y=@003f;
  $  226.行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE009  $  if(x1&0x04) y=@0095;else y=@003f;
  $  227.行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS002.BYTE009  $  if(x1&0x08) y=@0095;else y=@003f;
  $  228.行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS002.BYTE009  $  if(x1&0x10) y=@0095;else y=@003f;
  $  229.行李箱解锁记录2-数据索引                   $    $       $    $  ANS002.BYTE011  $  y=x1;
  $  230.行李箱解锁记录3-记录有效性                 $    $       $    $  ANS002.BYTE012  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  231.行李箱解锁记录3-遥控信号                   $    $       $    $  ANS002.BYTE013  $  if(x1&0x01) y=@0095;else y=@003f;
  $  232.行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS002.BYTE013  $  if(x1&0x02) y=@0095;else y=@003f;
  $  233.行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE013  $  if(x1&0x04) y=@0095;else y=@003f;
  $  234.行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS002.BYTE013  $  if(x1&0x08) y=@0095;else y=@003f;
  $  235.行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS002.BYTE013  $  if(x1&0x10) y=@0095;else y=@003f;
  $  236.行李箱解锁记录3-数据索引                   $    $       $    $  ANS002.BYTE015  $  y=x1;
  $  237.行李箱解锁记录4-记录有效性                 $    $       $    $  ANS002.BYTE016  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  238.行李箱解锁记录4-遥控信号                   $    $       $    $  ANS002.BYTE017  $  if(x1&0x01) y=@0095;else y=@003f;
  $  239.行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS002.BYTE017  $  if(x1&0x02) y=@0095;else y=@003f;
  $  240.行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE017  $  if(x1&0x04) y=@0095;else y=@003f;
  $  241.行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS002.BYTE017  $  if(x1&0x08) y=@0095;else y=@003f;
  $  242.行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS002.BYTE017  $  if(x1&0x10) y=@0095;else y=@003f;
  $  243.行李箱解锁记录4-数据索引                   $    $       $    $  ANS002.BYTE019  $  y=x1;
  $  244.行李箱解锁记录5-记录有效性                 $    $       $    $  ANS002.BYTE020  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  245.行李箱解锁记录5-遥控信号                   $    $       $    $  ANS002.BYTE021  $  if(x1&0x01) y=@0095;else y=@003f;
  $  246.行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS002.BYTE021  $  if(x1&0x02) y=@0095;else y=@003f;
  $  247.行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE021  $  if(x1&0x04) y=@0095;else y=@003f;
  $  248.行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS002.BYTE021  $  if(x1&0x08) y=@0095;else y=@003f;
  $  249.行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS002.BYTE021  $  if(x1&0x10) y=@0095;else y=@003f;
  $  250.行李箱解锁记录5-数据索引                   $    $       $    $  ANS002.BYTE023  $  y=x1;
  $  251.行李箱解锁记录6-记录有效性                 $    $       $    $  ANS002.BYTE024  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  252.行李箱解锁记录6-遥控信号                   $    $       $    $  ANS002.BYTE025  $  if(x1&0x01) y=@0095;else y=@003f;
  $  253.行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS002.BYTE025  $  if(x1&0x02) y=@0095;else y=@003f;
  $  254.行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE025  $  if(x1&0x04) y=@0095;else y=@003f;
  $  255.行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS002.BYTE025  $  if(x1&0x08) y=@0095;else y=@003f;
  $  256.行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS002.BYTE025  $  if(x1&0x10) y=@0095;else y=@003f;
  $  257.行李箱解锁记录6-数据索引                   $    $       $    $  ANS002.BYTE027  $  y=x1;
  $  258.行李箱解锁记录7-记录有效性                 $    $       $    $  ANS002.BYTE028  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  259.行李箱解锁记录7-遥控信号                   $    $       $    $  ANS002.BYTE029  $  if(x1&0x01) y=@0095;else y=@003f;
  $  260.行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS002.BYTE029  $  if(x1&0x02) y=@0095;else y=@003f;
  $  261.行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE029  $  if(x1&0x04) y=@0095;else y=@003f;
  $  262.行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS002.BYTE029  $  if(x1&0x08) y=@0095;else y=@003f;
  $  263.行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS002.BYTE029  $  if(x1&0x10) y=@0095;else y=@003f;
  $  264.行李箱解锁记录7-数据索引                   $    $       $    $  ANS002.BYTE031  $  y=x1;
  $  265.行李箱解锁记录8-记录有效性                 $    $       $    $  ANS002.BYTE032  $  switxh(x1)0x14: y=@0096;default: y=@0097;
  $  266.行李箱解锁记录8-遥控信号                   $    $       $    $  ANS002.BYTE033  $  if(x1&0x01) y=@0095;else y=@003f;
  $  267.行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS002.BYTE033  $  if(x1&0x02) y=@0095;else y=@003f;
  $  268.行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS002.BYTE033  $  if(x1&0x04) y=@0095;else y=@003f;
  $  269.行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS002.BYTE033  $  if(x1&0x08) y=@0095;else y=@003f;
  $  270.行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS002.BYTE033  $  if(x1&0x10) y=@0095;else y=@003f;
  $  271.行李箱解锁记录8-数据索引                   $    $       $    $  ANS002.BYTE035  $  y=x1;
  $  272.启动失败记录1-记录有效性                   $    $       $    $  ANS003.BYTE004  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  273.启动失败记录1-启动失败原因                 $    $       $    $  ANS003.BYTE005  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  274.启动失败记录1-数据索引                     $    $       $    $  ANS003.BYTE007  $  y=x1;
  $  275.启动失败记录2-记录有效性                   $    $       $    $  ANS003.BYTE008  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  276.启动失败记录2-启动失败原因                 $    $       $    $  ANS003.BYTE009  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  277.启动失败记录2-数据索引                     $    $       $    $  ANS003.BYTE011  $  y=x1;
  $  278.启动失败记录3-记录有效性                   $    $       $    $  ANS003.BYTE012  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  279.启动失败记录3-启动失败原因                 $    $       $    $  ANS003.BYTE013  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  280.启动失败记录3-数据索引                     $    $       $    $  ANS003.BYTE015  $  y=x1;
  $  281.启动失败记录4-记录有效性                   $    $       $    $  ANS003.BYTE016  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  282.启动失败记录4-启动失败原因                 $    $       $    $  ANS003.BYTE017  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  283.启动失败记录4-数据索引                     $    $       $    $  ANS003.BYTE019  $  y=x1;
  $  284.启动失败记录5-记录有效性                   $    $       $    $  ANS003.BYTE020  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  285.启动失败记录5-启动失败原因                 $    $       $    $  ANS003.BYTE021  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  286.启动失败记录5-数据索引                     $    $       $    $  ANS003.BYTE023  $  y=x1;
  $  287.启动失败记录6-记录有效性                   $    $       $    $  ANS003.BYTE024  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  288.启动失败记录6-启动失败原因                 $    $       $    $  ANS003.BYTE025  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  289.启动失败记录6-数据索引                     $    $       $    $  ANS003.BYTE027  $  y=x1;
  $  290.启动失败记录7-记录有效性                   $    $       $    $  ANS003.BYTE028  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  291.启动失败记录7-启动失败原因                 $    $       $    $  ANS003.BYTE029  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  292.启动失败记录7-数据索引                     $    $       $    $  ANS003.BYTE031  $  y=x1;
  $  293.启动失败记录8-记录有效性                   $    $       $    $  ANS003.BYTE032  $  switxh(x1)0x15: y=@0096;default: y=@0097;
  $  294.启动失败记录8-启动失败原因                 $    $       $    $  ANS003.BYTE033  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@009a;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@06e4;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;default: y=@0002;
  $  295.启动失败记录8-数据索引                     $    $       $    $  ANS003.BYTE035  $  y=x1;
  $  296.退电失败记录1-记录有效性                   $    $       $    $  ANS004.BYTE004  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  297.退电失败记录1-退电失败原因                 $    $       $    $  ANS004.BYTE005  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  298.退电失败记录1-数据索引                     $    $       $    $  ANS004.BYTE007  $  y=x1;
  $  299.退电失败记录2-记录有效性                   $    $       $    $  ANS004.BYTE008  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  300.退电失败记录2-退电失败原因                 $    $       $    $  ANS004.BYTE009  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  301.退电失败记录2-数据索引                     $    $       $    $  ANS004.BYTE011  $  y=x1;
  $  302.退电失败记录3-记录有效性                   $    $       $    $  ANS004.BYTE012  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  303.退电失败记录3-退电失败原因                 $    $       $    $  ANS004.BYTE013  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  304.退电失败记录3-数据索引                     $    $       $    $  ANS004.BYTE015  $  y=x1;
  $  305.退电失败记录4-记录有效性                   $    $       $    $  ANS004.BYTE016  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  306.退电失败记录4-退电失败原因                 $    $       $    $  ANS004.BYTE017  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  307.退电失败记录4-数据索引                     $    $       $    $  ANS004.BYTE019  $  y=x1;
  $  308.退电失败记录5-记录有效性                   $    $       $    $  ANS004.BYTE020  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  309.退电失败记录5-退电失败原因                 $    $       $    $  ANS004.BYTE021  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  310.退电失败记录5-数据索引                     $    $       $    $  ANS004.BYTE023  $  y=x1;
  $  311.退电失败记录6-记录有效性                   $    $       $    $  ANS004.BYTE024  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  312.退电失败记录6-退电失败原因                 $    $       $    $  ANS004.BYTE025  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  313.退电失败记录6-数据索引                     $    $       $    $  ANS004.BYTE027  $  y=x1;
  $  314.退电失败记录7-记录有效性                   $    $       $    $  ANS004.BYTE028  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  315.退电失败记录7-退电失败原因                 $    $       $    $  ANS004.BYTE029  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  316.退电失败记录7-数据索引                     $    $       $    $  ANS004.BYTE031  $  y=x1;
  $  317.退电失败记录8-记录有效性                   $    $       $    $  ANS004.BYTE032  $  switxh(x1)0x16: y=@0096;default: y=@0097;
  $  318.退电失败记录8-退电失败原因                 $    $       $    $  ANS004.BYTE033  $  switxh(x1)0x00: y=@003f;0x01: y=@00a3;0x02: y=@009a;0x03: y=@009d;0x04: y=@00a4;0x05: y=@00a5;0x06: y=@00a6;default: y=@0002;
  $  319.退电失败记录8-数据索引                     $    $       $    $  ANS004.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

动作测试:

$^ 00.左前门开锁测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:左前门锁开锁 
$^REQ00:721 05 2F 20 01 03 01 00 00     $^

$^BUTTON:无动作 
$^REQ00:721 05 2F 20 01 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.乘客门开锁测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:乘客门开锁 
$^REQ00:721 05 2F 20 02 03 01 00 00     $^

$^BUTTON:无动作 
$^REQ00:721 05 2F 20 02 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.四门闭锁测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:四门闭锁 
$^REQ00:721 05 2F 20 03 03 01 00 00     $^

$^BUTTON:无动作 
$^REQ00:721 05 2F 20 03 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 03.背门开锁测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:背门开锁 
$^REQ00:721 05 2F 20 04 03 01 00 00     $^

$^BUTTON:无动作 
$^REQ00:721 05 2F 20 04 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 04.后视镜折叠测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:后视镜折叠 
$^REQ00:721 05 2F 20 06 03 01 00 00     $^

$^BUTTON:无动作 
$^REQ00:721 05 2F 20 06 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 05.后视镜展开测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:后视镜展开 
$^REQ00:721 05 2F 20 07 03 01 00 00     $^

$^BUTTON:无动作 
$^REQ00:721 05 2F 20 07 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 06.左前门灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 08 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 08 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 07.左后门灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 09 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 09 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 08.右前门灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0A 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0A 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 09.右后门灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0B 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0B 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 10.左转向灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0C 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0C 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 11.右转向灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0D 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0D 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 12.后雾灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 0F 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 0F 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 13.倒车指示灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 10 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 10 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 14.橙色指示灯控制 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 11 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 11 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 15.绿色指示灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 12 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 12 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 16.室内灯(开关置于DOOR状态)测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 13 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 13 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 17.外后视镜照脚灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 14 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 14 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 18.ACC/ON状态指示灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 15 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 15 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 19.IG1继电器测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 17 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 17 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 20.IG2继电器测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 18 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 18 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 21.转向轴锁继电器测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 1D 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 1D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 22.ACC继电器测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 1F 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 1F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 23.预配电测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 20 03 00 00 00     $^

$^BUTTON:通电 
$^REQ00:721 05 2F 20 20 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 24.防盗指示灯B10口测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 21 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 21 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 25.行李箱照明灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 23 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 23 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 26.紧急制动灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 24 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 24 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 27.充电照明口A11口测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 25 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 25 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 28.充电枪电锁解锁测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:解锁 
$^REQ00:721 05 2F 20 37 03 01 00 00     $^

$^BUTTON:无效 
$^REQ00:721 05 2F 20 37 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 29.充电枪电锁闭锁测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:闭锁 
$^REQ00:721 05 2F 20 38 03 01 00 00     $^

$^BUTTON:无效 
$^REQ00:721 05 2F 20 38 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 30.油箱电池阀继电器测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 3D 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 3D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 31.交流充电口盖闭锁测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:闭锁 
$^REQ00:721 05 2F 20 3E 03 01 00 00     $^

$^BUTTON:无效 
$^REQ00:721 05 2F 20 3E 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 32.变道盲区开关指示灯测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 20 3F 03 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 20 3F 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 33.铅酸电池智能充电测试 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:启动智能充电 
$^REQ00:721 05 2F 20 40 03 01 00 00     $^

$^BUTTON:无效 
$^REQ00:721 05 2F 20 40 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 34.超速闭锁定制 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:721 05 2F 00 01 08 01 00 00     $^

$^BUTTON:关闭 
$^REQ00:721 05 2F 00 01 08 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 35.迎宾灯点亮时间定制 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:OFF(关闭) 
$^REQ00:721 05 2F 00 03 08 00 00 00     $^

$^BUTTON:8s 
$^REQ00:721 05 2F 00 03 08 01 00 00     $^

$^BUTTON:15s 
$^REQ00:721 05 2F 00 03 08 03 00 00     $^

$^BUTTON:30s 
$^REQ00:721 05 2F 00 03 08 02 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 36.解锁驾驶门方式定制 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:四门同步闭锁 
$^REQ00:721 05 2F 00 05 08 01 00 00     $^

$^BUTTON:只解锁驾驶门 
$^REQ00:721 05 2F 00 05 08 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 37.室内灯点亮时间定制 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:OFF(关闭) 
$^REQ00:721 05 2F 00 06 08 00 00 00     $^

$^BUTTON:8s 
$^REQ00:721 05 2F 00 06 08 01 00 00     $^

$^BUTTON:15s 
$^REQ00:721 05 2F 00 06 08 03 00 00     $^

$^BUTTON:30s 
$^REQ00:721 05 2F 00 06 08 02 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 38.自动上锁时间定制 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:30s 
$^REQ00:721 05 2F 00 07 08 01 00 00     $^

$^BUTTON:60s 
$^REQ00:721 05 2F 00 07 08 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 39.所有定制信息恢复默认值 
$^IN  REQ00:721 02 10 01 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:恢复默认值 
$^REQ00:721 04 2F 10 00 01 00 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:721 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
