
    车型ID：2f07

    模拟：协议模拟-->2f07

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E9

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/9e000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 93 00 00 00 00       $%  ANS000:7E9 03 22 F1 93 00 00 00 00
  $%  REQ001:7E1 03 22 F1 94 00 00 00 00       $%  ANS001:7E9 03 22 F1 94 00 00 00 00
  $%  REQ002:7E1 03 22 F1 95 00 00 00 00       $%  ANS002:7E9 03 22 F1 95 00 00 00 00
  $%  REQ003:7E1 03 22 F1 80 00 00 00 00       $%  ANS003:7E9 03 22 F1 80 00 00 00 00

  $%  000:硬件版本:                     $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:                     $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  002:软件编号:                     $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:                     $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:                     $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  005:修改次数:                     $%    $%  ANS002.BYTE009  $%  y=x1;
  $%  006:boot版本号:                   $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%d%s%d%s%d%s],x1+2000,@0038,x2,@0521,x3,@0522);
  $%  007:boot版本信息/软件版本:        $%    $%  ANS003.BYTE007  $%  y=SPRINTF([%d.%d],x1/10,x1%10);
  $%  008:boot版本信息/次要信息:        $%    $%  ANS003.BYTE008  $%  y=x1;
  $%  009:boot版本信息/MCU型号:         $%    $%  ANS003.BYTE009  $%  y=x1;
  $%  010:发布日期:                     $%    $%  ANS003.BYTE010  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 0C 00 00 00 00 00       $  ANS000:7E9 03 22 0C 00 00 00 00 00
  $  REQ001:7E1 03 22 0C 01 00 00 00 00       $  ANS001:7E9 03 22 0C 01 00 00 00 00
  $  REQ002:7E1 03 22 0C 02 00 00 00 00       $  ANS002:7E9 03 22 0C 02 00 00 00 00
  $  REQ003:7E1 03 22 0C 03 00 00 00 00       $  ANS003:7E9 03 22 0C 03 00 00 00 00
  $  REQ004:7E1 03 22 0C 04 00 00 00 00       $  ANS004:7E9 03 22 0C 04 00 00 00 00
  $  REQ005:7E1 03 22 0C 05 00 00 00 00       $  ANS005:7E9 03 22 0C 05 00 00 00 00
  $  REQ006:7E1 03 22 0C 06 00 00 00 00       $  ANS006:7E9 03 22 0C 06 00 00 00 00
  $  REQ007:7E1 03 22 0C 07 00 00 00 00       $  ANS007:7E9 03 22 0C 07 00 00 00 00
  $  REQ008:7E1 03 22 0C 08 00 00 00 00       $  ANS008:7E9 03 22 0C 08 00 00 00 00
  $  REQ009:7E1 03 22 0C 09 00 00 00 00       $  ANS009:7E9 03 22 0C 09 00 00 00 00
  $  REQ010:7E1 03 22 0C 0A 00 00 00 00       $  ANS010:7E9 03 22 0C 0A 00 00 00 00
  $  REQ011:7E1 03 22 0C 0B 00 00 00 00       $  ANS011:7E9 03 22 0C 0B 00 00 00 00
  $  REQ012:7E1 03 22 0C 0C 00 00 00 00       $  ANS012:7E9 03 22 0C 0C 00 00 00 00
  $  REQ013:7E1 03 22 0C 11 00 00 00 00       $  ANS013:7E9 03 22 0C 11 00 00 00 00
  $  REQ014:7E1 03 22 0C 12 00 00 00 00       $  ANS014:7E9 03 22 0C 12 00 00 00 00
  $  REQ015:7E1 03 22 0C 13 00 00 00 00       $  ANS015:7E9 03 22 0C 13 00 00 00 00
  $  REQ016:7E1 03 22 0C 14 00 00 00 00       $  ANS016:7E9 03 22 0C 14 00 00 00 00
  $  REQ017:7E1 03 22 0C 15 00 00 00 00       $  ANS017:7E9 03 22 0C 15 00 00 00 00
  $  REQ018:7E1 03 22 0C 16 00 00 00 00       $  ANS018:7E9 03 22 0C 16 00 00 00 00
  $  REQ019:7E1 03 22 0C 17 00 00 00 00       $  ANS019:7E9 03 22 0C 17 00 00 00 00
  $  REQ020:7E1 03 22 0C 18 00 00 00 00       $  ANS020:7E9 03 22 0C 18 00 00 00 00
  $  REQ021:7E1 03 22 0C 19 00 00 00 00       $  ANS021:7E9 03 22 0C 19 00 00 00 00
  $  REQ022:7E1 03 22 0C 1A 00 00 00 00       $  ANS022:7E9 03 22 0C 1A 00 00 00 00
  $  REQ023:7E1 03 22 0C 1B 00 00 00 00       $  ANS023:7E9 03 22 0C 1B 00 00 00 00
  $  REQ024:7E1 03 22 0C 1C 00 00 00 00       $  ANS024:7E9 03 22 0C 1C 00 00 00 00
  $  REQ025:7E1 03 22 0C 1D 00 00 00 00       $  ANS025:7E9 03 22 0C 1D 00 00 00 00
  $  REQ026:7E1 03 22 0C 1E 00 00 00 00       $  ANS026:7E9 03 22 0C 1E 00 00 00 00
  $  REQ027:7E1 03 22 0C 1F 00 00 00 00       $  ANS027:7E9 03 22 0C 1F 00 00 00 00
  $  REQ028:7E1 03 22 0C 30 00 00 00 00       $  ANS028:7E9 03 22 0C 30 00 00 00 00
  $  REQ029:7E1 03 22 0C 32 00 00 00 00       $  ANS029:7E9 03 22 0C 32 00 00 00 00
  $  REQ030:7E1 03 22 0C 33 00 00 00 00       $  ANS030:7E9 03 22 0C 33 00 00 00 00
  $  REQ031:7E1 03 22 0C 34 00 00 00 00       $  ANS031:7E9 03 22 0C 34 00 00 00 00
  $  REQ032:7E1 03 22 0C 35 00 00 00 00       $  ANS032:7E9 03 22 0C 35 00 00 00 00
  $  REQ033:7E1 03 22 0C 36 00 00 00 00       $  ANS033:7E9 03 22 0C 36 00 00 00 00
  $  REQ034:7E1 03 22 0C 37 00 00 00 00       $  ANS034:7E9 03 22 0C 37 00 00 00 00
  $  REQ035:7E1 03 22 0C 38 00 00 00 00       $  ANS035:7E9 03 22 0C 38 00 00 00 00
  $  REQ036:7E1 03 22 0C 39 00 00 00 00       $  ANS036:7E9 03 22 0C 39 00 00 00 00
  $  REQ037:7E1 03 22 0C 3B 00 00 00 00       $  ANS037:7E9 03 22 0C 3B 00 00 00 00
  $  REQ038:7E1 03 22 0C 41 00 00 00 00       $  ANS038:7E9 03 22 0C 41 00 00 00 00
  $  REQ039:7E1 03 22 0C 42 00 00 00 00       $  ANS039:7E9 03 22 0C 42 00 00 00 00
  $  REQ040:7E1 03 22 0C 40 00 00 00 00       $  ANS040:7E9 03 22 0C 40 00 00 00 00
  $  REQ041:7E1 03 22 0C 44 00 00 00 00       $  ANS041:7E9 03 22 0C 44 00 00 00 00
  $  REQ042:7E1 03 22 0C 43 00 00 00 00       $  ANS042:7E9 03 22 0C 43 00 00 00 00
  $  REQ043:7E1 03 22 0C 45 00 00 00 00       $  ANS043:7E9 03 22 0C 45 00 00 00 00
  $  REQ044:7E1 03 22 0C 46 00 00 00 00       $  ANS044:7E9 03 22 0C 46 00 00 00 00
  $  REQ045:7E1 03 22 0C 47 00 00 00 00       $  ANS045:7E9 03 22 0C 47 00 00 00 00
  $  REQ046:7E1 03 22 0C 48 00 00 00 00       $  ANS046:7E9 03 22 0C 48 00 00 00 00
  $  REQ047:7E1 03 22 0C 49 00 00 00 00       $  ANS047:7E9 03 22 0C 49 00 00 00 00
  $  REQ048:7E1 03 22 0C 4A 00 00 00 00       $  ANS048:7E9 03 22 0C 4A 00 00 00 00
  $  REQ049:7E1 03 22 0C 51 00 00 00 00       $  ANS049:7E9 03 22 0C 51 00 00 00 00
  $  REQ050:7E1 03 22 0C 52 00 00 00 00       $  ANS050:7E9 03 22 0C 52 00 00 00 00
  $  REQ051:7E1 03 22 0C 53 00 00 00 00       $  ANS051:7E9 03 22 0C 53 00 00 00 00
  $  REQ052:7E1 03 22 0C 54 00 00 00 00       $  ANS052:7E9 03 22 0C 54 00 00 00 00
  $  REQ053:7E1 03 22 0C 55 00 00 00 00       $  ANS053:7E9 03 22 0C 55 00 00 00 00
  $  REQ054:7E1 03 22 0C 56 00 00 00 00       $  ANS054:7E9 03 22 0C 56 00 00 00 00
  $  REQ055:7E1 03 22 0C 57 00 00 00 00       $  ANS055:7E9 03 22 0C 57 00 00 00 00
  $  REQ056:7E1 03 22 0C 58 00 00 00 00       $  ANS056:7E9 03 22 0C 58 00 00 00 00
  $  REQ057:7E1 03 22 0C 59 00 00 00 00       $  ANS057:7E9 03 22 0C 59 00 00 00 00

  $  000.输入带轮转速原始值                           $    $  Hz         $    $  ANS000.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)*0.1);
  $  001.输出带轮转速原始值                           $    $  Hz         $    $  ANS001.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)*0.1);
  $  002.涡轮转速原始值                               $    $  Hz         $    $  ANS002.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)*0.1);
  $  003.输入带轮压力原始值                           $    $  Volt       $    $  ANS003.BYTE004  $  y=SPRINTF([%.2f],(x1*256+x2)*0.004875);
  $  004.输出带轮压力原始值                           $    $  Volt       $    $  ANS004.BYTE004  $  y=SPRINTF([%.2f],(x1*256+x2)*0.004875);
  $  005.变速器油温原始值                             $    $  Volt       $    $  ANS005.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)*0.015625);else y=SPRINTF([%d],((x1-256)*256+x2)*0.015625);
  $  006.手柄位置请求                                 $    $             $    $  ANS006.BYTE004  $  y=x1;
  $  007.目标发动机怠速请求                           $    $  rpm        $    $  ANS007.BYTE004  $  y=(x1*256+x2);
  $  008.变矩器状态变矩器状态                         $    $             $    $  ANS008.BYTE004  $  y=x1;
  $  009.驾驶模式                                     $    $             $    $  ANS009.BYTE004  $  y=x1;
  $  010.变速器故障状态                               $    $             $    $  ANS010.BYTE004  $  y=x1;
  $  011.客户代码                                     $    $             $    $  ANS011.BYTE004  $  y=x1;
  $  012.shiftlock状态                                $    $             $    $  ANS012.BYTE004  $  y=x1;
  $  013.输入带轮压力                                 $    $  bar        $    $  ANS013.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/256);
  $  014.输出带轮压力                                 $    $  bar        $    $  ANS014.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/256);
  $  015.涡轮转速                                     $    $  rpm        $    $  ANS015.BYTE004  $  y=(x1*256+x2);
  $  016.输入带轮转速                                 $    $  rpm        $    $  ANS016.BYTE004  $  y=(x1*256+x2);
  $  017.输出带轮转速                                 $    $  rpm        $    $  ANS017.BYTE004  $  y=(x1*256+x2);
  $  018.目标速比                                     $    $             $    $  ANS018.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/8192);else y=SPRINTF([%d],((x1-256)*256+x2)/8192);
  $  019.实际速比                                     $    $             $    $  ANS019.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/8192);else y=SPRINTF([%d],((x1-256)*256+x2)/8192);
  $  020.输入带轮扭矩容量                             $    $             $    $  ANS020.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/16384);else y=SPRINTF([%d],((x1-256)*256+x2)/16384);
  $  021.输出带轮扭矩容量                             $    $             $    $  ANS021.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/16384);else y=SPRINTF([%d],((x1-256)*256+x2)/16384);
  $  022.变速器挡位                                   $    $             $    $  ANS022.BYTE004  $  y=x1;
  $  023.变速器油温                                   $    $  deg        $    $  ANS023.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  024.变速器限扭值                                 $    $  Nm         $    $  ANS024.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/64);else y=SPRINTF([%d],((x1-256)*256+x2)/64);
  $  025.输入带轮目标压力                             $    $  bar        $    $  ANS025.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/256);else y=SPRINTF([%d],((x1-256)*256+x2)/256);
  $  026.输出带轮目标压力                             $    $  bar        $    $  ANS026.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/256);else y=SPRINTF([%d],((x1-256)*256+x2)/256);
  $  027.换挡模式                                     $    $             $    $  ANS027.BYTE004  $  y=(x1*256+x2);
  $  028.油门踏板开度                                 $    $  %          $    $  ANS028.BYTE004  $  y=SPRINTF([%d],x1*0.5);
  $  029.发动机扭矩                                   $    $  Nm         $    $  ANS029.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/64);else y=SPRINTF([%d],((x1-256)*256+x2)/64);
  $  030.冷却水温度                                   $    $  deg        $    $  ANS030.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  031.刹车踏板状态                                 $    $             $    $  ANS031.BYTE004  $  y=x1;
  $  032.ABS激活状态                                  $    $             $    $  ANS032.BYTE004  $  y=x1;
  $  033.左前轮速                                     $    $  Kmph       $    $  ANS033.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/16);
  $  034.右前轮速                                     $    $  Kmph       $    $  ANS034.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/16);
  $  035.左后轮速                                     $    $  Kmph       $    $  ANS035.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/16);
  $  036.右后轮速                                     $    $  Kmph       $    $  ANS036.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/16);
  $  037.车速（TCU计算）                              $    $  Kmph       $    $  ANS037.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/16);
  $  038.输入带轮控制电流                             $    $  mA         $    $  ANS038.BYTE004  $  y=(x1*256+x2);
  $  039.输出带轮控制电流                             $    $  mA         $    $  ANS039.BYTE004  $  y=(x1*256+x2);
  $  040.主油压控制电流                               $    $  mA         $    $  ANS040.BYTE004  $  y=(x1*256+x2);
  $  041.变矩器控制电流                               $    $  mA         $    $  ANS041.BYTE004  $  y=(x1*256+x2);
  $  042.离合器控制电流                               $    $  mA         $    $  ANS042.BYTE004  $  y=(x1*256+x2);
  $  043.Keyon次数计数                                $    $             $    $  ANS043.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  044.RAM运行时间                                  $    $  second     $    $  ANS044.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  045.里程数                                       $    $  Km         $    $  ANS045.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  046.TCU运行总时间                                $    $  minute     $    $  ANS046.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  047.故障类型                                     $    $             $    $  ANS047.BYTE004  $  y=x1;
  $  048.故障序号                                     $    $             $    $  ANS048.BYTE004  $  y=x1;
  $  049.系统故障数据                                 $    $             $    $  ANS049.BYTE004  $  HEX(x1);
  $  050.异常挂入P挡统计                              $    $             $    $  ANS050.BYTE004  $  HEX(x1);
  $  051.软件功能类型                                 $    $             $    $  ANS051.BYTE004  $  ASCII(x1);
  $  052.速比超限计数                                 $    $             $    $  ANS052.BYTE004  $  y=x1;
  $  053.前进挡离合器充油自学习值0                    $    $  ms         $    $  ANS053.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  054.前进挡离合器充油自学习值1                    $    $  ms         $    $  ANS053.BYTE006  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  055.前进挡离合器充油自学习值2                    $    $  ms         $    $  ANS053.BYTE008  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  056.前进挡离合器充油自学习值3                    $    $  ms         $    $  ANS053.BYTE010  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  057.前进挡离合器充油自学习值4                    $    $  ms         $    $  ANS053.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  058.前进挡离合器充油自学习值5                    $    $  ms         $    $  ANS053.BYTE014  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  059.前进挡离合器充油自学习值6                    $    $  ms         $    $  ANS053.BYTE016  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  060.前进挡离合器充油自学习值7                    $    $  ms         $    $  ANS053.BYTE018  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  061.前进挡离合器充油自学习值8                    $    $  ms         $    $  ANS053.BYTE020  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  062.前进挡离合器充油自学习值9                    $    $  ms         $    $  ANS053.BYTE022  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  063.前进挡离合器充油自学习值10                   $    $  ms         $    $  ANS053.BYTE024  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  064.前进挡离合器充油自学习值11                   $    $  ms         $    $  ANS053.BYTE026  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  065.前进挡离合器充油自学习值12                   $    $  ms         $    $  ANS053.BYTE028  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  066.前进挡离合器充油自学习值13                   $    $  ms         $    $  ANS053.BYTE030  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  067.前进挡离合器充油自学习值14                   $    $  ms         $    $  ANS053.BYTE032  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2));else y=SPRINTF([%d],((x1-256)*256+x2));
  $  068.倒挡离合器充油自学习值0                      $    $  ms         $    $  ANS054.BYTE004  $  y=(x1*256+x2);
  $  069.倒挡离合器充油自学习值1                      $    $  ms         $    $  ANS054.BYTE006  $  y=(x1*256+x2);
  $  070.倒挡离合器充油自学习值2                      $    $  ms         $    $  ANS054.BYTE008  $  y=(x1*256+x2);
  $  071.倒挡离合器充油自学习值3                      $    $  ms         $    $  ANS054.BYTE010  $  y=(x1*256+x2);
  $  072.倒挡离合器充油自学习值4                      $    $  ms         $    $  ANS054.BYTE012  $  y=(x1*256+x2);
  $  073.倒挡离合器充油自学习值5                      $    $  ms         $    $  ANS054.BYTE014  $  y=(x1*256+x2);
  $  074.倒挡离合器充油自学习值6                      $    $  ms         $    $  ANS054.BYTE016  $  y=(x1*256+x2);
  $  075.倒挡离合器充油自学习值7                      $    $  ms         $    $  ANS054.BYTE018  $  y=(x1*256+x2);
  $  076.倒挡离合器充油自学习值8                      $    $  ms         $    $  ANS054.BYTE020  $  y=(x1*256+x2);
  $  077.倒挡离合器充油自学习值9                      $    $  ms         $    $  ANS054.BYTE022  $  y=(x1*256+x2);
  $  078.倒挡离合器充油自学习值10                     $    $  ms         $    $  ANS054.BYTE024  $  y=(x1*256+x2);
  $  079.倒挡离合器充油自学习值11                     $    $  ms         $    $  ANS054.BYTE026  $  y=(x1*256+x2);
  $  080.倒挡离合器充油自学习值12                     $    $  ms         $    $  ANS054.BYTE028  $  y=(x1*256+x2);
  $  081.倒挡离合器充油自学习值13                     $    $  ms         $    $  ANS054.BYTE030  $  y=(x1*256+x2);
  $  082.倒挡离合器充油自学习值14                     $    $  ms         $    $  ANS054.BYTE032  $  y=(x1*256+x2);
  $  083.前进挡离合器触点自学习值0                    $    $  bar        $    $  ANS055.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  084.前进挡离合器触点自学习值1                    $    $  bar        $    $  ANS055.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  085.前进挡离合器触点自学习值2                    $    $  bar        $    $  ANS055.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  086.前进挡离合器触点自学习值3                    $    $  bar        $    $  ANS055.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  087.前进挡离合器触点自学习值4                    $    $  bar        $    $  ANS055.BYTE012  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  088.前进挡离合器触点自学习值5                    $    $  bar        $    $  ANS055.BYTE014  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  089.前进挡离合器触点自学习值6                    $    $  bar        $    $  ANS055.BYTE016  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  090.前进挡离合器触点自学习值7                    $    $  bar        $    $  ANS055.BYTE018  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  091.前进挡离合器触点自学习值8                    $    $  bar        $    $  ANS055.BYTE020  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  092.前进挡离合器触点自学习值9                    $    $  bar        $    $  ANS055.BYTE022  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  093.前进挡离合器触点自学习值10                   $    $  bar        $    $  ANS055.BYTE024  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  094.前进挡离合器触点自学习值11                   $    $  bar        $    $  ANS055.BYTE026  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  095.前进挡离合器触点自学习值12                   $    $  bar        $    $  ANS055.BYTE028  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  096.前进挡离合器触点自学习值13                   $    $  bar        $    $  ANS055.BYTE030  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  097.前进挡离合器触点自学习值14                   $    $  bar        $    $  ANS055.BYTE032  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  098.倒挡离合器触点自学习值0                      $    $  bar        $    $  ANS056.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  099.倒挡离合器触点自学习值1                      $    $  bar        $    $  ANS056.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  100.倒挡离合器触点自学习值2                      $    $  bar        $    $  ANS056.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  101.倒挡离合器触点自学习值3                      $    $  bar        $    $  ANS056.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  102.倒挡离合器触点自学习值4                      $    $  bar        $    $  ANS056.BYTE012  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  103.倒挡离合器触点自学习值5                      $    $  bar        $    $  ANS056.BYTE014  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  104.倒挡离合器触点自学习值6                      $    $  bar        $    $  ANS056.BYTE016  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  105.倒挡离合器触点自学习值7                      $    $  bar        $    $  ANS056.BYTE018  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  106.倒挡离合器触点自学习值8                      $    $  bar        $    $  ANS056.BYTE020  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  107.倒挡离合器触点自学习值9                      $    $  bar        $    $  ANS056.BYTE022  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  108.倒挡离合器触点自学习值10                     $    $  bar        $    $  ANS056.BYTE024  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  109.倒挡离合器触点自学习值11                     $    $  bar        $    $  ANS056.BYTE026  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  110.倒挡离合器触点自学习值12                     $    $  bar        $    $  ANS056.BYTE028  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  111.倒挡离合器触点自学习值13                     $    $  bar        $    $  ANS056.BYTE030  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  112.倒挡离合器触点自学习值14                     $    $  bar        $    $  ANS056.BYTE032  $  y=SPRINTF([%d],(x1*256+x2)/4096);
  $  113.液力变矩器锁止离合器(TCC)触点自学习值0       $    $  bar        $    $  ANS057.BYTE004  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/32768);else y=SPRINTF([%d],((x1-256)*256+x2)/32768);
  $  114.液力变矩器锁止离合器(TCC)触点自学习值1       $    $  bar        $    $  ANS057.BYTE006  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/32768);else y=SPRINTF([%d],((x1-256)*256+x2)/32768);
  $  115.液力变矩器锁止离合器(TCC)触点自学习值2       $    $  bar        $    $  ANS057.BYTE008  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/32768);else y=SPRINTF([%d],((x1-256)*256+x2)/32768);
  $  116.液力变矩器锁止离合器(TCC)触点自学习值3       $    $  bar        $    $  ANS057.BYTE010  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/32768);else y=SPRINTF([%d],((x1-256)*256+x2)/32768);
  $  117.液力变矩器锁止离合器(TCC)触点自学习值4       $    $  bar        $    $  ANS057.BYTE012  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/32768);else y=SPRINTF([%d],((x1-256)*256+x2)/32768);
  $  118.液力变矩器锁止离合器(TCC)触点自学习值5       $    $  bar        $    $  ANS057.BYTE014  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/32768);else y=SPRINTF([%d],((x1-256)*256+x2)/32768);
  $  119.液力变矩器锁止离合器(TCC)触点自学习值6       $    $  bar        $    $  ANS057.BYTE016  $  if(x1<0x80) y=SPRINTF([%d],(x1*256+x2)/32768);else y=SPRINTF([%d],((x1-256)*256+x2)/32768);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
