
    车型ID：3104

    模拟：协议模拟-->3104

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~789

进入命令:

  $~  REQ000:781 02 10 01 00 00 00 00 00       $~  ANS000:789 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:781 02 3E 80 00 00 00 00 00       $!  ANS000:789 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:781 03 19 02 09 00 00 00 00       $#  ANS000:789 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/06000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:781 04 14 FF FF FF 00 00 00       $$  ANS000:789 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:781 03 22 F1 93 00 00 00 00       $%  ANS000:789 03 22 F1 93 00 00 00 00
  $%  REQ001:781 03 22 F1 94 00 00 00 00       $%  ANS001:789 03 22 F1 94 00 00 00 00
  $%  REQ002:781 03 22 F1 95 00 00 00 00       $%  ANS002:789 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:781 03 22 00 05 00 00 00 00       $  ANS000:789 03 22 00 05 00 00 00 00
  $  REQ001:781 03 22 00 06 00 00 00 00       $  ANS001:789 03 22 00 06 00 00 00 00
  $  REQ002:781 03 22 00 07 00 00 00 00       $  ANS002:789 03 22 00 07 00 00 00 00
  $  REQ003:781 03 22 00 08 00 00 00 00       $  ANS003:789 03 22 00 08 00 00 00 00
  $  REQ004:781 03 22 00 09 00 00 00 00       $  ANS004:789 03 22 00 09 00 00 00 00
  $  REQ005:781 03 22 00 0A 00 00 00 00       $  ANS005:789 03 22 00 0A 00 00 00 00
  $  REQ006:781 03 22 00 0B 00 00 00 00       $  ANS006:789 03 22 00 0B 00 00 00 00
  $  REQ007:781 03 22 00 04 00 00 00 00       $  ANS007:789 03 22 00 04 00 00 00 00
  $  REQ008:781 03 22 00 0E 00 00 00 00       $  ANS008:789 03 22 00 0E 00 00 00 00
  $  REQ009:781 03 22 00 0F 00 00 00 00       $  ANS009:789 03 22 00 0F 00 00 00 00
  $  REQ010:781 03 22 00 10 00 00 00 00       $  ANS010:789 03 22 00 10 00 00 00 00
  $  REQ011:781 03 22 00 11 00 00 00 00       $  ANS011:789 03 22 00 11 00 00 00 00
  $  REQ012:781 03 22 00 12 00 00 00 00       $  ANS012:789 03 22 00 12 00 00 00 00
  $  REQ013:781 03 22 00 13 00 00 00 00       $  ANS013:789 03 22 00 13 00 00 00 00
  $  REQ014:781 03 22 00 14 00 00 00 00       $  ANS014:789 03 22 00 14 00 00 00 00
  $  REQ015:781 03 22 00 15 00 00 00 00       $  ANS015:789 03 22 00 15 00 00 00 00
  $  REQ016:781 03 22 00 16 00 00 00 00       $  ANS016:789 03 22 00 16 00 00 00 00
  $  REQ017:781 03 22 00 17 00 00 00 00       $  ANS017:789 03 22 00 17 00 00 00 00
  $  REQ018:781 03 22 00 18 00 00 00 00       $  ANS018:789 03 22 00 18 00 00 00 00
  $  REQ019:781 03 22 00 19 00 00 00 00       $  ANS019:789 03 22 00 19 00 00 00 00
  $  REQ020:781 03 22 00 1A 00 00 00 00       $  ANS020:789 03 22 00 1A 00 00 00 00
  $  REQ021:781 03 22 00 1B 00 00 00 00       $  ANS021:789 03 22 00 1B 00 00 00 00
  $  REQ022:781 03 22 00 1C 00 00 00 00       $  ANS022:789 03 22 00 1C 00 00 00 00
  $  REQ023:781 03 22 00 1D 00 00 00 00       $  ANS023:789 03 22 00 1D 00 00 00 00
  $  REQ024:781 03 22 00 24 00 00 00 00       $  ANS024:789 03 22 00 24 00 00 00 00
  $  REQ025:781 03 22 00 27 00 00 00 00       $  ANS025:789 03 22 00 27 00 00 00 00
  $  REQ026:781 03 22 00 2A 00 00 00 00       $  ANS026:789 03 22 00 2A 00 00 00 00
  $  REQ027:781 03 22 00 2B 00 00 00 00       $  ANS027:789 03 22 00 2B 00 00 00 00
  $  REQ028:781 03 22 00 2C 00 00 00 00       $  ANS028:789 03 22 00 2C 00 00 00 00
  $  REQ029:781 03 22 00 2D 00 00 00 00       $  ANS029:789 03 22 00 2D 00 00 00 00
  $  REQ030:781 03 22 00 2E 00 00 00 00       $  ANS030:789 03 22 00 2E 00 00 00 00
  $  REQ031:781 03 22 00 2F 00 00 00 00       $  ANS031:789 03 22 00 2F 00 00 00 00
  $  REQ032:781 03 22 00 30 00 00 00 00       $  ANS032:789 03 22 00 30 00 00 00 00
  $  REQ033:781 03 22 00 31 00 00 00 00       $  ANS033:789 03 22 00 31 00 00 00 00
  $  REQ034:781 03 22 00 32 00 00 00 00       $  ANS034:789 03 22 00 32 00 00 00 00
  $  REQ035:781 03 22 00 33 00 00 00 00       $  ANS035:789 03 22 00 33 00 00 00 00
  $  REQ036:781 03 22 00 34 00 00 00 00       $  ANS036:789 03 22 00 34 00 00 00 00
  $  REQ037:781 03 22 00 35 00 00 00 00       $  ANS037:789 03 22 00 35 00 00 00 00
  $  REQ038:781 03 22 00 36 00 00 00 00       $  ANS038:789 03 22 00 36 00 00 00 00
  $  REQ039:781 03 22 00 37 00 00 00 00       $  ANS039:789 03 22 00 37 00 00 00 00
  $  REQ040:781 03 22 0A 04 00 00 00 00       $  ANS040:789 03 22 0A 04 00 00 00 00
  $  REQ041:781 03 22 0A 05 00 00 00 00       $  ANS041:789 03 22 0A 05 00 00 00 00
  $  REQ042:781 03 22 0A 08 00 00 00 00       $  ANS042:789 03 22 0A 08 00 00 00 00
  $  REQ043:781 03 22 0A 10 00 00 00 00       $  ANS043:789 03 22 0A 10 00 00 00 00
  $  REQ044:781 03 22 0A 11 00 00 00 00       $  ANS044:789 03 22 0A 11 00 00 00 00
  $  REQ045:781 03 22 1F F0 00 00 00 00       $  ANS045:789 03 22 1F F0 00 00 00 00
  $  REQ046:781 03 22 20 00 00 00 00 00       $  ANS046:789 03 22 20 00 00 00 00 00
  $  REQ047:781 03 22 1F F3 00 00 00 00       $  ANS047:789 03 22 1F F3 00 00 00 00
  $  REQ048:781 03 22 1F F8 00 00 00 00       $  ANS048:789 03 22 1F F8 00 00 00 00
  $  REQ049:781 03 22 00 1F 00 00 00 00       $  ANS049:789 03 22 00 1F 00 00 00 00
  $  REQ050:781 03 22 00 20 00 00 00 00       $  ANS050:789 03 22 00 20 00 00 00 00
  $  REQ051:781 03 22 1F F4 00 00 00 00       $  ANS051:789 03 22 1F F4 00 00 00 00
  $  REQ052:781 03 22 1F F5 00 00 00 00       $  ANS052:789 03 22 1F F5 00 00 00 00
  $  REQ053:781 03 22 1F F6 00 00 00 00       $  ANS053:789 03 22 1F F6 00 00 00 00
  $  REQ054:781 03 22 0A 12 00 00 00 00       $  ANS054:789 03 22 0A 12 00 00 00 00

  $  000.SOC                                                      $    $  %       $    $  ANS000.BYTE004  $  y=x1;
  $  001.低温标志                                                 $    $          $    $  ANS001.BYTE004  $  y=SPRINTF([%c%c%d.%d],0x41+(x2*256+x1)%10000/1000,0x61+(x2*256+x1)%1000/100,(x2*256+x1)%100/10,(x2*256+x1)%10);
  $  002.电池包品检代号                                           $    $          $    $  ANS002.BYTE004  $  y=SPRINTF([%c%c%d.%d],0x41+(x2*256+x1)%10000/1000,0x61+(x2*256+x1)%1000/100,(x2*256+x1)%100/10,(x2*256+x1)%10);
  $  003.电池组当前总电压                                         $    $  V       $    $  ANS003.BYTE004  $  y=(x2*256+x1);
  $  004.电池组当前总电流                                         $    $  A       $    $  ANS004.BYTE004  $  y=SPRINTF([%.1f],(x2*256+x1)*0.1-500);
  $  005.最大允许充电功率                                         $    $  kw      $    $  ANS005.BYTE004  $  y=SPRINTF([%.1f],(x2*256+x1)*0.1);
  $  006.充电次数                                                 $    $          $    $  ANS006.BYTE004  $  y=(x2*256+x1);
  $  007.满电次数                                                 $    $  次      $    $  ANS007.BYTE004  $  y=(x2*256+x1);
  $  008.最大允许放电功率                                         $    $  kw      $    $  ANS008.BYTE004  $  y=SPRINTF([%.1f],(x2*256+x1)*0.1);
  $  009.累计充电电量                                             $    $  AH      $    $  ANS009.BYTE004  $  y=(x3*256*256+x2*256+x1);
  $  010.累计放电电量                                             $    $  AH      $    $  ANS010.BYTE004  $  y=(x3*256*256+x2*256+x1);
  $  011.累计充电电能                                             $    $  kwh     $    $  ANS011.BYTE004  $  y=(x2*256+x1);
  $  012.累计放电电能                                             $    $  kwh     $    $  ANS012.BYTE004  $  y=(x2*256+x1);
  $  013.历史顶端压差                                             $    $  mV      $    $  ANS013.BYTE004  $  y=(x2*256+x1);
  $  014.历史底端压差                                             $    $  mv      $    $  ANS014.BYTE004  $  y=(x2*256+x1);
  $  015.绝缘阻值                                                 $    $  KΩ     $    $  ANS015.BYTE004  $  y=(x2*256+x1);
  $  016.放电是否允许                                             $    $          $    $  ANS016.BYTE004  $  switxh(x1)0x00: y=@004e;0x01: y=@004d;default: y=@00d6;
  $  017.充电是否允许                                             $    $          $    $  ANS017.BYTE004  $  switxh(x1)0x00: y=@004e;0x01: y=@004d;default: y=@00d6;
  $  018.充电感应信号-交流                                        $    $          $    $  ANS018.BYTE004  $  switxh(x1)0x00: y=@0146;0x01: y=@0147;default: y=@00d6;
  $  019.充电感应信号-直流                                        $    $          $    $  ANS019.BYTE004  $  switxh(x1)0x00: y=@0146;0x01: y=@0147;default: y=@00d6;
  $  020.预充状态                                                 $    $          $    $  ANS020.BYTE004  $  switxh(x1)0x00: y=@0142;0x01: y=@0143;0x02: y=@0144;0x03: y=@0145;default: y=@00d6;
  $  021.主接触器状态                                             $    $          $    $  ANS021.BYTE004  $  switxh(x1)0x00: y=@0047;0x01: y=@0048;default: y=@00d6;
  $  022.负极接触器状态                                           $    $          $    $  ANS022.BYTE004  $  switxh(x1)0x00: y=@0047;0x01: y=@0048;default: y=@00d6;
  $  023.预充接触器状态                                           $    $          $    $  ANS023.BYTE004  $  switxh(x1)0x00: y=@0047;0x01: y=@0048;default: y=@00d6;
  $  024.高压互锁1                                                $    $          $    $  ANS024.BYTE004  $  switxh(x1)0x00: y=@00eb;0x01: y=@014a;default: y=@00d6;
  $  025.高压系统状态                                             $    $          $    $  ANS025.BYTE004  $  switxh(x1)0x00: y=@0045;0x01: y=@0148;0x02: y=@0149;default: y=@00d6;
  $  026.最低电压电池编号                                         $    $          $    $  ANS026.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  027.最低单节电池电压                                         $    $  V       $    $  ANS027.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  028.最高电压电池编号                                         $    $          $    $  ANS028.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  029.最高单节电池电压                                         $    $  V       $    $  ANS029.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  030.最低温度号                                               $    $          $    $  ANS030.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  031.最低温度                                                 $    $  ℃      $    $  ANS031.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  032.最高温度号                                               $    $          $    $  ANS032.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  033.最高温度                                                 $    $  ℃      $    $  ANS033.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  034.电池组平均温度                                           $    $  ℃      $    $  ANS034.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  035.向上均衡出发次数                                         $    $          $    $  ANS035.BYTE004  $  y=(x2*256+x1);
  $  036.向下均衡出发次数                                         $    $          $    $  ANS036.BYTE004  $  y=(x2*256+x1);
  $  037.均衡状态                                                 $    $          $    $  ANS037.BYTE004  $  switxh(x1)0x00: y=@0000;0x01: y=@0109;0x02: y=@010a;default: y=@00d6;
  $  038.直流充电正极接触器状态                                   $    $          $    $  ANS038.BYTE004  $  switxh(x1)0x01: y=@0047;0x02: y=@0048;default: y=@00d6;
  $  039.直流充电负极接触器状态                                   $    $          $    $  ANS039.BYTE004  $  switxh(x1)0x01: y=@0047;0x02: y=@0048;default: y=@00d6;
  $  040.智能充电                                                 $    $          $    $  ANS040.BYTE004  $  switxh(x1)0x00: y=@004e;0x01: y=@004d;0x02: y=@0108;default: y=@00d6;
  $  041.用电设备工作状态                                         $    $          $    $  ANS041.BYTE004  $  switxh(x1)0x01: y=@004d;0x02: y=@004e;default: y=@0002;
  $  042.VTOL(车辆对用电设备)对电命令                             $    $          $    $  ANS042.BYTE004  $  switxh(x1)0x00: y=@004e;0x01: y=@004d;0x02: y=@010b;0x03: y=@0108;default: y=@00d6;
  $  043.DC工作命令                                               $    $          $    $  ANS043.BYTE004  $  switxh(x1)0x00: y=@004e;0x01: y=@004d;0x02: y=@0108;default: y=@00d6;
  $  044.主动泄放命令                                             $    $          $    $  ANS044.BYTE004  $  switxh(x1)0x00: y=@004e;0x01: y=@004d;0x02: y=@0108;default: y=@00d6;
  $  045.售后软件版本号                                           $    $          $    $  ANS045.BYTE004  $  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $  046.底端SOC最高温度                                          $    $  ℃      $    $  ANS046.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  047.底端SOC最低温度                                          $    $  ℃      $    $  ANS046.BYTE005  $  y=SPRINTF([%d],x1-40);
  $  048.底端SOC最高电压                                          $    $  V       $    $  ANS046.BYTE006  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  049.底端SOC最低电压                                          $    $  V       $    $  ANS046.BYTE008  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  050.顶端SOC最高温度                                          $    $  ℃      $    $  ANS046.BYTE010  $  y=SPRINTF([%d],x1-40);
  $  051.顶端SOC最低温度                                          $    $  ℃      $    $  ANS046.BYTE011  $  y=SPRINTF([%d],x1-40);
  $  052.顶端SOC最高电压                                          $    $  V       $    $  ANS046.BYTE012  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  053.顶端SOC最低电压                                          $    $  V       $    $  ANS046.BYTE014  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  054.DL指标                                                   $    $          $    $  ANS046.BYTE016  $  y=(x2*256+x1);
  $  055.记录时间                                                 $    $          $    $  ANS046.BYTE018  $  y=(x4*256*256*256+x3*256*256+x2*256+x1);
  $  056.热管理命令                                               $    $          $    $  ANS047.BYTE004  $  switxh(x1)0x00: y=@003f;0x01: y=@0277;0x02: y=@0278;0x03: y=@0279;0x04: y=@027a;0x05: y=@027b;0x06: y=@003f;0x07: y=@01e0;default: y=@0002;
  $  057.热管理请求状态                                           $    $          $    $  ANS048.BYTE004  $  switxh(x1)0x00: y=@0525;0x01: y=@0526;default: y=@0002;
  $  058.正极接触器状态                                           $    $          $    $  ANS049.BYTE004  $  switxh(x1)0x00: y=@0047;0x01: y=@0048;default: y=@00d6;
  $  059.分压接触器1状态                                          $    $          $    $  ANS050.BYTE004  $  switxh(x1)0x01: y=@0047;0x02: y=@0048;default: y=@00d6;
  $  060.电池冷却空调故障状态                                     $    $          $    $  ANS051.BYTE004  $  switxh(x1)0x00: y=@003f;0x01: y=@0045;0x02: y=@0046;default: y=@0002;
  $  061.电池内循环空调故障状态                                   $    $          $    $  ANS052.BYTE004  $  switxh(x1)0x00: y=@003f;0x01: y=@0045;0x02: y=@0046;default: y=@0002;
  $  062.电池热管理空调系统状态                                   $    $          $    $  ANS053.BYTE004  $  switxh(x1)0x00: y=@0000;0x01: y=@0271;0x02: y=@0272;0x03: y=@0273;0x04: y=@0274;default: y=@0002;
  $  063.Group1：BMC检测到整车故障                                $    $          $    $  ANS054.BYTE004  $  if(x1&0x01) y=@064d;else y=@064e;
  $  064.Group1：升降压模块故障                                   $    $          $    $  ANS054.BYTE004  $  if(x1&0x02) y=@064d;else y=@064e;
  $  065.Group1：直流充电机电压输出异常                           $    $          $    $  ANS054.BYTE004  $  if(x1&0x04) y=@064d;else y=@064e;
  $  066.Group1：充电机过温故障                                   $    $          $    $  ANS054.BYTE004  $  if(x1&0x08) y=@064d;else y=@064e;
  $  067.Group1：充电连接器故障                                   $    $          $    $  ANS054.BYTE004  $  if(x1&0x10) y=@064d;else y=@064e;
  $  068.Group1：充电机内部过温故障                               $    $          $    $  ANS054.BYTE004  $  if(x1&0x20) y=@064d;else y=@064e;
  $  069.Group1：所需电量不能传送                                 $    $          $    $  ANS054.BYTE004  $  if(x1&0x40) y=@064d;else y=@064e;
  $  070.Group1：充电机急停故障                                   $    $          $    $  ANS054.BYTE004  $  if(x1&0x80) y=@064d;else y=@064e;
  $  071.Group1：充电机电流不匹配                                 $    $          $    $  ANS054.BYTE005  $  if(x1&0x01) y=@064d;else y=@064e;
  $  072.Group1：充电机电压异常                                   $    $          $    $  ANS054.BYTE005  $  if(x1&0x02) y=@064d;else y=@064e;
  $  073.Group1：BMS和车辆辨识报文超时                            $    $          $    $  ANS054.BYTE005  $  if(x1&0x04) y=@064d;else y=@064e;
  $  074.Group1：电池充电参数报文超时                             $    $          $    $  ANS054.BYTE005  $  if(x1&0x08) y=@064d;else y=@064e;
  $  075.Group1：BMS完成充电准备报文超时                          $    $          $    $  ANS054.BYTE005  $  if(x1&0x10) y=@064d;else y=@064e;
  $  076.Group1：电池充电总状态报文超时                           $    $          $    $  ANS054.BYTE005  $  if(x1&0x20) y=@064d;else y=@064e;
  $  077.Group1：电池充电要求报文超时                             $    $          $    $  ANS054.BYTE005  $  if(x1&0x40) y=@064d;else y=@064e;
  $  078.Group1：BMS中止充电报文超时                              $    $          $    $  ANS054.BYTE005  $  if(x1&0x80) y=@064d;else y=@064e;
  $  079.Group1：BMS充电统计报文超时                              $    $          $    $  ANS054.BYTE006  $  if(x1&0x01) y=@064d;else y=@064e;
  $  080.Group1：充电柜多帧交互异常                               $    $          $    $  ANS054.BYTE006  $  if(x1&0x02) y=@064d;else y=@064e;
  $  081.Group1：充电机0x00 辨识报文超时                          $    $          $    $  ANS054.BYTE006  $  if(x1&0x04) y=@064d;else y=@064e;
  $  082.Group1：充电机0xAA 辨识报文超时                          $    $          $    $  ANS054.BYTE006  $  if(x1&0x08) y=@064d;else y=@064e;
  $  083.Group1：充电机时间同步和充电机最大输出能力报文超时       $    $          $    $  ANS054.BYTE006  $  if(x1&0x10) y=@064d;else y=@064e;
  $  084.Group1：充电机完成充电准备报文超时                       $    $          $    $  ANS054.BYTE006  $  if(x1&0x20) y=@064d;else y=@064e;
  $  085.Group1：充电机充电状态报文超时                           $    $          $    $  ANS054.BYTE006  $  if(x1&0x40) y=@064d;else y=@064e;
  $  086.Group1：充电机中止充电报文超时                           $    $          $    $  ANS054.BYTE006  $  if(x1&0x80) y=@064d;else y=@064e;
  $  087.Group1：充电机充电统计报文超时                           $    $          $    $  ANS054.BYTE007  $  if(x1&0x01) y=@064d;else y=@064e;
  $  088.Group1：BMC充电电流过大                                  $    $          $    $  ANS054.BYTE007  $  if(x1&0x02) y=@064d;else y=@064e;
  $  089.Group1：BMC充电电压异常                                  $    $          $    $  ANS054.BYTE007  $  if(x1&0x04) y=@064d;else y=@064e;
  $  090.Group1：充电机其他故障                                   $    $          $    $  ANS054.BYTE007  $  if(x1&0x08) y=@064d;else y=@064e;
  $  091.Group1：充电机故障中止                                   $    $          $    $  ANS054.BYTE007  $  if(x1&0x10) y=@064d;else y=@064e;
  $  092.Group1：达到充电机设定的条件中止                         $    $          $    $  ANS054.BYTE007  $  if(x1&0x20) y=@064d;else y=@064e;
  $  093.Group1：人工中止                                         $    $          $    $  ANS054.BYTE007  $  if(x1&0x40) y=@064d;else y=@064e;
  $  094.Group1：故障中止                                         $    $          $    $  ANS054.BYTE007  $  if(x1&0x80) y=@064d;else y=@064e;
  $  095.Group1：故障中止                                         $    $          $    $  ANS054.BYTE007  $  if(x1&0x80) y=@064d;else y=@064e;
  $  096.Group1：月                                               $    $          $    $  ANS054.BYTE008  $  y=SPRINTF([%02d],x1);
  $  097.Group1：日                                               $    $          $    $  ANS054.BYTE009  $  y=SPRINTF([%02d],x1);
  $  098.Group1：时                                               $    $          $    $  ANS054.BYTE010  $  y=SPRINTF([%02d],x1);
  $  099.Group1：预留                                             $    $          $    $  ANS054.BYTE011  $  y=SPRINTF([%02d],x1);
  $  100.Group2：BMC检测到整车故障                                $    $          $    $  ANS054.BYTE012  $  if(x1&0x02) y=@064d;else y=@064e;
  $  101.Group2：升降压模块故障                                   $    $          $    $  ANS054.BYTE012  $  if(x1&0x04) y=@064d;else y=@064e;
  $  102.Group2：直流充电机电压输出异常                           $    $          $    $  ANS054.BYTE012  $  if(x1&0x08) y=@064d;else y=@064e;
  $  103.Group2：充电机过温故障                                   $    $          $    $  ANS054.BYTE012  $  if(x1&0x10) y=@064d;else y=@064e;
  $  104.Group2：充电连接器故障                                   $    $          $    $  ANS054.BYTE012  $  if(x1&0x20) y=@064d;else y=@064e;
  $  105.Group2：充电机内部过温故障                               $    $          $    $  ANS054.BYTE012  $  if(x1&0x40) y=@064d;else y=@064e;
  $  106.Group2：所需电量不能传送                                 $    $          $    $  ANS054.BYTE012  $  if(x1&0x80) y=@064d;else y=@064e;
  $  107.Group2：充电机急停故障                                   $    $          $    $  ANS054.BYTE013  $  if(x1&0x01) y=@064d;else y=@064e;
  $  108.Group2：充电机电流不匹配                                 $    $          $    $  ANS054.BYTE013  $  if(x1&0x02) y=@064d;else y=@064e;
  $  109.Group2：充电机电压异常                                   $    $          $    $  ANS054.BYTE013  $  if(x1&0x04) y=@064d;else y=@064e;
  $  110.Group2：BMS和车辆辨识报文超时                            $    $          $    $  ANS054.BYTE013  $  if(x1&0x08) y=@064d;else y=@064e;
  $  111.Group2：电池充电参数报文超时                             $    $          $    $  ANS054.BYTE013  $  if(x1&0x10) y=@064d;else y=@064e;
  $  112.Group2：BMS完成充电准备报文超时                          $    $          $    $  ANS054.BYTE013  $  if(x1&0x20) y=@064d;else y=@064e;
  $  113.Group2：电池充电总状态报文超时                           $    $          $    $  ANS054.BYTE013  $  if(x1&0x40) y=@064d;else y=@064e;
  $  114.Group2：电池充电要求报文超时                             $    $          $    $  ANS054.BYTE013  $  if(x1&0x80) y=@064d;else y=@064e;
  $  115.Group2：BMS中止充电报文超时                              $    $          $    $  ANS054.BYTE014  $  if(x1&0x01) y=@064d;else y=@064e;
  $  116.Group2：BMS充电统计报文超时                              $    $          $    $  ANS054.BYTE014  $  if(x1&0x02) y=@064d;else y=@064e;
  $  117.Group2：充电柜多帧交互异常                               $    $          $    $  ANS054.BYTE014  $  if(x1&0x04) y=@064d;else y=@064e;
  $  118.Group2：充电机0x00 辨识报文超时                          $    $          $    $  ANS054.BYTE014  $  if(x1&0x08) y=@064d;else y=@064e;
  $  119.Group2：充电机0xAA 辨识报文超时                          $    $          $    $  ANS054.BYTE014  $  if(x1&0x10) y=@064d;else y=@064e;
  $  120.Group2：充电机时间同步和充电机最大输出能力报文超时       $    $          $    $  ANS054.BYTE014  $  if(x1&0x20) y=@064d;else y=@064e;
  $  121.Group2：充电机完成充电准备报文超时                       $    $          $    $  ANS054.BYTE014  $  if(x1&0x40) y=@064d;else y=@064e;
  $  122.Group2：充电机充电状态报文超时                           $    $          $    $  ANS054.BYTE014  $  if(x1&0x80) y=@064d;else y=@064e;
  $  123.Group2：充电机中止充电报文超时                           $    $          $    $  ANS054.BYTE015  $  if(x1&0x01) y=@064d;else y=@064e;
  $  124.Group2：充电机充电统计报文超时                           $    $          $    $  ANS054.BYTE015  $  if(x1&0x02) y=@064d;else y=@064e;
  $  125.Group2：BMC充电电流过大                                  $    $          $    $  ANS054.BYTE015  $  if(x1&0x04) y=@064d;else y=@064e;
  $  126.Group2：BMC充电电压异常                                  $    $          $    $  ANS054.BYTE015  $  if(x1&0x08) y=@064d;else y=@064e;
  $  127.Group2：充电机其他故障                                   $    $          $    $  ANS054.BYTE015  $  if(x1&0x10) y=@064d;else y=@064e;
  $  128.Group2：充电机故障中止                                   $    $          $    $  ANS054.BYTE015  $  if(x1&0x20) y=@064d;else y=@064e;
  $  129.Group2：达到充电机设定的条件中止                         $    $          $    $  ANS054.BYTE015  $  if(x1&0x40) y=@064d;else y=@064e;
  $  130.Group2：人工中止                                         $    $          $    $  ANS054.BYTE015  $  if(x1&0x80) y=@064d;else y=@064e;
  $  131.Group2：故障中止                                         $    $          $    $  ANS054.BYTE016  $  if(x1&0x01) y=@064d;else y=@064e;
  $  132.Group2：故障中止                                         $    $          $    $  ANS054.BYTE016  $  if(x1&0x02) y=@064d;else y=@064e;
  $  133.Group2：月                                               $    $          $    $  ANS054.BYTE016  $  y=SPRINTF([%02d],x1);
  $  134.Group2：日                                               $    $          $    $  ANS054.BYTE017  $  y=SPRINTF([%02d],x1);
  $  135.Group2：时                                               $    $          $    $  ANS054.BYTE018  $  y=SPRINTF([%02d],x1);
  $  136.Group2：预留                                             $    $          $    $  ANS054.BYTE019  $  y=SPRINTF([%02d],x1);
  $  137.Group3：BMC检测到整车故障                                $    $          $    $  ANS054.BYTE020  $  if(x1&0x04) y=@064d;else y=@064e;
  $  138.Group3：升降压模块故障                                   $    $          $    $  ANS054.BYTE020  $  if(x1&0x08) y=@064d;else y=@064e;
  $  139.Group3：直流充电机电压输出异常                           $    $          $    $  ANS054.BYTE020  $  if(x1&0x10) y=@064d;else y=@064e;
  $  140.Group3：充电机过温故障                                   $    $          $    $  ANS054.BYTE020  $  if(x1&0x20) y=@064d;else y=@064e;
  $  141.Group3：充电连接器故障                                   $    $          $    $  ANS054.BYTE020  $  if(x1&0x40) y=@064d;else y=@064e;
  $  142.Group3：充电机内部过温故障                               $    $          $    $  ANS054.BYTE020  $  if(x1&0x80) y=@064d;else y=@064e;
  $  143.Group3：所需电量不能传送                                 $    $          $    $  ANS054.BYTE021  $  if(x1&0x01) y=@064d;else y=@064e;
  $  144.Group3：充电机急停故障                                   $    $          $    $  ANS054.BYTE021  $  if(x1&0x02) y=@064d;else y=@064e;
  $  145.Group3：充电机电流不匹配                                 $    $          $    $  ANS054.BYTE021  $  if(x1&0x04) y=@064d;else y=@064e;
  $  146.Group3：充电机电压异常                                   $    $          $    $  ANS054.BYTE021  $  if(x1&0x08) y=@064d;else y=@064e;
  $  147.Group3：BMS和车辆辨识报文超时                            $    $          $    $  ANS054.BYTE021  $  if(x1&0x10) y=@064d;else y=@064e;
  $  148.Group3：电池充电参数报文超时                             $    $          $    $  ANS054.BYTE021  $  if(x1&0x20) y=@064d;else y=@064e;
  $  149.Group3：BMS完成充电准备报文超时                          $    $          $    $  ANS054.BYTE021  $  if(x1&0x40) y=@064d;else y=@064e;
  $  150.Group3：电池充电总状态报文超时                           $    $          $    $  ANS054.BYTE021  $  if(x1&0x80) y=@064d;else y=@064e;
  $  151.Group3：电池充电要求报文超时                             $    $          $    $  ANS054.BYTE022  $  if(x1&0x01) y=@064d;else y=@064e;
  $  152.Group3：BMS中止充电报文超时                              $    $          $    $  ANS054.BYTE022  $  if(x1&0x02) y=@064d;else y=@064e;
  $  153.Group3：BMS充电统计报文超时                              $    $          $    $  ANS054.BYTE022  $  if(x1&0x04) y=@064d;else y=@064e;
  $  154.Group3：充电柜多帧交互异常                               $    $          $    $  ANS054.BYTE022  $  if(x1&0x08) y=@064d;else y=@064e;
  $  155.Group3：充电机0x00 辨识报文超时                          $    $          $    $  ANS054.BYTE022  $  if(x1&0x10) y=@064d;else y=@064e;
  $  156.Group3：充电机0xAA 辨识报文超时                          $    $          $    $  ANS054.BYTE022  $  if(x1&0x20) y=@064d;else y=@064e;
  $  157.Group3：充电机时间同步和充电机最大输出能力报文超时       $    $          $    $  ANS054.BYTE022  $  if(x1&0x40) y=@064d;else y=@064e;
  $  158.Group3：充电机完成充电准备报文超时                       $    $          $    $  ANS054.BYTE022  $  if(x1&0x80) y=@064d;else y=@064e;
  $  159.Group3：充电机充电状态报文超时                           $    $          $    $  ANS054.BYTE023  $  if(x1&0x01) y=@064d;else y=@064e;
  $  160.Group3：充电机中止充电报文超时                           $    $          $    $  ANS054.BYTE023  $  if(x1&0x02) y=@064d;else y=@064e;
  $  161.Group3：充电机充电统计报文超时                           $    $          $    $  ANS054.BYTE023  $  if(x1&0x04) y=@064d;else y=@064e;
  $  162.Group3：BMC充电电流过大                                  $    $          $    $  ANS054.BYTE023  $  if(x1&0x08) y=@064d;else y=@064e;
  $  163.Group3：BMC充电电压异常                                  $    $          $    $  ANS054.BYTE023  $  if(x1&0x10) y=@064d;else y=@064e;
  $  164.Group3：充电机其他故障                                   $    $          $    $  ANS054.BYTE023  $  if(x1&0x20) y=@064d;else y=@064e;
  $  165.Group3：充电机故障中止                                   $    $          $    $  ANS054.BYTE023  $  if(x1&0x40) y=@064d;else y=@064e;
  $  166.Group3：达到充电机设定的条件中止                         $    $          $    $  ANS054.BYTE023  $  if(x1&0x80) y=@064d;else y=@064e;
  $  167.Group3：人工中止                                         $    $          $    $  ANS054.BYTE024  $  if(x1&0x01) y=@064d;else y=@064e;
  $  168.Group3：故障中止                                         $    $          $    $  ANS054.BYTE024  $  if(x1&0x02) y=@064d;else y=@064e;
  $  169.Group3：月                                               $    $          $    $  ANS054.BYTE024  $  y=SPRINTF([%02d],x1);
  $  170.Group3：日                                               $    $          $    $  ANS054.BYTE025  $  y=SPRINTF([%02d],x1);
  $  171.Group3：时                                               $    $          $    $  ANS054.BYTE026  $  y=SPRINTF([%02d],x1);
  $  172.Group3：预留                                             $    $          $    $  ANS054.BYTE027  $  y=SPRINTF([%02d],x1);
  $  173.Group4：BMC检测到整车故障                                $    $          $    $  ANS054.BYTE028  $  if(x1&0x10) y=@064d;else y=@064e;
  $  174.Group4：升降压模块故障                                   $    $          $    $  ANS054.BYTE028  $  if(x1&0x20) y=@064d;else y=@064e;
  $  175.Group4：直流充电机电压输出异常                           $    $          $    $  ANS054.BYTE028  $  if(x1&0x40) y=@064d;else y=@064e;
  $  176.Group4：充电机过温故障                                   $    $          $    $  ANS054.BYTE028  $  if(x1&0x80) y=@064d;else y=@064e;
  $  177.Group4：充电连接器故障                                   $    $          $    $  ANS054.BYTE029  $  if(x1&0x01) y=@064d;else y=@064e;
  $  178.Group4：充电机内部过温故障                               $    $          $    $  ANS054.BYTE029  $  if(x1&0x02) y=@064d;else y=@064e;
  $  179.Group4：所需电量不能传送                                 $    $          $    $  ANS054.BYTE029  $  if(x1&0x04) y=@064d;else y=@064e;
  $  180.Group4：充电机急停故障                                   $    $          $    $  ANS054.BYTE029  $  if(x1&0x08) y=@064d;else y=@064e;
  $  181.Group4：充电机电流不匹配                                 $    $          $    $  ANS054.BYTE029  $  if(x1&0x10) y=@064d;else y=@064e;
  $  182.Group4：充电机电压异常                                   $    $          $    $  ANS054.BYTE029  $  if(x1&0x20) y=@064d;else y=@064e;
  $  183.Group4：BMS和车辆辨识报文超时                            $    $          $    $  ANS054.BYTE029  $  if(x1&0x40) y=@064d;else y=@064e;
  $  184.Group4：电池充电参数报文超时                             $    $          $    $  ANS054.BYTE029  $  if(x1&0x80) y=@064d;else y=@064e;
  $  185.Group4：BMS完成充电准备报文超时                          $    $          $    $  ANS054.BYTE030  $  if(x1&0x01) y=@064d;else y=@064e;
  $  186.Group4：电池充电总状态报文超时                           $    $          $    $  ANS054.BYTE030  $  if(x1&0x02) y=@064d;else y=@064e;
  $  187.Group4：电池充电要求报文超时                             $    $          $    $  ANS054.BYTE030  $  if(x1&0x04) y=@064d;else y=@064e;
  $  188.Group4：BMS中止充电报文超时                              $    $          $    $  ANS054.BYTE030  $  if(x1&0x08) y=@064d;else y=@064e;
  $  189.Group4：BMS充电统计报文超时                              $    $          $    $  ANS054.BYTE030  $  if(x1&0x10) y=@064d;else y=@064e;
  $  190.Group4：充电柜多帧交互异常                               $    $          $    $  ANS054.BYTE030  $  if(x1&0x20) y=@064d;else y=@064e;
  $  191.Group4：充电机0x00 辨识报文超时                          $    $          $    $  ANS054.BYTE030  $  if(x1&0x40) y=@064d;else y=@064e;
  $  192.Group4：充电机0xAA 辨识报文超时                          $    $          $    $  ANS054.BYTE030  $  if(x1&0x80) y=@064d;else y=@064e;
  $  193.Group4：充电机时间同步和充电机最大输出能力报文超时       $    $          $    $  ANS054.BYTE031  $  if(x1&0x01) y=@064d;else y=@064e;
  $  194.Group4：充电机完成充电准备报文超时                       $    $          $    $  ANS054.BYTE031  $  if(x1&0x02) y=@064d;else y=@064e;
  $  195.Group4：充电机充电状态报文超时                           $    $          $    $  ANS054.BYTE031  $  if(x1&0x04) y=@064d;else y=@064e;
  $  196.Group4：充电机中止充电报文超时                           $    $          $    $  ANS054.BYTE031  $  if(x1&0x08) y=@064d;else y=@064e;
  $  197.Group4：充电机充电统计报文超时                           $    $          $    $  ANS054.BYTE031  $  if(x1&0x10) y=@064d;else y=@064e;
  $  198.Group4：BMC充电电流过大                                  $    $          $    $  ANS054.BYTE031  $  if(x1&0x20) y=@064d;else y=@064e;
  $  199.Group4：BMC充电电压异常                                  $    $          $    $  ANS054.BYTE031  $  if(x1&0x40) y=@064d;else y=@064e;
  $  200.Group4：充电机其他故障                                   $    $          $    $  ANS054.BYTE031  $  if(x1&0x80) y=@064d;else y=@064e;
  $  201.Group4：充电机故障中止                                   $    $          $    $  ANS054.BYTE032  $  if(x1&0x01) y=@064d;else y=@064e;
  $  202.Group4：达到充电机设定的条件中止                         $    $          $    $  ANS054.BYTE032  $  if(x1&0x02) y=@064d;else y=@064e;
  $  203.Group4：人工中止                                         $    $          $    $  ANS054.BYTE032  $  if(x1&0x04) y=@064d;else y=@064e;
  $  204.Group4：故障中止                                         $    $          $    $  ANS054.BYTE032  $  if(x1&0x08) y=@064d;else y=@064e;
  $  205.Group4：月                                               $    $          $    $  ANS054.BYTE032  $  y=SPRINTF([%02d],x1);
  $  206.Group4：日                                               $    $          $    $  ANS054.BYTE033  $  y=SPRINTF([%02d],x1);
  $  207.Group4：时                                               $    $          $    $  ANS054.BYTE034  $  y=SPRINTF([%02d],x1);
  $  208.Group4：预留                                             $    $          $    $  ANS054.BYTE035  $  y=SPRINTF([%02d],x1);
  $  209.Group5：BMC检测到整车故障                                $    $          $    $  ANS054.BYTE036  $  if(x1&0x10) y=@064d;else y=@064e;
  $  210.Group5：升降压模块故障                                   $    $          $    $  ANS054.BYTE036  $  if(x1&0x20) y=@064d;else y=@064e;
  $  211.Group5：直流充电机电压输出异常                           $    $          $    $  ANS054.BYTE036  $  if(x1&0x40) y=@064d;else y=@064e;
  $  212.Group5：充电机过温故障                                   $    $          $    $  ANS054.BYTE036  $  if(x1&0x80) y=@064d;else y=@064e;
  $  213.Group5：充电连接器故障                                   $    $          $    $  ANS054.BYTE037  $  if(x1&0x01) y=@064d;else y=@064e;
  $  214.Group5：充电机内部过温故障                               $    $          $    $  ANS054.BYTE037  $  if(x1&0x02) y=@064d;else y=@064e;
  $  215.Group5：所需电量不能传送                                 $    $          $    $  ANS054.BYTE037  $  if(x1&0x04) y=@064d;else y=@064e;
  $  216.Group5：充电机急停故障                                   $    $          $    $  ANS054.BYTE037  $  if(x1&0x08) y=@064d;else y=@064e;
  $  217.Group5：充电机电流不匹配                                 $    $          $    $  ANS054.BYTE037  $  if(x1&0x10) y=@064d;else y=@064e;
  $  218.Group5：充电机电压异常                                   $    $          $    $  ANS054.BYTE037  $  if(x1&0x20) y=@064d;else y=@064e;
  $  219.Group5：BMS和车辆辨识报文超时                            $    $          $    $  ANS054.BYTE037  $  if(x1&0x40) y=@064d;else y=@064e;
  $  220.Group5：电池充电参数报文超时                             $    $          $    $  ANS054.BYTE037  $  if(x1&0x80) y=@064d;else y=@064e;
  $  221.Group5：BMS完成充电准备报文超时                          $    $          $    $  ANS054.BYTE038  $  if(x1&0x01) y=@064d;else y=@064e;
  $  222.Group5：电池充电总状态报文超时                           $    $          $    $  ANS054.BYTE038  $  if(x1&0x02) y=@064d;else y=@064e;
  $  223.Group5：电池充电要求报文超时                             $    $          $    $  ANS054.BYTE038  $  if(x1&0x04) y=@064d;else y=@064e;
  $  224.Group5：BMS中止充电报文超时                              $    $          $    $  ANS054.BYTE038  $  if(x1&0x08) y=@064d;else y=@064e;
  $  225.Group5：BMS充电统计报文超时                              $    $          $    $  ANS054.BYTE038  $  if(x1&0x10) y=@064d;else y=@064e;
  $  226.Group5：充电柜多帧交互异常                               $    $          $    $  ANS054.BYTE038  $  if(x1&0x20) y=@064d;else y=@064e;
  $  227.Group5：充电机0x00 辨识报文超时                          $    $          $    $  ANS054.BYTE038  $  if(x1&0x40) y=@064d;else y=@064e;
  $  228.Group5：充电机0xAA 辨识报文超时                          $    $          $    $  ANS054.BYTE038  $  if(x1&0x80) y=@064d;else y=@064e;
  $  229.Group5：充电机时间同步和充电机最大输出能力报文超时       $    $          $    $  ANS054.BYTE039  $  if(x1&0x01) y=@064d;else y=@064e;
  $  230.Group5：充电机完成充电准备报文超时                       $    $          $    $  ANS054.BYTE039  $  if(x1&0x02) y=@064d;else y=@064e;
  $  231.Group5：充电机充电状态报文超时                           $    $          $    $  ANS054.BYTE039  $  if(x1&0x04) y=@064d;else y=@064e;
  $  232.Group5：充电机中止充电报文超时                           $    $          $    $  ANS054.BYTE039  $  if(x1&0x08) y=@064d;else y=@064e;
  $  233.Group5：充电机充电统计报文超时                           $    $          $    $  ANS054.BYTE039  $  if(x1&0x10) y=@064d;else y=@064e;
  $  234.Group5：BMC充电电流过大                                  $    $          $    $  ANS054.BYTE039  $  if(x1&0x20) y=@064d;else y=@064e;
  $  235.Group5：BMC充电电压异常                                  $    $          $    $  ANS054.BYTE039  $  if(x1&0x40) y=@064d;else y=@064e;
  $  236.Group5：充电机其他故障                                   $    $          $    $  ANS054.BYTE039  $  if(x1&0x80) y=@064d;else y=@064e;
  $  237.Group5：充电机故障中止                                   $    $          $    $  ANS054.BYTE040  $  if(x1&0x01) y=@064d;else y=@064e;
  $  238.Group5：达到充电机设定的条件中止                         $    $          $    $  ANS054.BYTE040  $  if(x1&0x02) y=@064d;else y=@064e;
  $  239.Group5：人工中止                                         $    $          $    $  ANS054.BYTE040  $  if(x1&0x04) y=@064d;else y=@064e;
  $  240.Group5：故障中止                                         $    $          $    $  ANS054.BYTE040  $  if(x1&0x08) y=@064d;else y=@064e;
  $  241.Group5：月                                               $    $          $    $  ANS054.BYTE040  $  y=SPRINTF([%02d],x1);
  $  242.Group5：日                                               $    $          $    $  ANS054.BYTE041  $  y=SPRINTF([%02d],x1);
  $  243.Group5：时                                               $    $          $    $  ANS054.BYTE042  $  y=SPRINTF([%02d],x1);
  $  244.Group5：预留                                             $    $          $    $  ANS054.BYTE043  $  y=SPRINTF([%02d],x1);

  $)  01.模组信息
  $  01.模组信息
  $  REQ000:781 03 22 01 6C 00 00 00 00       $  ANS000:789 03 22 01 6C 00 00 00 00
  $  REQ001:781 03 22 01 6D 00 00 00 00       $  ANS001:789 03 22 01 6D 00 00 00 00
  $  REQ002:781 03 22 01 6E 00 00 00 00       $  ANS002:789 03 22 01 6E 00 00 00 00
  $  REQ003:781 03 22 01 6F 00 00 00 00       $  ANS003:789 03 22 01 6F 00 00 00 00
  $  REQ004:781 03 22 01 70 00 00 00 00       $  ANS004:789 03 22 01 70 00 00 00 00
  $  REQ005:781 03 22 01 71 00 00 00 00       $  ANS005:789 03 22 01 71 00 00 00 00
  $  REQ006:781 03 22 01 72 00 00 00 00       $  ANS006:789 03 22 01 72 00 00 00 00
  $  REQ007:781 03 22 01 73 00 00 00 00       $  ANS007:789 03 22 01 73 00 00 00 00
  $  REQ008:781 03 22 01 74 00 00 00 00       $  ANS008:789 03 22 01 74 00 00 00 00
  $  REQ009:781 03 22 01 75 00 00 00 00       $  ANS009:789 03 22 01 75 00 00 00 00
  $  REQ010:781 03 22 01 76 00 00 00 00       $  ANS010:789 03 22 01 76 00 00 00 00
  $  REQ011:781 03 22 01 77 00 00 00 00       $  ANS011:789 03 22 01 77 00 00 00 00
  $  REQ012:781 03 22 01 7C 00 00 00 00       $  ANS012:789 03 22 01 7C 00 00 00 00
  $  REQ013:781 03 22 01 7D 00 00 00 00       $  ANS013:789 03 22 01 7D 00 00 00 00
  $  REQ014:781 03 22 01 7E 00 00 00 00       $  ANS014:789 03 22 01 7E 00 00 00 00
  $  REQ015:781 03 22 01 7F 00 00 00 00       $  ANS015:789 03 22 01 7F 00 00 00 00
  $  REQ016:781 03 22 01 80 00 00 00 00       $  ANS016:789 03 22 01 80 00 00 00 00
  $  REQ017:781 03 22 01 81 00 00 00 00       $  ANS017:789 03 22 01 81 00 00 00 00
  $  REQ018:781 03 22 01 82 00 00 00 00       $  ANS018:789 03 22 01 82 00 00 00 00
  $  REQ019:781 03 22 01 83 00 00 00 00       $  ANS019:789 03 22 01 83 00 00 00 00
  $  REQ020:781 03 22 01 84 00 00 00 00       $  ANS020:789 03 22 01 84 00 00 00 00
  $  REQ021:781 03 22 01 85 00 00 00 00       $  ANS021:789 03 22 01 85 00 00 00 00
  $  REQ022:781 03 22 01 86 00 00 00 00       $  ANS022:789 03 22 01 86 00 00 00 00
  $  REQ023:781 03 22 01 87 00 00 00 00       $  ANS023:789 03 22 01 87 00 00 00 00
  $  REQ024:781 03 22 01 8C 00 00 00 00       $  ANS024:789 03 22 01 8C 00 00 00 00
  $  REQ025:781 03 22 01 8D 00 00 00 00       $  ANS025:789 03 22 01 8D 00 00 00 00
  $  REQ026:781 03 22 01 8E 00 00 00 00       $  ANS026:789 03 22 01 8E 00 00 00 00
  $  REQ027:781 03 22 01 8F 00 00 00 00       $  ANS027:789 03 22 01 8F 00 00 00 00
  $  REQ028:781 03 22 01 94 00 00 00 00       $  ANS028:789 03 22 01 94 00 00 00 00
  $  REQ029:781 03 22 01 95 00 00 00 00       $  ANS029:789 03 22 01 95 00 00 00 00
  $  REQ030:781 03 22 01 96 00 00 00 00       $  ANS030:789 03 22 01 96 00 00 00 00
  $  REQ031:781 03 22 01 97 00 00 00 00       $  ANS031:789 03 22 01 97 00 00 00 00
  $  REQ032:781 03 22 01 98 00 00 00 00       $  ANS032:789 03 22 01 98 00 00 00 00
  $  REQ033:781 03 22 01 99 00 00 00 00       $  ANS033:789 03 22 01 99 00 00 00 00
  $  REQ034:781 03 22 01 9A 00 00 00 00       $  ANS034:789 03 22 01 9A 00 00 00 00
  $  REQ035:781 03 22 01 9B 00 00 00 00       $  ANS035:789 03 22 01 9B 00 00 00 00
  $  REQ036:781 03 22 01 9C 00 00 00 00       $  ANS036:789 03 22 01 9C 00 00 00 00
  $  REQ037:781 03 22 01 9D 00 00 00 00       $  ANS037:789 03 22 01 9D 00 00 00 00
  $  REQ038:781 03 22 01 9E 00 00 00 00       $  ANS038:789 03 22 01 9E 00 00 00 00
  $  REQ039:781 03 22 01 9F 00 00 00 00       $  ANS039:789 03 22 01 9F 00 00 00 00

  $  000.BIC1最低电压电池编号       $    $         $    $  ANS000.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  001.BIC1最低单节电池电压       $    $  V      $    $  ANS001.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  002.BIC1最高电压电池编号       $    $         $    $  ANS002.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  003.BIC1最高单节电池电压       $    $  V      $    $  ANS003.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  004.BIC1最低温度电池号         $    $         $    $  ANS004.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  005.BIC1最低单节电池温度       $    $  ℃     $    $  ANS005.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  006.BIC1最高温度电池号         $    $         $    $  ANS006.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  007.BIC1最高单节电池温度       $    $  ℃     $    $  ANS007.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  008.BIC2最低电压电池编号       $    $         $    $  ANS008.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  009.BIC2最低单节电池电压       $    $  V      $    $  ANS009.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  010.BIC2最高电压电池编号       $    $         $    $  ANS010.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  011.BIC2最高单节电池电压       $    $  V      $    $  ANS011.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  012.BIC3最低电压电池编号       $    $         $    $  ANS012.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  013.BIC3最低单节电池电压       $    $  V      $    $  ANS013.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  014.BIC3最高电压电池编号       $    $         $    $  ANS014.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  015.BIC3最高单节电池电压       $    $  V      $    $  ANS015.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  016.BIC3最低温度电池号         $    $         $    $  ANS016.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  017.BIC3最低单节电池温度       $    $  ℃     $    $  ANS017.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  018.BIC3最高温度电池号         $    $         $    $  ANS018.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  019.BIC3最高单节电池温度       $    $  ℃     $    $  ANS019.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  020.BIC4最低电压电池编号       $    $         $    $  ANS020.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  021.BIC4最低单节电池电压       $    $  V      $    $  ANS021.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  022.BIC4最高电压电池编号       $    $         $    $  ANS022.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  023.BIC4最高单节电池电压       $    $  V      $    $  ANS023.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  024.BIC5最低电压电池编号       $    $         $    $  ANS024.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  025.BIC5最低单节电池电压       $    $  V      $    $  ANS025.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  026.BIC5最高电压电池编号       $    $         $    $  ANS026.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  027.BIC5最高单节电池电压       $    $  V      $    $  ANS027.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  028.BIC6最低电压电池编号       $    $         $    $  ANS028.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  029.BIC6最低单节电池电压       $    $  V      $    $  ANS029.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  030.BIC6最高电压电池编号       $    $         $    $  ANS030.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  031.BIC6最高单节电池电压       $    $  V      $    $  ANS031.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  032.BIC6最低温度电池号         $    $         $    $  ANS032.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  033.BIC6最低单节电池温度       $    $  ℃     $    $  ANS033.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  034.BIC6最高温度电池号         $    $         $    $  ANS034.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  035.BIC6最高单节电池温度       $    $  ℃     $    $  ANS035.BYTE004  $  y=SPRINTF([%d],x1-40);
  $  036.BIC7最低电压电池编号       $    $         $    $  ANS036.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  037.BIC7最低单节电池电压       $    $  V      $    $  ANS037.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);
  $  038.BIC7最高电压电池编号       $    $         $    $  ANS038.BYTE004  $  y=SPRINTF([%d],x1+1);
  $  039.BIC7最高单节电池电压       $    $  V      $    $  ANS039.BYTE004  $  y=SPRINTF([%.3f],(x2*256+x1)*0.001);

  $)  02.均衡信息
  $  02.均衡信息
  $  REQ000:781 03 22 00 40 00 00 00 00       $  ANS000:789 03 22 00 40 00 00 00 00
  $  REQ001:781 03 22 00 41 00 00 00 00       $  ANS001:789 03 22 00 41 00 00 00 00
  $  REQ002:781 03 22 00 42 00 00 00 00       $  ANS002:789 03 22 00 42 00 00 00 00
  $  REQ003:781 03 22 00 43 00 00 00 00       $  ANS003:789 03 22 00 43 00 00 00 00
  $  REQ004:781 03 22 00 44 00 00 00 00       $  ANS004:789 03 22 00 44 00 00 00 00
  $  REQ005:781 03 22 00 45 00 00 00 00       $  ANS005:789 03 22 00 45 00 00 00 00
  $  REQ006:781 03 22 00 46 00 00 00 00       $  ANS006:789 03 22 00 46 00 00 00 00
  $  REQ007:781 03 22 00 47 00 00 00 00       $  ANS007:789 03 22 00 47 00 00 00 00
  $  REQ008:781 03 22 00 48 00 00 00 00       $  ANS008:789 03 22 00 48 00 00 00 00
  $  REQ009:781 03 22 00 49 00 00 00 00       $  ANS009:789 03 22 00 49 00 00 00 00
  $  REQ010:781 03 22 00 4A 00 00 00 00       $  ANS010:789 03 22 00 4A 00 00 00 00
  $  REQ011:781 03 22 00 4B 00 00 00 00       $  ANS011:789 03 22 00 4B 00 00 00 00
  $  REQ012:781 03 22 00 4C 00 00 00 00       $  ANS012:789 03 22 00 4C 00 00 00 00
  $  REQ013:781 03 22 00 4D 00 00 00 00       $  ANS013:789 03 22 00 4D 00 00 00 00
  $  REQ014:781 03 22 00 4E 00 00 00 00       $  ANS014:789 03 22 00 4E 00 00 00 00
  $  REQ015:781 03 22 00 4F 00 00 00 00       $  ANS015:789 03 22 00 4F 00 00 00 00
  $  REQ016:781 03 22 00 50 00 00 00 00       $  ANS016:789 03 22 00 50 00 00 00 00
  $  REQ017:781 03 22 00 51 00 00 00 00       $  ANS017:789 03 22 00 51 00 00 00 00
  $  REQ018:781 03 22 00 52 00 00 00 00       $  ANS018:789 03 22 00 52 00 00 00 00
  $  REQ019:781 03 22 00 53 00 00 00 00       $  ANS019:789 03 22 00 53 00 00 00 00
  $  REQ020:781 03 22 00 54 00 00 00 00       $  ANS020:789 03 22 00 54 00 00 00 00
  $  REQ021:781 03 22 00 55 00 00 00 00       $  ANS021:789 03 22 00 55 00 00 00 00
  $  REQ022:781 03 22 00 56 00 00 00 00       $  ANS022:789 03 22 00 56 00 00 00 00
  $  REQ023:781 03 22 00 57 00 00 00 00       $  ANS023:789 03 22 00 57 00 00 00 00
  $  REQ024:781 03 22 00 58 00 00 00 00       $  ANS024:789 03 22 00 58 00 00 00 00
  $  REQ025:781 03 22 00 59 00 00 00 00       $  ANS025:789 03 22 00 59 00 00 00 00
  $  REQ026:781 03 22 00 5A 00 00 00 00       $  ANS026:789 03 22 00 5A 00 00 00 00
  $  REQ027:781 03 22 00 5B 00 00 00 00       $  ANS027:789 03 22 00 5B 00 00 00 00
  $  REQ028:781 03 22 00 5C 00 00 00 00       $  ANS028:789 03 22 00 5C 00 00 00 00
  $  REQ029:781 03 22 00 5D 00 00 00 00       $  ANS029:789 03 22 00 5D 00 00 00 00
  $  REQ030:781 03 22 00 5E 00 00 00 00       $  ANS030:789 03 22 00 5E 00 00 00 00
  $  REQ031:781 03 22 00 5F 00 00 00 00       $  ANS031:789 03 22 00 5F 00 00 00 00
  $  REQ032:781 03 22 00 60 00 00 00 00       $  ANS032:789 03 22 00 60 00 00 00 00
  $  REQ033:781 03 22 00 61 00 00 00 00       $  ANS033:789 03 22 00 61 00 00 00 00
  $  REQ034:781 03 22 00 62 00 00 00 00       $  ANS034:789 03 22 00 62 00 00 00 00
  $  REQ035:781 03 22 00 63 00 00 00 00       $  ANS035:789 03 22 00 63 00 00 00 00
  $  REQ036:781 03 22 00 64 00 00 00 00       $  ANS036:789 03 22 00 64 00 00 00 00
  $  REQ037:781 03 22 00 65 00 00 00 00       $  ANS037:789 03 22 00 65 00 00 00 00
  $  REQ038:781 03 22 00 66 00 00 00 00       $  ANS038:789 03 22 00 66 00 00 00 00
  $  REQ039:781 03 22 00 67 00 00 00 00       $  ANS039:789 03 22 00 67 00 00 00 00
  $  REQ040:781 03 22 00 68 00 00 00 00       $  ANS040:789 03 22 00 68 00 00 00 00
  $  REQ041:781 03 22 00 69 00 00 00 00       $  ANS041:789 03 22 00 69 00 00 00 00
  $  REQ042:781 03 22 00 6A 00 00 00 00       $  ANS042:789 03 22 00 6A 00 00 00 00
  $  REQ043:781 03 22 00 6B 00 00 00 00       $  ANS043:789 03 22 00 6B 00 00 00 00
  $  REQ044:781 03 22 00 6C 00 00 00 00       $  ANS044:789 03 22 00 6C 00 00 00 00
  $  REQ045:781 03 22 00 6D 00 00 00 00       $  ANS045:789 03 22 00 6D 00 00 00 00
  $  REQ046:781 03 22 00 6E 00 00 00 00       $  ANS046:789 03 22 00 6E 00 00 00 00
  $  REQ047:781 03 22 00 6F 00 00 00 00       $  ANS047:789 03 22 00 6F 00 00 00 00
  $  REQ048:781 03 22 00 70 00 00 00 00       $  ANS048:789 03 22 00 70 00 00 00 00
  $  REQ049:781 03 22 00 71 00 00 00 00       $  ANS049:789 03 22 00 71 00 00 00 00
  $  REQ050:781 03 22 00 72 00 00 00 00       $  ANS050:789 03 22 00 72 00 00 00 00
  $  REQ051:781 03 22 00 73 00 00 00 00       $  ANS051:789 03 22 00 73 00 00 00 00
  $  REQ052:781 03 22 00 74 00 00 00 00       $  ANS052:789 03 22 00 74 00 00 00 00
  $  REQ053:781 03 22 00 75 00 00 00 00       $  ANS053:789 03 22 00 75 00 00 00 00
  $  REQ054:781 03 22 00 76 00 00 00 00       $  ANS054:789 03 22 00 76 00 00 00 00
  $  REQ055:781 03 22 00 77 00 00 00 00       $  ANS055:789 03 22 00 77 00 00 00 00
  $  REQ056:781 03 22 00 78 00 00 00 00       $  ANS056:789 03 22 00 78 00 00 00 00
  $  REQ057:781 03 22 00 79 00 00 00 00       $  ANS057:789 03 22 00 79 00 00 00 00
  $  REQ058:781 03 22 00 7A 00 00 00 00       $  ANS058:789 03 22 00 7A 00 00 00 00
  $  REQ059:781 03 22 00 7B 00 00 00 00       $  ANS059:789 03 22 00 7B 00 00 00 00
  $  REQ060:781 03 22 00 7C 00 00 00 00       $  ANS060:789 03 22 00 7C 00 00 00 00
  $  REQ061:781 03 22 00 7D 00 00 00 00       $  ANS061:789 03 22 00 7D 00 00 00 00
  $  REQ062:781 03 22 00 7E 00 00 00 00       $  ANS062:789 03 22 00 7E 00 00 00 00
  $  REQ063:781 03 22 00 7F 00 00 00 00       $  ANS063:789 03 22 00 7F 00 00 00 00
  $  REQ064:781 03 22 00 80 00 00 00 00       $  ANS064:789 03 22 00 80 00 00 00 00
  $  REQ065:781 03 22 00 81 00 00 00 00       $  ANS065:789 03 22 00 81 00 00 00 00
  $  REQ066:781 03 22 00 82 00 00 00 00       $  ANS066:789 03 22 00 82 00 00 00 00
  $  REQ067:781 03 22 00 83 00 00 00 00       $  ANS067:789 03 22 00 83 00 00 00 00
  $  REQ068:781 03 22 00 84 00 00 00 00       $  ANS068:789 03 22 00 84 00 00 00 00
  $  REQ069:781 03 22 00 85 00 00 00 00       $  ANS069:789 03 22 00 85 00 00 00 00
  $  REQ070:781 03 22 00 86 00 00 00 00       $  ANS070:789 03 22 00 86 00 00 00 00
  $  REQ071:781 03 22 00 87 00 00 00 00       $  ANS071:789 03 22 00 87 00 00 00 00
  $  REQ072:781 03 22 00 88 00 00 00 00       $  ANS072:789 03 22 00 88 00 00 00 00
  $  REQ073:781 03 22 00 89 00 00 00 00       $  ANS073:789 03 22 00 89 00 00 00 00
  $  REQ074:781 03 22 00 8A 00 00 00 00       $  ANS074:789 03 22 00 8A 00 00 00 00
  $  REQ075:781 03 22 00 8B 00 00 00 00       $  ANS075:789 03 22 00 8B 00 00 00 00
  $  REQ076:781 03 22 00 8C 00 00 00 00       $  ANS076:789 03 22 00 8C 00 00 00 00
  $  REQ077:781 03 22 00 8D 00 00 00 00       $  ANS077:789 03 22 00 8D 00 00 00 00
  $  REQ078:781 03 22 00 8E 00 00 00 00       $  ANS078:789 03 22 00 8E 00 00 00 00
  $  REQ079:781 03 22 00 8F 00 00 00 00       $  ANS079:789 03 22 00 8F 00 00 00 00
  $  REQ080:781 03 22 00 90 00 00 00 00       $  ANS080:789 03 22 00 90 00 00 00 00
  $  REQ081:781 03 22 00 91 00 00 00 00       $  ANS081:789 03 22 00 91 00 00 00 00
  $  REQ082:781 03 22 00 92 00 00 00 00       $  ANS082:789 03 22 00 92 00 00 00 00
  $  REQ083:781 03 22 00 93 00 00 00 00       $  ANS083:789 03 22 00 93 00 00 00 00
  $  REQ084:781 03 22 00 94 00 00 00 00       $  ANS084:789 03 22 00 94 00 00 00 00
  $  REQ085:781 03 22 00 95 00 00 00 00       $  ANS085:789 03 22 00 95 00 00 00 00
  $  REQ086:781 03 22 00 96 00 00 00 00       $  ANS086:789 03 22 00 96 00 00 00 00
  $  REQ087:781 03 22 00 97 00 00 00 00       $  ANS087:789 03 22 00 97 00 00 00 00
  $  REQ088:781 03 22 00 98 00 00 00 00       $  ANS088:789 03 22 00 98 00 00 00 00
  $  REQ089:781 03 22 00 99 00 00 00 00       $  ANS089:789 03 22 00 99 00 00 00 00
  $  REQ090:781 03 22 00 9A 00 00 00 00       $  ANS090:789 03 22 00 9A 00 00 00 00
  $  REQ091:781 03 22 00 9B 00 00 00 00       $  ANS091:789 03 22 00 9B 00 00 00 00
  $  REQ092:781 03 22 00 9C 00 00 00 00       $  ANS092:789 03 22 00 9C 00 00 00 00
  $  REQ093:781 03 22 00 9D 00 00 00 00       $  ANS093:789 03 22 00 9D 00 00 00 00
  $  REQ094:781 03 22 00 9E 00 00 00 00       $  ANS094:789 03 22 00 9E 00 00 00 00
  $  REQ095:781 03 22 00 9F 00 00 00 00       $  ANS095:789 03 22 00 9F 00 00 00 00

  $  000.第1节电池均衡累计时间        $    $  H     $    $  ANS000.BYTE004  $  y=(x2*256+x1);
  $  001.第2节电池均衡累计时间        $    $  H     $    $  ANS001.BYTE004  $  y=(x2*256+x1);
  $  002.第3节电池均衡累计时间        $    $  H     $    $  ANS002.BYTE004  $  y=(x2*256+x1);
  $  003.第4节电池均衡累计时间        $    $  H     $    $  ANS003.BYTE004  $  y=(x2*256+x1);
  $  004.第5节电池均衡累计时间        $    $  H     $    $  ANS004.BYTE004  $  y=(x2*256+x1);
  $  005.第6节电池均衡累计时间        $    $  H     $    $  ANS005.BYTE004  $  y=(x2*256+x1);
  $  006.第7节电池均衡累计时间        $    $  H     $    $  ANS006.BYTE004  $  y=(x2*256+x1);
  $  007.第8节电池均衡累计时间        $    $  H     $    $  ANS007.BYTE004  $  y=(x2*256+x1);
  $  008.第9节电池均衡累计时间        $    $  H     $    $  ANS008.BYTE004  $  y=(x2*256+x1);
  $  009.第10节电池均衡累计时间       $    $  H     $    $  ANS009.BYTE004  $  y=(x2*256+x1);
  $  010.第11节电池均衡累计时间       $    $  H     $    $  ANS010.BYTE004  $  y=(x2*256+x1);
  $  011.第12节电池均衡累计时间       $    $  H     $    $  ANS011.BYTE004  $  y=(x2*256+x1);
  $  012.第13节电池均衡累计时间       $    $  H     $    $  ANS012.BYTE004  $  y=(x2*256+x1);
  $  013.第14节电池均衡累计时间       $    $  H     $    $  ANS013.BYTE004  $  y=(x2*256+x1);
  $  014.第15节电池均衡累计时间       $    $  H     $    $  ANS014.BYTE004  $  y=(x2*256+x1);
  $  015.第16节电池均衡累计时间       $    $  H     $    $  ANS015.BYTE004  $  y=(x2*256+x1);
  $  016.第17节电池均衡累计时间       $    $  H     $    $  ANS016.BYTE004  $  y=(x2*256+x1);
  $  017.第18节电池均衡累计时间       $    $  H     $    $  ANS017.BYTE004  $  y=(x2*256+x1);
  $  018.第19节电池均衡累计时间       $    $  H     $    $  ANS018.BYTE004  $  y=(x2*256+x1);
  $  019.第20节电池均衡累计时间       $    $  H     $    $  ANS019.BYTE004  $  y=(x2*256+x1);
  $  020.第21节电池均衡累计时间       $    $  H     $    $  ANS020.BYTE004  $  y=(x2*256+x1);
  $  021.第22节电池均衡累计时间       $    $  H     $    $  ANS021.BYTE004  $  y=(x2*256+x1);
  $  022.第23节电池均衡累计时间       $    $  H     $    $  ANS022.BYTE004  $  y=(x2*256+x1);
  $  023.第24节电池均衡累计时间       $    $  H     $    $  ANS023.BYTE004  $  y=(x2*256+x1);
  $  024.第25节电池均衡累计时间       $    $  H     $    $  ANS024.BYTE004  $  y=(x2*256+x1);
  $  025.第26节电池均衡累计时间       $    $  H     $    $  ANS025.BYTE004  $  y=(x2*256+x1);
  $  026.第27节电池均衡累计时间       $    $  H     $    $  ANS026.BYTE004  $  y=(x2*256+x1);
  $  027.第28节电池均衡累计时间       $    $  H     $    $  ANS027.BYTE004  $  y=(x2*256+x1);
  $  028.第29节电池均衡累计时间       $    $  H     $    $  ANS028.BYTE004  $  y=(x2*256+x1);
  $  029.第30节电池均衡累计时间       $    $  H     $    $  ANS029.BYTE004  $  y=(x2*256+x1);
  $  030.第31节电池均衡累计时间       $    $  H     $    $  ANS030.BYTE004  $  y=(x2*256+x1);
  $  031.第32节电池均衡累计时间       $    $  H     $    $  ANS031.BYTE004  $  y=(x2*256+x1);
  $  032.第33节电池均衡累计时间       $    $  H     $    $  ANS032.BYTE004  $  y=(x2*256+x1);
  $  033.第34节电池均衡累计时间       $    $  H     $    $  ANS033.BYTE004  $  y=(x2*256+x1);
  $  034.第35节电池均衡累计时间       $    $  H     $    $  ANS034.BYTE004  $  y=(x2*256+x1);
  $  035.第36节电池均衡累计时间       $    $  H     $    $  ANS035.BYTE004  $  y=(x2*256+x1);
  $  036.第37节电池均衡累计时间       $    $  H     $    $  ANS036.BYTE004  $  y=(x2*256+x1);
  $  037.第38节电池均衡累计时间       $    $  H     $    $  ANS037.BYTE004  $  y=(x2*256+x1);
  $  038.第39节电池均衡累计时间       $    $  H     $    $  ANS038.BYTE004  $  y=(x2*256+x1);
  $  039.第40节电池均衡累计时间       $    $  H     $    $  ANS039.BYTE004  $  y=(x2*256+x1);
  $  040.第41节电池均衡累计时间       $    $  H     $    $  ANS040.BYTE004  $  y=(x2*256+x1);
  $  041.第42节电池均衡累计时间       $    $  H     $    $  ANS041.BYTE004  $  y=(x2*256+x1);
  $  042.第43节电池均衡累计时间       $    $  H     $    $  ANS042.BYTE004  $  y=(x2*256+x1);
  $  043.第44节电池均衡累计时间       $    $  H     $    $  ANS043.BYTE004  $  y=(x2*256+x1);
  $  044.第45节电池均衡累计时间       $    $  H     $    $  ANS044.BYTE004  $  y=(x2*256+x1);
  $  045.第46节电池均衡累计时间       $    $  H     $    $  ANS045.BYTE004  $  y=(x2*256+x1);
  $  046.第47节电池均衡累计时间       $    $  H     $    $  ANS046.BYTE004  $  y=(x2*256+x1);
  $  047.第48节电池均衡累计时间       $    $  H     $    $  ANS047.BYTE004  $  y=(x2*256+x1);
  $  048.第49节电池均衡累计时间       $    $  H     $    $  ANS048.BYTE004  $  y=(x2*256+x1);
  $  049.第50节电池均衡累计时间       $    $  H     $    $  ANS049.BYTE004  $  y=(x2*256+x1);
  $  050.第51节电池均衡累计时间       $    $  H     $    $  ANS050.BYTE004  $  y=(x2*256+x1);
  $  051.第52节电池均衡累计时间       $    $  H     $    $  ANS051.BYTE004  $  y=(x2*256+x1);
  $  052.第53节电池均衡累计时间       $    $  H     $    $  ANS052.BYTE004  $  y=(x2*256+x1);
  $  053.第54节电池均衡累计时间       $    $  H     $    $  ANS053.BYTE004  $  y=(x2*256+x1);
  $  054.第55节电池均衡累计时间       $    $  H     $    $  ANS054.BYTE004  $  y=(x2*256+x1);
  $  055.第56节电池均衡累计时间       $    $  H     $    $  ANS055.BYTE004  $  y=(x2*256+x1);
  $  056.第57节电池均衡累计时间       $    $  H     $    $  ANS056.BYTE004  $  y=(x2*256+x1);
  $  057.第58节电池均衡累计时间       $    $  H     $    $  ANS057.BYTE004  $  y=(x2*256+x1);
  $  058.第59节电池均衡累计时间       $    $  H     $    $  ANS058.BYTE004  $  y=(x2*256+x1);
  $  059.第60节电池均衡累计时间       $    $  H     $    $  ANS059.BYTE004  $  y=(x2*256+x1);
  $  060.第61节电池均衡累计时间       $    $  H     $    $  ANS060.BYTE004  $  y=(x2*256+x1);
  $  061.第62节电池均衡累计时间       $    $  H     $    $  ANS061.BYTE004  $  y=(x2*256+x1);
  $  062.第63节电池均衡累计时间       $    $  H     $    $  ANS062.BYTE004  $  y=(x2*256+x1);
  $  063.第64节电池均衡累计时间       $    $  H     $    $  ANS063.BYTE004  $  y=(x2*256+x1);
  $  064.第65节电池均衡累计时间       $    $  H     $    $  ANS064.BYTE004  $  y=(x2*256+x1);
  $  065.第66节电池均衡累计时间       $    $  H     $    $  ANS065.BYTE004  $  y=(x2*256+x1);
  $  066.第67节电池均衡累计时间       $    $  H     $    $  ANS066.BYTE004  $  y=(x2*256+x1);
  $  067.第68节电池均衡累计时间       $    $  H     $    $  ANS067.BYTE004  $  y=(x2*256+x1);
  $  068.第69节电池均衡累计时间       $    $  H     $    $  ANS068.BYTE004  $  y=(x2*256+x1);
  $  069.第70节电池均衡累计时间       $    $  H     $    $  ANS069.BYTE004  $  y=(x2*256+x1);
  $  070.第71节电池均衡累计时间       $    $  H     $    $  ANS070.BYTE004  $  y=(x2*256+x1);
  $  071.第72节电池均衡累计时间       $    $  H     $    $  ANS071.BYTE004  $  y=(x2*256+x1);
  $  072.第73节电池均衡累计时间       $    $  H     $    $  ANS072.BYTE004  $  y=(x2*256+x1);
  $  073.第74节电池均衡累计时间       $    $  H     $    $  ANS073.BYTE004  $  y=(x2*256+x1);
  $  074.第75节电池均衡累计时间       $    $  H     $    $  ANS074.BYTE004  $  y=(x2*256+x1);
  $  075.第76节电池均衡累计时间       $    $  H     $    $  ANS075.BYTE004  $  y=(x2*256+x1);
  $  076.第77节电池均衡累计时间       $    $  H     $    $  ANS076.BYTE004  $  y=(x2*256+x1);
  $  077.第78节电池均衡累计时间       $    $  H     $    $  ANS077.BYTE004  $  y=(x2*256+x1);
  $  078.第79节电池均衡累计时间       $    $  H     $    $  ANS078.BYTE004  $  y=(x2*256+x1);
  $  079.第80节电池均衡累计时间       $    $  H     $    $  ANS079.BYTE004  $  y=(x2*256+x1);
  $  080.第81节电池均衡累计时间       $    $  H     $    $  ANS080.BYTE004  $  y=(x2*256+x1);
  $  081.第82节电池均衡累计时间       $    $  H     $    $  ANS081.BYTE004  $  y=(x2*256+x1);
  $  082.第83节电池均衡累计时间       $    $  H     $    $  ANS082.BYTE004  $  y=(x2*256+x1);
  $  083.第84节电池均衡累计时间       $    $  H     $    $  ANS083.BYTE004  $  y=(x2*256+x1);
  $  084.第85节电池均衡累计时间       $    $  H     $    $  ANS084.BYTE004  $  y=(x2*256+x1);
  $  085.第86节电池均衡累计时间       $    $  H     $    $  ANS085.BYTE004  $  y=(x2*256+x1);
  $  086.第87节电池均衡累计时间       $    $  H     $    $  ANS086.BYTE004  $  y=(x2*256+x1);
  $  087.第88节电池均衡累计时间       $    $  H     $    $  ANS087.BYTE004  $  y=(x2*256+x1);
  $  088.第89节电池均衡累计时间       $    $  H     $    $  ANS088.BYTE004  $  y=(x2*256+x1);
  $  089.第90节电池均衡累计时间       $    $  H     $    $  ANS089.BYTE004  $  y=(x2*256+x1);
  $  090.第91节电池均衡累计时间       $    $  H     $    $  ANS090.BYTE004  $  y=(x2*256+x1);
  $  091.第92节电池均衡累计时间       $    $  H     $    $  ANS091.BYTE004  $  y=(x2*256+x1);
  $  092.第93节电池均衡累计时间       $    $  H     $    $  ANS092.BYTE004  $  y=(x2*256+x1);
  $  093.第94节电池均衡累计时间       $    $  H     $    $  ANS093.BYTE004  $  y=(x2*256+x1);
  $  094.第95节电池均衡累计时间       $    $  H     $    $  ANS094.BYTE004  $  y=(x2*256+x1);
  $  095.第96节电池均衡累计时间       $    $  H     $    $  ANS095.BYTE004  $  y=(x2*256+x1);

  $)  03.采样信息
  $  03.采样信息
  $  REQ000:781 03 22 11 0A 00 00 00 00       $  ANS000:789 03 22 11 0A 00 00 00 00
  $  REQ001:781 03 22 11 00 00 00 00 00       $  ANS001:789 03 22 11 00 00 00 00 00
  $  REQ002:781 03 22 11 01 00 00 00 00       $  ANS002:789 03 22 11 01 00 00 00 00
  $  REQ003:781 03 22 11 02 00 00 00 00       $  ANS003:789 03 22 11 02 00 00 00 00

  $  000.1号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  001.2号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  002.3号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  003.4号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  004.5号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  005.6号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  006.7号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  007.8号温度采样状态            $    $       $    $  ANS000.BYTE004  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  008.9号温度采样状态            $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  009.10号温度采样状态           $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  010.11号温度采样状态           $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  011.12号温度采样状态           $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  012.13号温度采样状态           $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  013.14号温度采样状态           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  014.15号温度采样状态           $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  015.16号温度采样状态           $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  016.17号温度采样状态           $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  017.18号温度采样状态           $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  018.19号温度采样状态           $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  019.20号温度采样状态           $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  020.21号温度采样状态           $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  021.1号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  022.2号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  023.3号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  024.4号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  025.5号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  026.6号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  027.7号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  028.8号电池电压采样状态        $    $       $    $  ANS001.BYTE004  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  029.9号电池电压采样状态        $    $       $    $  ANS001.BYTE005  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  030.10号电池电压采样状态       $    $       $    $  ANS001.BYTE005  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  031.11号电池电压采样状态       $    $       $    $  ANS001.BYTE005  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  032.12号电池电压采样状态       $    $       $    $  ANS001.BYTE005  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  033.13号电池电压采样状态       $    $       $    $  ANS001.BYTE005  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  034.14号电池电压采样状态       $    $       $    $  ANS001.BYTE005  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  035.15号电池电压采样状态       $    $       $    $  ANS001.BYTE005  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  036.16号电池电压采样状态       $    $       $    $  ANS001.BYTE005  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  037.17号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  038.18号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  039.19号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  040.20号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  041.21号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  042.22号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  043.23号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  044.24号电池电压采样状态       $    $       $    $  ANS001.BYTE006  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  045.25号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  046.26号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  047.27号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  048.28号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  049.29号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  050.30号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  051.31号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  052.32号电池电压采样状态       $    $       $    $  ANS001.BYTE007  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  053.33号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  054.34号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  055.35号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  056.36号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  057.37号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  058.38号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  059.39号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  060.40号电池电压采样状态       $    $       $    $  ANS002.BYTE004  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  061.41号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  062.42号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  063.43号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  064.44号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  065.45号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  066.46号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  067.47号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  068.48号电池电压采样状态       $    $       $    $  ANS002.BYTE005  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  069.49号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  070.50号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  071.51号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  072.52号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  073.53号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  074.54号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  075.55号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  076.56号电池电压采样状态       $    $       $    $  ANS002.BYTE006  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  077.57号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  078.58号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  079.59号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  080.60号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  081.61号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  082.62号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  083.63号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  084.64号电池电压采样状态       $    $       $    $  ANS002.BYTE007  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  085.65号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  086.66号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  087.67号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  088.68号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  089.69号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  090.70号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  091.71号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  092.72号电池电压采样状态       $    $       $    $  ANS003.BYTE004  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  093.73号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  094.74号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  095.75号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  096.76号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  097.77号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  098.78号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  099.79号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  100.80号电池电压采样状态       $    $       $    $  ANS003.BYTE005  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  101.81号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  102.82号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  103.83号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  104.84号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  105.85号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  106.86号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  107.87号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  108.88号电池电压采样状态       $    $       $    $  ANS003.BYTE006  $  if(x1&0x80) y=@00b4;else y=@0045;
  $  109.89号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x01) y=@00b4;else y=@0045;
  $  110.90号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x02) y=@00b4;else y=@0045;
  $  111.91号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x04) y=@00b4;else y=@0045;
  $  112.92号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x08) y=@00b4;else y=@0045;
  $  113.93号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x10) y=@00b4;else y=@0045;
  $  114.94号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x20) y=@00b4;else y=@0045;
  $  115.95号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x40) y=@00b4;else y=@0045;
  $  116.96号电池电压采样状态       $    $       $    $  ANS003.BYTE007  $  if(x1&0x80) y=@00b4;else y=@0045;

;******************************************************************************************************************************************************

动作测试:

$^ 00.车辆运行模式信息 
$^TYPE0
$^BUTTON:运行模式1 
$^REQ00:781 07 2E 1F FA 01 00 00 00     $^

$^BUTTON:运行模式2 
$^REQ00:781 07 2E 1F FA 02 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.一键电池冷却主动测试 
$^TYPE0
$^BUTTON:开启 
$^REQ00:781 05 2F 20 05 03 00 00 00     $^

$^BUTTON:关闭 
$^REQ00:781 05 2F 20 05 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:781 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.强制均衡主动测试 
$^TYPE0
$^BUTTON:请求开启均衡 
$^REQ00:781 04 31 20 07 01 00 00 00     $^

$^BUTTON:请求关闭均衡 
$^REQ00:781 04 31 20 07 02 00 00 00     $^

$^BUTTON:进度查询 
$^REQ00:781 04 31 20 07 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:781 04 31 20 07 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:781 30 08 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
