
    车型ID：3303

    模拟：协议模拟-->3303

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~78A

进入命令:

  $~  REQ000:782 02 10 01 00 00 00 00 00       $~  ANS000:78A 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:782 02 3E 80 00 00 00 00 00       $!  ANS000:78A 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:782 03 19 02 09 00 00 00 00       $#  ANS000:78A 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/33000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:782 04 14 FF FF FF 00 00 00       $$  ANS000:78A 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:782 03 22 F1 80 00 00 00 00       $%  ANS000:78A 03 22 F1 80 00 00 00 00
  $%  REQ001:782 03 22 F1 05 00 00 00 00       $%  ANS001:78A 03 22 F1 05 00 00 00 00
  $%  REQ002:782 03 22 F1 12 00 00 00 00       $%  ANS002:78A 03 22 F1 12 00 00 00 00
  $%  REQ003:782 03 22 F1 91 00 00 00 00       $%  ANS003:78A 03 22 F1 91 00 00 00 00
  $%  REQ004:782 03 22 F1 92 00 00 00 00       $%  ANS004:78A 03 22 F1 92 00 00 00 00
  $%  REQ005:782 03 22 F1 93 00 00 00 00       $%  ANS005:78A 03 22 F1 93 00 00 00 00
  $%  REQ006:782 03 22 F1 94 00 00 00 00       $%  ANS006:78A 03 22 F1 94 00 00 00 00
  $%  REQ007:782 03 22 F1 95 00 00 00 00       $%  ANS007:78A 03 22 F1 95 00 00 00 00
  $%  REQ008:782 03 22 F1 97 00 00 00 00       $%  ANS008:78A 03 22 F1 97 00 00 00 00
  $%  REQ009:782 03 22 F1 8A 00 00 00 00       $%  ANS009:78A 03 22 F1 8A 00 00 00 00

  $%  000:BootLoad日期:                  $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%02d%s%d%s],x1,@0038,x2,@0521);
  $%  001:BootLoad本周修改次数:          $%    $%  ANS000.BYTE006  $%  y=x1;
  $%  002:BootLoad版本:                  $%    $%  ANS000.BYTE007  $%  y=SPRINTF([%d.%d],x1/10,x1%10);
  $%  003:BootLoad发布日期:              $%    $%  ANS000.BYTE010  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  004:Boot遵循的烧写协议版本:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%c],x1,x2);
  $%  005:车辆名称:                      $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c.%c%c.%c%c%c%c],x1,x2,x3,x4,x5,x6,x7);
  $%  006:客户零部件编号:                $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c.%c.%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c],x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22);
  $%  007:硬件零件编号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%c%c%c%c%c%c%c%c%c],x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  008:硬件版本:                      $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  009:硬件日期:                      $%    $%  ANS005.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  010:软件编号:                      $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  011:软件版本:                      $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  012:软件日期:                      $%    $%  ANS007.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  013:修改次数:                      $%    $%  ANS007.BYTE009  $%  y=x1;
  $%  014:系统名称:                      $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c.%c.%c],x1,x2,x3);
  $%  015:车辆名称:                      $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c.%c%c.%c%c%c%c],x1,x2,x3,x4,x5,x6,x7);
  $%  016:系统供应商名称:                $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c.%c%c.],x1,x2,x3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:782 03 22 20 01 00 00 00 00       $  ANS000:78A 03 22 20 01 00 00 00 00
  $  REQ001:782 03 22 20 02 00 00 00 00       $  ANS001:78A 03 22 20 02 00 00 00 00
  $  REQ002:782 03 22 20 03 00 00 00 00       $  ANS002:78A 03 22 20 03 00 00 00 00
  $  REQ003:782 03 22 20 04 00 00 00 00       $  ANS003:78A 03 22 20 04 00 00 00 00
  $  REQ004:782 03 22 20 05 00 00 00 00       $  ANS004:78A 03 22 20 05 00 00 00 00
  $  REQ005:782 03 22 FD 00 00 00 00 00       $  ANS005:78A 03 22 FD 00 00 00 00 00
  $  REQ006:782 03 22 FD 03 00 00 00 00       $  ANS006:78A 03 22 FD 03 00 00 00 00
  $  REQ007:782 03 22 FE 00 00 00 00 00       $  ANS007:78A 03 22 FE 00 00 00 00 00

  $  000.左前轮速                     $    $  km/h      $    $  ANS000.BYTE004  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  001.右前轮速                     $    $  km/h      $    $  ANS000.BYTE006  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  002.左后轮速                     $    $  km/h      $    $  ANS000.BYTE008  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  003.右后轮速                     $    $  km/h      $    $  ANS000.BYTE010  $  y=SPRINTF([%d],(x1*256+x2)*0.06875);
  $  004.螺线管供电电压               $    $  V         $    $  ANS001.BYTE004  $  y=SPRINTF([%.1f],x1*0.08);
  $  005.电机供电电压                 $    $  V         $    $  ANS001.BYTE005  $  y=SPRINTF([%.1f],x1*0.08);
  $  006.点火循环次数                 $    $            $    $  ANS001.BYTE006  $  y=(x1*256+x2);
  $  007.制动深度传感器1电压          $    $  V         $    $  ANS001.BYTE008  $  y=SPRINTF([%.2f],x1*0.08);
  $  008.制动深度传感器2电压          $    $  V         $    $  ANS001.BYTE009  $  y=SPRINTF([%.2f],x1*0.08);
  $  009.制动深度                     $    $  %         $    $  ANS001.BYTE010  $  y=x1;
  $  010.蓄能器液压传感器电压         $    $  V         $    $  ANS001.BYTE011  $  y=SPRINTF([%.2f],x1*0.08);
  $  011.主轮缸液压传感器电压值       $    $  V         $    $  ANS001.BYTE012  $  y=SPRINTF([%.2f],x1*0.08);
  $  012.调节器液压传感器电压值       $    $  V         $    $  ANS001.BYTE013  $  y=SPRINTF([%.2f],x1*0.08);
  $  013.制动踏板状态                 $    $            $    $  ANS002.BYTE004  $  if(x1&0x01) y=@0003;else y=@0004;
  $  014.门灯状态                     $    $            $    $  ANS002.BYTE004  $  if(x1&0x02) y=@0001;else y=@0000;
  $  015.BSC开关状态                  $    $            $    $  ANS002.BYTE004  $  if(x1&0x04) y=@0001;else y=@0000;
  $  016.AVH开关状态                  $    $            $    $  ANS002.BYTE004  $  if(x1&0x08) y=@0001;else y=@0000;
  $  017.HDC开关状态                  $    $            $    $  ANS002.BYTE004  $  if(x1&0x200) y=@0001;else y=@0000;
  $  018.阈MOS状态                    $    $            $    $  ANS002.BYTE004  $  if(x1&0x20) y=@0001;else y=@0000;
  $  019.驱动电机MOS状态              $    $            $    $  ANS002.BYTE004  $  if(x1&0x40) y=@0001;else y=@0000;
  $  020.左前保压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x01) y=@000e;else y=@000f;
  $  021.左前泄压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x02) y=@000f;else y=@000e;
  $  022.右前保压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x04) y=@000e;else y=@000f;
  $  023.右前泄压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x08) y=@000f;else y=@000e;
  $  024.左后保压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x10) y=@000e;else y=@000f;
  $  025.左后泄压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x20) y=@000f;else y=@000e;
  $  026.右后保压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x40) y=@000e;else y=@000f;
  $  027.右后泄压阀                   $    $            $    $  ANS002.BYTE005  $  if(x1&0x80) y=@000f;else y=@000e;
  $  028.SSV                          $    $            $    $  ANS002.BYTE006  $  if(x1&0x01) y=@000e;else y=@000f;
  $  029.SMV                          $    $            $    $  ANS002.BYTE006  $  if(x1&0x02) y=@000f;else y=@000e;
  $  030.SLI                          $    $            $    $  ANS002.BYTE006  $  if(x1&0x04) y=@000e;else y=@000f;
  $  031.SLD                          $    $            $    $  ANS002.BYTE006  $  if(x1&0x08) y=@000e;else y=@000f;
  $  032.SRV                          $    $            $    $  ANS002.BYTE006  $  if(x1&0x10) y=@000f;else y=@000e;
  $  033.SCV                          $    $            $    $  ANS002.BYTE006  $  if(x1&0x20) y=@000e;else y=@000f;
  $  034.泵电机继电器状态             $    $            $    $  ANS002.BYTE006  $  if(x1&0x40) y=@0001;else y=@0000;
  $  035.加注状态                     $    $            $    $  ANS003.BYTE004  $  switxh(x1)0x00: y=@0014;0xAA: y=@04ff;0xEE: y=@0500;default: y=@0013;
  $  036.下线检测状态                 $    $            $    $  ANS004.BYTE004  $  switxh(x1)0x00: y=@0010;0xAA: y=@0501;0xEE: y=@0502;default: y=@0013;
  $  037.车速                         $    $  km/h      $    $  ANS005.BYTE004  $  y=SPRINTF([%.2f],(x1*256+x2)*0.06875);
  $  038.主轮缸压力值                 $    $  bar       $    $  ANS006.BYTE004  $  if(x1<0x80) y=SPRINTF([%.1f],(x1*256+x2)*0.0153);else y=SPRINTF([%.1f],((x1-256)*256+x2)*0.0153);
  $  039.蓄能器压力值                 $    $  bar       $    $  ANS006.BYTE006  $  if(x1<0x80) y=SPRINTF([%.1f],(x1*256+x2)*0.0153);else y=SPRINTF([%.1f],((x1-256)*256+x2)*0.0153);
  $  040.调节器压力值                 $    $  bar       $    $  ANS006.BYTE008  $  if(x1<0x80) y=SPRINTF([%.1f],(x1*256+x2)*0.0153);else y=SPRINTF([%.1f],((x1-256)*256+x2)*0.0153);
  $  041.转角传感器                   $    $  °        $    $  ANS006.BYTE010  $  if(x1<0x80) y=SPRINTF([%.1f],(x1*256+x2)*0.1);else y=SPRINTF([%.1f],((x1-256)*256+x2)*0.1);
  $  042.偏航率传感器                 $    $  rad/s     $    $  ANS006.BYTE012  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.00213);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.00213);
  $  043.偏航率传感器零点值           $    $  rad/s     $    $  ANS006.BYTE014  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.00213);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.00213);
  $  044.横向加速度传感器             $    $  m/s^2     $    $  ANS006.BYTE016  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.02712);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.02712);
  $  045.横向加速度传感器零点值       $    $  m/s^2     $    $  ANS006.BYTE018  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.02712);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.02712);
  $  046.纵向加速度传感器             $    $  m/s^2     $    $  ANS006.BYTE020  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.02712);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.02712);
  $  047.纵向加速度传感器零点值       $    $  m/s^2     $    $  ANS006.BYTE022  $  if(x1<0x80) y=SPRINTF([%.3f],(x1*256+x2)*0.02712);else y=SPRINTF([%.3f],((x1-256)*256+x2)*0.02712);
  $  048.SLI占空比                    $    $  %         $    $  ANS007.BYTE004  $  y=x1;
  $  049.SLD占空比                    $    $  %         $    $  ANS007.BYTE005  $  y=x1;
  $  050.SSV电流值                    $    $  mA        $    $  ANS007.BYTE006  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);
  $  051.SMV电流值                    $    $  mA        $    $  ANS007.BYTE008  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);
  $  052.SLI电流值                    $    $  mA        $    $  ANS007.BYTE010  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);
  $  053.SLD电流值                    $    $  mA        $    $  ANS007.BYTE012  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);
  $  054.SRV电流值                    $    $  mA        $    $  ANS007.BYTE014  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);
  $  055.SCV电流值                    $    $  mA        $    $  ANS007.BYTE016  $  y=SPRINTF([%.1f],(x1*256+x2)*0.1);

;******************************************************************************************************************************************************

动作测试:

$^ 00.控制阈开关测试-SMV测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 01 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-SMV测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 01.控制阈开关测试-SRV测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 02 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-SRV测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 02.控制阈开关测试-SLI测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 03 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-SLI测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 03.控制阈开关测试-SCV测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 04 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-SCV测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 04.控制阈开关测试-SLD测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 05 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-SLD测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 05.控制阈开关测试-HFL测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 06 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-HFL测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 06.控制阈开关测试-HFR测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 07 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-HFR测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 07.控制阈开关测试-DFL测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 08 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-DFL测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 08.控制阈开关测试-DFR测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 09 XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-DFR测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 09.控制阈开关测试-HRL测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 0A XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-HRL测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 10.控制阈开关测试-HRR测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 0B XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-HRR测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 11.控制阈开关测试-DRL测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 0C XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-DRL测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 12.控制阈开关测试-DRR测试开启时间 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 07 2F 10 01 03 0D XX XX     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 01 00 00 00 00     $^

$^DSP:控制阈开关测试-DRR测试开启时间->s
$^TIP:请输入测试值(范围:0~50) 
$^IN_F:y=x*1000;
$^RANGE:0,50
;----------------------------------------------------------------------------------------------------

$^ 13.使用占空比控制阈体维持一定的开度-STL测试占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 06 2F 10 02 03 03 XX 00     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 02 00 00 00 00     $^

$^DSP:使用占空比控制阈体维持一定的开度-STL测试占空比->%
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 14.使用占空比控制阈体维持一定的开度-SLD测试占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 06 2F 10 02 03 05 XX 00     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 02 00 00 00 00     $^

$^DSP:使用占空比控制阈体维持一定的开度-SLD测试占空比->%
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 15.使用占空比控制阈体维持一定的开度-HFL测试占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 06 2F 10 02 03 06 XX 00     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 02 00 00 00 00     $^

$^DSP:使用占空比控制阈体维持一定的开度-HFL测试占空比->%
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 16.使用占空比控制阈体维持一定的开度-HFR测试占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 06 2F 10 02 03 07 XX 00     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 02 00 00 00 00     $^

$^DSP:使用占空比控制阈体维持一定的开度-HFR测试占空比->%
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 17.使用占空比控制阈体维持一定的开度-HRL测试占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 06 2F 10 02 03 0A XX 00     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 02 00 00 00 00     $^

$^DSP:使用占空比控制阈体维持一定的开度-HRL测试占空比->%
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 18.使用占空比控制阈体维持一定的开度-HRR测试占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:782 06 2F 10 02 03 0B XX 00     $^

$^BUTTON:退出
$^REQ00:782 04 2F 10 02 00 00 00 00     $^

$^DSP:使用占空比控制阈体维持一定的开度-HRL测试占空比->%
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 19.电机开关测试 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:782 05 2F 10 03 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:782 05 2F 10 03 03 FF 00 00     $^

$^BUTTON:退出 
$^REQ00:782 04 2F 10 03 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:782 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
