
    车型ID：3316

    模拟：协议模拟-->3316

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~728

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:728 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 80 00 00 00 00 00       $!  ANS000:728 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:728 03 19 02 09 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/41000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:728 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 93 00 00 00 00       $%  ANS000:728 03 22 F1 93 00 00 00 00
  $%  REQ001:720 03 22 F1 94 00 00 00 00       $%  ANS001:728 03 22 F1 94 00 00 00 00
  $%  REQ002:720 03 22 F1 95 00 00 00 00       $%  ANS002:728 03 22 F1 95 00 00 00 00

  $%  000:硬件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],(x1%1000-x1%100)/100,(x1%100-x1%10)/10,x1%10);
  $%  001:硬件日期:        $%    $%  ANS000.BYTE005  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  002:软件编号:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%02X%02X%02X%02X%02X%02X%02X%02X%02X],x1,x2,x3,x4,x5,x6,x7,x8,x9);
  $%  003:软件版本:        $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%d.%d%d.%d%d],((x1*256+x2)%100000-(x1*256+x2)%10000)/10000,((x1*256+x2)%10000-(x1*256+x2)%1000)/1000,((x1*256+x2)%1000-(x1*256+x2)%100)/100,((x1*256+x2)%100-(x1*256+x2)%10)/10,(x1*256+x2)%10);
  $%  004:软件日期:        $%    $%  ANS002.BYTE006  $%  y=SPRINTF([%02d%s%02d%s%02d%s],x1,@0038,x2,@0039,x3,@003a);
  $%  005:修改次数:        $%    $%  ANS002.BYTE009  $%  y=x1;

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:720 03 22 00 02 00 00 00 00       $  ANS000:728 03 22 00 02 00 00 00 00
  $  REQ001:720 03 22 00 0A 00 00 00 00       $  ANS001:728 03 22 00 0A 00 00 00 00
  $  REQ002:720 03 22 00 0D 00 00 00 00       $  ANS002:728 03 22 00 0D 00 00 00 00
  $  REQ003:720 03 22 80 10 00 00 00 00       $  ANS003:728 03 22 80 10 00 00 00 00
  $  REQ004:720 03 22 30 00 00 00 00 00       $  ANS004:728 03 22 30 00 00 00 00 00
  $  REQ005:720 03 22 30 01 00 00 00 00       $  ANS005:728 03 22 30 01 00 00 00 00
  $  REQ006:720 03 22 30 02 00 00 00 00       $  ANS006:728 03 22 30 02 00 00 00 00
  $  REQ007:720 03 22 30 03 00 00 00 00       $  ANS007:728 03 22 30 03 00 00 00 00
  $  REQ008:720 03 22 30 04 00 00 00 00       $  ANS008:728 03 22 30 04 00 00 00 00
  $  REQ009:720 03 22 30 05 00 00 00 00       $  ANS009:728 03 22 30 05 00 00 00 00
  $  REQ010:720 03 22 30 06 00 00 00 00       $  ANS010:728 03 22 30 06 00 00 00 00
  $  REQ011:720 03 22 30 07 00 00 00 00       $  ANS011:728 03 22 30 07 00 00 00 00
  $  REQ012:720 03 22 30 08 00 00 00 00       $  ANS012:728 03 22 30 08 00 00 00 00
  $  REQ013:720 03 22 90 00 00 00 00 00       $  ANS013:728 03 22 90 00 00 00 00 00
  $  REQ014:720 03 22 40 00 00 00 00 00       $  ANS014:728 03 22 40 00 00 00 00 00
  $  REQ015:720 03 22 40 01 00 00 00 00       $  ANS015:728 03 22 40 01 00 00 00 00
  $  REQ016:720 03 22 40 02 00 00 00 00       $  ANS016:728 03 22 40 02 00 00 00 00
  $  REQ017:720 03 22 40 03 00 00 00 00       $  ANS017:728 03 22 40 03 00 00 00 00
  $  REQ018:720 03 22 40 04 00 00 00 00       $  ANS018:728 03 22 40 04 00 00 00 00
  $  REQ019:720 03 22 50 00 00 00 00 00       $  ANS019:728 03 22 50 00 00 00 00 00
  $  REQ020:720 03 22 8A 06 00 00 00 00       $  ANS020:728 03 22 8A 06 00 00 00 00
  $  REQ021:720 03 22 8A 07 00 00 00 00       $  ANS021:728 03 22 8A 07 00 00 00 00
  $  REQ022:720 03 22 20 05 00 00 00 00       $  ANS022:728 03 22 20 05 00 00 00 00
  $  REQ023:720 03 22 20 06 00 00 00 00       $  ANS023:728 03 22 20 06 00 00 00 00
  $  REQ024:720 03 22 20 07 00 00 00 00       $  ANS024:728 03 22 20 07 00 00 00 00
  $  REQ025:720 03 22 20 08 00 00 00 00       $  ANS025:728 03 22 20 08 00 00 00 00

  $  000.序列号                                    $    $          $    $  ANS000.BYTE004  $  y=SPRINTF([%02X %02X %02X %02X %02X %02X],x1,x2,x3,x4,x5,x6);
  $  001.已匹配钥匙数                              $    $          $    $  ANS001.BYTE004  $  switxh(x1)0x00: y=@00a7;0x01: y=@00a8;0x02: y=@00a9;0x03: y=@00aa;0x04: y=@00ab;default: y=@0002;
  $  002.内部供电状况                              $    $          $    $  ANS002.BYTE004  $  switxh(x1)0x00: y=@00ae;0xFF: y=@00af;default: y=@0002;
  $  003.钥匙状态                                  $    $          $    $  ANS002.BYTE007  $  switxh(x1)0x02: y=@00b0;0x03: y=@00b1;0x04: y=@00b2;0x06: y=@00b3;default: y=@0002;
  $  004.钥匙ID                                    $    $          $    $  ANS002.BYTE008  $  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $  005.钥匙序号                                  $    $          $    $  ANS002.BYTE012  $  HEX(x1);
  $  006.左前门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x01) y=@0001;else y=@0000;
  $  007.右前门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x02) y=@0001;else y=@0000;
  $  008.左后门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x04) y=@0001;else y=@0000;
  $  009.右后门灯开关                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x08) y=@0001;else y=@0000;
  $  010.后背门开关                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x10) y=@0001;else y=@0000;
  $  011.前舱盖状态                                $    $          $    $  ANS003.BYTE004  $  if(x1&0x20) y=@0001;else y=@0000;
  $  012.左前门锁状态                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x40) y=@0067;else y=@0068;
  $  013.左后门锁状态                              $    $          $    $  ANS003.BYTE004  $  if(x1&0x80) y=@0067;else y=@0068;
  $  014.右前门锁状态                              $    $          $    $  ANS003.BYTE005  $  if(x1&0x01) y=@0067;else y=@0068;
  $  015.右后门锁状态                              $    $          $    $  ANS003.BYTE005  $  if(x1&0x02) y=@0067;else y=@0068;
  $  016.行李箱解锁开关状态                        $    $          $    $  ANS003.BYTE005  $  if(x1&0x04) y=@0067;else y=@0068;
  $  017.硬线中控锁闭锁开关状态                    $    $          $    $  ANS003.BYTE005  $  if(x1&0x08) y=@007b;else y=@003f;
  $  018.硬线中控锁解锁开关状态                    $    $          $    $  ANS003.BYTE005  $  if(x1&0x10) y=@007b;else y=@003f;
  $  019.碰撞信号状态(OPWM)                        $    $          $    $  ANS003.BYTE005  $  switxh(x1&0x60)0x00: y=@008b;0x20: y=@008c;0x40: y=@008d;0x60: y=@010e;default: y=@0002;
  $  020.门锁保护状态                              $    $          $    $  ANS003.BYTE006  $  switxh(x1&0x03)0x00: y=@0045;0x01: y=@008e;0x02: y=@008f;0x03: y=@0090;default: y=@0002;
  $  021.12V制动信号状态                           $    $          $    $  ANS003.BYTE006  $  if(x1&0x04) y=@0093;else y=@003f;
  $  022.0V制动灯开关状态                          $    $          $    $  ANS003.BYTE006  $  if(x1&0x08) y=@0093;else y=@003f;
  $  023.启动信号1状态                             $    $          $    $  ANS003.BYTE006  $  if(x1&0x10) y=@007b;else y=@0094;
  $  024.启动信号2状态                             $    $          $    $  ANS003.BYTE006  $  if(x1&0x20) y=@007b;else y=@0094;
  $  025.ACC电状态                                 $    $          $    $  ANS003.BYTE006  $  if(x1&0x40) y=@014d;else y=@014f;
  $  026.IG1电状态                                 $    $          $    $  ANS003.BYTE006  $  if(x1&0x80) y=@014d;else y=@014f;
  $  027.IG2电状态                                 $    $          $    $  ANS003.BYTE007  $  if(x1&0x01) y=@014d;else y=@014f;
  $  028.IG3电状态                                 $    $          $    $  ANS003.BYTE007  $  if(x1&0x02) y=@014d;else y=@014f;
  $  029.IG4电状态                                 $    $          $    $  ANS003.BYTE007  $  if(x1&0x04) y=@014d;else y=@014f;
  $  030.自复位告警开关状态                        $    $          $    $  ANS003.BYTE007  $  if(x1&0x08) y=@007b;else y=@003f;
  $  031.小灯开关状态                              $    $          $    $  ANS003.BYTE007  $  if(x1&0x10) y=@0093;else y=@003f;
  $  032.近光灯开关状态                            $    $          $    $  ANS003.BYTE007  $  if(x1&0x20) y=@0093;else y=@003f;
  $  033.远光灯开关状态                            $    $          $    $  ANS003.BYTE007  $  if(x1&0x40) y=@0093;else y=@003f;
  $  034.超车灯开关状态                            $    $          $    $  ANS003.BYTE007  $  if(x1&0x80) y=@0093;else y=@003f;
  $  035.后雾灯开关状态                            $    $          $    $  ANS003.BYTE008  $  if(x1&0x01) y=@0093;else y=@003f;
  $  036.左转向灯开关状态                          $    $          $    $  ANS003.BYTE008  $  if(x1&0x02) y=@0093;else y=@003f;
  $  037.右转向灯开关状态                          $    $          $    $  ANS003.BYTE008  $  if(x1&0x04) y=@0093;else y=@003f;
  $  038.AUTO灯光开关状态                          $    $          $    $  ANS003.BYTE008  $  if(x1&0x08) y=@0093;else y=@003f;
  $  039.充电口盖开关状态                          $    $          $    $  ANS003.BYTE008  $  if(x1&0x10) y=@0001;else y=@0000;
  $  040.主驾安全带未系信号检测                    $    $          $    $  ANS003.BYTE008  $  if(x1&0x20) y=@0431;else y=@0432;
  $  041.副驾安全带未系信号检测                    $    $          $    $  ANS003.BYTE008  $  if(x1&0x40) y=@0431;else y=@0432;
  $  042.副驾座椅传感器信号采集                    $    $          $    $  ANS003.BYTE008  $  if(x1&0x80) y=@05c1;else y=@05c2;
  $  043.喇叭开关状态                              $    $          $    $  ANS003.BYTE009  $  if(x1&0x01) y=@007b;else y=@003f;
  $  044.交流充电枪电锁状态                        $    $          $    $  ANS003.BYTE009  $  if(x1&0x02) y=@043c;else y=@043d;
  $  045.前雨刮HI档状态                            $    $          $    $  ANS003.BYTE009  $  if(x1&0x04) y=@0093;else y=@003f;
  $  046.前雨刮复位状态                            $    $          $    $  ANS003.BYTE009  $  if(x1&0x08) y=@0093;else y=@003f;
  $  047.后雨刮复位状态                            $    $          $    $  ANS003.BYTE009  $  if(x1&0x10) y=@0093;else y=@003f;
  $  048.转向轴锁配置情况                          $    $          $    $  ANS003.BYTE009  $  if(x1&0x20) y=@01ae;else y=@01af;
  $  049.左前轮ID                                  $    $          $    $  ANS004.BYTE004  $  HEX(x1,x2,x3,x4);
  $  050.左前轮信号状态                            $    $          $    $  ANS004.BYTE008  $  switxh(x1)0x00: y=@0045;0x01: y=@01d9;0x02: y=@0487;0xFF: y=@03bc;default: y=@0002;
  $  051.左前轮漏气状态                            $    $          $    $  ANS004.BYTE009  $  switxh(x1&0x03)0x00: y=@0045;0x01: y=@02c9;0x02: y=@02ca;0x03: y=@0487;default: y=@0002;
  $  052.左前轮压力状态                            $    $          $    $  ANS004.BYTE009  $  switxh(x1&0x0C)0x00: y=@0045;0x04: y=@02cb;0x08: y=@02cc;0x0C: y=@0487;default: y=@0002;
  $  053.左前轮温度状态                            $    $          $    $  ANS004.BYTE009  $  switxh(x1&0x30)0x00: y=@0045;0x10: y=@0508;0x20: y=@0509;0x30: y=@0487;default: y=@0002;
  $  054.左前轮电池电压状态                        $    $          $    $  ANS004.BYTE009  $  switxh(x1&0xC0)0x00: y=@0045;0x40: y=@052b;0x80: y=@0487;default: y=@0002;
  $  055.左前轮压力值                              $    $  kPa     $    $  ANS004.BYTE010  $  y=(x2*256+x1);
  $  056.左前轮温度值                              $    $  ℃      $    $  ANS004.BYTE012  $  y=SPRINTF([%d],(x2*256+x1)*0.1-40);
  $  057.左前轮电池电压值                          $    $          $    $  ANS004.BYTE014  $  y=x1;
  $  058.右前轮ID                                  $    $          $    $  ANS005.BYTE004  $  HEX(x1,x2,x3,x4);
  $  059.右前轮信号状态                            $    $          $    $  ANS005.BYTE008  $  switxh(x1)0x00: y=@0045;0x01: y=@01d9;0x02: y=@0487;0xFF: y=@03bc;default: y=@0002;
  $  060.右前轮漏气状态                            $    $          $    $  ANS005.BYTE009  $  switxh(x1&0x03)0x00: y=@0045;0x01: y=@02c9;0x02: y=@02ca;0x03: y=@0487;default: y=@0002;
  $  061.右前轮压力状态                            $    $          $    $  ANS005.BYTE009  $  switxh(x1&0x0C)0x00: y=@0045;0x04: y=@02cb;0x08: y=@02cc;0x0C: y=@0487;default: y=@0002;
  $  062.右前轮温度状态                            $    $          $    $  ANS005.BYTE009  $  switxh(x1&0x30)0x00: y=@0045;0x10: y=@0508;0x20: y=@0509;0x30: y=@0487;default: y=@0002;
  $  063.右前轮电池电压状态                        $    $          $    $  ANS005.BYTE009  $  switxh(x1&0xC0)0x00: y=@0045;0x40: y=@052b;0x80: y=@0487;default: y=@0002;
  $  064.右前轮压力值                              $    $  kPa     $    $  ANS005.BYTE010  $  y=(x2*256+x1);
  $  065.右前轮温度值                              $    $  ℃      $    $  ANS005.BYTE012  $  y=SPRINTF([%d],(x2*256+x1)*0.1-40);
  $  066.右前轮电池电压值                          $    $          $    $  ANS005.BYTE014  $  y=x1;
  $  067.左后轮ID                                  $    $          $    $  ANS006.BYTE004  $  HEX(x1,x2,x3,x4);
  $  068.左后轮信号状态                            $    $          $    $  ANS006.BYTE008  $  switxh(x1)0x00: y=@0045;0x01: y=@01d9;0x02: y=@0487;0xFF: y=@03bc;default: y=@0002;
  $  069.左后轮漏气状态                            $    $          $    $  ANS006.BYTE009  $  switxh(x1&0x03)0x00: y=@0045;0x01: y=@02c9;0x02: y=@02ca;0x03: y=@0487;default: y=@0002;
  $  070.左后轮压力状态                            $    $          $    $  ANS006.BYTE009  $  switxh(x1&0x0C)0x00: y=@0045;0x04: y=@02cb;0x08: y=@02cc;0x0C: y=@0487;default: y=@0002;
  $  071.左后轮温度状态                            $    $          $    $  ANS006.BYTE009  $  switxh(x1&0x30)0x00: y=@0045;0x10: y=@0508;0x20: y=@0509;0x30: y=@0487;default: y=@0002;
  $  072.左后轮电池电压状态                        $    $          $    $  ANS006.BYTE009  $  switxh(x1&0xC0)0x00: y=@0045;0x40: y=@052b;0x80: y=@0487;default: y=@0002;
  $  073.左后轮压力值                              $    $  kPa     $    $  ANS006.BYTE010  $  y=(x2*256+x1);
  $  074.左后轮温度值                              $    $  ℃      $    $  ANS006.BYTE012  $  y=SPRINTF([%d],(x2*256+x1)*0.1-40);
  $  075.左后轮电池电压值                          $    $          $    $  ANS006.BYTE014  $  y=x1;
  $  076.右后轮ID                                  $    $          $    $  ANS007.BYTE004  $  HEX(x1,x2,x3,x4);
  $  077.右后轮信号状态                            $    $          $    $  ANS007.BYTE008  $  switxh(x1)0x00: y=@0045;0x01: y=@01d9;0x02: y=@0487;0xFF: y=@03bc;default: y=@0002;
  $  078.右后轮漏气状态                            $    $          $    $  ANS007.BYTE009  $  switxh(x1&0x03)0x00: y=@0045;0x01: y=@02c9;0x02: y=@02ca;0x03: y=@0487;default: y=@0002;
  $  079.右后轮压力状态                            $    $          $    $  ANS007.BYTE009  $  switxh(x1&0x0C)0x00: y=@0045;0x04: y=@02cb;0x08: y=@02cc;0x0C: y=@0487;default: y=@0002;
  $  080.右后轮温度状态                            $    $          $    $  ANS007.BYTE009  $  switxh(x1&0x30)0x00: y=@0045;0x10: y=@0508;0x20: y=@0509;0x30: y=@0487;default: y=@0002;
  $  081.右后轮电池电压状态                        $    $          $    $  ANS007.BYTE009  $  switxh(x1&0xC0)0x00: y=@0045;0x40: y=@052b;0x80: y=@0487;default: y=@0002;
  $  082.右后轮压力值                              $    $  kPa     $    $  ANS007.BYTE010  $  y=(x2*256+x1);
  $  083.右后轮温度值                              $    $  ℃      $    $  ANS007.BYTE012  $  y=SPRINTF([%d],(x2*256+x1)*0.1-40);
  $  084.右后轮电池电压值                          $    $          $    $  ANS007.BYTE014  $  y=x1;
  $  085.前轴标准压力                              $    $  kpa     $    $  ANS008.BYTE004  $  y=(x2*256+x1);
  $  086.后轴标准压力                              $    $  kpa     $    $  ANS009.BYTE004  $  y=(x2*256+x1);
  $  087.国标/欧标                                 $    $          $    $  ANS010.BYTE004  $  switxh(x1)0x00: y=@02d4;0x01: y=@02d7;default: y=@0002;
  $  088.自定位功能                                $    $          $    $  ANS011.BYTE004  $  switxh(x1)0x00: y=@0506;0x01: y=@0507;default: y=@0002;
  $  089.自定位全局状态                            $    $          $    $  ANS012.BYTE004  $  switxh(x1)0x00: y=@0488;0x01: y=@0489;0x02: y=@048a;0x03: y=@048b;0x04: y=@048c;0x05: y=@048d;0x06: y=@048e;0x07: y=@048f;default: y=@0002;
  $  090.左前轮自定位学习状态                      $    $          $    $  ANS012.BYTE005  $  switxh(x1)0x00: y=@0435;0x01: y=@0436;0x02: y=@0437;default: y=@0002;
  $  091.右前轮自定位学习状态                      $    $          $    $  ANS012.BYTE006  $  switxh(x1)0x00: y=@0435;0x01: y=@0436;0x02: y=@0437;default: y=@0002;
  $  092.左后轮自定位学习状态                      $    $          $    $  ANS012.BYTE006  $  switxh(x1)0x00: y=@0435;0x01: y=@0436;0x02: y=@0437;default: y=@0002;
  $  093.右后轮自定位学习状态                      $    $          $    $  ANS012.BYTE007  $  switxh(x1)0x00: y=@0435;0x01: y=@0436;0x02: y=@0437;default: y=@0002;
  $  094.驻车辅助系统配置类型                      $    $          $    $  ANS013.BYTE004  $  switxh(x1)0x00: y=@0103;0x01: y=@0104;0x02: y=@0105;0x03: y=@0433;0x04: y=@0434;default: y=@0002;
  $  095.读取风速                                  $    $  级      $    $  ANS014.BYTE004  $  y=x1&0x0F;
  $  096.读取模式                                  $    $          $    $  ANS014.BYTE004  $  switxh(x1&0xF0)0x00: y=@002e;0x10: y=@002f;0x20: y=@0030;0x30: y=@0031;0x40: y=@0032;0x50: y=@0033;default: y=@0002;
  $  097.读取模式电机位置百分比                    $    $          $    $  ANS014.BYTE005  $  y=x1;
  $  098.车外温度                                  $    $  ℃      $    $  ANS014.BYTE006  $  if((x1>=88)&&(x1<=178)) y=x1-128;else if(x1==208) y=@0035;else if(x1==216) y=@0035;else y=@0002;
  $  099.车内温度                                  $    $  ℃      $    $  ANS014.BYTE007  $  if((x1>=88)&&(x1<=207)) y=x1-128;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else y=@0002;
  $  100.压力状态                                  $    $          $    $  ANS014.BYTE008  $  switxh(x1&0x03)0x00: y=@003f;0x01: y=@0158;0x02: y=@0438;0x03: y=@0439;default: y=@0002;
  $  101.空调风扇需求档位                          $    $          $    $  ANS014.BYTE008  $  switxh(x1&0x1C)0x00: y=@003f;0x04: y=@0000;0x08: y=@043a;0x0C: y=@043b;0x10: y=@0439;default: y=@0002;
  $  102.冷暖电机位置百分比                        $    $          $    $  ANS014.BYTE009  $  y=x1;
  $  103.新风循环电机位置百分比                    $    $          $    $  ANS014.BYTE010  $  y=x1;
  $  104.目标蒸发器温度                            $    $  ℃      $    $  ANS014.BYTE011  $  if((x1>=(0-20))&&(x1<=40)) y=x1;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else if(x1==255) y=@0439;else y=@0002;
  $  105.实际蒸发器温度                            $    $  ℃      $    $  ANS015.BYTE004  $  if((x1>=(0-20))&&(x1<=40)) y=x1;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else if(x1==255) y=@0439;else y=@0002;
  $  106.目标通道温度                              $    $  ℃      $    $  ANS015.BYTE005  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else if(x1==255) y=@0439;else y=@0002;
  $  107.实际主驾吹面通道温度                      $    $  ℃      $    $  ANS015.BYTE006  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else if(x1==255) y=@0439;else y=@0002;
  $  108.实际主驾吹脚通道温度                      $    $  ℃      $    $  ANS015.BYTE007  $  if((x1>=0)&&(x1<=140)) y=x1-40;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else if(x1==255) y=@0439;else y=@0002;
  $  109.工作电源电压                              $    $  V       $    $  ANS015.BYTE008  $  if((x1>=90)&&(x1<=159)) y=SPRINTF([%.1f],x1/10);else if(x1==160) y=@05b9;else if(x1==208) y=@05ba;else y=@0002;
  $  110.BMS(电池管理器)允许空调高压放电状态       $    $          $    $  ANS015.BYTE009  $  switxh(x1&0x03)0x00: y=@003f;0x01: y=@0498;0x02: y=@0499;default: y=@0002;
  $  111.空调高压模块状态                          $    $          $    $  ANS015.BYTE009  $  switxh(x1&0x1C)0x00: y=@01e1;0x04: y=@01e2;0x08: y=@0497;0x0C: y=@01e4;default: y=@0002;
  $  112.电动压缩机需求占空比                      $    $  %       $    $  ANS015.BYTE010  $  y=x1;
  $  113.蒸发器端电子膨胀阀位置                    $    $  %       $    $  ANS016.BYTE004  $  y=x1;
  $  114.蒸发器出口冷媒温度                        $    $  ℃      $    $  ANS016.BYTE005  $  if(((x2*256+x1)>=0)&&((x2*256+x1)<=800)) y=SPRINTF([%.1f],(x2*256+x1)/10);else if(((x2*256+x1)>=65136)&&((x2*256+x1)<=65535)) y=SPRINTF([%.1f%.1f],(x2*256+x1)/10,((x2*256+x1)-65536)/10);else if((x2*256+x1)==32764) y=@0034;else if((x2*256+x1)==32765) y=@0035;else y=@0002;
  $  115.蒸发器出口压力                            $    $          $    $  ANS016.BYTE007  $  y=SPRINTF([%.1f],(x2*256+x1)*0.01);
  $  116.蒸发器出口冷媒过热度                      $    $  ℃      $    $  ANS016.BYTE009  $  if(x2<0x80) y=SPRINTF([%d],(x2*256+x1)*0.1);else y=SPRINTF([%d],((x2-256)*256+x1)*0.1);
  $  117.电池热管理需求                            $    $          $    $  ANS017.BYTE004  $  if(x1==0) y=@0283;else if(x1==1) y=@0490;else if(x1==2) y=@0491;else if(x1==3) y=@049a;else if(x1==4) y=@049b;else if(x1==5) y=@049c;else if(x1==6) y=@0492;else if(x1==7) y=@01e0;else y=@0002;
  $  118.电池热管理实际响应状态                    $    $          $    $  ANS017.BYTE004  $  if(x1==0) y=@0000;else if(x1==1) y=@0490;else if(x1==2) y=@0491;else if(x1==3) y=@01df;else if(x1==4) y=@010e;else if(x1==5) y=@010e;else if(x1==6) y=@0492;else if(x1==7) y=@01e0;else y=@0002;
  $  119.板换端电子膨胀阀位置                      $    $  %       $    $  ANS017.BYTE005  $  y=x1;
  $  120.板换出口侧冷却液温度信息                  $    $  ℃      $    $  ANS017.BYTE006  $  if((x1>=0)&&(x1<=90)) y=x1-20;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else y=@0002;
  $  121.空调发送的电池热管理电动水泵占空比        $    $  %       $    $  ANS017.BYTE007  $  y=x1;
  $  122.电池热管理电动水泵反馈转速                $    $  rpm     $    $  ANS017.BYTE008  $  y=SPRINTF([%d],x1*100);
  $  123.采暖目标PTC水温                           $    $  ℃      $    $  ANS018.BYTE004  $  if((x1>=0)&&(x1<=160)) y=x1-40;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else y=@0002;
  $  124.当前实际PTC水温                           $    $  ℃      $    $  ANS018.BYTE005  $  if((x1>=0)&&(x1<=170)) y=x1-50;else if(x1==208) y=@0034;else if(x1==216) y=@0035;else y=@0002;
  $  125.PTC水加热器目标占空比                     $    $  %       $    $  ANS018.BYTE006  $  y=x1;
  $  126.空调采暖电动水泵继电器控制                $    $          $    $  ANS018.BYTE007  $  switxh(x1&0x03)0x00: y=@003f;0x01: y=@0048;0x02: y=@0047;default: y=@0002;
  $  127.电池加热四通阀位置                        $    $          $    $  ANS018.BYTE007  $  if(x1==0) y=@0494;else if(x1==1) y=@0495;else if(x1==2) y=@0496;else if(x1==3) y=@010e;else y=@0002;
  $  128.AVAS(引擎音模拟器)工作状态                $    $          $    $  ANS019.BYTE004  $  if(x1==0) y=@0045;else if(x1==1) y=@0046;else y=@0002;
  $  129.AVAS(引擎音模拟器)开关状态                $    $          $    $  ANS019.BYTE004  $  if(x1==0) y=@002d;else if(x1==1) y=@0000;else y=@0002;
  $  130.音源类型                                  $    $          $    $  ANS019.BYTE004  $  if(x1==0) y=@05bd;else if(x1==1) y=@05be;else if(x1==2) y=@05bf;else if(x1==3) y=@05c0;else y=@0002;
  $  131.音源可调                                  $    $          $    $  ANS019.BYTE004  $  if(x1==0) y=@05bb;else if(x1==1) y=@05bc;else y=@0002;
  $  132.法规类型                                  $    $          $    $  ANS019.BYTE004  $  if(x1==0) y=@02d4;else if(x1==1) y=@02d5;else if(x1==2) y=@02d6;else if(x1==3) y=@02d7;else y=@0002;
  $  133.遥控升降窗命令/数据标识                   $    $          $    $  ANS020.BYTE004  $  if(x1==23) y=@04a7;else y=@04a8;
  $  134.遥控降窗                                  $    $          $    $  ANS020.BYTE005  $  if(x1==1) y=@041b;else if(x1==0) y=@003f;else y=@0002;
  $  135.遥控升窗                                  $    $          $    $  ANS020.BYTE005  $  if(x1==1) y=@041a;else if(x1==0) y=@003f;else y=@0002;
  $  136.发生事件点/月                             $    $          $    $  ANS020.BYTE006  $  y=SPRINTF([%02d%s],x1,@0039);
  $  137.发生事件点/日                             $    $          $    $  ANS020.BYTE007  $  y=SPRINTF([%02d%s],x1,@003a);
  $  138.发生事件点/时                             $    $          $    $  ANS020.BYTE008  $  y=SPRINTF([%02d%s],x1,@0418);
  $  139.发生事件点/分                             $    $          $    $  ANS020.BYTE009  $  y=SPRINTF([%02d%s],x1,@0419);
  $  140.数据索引                                  $    $          $    $  ANS020.BYTE010  $  y=x1;
  $  141.数据标识                                  $    $          $    $  ANS021.BYTE004  $  if(x1==34) y=@0430;else y=@0097;
  $  142.IG3继电器断开原因                         $    $          $    $  ANS021.BYTE005  $  if(x1==1) y=@041c;else if(x1==0) y=@003f;else if(x1==2) y=@041d;else if(x1==3) y=@041e;else if(x1==4) y=@041f;else if(x1==5) y=@0420;else if(x1==6) y=@0421;else if(x1==7) y=@0422;else if(x1==8) y=@0423;else if(x1==9) y=@0424;else if(x1==10) y=@0425;else if(x1==11) y=@0426;else if(x1==12) y=@0427;else if(x1==13) y=@0428;else if(x1==14) y=@0429;else if(x1==15) y=@042a;else if(x1==16) y=@042b;else if(x1==17) y=@042c;else if(x1==18) y=@042d;else if(x1==19) y=@042e;else if(x1==20) y=@042f;else y=@0002;
  $  143.IG3继电器断开时间点                       $    $          $    $  ANS021.BYTE006  $  y=SPRINTF([%02d%s%02d%s%02d%s%02d%s],x1,@0039,x2,@003a,x3,@0418,x4,@0419);
  $  144.数据索引                                  $    $          $    $  ANS021.BYTE010  $  y=x1;
  $  145.车型颜色                                  $    $          $    $  ANS022.BYTE004  $  if(x1==0) y=@003f;else if(x1==1) y=@01b0;else if(x1==2) y=@01b1;else if(x1==3) y=@01b2;else if(x1==4) y=@01b3;else if(x1==5) y=@01b4;else if(x1==6) y=@01b5;else if(x1==7) y=@01b6;else if(x1==8) y=@01b7;else if(x1==9) y=@01b8;else if(x1==10) y=@01b9;else if(x1==11) y=@01ba;else if(x1==12) y=@01bb;else if(x1==13) y=@01bc;else if(x1==14) y=@01bd;else if(x1==15) y=@01be;else if(x1==16) y=@01bf;else if(x1==17) y=@01c0;else if(x1==18) y=@01c1;else if(x1==19) y=@02b0;else if(x1==20) y=@01c3;else if(x1==21) y=@01c4;else y=@0002;
  $  146.车顶行李架                                $    $          $    $  ANS023.BYTE004  $  if(x1==0) y=@003f;else if(x1==1) y=@01ae;else if(x1==2) y=@01af;else if(x1==3) y=@010e;else y=@0002;
  $  147.外置天线                                  $    $          $    $  ANS024.BYTE004  $  if(x1==0) y=@003f;else if(x1==1) y=@01ae;else if(x1==2) y=@01af;else if(x1==3) y=@010e;else y=@0002;
  $  148.天窗                                      $    $          $    $  ANS025.BYTE004  $  if(x1==0) y=@003f;else if(x1==1) y=@01ae;else if(x1==2) y=@01c5;else if(x1==3) y=@01c6;else y=@0002;

  $)  01.报警记录
  $  01.报警记录
  $  REQ000:720 03 22 8A 00 00 00 00 00       $  ANS000:728 03 22 8A 00 00 00 00 00

  $  000.报警记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  001.报警记录1-主驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@049e;else y=@003f;
  $  002.报警记录1-副驾车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@049e;else y=@003f;
  $  003.报警记录1-左后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@049e;else y=@003f;
  $  004.报警记录1-右后车门                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@049e;else y=@003f;
  $  005.报警记录1-行李箱盖                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@049e;else y=@003f;
  $  006.报警记录1-IG1电                      $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@049e;else y=@003f;
  $  007.报警记录1-蓄电池掉电触发             $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@049e;else y=@003f;
  $  008.报警记录1-主驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@049e;else y=@003f;
  $  009.报警记录1-左后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@049e;else y=@003f;
  $  010.报警记录1-副驾门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@049e;else y=@003f;
  $  011.报警记录1-右后门锁                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@049e;else y=@003f;
  $  012.报警记录1-前舱盖                     $    $       $    $  ANS000.BYTE006  $  if(x1&0x20) y=@049e;else y=@003f;
  $  013.报警记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  014.报警记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  015.报警记录2-主驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@049e;else y=@003f;
  $  016.报警记录2-副驾车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@049e;else y=@003f;
  $  017.报警记录2-左后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@049e;else y=@003f;
  $  018.报警记录2-右后车门                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@049e;else y=@003f;
  $  019.报警记录2-行李箱盖                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@049e;else y=@003f;
  $  020.报警记录2-IG1电                      $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@049e;else y=@003f;
  $  021.报警记录2-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@049e;else y=@003f;
  $  022.报警记录2-主驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@049e;else y=@003f;
  $  023.报警记录2-左后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@049e;else y=@003f;
  $  024.报警记录2-副驾门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@049e;else y=@003f;
  $  025.报警记录2-右后门锁                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@049e;else y=@003f;
  $  026.报警记录2-前舱盖                     $    $       $    $  ANS000.BYTE010  $  if(x1&0x20) y=@049e;else y=@003f;
  $  027.报警记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  028.报警记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  029.报警记录3-主驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@049e;else y=@003f;
  $  030.报警记录3-副驾车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@049e;else y=@003f;
  $  031.报警记录3-左后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@049e;else y=@003f;
  $  032.报警记录3-右后车门                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@049e;else y=@003f;
  $  033.报警记录3-行李箱盖                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@049e;else y=@003f;
  $  034.报警记录3-IG1电                      $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@049e;else y=@003f;
  $  035.报警记录3-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@049e;else y=@003f;
  $  036.报警记录3-主驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@049e;else y=@003f;
  $  037.报警记录3-左后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@049e;else y=@003f;
  $  038.报警记录3-副驾门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@049e;else y=@003f;
  $  039.报警记录3-右后门锁                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@049e;else y=@003f;
  $  040.报警记录3-前舱盖                     $    $       $    $  ANS000.BYTE014  $  if(x1&0x20) y=@049e;else y=@003f;
  $  041.报警记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  042.报警记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  043.报警记录4-主驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@049e;else y=@003f;
  $  044.报警记录4-副驾车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@049e;else y=@003f;
  $  045.报警记录4-左后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@049e;else y=@003f;
  $  046.报警记录4-右后车门                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@049e;else y=@003f;
  $  047.报警记录4-行李箱盖                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@049e;else y=@003f;
  $  048.报警记录4-IG1电                      $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@049e;else y=@003f;
  $  049.报警记录4-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@049e;else y=@003f;
  $  050.报警记录4-主驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@049e;else y=@003f;
  $  051.报警记录4-左后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@049e;else y=@003f;
  $  052.报警记录4-副驾门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@049e;else y=@003f;
  $  053.报警记录4-右后门锁                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@049e;else y=@003f;
  $  054.报警记录4-前舱盖                     $    $       $    $  ANS000.BYTE018  $  if(x1&0x20) y=@049e;else y=@003f;
  $  055.报警记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  056.报警记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  057.报警记录5-主驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@049e;else y=@003f;
  $  058.报警记录5-副驾车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@049e;else y=@003f;
  $  059.报警记录5-左后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@049e;else y=@003f;
  $  060.报警记录5-右后车门                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@049e;else y=@003f;
  $  061.报警记录5-行李箱盖                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@049e;else y=@003f;
  $  062.报警记录5-IG1电                      $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@049e;else y=@003f;
  $  063.报警记录5-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@049e;else y=@003f;
  $  064.报警记录5-主驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@049e;else y=@003f;
  $  065.报警记录5-左后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@049e;else y=@003f;
  $  066.报警记录5-副驾门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@049e;else y=@003f;
  $  067.报警记录5-右后门锁                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@049e;else y=@003f;
  $  068.报警记录5-前舱盖                     $    $       $    $  ANS000.BYTE022  $  if(x1&0x20) y=@049e;else y=@003f;
  $  069.报警记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  070.报警记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  071.报警记录6-主驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@049e;else y=@003f;
  $  072.报警记录6-副驾车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@049e;else y=@003f;
  $  073.报警记录6-左后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@049e;else y=@003f;
  $  074.报警记录6-右后车门                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@049e;else y=@003f;
  $  075.报警记录6-行李箱盖                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@049e;else y=@003f;
  $  076.报警记录6-IG1电                      $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@049e;else y=@003f;
  $  077.报警记录6-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@049e;else y=@003f;
  $  078.报警记录6-主驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@049e;else y=@003f;
  $  079.报警记录6-左后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@049e;else y=@003f;
  $  080.报警记录6-副驾门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@049e;else y=@003f;
  $  081.报警记录6-右后门锁                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@049e;else y=@003f;
  $  082.报警记录6-前舱盖                     $    $       $    $  ANS000.BYTE026  $  if(x1&0x20) y=@049e;else y=@003f;
  $  083.报警记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  084.报警记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  085.报警记录7-主驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@049e;else y=@003f;
  $  086.报警记录7-副驾车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@049e;else y=@003f;
  $  087.报警记录7-左后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@049e;else y=@003f;
  $  088.报警记录7-右后车门                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@049e;else y=@003f;
  $  089.报警记录7-行李箱盖                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@049e;else y=@003f;
  $  090.报警记录7-IG1电                      $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@049e;else y=@003f;
  $  091.报警记录7-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@049e;else y=@003f;
  $  092.报警记录7-主驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@049e;else y=@003f;
  $  093.报警记录7-左后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@049e;else y=@003f;
  $  094.报警记录7-副驾门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@049e;else y=@003f;
  $  095.报警记录7-右后门锁                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@049e;else y=@003f;
  $  096.报警记录7-前舱盖                     $    $       $    $  ANS000.BYTE030  $  if(x1&0x20) y=@049e;else y=@003f;
  $  097.报警记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  098.报警记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x11: y=@0493;default: y=@0097;
  $  099.报警记录8-主驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@049e;else y=@003f;
  $  100.报警记录8-副驾车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@049e;else y=@003f;
  $  101.报警记录8-左后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@049e;else y=@003f;
  $  102.报警记录8-右后车门                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@049e;else y=@003f;
  $  103.报警记录8-行李箱盖                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@049e;else y=@003f;
  $  104.报警记录8-IG1电                      $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@049e;else y=@003f;
  $  105.报警记录8-蓄电池掉电触发(预留)       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@049e;else y=@003f;
  $  106.报警记录8-主驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@049e;else y=@003f;
  $  107.报警记录8-左后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@049e;else y=@003f;
  $  108.报警记录8-副驾门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@049e;else y=@003f;
  $  109.报警记录8-右后门锁                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@049e;else y=@003f;
  $  110.报警记录8-前舱盖                     $    $       $    $  ANS000.BYTE034  $  if(x1&0x20) y=@049e;else y=@003f;
  $  111.报警记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.闭锁记录
  $  02.闭锁记录
  $  REQ000:720 03 22 8A 01 00 00 00 00       $  ANS000:728 03 22 8A 01 00 00 00 00

  $  000.闭锁记录1-记录有效性               $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  001.闭锁记录1-副驶中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@049e;else y=@003f;
  $  002.闭锁记录1-主驾中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@049e;else y=@003f;
  $  003.闭锁记录1-遥控                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@049e;else y=@003f;
  $  004.闭锁记录1-超速                     $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@049e;else y=@003f;
  $  005.闭锁记录1-自动返回防盗             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@049e;else y=@003f;
  $  006.闭锁记录1-左前门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@049e;else y=@003f;
  $  007.闭锁记录1-右前门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@049e;else y=@003f;
  $  008.闭锁记录1-后背门微动开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@049e;else y=@003f;
  $  009.闭锁记录1-远程控制                 $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@049e;else y=@003f;
  $  010.闭锁记录1-自动设定防盗             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@049e;else y=@003f;
  $  011.闭锁记录1-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@049e;else y=@003f;
  $  012.闭锁记录1-数据索引                 $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013.闭锁记录2-记录有效性               $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  014.闭锁记录2-副驶中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@049e;else y=@003f;
  $  015.闭锁记录2-主驾中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@049e;else y=@003f;
  $  016.闭锁记录2-遥控                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@049e;else y=@003f;
  $  017.闭锁记录2-超速                     $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@049e;else y=@003f;
  $  018.闭锁记录2-自动返回防盗             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@049e;else y=@003f;
  $  019.闭锁记录2-左前门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@049e;else y=@003f;
  $  020.闭锁记录2-右前门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@049e;else y=@003f;
  $  021.闭锁记录2-后背门微动开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@049e;else y=@003f;
  $  022.闭锁记录2-远程控制                 $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@049e;else y=@003f;
  $  023.闭锁记录2-自动设定防盗             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@049e;else y=@003f;
  $  024.闭锁记录2-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@049e;else y=@003f;
  $  025.闭锁记录2-数据索引                 $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026.闭锁记录3-记录有效性               $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  027.闭锁记录3-副驶中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@049e;else y=@003f;
  $  028.闭锁记录3-主驾中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@049e;else y=@003f;
  $  029.闭锁记录3-遥控                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@049e;else y=@003f;
  $  030.闭锁记录3-超速                     $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@049e;else y=@003f;
  $  031.闭锁记录3-自动返回防盗             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@049e;else y=@003f;
  $  032.闭锁记录3-左前门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@049e;else y=@003f;
  $  033.闭锁记录3-右前门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@049e;else y=@003f;
  $  034.闭锁记录3-后背门微动开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@049e;else y=@003f;
  $  035.闭锁记录3-远程控制                 $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@049e;else y=@003f;
  $  036.闭锁记录3-自动设定防盗             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@049e;else y=@003f;
  $  037.闭锁记录3-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@049e;else y=@003f;
  $  038.闭锁记录3-数据索引                 $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039.闭锁记录4-记录有效性               $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  040.闭锁记录4-副驶中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@049e;else y=@003f;
  $  041.闭锁记录4-主驾中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@049e;else y=@003f;
  $  042.闭锁记录4-遥控                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@049e;else y=@003f;
  $  043.闭锁记录4-超速                     $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@049e;else y=@003f;
  $  044.闭锁记录4-自动返回防盗             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@049e;else y=@003f;
  $  045.闭锁记录4-左前门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@049e;else y=@003f;
  $  046.闭锁记录4-右前门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@049e;else y=@003f;
  $  047.闭锁记录4-后背门微动开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@049e;else y=@003f;
  $  048.闭锁记录4-远程控制                 $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@049e;else y=@003f;
  $  049.闭锁记录4-自动设定防盗             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@049e;else y=@003f;
  $  050.闭锁记录4-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@049e;else y=@003f;
  $  051.闭锁记录4-数据索引                 $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052.闭锁记录5-记录有效性               $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  053.闭锁记录5-副驶中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@049e;else y=@003f;
  $  054.闭锁记录5-主驾中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@049e;else y=@003f;
  $  055.闭锁记录5-遥控                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@049e;else y=@003f;
  $  056.闭锁记录5-超速                     $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@049e;else y=@003f;
  $  057.闭锁记录5-自动返回防盗             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@049e;else y=@003f;
  $  058.闭锁记录5-左前门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@049e;else y=@003f;
  $  059.闭锁记录5-右前门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@049e;else y=@003f;
  $  060.闭锁记录5-后背门微动开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@049e;else y=@003f;
  $  061.闭锁记录5-远程控制                 $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@049e;else y=@003f;
  $  062.闭锁记录5-自动设定防盗             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@049e;else y=@003f;
  $  063.闭锁记录5-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@049e;else y=@003f;
  $  064.闭锁记录5-数据索引                 $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065.闭锁记录6-记录有效性               $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  066.闭锁记录6-副驶中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@049e;else y=@003f;
  $  067.闭锁记录6-主驾中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@049e;else y=@003f;
  $  068.闭锁记录6-遥控                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@049e;else y=@003f;
  $  069.闭锁记录6-超速                     $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@049e;else y=@003f;
  $  070.闭锁记录6-自动返回防盗             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@049e;else y=@003f;
  $  071.闭锁记录6-左前门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@049e;else y=@003f;
  $  072.闭锁记录6-右前门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@049e;else y=@003f;
  $  073.闭锁记录6-后背门微动开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@049e;else y=@003f;
  $  074.闭锁记录6-远程控制                 $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@049e;else y=@003f;
  $  075.闭锁记录6-自动设定防盗             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@049e;else y=@003f;
  $  076.闭锁记录6-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@049e;else y=@003f;
  $  077.闭锁记录6-数据索引                 $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078.闭锁记录7-记录有效性               $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  079.闭锁记录7-副驶中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@049e;else y=@003f;
  $  080.闭锁记录7-主驾中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@049e;else y=@003f;
  $  081.闭锁记录7-遥控                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@049e;else y=@003f;
  $  082.闭锁记录7-超速                     $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@049e;else y=@003f;
  $  083.闭锁记录7-自动返回防盗             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@049e;else y=@003f;
  $  084.闭锁记录7-左前门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@049e;else y=@003f;
  $  085.闭锁记录7-右前门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@049e;else y=@003f;
  $  086.闭锁记录7-后背门微动开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@049e;else y=@003f;
  $  087.闭锁记录7-远程控制                 $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@049e;else y=@003f;
  $  088.闭锁记录7-自动设定防盗             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@049e;else y=@003f;
  $  089.闭锁记录7-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@049e;else y=@003f;
  $  090.闭锁记录7-数据索引                 $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091.闭锁记录8-记录有效性               $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x12: y=@04ab;default: y=@0097;
  $  092.闭锁记录8-副驶中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@049e;else y=@003f;
  $  093.闭锁记录8-主驾中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@049e;else y=@003f;
  $  094.闭锁记录8-遥控                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@049e;else y=@003f;
  $  095.闭锁记录8-超速                     $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@049e;else y=@003f;
  $  096.闭锁记录8-自动返回防盗             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@049e;else y=@003f;
  $  097.闭锁记录8-左前门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@049e;else y=@003f;
  $  098.闭锁记录8-右前门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@049e;else y=@003f;
  $  099.闭锁记录8-后背门微动开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@049e;else y=@003f;
  $  100.闭锁记录8-远程控制                 $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@049e;else y=@003f;
  $  101.闭锁记录8-自动设定防盗             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@049e;else y=@003f;
  $  102.闭锁记录8-背门内整车闭锁开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@049e;else y=@003f;
  $  103.闭锁记录8-数据索引                 $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.解锁记录
  $  03.解锁记录
  $  REQ000:720 03 22 8A 02 00 00 00 00       $  ANS000:728 03 22 8A 02 00 00 00 00

  $  000.解锁记录1-记录有效性           $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  001.解锁记录1-副驶中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@049e;else y=@003f;
  $  002.解锁记录1-主驾中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@049e;else y=@003f;
  $  003.解锁记录1-遥控                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@049e;else y=@003f;
  $  004.解锁记录1-退电                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@049e;else y=@003f;
  $  005.解锁记录1-碰撞信号             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@049e;else y=@003f;
  $  006.解锁记录1-钥匙在车内           $    $       $    $  ANS000.BYTE005  $  if(x1&0x20) y=@049e;else y=@003f;
  $  007.解锁记录1-左前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x40) y=@049e;else y=@003f;
  $  008.解锁记录1-右前门微动开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x80) y=@049e;else y=@003f;
  $  009.解锁记录1-锁定防止             $    $       $    $  ANS000.BYTE006  $  if(x1&0x01) y=@049e;else y=@003f;
  $  010.解锁记录1-后背门微动开关       $    $       $    $  ANS000.BYTE006  $  if(x1&0x02) y=@049e;else y=@003f;
  $  011.解锁记录1-远程控制             $    $       $    $  ANS000.BYTE006  $  if(x1&0x04) y=@049e;else y=@003f;
  $  012.解锁记录1-硬线碰撞信号         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08) y=@049e;else y=@003f;
  $  013.解锁记录1-CAN线碰撞信号        $    $       $    $  ANS000.BYTE006  $  if(x1&0x10) y=@049e;else y=@003f;
  $  014.解锁记录1-数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  015.解锁记录2-记录有效性           $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  016.解锁记录2-副驶中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@049e;else y=@003f;
  $  017.解锁记录2-主驾中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@049e;else y=@003f;
  $  018.解锁记录2-遥控                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@049e;else y=@003f;
  $  019.解锁记录2-退电                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@049e;else y=@003f;
  $  020.解锁记录2-碰撞信号             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@049e;else y=@003f;
  $  021.解锁记录2-钥匙在车内           $    $       $    $  ANS000.BYTE009  $  if(x1&0x20) y=@049e;else y=@003f;
  $  022.解锁记录2-左前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x40) y=@049e;else y=@003f;
  $  023.解锁记录2-右前门微动开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x80) y=@049e;else y=@003f;
  $  024.解锁记录2-锁定防止             $    $       $    $  ANS000.BYTE010  $  if(x1&0x01) y=@049e;else y=@003f;
  $  025.解锁记录2-后背门微动开关       $    $       $    $  ANS000.BYTE010  $  if(x1&0x02) y=@049e;else y=@003f;
  $  026.解锁记录2-远程控制             $    $       $    $  ANS000.BYTE010  $  if(x1&0x04) y=@049e;else y=@003f;
  $  027.解锁记录2-硬线碰撞信号         $    $       $    $  ANS000.BYTE010  $  if(x1&0x08) y=@049e;else y=@003f;
  $  028.解锁记录2-CAN线碰撞信号        $    $       $    $  ANS000.BYTE010  $  if(x1&0x10) y=@049e;else y=@003f;
  $  029.解锁记录2-数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  030.解锁记录3-记录有效性           $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  031.解锁记录3-副驶中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@049e;else y=@003f;
  $  032.解锁记录3-主驾中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@049e;else y=@003f;
  $  033.解锁记录3-遥控                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@049e;else y=@003f;
  $  034.解锁记录3-退电                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@049e;else y=@003f;
  $  035.解锁记录3-碰撞信号             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@049e;else y=@003f;
  $  036.解锁记录3-钥匙在车内           $    $       $    $  ANS000.BYTE013  $  if(x1&0x20) y=@049e;else y=@003f;
  $  037.解锁记录3-左前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x40) y=@049e;else y=@003f;
  $  038.解锁记录3-右前门微动开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x80) y=@049e;else y=@003f;
  $  039.解锁记录3-锁定防止             $    $       $    $  ANS000.BYTE014  $  if(x1&0x01) y=@049e;else y=@003f;
  $  040.解锁记录3-后背门微动开关       $    $       $    $  ANS000.BYTE014  $  if(x1&0x02) y=@049e;else y=@003f;
  $  041.解锁记录3-远程控制             $    $       $    $  ANS000.BYTE014  $  if(x1&0x04) y=@049e;else y=@003f;
  $  042.解锁记录3-硬线碰撞信号         $    $       $    $  ANS000.BYTE014  $  if(x1&0x08) y=@049e;else y=@003f;
  $  043.解锁记录3-CAN线碰撞信号        $    $       $    $  ANS000.BYTE014  $  if(x1&0x10) y=@049e;else y=@003f;
  $  044.解锁记录3-数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  045.解锁记录4-记录有效性           $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  046.解锁记录4-副驶中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@049e;else y=@003f;
  $  047.解锁记录4-主驾中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@049e;else y=@003f;
  $  048.解锁记录4-遥控                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@049e;else y=@003f;
  $  049.解锁记录4-退电                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@049e;else y=@003f;
  $  050.解锁记录4-碰撞信号             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@049e;else y=@003f;
  $  051.解锁记录4-钥匙在车内           $    $       $    $  ANS000.BYTE017  $  if(x1&0x20) y=@049e;else y=@003f;
  $  052.解锁记录4-左前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x40) y=@049e;else y=@003f;
  $  053.解锁记录4-右前门微动开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x80) y=@049e;else y=@003f;
  $  054.解锁记录4-锁定防止             $    $       $    $  ANS000.BYTE018  $  if(x1&0x01) y=@049e;else y=@003f;
  $  055.解锁记录4-后背门微动开关       $    $       $    $  ANS000.BYTE018  $  if(x1&0x02) y=@049e;else y=@003f;
  $  056.解锁记录4-远程控制             $    $       $    $  ANS000.BYTE018  $  if(x1&0x04) y=@049e;else y=@003f;
  $  057.解锁记录4-硬线碰撞信号         $    $       $    $  ANS000.BYTE018  $  if(x1&0x08) y=@049e;else y=@003f;
  $  058.解锁记录4-CAN线碰撞信号        $    $       $    $  ANS000.BYTE018  $  if(x1&0x10) y=@049e;else y=@003f;
  $  059.解锁记录4-数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  060.解锁记录5-记录有效性           $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  061.解锁记录5-副驶中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@049e;else y=@003f;
  $  062.解锁记录5-主驾中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@049e;else y=@003f;
  $  063.解锁记录5-遥控                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@049e;else y=@003f;
  $  064.解锁记录5-退电                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@049e;else y=@003f;
  $  065.解锁记录5-碰撞信号             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@049e;else y=@003f;
  $  066.解锁记录5-钥匙在车内           $    $       $    $  ANS000.BYTE021  $  if(x1&0x20) y=@049e;else y=@003f;
  $  067.解锁记录5-左前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x40) y=@049e;else y=@003f;
  $  068.解锁记录5-右前门微动开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x80) y=@049e;else y=@003f;
  $  069.解锁记录5-锁定防止             $    $       $    $  ANS000.BYTE022  $  if(x1&0x01) y=@049e;else y=@003f;
  $  070.解锁记录5-后背门微动开关       $    $       $    $  ANS000.BYTE022  $  if(x1&0x02) y=@049e;else y=@003f;
  $  071.解锁记录5-远程控制             $    $       $    $  ANS000.BYTE022  $  if(x1&0x04) y=@049e;else y=@003f;
  $  072.解锁记录5-硬线碰撞信号         $    $       $    $  ANS000.BYTE022  $  if(x1&0x08) y=@049e;else y=@003f;
  $  073.解锁记录5-CAN线碰撞信号        $    $       $    $  ANS000.BYTE022  $  if(x1&0x10) y=@049e;else y=@003f;
  $  074.解锁记录5-数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  075.解锁记录6-记录有效性           $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  076.解锁记录6-副驶中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@049e;else y=@003f;
  $  077.解锁记录6-主驾中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@049e;else y=@003f;
  $  078.解锁记录6-遥控                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@049e;else y=@003f;
  $  079.解锁记录6-退电                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@049e;else y=@003f;
  $  080.解锁记录6-碰撞信号             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@049e;else y=@003f;
  $  081.解锁记录6-钥匙在车内           $    $       $    $  ANS000.BYTE025  $  if(x1&0x20) y=@049e;else y=@003f;
  $  082.解锁记录6-左前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x40) y=@049e;else y=@003f;
  $  083.解锁记录6-右前门微动开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x80) y=@049e;else y=@003f;
  $  084.解锁记录6-锁定防止             $    $       $    $  ANS000.BYTE026  $  if(x1&0x01) y=@049e;else y=@003f;
  $  085.解锁记录6-后背门微动开关       $    $       $    $  ANS000.BYTE026  $  if(x1&0x02) y=@049e;else y=@003f;
  $  086.解锁记录6-远程控制             $    $       $    $  ANS000.BYTE026  $  if(x1&0x04) y=@049e;else y=@003f;
  $  087.解锁记录6-硬线碰撞信号         $    $       $    $  ANS000.BYTE026  $  if(x1&0x08) y=@049e;else y=@003f;
  $  088.解锁记录6-CAN线碰撞信号        $    $       $    $  ANS000.BYTE026  $  if(x1&0x10) y=@049e;else y=@003f;
  $  089.解锁记录6-数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  090.解锁记录7-记录有效性           $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  091.解锁记录7-副驶中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@049e;else y=@003f;
  $  092.解锁记录7-主驾中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@049e;else y=@003f;
  $  093.解锁记录7-遥控                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@049e;else y=@003f;
  $  094.解锁记录7-退电                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@049e;else y=@003f;
  $  095.解锁记录7-碰撞信号             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@049e;else y=@003f;
  $  096.解锁记录7-钥匙在车内           $    $       $    $  ANS000.BYTE029  $  if(x1&0x20) y=@049e;else y=@003f;
  $  097.解锁记录7-左前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x40) y=@049e;else y=@003f;
  $  098.解锁记录7-右前门微动开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x80) y=@049e;else y=@003f;
  $  099.解锁记录7-锁定防止             $    $       $    $  ANS000.BYTE030  $  if(x1&0x01) y=@049e;else y=@003f;
  $  100.解锁记录7-后背门微动开关       $    $       $    $  ANS000.BYTE030  $  if(x1&0x02) y=@049e;else y=@003f;
  $  101.解锁记录7-远程控制             $    $       $    $  ANS000.BYTE030  $  if(x1&0x04) y=@049e;else y=@003f;
  $  102.解锁记录7-硬线碰撞信号         $    $       $    $  ANS000.BYTE030  $  if(x1&0x08) y=@049e;else y=@003f;
  $  103.解锁记录7-CAN线碰撞信号        $    $       $    $  ANS000.BYTE030  $  if(x1&0x10) y=@049e;else y=@003f;
  $  104.解锁记录7-数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  105.解锁记录8-记录有效性           $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x13: y=@049d;default: y=@0097;
  $  106.解锁记录8-副驶中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@049e;else y=@003f;
  $  107.解锁记录8-主驾中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@049e;else y=@003f;
  $  108.解锁记录8-遥控                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@049e;else y=@003f;
  $  109.解锁记录8-退电                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@049e;else y=@003f;
  $  110.解锁记录8-碰撞信号             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@049e;else y=@003f;
  $  111.解锁记录8-钥匙在车内           $    $       $    $  ANS000.BYTE033  $  if(x1&0x20) y=@049e;else y=@003f;
  $  112.解锁记录8-左前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x40) y=@049e;else y=@003f;
  $  113.解锁记录8-右前门微动开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x80) y=@049e;else y=@003f;
  $  114.解锁记录8-锁定防止             $    $       $    $  ANS000.BYTE034  $  if(x1&0x01) y=@049e;else y=@003f;
  $  115.解锁记录8-后背门微动开关       $    $       $    $  ANS000.BYTE034  $  if(x1&0x02) y=@049e;else y=@003f;
  $  116.解锁记录8-远程控制             $    $       $    $  ANS000.BYTE034  $  if(x1&0x04) y=@049e;else y=@003f;
  $  117.解锁记录8-硬线碰撞信号         $    $       $    $  ANS000.BYTE034  $  if(x1&0x08) y=@049e;else y=@003f;
  $  118.解锁记录8-CAN线碰撞信号        $    $       $    $  ANS000.BYTE034  $  if(x1&0x10) y=@049e;else y=@003f;
  $  119.解锁记录8-数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.行李箱解锁记录
  $  04.行李箱解锁记录
  $  REQ000:720 03 22 8A 03 00 00 00 00       $  ANS000:728 03 22 8A 03 00 00 00 00

  $  000.行李箱解锁记录1-记录有效性                 $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  001.行李箱解锁记录1-遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01) y=@049e;else y=@003f;
  $  002.行李箱解锁记录1-行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02) y=@049e;else y=@003f;
  $  003.行李箱解锁记录1-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04) y=@049e;else y=@003f;
  $  004.行李箱解锁记录1-后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08) y=@049e;else y=@003f;
  $  005.行李箱解锁记录1-远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10) y=@049e;else y=@003f;
  $  006.行李箱解锁记录1-数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007.行李箱解锁记录2-记录有效性                 $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  008.行李箱解锁记录2-遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01) y=@049e;else y=@003f;
  $  009.行李箱解锁记录2-行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02) y=@049e;else y=@003f;
  $  010.行李箱解锁记录2-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04) y=@049e;else y=@003f;
  $  011.行李箱解锁记录2-后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08) y=@049e;else y=@003f;
  $  012.行李箱解锁记录2-远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10) y=@049e;else y=@003f;
  $  013.行李箱解锁记录2-数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014.行李箱解锁记录3-记录有效性                 $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  015.行李箱解锁记录3-遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01) y=@049e;else y=@003f;
  $  016.行李箱解锁记录3-行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02) y=@049e;else y=@003f;
  $  017.行李箱解锁记录3-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04) y=@049e;else y=@003f;
  $  018.行李箱解锁记录3-后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08) y=@049e;else y=@003f;
  $  019.行李箱解锁记录3-远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10) y=@049e;else y=@003f;
  $  020.行李箱解锁记录3-数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021.行李箱解锁记录4-记录有效性                 $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  022.行李箱解锁记录4-遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01) y=@049e;else y=@003f;
  $  023.行李箱解锁记录4-行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02) y=@049e;else y=@003f;
  $  024.行李箱解锁记录4-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04) y=@049e;else y=@003f;
  $  025.行李箱解锁记录4-后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08) y=@049e;else y=@003f;
  $  026.行李箱解锁记录4-远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10) y=@049e;else y=@003f;
  $  027.行李箱解锁记录4-数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028.行李箱解锁记录5-记录有效性                 $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  029.行李箱解锁记录5-遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01) y=@049e;else y=@003f;
  $  030.行李箱解锁记录5-行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02) y=@049e;else y=@003f;
  $  031.行李箱解锁记录5-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04) y=@049e;else y=@003f;
  $  032.行李箱解锁记录5-后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08) y=@049e;else y=@003f;
  $  033.行李箱解锁记录5-远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10) y=@049e;else y=@003f;
  $  034.行李箱解锁记录5-数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035.行李箱解锁记录6-记录有效性                 $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  036.行李箱解锁记录6-遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01) y=@049e;else y=@003f;
  $  037.行李箱解锁记录6-行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02) y=@049e;else y=@003f;
  $  038.行李箱解锁记录6-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04) y=@049e;else y=@003f;
  $  039.行李箱解锁记录6-后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08) y=@049e;else y=@003f;
  $  040.行李箱解锁记录6-远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10) y=@049e;else y=@003f;
  $  041.行李箱解锁记录6-数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042.行李箱解锁记录7-记录有效性                 $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  043.行李箱解锁记录7-遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01) y=@049e;else y=@003f;
  $  044.行李箱解锁记录7-行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02) y=@049e;else y=@003f;
  $  045.行李箱解锁记录7-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04) y=@049e;else y=@003f;
  $  046.行李箱解锁记录7-后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08) y=@049e;else y=@003f;
  $  047.行李箱解锁记录7-远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10) y=@049e;else y=@003f;
  $  048.行李箱解锁记录7-数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049.行李箱解锁记录8-记录有效性                 $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x14: y=@049d;default: y=@0097;
  $  050.行李箱解锁记录8-遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01) y=@049e;else y=@003f;
  $  051.行李箱解锁记录8-行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02) y=@049e;else y=@003f;
  $  052.行李箱解锁记录8-钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04) y=@049e;else y=@003f;
  $  053.行李箱解锁记录8-后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08) y=@049e;else y=@003f;
  $  054.行李箱解锁记录8-远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10) y=@049e;else y=@003f;
  $  055.行李箱解锁记录8-数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.启动失败记录
  $  05.启动失败记录
  $  REQ000:720 03 22 8A 04 00 00 00 00       $  ANS000:728 03 22 8A 04 00 00 00 00

  $  000.启动失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  001.启动失败记录1-启动失败原因       $    $       $    $  ANS000.BYTE005  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  002.启动失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.启动失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  004.启动失败记录2-启动失败原因       $    $       $    $  ANS000.BYTE009  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  005.启动失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.启动失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  007.启动失败记录3-启动失败原因       $    $       $    $  ANS000.BYTE013  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  008.启动失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.启动失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  010.启动失败记录4-启动失败原因       $    $       $    $  ANS000.BYTE017  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  011.启动失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.启动失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  013.启动失败记录5-启动失败原因       $    $       $    $  ANS000.BYTE021  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  014.启动失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.启动失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  016.启动失败记录6-启动失败原因       $    $       $    $  ANS000.BYTE025  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  017.启动失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.启动失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  019.启动失败记录7-启动失败原因       $    $       $    $  ANS000.BYTE029  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  020.启动失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.启动失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x15: y=@049f;default: y=@0097;
  $  022.启动失败记录8-启动失败原因       $    $       $    $  ANS000.BYTE033  $  switxh(x1)0x00: y=@003f;0x01: y=@0098;0x02: y=@04a1;0x03: y=@04a2;0x04: y=@04a3;0x05: y=@009c;0x06: y=@009d;0x07: y=@05b8;0x08: y=@04a5;0x09: y=@00a0;0x0A: y=@00a1;0x0B: y=@00a2;0x0C: y=@010e;0x0D: y=@04a6;default: y=@0002;
  $  023.启动失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.退电失败记录
  $  06.退电失败记录
  $  REQ000:720 03 22 8A 05 00 00 00 00       $  ANS000:728 03 22 8A 05 00 00 00 00

  $  000.退电失败记录1-记录有效性         $    $       $    $  ANS000.BYTE004  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  001.退电失败记录1-退电失败原因       $    $       $    $  ANS000.BYTE005  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  002.退电失败记录1-数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.退电失败记录2-记录有效性         $    $       $    $  ANS000.BYTE008  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  004.退电失败记录2-退电失败原因       $    $       $    $  ANS000.BYTE009  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  005.退电失败记录2-数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.退电失败记录3-记录有效性         $    $       $    $  ANS000.BYTE012  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  007.退电失败记录3-退电失败原因       $    $       $    $  ANS000.BYTE013  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  008.退电失败记录3-数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.退电失败记录4-记录有效性         $    $       $    $  ANS000.BYTE016  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  010.退电失败记录4-退电失败原因       $    $       $    $  ANS000.BYTE017  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  011.退电失败记录4-数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.退电失败记录5-记录有效性         $    $       $    $  ANS000.BYTE020  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  013.退电失败记录5-退电失败原因       $    $       $    $  ANS000.BYTE021  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  014.退电失败记录5-数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.退电失败记录6-记录有效性         $    $       $    $  ANS000.BYTE024  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  016.退电失败记录6-退电失败原因       $    $       $    $  ANS000.BYTE025  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  017.退电失败记录6-数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.退电失败记录7-记录有效性         $    $       $    $  ANS000.BYTE028  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  019.退电失败记录7-退电失败原因       $    $       $    $  ANS000.BYTE029  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  020.退电失败记录7-数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.退电失败记录8-记录有效性         $    $       $    $  ANS000.BYTE032  $  switxh(x1)0x16: y=@04a0;default: y=@0097;
  $  022.退电失败记录8-退电失败原因       $    $       $    $  ANS000.BYTE033  $  switxh(x1)0x00: y=@003f;0x01: y=@04a9;0x02: y=@04a2;0x03: y=@009d;0x04: y=@05b7;0x05: y=@04aa;0x06: y=@00a6;default: y=@0002;
  $  023.退电失败记录8-数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

动作测试:

$^ 00.ACC继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 00 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 00 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.IG1继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 01 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 01 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.IG2继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 02 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 02 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 03.IG3继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 03 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 03 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 04.IG4继电器测试 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 04 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 04 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 05.室内灯(开关置于DOOR状态)测试 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 05 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 05 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 06.启动按钮背光灯测试 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 06 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 06 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 07.启动按钮橙色指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 07 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 07 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 08.启动按钮绿色指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 08 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 08 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 09.左转向灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 09 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 09 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 10.右转向灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 0A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 0A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 11.告警灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 0B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 0B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 12.告警灯开关指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 0C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 0C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 13.昼行灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 0D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 0D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 14.小灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 0E 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 0E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 15.近光灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 0F 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 0F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 16.远光灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 10 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 10 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 17.后雾灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 11 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 11 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 18.倒车灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 12 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 12 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 19.制动灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 13 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 13 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 20.行李箱照明灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 14 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 14 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 21.交流充电口照明灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 15 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 15 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 22.防盗指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 16 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 16 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 23.外后视镜照脚灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 17 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 17 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 24.转向轴锁继电器 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 18 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 18 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 25.左前门锁开锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:720 05 2F 81 19 03 00 00 00     $^

$^BUTTON:左前门锁开锁 
$^REQ00:720 05 2F 81 19 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 26.乘客门开锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:720 05 2F 81 1A 03 00 00 00     $^

$^BUTTON:乘客门开锁 
$^REQ00:720 05 2F 81 1A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 27.背门开锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:720 05 2F 81 1B 03 00 00 00     $^

$^BUTTON:背门开锁 
$^REQ00:720 05 2F 81 1B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 28.四门闭锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:720 05 2F 81 1C 03 00 00 00     $^

$^BUTTON:四门闭锁 
$^REQ00:720 05 2F 81 1C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 29.喇叭继电器 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 1D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 1D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 30.预配电 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 1E 03 00 00 00     $^

$^BUTTON:通电 
$^REQ00:720 05 2F 81 1E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 31.充电枪电锁解锁 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 05 2F 81 1F 03 00 00 00     $^

$^BUTTON:解锁 
$^REQ00:720 05 2F 81 1F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 32.充电枪电锁闭锁 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 05 2F 81 20 03 00 00 00     $^

$^BUTTON:闭锁 
$^REQ00:720 05 2F 81 20 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 33.后视镜折叠 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:720 05 2F 81 21 03 00 00 00     $^

$^BUTTON:折叠 
$^REQ00:720 05 2F 81 21 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 34.后视镜展开 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:720 05 2F 81 22 03 00 00 00     $^

$^BUTTON:展开 
$^REQ00:720 05 2F 81 22 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 35.前洗涤继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 23 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 23 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 36.后洗涤继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 24 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 24 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 37.前雨刮开关继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 25 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 25 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 38.前雨刮速度继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 26 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 26 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 39.后雨刮继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 27 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 27 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 40.后除霜继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:720 05 2F 81 28 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:720 05 2F 81 28 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 41.P档指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 29 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 29 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 42.R档指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 2A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 2A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 43.N档指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 2B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 2B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 44.D档指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 2C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 2C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 45.室内灯总开关-关信号输出 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 05 2F 81 2F 03 00 00 00     $^

$^BUTTON:输出 
$^REQ00:720 05 2F 81 2F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 46.室内灯总开关-开信号输出 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 05 2F 81 30 03 00 00 00     $^

$^BUTTON:输出 
$^REQ00:720 05 2F 81 30 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 47.铅酸电池智能充电 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 05 2F 81 31 03 00 00 00     $^

$^BUTTON:起动铅酸电池智能充电 
$^REQ00:720 05 2F 81 31 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 48.写入前轴标准胎压值 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:720 05 2E 33 09 XX XX 00 00     $^

$^BUTTON:退出
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

$^DSP:写入前轴标准胎压值
$^TIP:请输入测试值(范围:0~4094) 
$^IN_F:y=(x1*256+x2)*1;
$^RANGE:0,4094
;----------------------------------------------------------------------------------------------------

$^ 49.写入后轴标准胎压值 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:720 05 2E 33 0A XX XX 00 00     $^

$^BUTTON:退出
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

$^DSP:写入后轴标准胎压值
$^TIP:请输入测试值(范围:0~4094) 
$^IN_F:y=(x1*256+x2)*1;
$^RANGE:0,4094
;----------------------------------------------------------------------------------------------------

$^ 50.中控开关LOCK指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 81 32 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 81 32 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 51.PTC水加热器占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:720 05 2F 41 00 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

$^DSP:PTC水加热器占空比
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 52.电动压缩机占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:720 05 2F 41 01 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

$^DSP:电动压缩机占空比
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 53.电池热管理水泵占空比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:720 05 2F 41 02 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

$^DSP:电池热管理水泵占空比
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 54.蒸发器端电子膨胀阀开度 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:720 05 2F 41 03 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

$^DSP:蒸发器端电子膨胀阀开度
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 55.热管理板换端器端电子膨胀阀开度百分比 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:720 05 2F 41 04 03 XX 00 00     $^

$^BUTTON:退出
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

$^DSP:热管理板换端器端电子膨胀阀开度百分比
$^TIP:请输入测试值(范围:0~100) 
$^IN_F:y=x1;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 56.空调散热风扇档位 
$^TYPE0
$^BUTTON:不开启 
$^REQ00:720 05 2F 41 05 03 00 00 00     $^

$^BUTTON:低速档 
$^REQ00:720 05 2F 41 05 03 01 00 00     $^

$^BUTTON:高速档 
$^REQ00:720 05 2F 41 05 03 02 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 57.四通阀位置控制 
$^TYPE0
$^BUTTON:空调采暖回路 
$^REQ00:720 05 2F 41 07 03 00 00 00     $^

$^BUTTON:电池加热回路 
$^REQ00:720 05 2F 41 07 03 01 00 00     $^

$^BUTTON:中间位置 
$^REQ00:720 05 2F 41 07 03 02 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 58.电子膨胀阀请求复位 
$^TYPE0
$^BUTTON:不复位 
$^REQ00:720 05 2F 41 08 03 00 00 00     $^

$^BUTTON:复位 
$^REQ00:720 05 2F 41 08 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 59.电池冷却控制 
$^TYPE0
$^BUTTON:不开启 
$^REQ00:720 05 2F 41 09 03 00 00 00     $^

$^BUTTON:电池冷却1档 
$^REQ00:720 05 2F 41 09 03 01 00 00     $^

$^BUTTON:电池冷却2档 
$^REQ00:720 05 2F 41 09 03 02 00 00     $^

$^BUTTON:电池冷却3档 
$^REQ00:720 05 2F 41 09 03 03 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 60.电池内循环控制 
$^TYPE0
$^BUTTON:不开启 
$^REQ00:720 05 2F 41 0A 03 00 00 00     $^

$^BUTTON:开启 
$^REQ00:720 05 2F 41 0A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 61.电池加热控制 
$^TYPE0
$^BUTTON:不开启 
$^REQ00:720 05 2F 41 0B 03 00 00 00     $^

$^BUTTON:开启 
$^REQ00:720 05 2F 41 0B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 62.空调采暖水泵控制 
$^TYPE0
$^BUTTON:不开启 
$^REQ00:720 05 2F 41 0C 03 00 00 00     $^

$^BUTTON:开启 
$^REQ00:720 05 2F 41 0C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 63.引擎音模拟器发声功能 
$^TYPE0
$^BUTTON:正常 
$^REQ00:720 05 2F 51 00 03 00 00 00     $^

$^BUTTON:D档，10Km/h发声 
$^REQ00:720 05 2F 51 00 03 01 00 00     $^

$^BUTTON:D档，20Km/h发声 
$^REQ00:720 05 2F 51 00 03 02 00 00     $^

$^BUTTON:R档，5Km/h发声 
$^REQ00:720 05 2F 51 00 03 03 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 64.车速表 
$^TYPE0
$^BUTTON:0Km/h 
$^REQ00:720 05 2F 71 01 03 00 00 00     $^

$^BUTTON:40Km/h 
$^REQ00:720 05 2F 71 01 03 01 00 00     $^

$^BUTTON:80Km/h 
$^REQ00:720 05 2F 71 01 03 02 00 00     $^

$^BUTTON:120Km/h 
$^REQ00:720 05 2F 71 01 03 03 00 00     $^

$^BUTTON:160Km/h 
$^REQ00:720 05 2F 71 01 03 04 00 00     $^

$^BUTTON:200Km/h 
$^REQ00:720 05 2F 71 01 03 05 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 65.转速表 
$^TYPE0
$^BUTTON:0rad/min 
$^REQ00:720 05 2F 71 02 03 00 00 00     $^

$^BUTTON:1000rad/min 
$^REQ00:720 05 2F 71 02 03 01 00 00     $^

$^BUTTON:2000rad/min 
$^REQ00:720 05 2F 71 02 03 02 00 00     $^

$^BUTTON:3000rad/min 
$^REQ00:720 05 2F 71 02 03 03 00 00     $^

$^BUTTON:4000rad/min 
$^REQ00:720 05 2F 71 02 03 04 00 00     $^

$^BUTTON:5000rad/min 
$^REQ00:720 05 2F 71 02 03 05 00 00     $^

$^BUTTON:6000rad/min 
$^REQ00:720 05 2F 71 02 03 06 00 00     $^

$^BUTTON:7000rad/min 
$^REQ00:720 05 2F 71 02 03 07 00 00     $^

$^BUTTON:8000rad/min 
$^REQ00:720 05 2F 71 02 03 08 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 66.燃油表 
$^TYPE0
$^BUTTON:空 
$^REQ00:720 05 2F 71 03 03 00 00 00     $^

$^BUTTON:1/2 
$^REQ00:720 05 2F 71 03 03 01 00 00     $^

$^BUTTON:满 
$^REQ00:720 05 2F 71 03 03 02 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 67.功率表 
$^TYPE0
$^BUTTON:0 
$^REQ00:720 05 2F 71 04 03 00 00 00     $^

$^BUTTON:100 
$^REQ00:720 05 2F 71 04 03 01 00 00     $^

$^BUTTON:200 
$^REQ00:720 05 2F 71 04 03 02 00 00     $^

$^BUTTON:-100 
$^REQ00:720 05 2F 71 04 03 03 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 68.电量表 
$^TYPE0
$^BUTTON:空 
$^REQ00:720 05 2F 71 05 03 00 00 00     $^

$^BUTTON:1/2 
$^REQ00:720 05 2F 71 05 03 01 00 00     $^

$^BUTTON:满 
$^REQ00:720 05 2F 71 05 03 02 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 69.水温表 
$^TYPE0
$^BUTTON:低 
$^REQ00:720 05 2F 71 06 03 00 00 00     $^

$^BUTTON:正常 
$^REQ00:720 05 2F 71 06 03 01 00 00     $^

$^BUTTON:高 
$^REQ00:720 05 2F 71 06 03 02 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 70.室外温度 
$^TYPE0
$^BUTTON:0 
$^REQ00:720 05 2F 71 07 03 00 00 00     $^

$^BUTTON:-40 
$^REQ00:720 05 2F 71 07 03 01 00 00     $^

$^BUTTON:50 
$^REQ00:720 05 2F 71 07 03 02 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 71.液晶屏显示 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 08 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 08 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 72.驾驶员安全带未系指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 09 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 09 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 73.副驾安全带未系指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 0A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 0A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 74.左后安全带未系指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 0B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 0B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 75.中后安全带未系指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 0C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 0C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 76.右后安全带未系指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 0D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 0D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 77.SRS(安全气囊)故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 0E 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 0E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 78.EPS(助力转向系统)故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 0F 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 0F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 79.前照灯故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 10 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 10 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 80.制动片磨损指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 11 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 11 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 81.ABS(防抱死刹车系统)故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 12 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 12 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 82.ESP(电子车身稳定系统)故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 13 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 13 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 83.陡坡缓降故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 14 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 14 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 84.机油液位低指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 15 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 15 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 85.发动机故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 16 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 16 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 86.冷却液温度过高指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 17 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 17 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 87.机油压力低指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 18 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 18 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 88.轮胎快速漏气指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 19 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 19 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 89.制动故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 1A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 1A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 90.低压供电系统故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 1B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 1B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 91.动力电池过热指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 1C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 1C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 92.电机过热指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 1D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 1D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 93.电机故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 1E 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 1E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 94.电机冷却液温度过高指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 1F 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 1F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 95.动力电池故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 20 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 20 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 96.动力系统故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 21 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 21 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 97.驱动功率限制指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 22 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 22 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 98.胎压过低指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 23 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 23 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 99.ACC(巡航)故障指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 24 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 24 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 100.变道盲区指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 25 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 25 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 101.紧急制动（故障）指示灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 26 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 26 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 102.主告警灯 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 71 27 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 71 27 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 103.屏蔽黄色文字信息 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 00 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 00 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 104.屏蔽红色文字信息 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 01 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 01 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 105.请检查SRS(安全气囊)系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 02 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 02 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 106.请检查转向系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 03 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 03 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 107.请检查前照灯系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 04 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 04 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 108.请检查制动片 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 05 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 05 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 109.请检查ABS(防抱死刹车)系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 06 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 06 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 110.请检查ESP(电子车身稳定)系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 07 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 07 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 111.请检查HDC系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 08 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 08 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 112.机油油位过低 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 09 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 09 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 113.请检查发动机系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 0A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 0A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 114.发动机冷却液温度过高 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 0B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 0B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 115.机油压力不足 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 0C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 0C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 116.快速漏气(车体轮胎形式) 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 0D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 0D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 117.请检查制动系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 0E 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 0E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 118.制动液液位低 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 0F 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 0F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 119.请检查电子驻车系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 10 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 10 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 120.低压供电系统故障，请安全停车并联系服务店 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 11 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 11 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 121.请检查低压供电系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 12 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 12 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 122.请检查起动型铁电池系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 13 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 13 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 123.起动型铁电池故障，请联系服务店更换 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 14 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 14 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 124.请检查发电系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 15 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 15 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 125.发动机转速过高 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 16 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 16 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 126.机油油位过高 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 17 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 17 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 127.请检查机油监测系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 18 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 18 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 128.发动机附件功能受限 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 19 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 19 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 129.变速器功能受限 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 1A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 1A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 130.请检查变速器系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 1B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 1B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 131.离合温度高，请安全靠边停车 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 1C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 1C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 132.变速箱油温过高，请靠边停车冷却 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 1D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 1D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 133.请检查挡位系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 1E 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 1E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 134.发动机启动失败，请行驶到安全区域停车检查 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 1F 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 1F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 135.请检查动力电池 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 20 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 20 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 136.请检查动力系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 21 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 21 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 137.EV功能受限 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 22 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 22 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 138.车辆进入强制EV模式，动力受限 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 23 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 23 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 139.请检查胎压监测系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 24 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 24 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 140.胎压欠压报警 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 25 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 25 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 141.胎压信号异常 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 26 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 26 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 142.胎温过高 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 27 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 27 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 143.请检查自适应巡航系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 28 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 28 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 144.请检查BSD(盲区监测)系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 29 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 29 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 145.请检查自动紧急制动系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 2A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 2A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 146.请检查前置毫米波雷达 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 2B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 2B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 147.请检查多功能视频控制器 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 2C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 2C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 148.请检查预测性碰撞报警系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 2D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 2D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 149.请检查行人探测系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 2E 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 2E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 150.请检查车道保持系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 2F 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 2F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 151.请检查车道偏离系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 30 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 30 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 152.请检查交通标志识别系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 31 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 31 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 153.请检查智能远近光灯系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 32 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 32 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 154.多功能视频控制器功能受限 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 33 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 33 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 155.请检查起停系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 34 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 34 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 156.空调热管理故障，请联系服务店维修 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 35 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 35 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 157.请添加燃油 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 36 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 36 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 158.请添加燃油 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 36 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 36 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 159.请检查四驱系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 37 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 37 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 160.请检查车辆网络 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 38 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 38 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 161.请检查记忆系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 39 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 39 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 162.请检查天窗系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 3A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 3A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 163.请检查车载充电系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 3B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 3B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 164.请检查充电设备 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 3C 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 3C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 165.请检查电网系统 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 3D 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 3D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 166.请检查放电设备 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 3E 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 3E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 167.车速超过XXX km/h 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 3F 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 3F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 168.离保养还有XX天 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 40 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 40 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 169.离保养还有XXX km 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 41 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 41 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 170.离保养还有XX天XXX km 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 42 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 42 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 171.请立即到BYD授权服务店保养 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 43 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 43 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 172.未检测到钥匙 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 44 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 44 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 173.钥匙电池电量低 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 45 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 45 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 174.钥匙电量低，请尽快更换电池 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 46 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 46 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 175.未检测到钥匙，请将钥匙靠近射频读卡器后启动车辆 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 47 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 47 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 176.未检测到钥匙，请确认钥匙是否在车内 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 48 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 48 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 177.通信异常，离钥匙功能失效还剩XX天，请联系4S店尽快处理 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 49 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 49 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 178.通信异常，离钥匙功能失效还剩XX小时，请联系4S店尽快处理 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 4A 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 4A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 179.钥匙功能已失效，车辆无法正常使用 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 72 4B 03 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 72 4B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 180.行车自动落锁 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 82 00 08 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 82 00 08 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 181.外后视镜随动 
$^TYPE0
$^BUTTON:关闭 
$^REQ00:720 05 2F 82 01 08 00 00 00     $^

$^BUTTON:打开 
$^REQ00:720 05 2F 82 01 08 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 182.外后视镜照脚灯点亮时间 
$^TYPE0
$^BUTTON:OFF(关闭) 
$^REQ00:720 05 2F 82 02 08 00 00 00     $^

$^BUTTON:8s 
$^REQ00:720 05 2F 82 02 08 01 00 00     $^

$^BUTTON:30s 
$^REQ00:720 05 2F 82 02 08 02 00 00     $^

$^BUTTON:15s 
$^REQ00:720 05 2F 82 02 08 03 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 183.遥控开锁方式 
$^TYPE0
$^BUTTON:只解锁驾驶门 
$^REQ00:720 05 2F 82 03 08 00 00 00     $^

$^BUTTON:四门同步解锁 
$^REQ00:720 05 2F 82 03 08 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 184.室内照明时间 
$^TYPE0
$^BUTTON:OFF(关闭) 
$^REQ00:720 05 2F 82 04 08 00 00 00     $^

$^BUTTON:8s 
$^REQ00:720 05 2F 82 04 08 01 00 00     $^

$^BUTTON:30s 
$^REQ00:720 05 2F 82 04 08 02 00 00     $^

$^BUTTON:15s 
$^REQ00:720 05 2F 82 04 08 03 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 185.自动上锁时间 
$^TYPE0
$^BUTTON:60s 
$^REQ00:720 05 2F 82 05 08 00 00 00     $^

$^BUTTON:30s 
$^REQ00:720 05 2F 82 05 08 01 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 186.所有功能恢复默认设置 
$^TYPE0
$^BUTTON:动作执行 
$^REQ00:720 04 2F 82 06 08 00 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 187.累计平均油耗清零 
$^TYPE0
$^BUTTON:清零 
$^REQ00:720 05 2F 71 00 08 FF 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 188.音源模式 
$^TYPE0
$^BUTTON:标准 
$^REQ00:720 05 2F 51 A0 08 00 00 00     $^

$^BUTTON:动感 
$^REQ00:720 05 2F 51 A0 08 01 00 00     $^

$^BUTTON:舒适 
$^REQ00:720 05 2F 51 A0 08 02 00 00     $^

$^BUTTON:退出 
$^REQ00:720 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 189.车型颜色配置 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 04 2E 20 05 00 00 00 00     $^

$^BUTTON:天山白 
$^REQ00:720 04 2E 20 05 01 00 00 00     $^

$^BUTTON:陶瓷白 
$^REQ00:720 04 2E 20 05 02 00 00 00     $^

$^BUTTON:梦幻蓝 
$^REQ00:720 04 2E 20 05 03 00 00 00     $^

$^BUTTON:冰海蓝 
$^REQ00:720 04 2E 20 05 04 00 00 00     $^

$^BUTTON:闪烁蓝 
$^REQ00:720 04 2E 20 05 05 00 00 00     $^

$^BUTTON:魔力橙 
$^REQ00:720 04 2E 20 05 06 00 00 00     $^

$^BUTTON:活力橙 
$^REQ00:720 04 2E 20 05 07 00 00 00     $^

$^BUTTON:时尚橙 
$^REQ00:720 04 2E 20 05 08 00 00 00     $^

$^BUTTON:赫拉红 
$^REQ00:720 04 2E 20 05 09 00 00 00     $^

$^BUTTON:宝石红 
$^REQ00:720 04 2E 20 05 0A 00 00 00     $^

$^BUTTON:拉菲红 
$^REQ00:720 04 2E 20 05 0B 00 00 00     $^

$^BUTTON:紫红珍珠 
$^REQ00:720 04 2E 20 05 0C 00 00 00     $^

$^BUTTON:德兰黑 
$^REQ00:720 04 2E 20 05 0D 00 00 00     $^

$^BUTTON:银砂黑 
$^REQ00:720 04 2E 20 05 0E 00 00 00     $^

$^BUTTON:雅典银 
$^REQ00:720 04 2E 20 05 0F 00 00 00     $^

$^BUTTON:开米士银 
$^REQ00:720 04 2E 20 05 10 00 00 00     $^

$^BUTTON:麦加金 
$^REQ00:720 04 2E 20 05 11 00 00 00     $^

$^BUTTON:香槟金 
$^REQ00:720 04 2E 20 05 12 00 00 00     $^

$^BUTTON:巧克力/巧克力棕 
$^REQ00:720 04 2E 20 05 13 00 00 00     $^

$^BUTTON:皇家紫 
$^REQ00:720 04 2E 20 05 14 00 00 00     $^

$^BUTTON:翡翠黄 
$^REQ00:720 04 2E 20 05 15 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 190.车顶行李架配置 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 04 2E 20 06 00 00 00 00     $^

$^BUTTON:无配置 
$^REQ00:720 04 2E 20 06 01 00 00 00     $^

$^BUTTON:有配置 
$^REQ00:720 04 2E 20 06 02 00 00 00     $^

$^BUTTON:预留 
$^REQ00:720 04 2E 20 06 03 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 191.外置天线配置 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 04 2E 20 07 00 00 00 00     $^

$^BUTTON:无配置 
$^REQ00:720 04 2E 20 07 01 00 00 00     $^

$^BUTTON:有配置 
$^REQ00:720 04 2E 20 07 02 00 00 00     $^

$^BUTTON:预留 
$^REQ00:720 04 2E 20 07 03 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 192.天窗配置 
$^TYPE0
$^BUTTON:无效 
$^REQ00:720 04 2E 20 08 00 00 00 00     $^

$^BUTTON:无配置 
$^REQ00:720 04 2E 20 08 01 00 00 00     $^

$^BUTTON:有配置 
$^REQ00:720 04 2E 20 08 02 00 00 00     $^

$^BUTTON:预留 
$^REQ00:720 04 2E 20 08 03 00 00 00     $^

;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:720 30 00 0F 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
