
    车型ID：a238

    模拟：协议模拟-->a238

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~729

进入命令:

  $~  REQ000:721 02 10 01 00 00 00 00 00       $~  ANS000:729 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:721 02 3E 80 00 00 00 00 00       $!  ANS000:729 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:721 04 18 00 00 FF 00 00 00       $#  ANS000:729 04 18 00 00 FF 00 00 00

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE02 控制故障码个数，从$#ANS000.BYTE3$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a2350000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:721 03 14 00 FF 00 00 00 00       $$  ANS000:729 03 14 00 FF 00 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:721 03 22 00 01 00 00 00 00       $%  ANS000:729 03 22 00 01 00 00 00 00
  $%  REQ001:721 03 22 00 03 00 00 00 00       $%  ANS001:729 03 22 00 03 00 00 00 00

  $%  000:软件版本:        $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  001:软件日期:        $%    $%  ANS000.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);
  $%  002:硬件版本:        $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%d.%d.%d],x1,x2,x3);
  $%  003:硬件日期:        $%    $%  ANS001.BYTE007  $%  y=SPRINTF([20%02d/%02d/%02d],x1,x2,x3);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流
  $  00.数据流
  $  REQ000:721 03 22 01 08 00 00 00 00       $  ANS000:729 03 22 01 08 00 00 00 00

  $  000.左前门灯开关检测             $    $       $    $  ANS000.BYTE004  $  if(x1&0x01)y=@0001;else y=@0000;
  $  001.右前门灯开关检测             $    $       $    $  ANS000.BYTE004  $  if(x1&0x02)y=@0001;else y=@0000;
  $  002.左后门灯开关检测             $    $       $    $  ANS000.BYTE004  $  if(x1&0x04)y=@0001;else y=@0000;
  $  003.右后门灯开关检测             $    $       $    $  ANS000.BYTE004  $  if(x1&0x08)y=@0001;else y=@0000;
  $  004.行李箱开关检测               $    $       $    $  ANS000.BYTE004  $  if(x1&0x10)y=@0001;else y=@0000;
  $  005.左前门锁状态                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x20)y=@0067;else y=@0068;
  $  006.左后门锁状态                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x40)y=@0067;else y=@0068;
  $  007.右前门锁状态                 $    $       $    $  ANS000.BYTE004  $  if(x1&0x80)y=@0067;else y=@0068;
  $  008.右后门锁状态                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@0067;else y=@0068;
  $  009.后背门锁状态                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@0067;else y=@0068;
  $  010.发动机前舱盖状态             $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@0001;else y=@0000;
  $  011.安全带未系信号检测           $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@03b1;else y=@0092;
  $  012.12V制动信号状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@0093;else y=@003f;
  $  013.0V制动灯开关状态             $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@0093;else y=@003f;
  $  014.启动按钮1脚状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@007b;else y=@0094;
  $  015.启动按钮4脚状态              $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@007b;else y=@0094;
  $  016.离合踏板状态                 $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@0003;else y=@0004;
  $  017.起动机继电器状态             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@0048;else y=@0047;
  $  018.左中控锁闭锁开关状态         $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@007b;else y=@003f;
  $  019.左中控锁解锁开关状态         $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@007b;else y=@003f;
  $  020.右中控锁闭锁开关状态         $    $       $    $  ANS000.BYTE006  $  if(x1&0x10)y=@007b;else y=@003f;
  $  021.右中控锁解锁开关状态         $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@007b;else y=@003f;
  $  022.硬件碰撞信号状态             $    $       $    $  ANS000.BYTE006  $  if(x1&0x40)y=@01ac;else y=@01ad;
  $  023.IG1电状态                    $    $       $    $  ANS000.BYTE006  $  if(x1&0x80)y=@014d;else y=@014f;
  $  024.ACC电状态                    $    $       $    $  ANS000.BYTE007  $  if(x1&0x01)y=@014d;else y=@014f;
  $  025.外后视镜折叠开关状态         $    $       $    $  ANS000.BYTE007  $  if((x1&0x0C)==0x04)y=@007d;else if((x1&0x0C)==0x08)y=@007e;else y=@003f;
  $  026.机械钥匙闭锁开关状态         $    $       $    $  ANS000.BYTE007  $  if(x1&0x08)y=@0068;else y=@003f;
  $  027.机械钥匙解锁开关状态         $    $       $    $  ANS000.BYTE007  $  if(x1&0x10)y=@0067;else y=@003f;
  $  028.行李箱安全系统开启状态       $    $       $    $  ANS000.BYTE007  $  if(x1&0x20)y=@0001;else y=@0000;
  $  029.自复位开关告警状态           $    $       $    $  ANS000.BYTE007  $  if(x1&0x40)y=@007b;else y=@003f;
  $  030.自锁式告警开关状态           $    $       $    $  ANS000.BYTE007  $  if(x1&0x80)y=@007b;else y=@003f;
  $  031.电动外后视镜翻转调节         $    $       $    $  ANS000.BYTE008  $  if((x1&0x0f)==0x00)y=@0082;else if((x1&0x0f)==0x01)y=@03b4;else if((x1&0x0f)==0x02)y=@03b5;else if((x1&0x0f)==0x03)y=@03b6;else if((x1&0x0f)==0x04)y=@03b7;else if((x1&0x0f)==0x05)y=@03b8;else if((x1&0x0f)==0x06)y=@03b9;else if((x1&0x0f)==0x07)y=@03ba;else if((x1&0x0f)==0x08)y=@03bb;else y=@007f;
  $  032.电动外后视镜左右选择         $    $       $    $  ANS000.BYTE008  $  if((x1&0xFF)==0x10)y=@03b2;else if((x1&0x60)==0x20)y=@03b3;else if((x1&0xF0)==0xF0)y=@007f;else y=@003f;
  $  033.门锁保护状态                 $    $       $    $  ANS000.BYTE009  $  if((x1&0x18)==0x18)y=@0852;else if((x1&0x18)==0x10)y=@00eb;else if((x1&0x18)==0x08)y=@06bb;else y=@0045;

  $)  01.历史数据-防盗报警记录
  $  01.历史数据-防盗报警记录
  $  REQ000:721 03 22 01 09 00 00 00 00       $  ANS000:729 03 22 01 09 00 00 00 00

  $  000.数据标识             $    $       $    $  ANS000.BYTE004  $  if(x1==0x11)y=@0093;else y=@003f;
  $  001.驾驶侧车门           $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@049e;else y=@003f;
  $  002.副驾驶侧车门         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@049e;else y=@003f;
  $  003.左后车门             $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@049e;else y=@003f;
  $  004.右后车门             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@049e;else y=@003f;
  $  005.行李箱盖             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@049e;else y=@003f;
  $  006.IG1电                $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@049e;else y=@003f;
  $  007.驾驶侧车门锁         $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@049e;else y=@003f;
  $  008.左后门锁             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@049e;else y=@003f;
  $  009.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@049e;else y=@003f;
  $  010.右后车门锁           $    $       $    $  ANS000.BYTE006  $  if(x1&0x08)y=@049e;else y=@003f;
  $  011.前舱盖               $    $       $    $  ANS000.BYTE006  $  if(x1&0x20)y=@049e;else y=@003f;
  $  012.数据索引             $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013.数据标识             $    $       $    $  ANS000.BYTE008  $  if(x1==0x11)y=@0093;else y=@003f;
  $  014.驾驶侧车门           $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@049e;else y=@003f;
  $  015.副驾驶侧车门         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@049e;else y=@003f;
  $  016.左后车门             $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@049e;else y=@003f;
  $  017.右后车门             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@049e;else y=@003f;
  $  018.行李箱盖             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@049e;else y=@003f;
  $  019.IG1电                $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@049e;else y=@003f;
  $  020.驾驶侧车门锁         $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@049e;else y=@003f;
  $  021.左后门锁             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@049e;else y=@003f;
  $  022.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@049e;else y=@003f;
  $  023.右后车门锁           $    $       $    $  ANS000.BYTE010  $  if(x1&0x08)y=@049e;else y=@003f;
  $  024.前舱盖               $    $       $    $  ANS000.BYTE010  $  if(x1&0x20)y=@049e;else y=@003f;
  $  025.数据索引             $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026.数据标识             $    $       $    $  ANS000.BYTE012  $  if(x1==0x11)y=@0093;else y=@003f;
  $  027.驾驶侧车门           $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@049e;else y=@003f;
  $  028.副驾驶侧车门         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@049e;else y=@003f;
  $  029.左后车门             $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@049e;else y=@003f;
  $  030.右后车门             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@049e;else y=@003f;
  $  031.行李箱盖             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@049e;else y=@003f;
  $  032.IG1电                $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@049e;else y=@003f;
  $  033.驾驶侧车门锁         $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@049e;else y=@003f;
  $  034.左后门锁             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@049e;else y=@003f;
  $  035.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@049e;else y=@003f;
  $  036.右后车门锁           $    $       $    $  ANS000.BYTE014  $  if(x1&0x08)y=@049e;else y=@003f;
  $  037.前舱盖               $    $       $    $  ANS000.BYTE014  $  if(x1&0x20)y=@049e;else y=@003f;
  $  038.数据索引             $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039.数据标识             $    $       $    $  ANS000.BYTE016  $  if(x1==0x11)y=@0093;else y=@003f;
  $  040.驾驶侧车门           $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@049e;else y=@003f;
  $  041.副驾驶侧车门         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@049e;else y=@003f;
  $  042.左后车门             $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@049e;else y=@003f;
  $  043.右后车门             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@049e;else y=@003f;
  $  044.行李箱盖             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@049e;else y=@003f;
  $  045.IG1电                $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@049e;else y=@003f;
  $  046.驾驶侧车门锁         $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@049e;else y=@003f;
  $  047.左后门锁             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@049e;else y=@003f;
  $  048.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@049e;else y=@003f;
  $  049.右后车门锁           $    $       $    $  ANS000.BYTE018  $  if(x1&0x08)y=@049e;else y=@003f;
  $  050.前舱盖               $    $       $    $  ANS000.BYTE018  $  if(x1&0x20)y=@049e;else y=@003f;
  $  051.数据索引             $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052.数据标识             $    $       $    $  ANS000.BYTE020  $  if(x1==0x11)y=@0093;else y=@003f;
  $  053.驾驶侧车门           $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@049e;else y=@003f;
  $  054.副驾驶侧车门         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@049e;else y=@003f;
  $  055.左后车门             $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@049e;else y=@003f;
  $  056.右后车门             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@049e;else y=@003f;
  $  057.行李箱盖             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@049e;else y=@003f;
  $  058.IG1电                $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@049e;else y=@003f;
  $  059.驾驶侧车门锁         $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@049e;else y=@003f;
  $  060.左后门锁             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@049e;else y=@003f;
  $  061.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@049e;else y=@003f;
  $  062.右后车门锁           $    $       $    $  ANS000.BYTE022  $  if(x1&0x08)y=@049e;else y=@003f;
  $  063.前舱盖               $    $       $    $  ANS000.BYTE022  $  if(x1&0x20)y=@049e;else y=@003f;
  $  064.数据索引             $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065.数据标识             $    $       $    $  ANS000.BYTE024  $  if(x1==0x11)y=@0093;else y=@003f;
  $  066.驾驶侧车门           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@049e;else y=@003f;
  $  067.副驾驶侧车门         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@049e;else y=@003f;
  $  068.左后车门             $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@049e;else y=@003f;
  $  069.右后车门             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@049e;else y=@003f;
  $  070.行李箱盖             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@049e;else y=@003f;
  $  071.IG1电                $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@049e;else y=@003f;
  $  072.驾驶侧车门锁         $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@049e;else y=@003f;
  $  073.左后门锁             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@049e;else y=@003f;
  $  074.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@049e;else y=@003f;
  $  075.右后车门锁           $    $       $    $  ANS000.BYTE026  $  if(x1&0x08)y=@049e;else y=@003f;
  $  076.前舱盖               $    $       $    $  ANS000.BYTE026  $  if(x1&0x20)y=@049e;else y=@003f;
  $  077.数据索引             $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078.数据标识             $    $       $    $  ANS000.BYTE028  $  if(x1==0x11)y=@0093;else y=@003f;
  $  079.驾驶侧车门           $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@049e;else y=@003f;
  $  080.副驾驶侧车门         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@049e;else y=@003f;
  $  081.左后车门             $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@049e;else y=@003f;
  $  082.右后车门             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@049e;else y=@003f;
  $  083.行李箱盖             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@049e;else y=@003f;
  $  084.IG1电                $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@049e;else y=@003f;
  $  085.驾驶侧车门锁         $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@049e;else y=@003f;
  $  086.左后门锁             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@049e;else y=@003f;
  $  087.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@049e;else y=@003f;
  $  088.右后车门锁           $    $       $    $  ANS000.BYTE030  $  if(x1&0x08)y=@049e;else y=@003f;
  $  089.前舱盖               $    $       $    $  ANS000.BYTE030  $  if(x1&0x20)y=@049e;else y=@003f;
  $  090.数据索引             $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091.数据标识             $    $       $    $  ANS000.BYTE032  $  if(x1==0x11)y=@0093;else y=@003f;
  $  092.驾驶侧车门           $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@049e;else y=@003f;
  $  093.副驾驶侧车门         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@049e;else y=@003f;
  $  094.左后车门             $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@049e;else y=@003f;
  $  095.右后车门             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@049e;else y=@003f;
  $  096.行李箱盖             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@049e;else y=@003f;
  $  097.IG1电                $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@049e;else y=@003f;
  $  098.驾驶侧车门锁         $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@049e;else y=@003f;
  $  099.左后门锁             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@049e;else y=@003f;
  $  100.副驾驶侧车门锁       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@049e;else y=@003f;
  $  101.右后车门锁           $    $       $    $  ANS000.BYTE034  $  if(x1&0x08)y=@049e;else y=@003f;
  $  102.前舱盖               $    $       $    $  ANS000.BYTE034  $  if(x1&0x20)y=@049e;else y=@003f;
  $  103.数据索引             $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  02.历史数据-门锁闭锁记录
  $  02.历史数据-门锁闭锁记录
  $  REQ000:721 03 22 01 0A 00 00 00 00       $  ANS000:729 03 22 01 0A 00 00 00 00

  $  000.数据标识               $    $       $    $  ANS000.BYTE004  $  if(x1==0x12)y=@0093;else y=@003f;
  $  001.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@049e;else y=@003f;
  $  002.驾驶侧中控开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@049e;else y=@003f;
  $  003.遥控信号               $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@049e;else y=@003f;
  $  004.超速闭锁               $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@049e;else y=@003f;
  $  005.自动返回防盗           $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@049e;else y=@003f;
  $  006.左前门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@049e;else y=@003f;
  $  007.右前门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@049e;else y=@003f;
  $  008.后背门微动开关         $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@049e;else y=@003f;
  $  009.远程控制闭锁           $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@049e;else y=@003f;
  $  010.数据索引               $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  011.数据标识               $    $       $    $  ANS000.BYTE008  $  if(x1==0x12)y=@0093;else y=@003f;
  $  012.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@049e;else y=@003f;
  $  013.驾驶侧中控开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@049e;else y=@003f;
  $  014.遥控信号               $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@049e;else y=@003f;
  $  015.超速闭锁               $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@049e;else y=@003f;
  $  016.自动返回防盗           $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@049e;else y=@003f;
  $  017.左前门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@049e;else y=@003f;
  $  018.右前门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@049e;else y=@003f;
  $  019.后背门微动开关         $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@049e;else y=@003f;
  $  020.远程控制闭锁           $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@049e;else y=@003f;
  $  021.数据索引               $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  022.数据标识               $    $       $    $  ANS000.BYTE012  $  if(x1==0x12)y=@0093;else y=@003f;
  $  023.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@049e;else y=@003f;
  $  024.驾驶侧中控开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@049e;else y=@003f;
  $  025.遥控信号               $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@049e;else y=@003f;
  $  026.超速闭锁               $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@049e;else y=@003f;
  $  027.自动返回防盗           $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@049e;else y=@003f;
  $  028.左前门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@049e;else y=@003f;
  $  029.右前门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@049e;else y=@003f;
  $  030.后背门微动开关         $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@049e;else y=@003f;
  $  031.远程控制闭锁           $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@049e;else y=@003f;
  $  032.数据索引               $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  033.数据标识               $    $       $    $  ANS000.BYTE016  $  if(x1==0x12)y=@0093;else y=@003f;
  $  034.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@049e;else y=@003f;
  $  035.驾驶侧中控开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@049e;else y=@003f;
  $  036.遥控信号               $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@049e;else y=@003f;
  $  037.超速闭锁               $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@049e;else y=@003f;
  $  038.自动返回防盗           $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@049e;else y=@003f;
  $  039.左前门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@049e;else y=@003f;
  $  040.右前门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@049e;else y=@003f;
  $  041.后背门微动开关         $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@049e;else y=@003f;
  $  042.远程控制闭锁           $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@049e;else y=@003f;
  $  043.数据索引               $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  044.数据标识               $    $       $    $  ANS000.BYTE020  $  if(x1==0x12)y=@0093;else y=@003f;
  $  045.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@049e;else y=@003f;
  $  046.驾驶侧中控开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@049e;else y=@003f;
  $  047.遥控信号               $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@049e;else y=@003f;
  $  048.超速闭锁               $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@049e;else y=@003f;
  $  049.自动返回防盗           $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@049e;else y=@003f;
  $  050.左前门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@049e;else y=@003f;
  $  051.右前门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@049e;else y=@003f;
  $  052.后背门微动开关         $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@049e;else y=@003f;
  $  053.远程控制闭锁           $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@049e;else y=@003f;
  $  054.数据索引               $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  055.数据标识               $    $       $    $  ANS000.BYTE024  $  if(x1==0x12)y=@0093;else y=@003f;
  $  056.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@049e;else y=@003f;
  $  057.驾驶侧中控开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@049e;else y=@003f;
  $  058.遥控信号               $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@049e;else y=@003f;
  $  059.超速闭锁               $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@049e;else y=@003f;
  $  060.自动返回防盗           $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@049e;else y=@003f;
  $  061.左前门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@049e;else y=@003f;
  $  062.右前门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@049e;else y=@003f;
  $  063.后背门微动开关         $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@049e;else y=@003f;
  $  064.远程控制闭锁           $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@049e;else y=@003f;
  $  065.数据索引               $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  066.数据标识               $    $       $    $  ANS000.BYTE028  $  if(x1==0x12)y=@0093;else y=@003f;
  $  067.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@049e;else y=@003f;
  $  068.驾驶侧中控开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@049e;else y=@003f;
  $  069.遥控信号               $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@049e;else y=@003f;
  $  070.超速闭锁               $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@049e;else y=@003f;
  $  071.自动返回防盗           $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@049e;else y=@003f;
  $  072.左前门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@049e;else y=@003f;
  $  073.右前门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@049e;else y=@003f;
  $  074.后背门微动开关         $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@049e;else y=@003f;
  $  075.远程控制闭锁           $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@049e;else y=@003f;
  $  076.数据索引               $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  077.数据标识               $    $       $    $  ANS000.BYTE032  $  if(x1==0x12)y=@0093;else y=@003f;
  $  078.副驾驶侧中控开关       $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@049e;else y=@003f;
  $  079.驾驶侧中控开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@049e;else y=@003f;
  $  080.遥控信号               $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@049e;else y=@003f;
  $  081.超速闭锁               $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@049e;else y=@003f;
  $  082.自动返回防盗           $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@049e;else y=@003f;
  $  083.左前门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@049e;else y=@003f;
  $  084.右前门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@049e;else y=@003f;
  $  085.后背门微动开关         $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@049e;else y=@003f;
  $  086.远程控制闭锁           $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@049e;else y=@003f;
  $  087.数据索引               $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  03.历史数据-门锁解锁记录
  $  03.历史数据-门锁解锁记录
  $  REQ000:721 03 22 01 0B 00 00 00 00       $  ANS000:729 03 22 01 0B 00 00 00 00

  $  000.数据标识                   $    $       $    $  ANS000.BYTE004  $  if(x1==0x13)y=@0093;else y=@003f;
  $  001.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@049e;else y=@003f;
  $  002.驾驶侧中控开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@049e;else y=@003f;
  $  003.遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@049e;else y=@003f;
  $  004.退电解锁                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@049e;else y=@003f;
  $  005.碰撞信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@049e;else y=@003f;
  $  006.钥匙在车门                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x20)y=@049e;else y=@003f;
  $  007.左前门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x40)y=@049e;else y=@003f;
  $  008.右前门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x80)y=@049e;else y=@003f;
  $  009.锁定防止                   $    $       $    $  ANS000.BYTE006  $  if(x1&0x01)y=@049e;else y=@003f;
  $  010.后背门微动开关             $    $       $    $  ANS000.BYTE006  $  if(x1&0x02)y=@049e;else y=@003f;
  $  011.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE006  $  if(x1&0x04)y=@049e;else y=@003f;
  $  012.数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  013.数据标识                   $    $       $    $  ANS000.BYTE008  $  if(x1==0x13)y=@0093;else y=@003f;
  $  014.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@049e;else y=@003f;
  $  015.驾驶侧中控开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@049e;else y=@003f;
  $  016.遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@049e;else y=@003f;
  $  017.退电解锁                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@049e;else y=@003f;
  $  018.碰撞信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@049e;else y=@003f;
  $  019.钥匙在车门                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x20)y=@049e;else y=@003f;
  $  020.左前门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x40)y=@049e;else y=@003f;
  $  021.右前门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x80)y=@049e;else y=@003f;
  $  022.锁定防止                   $    $       $    $  ANS000.BYTE010  $  if(x1&0x01)y=@049e;else y=@003f;
  $  023.后背门微动开关             $    $       $    $  ANS000.BYTE010  $  if(x1&0x02)y=@049e;else y=@003f;
  $  024.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE010  $  if(x1&0x04)y=@049e;else y=@003f;
  $  025.数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  026.数据标识                   $    $       $    $  ANS000.BYTE012  $  if(x1==0x13)y=@0093;else y=@003f;
  $  027.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@049e;else y=@003f;
  $  028.驾驶侧中控开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@049e;else y=@003f;
  $  029.遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@049e;else y=@003f;
  $  030.退电解锁                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@049e;else y=@003f;
  $  031.碰撞信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@049e;else y=@003f;
  $  032.钥匙在车门                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x20)y=@049e;else y=@003f;
  $  033.左前门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x40)y=@049e;else y=@003f;
  $  034.右前门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x80)y=@049e;else y=@003f;
  $  035.锁定防止                   $    $       $    $  ANS000.BYTE014  $  if(x1&0x01)y=@049e;else y=@003f;
  $  036.后背门微动开关             $    $       $    $  ANS000.BYTE014  $  if(x1&0x02)y=@049e;else y=@003f;
  $  037.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE014  $  if(x1&0x04)y=@049e;else y=@003f;
  $  038.数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  039.数据标识                   $    $       $    $  ANS000.BYTE016  $  if(x1==0x13)y=@0093;else y=@003f;
  $  040.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@049e;else y=@003f;
  $  041.驾驶侧中控开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@049e;else y=@003f;
  $  042.遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@049e;else y=@003f;
  $  043.退电解锁                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@049e;else y=@003f;
  $  044.碰撞信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@049e;else y=@003f;
  $  045.钥匙在车门                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x20)y=@049e;else y=@003f;
  $  046.左前门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x40)y=@049e;else y=@003f;
  $  047.右前门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x80)y=@049e;else y=@003f;
  $  048.锁定防止                   $    $       $    $  ANS000.BYTE018  $  if(x1&0x01)y=@049e;else y=@003f;
  $  049.后背门微动开关             $    $       $    $  ANS000.BYTE018  $  if(x1&0x02)y=@049e;else y=@003f;
  $  050.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE018  $  if(x1&0x04)y=@049e;else y=@003f;
  $  051.数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  052.数据标识                   $    $       $    $  ANS000.BYTE020  $  if(x1==0x13)y=@0093;else y=@003f;
  $  053.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@049e;else y=@003f;
  $  054.驾驶侧中控开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@049e;else y=@003f;
  $  055.遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@049e;else y=@003f;
  $  056.退电解锁                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@049e;else y=@003f;
  $  057.碰撞信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@049e;else y=@003f;
  $  058.钥匙在车门                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x20)y=@049e;else y=@003f;
  $  059.左前门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x40)y=@049e;else y=@003f;
  $  060.右前门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x80)y=@049e;else y=@003f;
  $  061.锁定防止                   $    $       $    $  ANS000.BYTE022  $  if(x1&0x01)y=@049e;else y=@003f;
  $  062.后背门微动开关             $    $       $    $  ANS000.BYTE022  $  if(x1&0x02)y=@049e;else y=@003f;
  $  063.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE022  $  if(x1&0x04)y=@049e;else y=@003f;
  $  064.数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  065.数据标识                   $    $       $    $  ANS000.BYTE024  $  if(x1==0x13)y=@0093;else y=@003f;
  $  066.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@049e;else y=@003f;
  $  067.驾驶侧中控开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@049e;else y=@003f;
  $  068.遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@049e;else y=@003f;
  $  069.退电解锁                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@049e;else y=@003f;
  $  070.碰撞信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@049e;else y=@003f;
  $  071.钥匙在车门                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x20)y=@049e;else y=@003f;
  $  072.左前门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x40)y=@049e;else y=@003f;
  $  073.右前门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x80)y=@049e;else y=@003f;
  $  074.锁定防止                   $    $       $    $  ANS000.BYTE026  $  if(x1&0x01)y=@049e;else y=@003f;
  $  075.后背门微动开关             $    $       $    $  ANS000.BYTE026  $  if(x1&0x02)y=@049e;else y=@003f;
  $  076.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE026  $  if(x1&0x04)y=@049e;else y=@003f;
  $  077.数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  078.数据标识                   $    $       $    $  ANS000.BYTE028  $  if(x1==0x13)y=@0093;else y=@003f;
  $  079.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@049e;else y=@003f;
  $  080.驾驶侧中控开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@049e;else y=@003f;
  $  081.遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@049e;else y=@003f;
  $  082.退电解锁                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@049e;else y=@003f;
  $  083.碰撞信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@049e;else y=@003f;
  $  084.钥匙在车门                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x20)y=@049e;else y=@003f;
  $  085.左前门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x40)y=@049e;else y=@003f;
  $  086.右前门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x80)y=@049e;else y=@003f;
  $  087.锁定防止                   $    $       $    $  ANS000.BYTE030  $  if(x1&0x01)y=@049e;else y=@003f;
  $  088.后背门微动开关             $    $       $    $  ANS000.BYTE030  $  if(x1&0x02)y=@049e;else y=@003f;
  $  089.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE030  $  if(x1&0x04)y=@049e;else y=@003f;
  $  090.数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  091.数据标识                   $    $       $    $  ANS000.BYTE032  $  if(x1==0x13)y=@0093;else y=@003f;
  $  092.副驾驶侧中控开关           $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@049e;else y=@003f;
  $  093.驾驶侧中控开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@049e;else y=@003f;
  $  094.遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@049e;else y=@003f;
  $  095.退电解锁                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@049e;else y=@003f;
  $  096.碰撞信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@049e;else y=@003f;
  $  097.钥匙在车门                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x20)y=@049e;else y=@003f;
  $  098.左前门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x40)y=@049e;else y=@003f;
  $  099.右前门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x80)y=@049e;else y=@003f;
  $  100.锁定防止                   $    $       $    $  ANS000.BYTE034  $  if(x1&0x01)y=@049e;else y=@003f;
  $  101.后背门微动开关             $    $       $    $  ANS000.BYTE034  $  if(x1&0x02)y=@049e;else y=@003f;
  $  102.远程控制解锁所有车门       $    $       $    $  ANS000.BYTE034  $  if(x1&0x04)y=@049e;else y=@003f;
  $  103.数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  04.历史数据-行李箱解锁记录
  $  04.历史数据-行李箱解锁记录
  $  REQ000:721 03 22 01 0C 00 00 00 00       $  ANS000:729 03 22 01 0C 00 00 00 00

  $  000.数据标识                   $    $       $    $  ANS000.BYTE004  $  if(x1==0x14)y=@0093;else y=@003f;
  $  001.遥控信号                   $    $       $    $  ANS000.BYTE005  $  if(x1&0x01)y=@049e;else y=@003f;
  $  002.行李箱开关                 $    $       $    $  ANS000.BYTE005  $  if(x1&0x02)y=@049e;else y=@003f;
  $  003.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE005  $  if(x1&0x04)y=@049e;else y=@003f;
  $  004.后背门微动开关             $    $       $    $  ANS000.BYTE005  $  if(x1&0x08)y=@049e;else y=@003f;
  $  005.远程解锁行李箱             $    $       $    $  ANS000.BYTE005  $  if(x1&0x10)y=@049e;else y=@003f;
  $  006.数据索引                   $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  007.数据标识                   $    $       $    $  ANS000.BYTE008  $  if(x1==0x14)y=@0093;else y=@003f;
  $  008.遥控信号                   $    $       $    $  ANS000.BYTE009  $  if(x1&0x01)y=@049e;else y=@003f;
  $  009.行李箱开关                 $    $       $    $  ANS000.BYTE009  $  if(x1&0x02)y=@049e;else y=@003f;
  $  010.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE009  $  if(x1&0x04)y=@049e;else y=@003f;
  $  011.后背门微动开关             $    $       $    $  ANS000.BYTE009  $  if(x1&0x08)y=@049e;else y=@003f;
  $  012.远程解锁行李箱             $    $       $    $  ANS000.BYTE009  $  if(x1&0x10)y=@049e;else y=@003f;
  $  013.数据索引                   $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  014.数据标识                   $    $       $    $  ANS000.BYTE012  $  if(x1==0x14)y=@0093;else y=@003f;
  $  015.遥控信号                   $    $       $    $  ANS000.BYTE013  $  if(x1&0x01)y=@049e;else y=@003f;
  $  016.行李箱开关                 $    $       $    $  ANS000.BYTE013  $  if(x1&0x02)y=@049e;else y=@003f;
  $  017.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE013  $  if(x1&0x04)y=@049e;else y=@003f;
  $  018.后背门微动开关             $    $       $    $  ANS000.BYTE013  $  if(x1&0x08)y=@049e;else y=@003f;
  $  019.远程解锁行李箱             $    $       $    $  ANS000.BYTE013  $  if(x1&0x10)y=@049e;else y=@003f;
  $  020.数据索引                   $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  021.数据标识                   $    $       $    $  ANS000.BYTE016  $  if(x1==0x14)y=@0093;else y=@003f;
  $  022.遥控信号                   $    $       $    $  ANS000.BYTE017  $  if(x1&0x01)y=@049e;else y=@003f;
  $  023.行李箱开关                 $    $       $    $  ANS000.BYTE017  $  if(x1&0x02)y=@049e;else y=@003f;
  $  024.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE017  $  if(x1&0x04)y=@049e;else y=@003f;
  $  025.后背门微动开关             $    $       $    $  ANS000.BYTE017  $  if(x1&0x08)y=@049e;else y=@003f;
  $  026.远程解锁行李箱             $    $       $    $  ANS000.BYTE017  $  if(x1&0x10)y=@049e;else y=@003f;
  $  027.数据索引                   $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  028.数据标识                   $    $       $    $  ANS000.BYTE020  $  if(x1==0x14)y=@0093;else y=@003f;
  $  029.遥控信号                   $    $       $    $  ANS000.BYTE021  $  if(x1&0x01)y=@049e;else y=@003f;
  $  030.行李箱开关                 $    $       $    $  ANS000.BYTE021  $  if(x1&0x02)y=@049e;else y=@003f;
  $  031.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE021  $  if(x1&0x04)y=@049e;else y=@003f;
  $  032.后背门微动开关             $    $       $    $  ANS000.BYTE021  $  if(x1&0x08)y=@049e;else y=@003f;
  $  033.远程解锁行李箱             $    $       $    $  ANS000.BYTE021  $  if(x1&0x10)y=@049e;else y=@003f;
  $  034.数据索引                   $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  035.数据标识                   $    $       $    $  ANS000.BYTE024  $  if(x1==0x14)y=@0093;else y=@003f;
  $  036.遥控信号                   $    $       $    $  ANS000.BYTE025  $  if(x1&0x01)y=@049e;else y=@003f;
  $  037.行李箱开关                 $    $       $    $  ANS000.BYTE025  $  if(x1&0x02)y=@049e;else y=@003f;
  $  038.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE025  $  if(x1&0x04)y=@049e;else y=@003f;
  $  039.后背门微动开关             $    $       $    $  ANS000.BYTE025  $  if(x1&0x08)y=@049e;else y=@003f;
  $  040.远程解锁行李箱             $    $       $    $  ANS000.BYTE025  $  if(x1&0x10)y=@049e;else y=@003f;
  $  041.数据索引                   $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  042.数据标识                   $    $       $    $  ANS000.BYTE028  $  if(x1==0x14)y=@0093;else y=@003f;
  $  043.遥控信号                   $    $       $    $  ANS000.BYTE029  $  if(x1&0x01)y=@049e;else y=@003f;
  $  044.行李箱开关                 $    $       $    $  ANS000.BYTE029  $  if(x1&0x02)y=@049e;else y=@003f;
  $  045.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE029  $  if(x1&0x04)y=@049e;else y=@003f;
  $  046.后背门微动开关             $    $       $    $  ANS000.BYTE029  $  if(x1&0x08)y=@049e;else y=@003f;
  $  047.远程解锁行李箱             $    $       $    $  ANS000.BYTE029  $  if(x1&0x10)y=@049e;else y=@003f;
  $  048.数据索引                   $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  049.数据标识                   $    $       $    $  ANS000.BYTE032  $  if(x1==0x14)y=@0093;else y=@003f;
  $  050.遥控信号                   $    $       $    $  ANS000.BYTE033  $  if(x1&0x01)y=@049e;else y=@003f;
  $  051.行李箱开关                 $    $       $    $  ANS000.BYTE033  $  if(x1&0x02)y=@049e;else y=@003f;
  $  052.钥匙在车内或行李箱内       $    $       $    $  ANS000.BYTE033  $  if(x1&0x04)y=@049e;else y=@003f;
  $  053.后背门微动开关             $    $       $    $  ANS000.BYTE033  $  if(x1&0x08)y=@049e;else y=@003f;
  $  054.远程解锁行李箱             $    $       $    $  ANS000.BYTE033  $  if(x1&0x10)y=@049e;else y=@003f;
  $  055.数据索引                   $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  05.历史数据-启动失败原因记录
  $  05.历史数据-启动失败原因记录
  $  REQ000:721 03 22 01 0D 00 00 00 00       $  ANS000:729 03 22 01 0D 00 00 00 00

  $  000.数据标识           $    $       $    $  ANS000.BYTE004  $  if(x1==0x15)y=@0093;else y=@003f;
  $  001.启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  002.数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.数据标识           $    $       $    $  ANS000.BYTE008  $  if(x1==0x15)y=@0093;else y=@003f;
  $  004.启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  005.数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.数据标识           $    $       $    $  ANS000.BYTE012  $  if(x1==0x15)y=@0093;else y=@003f;
  $  007.启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  008.数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.数据标识           $    $       $    $  ANS000.BYTE016  $  if(x1==0x15)y=@0093;else y=@003f;
  $  010.启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  011.数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.数据标识           $    $       $    $  ANS000.BYTE020  $  if(x1==0x15)y=@0093;else y=@003f;
  $  013.启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  014.数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.数据标识           $    $       $    $  ANS000.BYTE024  $  if(x1==0x15)y=@0093;else y=@003f;
  $  016.启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  017.数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.数据标识           $    $       $    $  ANS000.BYTE028  $  if(x1==0x15)y=@0093;else y=@003f;
  $  019.启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  020.数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.数据标识           $    $       $    $  ANS000.BYTE032  $  if(x1==0x15)y=@0093;else y=@003f;
  $  022.启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@0850;else if(x1==0x02)y=@0099;else if(x1==0x03)y=@009a;else if(x1==0x04)y=@009b;else if(x1==0x05)y=@009c;else if(x1==0x06)y=@084e;else if(x1==0x07)y=@06e4;else if(x1==0x08)y=@009f;else if(x1==0x09)y=@00a0;else if(x1==0x0a)y=@00a1;else if(x1==0x0b)y=@0851;else y=@010e;
  $  023.数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

  $)  06.历史数据-退电失败原因记录
  $  06.历史数据-退电失败原因记录
  $  REQ000:721 03 22 01 0E 00 00 00 00       $  ANS000:729 03 22 01 0E 00 00 00 00

  $  000.数据标识           $    $       $    $  ANS000.BYTE004  $  if(x1==0x15)y=@0093;else y=@003f;
  $  001.启动失败原因       $    $       $    $  ANS000.BYTE005  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  002.数据索引           $    $       $    $  ANS000.BYTE007  $  y=x1;
  $  003.数据标识           $    $       $    $  ANS000.BYTE008  $  if(x1==0x16)y=@0093;else y=@003f;
  $  004.启动失败原因       $    $       $    $  ANS000.BYTE009  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  005.数据索引           $    $       $    $  ANS000.BYTE011  $  y=x1;
  $  006.数据标识           $    $       $    $  ANS000.BYTE012  $  if(x1==0x16)y=@0093;else y=@003f;
  $  007.启动失败原因       $    $       $    $  ANS000.BYTE013  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  008.数据索引           $    $       $    $  ANS000.BYTE015  $  y=x1;
  $  009.数据标识           $    $       $    $  ANS000.BYTE016  $  if(x1==0x16)y=@0093;else y=@003f;
  $  010.启动失败原因       $    $       $    $  ANS000.BYTE017  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  011.数据索引           $    $       $    $  ANS000.BYTE019  $  y=x1;
  $  012.数据标识           $    $       $    $  ANS000.BYTE020  $  if(x1==0x16)y=@0093;else y=@003f;
  $  013.启动失败原因       $    $       $    $  ANS000.BYTE021  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  014.数据索引           $    $       $    $  ANS000.BYTE023  $  y=x1;
  $  015.数据标识           $    $       $    $  ANS000.BYTE024  $  if(x1==0x16)y=@0093;else y=@003f;
  $  016.启动失败原因       $    $       $    $  ANS000.BYTE025  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  017.数据索引           $    $       $    $  ANS000.BYTE027  $  y=x1;
  $  018.数据标识           $    $       $    $  ANS000.BYTE028  $  if(x1==0x16)y=@0093;else y=@003f;
  $  019.启动失败原因       $    $       $    $  ANS000.BYTE029  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  020.数据索引           $    $       $    $  ANS000.BYTE031  $  y=x1;
  $  021.数据标识           $    $       $    $  ANS000.BYTE032  $  if(x1==0x16)y=@0093;else y=@003f;
  $  022.启动失败原因       $    $       $    $  ANS000.BYTE033  $  if(x1==0x00)y=@003f;else if(x1==0x01)y=@00a3;else if(x1==0x02)y=@009a;else if(x1==0x03)y=@084e;else if(x1==0x04)y=@05b7;else if(x1==0x05)y=@084f;else if(x1==0x06)y=@00a6;else y=@010e;
  $  023.数据索引           $    $       $    $  ANS000.BYTE035  $  y=x1;

;******************************************************************************************************************************************************

动作测试:

$^ 00.左前门锁开锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 01 03 00 00 00     $^

$^BUTTON:开锁 
$^REQ00:721 05 2F 20 01 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.乘客门开锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 02 03 00 00 00     $^

$^BUTTON:开锁 
$^REQ00:721 05 2F 20 02 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.四门闭锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 03 03 00 00 00     $^

$^BUTTON:闭锁 
$^REQ00:721 05 2F 20 03 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 03.背门开锁 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 04 03 00 00 00     $^

$^BUTTON:开锁 
$^REQ00:721 05 2F 20 04 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 04.后视镜折叠 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 06 03 00 00 00     $^

$^BUTTON:折叠 
$^REQ00:721 05 2F 20 06 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 05.后视镜展开 
$^TYPE0
$^BUTTON:无动作 
$^REQ00:721 05 2F 20 07 03 00 00 00     $^

$^BUTTON:展开 
$^REQ00:721 05 2F 20 07 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 06.左前门灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 08 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 08 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 07.左后门灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 09 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 09 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 08.右前门灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 0A 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 0A 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 09.右后门灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 0B 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 0B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 10.左转向灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 0C 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 0C 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 11.右转向灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 0D 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 0D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 12.后雾灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 0F 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 0F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 13.倒车指示灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 10 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 10 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 14.启动按钮橙色指示灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 11 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 11 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 15.启动按钮绿色指示灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 12 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 12 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 16.室内灯(开关置于DOOR) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 13 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 13 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 17.外后视镜照脚灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 14 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 14 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 18.启动按钮背光灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 15 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 15 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 19.脚踏灯(预留) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 16 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 16 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 20.IG1继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 17 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 17 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 21.IG2继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 18 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 18 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 22.起动机继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 19 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 19 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 23.后雨刮控制(预留) 
$^TYPE0
$^BUTTON:未通电 
$^REQ00:721 05 2F 20 1B 03 00 00 00     $^

$^BUTTON:通电 
$^REQ00:721 05 2F 20 1B 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 24.转向轴锁继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 1D 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 1D 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 25.转向轴锁电源CTRL(预留) 
$^TYPE0
$^BUTTON:未通电 
$^REQ00:721 05 2F 20 1E 03 00 00 00     $^

$^BUTTON:通电 
$^REQ00:721 05 2F 20 1E 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 26.ACC继电器 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 1F 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 1F 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 27.预配电 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 20 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 20 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 28.防盗指示灯B10口(预留) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 21 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 21 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 29.门锁状态指示灯B9口(预留) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 22 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 22 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 30.行李箱照明灯A5口(预留) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 23 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 23 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 31.紧急制动灯B2口(预留) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 24 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 24 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 32.充电口照明灯A11口(预留) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 25 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 25 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 33.充电继电器(预留) 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 26 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 26 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 34.杂物箱照明灯 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 27 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 27 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 35.大灯洗涤继电器(预留) 
$^TYPE0
$^BUTTON:断开 
$^REQ00:721 05 2F 20 28 03 00 00 00     $^

$^BUTTON:吸合 
$^REQ00:721 05 2F 20 28 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 36.昼行灯(预留) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 29 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 29 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 37.外后视镜照脚灯(非PWM(脉宽调制)) 
$^TYPE0
$^BUTTON:熄灭 
$^REQ00:721 05 2F 20 33 03 00 00 00     $^

$^BUTTON:点亮 
$^REQ00:721 05 2F 20 33 03 01 00 00     $^

$^BUTTON:退出 
$^REQ00:721 04 2F FF 00 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:721 30 01 04 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
