
    车型ID：a30e

    模拟：协议模拟-->a30e

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

$JSON{"P4":5}

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
	<param type="string" value="1"/>
	<param type="string" value="3,11,1,12,8"/>
	</ACTIVE_ADDNODE>
</VCI>

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 FF 00 9D       $#  ANS000:84 11 F1 18 00 FF 00 9D

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a30e0000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 FF 00 98       $$  ANS000:83 11 F1 14 FF 00 98

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 80 1E       $%  ANS000:82 11 F1 1A 80 1E

  $%  000:车辆识别号:        $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:系统硬件号:        $%    $%  ANS000.BYTE036  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  002:厂家硬件号:        $%    $%  ANS000.BYTE051  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  003:软件名称:          $%    $%  ANS000.BYTE086  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:软件版本号:        $%    $%  ANS000.BYTE066  $%  HEX(x1,x2);
  $%  005:系统软件号:        $%    $%  ANS000.BYTE062  $%  ASCII(x1,x2,x3,x4);
  $%  006:引擎类型:          $%    $%  ANS000.BYTE074  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  007:测试序列号:        $%    $%  ANS000.BYTE022  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  008:编程日期:          $%    $%  ANS000.BYTE032  $%  ASCII(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.进气歧管压力                             $    $  kPa          $    $  ANS000.BYTE012  $  y=x*94.4/255+10;
  $  001.蓄电池电压                               $    $  V            $    $  ANS000.BYTE013  $  y=x*0.1;
  $  002.进气压力                                 $    $  kPa          $    $  ANS000.BYTE014  $  y=x*94.4/255+10;
  $  003.进气温度                                 $    $  degree C     $    $  ANS000.BYTE015  $  y=x*191.3/255-40;
  $  004.冷却液温度                               $    $  degree C     $    $  ANS000.BYTE017  $  y=x*191.3/255-40;
  $  005.点火提前角                               $    $  °           $    $  ANS000.BYTE018  $  y=x*179.3/255-90;
  $  006.主点火提前角偏移量                       $    $  °           $    $  ANS000.BYTE019  $  y=x*179.3/255-90;
  $  007.空调压力                                 $    $  kPa          $    $  ANS000.BYTE020  $  y=x*20;
  $  008.ESC1 AD值                                $    $  mV           $    $  ANS000.BYTE021  $  y=x*4980.0/255;
  $  009.1#缸点火延迟                             $    $  度           $    $  ANS000.BYTE022  $  y=x*90.0/255;
  $  010.2#缸点火延迟                             $    $  度           $    $  ANS000.BYTE023  $  y=x*90.0/255;
  $  011.3#缸点火延迟                             $    $  度           $    $  ANS000.BYTE024  $  y=x*90.0/255;
  $  012.4#缸点火延迟                             $    $  度           $    $  ANS000.BYTE025  $  y=x*90.0/255;
  $  013.TPS电压                                  $    $  mV           $    $  ANS000.BYTE026  $  y=x*4980.0/255;
  $  014.TPS信号                                  $    $  %            $    $  ANS000.BYTE027  $  y=x*1.0/255;
  $  015.车速                                     $    $  km/h         $    $  ANS000.BYTE028  $  y=x;
  $  016.发动机转速                               $    $  rpm          $    $  ANS000.BYTE029  $  y=x1*256+x2;
  $  017.喷油脉宽                                 $    $  毫秒         $    $  ANS000.BYTE031  $  y=x1*522.2/255+x2*2.0/255;
  $  018.IAC(怠速空气控制阀)                      $    $  步幅         $    $  ANS000.BYTE033  $  y=x;
  $  019.进气效率                                 $    $  %            $    $  ANS000.BYTE034  $  y=x*99.6/255;
  $  020.目标怠速                                 $    $  rpm          $    $  ANS000.BYTE035  $  y=x*3188.0/255;
  $  021.氧传感器1                                $    $  mV           $    $  ANS000.BYTE036  $  y=x*1127.0/255;
  $  022.氧积分值                                 $    $               $    $  ANS000.BYTE037  $  y=x;
  $  023.O2 Block Learn Cell Number               $    $               $    $  ANS000.BYTE038  $  y=x;
  $  024.O2 Block Learn Cell Content              $    $               $    $  ANS000.BYTE039  $  y=x;
  $  025.O2 Cross Over                            $    $               $    $  ANS000.BYTE040  $  y=x;
  $  026.燃油剩余量                               $    $  %            $    $  ANS000.BYTE041  $  y=x*100.0/255;
  $  027.空燃比                                   $    $  %            $    $  ANS000.BYTE042  $  y=x*0.1;
  $  028.线性EGR(废气再循环)阀命令位置            $    $  %            $    $  ANS000.BYTE043  $  y=x*99.6/255;
  $  029.线性EGR(废气再循环)阀反馈位置            $    $  %            $    $  ANS000.BYTE044  $  y=x*99.6/255;
  $  030.燃料开环是否允许                         $    $               $    $  ANS000.BYTE045  $  if(x&0x01) y=@001b;else y=@001c;
  $  031.氧传感器稀或浓                           $    $               $    $  ANS000.BYTE045  $  if(x&0x02) y=@001d;else y=@001e;
  $  032.BLM自学习是否允许                        $    $               $    $  ANS000.BYTE045  $  if(x&0x04) y=@001b;else y=@001c;
  $  033.清除溢油模式是否允许                     $    $               $    $  ANS000.BYTE045  $  if(x&0x08) y=@001b;else y=@001c;
  $  034.动力加浓模式是否允许                     $    $               $    $  ANS000.BYTE045  $  if(x&0x10) y=@001b;else y=@001c;
  $  035.DFCO 模式是否允许                        $    $               $    $  ANS000.BYTE045  $  if(x&0x20) y=@001b;else y=@001c;
  $  036.MAPCID两次结果是否相同                   $    $               $    $  ANS000.BYTE045  $  if(x&0x40) y=@001c;else y=@001b;
  $  037.Warm Up Spark是否使用                    $    $               $    $  ANS000.BYTE045  $  if(x&0x80) y=@001b;else y=@001c;
  $  038.扭矩控制暂停是否激活                     $    $               $    $  ANS000.BYTE046  $  if(x&0x01) y=@001b;else y=@001c;
  $  039.线性EGR系统是否测试完成                  $    $               $    $  ANS000.BYTE046  $  if(x&0x02) y=@001c;else y=@001b;
  $  040.传动状态                                 $    $               $    $  ANS000.BYTE046  $  if(x&0x04) y=@0952;else y=@0953;
  $  041.燃油泵继电器是否激活态                   $    $               $    $  ANS000.BYTE046  $  if(x&0x08) y=@001b;else y=@001c;
  $  042.NVRAM状态                                $    $               $    $  ANS000.BYTE046  $  if(x&0x10) y=@0954;else y=@0955;
  $  043.是否请求诊断模式                         $    $               $    $  ANS000.BYTE046  $  if(x&0x20) y=@001b;else y=@001c;
  $  044.是否达到正常IAC闭环条件                  $    $               $    $  ANS000.BYTE046  $  if(x&0x40) y=@001b;else y=@001c;
  $  045.IAC调整是否激活                          $    $               $    $  ANS000.BYTE046  $  if(x&0x80) y=@001b;else y=@001c;
  $  046.禁用AC WOT是否激活                       $    $               $    $  ANS000.BYTE047  $  if(x&0x01) y=@001b;else y=@001c;
  $  047.禁用AC Heavy Load是否激活                $    $               $    $  ANS000.BYTE047  $  if(x&0x02) y=@001b;else y=@001c;
  $  048.Rear Loop Cut Solenoid是否激活           $    $               $    $  ANS000.BYTE047  $  if(x&0x04) y=@001b;else y=@001c;
  $  049.IAC位置状态                              $    $               $    $  ANS000.BYTE047  $  if(x&0x08) y=@0956;else y=@0957;
  $  050.有AC请求                                 $    $               $    $  ANS000.BYTE047  $  if(x&0x10) y=@001b;else y=@001c;
  $  051.AC压力状态                               $    $               $    $  ANS000.BYTE047  $  if(x&0x20) y=@08cd;else y=@08cc;
  $  052.空调继电器是否激活                       $    $               $    $  ANS000.BYTE047  $  if(x&0x40) y=@001b;else y=@001c;
  $  053.AC当前是否运转                           $    $               $    $  ANS000.BYTE047  $  if(x&0x80) y=@001b;else y=@001c;
  $  054.冷却风扇#1状态                           $    $               $    $  ANS000.BYTE048  $  if(x&0x01) y=@0001;else y=@0000;
  $  055.冷却风扇#2状态                           $    $               $    $  ANS000.BYTE048  $  if(x&0x02) y=@0001;else y=@0000;
  $  056.冷却风扇#3状态                           $    $               $    $  ANS000.BYTE048  $  if(x&0x04) y=@0001;else y=@0000;
  $  057.氧传感器A加热状态                        $    $               $    $  ANS000.BYTE048  $  if(x&0x08) y=@0001;else y=@0000;
  $  058.点火状态                                 $    $               $    $  ANS000.BYTE048  $  if(x&0x10) y=@0001;else y=@0000;
  $  059.发动机故障指示灯状态                     $    $               $    $  ANS000.BYTE048  $  if(x&0x20) y=@0001;else y=@0000;
  $  060.ESC(电子车身稳定系统)是否激活            $    $               $    $  ANS000.BYTE048  $  if(x&0x80) y=@001b;else y=@001c;
  $  061.扭矩控制最大点火提前角                   $    $  °           $    $  ANS000.BYTE050  $  y=x*179.3/255-90;
  $  062.RAW MAT                                  $    $  mV           $    $  ANS000.BYTE051  $  y=x*4980.0/255;
  $  063.喷油嘴A电压状态                          $    $               $    $  ANS000.BYTE052  $  switxh(x1&0x03)0: y=@0002;3: y=@0002;1: y=@08cc;2: y=@08cd;default:y=@007f;
  $  064.喷油嘴B电压状态                          $    $               $    $  ANS000.BYTE052  $  switxh(x1&0x0C)0x00: y=@0002;0x0C: y=@0002;0x04: y=@08cc;0x08: y=@08cd;default:y=@007f;
  $  065.喷油嘴C电压状态                          $    $               $    $  ANS000.BYTE052  $  switxh(x1&0x30)0x00: y=@0002;0x30: y=@0002;0x10: y=@08cc;0x20: y=@08cd;default:y=@007f;
  $  066.喷油嘴D电压状态                          $    $               $    $  ANS000.BYTE052  $  switxh(x1&0xC0)0x00: y=@0002;0xC0: y=@0002;0x40: y=@08cc;0x80: y=@08cd;default:y=@007f;
  $  067.是否达到Rolling Idle条件                 $    $               $    $  ANS000.BYTE053  $  if(x&0x01) y=@001b;else y=@001c;
  $  068.In Rolling Idle                          $    $               $    $  ANS000.BYTE053  $  if(x&0x02) y=@001b;else y=@001c;
  $  069.ELOAD1是否激活                           $    $               $    $  ANS000.BYTE053  $  if(x&0x04) y=@001b;else y=@001c;
  $  070.ELOAD2是否激活                           $    $               $    $  ANS000.BYTE053  $  if(x&0x08) y=@001b;else y=@001c;
  $  071.前蒸发器传感器当前是否工作中             $    $               $    $  ANS000.BYTE053  $  if(x&0x10) y=@001b;else y=@001c;
  $  072.后蒸发器传感器当前是否工作中             $    $               $    $  ANS000.BYTE053  $  if(x&0x20) y=@001b;else y=@001c;
  $  073.Rear Loop Cut 电磁阀当前是否工作中       $    $               $    $  ANS000.BYTE053  $  if(x&0x40) y=@001b;else y=@001c;
  $  074.AC压力传感器当前是否工作中               $    $               $    $  ANS000.BYTE053  $  if(x&0x80) y=@001b;else y=@001c;
  $  075.Raw LEGR反馈位置传感器                   $    $  mV           $    $  ANS000.BYTE054  $  y=x*4980.0/255;
  $  076.运行里程表                               $    $  km           $    $  ANS000.BYTE055  $  y=(x1+x2*256+x3*256*256+x3*256*256*256)*0.1;
  $  077.大气压力                                 $    $  kPa          $    $  ANS000.BYTE059  $  y=x*94.1/255+10.3;
  $  078.发动机运行时间                           $    $  秒           $    $  ANS000.BYTE060  $  y=x1+x2*256;
  $  079.前蒸发器温度                             $    $  degree C     $    $  ANS000.BYTE064  $  y=x*191.0/255-40;
  $  080.后蒸发器温度                             $    $  degree C     $    $  ANS000.BYTE065  $  y=x*191.0/255-40;
  $  081.Vss总失效时间                            $    $  分钟         $    $  ANS000.BYTE066  $  y=x1+x2*256;
  $  082.距上次失效的Vss失效时间                  $    $  分钟         $    $  ANS000.BYTE068  $  y=x1+x2*256;
  $  083.进气效率                                 $    $  %            $    $  ANS000.BYTE070  $  y=x*99.6/255;
  $  084.Charge 温度                              $    $  degree C     $    $  ANS000.BYTE071  $  y=x*191.0/255-40;
  $  085.氧传感器2传感器                          $    $  mV           $    $  ANS000.BYTE072  $  y=x*1107.0/255;
  $  086.MAP高度补偿                              $    $  kPa          $    $  ANS000.BYTE075  $  y=x*94.0/255+10.4;
  $  087.进气流量                                 $    $  g/s          $    $  ANS000.BYTE076  $  y=x1;
  $  088.转换器温度                               $    $  degree C     $    $  ANS000.BYTE077  $  y=x1*4.0/255+x2*4;
  $  089.燃油消耗累计                             $    $  毫秒         $    $  ANS000.BYTE079  $  y=x*133693.0/255;

;******************************************************************************************************************************************************

动作测试:

$^ 00.故障指示灯 
$^IN  REQ00: 83 11 F1 30 01 01 B7 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 01 07 FF BD     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 01 07 00 BE     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 01 00 B6     $^

;----------------------------------------------------------------------------------------------------

$^ 01.碳罐控制阀(CCP) 
$^IN  REQ00: 83 11 F1 30 02 01 B8 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 02 07 FF BE     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 02 07 00 BF     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 02 00 B7     $^

;----------------------------------------------------------------------------------------------------

$^ 02.燃油泵继电器 
$^IN  REQ00: 83 11 F1 30 03 01 B9 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 03 07 FF BF     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 03 07 00 C0     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 03 00 B8     $^

;----------------------------------------------------------------------------------------------------

$^ 03.空调离合器 
$^IN  REQ00: 83 11 F1 30 06 01 BC 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 06 07 FF C2     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 06 07 00 C3     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 06 00 BB     $^

;----------------------------------------------------------------------------------------------------

$^ 04.低速风扇 
$^IN  REQ00: 83 11 F1 30 08 01 BE 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 08 07 FF C4     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 08 07 00 C5     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 08 00 BD     $^

;----------------------------------------------------------------------------------------------------

$^ 05.高速风扇 
$^IN  REQ00: 83 11 F1 30 09 01 BF 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 09 07 FF C5     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 09 07 00 C6     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 09 00 BE     $^

;----------------------------------------------------------------------------------------------------

$^ 06.闭合时间 
$^IN  REQ00: 84 11 F1 30 80 07 0B 48     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 80 07 XX 48     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 80 00 35     $^

$^DSP:闭合时间
$^TIP:请输入闭合时间,范围0~21:  
$^IN_F:y=x*247/21;
$^RANGE:0,21
;----------------------------------------------------------------------------------------------------

$^ 07.点火提前角 
$^IN  REQ00: 84 11 F1 30 81 07 02 40     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 81 07 XX 40     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 81 00 36     $^

$^DSP:点火提前角->°
$^TIP:请输入点火提前角,范围-90~89:  
$^IN_F:y=(x+90)*128/90;
$^RANGE:-90,89
;----------------------------------------------------------------------------------------------------

$^ 08.非行驶中怠速调整 
$^IN  REQ00: 84 11 F1 30 82 07 FE 3D     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 82 07 XX 3D     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 82 00 37     $^

$^DSP:非行驶中怠速调整->rpm
$^TIP:请输入非行驶中怠速调整,范围0~3187:  
$^IN_F:y=(x1*256+x2)*254/3187;
$^RANGE:0,3187
;----------------------------------------------------------------------------------------------------

$^ 09.目标怠速 
$^IN  REQ00: 84 11 F1 30 83 07 FE 3E     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 83 07 XX 3E     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 83 00 37     $^

$^DSP:目标怠速->rpm
$^TIP:请输入目标怠速,范围0~3187:  
$^IN_F:y=(x1*256+x2)*254/3187;
$^RANGE:0,3187
;----------------------------------------------------------------------------------------------------

$^ 10.空燃比 
$^IN  REQ00: 84 11 F1 30 84 07 FA 3B     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 84 07 XX 3B     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 84 00 39     $^

$^DSP:空燃比->%
$^TIP:请输入空燃比,范围0~25:  
$^IN_F:y=x*10;
$^RANGE:0,25
;----------------------------------------------------------------------------------------------------

$^ 11.废气再循环(EGR)占空比 
$^IN  REQ00: 84 11 F1 30 85 07 FD 3F     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 85 07 XX 3F     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 85 00 3A     $^

$^DSP:废气再循环(EGR)占空比->%
$^TIP:请输入废气再循环(EGR)占空比,范围0~99:  
$^IN_F:y=x*253/99;
$^RANGE:0,99
;----------------------------------------------------------------------------------------------------

$^ 12.汽缸充气率 
$^IN  REQ00: 84 11 F1 30 86 07 FD 40     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 86 07 XX 40     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 86 00 3B     $^

$^DSP:汽缸充气率->%
$^TIP:请输入汽缸充气率,范围0~99:  
$^IN_F:y=x*253/99;
$^RANGE:0,99
;----------------------------------------------------------------------------------------------------

$^ 13.怠速空气控制 
$^IN  REQ00: 84 11 F1 30 87 07 FF 43     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 87 07 XX 43     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 87 00 3C     $^

$^DSP:怠速空气控制
$^TIP:请输入怠速空气控制,范围0~255:  
$^IN_F:y=x;
$^RANGE:0,255
;----------------------------------------------------------------------------------------------------

$^ 14.碳罐控制阀占空比 
$^IN  REQ00: 84 11 F1 30 88 07 FD 42     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 88 07 XX 42     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 88 00 3D     $^

$^DSP:碳罐控制阀占空比->%
$^TIP:请输入碳罐控制阀占空比,范围0~99:  
$^IN_F:y=x*253/99;
$^RANGE:0,99
;----------------------------------------------------------------------------------------------------

$^ 15.行驶中怠速调整 
$^IN  REQ00: 84 11 F1 30 88 07 FD 42     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 89 07 XX 44     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 89 00 3E     $^

$^DSP:行驶中怠速调整->rpm
$^TIP:请输入行驶中怠速调整,范围0~3187:  
$^IN_F:y=(x1*256+x2)*254/3187;
$^RANGE:0,3187
;----------------------------------------------------------------------------------------------------

$^ 16.点火开关 A 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E1 07 01 9F     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E1 00 96     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E1 00 96     $^

;----------------------------------------------------------------------------------------------------

$^ 17.点火开关 B 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E1 07 02 A0     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E1 00 96     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E1 00 96     $^

;----------------------------------------------------------------------------------------------------

$^ 18.点火开关 C 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E1 07 03 A1     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E1 00 96     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E1 00 96     $^

;----------------------------------------------------------------------------------------------------

$^ 19.点火开关 D 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E1 07 04 A2     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E1 00 96     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E1 00 96     $^

;----------------------------------------------------------------------------------------------------

$^ 20.喷油嘴 1 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E2 07 01 A0     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E2 00 97     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E2 00 97     $^

;----------------------------------------------------------------------------------------------------

$^ 21.喷油嘴 2 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E2 07 02 A0     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E2 00 97     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E2 00 97     $^

;----------------------------------------------------------------------------------------------------

$^ 22.喷油嘴 3 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E2 07 03 A2     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E2 00 97     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E2 00 97     $^

;----------------------------------------------------------------------------------------------------

$^ 23.喷油嘴 4 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 E2 07 04 A3     $^

$^BUTTON:关闭 
$^REQ00: 83 11 F1 30 E2 00 97     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E2 00 97     $^

;----------------------------------------------------------------------------------------------------

$^ 24.怠速空气控制自学习值复位 
$^TYPE0
$^BUTTON:动作执行 
$^REQ00: 83 11 F1 30 F0 04 A9     $^

;----------------------------------------------------------------------------------------------------

$^ 25.氧BLM单元复位 
$^TYPE0
$^BUTTON:动作执行 
$^REQ00: 83 11 F1 30 F1 04 AA     $^

;----------------------------------------------------------------------------------------------------

$^ 26.KCS单元复位 
$^TYPE0
$^BUTTON:动作执行 
$^REQ00: 83 11 F1 30 F2 04 AB     $^

;----------------------------------------------------------------------------------------------------

