
    车型ID：a312

    模拟：协议模拟-->a312

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

$JSON{"P4":5}

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
	<param type="string" value="1"/>
	<param type="string" value="3,11,1,12,8"/>
	</ACTIVE_ADDNODE>
</VCI>

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 00 00 9E       $#  ANS000:84 11 F1 18 00 00 00 9E

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a3120000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 00 00 99       $$  ANS000:83 11 F1 14 00 00 99

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 80 1E       $%  ANS000:82 11 F1 1A 80 1E

  $%  000:车辆识别号:          $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:客户ECU编号:         $%    $%  ANS000.BYTE022  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:系统软件号:          $%    $%  ANS000.BYTE052  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  003:车型信息:            $%    $%  ANS000.BYTE064  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:引擎类型:            $%    $%  ANS000.BYTE072  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  005:测试序列号:          $%    $%  ANS000.BYTE078  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  006:编程日期:            $%    $%  ANS000.BYTE088  $%  HEX(x1,x2,x3,x4);
  $%  007:诊断系统标识:        $%    $%  ANS000.BYTE092  $%  HEX(x1,x2);
  $%  008:数据文件编号:        $%    $%  ANS000.BYTE094  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  009:联电硬件编号:        $%    $%  ANS000.BYTE122  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.蓄电池电压                   $    $  V            $    $  ANS000.BYTE036  $  y=x1*18.7/255;
  $  001.发动机转速                   $    $  rpm          $    $  ANS000.BYTE037  $  y=x2*63/255+x1*16320/255;
  $  002.目标怠速                     $    $  rpm          $    $  ANS000.BYTE039  $  y=x1*10;
  $  003.汽车速度                     $    $  km/h         $    $  ANS000.BYTE041  $  y=x1;
  $  004.进气压力                     $    $  hPa          $    $  ANS000.BYTE052  $  y=x1*10;
  $  005.进气温度                     $    $  degree C     $    $  ANS000.BYTE046  $  y=x1-40;
  $  006.进气量                       $    $  kg/h         $    $  ANS000.BYTE053  $  y=x1*6528.0/255+x2*0.1;
  $  007.冷却液温度                   $    $  degree C     $    $  ANS000.BYTE044  $  y=x1-40;
  $  008.节气门位置                   $    $  %            $    $  ANS000.BYTE060  $  y=x1*100/255;
  $  009.步进电机目标位置             $    $               $    $  ANS000.BYTE055  $  y=x1;
  $  010.前氧传感器电压               $    $  mV           $    $  ANS000.BYTE089  $  y=x1*4980.4/255;
  $  011.后氧传感器电压               $    $  mV           $    $  ANS000.BYTE090  $  y=x1*4980.4/255;
  $  012.氧传感器短期修正             $    $               $    $  ANS000.BYTE087  $  y=x1*1.99/255;
  $  013.氧传感器长期修正             $    $               $    $  ANS000.BYTE093  $  y=x1*1.99/255;
  $  014.碳罐阀占空比                 $    $  degree C     $    $  ANS000.BYTE065  $  y=x1*99/255;
  $  015.喷油脉宽                     $    $  ms           $    $  ANS000.BYTE070  $  y=x1*25/255;
  $  016.1缸点火提前角                $    $  °           $    $  ANS000.BYTE071  $  y=x1*128/255-64;
  $  017.燃油容积流量                 $    $  L/H          $    $  ANS000.BYTE075  $  if(x==0x36)y=1;else y=0;
  $  018.碳罐相对喷油量               $    $  degree C     $    $  ANS000.BYTE106  $  if(x1<0x80) y=x1*1524/127+x2*11/255;else y=x1*1524/127-3059+x2*11/255;
  $  019.怠速扭矩自学习               $    $  %            $    $  ANS000.BYTE102  $  if(x1<0x80) y=x1*99/127;else y=x1*99/127-198;
  $  020.怠速转速控制扭矩修正         $    $  degree C     $    $  ANS000.BYTE104  $  if(x1<0x80) y=x1*99/127;else y=x1*99/127-198;
  $  021.里程累计数                   $    $  km           $    $  ANS000.BYTE111  $  y=x1*16777216+x2*65536+x3*256+x4;
  $  022.运转时间                     $    $  分钟         $    $  ANS000.BYTE115  $  y=x1*16777216+x2*65536+x3*256+x4;
  $  023.冷却风扇#1                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x01) y=@00c3;else y=@00c4;
  $  024.冷却风扇#2                   $    $               $    $  ANS000.BYTE024  $  if(x1&0x02) y=@00c3;else y=@00c4;
  $  025.节气门处于怠速位置           $    $               $    $  ANS000.BYTE026  $  if(x1&0x01) y=@001b;else y=@001c;
  $  026.节气门处于全负荷位置         $    $               $    $  ANS000.BYTE026  $  if(x1&0x02) y=@001b;else y=@001c;
  $  027.激活减速断油                 $    $               $    $  ANS000.BYTE026  $  if(x1&0x08) y=@001b;else y=@001c;
  $  028.激活加速加浓                 $    $               $    $  ANS000.BYTE026  $  if(x1&0x10) y=@001b;else y=@001c;
  $  029.节气门位置未知或错误         $    $               $    $  ANS000.BYTE031  $  if(x1&0x01) y=@001b;else y=@001c;
  $  030.AT转换离合器激活             $    $               $    $  ANS000.BYTE033  $  if(x1&0x08) y=@001b;else y=@001c;
  $  031.λ控制激活                   $    $               $    $  ANS000.BYTE027  $  if(x1&0x01) y=@001b;else y=@001c;
  $  032.碳罐控制阀激活               $    $               $    $  ANS000.BYTE027  $  if(x1&0x04) y=@001b;else y=@001c;
  $  033.减速断油激活                 $    $               $    $  ANS000.BYTE027  $  if(x1&0x08) y=@001b;else y=@001c;
  $  034.催化转换器保护加浓           $    $               $    $  ANS000.BYTE027  $  if(x1&0x10) y=@001b;else y=@001c;
  $  035.混合气自学习条件激活         $    $               $    $  ANS000.BYTE027  $  if(x1&0x20) y=@001b;else y=@001c;
  $  036.点火接线端15                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x01) y=@00c3;else y=@00c4;
  $  037.主继电器工作                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x02) y=@001b;else y=@001c;
  $  038.燃油泵继电器工作             $    $               $    $  ANS000.BYTE025  $  if(x1&0x04) y=@001b;else y=@001c;
  $  039.起动机工作                   $    $               $    $  ANS000.BYTE025  $  if(x1&0x08) y=@001b;else y=@001c;
  $  040.达到怠速转速                 $    $               $    $  ANS000.BYTE025  $  if(x1&0x10) y=@001b;else y=@001c;
  $  041.同步条件                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x20) y=@001b;else y=@001c;
  $  042.达到发动机工作温度           $    $               $    $  ANS000.BYTE025  $  if(x1&0x40) y=@001b;else y=@001c;
  $  043.车辆行驶                     $    $               $    $  ANS000.BYTE025  $  if(x1&0x80) y=@001b;else y=@001c;
  $  044.氧传感器1信号浓              $    $               $    $  ANS000.BYTE028  $  if(x1&0x01) y=@001b;else y=@001c;
  $  045.氧传感器2信号稀              $    $               $    $  ANS000.BYTE028  $  if(x1&0x02) y=@001b;else y=@001c;
  $  046.氧传感器1加热激活            $    $               $    $  ANS000.BYTE028  $  if(x1&0x10) y=@001b;else y=@001c;
  $  047.氧传感器2加热激活            $    $               $    $  ANS000.BYTE028  $  if(x1&0x20) y=@001b;else y=@001c;
  $  048.空调请求激活                 $    $               $    $  ANS000.BYTE032  $  if(x1&0x02) y=@001b;else y=@001c;
  $  049.空调压缩机                   $    $               $    $  ANS000.BYTE032  $  if(x1&0x04) y=@00c4;else y=@00c3;
  $  050.空调断开或无空调             $    $               $    $  ANS000.BYTE032  $  if(x1&0x08) y=@001b;else y=@001c;
  $  051.空调因温度断开               $    $               $    $  ANS000.BYTE032  $  if(x1&0x10) y=@001b;else y=@001c;
  $  052.怠速转速因空调而增加         $    $               $    $  ANS000.BYTE032  $  if(x1&0x20) y=@001b;else y=@001c;
  $  053.因全负荷关闭空调压缩机       $    $               $    $  ANS000.BYTE032  $  if(x1&0x40) y=@001b;else y=@001c;
  $  054.空调中压开关                 $    $               $    $  ANS000.BYTE032  $  if(x1&0x80) y=@001b;else y=@001c;
  $  055.故障指示灯激活               $    $               $    $  ANS000.BYTE030  $  if(x1&0x01) y=@001b;else y=@001c;
  $  056.故障指示灯闪烁               $    $               $    $  ANS000.BYTE030  $  if(x1&0x02) y=@001b;else y=@001c;
  $  057.立即检修灯激活               $    $               $    $  ANS000.BYTE030  $  if(x1&0x10) y=@001b;else y=@001c;
  $  058.立即检修灯闪烁               $    $               $    $  ANS000.BYTE030  $  if(x1&0x20) y=@001b;else y=@001c;
  $  059.立即检修灯存在故障           $    $               $    $  ANS000.BYTE030  $  if(x1&0x40) y=@001b;else y=@001c;
  $  060.氧传感器1短期修正            $    $  %            $    $  ANS000.BYTE087  $  y=x1*199/255;
  $  061.氧传感器2长期修正            $    $  %            $    $  ANS000.BYTE093  $  y=x1*1.99/255;

;******************************************************************************************************************************************************

动作测试:

$^ 00.故障指示灯 
$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 10 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 10 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 10 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.车辆立即维修指示灯(SVS) 
$^IN  REQ00: 83 11 F1 30 18 01 CE 00     $^IN  

$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 18 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 18 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 18 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.燃油泵继电器 
$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 12 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 12 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 12 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 03.空调离合器 
$^IN  REQ00: 83 11 F1 30 15 01 CB 00     $^IN  

$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 15 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 15 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 15 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 04.冷却风扇继电器1 
$^IN  REQ00: 83 11 F1 30 13 01 C9 00     $^IN  

$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 13 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 13 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 13 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 05.冷却风扇继电器2 
$^IN  REQ00: 83 11 F1 30 14 01 CA 00     $^IN  

$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 14 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 14 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 14 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 06.步进电机执行器 
$^IN  REQ00: 83 11 F1 30 38 01 EE 00     $^IN  

$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 38 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 38 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 38 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 07.设置步进电机位置 
$^IN  REQ00: 83 11 F1 30 37 01 ED 00     $^IN  

$^TYPE0
$^BUTTON:开 
$^REQ00: 84 11 F1 30 37 07 FF 00     $^

$^BUTTON:关 
$^REQ00: 84 11 F1 30 37 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 37 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 08.怠速转速控制 
$^IN  REQ00: 84 11 F1 30 24 07 FF E0     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 24 07 XX E0     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 24 00 D9     $^

$^DSP:怠速转速控制->rpm
$^TIP:请输入怠速转速控制值,范围800~2500(转/分):  
$^IN_F:y=(x1*256+x2)/10;
$^RANGE:0,2550
;----------------------------------------------------------------------------------------------------

$^ 09.碳罐控制阀(CCP) 
$^IN  REQ00: 84 11 F1 30 11 05 64 30     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 11 05 XX 30     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 11 00 C6     $^

$^DSP:碳罐控制阀(CCP)
$^TIP:请输入碳罐控制阀值,范围0~100:  
$^IN_F:y=x;
$^RANGE:0,100
;----------------------------------------------------------------------------------------------------

$^ 10.禁用燃油喷射控制 
$^TYPE0
$^BUTTON:禁止#1缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 01 00     $^
$^REQ01: 85 11 F1 30 20 07 FF 02 00     $^
$^REQ02: 85 11 F1 30 20 07 FF 03 00     $^
$^REQ03: 85 11 F1 30 20 07 FF 04 00     $^
$^REQ04: 85 11 F1 30 20 07 00 01 00     $^

$^BUTTON:禁止#2缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 01 00     $^
$^REQ01: 85 11 F1 30 20 07 FF 02 00     $^
$^REQ02: 85 11 F1 30 20 07 FF 03 00     $^
$^REQ03: 85 11 F1 30 20 07 FF 04 00     $^
$^REQ04: 85 11 F1 30 20 07 00 02 00     $^

$^BUTTON:禁止#3缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 01 00     $^
$^REQ01: 85 11 F1 30 20 07 FF 02 00     $^
$^REQ02: 85 11 F1 30 20 07 FF 03 00     $^
$^REQ03: 85 11 F1 30 20 07 FF 04 00     $^
$^REQ04: 85 11 F1 30 20 07 00 03 00     $^

$^BUTTON:禁止#4缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 01 00     $^
$^REQ01: 85 11 F1 30 20 07 FF 02 00     $^
$^REQ02: 85 11 F1 30 20 07 FF 03 00     $^
$^REQ03: 85 11 F1 30 20 07 FF 04 00     $^
$^REQ04: 85 11 F1 30 20 07 00 04 00     $^

$^BUTTON:启动#1缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 01 00     $^

$^BUTTON:启动#2缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 02 00     $^

$^BUTTON:启动#3缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 03 00     $^

$^BUTTON:启动#4缸喷射 
$^REQ00: 85 11 F1 30 20 07 FF 04 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 20 00 00     $^

;----------------------------------------------------------------------------------------------------

