
    车型ID：a321

    模拟：协议模拟-->a321

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

$JSON{"P4":5}

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
	<param type="string" value="1"/>
	<param type="string" value="3,11,1,12,8,2,15,6,9,13"/>
	</ACTIVE_ADDNODE>
</VCI>

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 FF 00 9D       $#  ANS000:84 11 F1 18 00 FF 00 9D

		控制公式：
			y=(x1<<8)+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE6$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/feff0000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="10"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 FF 00 98       $$  ANS000:83 11 F1 14 FF 00 98

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 80 1E       $%  ANS000:82 11 F1 1A 80 1E

  $%  000:VIN:                          $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:制造商硬件编号:               $%    $%  ANS000.BYTE022  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  002:系统供应商ECU硬件编号:        $%    $%  ANS000.BYTE033  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);
  $%  003:软件版本:                     $%    $%  ANS000.BYTE053  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  004:系统名称或引擎类型:           $%    $%  ANS000.BYTE063  $%  ASCII(x1,x2,x3,x4,x5,x6);
  $%  005:编程日期:                     $%    $%  ANS000.BYTE079  $%  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $%  006:系统硬件号:                   $%    $%  ANS000.BYTE033  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 11 F1 21 01 A6       $  ANS000:82 11 F1 21 01 A6

  $  000.发动机转速                                  $    $  rpm               $    $  ANS000.BYTE042  $  y=x1*256+x2;
  $  001.蓄电池电压                                  $    $  V                 $    $  ANS000.BYTE023  $  y=x1*0.1;
  $  002.目标怠速                                    $    $  rpm               $    $  ANS000.BYTE048  $  y=x1*3188/255;
  $  003.进气歧管压力                                $    $  kPa               $    $  ANS000.BYTE022  $  y=x1*94.0/255+10.4;
  $  004.冷却液温度                                  $    $  degree C          $    $  ANS000.BYTE027  $  y=x1*191/255-40;
  $  005.点火提前角                                  $    $  °                $    $  ANS000.BYTE028  $  y=x1*179/255-90;
  $  006.喷油脉宽                                    $    $  毫秒              $    $  ANS000.BYTE044  $  y=x1*522.0/255+x2*2.0/255;
  $  007.进气流量                                    $    $  g/s               $    $  ANS000.BYTE089  $  y=x1;
  $  008.车速                                        $    $  km/h              $    $  ANS000.BYTE041  $  y=x1;
  $  009.运行里程                                    $    $  km                $    $  ANS000.BYTE068  $  y=x1*3355443.2+x2*13107.2+x3*51.2+x4*0.2;
  $  010.本次引擎运行时间                            $    $  秒                $    $  ANS000.BYTE073  $  y=x1*256+x2;
  $  011.进气温度                                    $    $  degree C          $    $  ANS000.BYTE025  $  y=x1*191/255-40;
  $  012.大气压强                                    $    $  kPa               $    $  ANS000.BYTE072  $  y=x1*94.1/255+10.3;
  $  013.EOBD进气流量                                $    $  g/s               $    $  ANS000.BYTE096  $  y=x1*2+x2*2.0/255;
  $  014.氧稀转浓平均时间                            $    $  秒                $    $  ANS000.BYTE102  $  y=x1*0.5+x2*0.5/255;
  $  015.氧浓转稀平均时间                            $    $  秒                $    $  ANS000.BYTE104  $  y=x1*0.5+x2*0.5/255;
  $  016.VSS总失效时间                               $    $  分钟              $    $  ANS000.BYTE079  $  y=x1*256+x2;
  $  017.VSS距上次失效时间                           $    $  分钟              $    $  ANS000.BYTE081  $  y=x1*256+x2;
  $  018.前蒸发器温度                                $    $  degree C          $    $  ANS000.BYTE077  $  y=x1*191/255-40;
  $  019.后蒸发器温度                                $    $  degree C          $    $  ANS000.BYTE078  $  y=x1*191/255-40;
  $  020.进气效率                                    $    $  %                 $    $  ANS000.BYTE083  $  y=x1*99.6/255;
  $  021.燃油箱空闲比                                $    $  %                 $    $  ANS000.BYTE054  $  y=x1*99.6/255;
  $  022.空燃比                                      $    $  %                 $    $  ANS000.BYTE055  $  y=x1*0.1;
  $  023.线性EGR(废气再循环)阀设定位置               $    $  %                 $    $  ANS000.BYTE056  $  y=x1*99.6/255;
  $  024.线性EGR(废气再循环)阀实际位置               $    $  %                 $    $  ANS000.BYTE057  $  y=x1*99.6/255;
  $  025.扭矩控制最大点火提前角                      $    $  °                $    $  ANS000.BYTE063  $  y=x1*179/255-90;
  $  026.氧积分值                                    $    $                    $    $  ANS000.BYTE050  $  y=x1;
  $  027.氧气块学习电池编号                          $    $  计数              $    $  ANS000.BYTE051  $  y=x1;
  $  028.氧气交换                                    $    $  计数              $    $  ANS000.BYTE053  $  y=x1;
  $  029.TPS比率                                     $    $  %                 $    $  ANS000.BYTE040  $  y=x1*99.6/255;
  $  030.空调压力                                    $    $  kPa               $    $  ANS000.BYTE033  $  y=x1*20;
  $  031.原始歧管绝对压力(MAP)                       $    $  kPa               $    $  ANS000.BYTE024  $  y=x1*94.0/255+10.4;
  $  032.1缸ESC推迟                                  $    $                    $    $  ANS000.BYTE035  $  y=x1*89.6/255;
  $  033.2缸ESC推迟                                  $    $                    $    $  ANS000.BYTE036  $  y=x1*89.6/255;
  $  034.3缸ESC推迟                                  $    $                    $    $  ANS000.BYTE037  $  y=x1*89.6/255;
  $  035.4缸ESC推迟                                  $    $                    $    $  ANS000.BYTE038  $  y=x1*89.6/255;
  $  036.充电温度过滤                                $    $  degree C          $    $  ANS000.BYTE084  $  y=x1*191/255-40;
  $  037.歧管绝对压力(MAP)高度补偿                   $    $  kPa               $    $  ANS000.BYTE088  $  y=x1*94.0/255+10.4;
  $  038.转换器温度过滤                              $    $  degree C          $    $  ANS000.BYTE090  $  y=x1*4+x2*4/255+200;
  $  039.累积的油耗                                  $    $  毫秒              $    $  ANS000.BYTE092  $  y=(x1*34224998+x2*133691)/255;
  $  040.车辆加速度                                  $    $  g(重力加速度)     $    $  ANS000.BYTE094  $  y=x1*5.0/255;
  $  041.空气流量积分                                $    $  %                 $    $  ANS000.BYTE047  $  y=x1*99.6/255;
  $  042.电子稳定系统(ESC)1 模数转换换算(伏特)       $    $  mV                $    $  ANS000.BYTE034  $  y=x1*4980.2/255;
  $  043.TPS电压                                     $    $  mV                $    $  ANS000.BYTE039  $  y=x1*4980.2/255;
  $  044.怠速进气控制                                $    $  步幅              $    $  ANS000.BYTE046  $  y=x1;
  $  045.氧传感器1电压                               $    $  mV                $    $  ANS000.BYTE049  $  y=x1*1127.1/255;
  $  046.原始MAT                                     $    $  mV                $    $  ANS000.BYTE064  $  y=x1*4980.0/255;
  $  047.线性EGR(废气再循环)阀传感器电压             $    $  mV                $    $  ANS000.BYTE067  $  y=x1*4980.0/255;
  $  048.氧传感器2电压                               $    $  mV                $    $  ANS000.BYTE085  $  y=x1*1107.0/255;
  $  049.BLM平均值(组1)                              $    $                    $    $  ANS000.BYTE098  $  y=x1*2.0/255;
  $  050.积分器平均值(组1)                           $    $                    $    $  ANS000.BYTE100  $  y=x1*2.0/255;
  $  051.总失火数                                    $    $  次                $    $  ANS000.BYTE106  $  y=x1*256+x2;
  $  052.失火延迟原因                                $    $  次                $    $  ANS000.BYTE108  $  y=x1;
  $  053.失火启用标准                                $    $  次                $    $  ANS000.BYTE109  $  y=x1;
  $  054.输出状态检查(OSC)时间                       $    $  秒                $    $  ANS000.BYTE110  $  y=x1*4+x2*4/255;
  $  055.ICMD中止原因                                $    $  次                $    $  ANS000.BYTE112  $  y=x1*256+x2;
  $  056.燃油闭环                                    $    $                    $    $  ANS000.BYTE058  $  if(x&0x01) y=@000e; else y=@000f;
  $  057.前氧传感器稀浓状态                          $    $                    $    $  ANS000.BYTE058  $  if(x&0x02) y=@001d; else y=@001e;
  $  058.BLM自学习状态                               $    $                    $    $  ANS000.BYTE058  $  if(x&0x04) y=@000e; else y=@000f;
  $  059.溢油清除模式状态                            $    $                    $    $  ANS000.BYTE058  $  if(x&0x08) y=@000e; else y=@000f;
  $  060.功率增强模式状态                            $    $                    $    $  ANS000.BYTE058  $  if(x&0x10) y=@000e; else y=@000f;
  $  061.DFCO模式状态                                $    $                    $    $  ANS000.BYTE058  $  if(x&0x20) y=@000e; else y=@000f;
  $  062.MAPCID第一第二次相同                        $    $                    $    $  ANS000.BYTE058  $  if(x&0x40) y=@001c; else y=@001b;
  $  063.暖机过程                                    $    $                    $    $  ANS000.BYTE058  $  if(x&0x80) y=@001b; else y=@001c;
  $  064.扭矩控制模式状态                            $    $                    $    $  ANS000.BYTE059  $  if(x&0x01) y=@000e; else y=@000f;
  $  065.线性EGR(废气再循环)阀测试完成               $    $                    $    $  ANS000.BYTE059  $  if(x&0x02) y=@001c; else y=@001b;
  $  066.变速器档位                                  $    $                    $    $  ANS000.BYTE059  $  if(x&0x04) y=@08ca; else y=@08cb;
  $  067.油泵继电器状态                              $    $                    $    $  ANS000.BYTE059  $  if(x&0x08) y=@0001; else y=@0000;
  $  068.非易失性存储器是否正常                      $    $                    $    $  ANS000.BYTE059  $  if(x&0x10) y=@001c; else y=@001b;
  $  069.ICA闭环模式状态                             $    $                    $    $  ANS000.BYTE059  $  if(x&0x40) y=@000e; else y=@000f;
  $  070.ICA调节状态                                 $    $                    $    $  ANS000.BYTE059  $  if(x&0x80) y=@000e; else y=@000f;
  $  071.AC WOT禁止模式状态                          $    $                    $    $  ANS000.BYTE060  $  if(x&0x01) y=@000e; else y=@000f;
  $  072.AC大负荷禁止模式状态                        $    $                    $    $  ANS000.BYTE060  $  if(x&0x02) y=@000e; else y=@000f;
  $  073.后环螺线管关断状态                          $    $                    $    $  ANS000.BYTE060  $  if(x&0x04) y=@000e; else y=@000f;
  $  074.IAC位置正常                                 $    $                    $    $  ANS000.BYTE060  $  if(x&0x08) y=@001c; else y=@001b;
  $  075.有AC请求                                    $    $                    $    $  ANS000.BYTE060  $  if(x&0x10) y=@001c; else y=@001b;
  $  076.AC压力                                      $    $                    $    $  ANS000.BYTE060  $  if(x&0x20) y=@08cd; else y=@08cc;
  $  077.AC继电器状态                                $    $                    $    $  ANS000.BYTE060  $  if(x&0x40) y=@0001; else y=@0000;
  $  078.AC是否使用                                  $    $                    $    $  ANS000.BYTE060  $  if(x&0x80) y=@001b; else y=@001c;
  $  079.冷却风扇1状态                               $    $                    $    $  ANS000.BYTE061  $  if(x&0x01) y=@0001; else y=@0000;
  $  080.冷却风扇2状态                               $    $                    $    $  ANS000.BYTE061  $  if(x&0x02) y=@0001; else y=@0000;
  $  081.氧传感器加热器A                             $    $                    $    $  ANS000.BYTE061  $  if(x&0x08) y=@0001; else y=@0000;
  $  082.点火开关                                    $    $                    $    $  ANS000.BYTE061  $  if(x&0x10) y=@0001; else y=@0000;
  $  083.发动机检测灯                                $    $                    $    $  ANS000.BYTE061  $  if(x&0x20) y=@0001; else y=@0000;
  $  084.变速器状态                                  $    $                    $    $  ANS000.BYTE061  $  if(x&0x40) y=@08ce; else y=@08cf;
  $  085.ESC状态                                     $    $                    $    $  ANS000.BYTE061  $  if(x&0x80) y=@000e; else y=@000f;
  $  086.喷油器A电压状态                             $    $                    $    $  ANS000.BYTE065  $  switxh(x&0x03)0: y=@0045;1:y=@08cc;2:y=@08cd;3:y=@0002;default:y=@007f;
  $  087.喷油器B电压状态                             $    $                    $    $  ANS000.BYTE065  $  switxh(x&0x0C)0: y=@0045;4:y=@08cc;8:y=@08cd;0x0C:y=@0002;default:y=@007f;
  $  088.喷油器C电压状态                             $    $                    $    $  ANS000.BYTE065  $  switxh(x&0x30)0x00: y=@0045;0x10:y=@08cc;0x20:y=@08cd;0x30:y=@0002;default:y=@007f;
  $  089.喷油器D电压状态                             $    $                    $    $  ANS000.BYTE065  $  switxh(x&0xC0)0x00: y=@0045;0x40:y=@08cc;0x80:y=@08cd;0xC0:y=@0002;default:y=@007f;
  $  090.是否达到怠速条件                            $    $                    $    $  ANS000.BYTE066  $  switxh(x&0x03)0: y=@001c;1:y=@001b;default:y=@0002;
  $  091.怠速是否使能                                $    $                    $    $  ANS000.BYTE066  $  switxh(x&0x07)0: y=@001c;1: y=@001c;2:y=@001b;3:y=@001b;default:y=@0002;
  $  092.ELOAD1状态                                  $    $                    $    $  ANS000.BYTE066  $  if(x&0x04) y=@000e; else y=@000f;
  $  093.ELOAD2状态                                  $    $                    $    $  ANS000.BYTE066  $  if(x&0x08) y=@000e; else y=@000f;
  $  094.前蒸汽阀传感器是否启用                      $    $                    $    $  ANS000.BYTE066  $  if(x&0x10) y=@001b; else y=@001c;
  $  095.后蒸汽阀传感器是否启用                      $    $                    $    $  ANS000.BYTE066  $  if(x&0x20) y=@001b; else y=@001c;
  $  096.后环切割线圈是否启用                        $    $                    $    $  ANS000.BYTE066  $  if(x&0x40) y=@001b; else y=@001c;
  $  097.AC传感器是否启用                            $    $                    $    $  ANS000.BYTE066  $  if(x&0x80) y=@001b; else y=@001c;

;******************************************************************************************************************************************************

动作测试:

$^ 00.发动机故障(MIL)指示灯控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 01 07 FF 00     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 01 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 01 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.碳罐控制阀控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 02 07 FF 00     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 02 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 02 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.燃油泵继电器控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 03 07 FF 00     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 03 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 03 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 03.空调离合器控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 06 07 FF 00     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 06 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 06 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 04.冷却风扇#1控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 08 07 FF 00     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 08 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 08 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 05.冷却风扇#2控制 
$^TYPE0
$^BUTTON:打开 
$^REQ00: 84 11 F1 30 09 07 FF 00     $^

$^BUTTON:关闭 
$^REQ00: 84 11 F1 30 09 07 00 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 09 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 06.怠速转速控制 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 82 07 XX 00     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 82 00 00     $^

$^DSP:怠速转速控制->rpm
$^TIP:请输入测试值(范围:500~2500) 
$^IN_F:y=((x1<<8)+x2)/12.5;
$^RANGE:500,2500
;----------------------------------------------------------------------------------------------------

$^ 07.目标怠速转速控制 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 83 07 XX 00     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 83 00 00     $^

$^DSP:目标怠速转速控制->rpm
$^TIP:请输入测试值(范围:500~2000) 
$^IN_F:y=((x1<<8)+x2)/12.5;
$^RANGE:500,2000
;----------------------------------------------------------------------------------------------------

$^ 08.空燃比控制 
 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 11 F1 30 84 07 XX 00     $^

$^BUTTON:退出
$^REQ00: 83 11 F1 30 84 00 00     $^

$^DSP:空燃比控制->%
$^TIP:请输入测试值(范围:0~25) 
$^IN_F:y=x1*10;
$^RANGE:0,25
;----------------------------------------------------------------------------------------------------

$^ 09.禁用燃油喷射控制 
$^TYPE0
$^BUTTON:#1缸 
$^REQ00: 84 11 F1 30 E2 07 00 00     $^

$^BUTTON:#2缸 
$^REQ00: 84 11 F1 30 E2 07 01 00     $^

$^BUTTON:#3缸 
$^REQ00: 84 11 F1 30 E2 07 02 00     $^

$^BUTTON:#4缸 
$^REQ00: 84 11 F1 30 E2 07 03 00     $^

$^BUTTON:退出 
$^REQ00: 83 11 F1 30 E2 00 00     $^

;----------------------------------------------------------------------------------------------------

