
    车型ID：a404

    模拟：协议模拟-->a404

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

$JSON{"P4":5}

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
	<param type="string" value="1"/>
	<param type="string" value="3,11,1,12,8,2,15,6,9,13"/>
	</ACTIVE_ADDNODE>
</VCI>

进入命令:

  $~  REQ000:81 02 F1 81 F5       $~  ANS000:81 02 F1 81 F5

空闲命令:

  $!  REQ000:81 02 F1 3E B2       $!  ANS000:81 02 F1 3E B2

退出命令:

  $@  REQ000:81 02 F1 82 F6       $@  ANS000:81 02 F1 82 F6


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 02 F1 18 00 FF 00 8E       $#  ANS000:84 02 F1 18 00 FF 00 8E

		控制公式：
			y=x1*256+x2;

  ANS000.BYTE04 控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/a4040000_2BYTE


<RDTC>
  <FUNCTION type="0" num="0">
     <param type="string" value="1"/>
   </FUNCTION>
</RDTC>

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 02 F1 14 FF 00 89       $$  ANS000:83 02 F1 14 FF 00 89

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 02 F1 1A 92 21       $%  ANS000:82 02 F1 1A 92 21
  $%  REQ001:82 02 F1 1A 93 22       $%  ANS001:82 02 F1 1A 93 22
  $%  REQ002:82 02 F1 1A 94 23       $%  ANS002:82 02 F1 1A 94 23
  $%  REQ003:82 02 F1 1A 95 24       $%  ANS003:82 02 F1 1A 95 24
  $%  REQ004:82 02 F1 1A 99 28       $%  ANS004:82 02 F1 1A 99 28

  $%  000:TCU(自动变速箱控制器)硬件号:            $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  001:TCU(自动变速箱控制器)硬件版本号:        $%    $%  ANS001.BYTE005  $%  y=x1;
  $%  002:TCU(自动变速箱控制器)软件号:            $%    $%  ANS002.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11);
  $%  003:TCU(自动变速箱控制器)软件版本号:        $%    $%  ANS003.BYTE005  $%  y=SPRINTF([%d.%d.%d],(x1*256+x2)/10000,(x1*256+x2)%10000/100,(x1*256+x2)%100);
  $%  004:产品更新日期:                           $%    $%  ANS004.BYTE005  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 02 F1 21 30 C6       $  ANS000:82 02 F1 21 30 C6
  $  REQ001:82 02 F1 21 31 C7       $  ANS001:82 02 F1 21 31 C7
  $  REQ002:82 02 F1 21 32 C8       $  ANS002:82 02 F1 21 32 C8
  $  REQ003:82 02 F1 21 33 C9       $  ANS003:82 02 F1 21 33 C9
  $  REQ004:82 02 F1 21 34 CA       $  ANS004:82 02 F1 21 34 CA
  $  REQ005:82 02 F1 21 35 CB       $  ANS005:82 02 F1 21 35 CB
  $  REQ006:82 02 F1 21 36 CC       $  ANS006:82 02 F1 21 36 CC
  $  REQ007:82 02 F1 21 38 CE       $  ANS007:82 02 F1 21 38 CE
  $  REQ008:82 02 F1 21 39 CF       $  ANS008:82 02 F1 21 39 CF
  $  REQ009:82 02 F1 21 3A D0       $  ANS009:82 02 F1 21 3A D0
  $  REQ010:82 02 F1 21 3B D1       $  ANS010:82 02 F1 21 3B D1
  $  REQ011:82 02 F1 21 3F D5       $  ANS011:82 02 F1 21 3F D5
  $  REQ012:82 02 F1 21 40 D6       $  ANS012:82 02 F1 21 40 D6
  $  REQ013:82 02 F1 21 42 D8       $  ANS013:82 02 F1 21 42 D8
  $  REQ014:82 02 F1 21 45 DB       $  ANS014:82 02 F1 21 45 DB
  $  REQ015:82 02 F1 21 50 E6       $  ANS015:82 02 F1 21 50 E6
  $  REQ016:82 02 F1 21 51 E7       $  ANS016:82 02 F1 21 51 E7
  $  REQ017:82 02 F1 21 53 E9       $  ANS017:82 02 F1 21 53 E9
  $  REQ018:82 02 F1 21 54 EA       $  ANS018:82 02 F1 21 54 EA
  $  REQ019:82 02 F1 21 57 ED       $  ANS019:82 02 F1 21 57 ED
  $  REQ020:82 02 F1 21 58 EE       $  ANS020:82 02 F1 21 58 EE
  $  REQ021:82 02 F1 21 59 EF       $  ANS021:82 02 F1 21 59 EF
  $  REQ022:82 02 F1 21 5A F0       $  ANS022:82 02 F1 21 5A F0
  $  REQ023:82 02 F1 21 5B F1       $  ANS023:82 02 F1 21 5B F1
  $  REQ024:82 02 F1 21 5D F3       $  ANS024:82 02 F1 21 5D F3
  $  REQ025:82 02 F1 21 5E F4       $  ANS025:82 02 F1 21 5E F4
  $  REQ026:82 02 F1 21 5F F5       $  ANS026:82 02 F1 21 5F F5
  $  REQ027:82 02 F1 21 60 F6       $  ANS027:82 02 F1 21 60 F6
  $  REQ028:82 02 F1 21 61 F7       $  ANS028:82 02 F1 21 61 F7
  $  REQ029:82 02 F1 21 62 F8       $  ANS029:82 02 F1 21 62 F8
  $  REQ030:82 02 F1 21 63 F9       $  ANS030:82 02 F1 21 63 F9
  $  REQ031:82 02 F1 21 64 FA       $  ANS031:82 02 F1 21 64 FA
  $  REQ032:82 02 F1 21 65 FB       $  ANS032:82 02 F1 21 65 FB
  $  REQ033:82 02 F1 21 67 FD       $  ANS033:82 02 F1 21 67 FD
  $  REQ034:82 02 F1 21 69 FF       $  ANS034:82 02 F1 21 69 FF
  $  REQ035:82 02 F1 21 6A 00       $  ANS035:82 02 F1 21 6A 00
  $  REQ036:82 02 F1 21 6B 01       $  ANS036:82 02 F1 21 6B 01
  $  REQ037:82 02 F1 21 6C 02       $  ANS037:82 02 F1 21 6C 02
  $  REQ038:82 02 F1 21 6D 03       $  ANS038:82 02 F1 21 6D 03
  $  REQ039:82 02 F1 21 6E 04       $  ANS039:82 02 F1 21 6E 04
  $  REQ040:82 02 F1 21 6F 05       $  ANS040:82 02 F1 21 6F 05
  $  REQ041:82 02 F1 21 70 06       $  ANS041:82 02 F1 21 70 06
  $  REQ042:82 02 F1 21 71 07       $  ANS042:82 02 F1 21 71 07
  $  REQ043:82 02 F1 21 72 08       $  ANS043:82 02 F1 21 72 08
  $  REQ044:82 02 F1 21 77 0D       $  ANS044:82 02 F1 21 77 0D
  $  REQ045:82 02 F1 21 7A 10       $  ANS045:82 02 F1 21 7A 10
  $  REQ046:82 02 F1 21 7B 11       $  ANS046:82 02 F1 21 7B 11
  $  REQ047:82 02 F1 21 7E 14       $  ANS047:82 02 F1 21 7E 14
  $  REQ048:82 02 F1 21 7F 15       $  ANS048:82 02 F1 21 7F 15
  $  REQ049:82 02 F1 21 79 0F       $  ANS049:82 02 F1 21 79 0F
  $  REQ050:82 02 F1 21 4A E0       $  ANS050:82 02 F1 21 4A E0
  $  REQ051:82 02 F1 21 4B E1       $  ANS051:82 02 F1 21 4B E1
  $  REQ052:82 02 F1 21 4C E2       $  ANS052:82 02 F1 21 4C E2
  $  REQ053:82 02 F1 21 4D E3       $  ANS053:82 02 F1 21 4D E3
  $  REQ054:82 02 F1 21 4E E4       $  ANS054:82 02 F1 21 4E E4

  $  000.换挡位置                   $    $  mm           $    $  ANS000.BYTE005  $  y=x1*2611/255+x2*10/255;
  $  001.选挡位置                   $    $  mm           $    $  ANS001.BYTE005  $  y=x1*1697/255+x2*6/255;
  $  002.离合器位置                 $    $  mm           $    $  ANS002.BYTE005  $  y=x1*2807/255+x2*10/255;
  $  003.离合器目标位置             $    $  mm           $    $  ANS003.BYTE005  $  y=x1*2807/255+x2*10/255;
  $  004.油门开度                   $    $  %            $    $  ANS004.BYTE005  $  y=x1*102/255;
  $  005.液压油压力                 $    $  bar          $    $  ANS005.BYTE005  $  y=x1;
  $  006.发动机水温                 $    $  degree C     $    $  ANS006.BYTE005  $  y=x1;
  $  007.电压                       $    $  V            $    $  ANS007.BYTE005  $  y=x1*6528/255+x2*25/255;
  $  008.发动机转速                 $    $  rpm          $    $  ANS008.BYTE005  $  y=x1*256+x2;
  $  009.离合器转速                 $    $  rpm          $    $  ANS009.BYTE005  $  y=x1*256+x2;
  $  010.车速                       $    $  km/h         $    $  ANS010.BYTE005  $  y=x1;
  $  011.发动机实际输出扭矩         $    $  牛顿米       $    $  ANS011.BYTE005  $  y=x1*256+x2;
  $  012.目标发动机输出扭矩         $    $  牛顿米       $    $  ANS012.BYTE005  $  y=x1*256+x2;
  $  013.实际档位                   $    $               $    $  ANS013.BYTE005  $  if(x1==0) y=@0833;else if(x1==1) y=@0834;else if(x1==2) y=@023c;else if(x1==3) y=@023d;else if(x1==4) y=@0835;else if(x1==5) y=@0836;else if(x1==6) y=@0837;else if(x1==7) y=@0838;else y=@007f;
  $  014.目标档位                   $    $               $    $  ANS014.BYTE005  $  if(x1==0) y=@0833;else if(x1==1) y=@0834;else if(x1==2) y=@023c;else if(x1==3) y=@023d;else if(x1==4) y=@0835;else if(x1==5) y=@0836;else if(x1==6) y=@0837;else if(x1==7) y=@0838;else y=@007f;
  $  015.离合器闭合点位置           $    $  mm           $    $  ANS015.BYTE005  $  y=x1*2807/255+x2*10/255;
  $  016.离合器啮合点位置           $    $  mm           $    $  ANS016.BYTE005  $  y=x1*2807/255+x2*10/255;
  $  017.液压油温度                 $    $  degree C     $    $  ANS017.BYTE005  $  y=x1;
  $  018.离合器温度                 $    $  degree C     $    $  ANS018.BYTE005  $  y=x1*256+x2;
  $  019.油泵工作时间               $    $  分           $    $  ANS019.BYTE005  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  020.系统工作时间               $    $  分           $    $  ANS020.BYTE005  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  021.离合器过热时间             $    $  秒           $    $  ANS021.BYTE005  $  y=x1*256+x2;
  $  022.离合器超速计数器           $    $  n°          $    $  ANS022.BYTE005  $  y=x1;
  $  023.二级安全故障次数           $    $  n°          $    $  ANS023.BYTE005  $  y=x1;
  $  024.离合器意外结合次数         $    $  n°          $    $  ANS024.BYTE005  $  y=x1;
  $  025.摘挡失败次数               $    $  n°          $    $  ANS025.BYTE005  $  y=x1;
  $  026.变速箱学习结果             $    $  n°          $    $  ANS026.BYTE005  $  if(x1==0) y=@0839;else if(x1==0x0D) y=@083a; else if(x1==0x0F) y=@083b;else y=@007f;
  $  027.电磁阀不工作时泄露         $    $  毫升/分      $    $  ANS027.BYTE005  $  y=x1*256+x2;
  $  028.电磁阀工作时泄露           $    $  毫升/分      $    $  ANS028.BYTE005  $  y=x1*256+x2;
  $  029.总换档计数器               $    $  n°          $    $  ANS029.BYTE005  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  030.挂档失败次数               $    $  n°          $    $  ANS030.BYTE005  $  y=x1;
  $  031.选挡失败次数               $    $  n°          $    $  ANS031.BYTE005  $  y=x1;
  $  032.选挡锁档次数               $    $  n°          $    $  ANS032.BYTE005  $  y=x1;
  $  033.换档杆卡滞次数             $    $  n°          $    $  ANS033.BYTE005  $  y=x1;
  $  034.模式开关卡滞次数           $    $  n°          $    $  ANS034.BYTE005  $  y=x1;
  $  035.油泵继电器卡滞次数         $    $  n°          $    $  ANS035.BYTE005  $  y=x1;
  $  036.油压过低次数               $    $  n°          $    $  ANS036.BYTE005  $  y=x1;
  $  037.油泵错误次数               $    $  n°          $    $  ANS037.BYTE005  $  y=x1;
  $  038.油泵过热次数               $    $  n°          $    $  ANS038.BYTE005  $  y=x1;
  $  039.错误使用次数               $    $  n°          $    $  ANS039.BYTE005  $  y=x1;
  $  040.电压过低次数               $    $  n°          $    $  ANS040.BYTE005  $  y=x1;
  $  041.意外脱档次数               $    $  n°          $    $  ANS041.BYTE005  $  y=x1;
  $  042.泄露过高次数               $    $  n°          $    $  ANS042.BYTE005  $  y=x1;
  $  043.成功档位自学习次数         $    $  n°          $    $  ANS043.BYTE005  $  y=x1;
  $  044.离合器打开故障次数         $    $  n°          $    $  ANS044.BYTE005  $  y=x1;
  $  045.油泵工作次数               $    $  n°          $    $  ANS045.BYTE005  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  046.离合器啮合点               $    $  mm           $    $  ANS046.BYTE005  $  y=x1*2807/255+x2*10/255;
  $  047.离合器闭合点               $    $  mm           $    $  ANS046.BYTE007  $  y=x1*2807/255+x2*10/255;
  $  048.离合器老化参数             $    $  Num          $    $  ANS046.BYTE009  $  y=x1*256+x2;
  $  049.离合器过热时间             $    $  秒           $    $  ANS046.BYTE011  $  y=x1*256+x2;
  $  050.自学习参数                 $    $  Num          $    $  ANS046.BYTE013  $  y=x1;
  $  051.快速自学习老化次数         $    $  Num          $    $  ANS046.BYTE014  $  y=x1;
  $  052.错误次数                   $    $               $    $  ANS047.BYTE005  $  y=x1;
  $  053.AUTO错误次数               $    $               $    $  ANS047.BYTE006  $  y=x1;
  $  054.ECO按钮错误次数            $    $               $    $  ANS047.BYTE007  $  y=x1;
  $  055.油泵打开次数               $    $               $    $  ANS048.BYTE005  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  056.油泵失败错误次数           $    $               $    $  ANS048.BYTE009  $  y=x1;
  $  057.油泵压力过低错误次数       $    $               $    $  ANS048.BYTE010  $  y=x1;
  $  058.油泵打开时间               $    $               $    $  ANS048.BYTE011  $  y=x1*0x1000000+x2*0x10000+x3*0x100+x4;
  $  059.油泵过热次数               $    $               $    $  ANS048.BYTE015  $  y=x1;
  $  060.系统滥用误用次数           $    $               $    $  ANS048.BYTE016  $  y=x1;
  $  061.啮合点自学习               $    $               $    $  ANS049.BYTE005  $  if(x1&0x01) y=@013e;else y=@013f;
  $  062.空档挂档次数               $    $  num          $    $  ANS050.BYTE005  $  y=x1*256+x2;
  $  063.一档挂档次数               $    $  num          $    $  ANS050.BYTE007  $  y=x1*256+x2;
  $  064.二档挂档次数               $    $  num          $    $  ANS050.BYTE009  $  y=x1*256+x2;
  $  065.三档挂档次数               $    $  num          $    $  ANS050.BYTE011  $  y=x1*256+x2;
  $  066.四档挂档次数               $    $  num          $    $  ANS050.BYTE013  $  y=x1*256+x2;
  $  067.五档挂档次数               $    $  num          $    $  ANS050.BYTE015  $  y=x1*256+x2;
  $  068.六档挂档次数               $    $  num          $    $  ANS050.BYTE017  $  y=x1*256+x2;
  $  069.倒档挂档次数               $    $  num          $    $  ANS050.BYTE019  $  y=x1*256+x2;
  $  070.空档档位内行驶距离         $    $  km           $    $  ANS051.BYTE005  $  y=x1*256+x2;
  $  071.一档档位内行驶距离         $    $  km           $    $  ANS051.BYTE007  $  y=x1*256+x2;
  $  072.二档档位内行驶距离         $    $  km           $    $  ANS051.BYTE009  $  y=x1*256+x2;
  $  073.三档档位内行驶距离         $    $  km           $    $  ANS051.BYTE011  $  y=x1*256+x2;
  $  074.四档档位内行驶距离         $    $  km           $    $  ANS051.BYTE013  $  y=x1*256+x2;
  $  075.五档档位内行驶距离         $    $  km           $    $  ANS051.BYTE015  $  y=x1*256+x2;
  $  076.六档档位内行驶距离         $    $  km           $    $  ANS051.BYTE017  $  y=x1*256+x2;
  $  077.倒档档位内行驶距离         $    $  km           $    $  ANS051.BYTE019  $  y=x1*256+x2;
  $  078.空档挂档重试次数           $    $  num          $    $  ANS052.BYTE005  $  y=x1;
  $  079.一档挂档重试次数           $    $  num          $    $  ANS052.BYTE006  $  y=x1;
  $  080.二档挂档重试次数           $    $  num          $    $  ANS052.BYTE007  $  y=x1;
  $  081.三档挂档重试次数           $    $  num          $    $  ANS052.BYTE008  $  y=x1;
  $  082.四档挂档重试次数           $    $  num          $    $  ANS052.BYTE009  $  y=x1;
  $  083.五档挂档重试次数           $    $  num          $    $  ANS052.BYTE010  $  y=x1;
  $  084.六档挂档重试次数           $    $  num          $    $  ANS052.BYTE010  $  y=x1;
  $  085.倒档挂档重试次数           $    $  num          $    $  ANS052.BYTE012  $  y=x1;
  $  086.空档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE005  $  y=x1;
  $  087.一档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE006  $  y=x1;
  $  088.二档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE007  $  y=x1;
  $  089.三档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE008  $  y=x1;
  $  090.四档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE009  $  y=x1;
  $  091.五档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE010  $  y=x1;
  $  092.六档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE010  $  y=x1;
  $  093.倒档选挡失败重试次数       $    $  num          $    $  ANS053.BYTE012  $  y=x1;
  $  094.空档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE005  $  y=x1;
  $  095.一档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE006  $  y=x1;
  $  096.二档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE007  $  y=x1;
  $  097.三档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE008  $  y=x1;
  $  098.四档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE009  $  y=x1;
  $  099.五档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE010  $  y=x1;
  $  100.六档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE010  $  y=x1;
  $  101.倒档选挡锁档重试次数       $    $  num          $    $  ANS054.BYTE012  $  y=x1;

;******************************************************************************************************************************************************

动作测试:

$^ 开关量组 
$^$^ 油泵管理 
$^TYPE0
$^BUTTON:开 
$^REQ00: 84 02 F1 30 00 07 FF AD     $^

$^BUTTON:关 
$^REQ00: 84 02 F1 30 00 07 00 AE     $^

$^BUTTON:退出 
$^REQ00: 83 02 F1 30 00 00 A6     $^

;----------------------------------------------------------------------------------------------------

$^$^ 低档电磁阀 
$^TYPE0
$^BUTTON:开 
$^REQ00: 84 02 F1 30 01 07 FF AE     $^

$^BUTTON:关 
$^REQ00: 84 02 F1 30 01 07 00 AF     $^

$^BUTTON:退出 
$^REQ00: 83 02 F1 30 01 00 A7     $^

;----------------------------------------------------------------------------------------------------

$^$^ 高档电磁阀 
$^TYPE0
$^BUTTON:开 
$^REQ00: 84 02 F1 30 02 07 FF AF     $^

$^BUTTON:关 
$^REQ00: 84 02 F1 30 02 07 00 B0     $^

$^BUTTON:退出 
$^REQ00: 83 02 F1 30 02 00 A8     $^

;----------------------------------------------------------------------------------------------------

$^$^ 蜂鸣器命令 
$^TYPE0
$^BUTTON:开 
$^REQ00: 84 02 F1 30 08 07 FF B5     $^

$^BUTTON:关 
$^REQ00: 84 02 F1 30 08 07 00 B6     $^

$^BUTTON:退出 
$^REQ00: 83 02 F1 30 08 00 AE     $^

;----------------------------------------------------------------------------------------------------

$^$^ 继电器控制 
$^TYPE0
$^BUTTON:开 
$^REQ00: 84 02 F1 30 0B 07 FF B8     $^

$^BUTTON:关 
$^REQ00: 84 02 F1 30 0B 07 00 B9     $^

$^BUTTON:退出 
$^REQ00: 83 02 F1 30 0B 00 B1     $^

;----------------------------------------------------------------------------------------------------

$^ 控制量组 
$^$^ 偶数档电磁阀 
$^IN  REQ00: 84 02 F1 30 06 07 A0 54     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 02 F1 30 03 07 XX 51     $^

$^BUTTON:退出
$^REQ00: 83 02 F1 30 03 00 A9     $^

$^DSP:偶数档电磁阀
$^TIP:请输入测试值,输入范围:0~160 
$^IN_F:y=x;
$^RANGE:0,160
;----------------------------------------------------------------------------------------------------

$^$^ 奇数档电磁阀 
$^IN  REQ00: 84 02 F1 30 06 07 A0 54     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 02 F1 30 04 07 XX 52     $^

$^BUTTON:退出
$^REQ00: 83 02 F1 30 04 00 AA     $^

$^DSP:奇数档电磁阀
$^TIP:请输入测试值,输入范围:0~160 
$^IN_F:y=x;
$^RANGE:0,160
;----------------------------------------------------------------------------------------------------

$^$^ 离合器电磁阀 
$^IN  REQ00: 84 02 F1 30 06 07 A0 54     $^IN  

 $^TYPE:2
$^BUTTON:输入
$^REQ00:84 02 F1 30 06 07 XX 54     $^

$^BUTTON:退出
$^REQ00: 83 02 F1 30 06 00 AC     $^

$^DSP:离合器电磁阀
$^TIP:请输入测试值,输入范围:0~160 
$^IN_F:y=x;
$^RANGE:0,160
;----------------------------------------------------------------------------------------------------

