
    车型ID：ad06

    模拟：协议模拟-->ad06

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k$~7E8

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00
  $~  REQ001:7E0 02 10 03 00 00 00 00 00       $~  ANS001:7E8 02 10 03 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:

  $@  REQ000:7E0 02 10 01 00 00 00 00 00       $@  ANS000:7E8 02 10 01 00 00 00 00 00


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 02 19 FF 00 00 00 00 00       $#  ANS000:7E8 02 19 FF 00 00 00 00 00

		控制公式：
			y=(x1<<16)+(x2<<8)+x3;

  帧长控制故障码个数，从$#ANS000.BYTE5$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/fe000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 92 00 00 00 00       $%  ANS000:7E8 03 22 F1 92 00 00 00 00
  $%  REQ001:7E0 03 22 F1 94 00 00 00 00       $%  ANS001:7E8 03 22 F1 94 00 00 00 00
  $%  REQ002:7E0 03 22 F1 95 00 00 00 00       $%  ANS002:7E8 03 22 F1 95 00 00 00 00
  $%  REQ003:7E0 03 22 F1 99 00 00 00 00       $%  ANS003:7E8 03 22 F1 99 00 00 00 00
  $%  REQ004:7E0 03 22 F1 90 00 00 00 00       $%  ANS004:7E8 03 22 F1 90 00 00 00 00

  $%  000:硬件编号:          $%    $%  ANS000.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19);
  $%  001:软件编号:          $%    $%  ANS001.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  002:软件版本号:        $%    $%  ANS002.BYTE004  $%  ASCII(x1,x2);
  $%  003:编程日期:          $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%02X %02X %02X %02X],x1,x2,x3,x4);
  $%  004:VIN:               $%    $%  ANS004.BYTE004  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E0 03 22 F1 01 00 00 00 00       $  ANS000:7E8 03 22 F1 01 00 00 00 00

  $  000.电源电压                                           $    $  V            $    $  ANS000.BYTE035  $  y=x1*187.9/255;
  $  001.发动机转速                                         $    $  rpm          $    $  ANS000.BYTE036  $  y=x1*64+x2*64.0/255;
  $  002.目标怠速(有补偿)                                   $    $  rpm          $    $  ANS000.BYTE039  $  y=x1*10;
  $  003.冷却液温度                                         $    $  degree C     $    $  ANS000.BYTE043  $  y=x1-40;
  $  004.实际进气歧管压力                                   $    $  hPa          $    $  ANS000.BYTE051  $  y=x1*10;
  $  005.计算节气门位置                                     $    $  %            $    $  ANS000.BYTE059  $  y=x1*100.0/255;
  $  006.发动机相对负荷                                     $    $  %            $    $  ANS000.BYTE099  $  y=x1*6+x2*6.0/255;
  $  007.点火提前角                                         $    $  °           $    $  ANS000.BYTE070  $  y=x1*0.5-64;
  $  008.充磁时间                                           $    $  毫秒         $    $  ANS000.BYTE068  $  y=x1*0.1;
  $  009.喷油脉宽                                           $    $  毫秒         $    $  ANS000.BYTE069  $  y=x1*0.1;
  $  010.进气量                                             $    $  kg/h         $    $  ANS000.BYTE052  $  y=(x1*256+x2)*0.1;
  $  011.目标怠速(无补偿)                                   $    $  rpm          $    $  ANS000.BYTE038  $  y=x1*10;
  $  012.车速                                               $    $  km/h         $    $  ANS000.BYTE040  $  y=x1;
  $  013.车辆加速度                                         $    $  m/s2         $    $  ANS000.BYTE041  $  if(x1>127)y=(x1-256)*27.78/128;else y=x1*27.78/128;
  $  014.运行里程                                           $    $  km           $    $  ANS000.BYTE110  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  015.运行时间                                           $    $  分           $    $  ANS000.BYTE114  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  016.故障后运行时间                                     $    $  分           $    $  ANS000.BYTE118  $  y=(x1*15356+x2*6);
  $  017.进气温度                                           $    $  degree C     $    $  ANS000.BYTE045  $  y=x1-40;
  $  018.环境温度                                           $    $  degree C     $    $  ANS000.BYTE046  $  y=x1-40;
  $  019.爆震传感器1信号                                    $    $  V            $    $  ANS000.BYTE076  $  y=x1*5+x2*5.0/255;
  $  020.爆震传感器2信号                                    $    $  V            $    $  ANS000.BYTE078  $  y=x1*5+x2*5.0/255;
  $  021.1组氧传感器电压,传感器1(氧传感器1)                 $    $  V            $    $  ANS000.BYTE088  $  y=x1*5.0/255;
  $  022.1组氧传感器电压,传感器2(氧传感器2)                 $    $  V            $    $  ANS000.BYTE089  $  y=x1*5.0/255;
  $  023.1组氧传感器积分值(短期修正)                        $    $               $    $  ANS000.BYTE086  $  y=x1*2.0/255;
  $  024.1组氧传感器积分值(长期修正)                        $    $               $    $  ANS000.BYTE092  $  y=x1*1.99/255;
  $  025.最终长期修正系数1                                  $    $  %            $    $  ANS000.BYTE094  $  y=x1*3060.478/255-1529.583;
  $  026.2组氧传感器电压,传感器1                            $    $  V            $    $  ANS000.BYTE090  $  y=x1*5.0/255;
  $  027.2组氧传感器电压,传感器2                            $    $  V            $    $  ANS000.BYTE091  $  y=x1*5.0/255;
  $  028.2组氧传感器积分值(短期修正)                        $    $               $    $  ANS000.BYTE087  $  y=x1*2.0/255;
  $  029.2组氧传感器积分值(长期修正)                        $    $               $    $  ANS000.BYTE093  $  y=x1*1.99/255;
  $  030.最终长期修正系数2                                  $    $  %            $    $  ANS000.BYTE096  $  if(x1<0x80) y=x1*1524.24/127+x2*11.955/255-1536.24;else y=(x1-0x80)*1536.193/127+x2*11.955/255;
  $  031.1缸推迟点火爆震控制                                $    $  Grad kw      $    $  ANS000.BYTE080  $  y=0-(x1*191.3/255);
  $  032.2缸推迟点火爆震控制                                $    $  Grad kw      $    $  ANS000.BYTE081  $  y=0-(x1*191.3/255);
  $  033.3缸推迟点火爆震控制                                $    $  Grad kw      $    $  ANS000.BYTE082  $  y=0-(x1*191.3/255);
  $  034.4缸推迟点火爆震控制                                $    $  Grad kw      $    $  ANS000.BYTE083  $  y=0-(x1*191.3/255);
  $  035.节气门位置信号                                     $    $  %            $    $  ANS000.BYTE057  $  y=x1*0.4/255;
  $  036.节气门电机PWM(脉宽调制)                            $    $  %            $    $  ANS000.BYTE060  $  y=x1*99.6/255;
  $  037.碳罐阀占空比                                       $    $  %            $    $  ANS000.BYTE064  $  y=x1*99.6/255;
  $  038.空调压力                                           $    $  Mpa          $    $  ANS000.BYTE072  $  y=x1*5.0/255;
  $  039.耗油量                                             $    $  L/h          $    $  ANS000.BYTE074  $  y=(x1*140.1+x2*0.5)/255;
  $  040.模型进气温度                                       $    $  degree C     $    $  ANS000.BYTE098  $  y=x1*191.0/255-48;
  $  041.怠速扭矩自学习                                     $    $  %            $    $  ANS000.BYTE101  $  if(x1>127)y=(x1-256)*100.0/128+x2*0.8/255;else y=x1*100.0/128+x2*0.8/255;
  $  042.怠速转速控制目标扭矩修正                           $    $  %            $    $  ANS000.BYTE103  $  if(x1>127)y=(x1-256)*100.0/128+x2*0.8/255;else y=x1*100.0/128+x2*0.8/255;
  $  043.碳罐的相对喷油量                                   $    $  %            $    $  ANS000.BYTE105  $  if(x1>127)y=(x1-256)*1536.0/128+x2*12.0/255;else y=x1*1536.0/128+x2*12.0/255;
  $  044.碳罐净化率                                         $    $  %            $    $  ANS000.BYTE107  $  y=x1*0.5/255;
  $  045.碳罐负荷                                           $    $  %            $    $  ANS000.BYTE108  $  if(x1>127)y=(x1-256)*0.5+x2*0.5/255;else y=x1*0.5+x2*0.5/255;
  $  046.冷却风扇占空比                                     $    $  %            $    $  ANS000.BYTE122  $  y=x1*99.6/255;
  $  047.步进电机目标位置                                   $    $  步幅         $    $  ANS000.BYTE054  $  y=x1;
  $  048.空调蒸发器温度                                     $    $  degree C     $    $  ANS000.BYTE048  $  y=(x1*191.0/255-48)+(x2*1.0/255);
  $  049.冷却液温度传感器电压                               $    $  V            $    $  ANS000.BYTE042  $  y=x1*5.0/255;
  $  050.进气温度传感器电压                                 $    $  V            $    $  ANS000.BYTE044  $  y=x1*5.0/255;
  $  051.空调蒸发器温度AD值                                 $    $  V            $    $  ANS000.BYTE047  $  y=x1*5.0/255;
  $  052.实际进气歧管压力传感器电压                         $    $  V            $    $  ANS000.BYTE050  $  y=x1*5.0/255;
  $  053.节气门角度AD信号值                                 $    $  V            $    $  ANS000.BYTE055  $  y=x1*5.0/255;
  $  054.发动机稳态工况-点火线端15开启                      $    $               $    $  ANS000.BYTE024  $  if(x1&0x01)y=@001b;else y=@001c;
  $  055.发动机稳态工况-主继电器工作                        $    $               $    $  ANS000.BYTE024  $  if(x1&0x02)y=@001b;else y=@001c;
  $  056.发动机稳态工况-燃油泵继电器工作                    $    $               $    $  ANS000.BYTE024  $  if(x1&0x04)y=@0001;else y=@0000;
  $  057.发动机稳态工况-起动机工作                          $    $               $    $  ANS000.BYTE024  $  if(x1&0x08)y=@001b;else y=@001c;
  $  058.发动机稳态工况-达到怠速转速                        $    $               $    $  ANS000.BYTE024  $  if(x1&0x10)y=@001b;else y=@001c;
  $  059.发动机稳态工况-同步条件                            $    $               $    $  ANS000.BYTE024  $  if(x1&0x20)y=@0019;else y=@001a;
  $  060.发动机稳态工况-达到发动机工作温度(大于80°C)       $    $               $    $  ANS000.BYTE024  $  if(x1&0x40)y=@0019;else y=@001a;
  $  061.发动机稳态工况-车辆行驶(收到速度脉冲)              $    $               $    $  ANS000.BYTE024  $  if(x1&0x80)y=@001b;else y=@001c;
  $  062.发动机动态工况-节气门处于怠速位置                  $    $               $    $  ANS000.BYTE025  $  if(x1&0x01)y=@001b;else y=@001c;
  $  063.发动机动态工况-节气门处于全负荷位置                $    $               $    $  ANS000.BYTE025  $  if(x1&0x02)y=@001b;else y=@001c;
  $  064.发动机动态工况-激活减速断油                        $    $               $    $  ANS000.BYTE025  $  if(x1&0x08)y=@000e;else y=@000f;
  $  065.发动机动态工况-激活加速加浓                        $    $               $    $  ANS000.BYTE025  $  if(x1&0x10)y=@000e;else y=@000f;
  $  066.排放控制-λ控制激活                                $    $               $    $  ANS000.BYTE026  $  if(x1&0x01)y=@000e;else y=@000f;
  $  067.排放控制-碳罐控制阀激活                            $    $               $    $  ANS000.BYTE026  $  if(x1&0x04)y=@000e;else y=@000f;
  $  068.排放控制-减速断油激活                              $    $               $    $  ANS000.BYTE026  $  if(x1&0x08)y=@000e;else y=@000f;
  $  069.排放控制-催化转换器保护加浓激活                    $    $               $    $  ANS000.BYTE026  $  if(x1&0x10)y=@000e;else y=@000f;
  $  070.排放控制-混合气自学习条件激活                      $    $               $    $  ANS000.BYTE026  $  if(x1&0x20)y=@000e;else y=@000f;
  $  071.氧传感器-氧传感器1信号                             $    $               $    $  ANS000.BYTE027  $  if(x1&0x01)y=@001d;else y=@001e;
  $  072.氧传感器-氧传感器2信号                             $    $               $    $  ANS000.BYTE027  $  if(x1&0x02)y=@001d;else y=@001e;
  $  073.氧传感器-氧传感器1加热                             $    $               $    $  ANS000.BYTE027  $  if(x1&0x10)y=@00be;else y=@00bf;
  $  074.氧传感器-氧传感器2加热                             $    $               $    $  ANS000.BYTE027  $  if(x1&0x20)y=@00be;else y=@00bf;
  $  075.发动机怠速-踏板位置确认怠速                        $    $               $    $  ANS000.BYTE028  $  if(x1&0x01)y=@001b;else y=@001c;
  $  076.发动机怠速-电气负载1工作                           $    $               $    $  ANS000.BYTE028  $  if(x1&0x02)y=@001b;else y=@001c;
  $  077.发动机怠速-电气负载2工作                           $    $               $    $  ANS000.BYTE028  $  if(x1&0x04)y=@001b;else y=@001c;
  $  078.指示灯SVS/MIL-MIL(故障指示灯)激活                  $    $               $    $  ANS000.BYTE029  $  if(x1&0x01)y=@000e;else y=@000f;
  $  079.指示灯SVS/MIL-MIL(故障指示灯)闪烁                  $    $               $    $  ANS000.BYTE029  $  if(x1&0x02)y=@001b;else y=@001c;
  $  080.指示灯SVS/MIL-SVS(系统维修指示灯)激活              $    $               $    $  ANS000.BYTE029  $  if(x1&0x10)y=@000e;else y=@000f;
  $  081.指示灯SVS/MIL-SVS(系统维修指示灯)闪烁              $    $               $    $  ANS000.BYTE029  $  if(x1&0x20)y=@001b;else y=@001c;
  $  082.指示灯SVS/MIL-SVS(系统维修指示灯)存在故障          $    $               $    $  ANS000.BYTE029  $  if(x1&0x40)y=@001b;else y=@001c;
  $  083.空调系统-空调开启                                  $    $               $    $  ANS000.BYTE031  $  if(x1&0x01)y=@001b;else y=@001c;
  $  084.空调系统-空调请求激活                              $    $               $    $  ANS000.BYTE031  $  if(x1&0x02)y=@000e;else y=@000f;
  $  085.空调系统-空调压缩机开                              $    $               $    $  ANS000.BYTE031  $  if(x1&0x04)y=@001b;else y=@001c;
  $  086.空调系统-空调断开或无空调                          $    $               $    $  ANS000.BYTE031  $  if(x1&0x08)y=@001b;else y=@001c;
  $  087.空调系统-空调因温度断开                            $    $               $    $  ANS000.BYTE031  $  if(x1&0x10)y=@001b;else y=@001c;
  $  088.空调系统-怠速转速因空调而增加                      $    $               $    $  ANS000.BYTE031  $  if(x1&0x20)y=@001b;else y=@001c;
  $  089.空调系统-全负荷时关闭空调压缩机                    $    $               $    $  ANS000.BYTE031  $  if(x1&0x40)y=@001b;else y=@001c;
  $  090.空调系统-空调中压开关开                            $    $               $    $  ANS000.BYTE031  $  if(x1&0x80)y=@001b;else y=@001c;
  $  091.AT/扭矩请求-AT转换离合器激活                       $    $               $    $  ANS000.BYTE032  $  if(x1&0x08)y=@000e;else y=@000f;

;******************************************************************************************************************************************************

动作测试:

$^ 00.发动机故障(MIL)指示灯控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 10 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 10 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 10 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 01.燃油泵控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 12 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 12 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 12 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 02.冷却风扇#1(低速风扇)控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 13 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 13 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 13 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 03.冷却风扇#2(高速风扇)控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 14 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 14 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 14 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 04.空调离合器控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 15 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 15 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 15 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 05.车辆立即维修(SVS)控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 18 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 18 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 18 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 06.禁用燃油喷射控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:禁止#1缸喷射 
$^REQ00:7E0 06 2F 01 20 03 00 01 00     $^

$^BUTTON:禁止#2缸喷射 
$^REQ00:7E0 06 2F 01 20 03 00 02 00     $^

$^BUTTON:禁止#3缸喷射 
$^REQ00:7E0 06 2F 01 20 03 00 03 00     $^

$^BUTTON:禁止#4缸喷射 
$^REQ00:7E0 06 2F 01 20 03 00 04 00     $^

$^BUTTON:启动#1缸喷射 
$^REQ00:7E0 06 2F 01 20 03 FF 01 00     $^

$^BUTTON:启动#2缸喷射 
$^REQ00:7E0 06 2F 01 20 03 FF 02 00     $^

$^BUTTON:启动#3缸喷射 
$^REQ00:7E0 06 2F 01 20 03 FF 03 00     $^

$^BUTTON:启动#4缸喷射 
$^REQ00:7E0 06 2F 01 20 03 FF 04 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 20 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 07.步进电机位置控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 37 00 00 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 37 00 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 37 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

$^ 08.步进电机执行器控制 
$^IN  REQ00:7E0 02 10 03 00 00 00 00 00     $^IN  

$^TYPE0
$^BUTTON:打开 
$^REQ00:7E0 05 2F 01 38 03 FF 00 00     $^

$^BUTTON:关闭 
$^REQ00:7E0 05 2F 01 38 03 00 00 00     $^

$^BUTTON:退出 
$^REQ00:7E0 04 2F 01 38 00 00 00 00     $^

;----------------------------------------------------------------------------------------------------

30帧:

  $FC REQ000:7E0 30 00 05 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
