
     系统名称:ECM (发动机控制模块)

     系统ID:00004420

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 03 00 00 00 00 00       $~ ANS000:7E8 02 10 03 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 01 00 00 00 00 00       $~ ANS000:7E8 02 10 01 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10385653&quot;: &quot;0000441F&quot;, &quot;10425930&quot;: &quot;00004420&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10385653&quot;: &quot;0000441F&quot;, &quot;10425930&quot;: &quot;00004420&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E0 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/00004420

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E0 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ002:7E0 03 22 F1 87 00 00 00 00            $%  
  $%  REQ003:7E0 03 22 F1 91 00 00 00 00            $%  
  $%  REQ004:7E0 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ005:7E0 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ006:7E0 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ007:7E0 03 22 F1 10 00 00 00 00            $%  
  $%  REQ008:7E0 03 22 F1 20 00 00 00 00            $%  
  $%  REQ009:7E0 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ010:7E0 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ011:7E0 03 22 F1 00 00 00 00 00            $%  

  $%  000:车辆识别代码(VIN)               $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:车辆特征信息 (FK)               $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  002:电控单元零件号                  $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元硬件号                  $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元应用软件号              $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元标定软件号              $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元制造日期                $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:刷新里程读数                    $%    $%  ANS007.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 
  $%  008:网络配置文件零件号出厂值        $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  009:电控单元索引信息                $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3); 
  $%  010:电控单元序列号                  $%    $%  ANS010.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  011:刷新工具参考号记录              $%    $%  ANS007.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  012:ECU软件校验号                   $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E0 03 22 B1 49 00 00 00 00            $  
  $  REQ001:7E0 03 22 B1 22 00 00 00 00            $  
  $  REQ002:7E0 03 22 B3 10 00 00 00 00            $  
  $  REQ003:7E0 03 22 B0 00 00 00 00 00            $  
  $  REQ004:7E0 03 22 B0 01 00 00 00 00            $  
  $  REQ005:7E0 03 22 B0 02 00 00 00 00            $  
  $  REQ006:7E0 03 22 B0 03 00 00 00 00            $  
  $  REQ007:7E0 03 22 B0 04 00 00 00 00            $  
  $  REQ008:7E0 03 22 B0 05 00 00 00 00            $  
  $  REQ009:7E0 03 22 B0 12 00 00 00 00            $  
  $  REQ010:7E0 03 22 B0 15 00 00 00 00            $  
  $  REQ011:7E0 03 22 B0 16 00 00 00 00            $  
  $  REQ012:7E0 03 22 B0 17 00 00 00 00            $  
  $  REQ013:7E0 03 22 B0 18 00 00 00 00            $  
  $  REQ014:7E0 03 22 B0 19 00 00 00 00            $  
  $  REQ015:7E0 03 22 B0 20 00 00 00 00            $  
  $  REQ016:7E0 03 22 B0 21 00 00 00 00            $  
  $  REQ017:7E0 03 22 B0 24 00 00 00 00            $  
  $  REQ018:7E0 03 22 B0 26 00 00 00 00            $  
  $  REQ019:7E0 03 22 B0 29 00 00 00 00            $  
  $  REQ020:7E0 03 22 B0 30 00 00 00 00            $  
  $  REQ021:7E0 03 22 B0 32 00 00 00 00            $  
  $  REQ022:7E0 03 22 B0 33 00 00 00 00            $  
  $  REQ023:7E0 03 22 B0 34 00 00 00 00            $  
  $  REQ024:7E0 03 22 B0 36 00 00 00 00            $  
  $  REQ025:7E0 03 22 B0 37 00 00 00 00            $  
  $  REQ026:7E0 03 22 B0 38 00 00 00 00            $  
  $  REQ027:7E0 03 22 B0 40 00 00 00 00            $  
  $  REQ028:7E0 03 22 B0 41 00 00 00 00            $  
  $  REQ029:7E0 03 22 B0 42 00 00 00 00            $  
  $  REQ030:7E0 03 22 B0 43 00 00 00 00            $  
  $  REQ031:7E0 03 22 B0 44 00 00 00 00            $  
  $  REQ032:7E0 03 22 B0 45 00 00 00 00            $  
  $  REQ033:7E0 03 22 B0 46 00 00 00 00            $  
  $  REQ034:7E0 03 22 B0 49 00 00 00 00            $  
  $  REQ035:7E0 03 22 B0 50 00 00 00 00            $  
  $  REQ036:7E0 03 22 B0 51 00 00 00 00            $  
  $  REQ037:7E0 03 22 B0 52 00 00 00 00            $  
  $  REQ038:7E0 03 22 B0 53 00 00 00 00            $  
  $  REQ039:7E0 03 22 B0 54 00 00 00 00            $  
  $  REQ040:7E0 03 22 B0 55 00 00 00 00            $  
  $  REQ041:7E0 03 22 B0 56 00 00 00 00            $  
  $  REQ042:7E0 03 22 B0 57 00 00 00 00            $  
  $  REQ043:7E0 03 22 B0 58 00 00 00 00            $  
  $  REQ044:7E0 03 22 B0 59 00 00 00 00            $  
  $  REQ045:7E0 03 22 B0 60 00 00 00 00            $  
  $  REQ046:7E0 03 22 B0 61 00 00 00 00            $  
  $  REQ047:7E0 03 22 B0 66 00 00 00 00            $  
  $  REQ048:7E0 03 22 B0 68 00 00 00 00            $  
  $  REQ049:7E0 03 22 B0 70 00 00 00 00            $  
  $  REQ050:7E0 03 22 B0 71 00 00 00 00            $  
  $  REQ051:7E0 03 22 B1 01 00 00 00 00            $  
  $  REQ052:7E0 03 22 B1 02 00 00 00 00            $  
  $  REQ053:7E0 03 22 B1 03 00 00 00 00            $  
  $  REQ054:7E0 03 22 B1 07 00 00 00 00            $  
  $  REQ055:7E0 03 22 B1 15 00 00 00 00            $  
  $  REQ056:7E0 03 22 B1 16 00 00 00 00            $  
  $  REQ057:7E0 03 22 B1 17 00 00 00 00            $  
  $  REQ058:7E0 03 22 B1 18 00 00 00 00            $  
  $  REQ059:7E0 03 22 B1 19 00 00 00 00            $  
  $  REQ060:7E0 03 22 B1 20 00 00 00 00            $  
  $  REQ061:7E0 03 22 B1 21 00 00 00 00            $  
  $  REQ062:7E0 03 22 B1 23 00 00 00 00            $  
  $  REQ063:7E0 03 22 B1 24 00 00 00 00            $  
  $  REQ064:7E0 03 22 B1 25 00 00 00 00            $  
  $  REQ065:7E0 03 22 B1 26 00 00 00 00            $  
  $  REQ066:7E0 03 22 B1 27 00 00 00 00            $  
  $  REQ067:7E0 03 22 B1 30 00 00 00 00            $  
  $  REQ068:7E0 03 22 B1 33 00 00 00 00            $  
  $  REQ069:7E0 03 22 B1 34 00 00 00 00            $  
  $  REQ070:7E0 03 22 B1 35 00 00 00 00            $  
  $  REQ071:7E0 03 22 B1 40 00 00 00 00            $  
  $  REQ072:7E0 03 22 B1 41 00 00 00 00            $  
  $  REQ073:7E0 03 22 B1 43 00 00 00 00            $  
  $  REQ074:7E0 03 22 B1 44 00 00 00 00            $  
  $  REQ075:7E0 03 22 B1 45 00 00 00 00            $  
  $  REQ076:7E0 03 22 B1 46 00 00 00 00            $  
  $  REQ077:7E0 03 22 B1 50 00 00 00 00            $  
  $  REQ078:7E0 03 22 B1 51 00 00 00 00            $  
  $  REQ079:7E0 03 22 B1 52 00 00 00 00            $  
  $  REQ080:7E0 03 22 B1 53 00 00 00 00            $  
  $  REQ081:7E0 03 22 B1 56 00 00 00 00            $  
  $  REQ082:7E0 03 22 B1 57 00 00 00 00            $  
  $  REQ083:7E0 03 22 B1 58 00 00 00 00            $  
  $  REQ084:7E0 03 22 B1 59 00 00 00 00            $  
  $  REQ085:7E0 03 22 B1 60 00 00 00 00            $  
  $  REQ086:7E0 03 22 B1 61 00 00 00 00            $  
  $  REQ087:7E0 03 22 B1 62 00 00 00 00            $  
  $  REQ088:7E0 03 22 B1 63 00 00 00 00            $  
  $  REQ089:7E0 03 22 B1 64 00 00 00 00            $  
  $  REQ090:7E0 03 22 B1 65 00 00 00 00            $  
  $  REQ091:7E0 03 22 B2 01 00 00 00 00            $  
  $  REQ092:7E0 03 22 B2 02 00 00 00 00            $  
  $  REQ093:7E0 03 22 B2 04 00 00 00 00            $  
  $  REQ094:7E0 03 22 B2 05 00 00 00 00            $  
  $  REQ095:7E0 03 22 B2 07 00 00 00 00            $  
  $  REQ096:7E0 03 22 B2 12 00 00 00 00            $  
  $  REQ097:7E0 03 22 B2 13 00 00 00 00            $  
  $  REQ098:7E0 03 22 B3 00 00 00 00 00            $  
  $  REQ099:7E0 03 22 B3 01 00 00 00 00            $  
  $  REQ100:7E0 03 22 B3 04 00 00 00 00            $  
  $  REQ101:7E0 03 22 B3 05 00 00 00 00            $  
  $  REQ102:7E0 03 22 B3 06 00 00 00 00            $  
  $  REQ103:7E0 03 22 B3 07 00 00 00 00            $  
  $  REQ104:7E0 03 22 B3 08 00 00 00 00            $  
  $  REQ105:7E0 03 22 B3 14 00 00 00 00            $  
  $  REQ106:7E0 03 22 B3 16 00 00 00 00            $  
  $  REQ107:7E0 03 22 B3 17 00 00 00 00            $  
  $  REQ108:7E0 03 22 B3 20 00 00 00 00            $  
  $  REQ109:7E0 03 22 B3 21 00 00 00 00            $  
  $  REQ110:7E0 03 22 B3 22 00 00 00 00            $  
  $  REQ111:7E0 03 22 B3 23 00 00 00 00            $  
  $  REQ112:7E0 03 22 B3 24 00 00 00 00            $  
  $  REQ113:7E0 03 22 B3 25 00 00 00 00            $  
  $  REQ114:7E0 03 22 B3 26 00 00 00 00            $  
  $  REQ115:7E0 03 22 B3 27 00 00 00 00            $  
  $  REQ116:7E0 03 22 B3 28 00 00 00 00            $  
  $  REQ117:7E0 03 22 B3 29 00 00 00 00            $  
  $  REQ118:7E0 03 22 B3 30 00 00 00 00            $  
  $  REQ119:7E0 03 22 B3 31 00 00 00 00            $  
  $  REQ120:7E0 03 22 B4 01 00 00 00 00            $  
  $  REQ121:7E0 03 22 B4 02 00 00 00 00            $  
  $  REQ122:7E0 03 22 B4 03 00 00 00 00            $  
  $  REQ123:7E0 03 22 B4 04 00 00 00 00            $  
  $  REQ124:7E0 03 22 B4 06 00 00 00 00            $  
  $  REQ125:7E0 03 22 B4 11 00 00 00 00            $  
  $  REQ126:7E0 03 22 B4 14 00 00 00 00            $  
  $  REQ127:7E0 03 22 B4 15 00 00 00 00            $  
  $  REQ128:7E0 03 22 B4 20 00 00 00 00            $  
  $  REQ129:7E0 03 22 B4 21 00 00 00 00            $  
  $  REQ130:7E0 03 22 B4 22 00 00 00 00            $  
  $  REQ131:7E0 03 22 B0 0A 00 00 00 00            $  
  $  REQ132:7E0 03 22 B0 0B 00 00 00 00            $  
  $  REQ133:7E0 03 22 B0 0D 00 00 00 00            $  
  $  REQ134:7E0 03 22 B0 0E 00 00 00 00            $  
  $  REQ135:7E0 03 22 B0 0F 00 00 00 00            $  
  $  REQ136:7E0 03 22 B0 2E 00 00 00 00            $  
  $  REQ137:7E0 03 22 B0 2F 00 00 00 00            $  
  $  REQ138:7E0 03 22 B0 3A 00 00 00 00            $  
  $  REQ139:7E0 03 22 B0 3B 00 00 00 00            $  
  $  REQ140:7E0 03 22 B0 4D 00 00 00 00            $  
  $  REQ141:7E0 03 22 B0 4E 00 00 00 00            $  
  $  REQ142:7E0 03 22 B0 4F 00 00 00 00            $  
  $  REQ143:7E0 03 22 B1 08 00 00 00 00            $  
  $  REQ144:7E0 03 22 B1 09 00 00 00 00            $  
  $  REQ145:7E0 03 22 B1 10 00 00 00 00            $  
  $  REQ146:7E0 03 22 B1 11 00 00 00 00            $  
  $  REQ147:7E0 03 22 B1 36 00 00 00 00            $  
  $  REQ148:7E0 03 22 B1 37 00 00 00 00            $  
  $  REQ149:7E0 03 22 B1 38 00 00 00 00            $  
  $  REQ150:7E0 03 22 B1 39 00 00 00 00            $  
  $  REQ151:7E0 03 22 B2 18 00 00 00 00            $  
  $  REQ152:7E0 03 22 B2 19 00 00 00 00            $  
  $  REQ153:7E0 03 22 B2 20 00 00 00 00            $  
  $  REQ154:7E0 03 22 B2 21 00 00 00 00            $  
  $  REQ155:7E0 03 22 B3 18 00 00 00 00            $  
  $  REQ156:7E0 03 22 B3 19 00 00 00 00            $  
  $  REQ157:7E0 03 22 B0 35 00 00 00 00            $  
  $  REQ158:7E0 03 22 B0 67 00 00 00 00            $  
  $  REQ159:7E0 03 22 B0 69 00 00 00 00            $  
  $  REQ160:7E0 03 22 B0 81 00 00 00 00            $  
  $  REQ161:7E0 03 22 B0 82 00 00 00 00            $  
  $  REQ162:7E0 03 22 B0 83 00 00 00 00            $  
  $  REQ163:7E0 03 22 B0 84 00 00 00 00            $  
  $  REQ164:7E0 03 22 B0 85 00 00 00 00            $  
  $  REQ165:7E0 03 22 B1 31 00 00 00 00            $  
  $  REQ166:7E0 03 22 B1 32 00 00 00 00            $  
  $  REQ167:7E0 03 22 B1 87 00 00 00 00            $  
  $  REQ168:7E0 03 22 B1 88 00 00 00 00            $  
  $  REQ169:7E0 03 22 B1 89 00 00 00 00            $  
  $  REQ170:7E0 03 22 B2 14 00 00 00 00            $  
  $  REQ171:7E0 03 22 B2 15 00 00 00 00            $  
  $  REQ172:7E0 03 22 B3 32 00 00 00 00            $  
  $  REQ173:7E0 03 22 B3 33 00 00 00 00            $  
  $  REQ174:7E0 03 22 B3 34 00 00 00 00            $  
  $  REQ175:7E0 03 22 B4 18 00 00 00 00            $  
  $  REQ176:7E0 03 22 B4 23 00 00 00 00            $  
  $  REQ177:7E0 03 22 B0 4C 00 00 00 00            $  
  $  REQ178:7E0 03 22 B0 5C 00 00 00 00            $  
  $  REQ179:7E0 03 22 B0 5D 00 00 00 00            $  
  $  REQ180:7E0 03 22 B0 5E 00 00 00 00            $  
  $  REQ181:7E0 03 22 B0 5F 00 00 00 00            $  
  $  REQ182:7E0 03 22 B0 6A 00 00 00 00            $  
  $  REQ183:7E0 03 22 B0 6B 00 00 00 00            $  
  $  REQ184:7E0 03 22 B0 6F 00 00 00 00            $  
  $  REQ185:7E0 03 22 B1 78 00 00 00 00            $  
  $  REQ186:7E0 03 22 B1 79 00 00 00 00            $  
  $  REQ187:7E0 03 22 B1 90 00 00 00 00            $  
  $  REQ188:7E0 03 22 B1 91 00 00 00 00            $  
  $  REQ189:7E0 03 22 B0 1A 00 00 00 00            $  
  $  REQ190:7E0 03 22 B0 1B 00 00 00 00            $  
  $  REQ191:7E0 03 22 B0 1C 00 00 00 00            $  
  $  REQ192:7E0 03 22 B0 1D 00 00 00 00            $  
  $  REQ193:7E0 03 22 B0 1E 00 00 00 00            $  
  $  REQ194:7E0 03 22 B0 1F 00 00 00 00            $  
  $  REQ195:7E0 03 22 B0 5B 00 00 00 00            $  
  $  REQ196:7E0 03 22 B0 7A 00 00 00 00            $  

  $  000.上游氧传感器循环时间                                           $    $  秒               $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.4; 
  $  001.供油修正值                                                     $    $                   $    $  ANS001.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0000305;elsey=(x1*256+x2-0xFFFF)*0.0000305; 
  $  002.发电机负载                                                     $    $  牛顿*米          $    $  ANS002.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  003.周围空气压力                                                   $    $  千帕             $    $  ANS003.BYTE003  $  y=(x1*256+x2)*0.0039; 
  $  004.空调压力                                                       $    $  千帕             $    $  ANS004.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.2;elsey=(x1*256+x2-0xFFFF)*0.2; 
  $  005.空调压力传感器信号电压                                         $    $  毫伏             $    $  ANS005.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.2;elsey=(x1*256+x2-0xFFFF)*0.2; 
  $  006.ECM供电电压(KL87)                                              $    $  伏               $    $  ANS006.BYTE003  $  y=(x1*256+x2)*0.024; 
  $  007.点火开关供电电压                                               $    $  伏               $    $  ANS007.BYTE003  $  y=(x)*0.094; 
  $  008.主继电器供电电压                                               $    $  伏               $    $  ANS008.BYTE003  $  y=(x)*0.1; 
  $  009.制动真空压力                                                   $    $  千帕             $    $  ANS009.BYTE003  $  y=(x1*256+x2)*0.00390625; 
  $  010.增压压力                                                       $    $  千帕             $    $  ANS010.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  011.增压器压力电压原始值                                           $    $  伏               $    $  ANS011.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  012.进气凸轮轴相位                                                 $    $  度               $    $  ANS012.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  013.排气凸轮轴相位                                                 $    $  度               $    $  ANS013.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  014.凸轮轴气门重叠相位                                             $    $  度               $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  015.碳罐PWM占空比                                                  $    $  百分比           $    $  ANS015.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  016.启停-离合器踏板传感器PWM占空比                                 $    $  百分比           $    $  ANS016.BYTE003  $  y=(x)*0.390625; 
  $  017.ECM内部碰撞检测计数                                            $    $  计数             $    $  ANS017.BYTE003  $  y=(x)*1; 
  $  018.油门踏板需求                                                   $    $  百分比           $    $  ANS018.BYTE003  $  y=(x)*0.392; 
  $  019.加速踏板位置1传感器电压                                        $    $  伏               $    $  ANS019.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  020.加速踏板位置2传感器电压                                        $    $  伏               $    $  ANS020.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  021.发动机冷却液温度                                               $    $  摄氏度           $    $  ANS021.BYTE003  $  y=(x)*0.75-48; 
  $  022.发动机冷却液温度传感器电压                                     $    $  伏               $    $  ANS022.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  023.发动机油温度                                                   $    $  摄氏度           $    $  ANS023.BYTE003  $  y=(x)*0.752-48; 
  $  024.发动机机油压力                                                 $    $  千帕             $    $  ANS024.BYTE003  $  y=(x1*256+x2)*0.0229; 
  $  025.发动机机油压力电压原始值                                       $    $  伏               $    $  ANS025.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  026.发动机转速                                                     $    $  转/分            $    $  ANS026.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  027.电子节温器控制占空比                                           $    $  百分比           $    $  ANS027.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.01;elsey=(x1*256+x2-0xFFFF)*0.01; 
  $  028.油轨压力                                                       $    $  兆帕             $    $  ANS028.BYTE003  $  y=(x1*256+x2)*0.0005; 
  $  029.油轨压力传感器电压原始值                                       $    $  伏               $    $  ANS029.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  030.油箱油位                                                       $    $  升               $    $  ANS030.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  031.启停-发电机目标电压                                            $    $  伏               $    $  ANS031.BYTE003  $  y=(x)*0.1+10.6; 
  $  032.启停-发电机负载循环反馈                                        $    $  百分比           $    $  ANS032.BYTE003  $  y=(x)*3.2258064516129; 
  $  033.高压油泵控制阀PWM占空比                                        $    $  千瓦             $    $  ANS033.BYTE003  $  if(0x80>x)y=(x)*0.1;elsey=(x-0xFF)*0.1; 
  $  034.进气歧管空气温度                                               $    $  摄氏度           $    $  ANS034.BYTE003  $  y=(x)*0.75-48; 
  $  035.进气歧管空气温度传感器电压                                     $    $  伏               $    $  ANS035.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  036.进气歧管绝对压力                                               $    $  千帕             $    $  ANS036.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  037.进气歧管绝对压力电压原始值                                     $    $  伏               $    $  ANS037.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  038.后氧传感器电压                                                 $    $  伏特             $    $  ANS038.BYTE003  $  y=(x)*0.005-0.2; 
  $  039.下游氧传感器电压                                               $    $  伏特             $    $  ANS039.BYTE003  $  y=(x1*256+x2)*0.0049-1; 
  $  040.前氧传感器电压                                                 $    $  伏特             $    $  ANS040.BYTE003  $  y=(x1*256+x2)*0.0049; 
  $  041.上游氧传感器电压                                               $    $  伏特             $    $  ANS041.BYTE003  $  y=(x1*256+x2)*0.0049-1; 
  $  042.上游氧传感器加热器PWM占空比                                    $    $  秒               $    $  ANS042.BYTE003  $  y=(x)*0.003; 
  $  043.下游氧传感器加热器PWM占空比                                    $    $  秒               $    $  ANS043.BYTE003  $  y=(x)*0.01; 
  $  044.废气控制阀占空比                                               $    $  百分比           $    $  ANS044.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  045.粗糙路车轮                                                     $    $  米每二次方秒     $    $  ANS045.BYTE003  $  y=(x)*0.217; 
  $  046.车速                                                           $    $  千米/时          $    $  ANS046.BYTE003  $  y=(x)*1.25; 
  $  047.转向角                                                         $    $  度               $    $  ANS047.BYTE003  $  y=(x1*256+x2)*0.1-780; 
  $  048.空气质量流量 （每小时）                                        $    $  千克每小时       $    $  ANS048.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  049.进气凸轮轴目标相位                                             $    $  曲轴转角         $    $  ANS049.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  050.排气凸轮轴目标相位                                             $    $  曲轴转角         $    $  ANS050.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  051.环境压力修正系数                                               $    $                   $    $  ANS051.BYTE003  $  y=(x1*256+x2)*0.00006; 
  $  052.发动机DBW灯亮后行驶里程值                                      $    $  千米             $    $  ANS052.BYTE003  $  y=(x1*256+x2)*1; 
  $  053.发动机MIL灯亮后行驶里程值                                      $    $  公里             $    $  ANS053.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.01; 
  $  054.发动机控制状态-发动机起动中                                    $    $                   $    $  ANS054.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  055.发动机控制状态-发动机起动完成                                  $    $                   $    $  ANS054.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  056.发动机控制状态-发动机怠速中                                    $    $                   $    $  ANS054.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  057.发动机控制状态-怠速控制置位                                    $    $                   $    $  ANS054.BYTE003  $  switxh(x&0x08)0x00:@09b4;0x08:@0365; 
  $  058.发动机控制状态-空燃比闭环控制置位                              $    $                   $    $  ANS054.BYTE003  $  switxh(x&0x10)0x00:@09b4;0x10:@0365; 
  $  059.发动机控制状态-空燃比开环控制置位                              $    $                   $    $  ANS054.BYTE003  $  switxh(x&0x20)0x00:@09b4;0x20:@0365; 
  $  060.发动机转速限制错误                                             $    $                   $    $  ANS055.BYTE003  $  switxh(x&0x01)0x00:@09b4;0x01:@0365; 
  $  061.发动机关闭时间                                                 $    $  秒               $    $  ANS056.BYTE003  $  if(128>x1)y=(x1*16777216+x2*65536+x3*256+x4)*0.5;elsey=(x1*16777216+x2*65536+x3*256+x4)*0.5-2147483648; 
  $  062.推进系统关闭时间(汽油缸内直喷)                                 $    $  秒               $    $  ANS057.BYTE003  $  if(128>x1)y=(x1*16777216+x2*65536+x3*256+x4)*0.5;elsey=(x1*16777216+x2*65536+x3*256+x4)*0.5-2147483648; 
  $  063.燃油消耗量                                                     $    $  毫升             $    $  ANS058.BYTE003  $  y=(x1*256+x2)*16; 
  $  064.短期油量修正平均值                                             $    $                   $    $  ANS059.BYTE003  $  y=(x)*1; 
  $  065.燃油修正长期加法值                                             $    $                   $    $  ANS060.BYTE003  $  y=(x)*1; 
  $  066.长期乘法燃油修正                                               $    $                   $    $  ANS061.BYTE003  $  y=(x1*256+x2)*0.0000305; 
  $  067.点火平均角                                                     $    $  千瓦*时          $    $  ANS062.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  068.1缸点火角                                                      $    $  度               $    $  ANS063.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  069.2缸点火角                                                      $    $  度               $    $  ANS064.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  070.3缸点火角                                                      $    $  度               $    $  ANS065.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  071.4缸点火角                                                      $    $  度               $    $  ANS066.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  072.喷油时间                                                       $    $  毫秒             $    $  ANS067.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.001; 
  $  073.空调长期怠速调节值                                             $    $  转/分            $    $  ANS068.BYTE003  $  y=(x)*10; 
  $  074.怠速长期调节                                                   $    $  百分比           $    $  ANS069.BYTE003  $  y=(x1*256+x2)*0.00152587890625; 
  $  075.怠速速度设定值                                                 $    $  转/分            $    $  ANS070.BYTE003  $  y=(x)*10; 
  $  076.爆震传感器电压                                                 $    $  伏特             $    $  ANS071.BYTE003  $  y=(x1*256+x2)*0.000076; 
  $  077.Lambda 设置点                                                  $    $                   $    $  ANS072.BYTE003  $  y=(x1*256+x2)*0.000244; 
  $  078.1缸超过200转/分钟的失火数                                      $    $  计数器           $    $  ANS073.BYTE003  $  y=(x1*256+x2)*1; 
  $  079.2缸失火数                                                      $    $  计数器           $    $  ANS074.BYTE003  $  y=(x1*256+x2)*1; 
  $  080.3缸失火数                                                      $    $  计数器           $    $  ANS075.BYTE003  $  y=(x1*256+x2)*1; 
  $  081.4缸失火数                                                      $    $  次               $    $  ANS076.BYTE003  $  y=(x1*256+x2)*1; 
  $  082.上游氧传感器加热器状态-上游氧传感器准备运行                    $    $                   $    $  ANS077.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  083.上游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS077.BYTE003  $  switxh(x&0x02)0x00:@09b4;0x02:@0365; 
  $  084.上游氧传感器加热器状态-非全功率加热标志位                      $    $                   $    $  ANS077.BYTE003  $  switxh(x&0x01)0x00:@09b4;0x01:@0365; 
  $  085.下游氧传感器加热器状态-下游氧传感器准备运行                    $    $                   $    $  ANS078.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  086.下游氧传感器加热器状态-全功率加热标志位                        $    $                   $    $  ANS078.BYTE003  $  switxh(x&0x04)0x00:@09b4;0x04:@0365; 
  $  087.下游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS078.BYTE003  $  switxh(x&0x02)0x00:@09b4;0x02:@0365; 
  $  088.下游氧传感器加热器状态-非全功率加热标志位                      $    $                   $    $  ANS078.BYTE003  $  switxh(x&0x01)0x00:@09b4;0x01:@0365; 
  $  089.碳罐负载水平                                                   $    $  千克/时          $    $  ANS079.BYTE003  $  y=(x1*256+x2)*0.00039; 
  $  090.软件状态                                                       $    $                   $    $  ANS080.BYTE003  $  switxh(x)0x00:@0332;0xFF:@0331; 
  $  091.节气门角度 1                                                   $    $  百分比           $    $  ANS081.BYTE003  $  y=(x)*0.392; 
  $  092.节气门角度 2                                                   $    $  百分比           $    $  ANS082.BYTE003  $  y=(x)*0.392; 
  $  093.节气门角度已过滤                                               $    $  百分比           $    $  ANS083.BYTE003  $  y=(x)*0.392; 
  $  094.节气门位置1传感器电压                                          $    $  伏               $    $  ANS084.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  095.节气门位置2传感器电压                                          $    $  伏               $    $  ANS085.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  096.电子节气门控制(ETC)-节气门相对角度                             $    $  开度             $    $  ANS086.BYTE003  $  y=(x)*0.392; 
  $  097.电子节气门控制(ETC)-跛行回家时节气门位置                       $    $  开度             $    $  ANS087.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  098.电子节气门控制(ETC)-节气门自适应设置点                         $    $  开度             $    $  ANS088.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  099.节气门控制机械下止点自适应1传感器电压                          $    $  伏               $    $  ANS089.BYTE003  $  y=(x)*0.0195; 
  $  100.节气门控制机械下止点自适应2传感器电压                          $    $  伏               $    $  ANS090.BYTE003  $  y=(x)*0.0195; 
  $  101.手动变速器变速器速比                                           $    $                   $    $  ANS091.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.01;elsey=(x1*256+x2-0xFFFF)*0.01; 
  $  102.手动变速器齿数比                                               $    $                   $    $  ANS092.BYTE003  $  y=(x)*1; 
  $  103.巡航控制目标速度                                               $    $  千米/时          $    $  ANS093.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0625;elsey=(x1*256+x2-0xFFFF)*0.0625; 
  $  104.巡航加速度                                                     $    $  米每平方秒       $    $  ANS094.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  105.压缩机请求                                                     $    $                   $    $  ANS095.BYTE003  $  switxh(x)0x00:@0204;0x01:@093d;0x02:@0206;0x03:@0337; 
  $  106.外部环境温度(动力总成估计)                                     $    $  度               $    $  ANS096.BYTE003  $  y=(x)*0.5-40; 
  $  107.直流(DC)转换器故障发生状态                                     $    $                   $    $  ANS097.BYTE003  $  switxh(x)0x00:@0022;0x01:@0021; 
  $  108.发动机扭矩结构-附件设备请求的扭矩                              $    $  牛米             $    $  ANS098.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  109.发动机扭矩结构-发动机内部阻力扭矩                              $    $  牛米             $    $  ANS099.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  110.发动机扭矩结构-摩擦扭矩自适应偏差值                            $    $  牛米             $    $  ANS100.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  111.发动机扭矩结构-最大可得到的指示扭矩                            $    $  牛米             $    $  ANS101.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  112.发动机扭矩结构-最小可得到的指示扭矩                            $    $  牛米             $    $  ANS102.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  113.发动机扭矩结构-空调压缩机请求的扭矩                            $    $  牛米             $    $  ANS103.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  114.发动机扭矩结构-冷却风扇请求的扭矩                              $    $  牛米             $    $  ANS104.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  115.发动机扭矩结构-发动机指示真实扭矩                              $    $  百分比           $    $  ANS105.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00152587890625;elsey=(x1*256+x2-0xFFFF)*0.00152587890625; 
  $  116.发动机扭矩结构-发动机输出有效扭矩                              $    $  牛米             $    $  ANS106.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  117.发动机扭矩结构-速度最大时指示扭矩                              $    $  牛米             $    $  ANS107.BYTE003  $  if(128>x1)y=(x1*16777216+x2*65536+x3*256+x4)*0.1;elsey=(x1*16777216+x2*65536+x3*256+x4-4294967296)*0.1; 
  $  118.发动机扭矩结构-发动机稳态实际扭矩                              $    $  牛米             $    $  ANS108.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  119.发动机扭矩结构-发动机无变速器稳态扭矩                          $    $  牛米             $    $  ANS109.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  120.驾驶需要的发动机扭矩                                           $    $  牛米             $    $  ANS110.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  121.发动机扭矩结构-发动机预测稳态扭矩                              $    $  牛米             $    $  ANS111.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  122.动力传输得到的曲轴扭矩请求反馈类型                             $    $                   $    $  ANS112.BYTE003  $  switxh(x)0x00:@00e7;0x01:@0c98;0x02:@0c99;0x03:@0c9a; 
  $  123.动力传输得到的的曲轴扭矩请求值                                 $    $  牛米             $    $  ANS113.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  124.动力传输预期的曲轴扭矩请求干涉类型                             $    $                   $    $  ANS114.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0c8d;0x02:@0c8e; 
  $  125.变速器预测曲轴扭矩-请求值                                      $    $  牛米             $    $  ANS115.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  126.动力传输发动机速度请求控制响应                                 $    $                   $    $  ANS116.BYTE003  $  switxh(x)0x00:@0bee;0x01:@0bef;0x02:@0c8c;0x03:@0bf0; 
  $  127.动力传输发动机速度请求干涉类型                                 $    $                   $    $  ANS117.BYTE003  $  switxh(x)0x00:@0bee;0x01:@0c8d;0x02:@0c8e;0x03:@0c8f; 
  $  128.动力传输发动机速度请求速度值                                   $    $  转/分钟          $    $  ANS118.BYTE003  $  y=(x1*256+x2)*8; 
  $  129.动力传输曲轴扭矩负荷                                           $    $  牛米             $    $  ANS119.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  130.空调压缩机请求                                                 $    $                   $    $  ANS120.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  131.空调离合器继电器状态                                           $    $                   $    $  ANS120.BYTE003  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  132.错误存在-驾驶员请求命令 2                                      $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  133.错误存在-驾驶员请求命令1                                       $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  134.机动化节气门控制器故障发生                                     $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  135.机动化节气门故障发生                                           $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  136.故障发生-节气门位置2传感器                                     $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  137.故障发生-节气门位置1传感器                                     $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  138.错误发生-曲轴信号                                              $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  139.故障现象-凸轮轴信号                                            $    $                   $    $  ANS121.BYTE003  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  140.错误发生-高压油泵控制阀                                        $    $                   $    $  ANS121.BYTE004  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  141.燃油泵继电器故障发生                                           $    $                   $    $  ANS121.BYTE004  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  142.喷油器4故障发生                                                $    $                   $    $  ANS121.BYTE004  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  143.喷油器3故障发生                                                $    $                   $    $  ANS121.BYTE004  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  144.喷油器2故障发生                                                $    $                   $    $  ANS121.BYTE004  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  145.喷油器1故障发生                                                $    $                   $    $  ANS121.BYTE004  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  146.错误发生-进气温度信号                                          $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  147.错误发生-增压压力信号                                          $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  148.错误发生-歧管压力传感器                                        $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  149.错误发生-空气流量信号                                          $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  150.错误发生-机油控制阀                                            $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  151.错误发生-机油压力传感器                                        $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  152.错误发生-油轨压力传感器                                        $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  153.故障发生-发动机冷却液温度传感器                                $    $                   $    $  ANS121.BYTE005  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  154.故障发生-起动挡硬线信号                                        $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  155.故障发生-附件挡硬线信号                                        $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  156.故障现象-下游氧传感器                                          $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  157.错误发生-上游氧传感器                                          $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  158.错误发生-爆震传感器                                            $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  159.故障发生-排气相位控制阀                                        $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  160.故障发生-进气相位控制阀                                        $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  161.错误发生-点火线圈                                              $    $                   $    $  ANS121.BYTE006  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  162.错误发生-输入的SDM CAN信号                                     $    $                   $    $  ANS121.BYTE007  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  163.故障发生-输入的SAS/EPS CAN信号                                 $    $                   $    $  ANS121.BYTE007  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  164.错误发生-输入的GW CAN信号                                      $    $                   $    $  ANS121.BYTE007  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  165.故障发生-输入的TCM CAN信号                                     $    $                   $    $  ANS121.BYTE007  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  166.引入的ABS CAN帧故障发生                                        $    $                   $    $  ANS121.BYTE007  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  167.故障发生-CAN总线关闭                                           $    $                   $    $  ANS121.BYTE007  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  168.故障发生-车辆发生碰撞或碰撞信号不合理                          $    $                   $    $  ANS121.BYTE008  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  169.有故障-废气调节阀                                              $    $                   $    $  ANS121.BYTE008  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  170.错误发生-泄压阀信号                                            $    $                   $    $  ANS121.BYTE008  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  171.故障发生-空调压力传感器                                        $    $                   $    $  ANS121.BYTE008  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  172.错误发生-电子节温器                                            $    $                   $    $  ANS121.BYTE008  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  173.错误发生-冷却风扇控制                                          $    $                   $    $  ANS121.BYTE008  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  174.碳罐电磁阀故障发生                                             $    $                   $    $  ANS121.BYTE009  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  175.故障发生-驻车挡/空挡硬线输入                                   $    $                   $    $  ANS121.BYTE009  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  176.错误发生-倒档开关                                              $    $                   $    $  ANS121.BYTE009  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  177.错误发生-离合器开关                                            $    $                   $    $  ANS121.BYTE009  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  178.故障发生-制动灯开关或制动位置传感器                            $    $                   $    $  ANS121.BYTE009  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  179.故障发生-起动机继电器反馈(启停)                                $    $                   $    $  ANS121.BYTE010  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  180.错误发生-离合器位置传感器                                      $    $                   $    $  ANS121.BYTE010  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  181.故障发生-空挡开关(启停)                                        $    $                   $    $  ANS121.BYTE010  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  182.错误发生-起动继电器1                                           $    $                   $    $  ANS121.BYTE010  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  183.飞轮自适应学习过程完成状态                                     $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  184.飞轮自适应学习错误标志                                         $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  185.发动机正在运行                                                 $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  186.发动机喷油点火信号同步完成                                     $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  187.发动机停止                                                     $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  188.点火状态-起动                                                  $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  189.点火状态-运行                                                  $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  190.点火状态-附件                                                  $    $                   $    $  ANS122.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  191.起停系统错误状态                                               $    $                   $    $  ANS122.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  192.起停测试模式激活                                               $    $                   $    $  ANS122.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  193.启停-直接起动激活                                              $    $                   $    $  ANS122.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  194.启停-直接起动可用                                              $    $                   $    $  ANS122.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  195.启停-IGC功能激活                                               $    $                   $    $  ANS122.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  196.启停-启停功能可用                                              $    $                   $    $  ANS122.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  197.启停-发动机启停状态                                            $    $                   $    $  ANS122.BYTE004  $  switxh(x&0x03)0x00:@0093;0x01:@07b0;0x02:@0095;0x03:@0096; 
  $  198.节气门跛行回家激活                                             $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  199.节气门关闭                                                     $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  200.发动机满负荷阶段                                               $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  201.发动机倒拖断油阶段                                             $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  202.发动机倒拖阶段                                                 $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  203.发动机怠速阶段                                                 $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  204.发动机起动后阶段                                               $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  205.发动机起动阶段                                                 $    $                   $    $  ANS122.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  206.下游氧传感器加热器状态-全功率加热标志位                        $    $                   $    $  ANS122.BYTE006  $  switxh(x&0x80)0x00:@09b4;0x80:@0365; 
  $  207.下游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS122.BYTE006  $  switxh(x&0x20)0x00:@09b4;0x20:@0365; 
  $  208.上游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS122.BYTE006  $  switxh(x&0x10)0x00:@09b4;0x10:@0365; 
  $  209.下游氧传感器准备运行                                           $    $                   $    $  ANS122.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  210.上游氧传感器准备运行                                           $    $                   $    $  ANS122.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  211.闭环控制激活                                                   $    $                   $    $  ANS122.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  212.倒档开关状态                                                   $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x80)0x00:@093d;0x80:@0208; 
  $  213.离合器顶开关状态                                               $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x40)0x00:@093d;0x40:@0208; 
  $  214.制动开关 2 状态                                                $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x20)0x00:@093d;0x20:@0208; 
  $  215.制动开关 1 状态                                                $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x10)0x00:@093d;0x10:@0208; 
  $  216.燃油泵继电器状态                                               $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x08)0x00:@093d;0x08:@0206; 
  $  217.主继电器状态                                                   $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x04)0x00:@093d;0x04:@0206; 
  $  218.启停-互锁继电器状态                                            $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  219.起动继电器状态                                                 $    $                   $    $  ANS123.BYTE003  $  switxh(x&0x01)0x00:@093d;0x01:@0206; 
  $  220.启停-HHC(坡道辅助)可用状态                                     $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  221.启停-发动机舱盖打开状态                                        $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  222.启停-驾驶员侧安全带未系状态                                    $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  223.启停-驾驶员侧车门打开状态                                      $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  224.启停-传动链开启-空挡位置开关状态                               $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x08)0x00:@093d;0x08:@0208; 
  $  225.启停-传动链开启-离合器底部位置开关状态                         $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x04)0x00:@093d;0x04:@0208; 
  $  226.启停-空挡开关状态                                              $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x02)0x00:@093d;0x02:@0208; 
  $  227.启停-启停主开关状态                                            $    $                   $    $  ANS123.BYTE004  $  switxh(x&0x01)0x00:@093d;0x01:@0208; 
  $  228.VCT排气执行器已就绪                                            $    $                   $    $  ANS123.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  229.VCT进气执行器已就绪                                            $    $                   $    $  ANS123.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  230.碰撞CAN信号输入状态                                            $    $                   $    $  ANS123.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  231.炭罐状态                                                       $    $                   $    $  ANS123.BYTE005  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  232.驻车挡/空挡开关状态                                            $    $                   $    $  ANS123.BYTE005  $  switxh(x&0x01)0x00:@093d;0x01:@0208; 
  $  233.后氧传感器加热器状态                                           $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  234.前氧传感器加热状态                                             $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  235.启停-启停系统警告指示灯状态                                    $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x20)0x00:@002e;0x20:@0037; 
  $  236.启停-启停系统指示灯状态                                        $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x10)0x00:@002e;0x10:@0037; 
  $  237.启停-充电故障指示灯状态                                        $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  238.机油指示灯状态                                                 $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  239.发动机DBW灯状态                                                $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  240.发动机MIL灯状态                                                $    $                   $    $  ANS123.BYTE006  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  241.涡轮增压器泄压阀状态(增压)                                     $    $                   $    $  ANS123.BYTE007  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  242.发动机机油阀状态                                               $    $                   $    $  ANS123.BYTE007  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  243.起动机电源打开                                                 $    $                   $    $  ANS123.BYTE007  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  244.发动机机油压力开关状态                                         $    $                   $    $  ANS123.BYTE007  $  switxh(x&0x08)0x00:@093d;0x08:@0208; 
  $  245.VIS状态                                                        $    $                   $    $  ANS123.BYTE007  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  246.二次空气泵继电器状态                                           $    $                   $    $  ANS123.BYTE007  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  247.启停-空气流量计(HFM)加热继电器状态                             $    $                   $    $  ANS123.BYTE007  $  switxh(x&0x01)0x00:@093d;0x01:@0206; 
  $  248.跛行回家-节气门电机故障                                        $    $                   $    $  ANS124.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  249.跛行回家-节气门自适应故障                                      $    $                   $    $  ANS124.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  250.跛行回家-凸轮轴传感器信号异常                                  $    $                   $    $  ANS124.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  251.跛行回家-曲轴传感器信号异常                                    $    $                   $    $  ANS124.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  252.变速器状态-起动允许状态                                        $    $                   $    $  ANS125.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  253.变速器状态-换挡过程中                                          $    $                   $    $  ANS125.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  254.变速器状态-蠕行控制功能激活                                    $    $                   $    $  ANS125.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  255.变速器状态-非排放相关故障激活                                  $    $                   $    $  ANS125.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  256.变速器状态-排放相关故障激活                                    $    $                   $    $  ANS125.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  257.催化就绪标志                                                   $    $                   $    $  ANS126.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  258.下游氧传感器准备就绪                                           $    $                   $    $  ANS126.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  259.上游氧传感器准备就绪                                           $    $                   $    $  ANS126.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  260.燃油系统的就绪标志                                             $    $                   $    $  ANS126.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  261.B4 类失火就绪标志                                              $    $                   $    $  ANS126.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  262.B1 类失火就绪标志                                              $    $                   $    $  ANS126.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  263.A类失火就绪标志                                                $    $                   $    $  ANS126.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  264.综合零件监视状态                                               $    $                   $    $  ANS126.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  265.燃油系统监控状态                                               $    $                   $    $  ANS126.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  266.失火监控状态                                                   $    $                   $    $  ANS126.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  267.支持综合零件监视                                               $    $                   $    $  ANS126.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  268.支持燃油系统监控                                               $    $                   $    $  ANS126.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  269.支持失火监控                                                   $    $                   $    $  ANS126.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  270.氧传感器加热器监控                                             $    $                   $    $  ANS126.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  271.氧传感器监控                                                   $    $                   $    $  ANS126.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  272.催化器监控                                                     $    $                   $    $  ANS126.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  273.扭矩信号-发动机扭矩减少失效状态                                $    $                   $    $  ANS127.BYTE003  $  switxh(x&0xE0)0x00:@009b;0x20:@009c;0x40:@009d;0x60:@009e;0x80:@009f; 
  $  274.扭矩信号-电子稳定程序(ESP)请求发动机扭矩减少激活               $    $                   $    $  ANS127.BYTE003  $  switxh(x&0x04)0x00:@00e7;0x04:@008b; 
  $  275.扭矩信号-动态稳定控制系统(SCS)激活                             $    $                   $    $  ANS127.BYTE003  $  switxh(x&0x02)0x00:@00e7;0x02:@008b; 
  $  276.扭矩信号-牵引控制系统(TCS)激活                                 $    $                   $    $  ANS127.BYTE003  $  switxh(x&0x01)0x00:@00e7;0x01:@008b; 
  $  277.远程起动-系统状态-动力总成运行退出                             $    $                   $    $  ANS128.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  278.远程起动-系统状态-动力总成起动退出                             $    $                   $    $  ANS128.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  279.远程起动-系统状态-发动机运行                                   $    $                   $    $  ANS128.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  280.远程起动-系统状态-系统状态                                     $    $                   $    $  ANS128.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  281.远程起动-系统状态-系统请求                                     $    $                   $    $  ANS128.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  282.远程起动-动力总成起动退出原因-车速超过限值                     $    $                   $    $  ANS129.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  283.远程起动-动力总成起动退出原因-换挡杆不在驻车挡位置             $    $                   $    $  ANS129.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  284.远程起动-动力总成起动退出原因-车辆发生碰撞                     $    $                   $    $  ANS129.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  285.远程起动-动力总成起动退出原因-动力总成状态禁用                 $    $                   $    $  ANS129.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  286.远程起动-动力总成起动退出原因-变速器状态禁用                   $    $                   $    $  ANS129.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  287.远程起动-动力总成起动退出原因-起动机达到最大起动时间           $    $                   $    $  ANS129.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  288.远程起动-动力总成起动退出原因-发动机故障灯亮                   $    $                   $    $  ANS129.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  289.远程起动-动力总成起动退出原因-与GW或SCS/ABS或TCM失去通讯       $    $                   $    $  ANS129.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  290.远程起动-动力总成起动退出原因-燃油油量太低                     $    $                   $    $  ANS129.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  291.远程起动-动力总成起动退出原因-KL15硬线被断开                   $    $                   $    $  ANS129.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  292.远程起动-动力总成运行退出原因-与GW或SCS/ABS或TCM失去通讯       $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  293.远程起动-动力总成运行退出原因-加速踏板踩下                     $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  294.远程起动-动力总成运行退出原因-发动机转速超过限值               $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  295.远程起动-动力总成运行退出原因-车速超过限值                     $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  296.远程起动-动力总成运行退出原因-换挡杆不在驻车挡位置             $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  297.远程起动-动力总成运行退出原因-超过最大允许运行时间             $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  298.远程起动-动力总成运行退出原因-机油压力低                       $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  299.远程起动-动力总成运行退出原因-发动机过热                       $    $                   $    $  ANS130.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  300.远程起动-动力总成运行退出原因-KL15硬线被断开                   $    $                   $    $  ANS130.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  301.远程起动-动力总成运行退出原因-未知原因                         $    $                   $    $  ANS130.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  302.远程起动-动力总成运行退出原因-发动机故障灯亮                   $    $                   $    $  ANS130.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  303.远程起动-动力总成运行退出原因-车辆发生碰撞                     $    $                   $    $  ANS130.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  304.发动机冷却液温度散热器                                         $    $  摄氏度           $    $  ANS131.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  305.发动机冷却液温度散热器电压值                                   $    $  伏               $    $  ANS132.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0002;elsey=(x1*256+x2-0xFFFF)*0.0002; 
  $  306.发动机冷却液温度气缸电压值                                     $    $  伏               $    $  ANS133.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.002;elsey=(x1*256+x2-0xFFFF)*0.002; 
  $  307.周围空气温度                                                   $    $  摄氏度           $    $  ANS134.BYTE003  $  y=(x)*0.75-48; 
  $  308.环境空气温度电压值                                             $    $  伏               $    $  ANS135.BYTE003  $  y=(x)*0.01953125; 
  $  309.清洗流量压力                                                   $    $  百帕             $    $  ANS136.BYTE003  $  y=(x1*256+x2)*0.0390625; 
  $  310.清洗流量压力电压值                                             $    $  伏               $    $  ANS137.BYTE003  $  y=(x1*256+x2)*0.00030517578125; 
  $  311.燃油箱压力                                                     $    $  百帕             $    $  ANS138.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0246305418719212;elsey=(x1*256+x2-0xFFFF)*0.0246305418719212; 
  $  312.燃油箱压力电压值                                               $    $  伏               $    $  ANS139.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  313.GPF碳烟颗粒负载-模拟值                                         $    $                   $    $  ANS140.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  314.GPF碳烟颗粒负载-测量值                                         $    $                   $    $  ANS140.BYTE005  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  315.灰烬负载-基于CCF计算灰烬系数                                   $    $                   $    $  ANS141.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  316.灰烬负载-用于计算灰烬的燃油消耗量                              $    $  升               $    $  ANS141.BYTE005  $  if(0x80>x1)y=(x1*256+x2)*10;elsey=(x1*256+x2-0xFFFF)*10; 
  $  317.灰烬负载-用于计算灰烬的发动机运行时间                          $    $  秒               $    $  ANS141.BYTE007  $  if(0x80>x1)y=(x1*16777216+x2*65536+x3*256+x4)*1;elsey=(x1*16777216+x2*65536+x3*256+x4-4294967295)*1; 
  $  318.GPF压差传感器自学习适应值-实际值                               $    $  千帕             $    $  ANS142.BYTE003  $  if(0x80>x1)y=(x1*256+x2)*0.00390625;elsey=(x1*256+x2-0xFFFF)*0.00390625; 
  $  319.GPF压差力传感器自学习适应值-旧值                               $    $  千帕             $    $  ANS142.BYTE005  $  if(0x80>x1)y=(x1*256+x2)*0.00390625;elsey=(x1*256+x2-0xFFFF)*0.00390625; 
  $  320.1缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS143.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  321.2缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS144.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  322.3缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS145.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  323.4缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS146.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00710732054015636;elsey=(x1*256+x2-0xFFFF)*0.00710732054015636; 
  $  324.爆震点火角修正值                                               $    $  曲轴转角         $    $  ANS147.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  325.爆震窗口角度初始值                                             $    $  度               $    $  ANS148.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0219731927049;elsey=(x1*256+x2-0xFFFF)*0.0219731927049; 
  $  326.爆震窗口角度                                                   $    $  秒               $    $  ANS149.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0219731927049;elsey=(x1*256+x2-0xFFFF)*0.0219731927049; 
  $  327.爆震能量                                                       $    $  伏特             $    $  ANS150.BYTE003  $  y=7.62939453125e-05*(x1*256+x2); 
  $  328.速度辅助系统模式                                               $    $                   $    $  ANS151.BYTE003  $  switxh(x)0x00:@002e;0x01:@0c95;0x02:@0c96;0x03:@0c97; 
  $  329.速度辅助系统状态                                               $    $                   $    $  ANS152.BYTE003  $  switxh(x)0x00:@002e;0x01:@002f;0x02:@0030;0x03:@0031;0x04:@07e4;0x05:@0070;0x06:@0c94; 
  $  330.速度辅助系统目标速度                                           $    $  千米/时          $    $  ANS153.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  331.车速辅助系统-系统目标速度源状态                                $    $                   $    $  ANS154.BYTE003  $  switxh(x)0x00:@00e8;0x01:@0af1;0x02:@0070;0x03:@0af2; 
  $  332.底盘系统发动机扭矩请求扩展范围-扭矩干预类型                    $    $                   $    $  ANS155.BYTE003  $  if(0x80>x)y=(x)*1;elsey=(x-0xFF)*1; 
  $  333.底盘系统发动机扭矩请求扩展范围-扭矩请求值                      $    $  牛米             $    $  ANS156.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  334.发动机油温度                                                   $    $  摄氏度           $    $  ANS157.BYTE003  $  y=(x1*256+x2)*0.0234-273.15; 
  $  335.Lambda读取值                                                   $    $                   $    $  ANS158.BYTE003  $  y=(x1*256+x2)*0.000244140625; 
  $  336.空气质量流量原始值                                             $    $  伏               $    $  ANS159.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  337.空调压缩机实际功率                                             $    $  千瓦             $    $  ANS160.BYTE003  $  y=(x)*0.03; 
  $  338.驱动单元冷却液温度                                             $    $  摄氏度           $    $  ANS161.BYTE003  $  y=(x)*1-40; 
  $  339.集成式起动机发电机实际扭矩                                     $    $  牛米             $    $  ANS162.BYTE003  $  y=(x1*256+x2)*0.5-512; 
  $  340.诊断怠速请求状态                                               $    $                   $    $  ANS163.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0a84;0x02:@0a85; 
  $  341.混动发动机启动请求状态                                         $    $                   $    $  ANS164.BYTE003  $  y=(x)*1; 
  $  342.怠速积分器I部分                                                $    $  百分比           $    $  ANS165.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0030517578125;elsey=(x1*256+x2-0xFFFF)*0.0030517578125; 
  $  343.怠速调节器-PD部分                                              $    $  百分比           $    $  ANS166.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  344.混动发动机故障状态                                             $    $                   $    $  ANS167.BYTE003  $  switxh(x)0x00:@001a;0x01:@0a6d;0x02:@0a70;0x03:@0a6e;0x04:@0a6f;0x05:@0096; 
  $  345.失火诊断计数                                                   $    $                   $    $  ANS168.BYTE003  $  y=(x1*256+x2)*1; 
  $  346.混动发动机催化器状态                                           $    $                   $    $  ANS169.BYTE003  $  switxh(x)0x00:@0a4c;0x01:@0a4d; 
  $  347.电子电力箱(PEB)冷却液泵状态                                    $    $                   $    $  ANS170.BYTE003  $  switxh(x)0x00:@0a58;0x01:@0a59;0x02:@0a7c;0x03:@0a7d; 
  $  348.电动车辆系统模式                                               $    $                   $    $  ANS171.BYTE003  $  switxh(x)0x00:@027d;0x01:@09b8;0x02:@09b9;0x03:@09ba;0x04:@09bb;0x05:@09bc;0x06:@09bd;0x07:@09be;0x08:@09bf; 
  $  349.混动动力总成-发动机曲轴扭矩慢速请求                            $    $  牛米             $    $  ANS172.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  350.混动动力总成-发动机曲轴扭矩快速请求                            $    $  牛米             $    $  ANS173.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  351.混动动力总成-燃油切断请求                                      $    $                   $    $  ANS174.BYTE003  $  y=(x)*1; 
  $  352.故障发生-输入的TC CAN信号                                      $    $                   $    $  ANS175.BYTE003  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  353.故障发生-输入的TBOX CAN信号                                    $    $                   $    $  ANS175.BYTE003  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  354.故障发生-输入的AC CAN信号                                      $    $                   $    $  ANS175.BYTE003  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  355.故障发生-输入的BMS CAN信号                                     $    $                   $    $  ANS175.BYTE003  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  356.故障发生-输入的ISC CAN信号                                     $    $                   $    $  ANS175.BYTE003  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  357.故障发生-输入的HCU CAN信号                                     $    $                   $    $  ANS175.BYTE003  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  358.ISG怠速充电扭矩自学习标志位                                    $    $                   $    $  ANS176.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  359.ISG怠速充电闭环控制标志位                                      $    $                   $    $  ANS176.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  360.HCU请求扭矩准备启动信号                                        $    $                   $    $  ANS176.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  361.HCU请求启动发动机信号                                          $    $                   $    $  ANS176.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  362.DMTL泵驱动电流                                                 $    $  毫安             $    $  ANS177.BYTE003  $  y=(x1*256+x2)*0.006103515625; 
  $  363.HCU请求的离合器端气路需求扭矩                                  $    $                   $    $  ANS178.BYTE003  $  y=(x)*0.5-848; 
  $  364.HCU请求的离合器端火路需求扭矩                                  $    $                   $    $  ANS179.BYTE003  $  y=(x)*0.5-848; 
  $  365.HCU的转速请求类型                                              $    $                   $    $  ANS180.BYTE003  $  y=(x)*1; 
  $  366.HCU的转速请求值                                                $    $                   $    $  ANS181.BYTE003  $  y=(x)*10; 
  $  367.HCU的火路扭矩请求类型                                          $    $                   $    $  ANS182.BYTE003  $  y=(x)*1; 
  $  368.HCU发送的离合器状态信号                                        $    $                   $    $  ANS183.BYTE003  $  y=(x)*1; 
  $  369.高压油箱压力                                                   $    $                   $    $  ANS184.BYTE003  $  y=(x)*12.6-800; 
  $  370.混合气自适应值（初始写入值）                                   $    $                   $    $  ANS185.BYTE003  $  y=3.0517578125e-05*(x1*256+x2); 
  $  371.混合气自适应值（当前适应值）                                   $    $                   $    $  ANS186.BYTE003  $  y=3.0517578125e-05*(x1*256+x2); 
  $  372.经济驾驶模式激活指示灯点亮                                     $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  373.曲轴扭矩减少激活                                               $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  374.高压电池切断                                                   $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  375.高压动力准备就绪                                               $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  376.混动发动机起动完成                                             $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  377.混动发动机断油完成                                             $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  378.混动发动机闭环激活                                             $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  379.Open Powertrain_TCM                                            $    $                   $    $  ANS123.BYTE008  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  380.燃油泄漏诊断模块阀                                             $    $                   $    $  ANS123.BYTE009  $  switxh(x&0x40)0x00:@0037;0x40:@002e; 
  $  381.燃油泄漏诊断模块泵                                             $    $                   $    $  ANS123.BYTE009  $  switxh(x&0x20)0x00:@002e;0x20:@0037; 
  $  382.清洗泵                                                         $    $                   $    $  ANS123.BYTE009  $  switxh(x&0x10)0x00:@002e;0x10:@0037; 
  $  383.碳罐关闭阀                                                     $    $                   $    $  ANS123.BYTE009  $  switxh(x&0x08)0x00:@0037;0x08:@002e; 
  $  384.GPF负载水平                                                    $    $                   $    $  ANS187.BYTE003  $  if(0x80>x1)y=(x1*256+x2)*0.0001;elsey=(x1*256+x2-0xFFFF)*0.0001; 
  $  385.GPF再生状态                                                    $    $                   $    $  ANS188.BYTE003  $  y=(x)*1; 
  $  386.冷却风扇 1 继电器状态                                          $    $                   $    $  ANS120.BYTE003  $  y=(x&0x10)*1; 
  $  387.冷却风扇 2 继电器状态                                          $    $                   $    $  ANS120.BYTE003  $  y=(x&0x20)>>5; 
  $  388.GPFδ压力                                                      $    $  百帕             $    $  ANS189.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0390625;elsey=(x1*256+x2-0xFFFF)*0.0390625; 
  $  389.颗粒捕集器压差传感器电压                                       $    $  毫伏             $    $  ANS190.BYTE003  $  y=(x1*256+x2)*1; 
  $  390.GPF上游温度                                                    $    $  摄氏度           $    $  ANS191.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  391.颗粒捕集器上游温度传感器电压                                   $    $  毫伏             $    $  ANS192.BYTE003  $  y=(x1*256+x2)*0.2; 
  $  392.颗粒捕集器下游温度传感器温度                                   $    $  摄氏度           $    $  ANS193.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  393.颗粒捕集器下游温度传感器电压                                   $    $  毫伏             $    $  ANS194.BYTE003  $  y=(x1*256+x2)*0.2; 
  $  394.GPF灰分因子                                                    $    $                   $    $  ANS195.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  395.售后模拟灰烬值                                                 $    $                   $    $  ANS196.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 

;******************************************************************************************************************************************************

