
     系统名称:ECM (发动机控制模块)

     系统ID:0000441F

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 03 00 00 00 00 00       $~ ANS000:7E8 02 10 03 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 01 00 00 00 00 00       $~ ANS000:7E8 02 10 01 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10385653&quot;: &quot;0000441F&quot;, &quot;10425930&quot;: &quot;00004420&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10385653&quot;: &quot;0000441F&quot;, &quot;10425930&quot;: &quot;00004420&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E0 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/0000441F

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E0 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ002:7E0 03 22 F1 87 00 00 00 00            $%  
  $%  REQ003:7E0 03 22 F1 91 00 00 00 00            $%  
  $%  REQ004:7E0 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ005:7E0 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ006:7E0 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ007:7E0 03 22 F1 10 00 00 00 00            $%  
  $%  REQ008:7E0 03 22 F1 20 00 00 00 00            $%  
  $%  REQ009:7E0 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ010:7E0 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ011:7E0 03 22 F1 00 00 00 00 00            $%  

  $%  000:车辆识别代码(VIN)               $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:车辆特征信息 (FK)               $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  002:电控单元零件号                  $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元硬件号                  $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元应用软件号              $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元标定软件号              $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元制造日期                $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:刷新里程读数                    $%    $%  ANS007.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 
  $%  008:网络配置文件零件号出厂值        $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  009:电控单元索引信息                $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3); 
  $%  010:电控单元序列号                  $%    $%  ANS010.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  011:刷新工具参考号记录              $%    $%  ANS007.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  012:ECU软件校验号                   $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E0 03 22 B0 00 00 00 00 00            $  
  $  REQ001:7E0 03 22 B0 01 00 00 00 00            $  
  $  REQ002:7E0 03 22 B0 02 00 00 00 00            $  
  $  REQ003:7E0 03 22 B0 03 00 00 00 00            $  
  $  REQ004:7E0 03 22 B0 04 00 00 00 00            $  
  $  REQ005:7E0 03 22 B0 05 00 00 00 00            $  
  $  REQ006:7E0 03 22 B0 06 00 00 00 00            $  
  $  REQ007:7E0 03 22 B0 07 00 00 00 00            $  
  $  REQ008:7E0 03 22 B0 08 00 00 00 00            $  
  $  REQ009:7E0 03 22 B0 09 00 00 00 00            $  
  $  REQ010:7E0 03 22 B0 10 00 00 00 00            $  
  $  REQ011:7E0 03 22 B0 11 00 00 00 00            $  
  $  REQ012:7E0 03 22 B0 12 00 00 00 00            $  
  $  REQ013:7E0 03 22 B0 15 00 00 00 00            $  
  $  REQ014:7E0 03 22 B0 16 00 00 00 00            $  
  $  REQ015:7E0 03 22 B0 17 00 00 00 00            $  
  $  REQ016:7E0 03 22 B0 18 00 00 00 00            $  
  $  REQ017:7E0 03 22 B0 19 00 00 00 00            $  
  $  REQ018:7E0 03 22 B0 20 00 00 00 00            $  
  $  REQ019:7E0 03 22 B0 21 00 00 00 00            $  
  $  REQ020:7E0 03 22 B0 24 00 00 00 00            $  
  $  REQ021:7E0 03 22 B0 26 00 00 00 00            $  
  $  REQ022:7E0 03 22 B0 29 00 00 00 00            $  
  $  REQ023:7E0 03 22 B0 30 00 00 00 00            $  
  $  REQ024:7E0 03 22 B0 32 00 00 00 00            $  
  $  REQ025:7E0 03 22 B0 33 00 00 00 00            $  
  $  REQ026:7E0 03 22 B0 34 00 00 00 00            $  
  $  REQ027:7E0 03 22 B0 38 00 00 00 00            $  
  $  REQ028:7E0 03 22 B0 40 00 00 00 00            $  
  $  REQ029:7E0 03 22 B0 41 00 00 00 00            $  
  $  REQ030:7E0 03 22 B0 42 00 00 00 00            $  
  $  REQ031:7E0 03 22 B0 43 00 00 00 00            $  
  $  REQ032:7E0 03 22 B0 44 00 00 00 00            $  
  $  REQ033:7E0 03 22 B0 45 00 00 00 00            $  
  $  REQ034:7E0 03 22 B0 46 00 00 00 00            $  
  $  REQ035:7E0 03 22 B0 49 00 00 00 00            $  
  $  REQ036:7E0 03 22 B0 50 00 00 00 00            $  
  $  REQ037:7E0 03 22 B0 51 00 00 00 00            $  
  $  REQ038:7E0 03 22 B0 52 00 00 00 00            $  
  $  REQ039:7E0 03 22 B0 53 00 00 00 00            $  
  $  REQ040:7E0 03 22 B0 54 00 00 00 00            $  
  $  REQ041:7E0 03 22 B0 55 00 00 00 00            $  
  $  REQ042:7E0 03 22 B0 56 00 00 00 00            $  
  $  REQ043:7E0 03 22 B0 57 00 00 00 00            $  
  $  REQ044:7E0 03 22 B0 58 00 00 00 00            $  
  $  REQ045:7E0 03 22 B0 59 00 00 00 00            $  
  $  REQ046:7E0 03 22 B0 60 00 00 00 00            $  
  $  REQ047:7E0 03 22 B0 61 00 00 00 00            $  
  $  REQ048:7E0 03 22 B0 62 00 00 00 00            $  
  $  REQ049:7E0 03 22 B0 63 00 00 00 00            $  
  $  REQ050:7E0 03 22 B0 64 00 00 00 00            $  
  $  REQ051:7E0 03 22 B0 65 00 00 00 00            $  
  $  REQ052:7E0 03 22 B0 66 00 00 00 00            $  
  $  REQ053:7E0 03 22 B0 68 00 00 00 00            $  
  $  REQ054:7E0 03 22 B0 70 00 00 00 00            $  
  $  REQ055:7E0 03 22 B0 71 00 00 00 00            $  
  $  REQ056:7E0 03 22 B1 01 00 00 00 00            $  
  $  REQ057:7E0 03 22 B1 02 00 00 00 00            $  
  $  REQ058:7E0 03 22 B1 03 00 00 00 00            $  
  $  REQ059:7E0 03 22 B1 07 00 00 00 00            $  
  $  REQ060:7E0 03 22 B1 15 00 00 00 00            $  
  $  REQ061:7E0 03 22 B1 16 00 00 00 00            $  
  $  REQ062:7E0 03 22 B1 17 00 00 00 00            $  
  $  REQ063:7E0 03 22 B1 18 00 00 00 00            $  
  $  REQ064:7E0 03 22 B1 19 00 00 00 00            $  
  $  REQ065:7E0 03 22 B1 20 00 00 00 00            $  
  $  REQ066:7E0 03 22 B1 21 00 00 00 00            $  
  $  REQ067:7E0 03 22 B1 23 00 00 00 00            $  
  $  REQ068:7E0 03 22 B1 24 00 00 00 00            $  
  $  REQ069:7E0 03 22 B1 25 00 00 00 00            $  
  $  REQ070:7E0 03 22 B1 26 00 00 00 00            $  
  $  REQ071:7E0 03 22 B1 27 00 00 00 00            $  
  $  REQ072:7E0 03 22 B1 30 00 00 00 00            $  
  $  REQ073:7E0 03 22 B1 33 00 00 00 00            $  
  $  REQ074:7E0 03 22 B1 34 00 00 00 00            $  
  $  REQ075:7E0 03 22 B1 35 00 00 00 00            $  
  $  REQ076:7E0 03 22 B1 36 00 00 00 00            $  
  $  REQ077:7E0 03 22 B1 40 00 00 00 00            $  
  $  REQ078:7E0 03 22 B1 41 00 00 00 00            $  
  $  REQ079:7E0 03 22 B1 42 00 00 00 00            $  
  $  REQ080:7E0 03 22 B1 43 00 00 00 00            $  
  $  REQ081:7E0 03 22 B1 44 00 00 00 00            $  
  $  REQ082:7E0 03 22 B1 45 00 00 00 00            $  
  $  REQ083:7E0 03 22 B1 46 00 00 00 00            $  
  $  REQ084:7E0 03 22 B1 50 00 00 00 00            $  
  $  REQ085:7E0 03 22 B1 51 00 00 00 00            $  
  $  REQ086:7E0 03 22 B1 52 00 00 00 00            $  
  $  REQ087:7E0 03 22 B1 55 00 00 00 00            $  
  $  REQ088:7E0 03 22 B1 56 00 00 00 00            $  
  $  REQ089:7E0 03 22 B1 57 00 00 00 00            $  
  $  REQ090:7E0 03 22 B1 58 00 00 00 00            $  
  $  REQ091:7E0 03 22 B1 59 00 00 00 00            $  
  $  REQ092:7E0 03 22 B1 60 00 00 00 00            $  
  $  REQ093:7E0 03 22 B1 61 00 00 00 00            $  
  $  REQ094:7E0 03 22 B1 62 00 00 00 00            $  
  $  REQ095:7E0 03 22 B1 63 00 00 00 00            $  
  $  REQ096:7E0 03 22 B1 64 00 00 00 00            $  
  $  REQ097:7E0 03 22 B1 65 00 00 00 00            $  
  $  REQ098:7E0 03 22 B2 00 00 00 00 00            $  
  $  REQ099:7E0 03 22 B2 04 00 00 00 00            $  
  $  REQ100:7E0 03 22 B2 05 00 00 00 00            $  
  $  REQ101:7E0 03 22 B2 07 00 00 00 00            $  
  $  REQ102:7E0 03 22 B2 13 00 00 00 00            $  
  $  REQ103:7E0 03 22 B2 18 00 00 00 00            $  
  $  REQ104:7E0 03 22 B2 19 00 00 00 00            $  
  $  REQ105:7E0 03 22 B2 20 00 00 00 00            $  
  $  REQ106:7E0 03 22 B2 21 00 00 00 00            $  
  $  REQ107:7E0 03 22 B3 00 00 00 00 00            $  
  $  REQ108:7E0 03 22 B3 01 00 00 00 00            $  
  $  REQ109:7E0 03 22 B3 04 00 00 00 00            $  
  $  REQ110:7E0 03 22 B3 05 00 00 00 00            $  
  $  REQ111:7E0 03 22 B3 06 00 00 00 00            $  
  $  REQ112:7E0 03 22 B3 07 00 00 00 00            $  
  $  REQ113:7E0 03 22 B3 08 00 00 00 00            $  
  $  REQ114:7E0 03 22 B3 10 00 00 00 00            $  
  $  REQ115:7E0 03 22 B3 16 00 00 00 00            $  
  $  REQ116:7E0 03 22 B3 17 00 00 00 00            $  
  $  REQ117:7E0 03 22 B3 20 00 00 00 00            $  
  $  REQ118:7E0 03 22 B3 21 00 00 00 00            $  
  $  REQ119:7E0 03 22 B3 22 00 00 00 00            $  
  $  REQ120:7E0 03 22 B3 23 00 00 00 00            $  
  $  REQ121:7E0 03 22 B3 24 00 00 00 00            $  
  $  REQ122:7E0 03 22 B3 25 00 00 00 00            $  
  $  REQ123:7E0 03 22 B3 26 00 00 00 00            $  
  $  REQ124:7E0 03 22 B3 27 00 00 00 00            $  
  $  REQ125:7E0 03 22 B3 28 00 00 00 00            $  
  $  REQ126:7E0 03 22 B3 29 00 00 00 00            $  
  $  REQ127:7E0 03 22 B3 30 00 00 00 00            $  
  $  REQ128:7E0 03 22 B3 31 00 00 00 00            $  
  $  REQ129:7E0 03 22 B3 35 00 00 00 00            $  
  $  REQ130:7E0 03 22 B3 36 00 00 00 00            $  
  $  REQ131:7E0 03 22 B3 37 00 00 00 00            $  
  $  REQ132:7E0 03 22 B3 38 00 00 00 00            $  
  $  REQ133:7E0 03 22 B4 01 00 00 00 00            $  
  $  REQ134:7E0 03 22 B4 02 00 00 00 00            $  
  $  REQ135:7E0 03 22 B4 03 00 00 00 00            $  
  $  REQ136:7E0 03 22 B4 04 00 00 00 00            $  
  $  REQ137:7E0 03 22 B4 05 00 00 00 00            $  
  $  REQ138:7E0 03 22 B4 06 00 00 00 00            $  
  $  REQ139:7E0 03 22 B4 07 00 00 00 00            $  
  $  REQ140:7E0 03 22 B4 09 00 00 00 00            $  
  $  REQ141:7E0 03 22 B4 10 00 00 00 00            $  
  $  REQ142:7E0 03 22 B4 11 00 00 00 00            $  
  $  REQ143:7E0 03 22 B4 12 00 00 00 00            $  
  $  REQ144:7E0 03 22 B4 13 00 00 00 00            $  
  $  REQ145:7E0 03 22 B4 14 00 00 00 00            $  
  $  REQ146:7E0 03 22 B4 15 00 00 00 00            $  
  $  REQ147:7E0 03 22 B4 16 00 00 00 00            $  
  $  REQ148:7E0 03 22 B4 17 00 00 00 00            $  
  $  REQ149:7E0 03 22 B4 20 00 00 00 00            $  
  $  REQ150:7E0 03 22 B4 21 00 00 00 00            $  
  $  REQ151:7E0 03 22 B4 22 00 00 00 00            $  
  $  REQ152:7E0 03 22 B0 36 00 00 00 00            $  
  $  REQ153:7E0 03 22 B0 37 00 00 00 00            $  
  $  REQ154:7E0 03 22 B0 0A 00 00 00 00            $  
  $  REQ155:7E0 03 22 B0 0B 00 00 00 00            $  
  $  REQ156:7E0 03 22 B0 0D 00 00 00 00            $  
  $  REQ157:7E0 03 22 B0 0E 00 00 00 00            $  
  $  REQ158:7E0 03 22 B0 1A 00 00 00 00            $  
  $  REQ159:7E0 03 22 B0 1C 00 00 00 00            $  
  $  REQ160:7E0 03 22 B0 1E 00 00 00 00            $  
  $  REQ161:7E0 03 22 B0 3B 00 00 00 00            $  
  $  REQ162:7E0 03 22 B0 4D 00 00 00 00            $  
  $  REQ163:7E0 03 22 B0 4E 00 00 00 00            $  
  $  REQ164:7E0 03 22 B0 4F 00 00 00 00            $  
  $  REQ165:7E0 03 22 B1 90 00 00 00 00            $  
  $  REQ166:7E0 03 22 B1 91 00 00 00 00            $  
  $  REQ167:7E0 03 22 B2 03 00 00 00 00            $  
  $  REQ168:7E0 03 22 B3 14 00 00 00 00            $  
  $  REQ169:7E0 03 22 B0 5B 00 00 00 00            $  
  $  REQ170:7E0 03 22 B0 13 00 00 00 00            $  

  $  000.周围空气压力                                                        $    $  千帕           $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.0039; 
  $  001.空调压力                                                            $    $  千帕           $    $  ANS001.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.2;elsey=(x1*256+x2-0xFFFF)*0.2; 
  $  002.空调压力原始值                                                      $    $  伏             $    $  ANS002.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0002;elsey=(x1*256+x2-0xFFFF)*0.0002; 
  $  003.ECM供电电压(KL87)                                                   $    $  伏             $    $  ANS003.BYTE003  $  y=(x1*256+x2)*0.024; 
  $  004.点火开关供电电压                                                    $    $  伏             $    $  ANS004.BYTE003  $  y=(x)*0.094; 
  $  005.主继电器供电电压                                                    $    $  伏             $    $  ANS005.BYTE003  $  y=(x)*0.1; 
  $  006.启停-下次起动时蓄电池电压                                           $    $  伏             $    $  ANS006.BYTE003  $  y=(x)*0.0625; 
  $  007.启停-下次起动后蓄电池电压                                           $    $  伏             $    $  ANS007.BYTE003  $  y=(x)*0.0625; 
  $  008.启停-来自CAN线的蓄电池电压                                          $    $  伏             $    $  ANS008.BYTE003  $  y=(x1*256+x2)*0.0009765625+3; 
  $  009.启停-蓄电池电流                                                     $    $  安             $    $  ANS009.BYTE003  $  y=(x1*256+x2)*0.0625-2048; 
  $  010.启停-蓄电池温度                                                     $    $  摄氏度         $    $  ANS010.BYTE003  $  y=(x)*1-40; 
  $  011.启停-蓄电池充电状态                                                 $    $  百分比         $    $  ANS011.BYTE003  $  y=(x)*1; 
  $  012.启停-制动真空压力                                                   $    $  百帕           $    $  ANS012.BYTE003  $  y=(x1*256+x2)*0.0390625; 
  $  013.增压压力                                                            $    $  千帕           $    $  ANS013.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  014.增压器压力电压原始值                                                $    $  伏             $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  015.进气凸轮轴相位(VVT)                                                 $    $  度             $    $  ANS015.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  016.排气凸轮轴相位(VVT)                                                 $    $  度             $    $  ANS016.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  017.气门重叠角(VVT)                                                     $    $  度             $    $  ANS017.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  018.碳罐PWM占空比                                                       $    $  百分比         $    $  ANS018.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  019.启停-离合器踏板传感器PWM占空比                                      $    $  百分比         $    $  ANS019.BYTE003  $  y=(x)*0.390625; 
  $  020.ECM内部碰撞检测计数                                                 $    $  计数           $    $  ANS020.BYTE003  $  y=(x)*1; 
  $  021.油门踏板需求                                                        $    $  百分比         $    $  ANS021.BYTE003  $  y=(x)*0.392; 
  $  022.加速踏板位置1传感器电压                                             $    $  伏             $    $  ANS022.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  023.加速踏板位置2传感器电压                                             $    $  伏             $    $  ANS023.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  024.发动机冷却液温度                                                    $    $  摄氏度         $    $  ANS024.BYTE003  $  y=(x)*0.75-48; 
  $  025.发动机冷却液温度传感器电压                                          $    $  伏             $    $  ANS025.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  026.发动机油温度                                                        $    $  摄氏度         $    $  ANS026.BYTE003  $  y=(x)*0.752-48; 
  $  027.发动机转速                                                          $    $  转/分          $    $  ANS027.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  028.电子节温器控制占空比                                                $    $  百分比         $    $  ANS028.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.01;elsey=(x1*256+x2-0xFFFF)*0.01; 
  $  029.燃油油轨压力(GDI)                                                   $    $  兆帕           $    $  ANS029.BYTE003  $  y=(x1*256+x2)*0.0005; 
  $  030.油轨压力传感器电压原始值                                            $    $  伏             $    $  ANS030.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  031.油箱油位                                                            $    $  升             $    $  ANS031.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  032.启停-发电机目标电压                                                 $    $  伏             $    $  ANS032.BYTE003  $  y=(x)*0.1+10.6; 
  $  033.启停-发电机负载循环反馈                                             $    $  百分比         $    $  ANS033.BYTE003  $  y=(x)*3.2258; 
  $  034.高压油泵控制阀PWM占空比(GDI)                                        $    $  度             $    $  ANS034.BYTE003  $  if(0x80>x)y=(x)*0.1;elsey=(x-0xFF)*0.1; 
  $  035.进气歧管空气温度                                                    $    $  摄氏度         $    $  ANS035.BYTE003  $  y=(x)*0.75-48; 
  $  036.进气歧管空气温度传感器电压                                          $    $  伏             $    $  ANS036.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  037.进气歧管绝对压力                                                    $    $  千帕           $    $  ANS037.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  038.进气歧管绝对压力电压原始值                                          $    $  伏             $    $  ANS038.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  039.后氧传感器电压                                                      $    $  伏特           $    $  ANS039.BYTE003  $  y=(x)*0.0052-0.2; 
  $  040.下游氧传感器电压                                                    $    $  伏特           $    $  ANS040.BYTE003  $  y=(x1*256+x2)*0.0049-1; 
  $  041.前氧传感器电压                                                      $    $  伏特           $    $  ANS041.BYTE003  $  y=(x1*256+x2)*0.0049; 
  $  042.上游氧传感器电压                                                    $    $  伏特           $    $  ANS042.BYTE003  $  y=(x1*256+x2)*0.0049-1; 
  $  043.上游氧传感器加热器PWM占空比                                         $    $  秒             $    $  ANS043.BYTE003  $  y=(x)*0.003; 
  $  044.下游氧传感器加热器PWM占空比                                         $    $  秒             $    $  ANS044.BYTE003  $  y=(x)*0.01; 
  $  045.废气控制阀PWM占空比(增压)                                           $    $  百分比         $    $  ANS045.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  046.车轮路噪                                                            $    $  米每平方秒     $    $  ANS046.BYTE003  $  y=(x)*0.217; 
  $  047.车速                                                                $    $  千米/时        $    $  ANS047.BYTE003  $  y=(x)*1.25; 
  $  048.启停-蓄电池电量预测精度                                             $    $                 $    $  ANS048.BYTE003  $  switxh(x)0x00:@01dc;0x01:@01dd;0x02:@01de; 
  $  049.启停-下次起动时蓄电池电压下降预测精度                               $    $                 $    $  ANS049.BYTE003  $  switxh(x)0x00:@01dc;0x01:@01dd;0x02:@01de; 
  $  050.启停-下次起动时蓄电池电压下降后反弹预测精度                         $    $                 $    $  ANS050.BYTE003  $  switxh(x)0x00:@01dc;0x01:@01dd;0x02:@01de; 
  $  051.启停-坡度                                                           $    $  百分比         $    $  ANS051.BYTE003  $  if(0x80>x)y=(x)*1;elsey=(x-0xFF)*1; 
  $  052.启停-转向角                                                         $    $  度             $    $  ANS052.BYTE003  $  y=(x1*256+x2)*0.1-780; 
  $  053.空气质量流量 （每小时）                                             $    $  千克每小时     $    $  ANS053.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  054.进气凸轮轴目标相位                                                  $    $  曲轴转角       $    $  ANS054.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  055.排气凸轮轴目标相位                                                  $    $  曲轴转角       $    $  ANS055.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  056.环境压力修正系数                                                    $    $                 $    $  ANS056.BYTE003  $  y=(x1*256+x2)*0.00006; 
  $  057.发动机DBW灯亮后行驶里程值                                           $    $  千米           $    $  ANS057.BYTE003  $  y=(x1*256+x2)*1; 
  $  058.发动机MIL灯亮后行驶里程值                                           $    $  公里           $    $  ANS058.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.001; 
  $  059.发动机控制状态-发动机起动中                                         $    $                 $    $  ANS059.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  060.发动机控制状态-发动机起动完成                                       $    $                 $    $  ANS059.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  061.发动机控制状态-发动机怠速中                                         $    $                 $    $  ANS059.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  062.发动机控制状态-怠速控制置位                                         $    $                 $    $  ANS059.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  063.发动机控制状态-空燃比闭环控制置位                                   $    $                 $    $  ANS059.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  064.发动机控制状态-空燃比开环控制置位                                   $    $                 $    $  ANS059.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  065.发动机转速限制错误                                                  $    $                 $    $  ANS060.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  066.发动机关闭时间                                                      $    $  秒             $    $  ANS061.BYTE003  $  if(128>x1)y=(x1*16777216+x2*65536+x3*256+x4)*0.5;elsey=(x1*16777216+x2*65536+x3*256+x4)*0.5-2147483648; 
  $  067.动力系统关闭时间                                                    $    $  秒             $    $  ANS062.BYTE003  $  if(128>x1)y=(x1*16777216+x2*65536+x3*256+x4)*0.5;elsey=(x1*16777216+x2*65536+x3*256+x4)*0.5-2147483648; 
  $  068.发动机起动后燃油消耗量(GDI)                                         $    $  毫升           $    $  ANS063.BYTE003  $  y=(x1*256+x2)*16; 
  $  069.短期油量修正平均值                                                  $    $                 $    $  ANS064.BYTE003  $  y=(x)*1; 
  $  070.燃油修正长期加法值                                                  $    $                 $    $  ANS065.BYTE003  $  y=(x)*1; 
  $  071.长期乘法燃油修正                                                    $    $                 $    $  ANS066.BYTE003  $  y=(x1*256+x2)*0.0000305; 
  $  072.点火平均角                                                          $    $  千瓦*时        $    $  ANS067.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  073.1缸点火角                                                           $    $  千瓦*时        $    $  ANS068.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  074.2缸点火角                                                           $    $  千瓦*时        $    $  ANS069.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  075.3缸点火角                                                           $    $  千瓦*时        $    $  ANS070.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  076.4缸点火角                                                           $    $  千瓦*时        $    $  ANS071.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  077.喷射时间                                                            $    $  毫秒           $    $  ANS072.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.001; 
  $  078.空调长期怠速调节值                                                  $    $  转/分          $    $  ANS073.BYTE003  $  y=(x)*10; 
  $  079.怠速长期调节                                                        $    $  百分比         $    $  ANS074.BYTE003  $  y=(x1*256+x2)*0.00152587890625; 
  $  080.怠速速度设定值                                                      $    $  转/分          $    $  ANS075.BYTE003  $  y=(x)*10; 
  $  081.爆震点火角纠正值                                                    $    $  度             $    $  ANS076.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  082.爆震传感器电压                                                      $    $  伏特           $    $  ANS077.BYTE003  $  y=(x1*256+x2)*0.000076; 
  $  083.Lambda 设置点                                                       $    $                 $    $  ANS078.BYTE003  $  y=(x1*256+x2)*0.000244; 
  $  084.停启-系统存储历史最大车速                                           $    $  千米/时        $    $  ANS079.BYTE003  $  y=(x)*1.25; 
  $  085.1缸超过200转/分钟的失火数                                           $    $  计数器         $    $  ANS080.BYTE003  $  y=(x1*256+x2)*1; 
  $  086.2缸失火数                                                           $    $  计数器         $    $  ANS081.BYTE003  $  y=(x1*256+x2)*1; 
  $  087.3缸失火数                                                           $    $  计数器         $    $  ANS082.BYTE003  $  y=(x1*256+x2)*1; 
  $  088.4缸失火数                                                           $    $  次             $    $  ANS083.BYTE003  $  y=(x1*256+x2)*1; 
  $  089.上游氧传感器加热器状态-上游氧传感器准备运行                         $    $                 $    $  ANS084.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  090.上游氧传感器加热器状态-催化器超过露点标志位                         $    $                 $    $  ANS084.BYTE003  $  switxh(x&0x02)0x00:@09b4;0x02:@0365; 
  $  091.上游氧传感器加热器状态-非全功率加热标志位                           $    $                 $    $  ANS084.BYTE003  $  switxh(x&0x01)0x00:@09b4;0x01:@0365; 
  $  092.下游氧传感器加热器状态-下游氧传感器准备运行                         $    $                 $    $  ANS085.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  093.下游氧传感器加热器状态-全功率加热标志位                             $    $                 $    $  ANS085.BYTE003  $  switxh(x&0x04)0x00:@09b4;0x04:@0365; 
  $  094.下游氧传感器加热器状态-催化器超过露点标志位                         $    $                 $    $  ANS085.BYTE003  $  switxh(x&0x02)0x00:@09b4;0x02:@0365; 
  $  095.下游氧传感器加热器状态-非全功率加热标志位                           $    $                 $    $  ANS085.BYTE003  $  switxh(x&0x01)0x00:@09b4;0x01:@0365; 
  $  096.碳罐负荷                                                            $    $  千克/小时      $    $  ANS086.BYTE003  $  y=(x1*256+x2)*0.00039; 
  $  097.启停-起动机使用次数                                                 $    $  计数器         $    $  ANS087.BYTE003  $  y=(x)*1; 
  $  098.节气门控制-节气门开度1                                              $    $  百分比         $    $  ANS088.BYTE003  $  y=(x)*0.392; 
  $  099.节气门控制-节气门开度2                                              $    $  百分比         $    $  ANS089.BYTE003  $  y=(x)*0.392; 
  $  100.节气门控制-节气门开度                                               $    $  百分比         $    $  ANS090.BYTE003  $  y=(x)*0.392; 
  $  101.节气门控制-节气门位置1传感器电压                                    $    $  伏             $    $  ANS091.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  102.节气门控制-节气门位置2传感器电压                                    $    $  伏             $    $  ANS092.BYTE003  $  y=(x1*256+x2)*0.00122; 
  $  103.电子节气门控制(ETC)-节气门相对角度                                  $    $  开度           $    $  ANS093.BYTE003  $  y=(x)*0.392; 
  $  104.电子节气门控制(ETC)-跛行回家时节气门位置                            $    $  开度           $    $  ANS094.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  105.电子节气门控制(ETC)-节气门自适应设置点                              $    $  开度           $    $  ANS095.BYTE003  $  y=(x1*256+x2)*0.00153; 
  $  106.节气门控制机械下止点自适应1传感器电压                               $    $  伏             $    $  ANS096.BYTE003  $  y=(x)*0.0195; 
  $  107.节气门控制机械下止点自适应2传感器电压                               $    $  伏             $    $  ANS097.BYTE003  $  y=(x)*0.0195; 
  $  108.自动变速器挡位                                                      $    $                 $    $  ANS098.BYTE003  $  switxh(x)0xFF:@0912;0x00:@007c;0x01:@0044;0x02:@0045;0x03:@0046;0x04:@0047;0x05:@0067;0x06:@0068;0x07:@0069;0x08:@04fa; 
  $  109.巡航控制目标速度                                                    $    $  千米/时        $    $  ANS099.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0625;elsey=(x1*256+x2-0xFFFF)*0.0625; 
  $  110.巡航加速度                                                          $    $  米/秒平方      $    $  ANS100.BYTE003  $  y=(x1*256+x2)*0.001; 
  $  111.空调压缩机请求状态                                                  $    $                 $    $  ANS101.BYTE003  $  switxh(x)0x00:@0204;0x01:@0205;0x02:@0206;0x03:@0337; 
  $  112.直流(DC)转换器故障发生状态                                          $    $                 $    $  ANS102.BYTE003  $  switxh(x)0x00:@0022;0x01:@0021; 
  $  113.速度辅助系统模式                                                    $    $                 $    $  ANS103.BYTE003  $  switxh(x)0x00:@002e;0x01:@0c95;0x02:@0c96;0x03:@0c97; 
  $  114.速度辅助系统状态                                                    $    $                 $    $  ANS104.BYTE003  $  switxh(x)0x00:@002e;0x01:@002f;0x02:@0030;0x03:@0031;0x04:@07e4;0x05:@0070;0x06:@0c94; 
  $  115.速度辅助系统目标速度                                                $    $  千米/时        $    $  ANS105.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  116.速度辅助系统目标速度来源状态                                        $    $                 $    $  ANS106.BYTE003  $  switxh(x)0x00:@00e8;0x01:@0af1;0x02:@0af2;0x03:@0070; 
  $  117.发动机扭矩结构-附件设备请求的扭矩                                   $    $  牛米           $    $  ANS107.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  118.发动机扭矩结构-发动机内部阻力扭矩                                   $    $  牛米           $    $  ANS108.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  119.发动机扭矩结构-摩擦扭矩自适应偏差值                                 $    $  牛米           $    $  ANS109.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  120.发动机扭矩结构-最大可得到的指示扭矩                                 $    $  牛米           $    $  ANS110.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  121.发动机扭矩结构-最小可得到的指示扭矩                                 $    $  牛米           $    $  ANS111.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  122.发动机扭矩结构-空调压缩机请求的扭矩                                 $    $  牛米           $    $  ANS112.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  123.发动机扭矩结构-冷却风扇请求的扭矩                                   $    $  牛米           $    $  ANS113.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  124.发动机扭矩结构-发电机请求的扭矩                                     $    $  牛米           $    $  ANS114.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  125.发动机扭矩结构-发动机输出有效扭矩                                   $    $  牛米           $    $  ANS115.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  126.发动机扭矩结构-速度最大时指示扭矩                                   $    $  牛米           $    $  ANS116.BYTE003  $  if(128>x1)y=(x1*16777216+x2*65536+x3*256+x4)*0.1;elsey=(x1*16777216+x2*65536+x3*256+x4-4294967296)*0.1; 
  $  127.发动机扭矩结构-发动机稳态实际扭矩(GDI)                              $    $  牛米           $    $  ANS117.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  128.发动机扭矩结构-发动机无变速器稳态扭矩                               $    $  牛米           $    $  ANS118.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  129.驾驶需要的发动机扭矩                                                $    $  牛米           $    $  ANS119.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  130.发动机扭矩结构-发动机预测稳态扭矩                                   $    $  牛米           $    $  ANS120.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  131.动力传输得到的曲轴扭矩请求反馈类型                                  $    $                 $    $  ANS121.BYTE003  $  switxh(x)0x00:@00e7;0x01:@0c98;0x02:@0c99;0x03:@0c9a; 
  $  132.动力传输得到的的曲轴扭矩请求值                                      $    $  牛米           $    $  ANS122.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  133.动力传输预期的曲轴扭矩请求干涉类型                                  $    $                 $    $  ANS123.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0c8d;0x02:@0c8e; 
  $  134.变速器预测曲轴扭矩-请求值                                           $    $  牛米           $    $  ANS124.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  135.动力传输发动机速度请求控制响应                                      $    $                 $    $  ANS125.BYTE003  $  switxh(x)0x00:@0bee;0x01:@0bef;0x02:@0c8c;0x03:@0bf0; 
  $  136.动力传输发动机速度请求干涉类型                                      $    $                 $    $  ANS126.BYTE003  $  switxh(x)0x00:@0bee;0x01:@0c8d;0x02:@0c8e;0x03:@0c8f; 
  $  137.动力传输发动机速度请求速度值                                        $    $  转/分钟        $    $  ANS127.BYTE003  $  y=(x1*256+x2)*8; 
  $  138.动力传输曲轴扭矩负荷                                                $    $  牛米           $    $  ANS128.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  139.自适应巡航-主动紧急制动-扭矩请求状态                                $    $                 $    $  ANS129.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0ca3; 
  $  140.自适应巡航-主动紧急制动-扭矩请求值                                  $    $  牛米           $    $  ANS130.BYTE003  $  y=(x)*1; 
  $  141.自适应巡航-主动紧急制动-减速请求状态                                $    $                 $    $  ANS131.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0c1f;0x02:@0c20; 
  $  142.自适应巡航-扭矩请求响应-动力总成                                    $    $                 $    $  ANS132.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0b8c;0x02:@0b8d;0x03:@0c21; 
  $  143.空调压缩机请求                                                      $    $                 $    $  ANS133.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  144.空调离合器继电器状态                                                $    $                 $    $  ANS133.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  145.空调高低压开关状态                                                  $    $                 $    $  ANS133.BYTE004  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  146.来自CAN的空调压缩机请求(ETC)                                        $    $                 $    $  ANS133.BYTE004  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  147.错误存在-驾驶员请求命令 2                                           $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  148.错误存在-驾驶员请求命令1                                            $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  149.机动化节气门控制器故障发生                                          $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  150.机动化节气门故障发生                                                $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  151.故障发生-节气门位置2传感器                                          $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  152.故障发生-节气门位置1传感器                                          $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  153.错误发生-曲轴信号                                                   $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  154.故障现象-凸轮轴信号                                                 $    $                 $    $  ANS134.BYTE003  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  155.错误发生-高压油泵控制阀                                             $    $                 $    $  ANS134.BYTE004  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  156.燃油泵继电器故障发生                                                $    $                 $    $  ANS134.BYTE004  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  157.喷油器4故障发生                                                     $    $                 $    $  ANS134.BYTE004  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  158.喷油器3故障发生                                                     $    $                 $    $  ANS134.BYTE004  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  159.喷油器2故障发生                                                     $    $                 $    $  ANS134.BYTE004  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  160.喷油器1故障发生                                                     $    $                 $    $  ANS134.BYTE004  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  161.错误发生-进气温度信号                                               $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  162.错误发生-增压压力信号                                               $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  163.错误发生-歧管压力传感器                                             $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  164.错误发生-空气流量信号                                               $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  165.错误发生-机油控制阀                                                 $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  166.错误发生-机油压力传感器                                             $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  167.错误发生-油轨压力传感器                                             $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  168.故障发生-发动机冷却液温度传感器                                     $    $                 $    $  ANS134.BYTE005  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  169.故障发生-起动挡硬线信号                                             $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  170.故障发生-附件挡硬线信号                                             $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  171.故障现象-下游氧传感器                                               $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  172.错误发生-上游氧传感器                                               $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  173.错误发生-爆震传感器                                                 $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  174.故障发生-排气相位控制阀                                             $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  175.故障发生-进气相位控制阀                                             $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  176.错误发生-点火线圈                                                   $    $                 $    $  ANS134.BYTE006  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  177.错误发生-输入的SDM CAN信号                                          $    $                 $    $  ANS134.BYTE007  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  178.故障发生-输入的TCCM CAN信号                                         $    $                 $    $  ANS134.BYTE007  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  179.错误发生-输入的GW CAN信号                                           $    $                 $    $  ANS134.BYTE007  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  180.故障发生-输入的TCM CAN信号                                          $    $                 $    $  ANS134.BYTE007  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  181.引入的ABS CAN帧故障发生                                             $    $                 $    $  ANS134.BYTE007  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  182.故障发生-CAN总线关闭                                                $    $                 $    $  ANS134.BYTE007  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  183.故障发生-车辆发生碰撞或碰撞信号不合理                               $    $                 $    $  ANS134.BYTE008  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  184.有故障-废气调节阀                                                   $    $                 $    $  ANS134.BYTE008  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  185.错误发生-泄压阀信号                                                 $    $                 $    $  ANS134.BYTE008  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  186.故障发生-空调压力传感器                                             $    $                 $    $  ANS134.BYTE008  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  187.错误发生-电子节温器                                                 $    $                 $    $  ANS134.BYTE008  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  188.错误发生-冷却风扇控制                                               $    $                 $    $  ANS134.BYTE008  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  189.碳罐电磁阀故障发生                                                  $    $                 $    $  ANS134.BYTE009  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  190.故障发生-驻车挡/空挡硬线输入                                        $    $                 $    $  ANS134.BYTE009  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  191.错误发生-倒档开关                                                   $    $                 $    $  ANS134.BYTE009  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  192.错误发生-离合器开关                                                 $    $                 $    $  ANS134.BYTE009  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  193.故障发生-制动灯开关或制动位置传感器                                 $    $                 $    $  ANS134.BYTE009  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  194.故障发生-起动机继电器反馈(启停)                                     $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  195.错误发生-交流发电机LIN信号                                          $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  196.错误发生-电子蓄电池传感器LIN信号                                    $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  197.错误发生-交流发电机通讯                                             $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  198.错误发生-电子蓄电池传感器通讯                                       $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  199.错误发生-离合器位置传感器                                           $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  200.故障发生-空挡开关(启停)                                             $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  201.错误发生-起动继电器1                                                $    $                 $    $  ANS134.BYTE010  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  202.飞轮自适应学习过程完成状态                                          $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  203.飞轮自适应学习错误标志                                              $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  204.发动机正在运行                                                      $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  205.发动机喷油点火信号同步完成                                          $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  206.发动机停止                                                          $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  207.点火状态-起动                                                       $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  208.点火状态-运行                                                       $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  209.点火状态-附件                                                       $    $                 $    $  ANS135.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  210.起停系统错误状态                                                    $    $                 $    $  ANS135.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  211.起停测试模式激活                                                    $    $                 $    $  ANS135.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  212.启停-直接起动激活                                                   $    $                 $    $  ANS135.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  213.启停-直接起动可用                                                   $    $                 $    $  ANS135.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  214.启停-IGC功能激活                                                    $    $                 $    $  ANS135.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  215.启停-启停功能可用                                                   $    $                 $    $  ANS135.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  216.启停-发动机启停状态                                                 $    $                 $    $  ANS135.BYTE004  $  switxh(x&0x03)0x00:@0093;0x01:@07b0;0x02:@0095;0x03:@0096; 
  $  217.节气门跛行回家激活                                                  $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  218.节气门关闭                                                          $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  219.发动机满负荷阶段                                                    $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  220.发动机倒拖断油阶段                                                  $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  221.发动机倒拖阶段                                                      $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  222.发动机怠速阶段                                                      $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  223.启动阶段后的发动机                                                  $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  224.发动机起动阶段                                                      $    $                 $    $  ANS135.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  225.下游氧传感器加热器状态-全功率加热标志位                             $    $                 $    $  ANS135.BYTE006  $  switxh(x&0x80)0x00:@09b4;0x80:@0365; 
  $  226.下游氧传感器加热器状态-催化器超过露点标志位                         $    $                 $    $  ANS135.BYTE006  $  switxh(x&0x20)0x00:@09b4;0x20:@0365; 
  $  227.上游氧传感器加热器状态-催化器超过露点标志位                         $    $                 $    $  ANS135.BYTE006  $  switxh(x&0x10)0x00:@09b4;0x10:@0365; 
  $  228.下游氧传感器准备运行                                                $    $                 $    $  ANS135.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  229.上游氧传感器准备运行                                                $    $                 $    $  ANS135.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  230.闭环控制激活                                                        $    $                 $    $  ANS135.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  231.倒档开关状态                                                        $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x80)0x00:@093d;0x80:@0208; 
  $  232.离合器开关状态                                                      $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x40)0x00:@093d;0x40:@0208; 
  $  233.制动开关 2 状态                                                     $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x20)0x00:@093d;0x20:@0208; 
  $  234.制动开关 1 状态                                                     $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x10)0x00:@093d;0x10:@0208; 
  $  235.燃油泵继电器状态                                                    $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x08)0x00:@093d;0x08:@0206; 
  $  236.主继电器状态                                                        $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x04)0x00:@093d;0x04:@0206; 
  $  237.启停-互锁继电器状态                                                 $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  238.起动继电器状态                                                      $    $                 $    $  ANS136.BYTE003  $  switxh(x&0x01)0x00:@093d;0x01:@0206; 
  $  239.启停-HHC(坡道辅助)可用状态                                          $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  240.启停-发动机舱盖打开状态                                             $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  241.启停-驾驶员侧安全带未系状态                                         $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  242.启停-驾驶员侧车门打开状态                                           $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  243.启停-传动链开启-空挡位置开关状态                                    $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x08)0x00:@093d;0x08:@0208; 
  $  244.启停-传动链开启-离合器底部位置开关状态                              $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x04)0x00:@093d;0x04:@0208; 
  $  245.启停-空挡开关状态                                                   $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x02)0x00:@093d;0x02:@0208; 
  $  246.起停主开关状态                                                      $    $                 $    $  ANS136.BYTE004  $  switxh(x&0x01)0x00:@093d;0x01:@0208; 
  $  247.VCT排气执行器已就绪(VVT)                                            $    $                 $    $  ANS136.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  248.VCT进气执行器已就绪(VVT)                                            $    $                 $    $  ANS136.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  249.碰撞CAN信号输入状态                                                 $    $                 $    $  ANS136.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  250.炭罐状态                                                            $    $                 $    $  ANS136.BYTE005  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  251.驻车挡/空挡开关状态                                                 $    $                 $    $  ANS136.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  252.后氧传感器加热器状态                                                $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  253.前氧传感器加热状态                                                  $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  254.启停-启停系统警告指示灯状态                                         $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x20)0x00:@002e;0x20:@0037; 
  $  255.启停-启停系统指示灯状态                                             $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x10)0x00:@002e;0x10:@0037; 
  $  256.启停-充电故障指示灯状态                                             $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  257.启停-发动机机油指示灯状态                                           $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  258.发动机DBW灯状态                                                     $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  259.发动机MIL灯状态                                                     $    $                 $    $  ANS136.BYTE006  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  260.涡轮增压器泄压阀状态(增压)                                          $    $                 $    $  ANS136.BYTE007  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  261.发动机机油阀状态                                                    $    $                 $    $  ANS136.BYTE007  $  switxh(x&0x20)0x00:@002e;0x20:@0037; 
  $  262.启停-起动机工作                                                     $    $                 $    $  ANS136.BYTE007  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  263.经济驾驶模式激活指示灯点亮                                          $    $                 $    $  ANS136.BYTE009  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  264.防盗状态-数据传输已存储并锁定                                       $    $                 $    $  ANS137.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  265.防盗状态-数据传输已完成                                             $    $                 $    $  ANS137.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  266.防盗状态-数据传输超时                                               $    $                 $    $  ANS137.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  267.防盗状态-数据传输已开始                                             $    $                 $    $  ANS137.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  268.防盗状态-密钥和PIN码未存储                                          $    $                 $    $  ANS137.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  269.防盗状态-防盗功能激活状态                                           $    $                 $    $  ANS137.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  270.防盗状态-ECU状态                                                    $    $                 $    $  ANS137.BYTE004  $  switxh(x&0x10)0x00:@001f;0x10:@06fb; 
  $  271.防盗状态-响应有效-正确的格式                                        $    $                 $    $  ANS137.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  272.防盗状态-响应无效-正确的格式                                        $    $                 $    $  ANS137.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  273.防盗状态-响应无效-错误的格式                                        $    $                 $    $  ANS137.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  274.跛行回家-节气门电机故障                                             $    $                 $    $  ANS138.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  275.跛行回家-节气门自适应故障                                           $    $                 $    $  ANS138.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  276.跛行回家-凸轮轴传感器信号异常                                       $    $                 $    $  ANS138.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  277.跛行回家-曲轴传感器信号异常                                         $    $                 $    $  ANS138.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  278.启停-自动停禁用-离合器顶部位置开关初始化                            $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  279.启停-自动停禁用-离合器底部位置开关和空挡开关初始化                  $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  280.启停-自动停禁用-起动机过热                                          $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  281.启停-自动停禁用-空调请求发动机运行                                  $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  282.启停-自动停禁用-制动真空度不足                                      $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  283.启停-自动停禁用-蓄电池电量低                                        $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  284.启停-自动停禁用-驾驶员不在座位                                      $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  285.启停-自动停禁用-发动机舱盖打开                                      $    $                 $    $  ANS139.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  286.启停-自动停禁用-驾驶员在停放车辆                                    $    $                 $    $  ANS139.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  287.启停-自动停禁用-HHC(坡道辅助)功能不可用                             $    $                 $    $  ANS139.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  288.启停-自动停禁用-车辆处于高海拔地带                                  $    $                 $    $  ANS139.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  289.启停-自动停禁用-BCM状态不满足自动停机                               $    $                 $    $  ANS139.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  290.启停-自动停禁用-TCM状态不满足自动停机                               $    $                 $    $  ANS139.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  291.启停-自动停禁用-发动机状态不满足自动停机                            $    $                 $    $  ANS139.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  292.启停-自动停禁用-第二起动继电器异常                                  $    $                 $    $  ANS139.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  293.启停-自动起禁用-驾驶员侧车门打开&amp安全带未扣                      $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  294.启停-自动起禁用-第二起动继电器粘连故障                              $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  295.启停-自动起禁用-离合器顶部位置开关信号错误                          $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  296.启停-自动起禁用-空挡位置传感器和离合器底部位置开关信号错误          $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  297.启停-自动起禁用-驾驶员侧安全带未扣                                  $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  298.启停-自动起禁用-驾驶员侧车门打开                                    $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  299.启停-自动起禁用-发动机舱盖打开                                      $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  300.启停-自动起禁用-驾驶员在座位                                        $    $                 $    $  ANS140.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  301.启停禁用-智能发电机控制(IGC)-发电机参数设置不正常                   $    $                 $    $  ANS141.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  302.启停禁用-智能发电机控制(IGC)-发电机高温切断                         $    $                 $    $  ANS141.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  303.启停禁用-智能发电机控制(IGC)-发电机处于保护盲区                     $    $                 $    $  ANS141.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  304.启停禁用-智能发电机控制(IGC)-发电机指示灯亮                         $    $                 $    $  ANS141.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  305.启停禁用-智能发电机控制(IGC)-智能充电配备                           $    $                 $    $  ANS141.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  306.启停禁用-智能充电-蓄电池型号不一致                                  $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  307.启停禁用-智能充电-蓄电池传感器(EBS)暂时失效                         $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  308.启停禁用-智能充电-蓄电池传感器(EBS)标定失败                         $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  309.启停禁用-智能充电-蓄电池传感器(EBS)失效                             $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  310.启停禁用-智能发电机控制(IGC)-发电机机械故障                         $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  311.启停禁用-智能发电机控制(IGC)-发电机调节器电气故障                   $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  312.启停禁用-智能发电机控制(IGC)-发电机调节器通讯故障                   $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  313.启停禁用-智能发电机控制(IGC)-发电机调节器超时置位                   $    $                 $    $  ANS141.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  314.变速器状态-起动允许状态                                             $    $                 $    $  ANS142.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  315.变速器状态-换挡过程中                                               $    $                 $    $  ANS142.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  316.变速器状态-蠕行控制功能激活                                         $    $                 $    $  ANS142.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  317.变速器状态-非排放相关故障激活                                       $    $                 $    $  ANS142.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  318.变速器状态-排放相关故障激活                                         $    $                 $    $  ANS142.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  319.变速器状态-变速器配置                                               $    $                 $    $  ANS142.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  320.巡航控制状态                                                        $    $                 $    $  ANS143.BYTE003  $  switxh(x&0x1C)0x00:@002e;0x04:@091c;0x08:@091d;0x0C:@091e;0x10:@0370;0x14:@0920;0x18:@0004; 
  $  321.车速控制-车速单位                                                   $    $                 $    $  ANS143.BYTE003  $  switxh(x&0x02)0x00:@06e3;0x02:@08d5; 
  $  322.车速控制-驾驶员加速踏板优先                                         $    $                 $    $  ANS143.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  323.巡航控制-车速控制输入设置请求                                       $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  324.巡航控制-车速控制输入暂停请求                                       $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  325.巡航控制-车速控制输入恢复请求                                       $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  326.巡航控制-车速控制输入减速请求(按下并保持)                           $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  327.巡航控制-车速控制输入减速请求(轻按)                                 $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  328.巡航控制-车速控制输入加速请求(按下并保持)                           $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  329.巡航控制-车速控制输入加速请求(轻按)                                 $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  330.巡航控制-巡航主开关输入                                             $    $                 $    $  ANS143.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  331.巡航控制-巡航开关数据完整性                                         $    $                 $    $  ANS143.BYTE005  $  switxh(x&0x30)0x00:@0097;0x10:@0098;0x20:@0099;0x30:@009a; 
  $  332.巡航控制-巡航激活指示灯可用                                         $    $                 $    $  ANS143.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  333.巡航控制-巡航待命指示灯可用                                         $    $                 $    $  ANS143.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  334.巡航禁用-制动踏板踩下                                               $    $                 $    $  ANS143.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  335.巡航禁用-离合器踏板踩下                                             $    $                 $    $  ANS143.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  336.巡航控制-开关信号一致性                                             $    $                 $    $  ANS144.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  337.巡航禁用-安全监控中                                                 $    $                 $    $  ANS144.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  338.巡航禁用-一般故障状态                                               $    $                 $    $  ANS144.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  339.巡航控制-安全气囊点爆                                               $    $                 $    $  ANS144.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  340.巡航控制主开关按下                                                  $    $                 $    $  ANS144.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  341.巡航禁用-车速未达到进入阀值                                         $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  342.巡航禁用-远高于巡航目标速度                                         $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  343.巡航禁用-远低于巡航目标速度                                         $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  344.巡航禁用-制动踏板踩下                                               $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  345.巡航禁用-离合器踏板踩下或挡位改变                                   $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  346.巡航禁用-挡位超限                                                   $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  347.巡航禁用-发动机转速超限                                             $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  348.巡航禁用-扭矩干预                                                   $    $                 $    $  ANS144.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  349.巡航禁用-变速器故障                                                 $    $                 $    $  ANS144.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  350.巡航禁用-EPB激活状态                                                $    $                 $    $  ANS144.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  351.巡航禁用-加速度太大                                                 $    $                 $    $  ANS144.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  352.巡航禁用-加速度太小                                                 $    $                 $    $  ANS144.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  353.巡航禁用-强制降挡                                                   $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  354.巡航禁用-蓄电池电压低                                               $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  355.巡航禁用-发动机故障警告指示(DBW)灯亮                                $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  356.巡航禁用-加速踏板                                                   $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  357.巡航禁用-车速信号异常                                               $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  358.巡航禁用-电子节气门控制故障                                         $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  359.巡航禁用-驾驶员操作异常                                             $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  360.巡航禁用-发动机转速超限                                             $    $                 $    $  ANS144.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  361.催化就绪标志                                                        $    $                 $    $  ANS145.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  362.下游氧传感器准备就绪                                                $    $                 $    $  ANS145.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  363.上游氧传感器准备就绪                                                $    $                 $    $  ANS145.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  364.燃油系统的就绪标志                                                  $    $                 $    $  ANS145.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  365.B4 类失火就绪标志                                                   $    $                 $    $  ANS145.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  366.B1 类失火就绪标志                                                   $    $                 $    $  ANS145.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  367.A类失火就绪标志                                                     $    $                 $    $  ANS145.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  368.综合零件监视状态                                                    $    $                 $    $  ANS145.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  369.燃油系统监控状态                                                    $    $                 $    $  ANS145.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  370.失火监控状态                                                        $    $                 $    $  ANS145.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  371.支持综合零件监视                                                    $    $                 $    $  ANS145.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  372.支持燃油系统监控                                                    $    $                 $    $  ANS145.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  373.支持失火监控                                                        $    $                 $    $  ANS145.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  374.氧传感器加热器监控                                                  $    $                 $    $  ANS145.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  375.氧传感器监控                                                        $    $                 $    $  ANS145.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  376.催化器监控                                                          $    $                 $    $  ANS145.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  377.扭矩信号-发动机扭矩减少失效状态                                     $    $                 $    $  ANS146.BYTE003  $  switxh(x&0xE0)0x00:@009b;0x20:@009c;0x40:@009d;0x60:@009e;0x80:@009f; 
  $  378.扭矩信号-电子稳定程序(ESP)请求发动机扭矩减少激活                    $    $                 $    $  ANS146.BYTE003  $  switxh(x&0x04)0x00:@00e7;0x04:@008b; 
  $  379.扭矩信号-动态稳定控制系统(SCS)激活                                  $    $                 $    $  ANS146.BYTE003  $  switxh(x&0x02)0x00:@00e7;0x02:@008b; 
  $  380.扭矩信号-牵引控制系统(TCS)激活                                      $    $                 $    $  ANS146.BYTE003  $  switxh(x&0x01)0x00:@00e7;0x01:@008b; 
  $  381.启停-自动停禁用-需求停机禁止-催化器加热中                           $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  382.启停-自动停禁用-需求停机禁止-启动条件差                             $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  383.启停-自动停禁用-需求运行点-进气系统                                 $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  384.启停-自动停禁用-需求运行点-碳罐系统诊断中                           $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  385.启停-自动停禁用-需求运行点-碳罐系统高负荷                           $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  386.启停-自动停禁用-需求运行点-催化器加热中                             $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  387.启停-自动停禁用-需求运行点-燃油混合自适应偏置                       $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  388.启停-自动停禁用-需求运行点-扭矩自适应                               $    $                 $    $  ANS147.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  389.启停-自动停禁用-需求停机禁止-发动机堵转中                           $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  390.启停-自动停禁用-需求停机禁止-DLDP诊断                               $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  391.启停-自动停禁用-需求停机禁止-NSC诊断                                $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  392.启停-自动停禁用-需求停机禁止-二次空气诊断                           $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  393.启停-自动停禁用-需求停机禁止-制动助力器控制                         $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  394.启停-自动停禁用-需求停机禁止-乘客需求                               $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  395.启停-自动停禁用-需求停机禁止-进气系统                               $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  396.启停-自动停禁用-需求停机禁止-起动控制                               $    $                 $    $  ANS147.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  397.启停-自动停禁用-进气凸轮轴相位传感器故障                            $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  398.启停-自动停禁用-进气凸轮轴装配故障                                  $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  399.启停-自动停禁用-排气凸轮轴相位传感器故障                            $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  400.启停-自动停禁用-排气凸轮轴装配故障                                  $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  401.启停-自动停禁用-曲轴传感器信号缺失                                  $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  402.启停-自动停禁用-曲轴传感器信号干扰                                  $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  403.错误的PWM信号/错误的发动机停止位置/不合理的曲轴传感器脉冲宽度       $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  404.启停-自动停禁用-发动机冷却液温度传感器电器故障                      $    $                 $    $  ANS147.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  405.启停-自动停禁用-发动机冷却液温度传感器合理性故障                    $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  406.启停-自动停禁用-监测到发动机失火                                    $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  407.启停-自动停禁用-高压燃油传感器电器故障                              $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  408.启停-自动停禁用-高压燃油传感器合理性故障                            $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  409.启停-自动停禁用-高压燃油油轨轨压异常故障                            $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  410.启停-自动停禁用-高压燃油油泵流量控制阀故障                          $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  411.启停-自动停禁用-启动不在合理时间范围内                              $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  412.启停-自动停禁用-高压燃油油轨轨压保持功能激活                        $    $                 $    $  ANS147.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  413.开关式水泵带轮-控制请求状态                                         $    $                 $    $  ANS148.BYTE003  $  switxh(x&0x20)0x00:@0c87;0x20:@0c88; 
  $  414.开关式水泵带轮-运行状态                                             $    $                 $    $  ANS148.BYTE003  $  switxh(x&0x10)0x00:@090e;0x10:@090f; 
  $  415.开关式水泵带轮-故障状态                                             $    $                 $    $  ANS148.BYTE003  $  switxh(x&0x0F)0x00:@0450;0x01:@0c84;0x02:@0c85; 
  $  416.远程起动-系统状态-动力总成运行退出                                  $    $                 $    $  ANS149.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  417.远程起动-系统状态-动力总成起动退出                                  $    $                 $    $  ANS149.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  418.车辆远程起动发动机                                                  $    $                 $    $  ANS149.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  419.车辆远程起动                                                        $    $                 $    $  ANS149.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  420.远程起动请求                                                        $    $                 $    $  ANS149.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  421.远程起动-动力总成起动退出原因-车速超过限值                          $    $                 $    $  ANS150.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  422.远程起动-动力总成起动退出原因-换挡杆不在驻车挡位置                  $    $                 $    $  ANS150.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  423.远程起动-动力总成起动退出原因-车辆发生碰撞                          $    $                 $    $  ANS150.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  424.远程起动-动力总成起动退出原因-动力总成状态禁用                      $    $                 $    $  ANS150.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  425.远程起动-动力总成起动退出原因-变速器状态禁用                        $    $                 $    $  ANS150.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  426.远程起动-动力总成起动退出原因-起动机达到最大起动时间                $    $                 $    $  ANS150.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  427.远程起动-动力总成起动退出原因-发动机故障灯亮                        $    $                 $    $  ANS150.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  428.远程起动-动力总成起动退出原因-与GW或SCS/ABS或TCM失去通讯            $    $                 $    $  ANS150.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  429.远程起动-动力总成起动退出原因-燃油油量太低                          $    $                 $    $  ANS150.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  430.远程起动-动力总成起动退出原因-KL15硬线被断开                        $    $                 $    $  ANS150.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  431.远程起动-动力总成运行退出原因-KL15硬线被断开                        $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  432.远程起动-动力总成运行退出原因-加速踏板踩下                          $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  433.远程起动-动力总成运行退出原因-发动机转速超过限值                    $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  434.远程起动-动力总成运行退出原因-车速超过限值                          $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  435.远程起动-动力总成运行退出原因-换挡杆不在驻车挡位置                  $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  436.远程起动-动力总成运行退出原因-超过最大允许运行时间                  $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  437.远程起动-动力总成运行退出原因-机油压力低                            $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  438.远程起动-动力总成运行退出原因-发动机过热                            $    $                 $    $  ANS151.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  439.远程起动-动力总成运行退出原因-KL15硬线被断开                        $    $                 $    $  ANS151.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  440.远程起动-动力总成运行退出原因-未知原因                              $    $                 $    $  ANS151.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  441.远程起动-动力总成运行退出原因-发动机故障灯亮                        $    $                 $    $  ANS151.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  442.远程起动-动力总成运行退出原因-车辆发生碰撞                          $    $                 $    $  ANS151.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  443.发动机机油压力开关状态                                              $    $                 $    $  ANS136.BYTE007  $  switxh(x&0x08)0x00:@093d;0x08:@0208; 
  $  444.二次空气泵继电器状态                                                $    $                 $    $  ANS136.BYTE007  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  445.启停-空气流量计(HFM)加热继电器状态                                  $    $                 $    $  ANS136.BYTE007  $  switxh(x&0x01)0x00:@093d;0x01:@0206; 
  $  446.发动机机油压力                                                      $    $  百帕           $    $  ANS152.BYTE003  $  y=(x1*256+x2)*0.228885328450446; 
  $  447.发动机机油压力电压原始值                                            $    $  伏             $    $  ANS153.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  448.发动机冷却液温度散热器                                              $    $  摄氏度         $    $  ANS154.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  449.发动机冷却液温度散热器电压值                                        $    $  伏             $    $  ANS155.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.2;elsey=(x1*256+x2-0xFFFF)*0.2; 
  $  450.发动机冷却液温度气缸电压值                                          $    $  伏             $    $  ANS156.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  451.周围空气温度                                                        $    $  摄氏度         $    $  ANS157.BYTE003  $  y=(x)*0.75-48; 
  $  452.GPFδ压力                                                           $    $  百帕           $    $  ANS158.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0390625;elsey=(x1*256+x2-0xFFFF)*0.0390625; 
  $  453.GPF上游温度                                                         $    $  摄氏度         $    $  ANS159.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  454.GPF下游温度                                                         $    $  摄氏度         $    $  ANS160.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  455.燃油箱压力电压值                                                    $    $  伏             $    $  ANS161.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  456.GPF碳烟颗粒负载-模拟值                                              $    $                 $    $  ANS162.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  457.GPF碳烟颗粒负载-测量值                                              $    $                 $    $  ANS162.BYTE005  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  458.灰烬负载-基于CCF计算灰烬系数                                        $    $                 $    $  ANS163.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  459.灰烬负载-用于计算灰烬的燃油消耗量                                   $    $  升             $    $  ANS163.BYTE005  $  if(0x80>x1)y=(x1*256+x2)*10;elsey=(x1*256+x2-0xFFFF)*10; 
  $  460.灰烬负载-用于计算灰烬的发动机运行时间                               $    $  秒             $    $  ANS163.BYTE007  $  if(0x80>x1)y=(x1*16777216+x2*65536+x3*256+x4)*1;elsey=(x1*16777216+x2*65536+x3*256+x4-4294967295)*1; 
  $  461.GPFδ压力传感器自学习适应值-实际值                                  $    $  千帕           $    $  ANS164.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0390625;elsey=(x1*256+x2-0xFFFF)*0.0390625; 
  $  462.GPF负载水平                                                         $    $                 $    $  ANS165.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  463.GPF再生状态                                                         $    $                 $    $  ANS166.BYTE003  $  switxh(x)0x00:@0cdf;0x01:@0ce0;0x02:@0ce1;0x03:@0ce2;0x04:@0ce3;0x05:@0ce4;0x06:@0ce5; 
  $  464.主动限速系统目标速度                                                $    $  千米/时        $    $  ANS167.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  465.发动机扭矩结构-发动机指示真实扭矩                                   $    $  百分比         $    $  ANS168.BYTE003  $  y=(x1*256+x2)*0.00152587890625; 
  $  466.GPF灰分因子                                                         $    $                 $    $  ANS169.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  467.制动真空电压原始值                                                  $    $  伏             $    $  ANS170.BYTE003  $  y=(x1*256+x2)*0.0049; 
  $  468.GPFδ压力传感器自学习适应值-旧值                                    $    $  千帕           $    $  ANS164.BYTE005  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0390625;elsey=(x1*256+x2-0xFFFF)*0.0390625; 

;******************************************************************************************************************************************************

