
    车型ID：1002

    模拟：协议模拟-->1002

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:701 02 10 01 00 00 00 00 00       $~  ANS000:781 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:701 02 3E 80 00 00 00 00 00       $!  ANS000:781 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:701 03 19 02 09 00 00 00 00       $#  ANS000:781 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/02000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:701 04 14 FF FF FF 00 00 00       $$  ANS000:781 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:701 03 22 F1 A0 00 00 00 00       $%  ANS000:781 03 22 F1 A0 00 00 00 00
  $%  REQ001:701 03 22 F1 83 00 00 00 00       $%  ANS001:781 03 22 F1 83 00 00 00 00
  $%  REQ002:701 03 22 F1 91 00 00 00 00       $%  ANS002:781 03 22 F1 91 00 00 00 00
  $%  REQ003:701 03 22 F1 A2 00 00 00 00       $%  ANS003:781 03 22 F1 A2 00 00 00 00
  $%  REQ004:701 03 22 F1 87 00 00 00 00       $%  ANS004:781 03 22 F1 87 00 00 00 00
  $%  REQ005:701 03 22 F1 10 00 00 00 00       $%  ANS005:781 03 22 F1 10 00 00 00 00
  $%  REQ006:701 03 22 F1 92 00 00 00 00       $%  ANS006:781 03 22 F1 92 00 00 00 00
  $%  REQ007:701 03 22 F1 8C 00 00 00 00       $%  ANS007:781 03 22 F1 8C 00 00 00 00
  $%  REQ008:701 03 22 F1 94 00 00 00 00       $%  ANS008:781 03 22 F1 94 00 00 00 00
  $%  REQ009:701 03 22 F1 8A 00 00 00 00       $%  ANS009:781 03 22 F1 8A 00 00 00 00
  $%  REQ010:701 03 22 F1 90 00 00 00 00       $%  ANS010:781 03 22 F1 90 00 00 00 00
  $%  REQ011:701 03 22 F1 A8 00 00 00 00       $%  ANS011:781 03 22 F1 A8 00 00 00 00
  $%  REQ012:701 03 22 F1 8B 00 00 00 00       $%  ANS012:781 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元网络文件参考号:          $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号(上次):            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  006:测试工具参考号(上次):            $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  007:里程读数(上次)KM:                $%    $%  ANS005.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  008:供应商电控单元硬件参考号:        $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  009:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:系统供应商识别码:                $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:VIN码:                           $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  013:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  014:电控单元制造日期:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:701 03 22 C1 04 00 00 00 00       $  ANS000:781 03 22 C1 04 00 00 00 00
  $  REQ001:701 03 22 C1 01 00 00 00 00       $  ANS001:781 03 22 C1 01 00 00 00 00
  $  REQ002:701 03 22 B5 10 00 00 00 00       $  ANS002:781 03 22 B5 10 00 00 00 00
  $  REQ003:701 03 22 E0 1B 00 00 00 00       $  ANS003:781 03 22 E0 1B 00 00 00 00
  $  REQ004:701 03 22 E0 1C 00 00 00 00       $  ANS004:781 03 22 E0 1C 00 00 00 00
  $  REQ005:701 03 22 E0 11 00 00 00 00       $  ANS005:781 03 22 E0 11 00 00 00 00
  $  REQ006:701 03 22 E0 06 00 00 00 00       $  ANS006:781 03 22 E0 06 00 00 00 00
  $  REQ007:701 03 22 E0 03 00 00 00 00       $  ANS007:781 03 22 E0 03 00 00 00 00
  $  REQ008:701 03 22 E0 0C 00 00 00 00       $  ANS008:781 03 22 E0 0C 00 00 00 00
  $  REQ009:701 03 22 D3 02 00 00 00 00       $  ANS009:781 03 22 D3 02 00 00 00 00
  $  REQ010:701 03 22 E0 1A 00 00 00 00       $  ANS010:781 03 22 E0 1A 00 00 00 00
  $  REQ011:701 03 22 C1 06 00 00 00 00       $  ANS011:781 03 22 C1 06 00 00 00 00
  $  REQ012:701 03 22 D1 01 00 00 00 00       $  ANS012:781 03 22 D1 01 00 00 00 00
  $  REQ013:701 03 22 D1 02 00 00 00 00       $  ANS013:781 03 22 D1 02 00 00 00 00
  $  REQ014:701 03 22 D1 03 00 00 00 00       $  ANS014:781 03 22 D1 03 00 00 00 00
  $  REQ015:701 03 22 D1 04 00 00 00 00       $  ANS015:781 03 22 D1 04 00 00 00 00
  $  REQ016:701 03 22 D1 05 00 00 00 00       $  ANS016:781 03 22 D1 05 00 00 00 00
  $  REQ017:701 03 22 D1 06 00 00 00 00       $  ANS017:781 03 22 D1 06 00 00 00 00
  $  REQ018:701 03 22 D1 16 00 00 00 00       $  ANS018:781 03 22 D1 16 00 00 00 00
  $  REQ019:701 03 22 D1 17 00 00 00 00       $  ANS019:781 03 22 D1 17 00 00 00 00
  $  REQ020:701 03 22 E0 1E 00 00 00 00       $  ANS020:781 03 22 E0 1E 00 00 00 00
  $  REQ021:701 03 22 E0 08 00 00 00 00       $  ANS021:781 03 22 E0 08 00 00 00 00
  $  REQ022:701 03 22 E0 18 00 00 00 00       $  ANS022:781 03 22 E0 18 00 00 00 00
  $  REQ023:701 03 22 E0 02 00 00 00 00       $  ANS023:781 03 22 E0 02 00 00 00 00
  $  REQ024:701 03 22 E0 0B 00 00 00 00       $  ANS024:781 03 22 E0 0B 00 00 00 00
  $  REQ025:701 03 22 E0 07 00 00 00 00       $  ANS025:781 03 22 E0 07 00 00 00 00
  $  REQ026:701 03 22 E0 05 00 00 00 00       $  ANS026:781 03 22 E0 05 00 00 00 00
  $  REQ027:701 03 22 D3 01 00 00 00 00       $  ANS027:781 03 22 D3 01 00 00 00 00
  $  REQ028:701 03 22 E0 0A 00 00 00 00       $  ANS028:781 03 22 E0 0A 00 00 00 00
  $  REQ029:701 03 22 E0 1F 00 00 00 00       $  ANS029:781 03 22 E0 1F 00 00 00 00
  $  REQ030:701 03 22 E0 09 00 00 00 00       $  ANS030:781 03 22 E0 09 00 00 00 00
  $  REQ031:701 03 22 E0 1D 00 00 00 00       $  ANS031:781 03 22 E0 1D 00 00 00 00
  $  REQ032:701 03 22 C1 08 00 00 00 00       $  ANS032:781 03 22 C1 08 00 00 00 00
  $  REQ033:701 03 22 E3 58 00 00 00 00       $  ANS033:781 03 22 E3 58 00 00 00 00
  $  REQ034:701 03 22 C1 02 00 00 00 00       $  ANS034:781 03 22 C1 02 00 00 00 00
  $  REQ035:701 03 22 C1 05 00 00 00 00       $  ANS035:781 03 22 C1 05 00 00 00 00
  $  REQ036:701 03 22 D3 04 00 00 00 00       $  ANS036:781 03 22 D3 04 00 00 00 00
  $  REQ037:701 03 22 E0 0E 00 00 00 00       $  ANS037:781 03 22 E0 0E 00 00 00 00
  $  REQ038:701 03 22 E0 10 00 00 00 00       $  ANS038:781 03 22 E0 10 00 00 00 00
  $  REQ039:701 03 22 E0 15 00 00 00 00       $  ANS039:781 03 22 E0 15 00 00 00 00
  $  REQ040:701 03 22 E0 16 00 00 00 00       $  ANS040:781 03 22 E0 16 00 00 00 00
  $  REQ041:701 03 22 D3 03 00 00 00 00       $  ANS041:781 03 22 D3 03 00 00 00 00
  $  REQ042:701 03 22 E0 19 00 00 00 00       $  ANS042:781 03 22 E0 19 00 00 00 00
  $  REQ043:701 03 22 D1 31 00 00 00 00       $  ANS043:781 03 22 D1 31 00 00 00 00
  $  REQ044:701 03 22 E2 11 00 00 00 00       $  ANS044:781 03 22 E2 11 00 00 00 00
  $  REQ045:701 03 22 E0 04 00 00 00 00       $  ANS045:781 03 22 E0 04 00 00 00 00
  $  REQ046:701 03 22 C1 07 00 00 00 00       $  ANS046:781 03 22 C1 07 00 00 00 00
  $  REQ047:701 03 22 E0 0D 00 00 00 00       $  ANS047:781 03 22 E0 0D 00 00 00 00
  $  REQ048:701 03 22 E0 17 00 00 00 00       $  ANS048:781 03 22 E0 17 00 00 00 00
  $  REQ049:701 03 22 C1 03 00 00 00 00       $  ANS049:781 03 22 C1 03 00 00 00 00

  $  000.车速自动闭锁配置                              $    $           $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  001.后风窗和后视镜加热配置                        $    $           $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  002.RKE(遥控车门开关)主驾单独解锁配置             $    $           $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  003.PKE(无钥匙进入系统)主驾单独解锁配置           $    $           $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  004.尾门门配置                                    $    $           $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  005.P档解锁配置                                   $    $           $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  006.P档解锁输出配置                               $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0876;else y=@0877;
  $  007.节能/运动开关                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  008.后视镜折叠                                    $    $           $    $  ANS000.BYTE005  $  if((x&0x03)==0)y=@000f;else if((x&0x03)==0x01)y=@0521;else if((x&0x03)==0x02)y=@0522;else y=@0004;
  $  009.锁电机热保护时间设置                          $    $  s        $    $  ANS000.BYTE006  $  y=x;
  $  010.刹车标定偏差设置                              $    $  %        $    $  ANS000.BYTE007  $  y=x;
  $  011.配RKE(遥控车门开关)数量设置                   $    $           $    $  ANS000.BYTE004  $  if((x&0x70)==0x10)y=@04d3;else if((x&0x70)==0x20)y=@0169;else if((x&0x70)==0x30)y=@016b;else if((x&0x70)==0x40)y=@0523;else y=@01a9;
  $  012.负载管理模式设置                              $    $           $    $  ANS001.BYTE004  $  if((x&0x0C)==0x00)y=@01d1;else if((x&0x0C)==0x04)y=@0524;else if((x&0x0C)==0x08)y=@0525;else y=@01a9;
  $  013.生产运行周期设置                              $    $           $    $  ANS001.BYTE004  $  if((x&0x03)==0x00)y=@050b;else if((x&0x03)==0x01)y=@050c;else if((x&0x03)==0x02)y=@050d;else y=@050e;
  $  014.TCU配置                                       $    $           $    $  ANS001.BYTE005  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  015.PEPS配置                                      $    $           $    $  ANS001.BYTE005  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  016.IMMO(防盗系统)配置                            $    $           $    $  ANS001.BYTE005  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  017.左舵或右舵设置                                $    $           $    $  ANS001.BYTE005  $  if((x&0x10)==0x10)y=@050f;else y=@0510;
  $  018.车辆类型配置                                  $    $           $    $  ANS001.BYTE005  $  if((x&0x0F)==0x00)y=@0874;else if((x&0x0F)==0x01)y=@0875; else y=@01a9;
  $  019.ESP设置                                       $    $           $    $  ANS001.BYTE006  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  020.IPK设置                                       $    $           $    $  ANS001.BYTE006  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  021.MC/EMS配置                                    $    $           $    $  ANS001.BYTE006  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  022.SAS配置                                       $    $           $    $  ANS001.BYTE006  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  023.SRS安全气囊配置                               $    $           $    $  ANS001.BYTE006  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  024.FICM配置                                      $    $           $    $  ANS001.BYTE006  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  025.DDD(疲劳驾驶检测)配置                         $    $           $    $  ANS001.BYTE007  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  026.钥匙插入信号                                  $    $           $    $  ANS002.BYTE004  $  if(x==0x00)y=@0495;else if(x==0x01) y=@0507; else y=@01a9;
  $  027.行驶里程备份                                  $    $  km       $    $  ANS003.BYTE004  $  y=(x1*256*256)+(x2*256)+x3;
  $  028.保养里程备份                                  $    $  km       $    $  ANS004.BYTE004  $  y=(x1*256*256)+(x2*256)+x3;
  $  029.制动5V反馈值                                  $    $           $    $  ANS005.BYTE004  $  y=(x1*256)+x2;
  $  030.刹车踏板输入                                  $    $           $    $  ANS006.BYTE004  $  y=(x1*256)+x2;
  $  031.组合灯光开关输入                              $    $           $    $  ANS007.BYTE004  $  if(x==0x00)y=@062b;else if(x==0x01)y=@062c;else if(x==0x03)y=@000f;else y=@01a9;
  $  032.碰撞信号                                      $    $           $    $  ANS008.BYTE004  $  y=x;
  $  033.变速器换挡杆位置                              $    $           $    $  ANS009.BYTE004  $  if((x&0x0F)==0x00)y=@0514;else if((x&0x0F)==0x01)y=@00b4;else if((x&0x0F)==0x02)y=@0388;else if((x&0x0F)==0x03)y=@0515;else if((x&0x0F)==0x04)y=@0516;else if((x&0x0F)==0x05)y=@0517;else if((x&0x0F)==0x06)y=@0518;else if((x&0x0F)==0x07)y=@0519;else if((x&0x0F)==0x08)y=@051a;else if((x&0x0F)==0x09)y=@051b;else if((x&0x0F)==0x0A)y=@051c;else if((x&0x0F)==0x0B)y=@051d;else if((x&0x0F)==0x0F)y=@051e;else y=@01a9;
  $  034.当前已学习遥控钥匙数量                        $    $           $    $  ANS010.BYTE004  $  y=x;
  $  035.疲劳驾驶参数设置                              $    $           $    $  ANS011.BYTE004  $  y=x;
  $  036.疲劳驾驶性能调节                              $    $           $    $  ANS011.BYTE005  $  y=(x1*256+x2);
  $  037.近光灯开关输入                                $    $           $    $  ANS012.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  038.驾驶员门开关                                  $    $           $    $  ANS012.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  039.右前门开关输入                                $    $           $    $  ANS012.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  040.后视镜折叠设置                                $    $           $    $  ANS012.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  041.远光灯开关输入                                $    $           $    $  ANS012.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  042.前雨刮归位信号输入                            $    $           $    $  ANS012.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  043.危险警报灯开关输入                            $    $           $    $  ANS012.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  044.位置灯开关输入                                $    $           $    $  ANS012.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  045.后窗和后视镜加热开关输入                      $    $           $    $  ANS013.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  046.后雾灯开关                                    $    $           $    $  ANS013.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  047.主驾门解锁/闭锁反馈输入                       $    $           $    $  ANS013.BYTE004  $  if((x&0x20)==0x20)y=@0404;else y=@0055;
  $  048.右转向灯开关输入                              $    $           $    $  ANS013.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  049.前雨刮低速开关输入                            $    $           $    $  ANS014.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  050.副驾驶门解锁/闭锁反馈输入                     $    $           $    $  ANS014.BYTE004  $  if((x&0x40)==0x40)y=@0404;else y=@0055;
  $  051.左后门开关状态输入                            $    $           $    $  ANS014.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  052.右后门开关状态输入                            $    $           $    $  ANS014.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  053.前雾灯开关输入                                $    $           $    $  ANS014.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  054.钥匙插入信号输入                              $    $           $    $  ANS014.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  055.油箱盖开关输入                                $    $           $    $  ANS014.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  056.前雨刮高速输入                                $    $           $    $  ANS014.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  057.前洗涤开关输入                                $    $           $    $  ANS015.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  058.KLR输入                                       $    $           $    $  ANS016.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  059.KL15点火开关                                  $    $           $    $  ANS016.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  060.倒车灯开关输入                                $    $           $    $  ANS016.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  061.中控锁闭锁开关输入                            $    $           $    $  ANS017.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  062.刹车灯开关输入                                $    $           $    $  ANS017.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  063.远光灯开关输入                                $    $           $    $  ANS017.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  064.左转向灯开关输入                              $    $           $    $  ANS017.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  065.自动灯光开关输入                              $    $           $    $  ANS017.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  066.中控锁解锁开关输入                            $    $           $    $  ANS017.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  067.中控闭锁输出                                  $    $           $    $  ANS018.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  068.油箱盖                                        $    $           $    $  ANS018.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  069.中控解锁输出                                  $    $           $    $  ANS018.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  070.主驾驶单独解锁                                $    $           $    $  ANS018.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  071.前洗涤输出                                    $    $           $    $  ANS018.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  072.P档解锁(高配，中高配)                         $    $           $    $  ANS018.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  073.近光灯继电器驱动输出                          $    $           $    $  ANS018.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  074.远光灯继电器                                  $    $           $    $  ANS018.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  075.左前雾灯继电器驱动输出                        $    $           $    $  ANS018.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  076.喇叭继电器                                    $    $           $    $  ANS018.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  077.后窗和后视镜加热继电器驱动输出                $    $           $    $  ANS018.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  078.前雨刮低速继电器驱动输出                      $    $           $    $  ANS018.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  079.前雨刮高速继电器驱动输出                      $    $           $    $  ANS018.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  080.右前雾灯继电器驱动输出                        $    $           $    $  ANS018.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  081.倒车灯输出                                    $    $           $    $  ANS019.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  082.左日间行车灯输出                              $    $           $    $  ANS019.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  083.右日间行车灯输出                              $    $           $    $  ANS019.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  084.后视镜折叠                                    $    $           $    $  ANS019.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  085.后视镜展开                                    $    $           $    $  ANS019.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  086.RAP/ACC继电器输出                             $    $           $    $  ANS019.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  087.KL15 IG1驱动器输出                            $    $           $    $  ANS019.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  088.ACC唤醒输出                                   $    $           $    $  ANS019.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  089.高位制动灯输出                                $    $           $    $  ANS019.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  090.刹车灯                                        $    $           $    $  ANS019.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  091.位置灯输出                                    $    $           $    $  ANS019.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  092.后雾灯输出                                    $    $           $    $  ANS019.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  093.左转向灯输出                                  $    $           $    $  ANS019.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  094.右转向灯输出                                  $    $           $    $  ANS019.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  095.车身防盗状态指示灯                            $    $           $    $  ANS019.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  096.PWM(脉宽调制)调光                             $    $           $    $  ANS020.BYTE004  $  y=x;
  $  097.背光灯开关输入                                $    $           $    $  ANS021.BYTE004  $  if(x==0x02)y=@0509;else if(x==0x03)y=@000f;else y=@01a9;
  $  098.发动机运行状态                                $    $           $    $  ANS022.BYTE004  $  if(x==0x00)y=@018e;else if(x==0x01)y=@0011;else y=@01a9;
  $  099.前雨刮间歇档位调节输入                        $    $           $    $  ANS023.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=12))y=@04f4; else if(((x1*256+x2)>=201)&&((x1*256+x2)<=249))y=@04f5; else if(((x1*256+x2)>=335)&&((x1*256+x2)<=421))y=@04f6; else if(((x1*256+x2)>=449)&&((x1*256+x2)<=545))y=@04f7; else if(((x1*256+x2)>=549)&&((x1*256+x2)<=629))y=@04f8; else y=@01a9;
  $  100.前雾灯输入值                                  $    $           $    $  ANS024.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  101.换挡                                          $    $           $    $  ANS025.BYTE004  $  if(x==0x01)y=@0508;else y=@01a9;
  $  102.前舱盖开关输入                                $    $           $    $  ANS026.BYTE004  $  if(x==0x01)y=@01da;else if(x==0x02)y=@01db;else y=@01a9;
  $  103.IMMO(防盗系统)锁定状态                        $    $           $    $  ANS027.BYTE004  $  if((x&0x80)==0x80)y=@0055;else y=@0404;
  $  104.钥匙数量                                      $    $           $    $  ANS027.BYTE004  $  y=(x&0x0F);
  $  105.点火开关5V反馈                                $    $           $    $  ANS028.BYTE004  $  y=x;
  $  106.点火开关环形背光                              $    $           $    $  ANS029.BYTE004  $  y=x;
  $  107.点火开关                                      $    $           $    $  ANS030.BYTE004  $  if((x1*256+x2)<=10)y=@000f;else y=@01a9;
  $  108.点火开关状态                                  $    $           $    $  ANS031.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0507;else if(x==0x02)y=@0464;else if(x==0x03)y=@009e;else y=@01a9;
  $  109.钥匙插入状态                                  $    $           $    $  ANS031.BYTE005  $  if(x==0x00)y=@0495;else if(x==0x01) y=@0507; else y=@01a9;
  $  110.出厂照我回家功能外灯延时设置                  $    $           $    $  ANS032.BYTE004  $  if((x&0xC0)==0x00)y=@04d4;else if((x&0xC0)==0x40)y=@04fd;else if((x&0xC0)==0x80)y=@0502; else y=@0503;
  $  111.出厂寻车功能反馈方式设置                      $    $           $    $  ANS032.BYTE004  $  if((x&0x20)==0x20)y=@0505;else y=@0506;
  $  112.出厂熄火自动解锁配置                          $    $           $    $  ANS032.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  113.出厂RKE(遥控车门开关)主驾单独解锁配置         $    $           $    $  ANS032.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  114.出厂PKE(无钥匙进入系统)主驾单独解锁配置       $    $           $    $  ANS032.BYTE004  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  115.出厂照我回家功能配置                          $    $           $    $  ANS032.BYTE005  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  116.出厂车速自动闭锁配置                          $    $           $    $  ANS032.BYTE005  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  117.出厂闭锁反馈方式配置                          $    $           $    $  ANS032.BYTE005  $  if((x&0x03)==0x00)y=@0504;else if((x&0x03)==0x01)y=@000f;else if((x&0x03)==0x02)y=@0505;
  $  118.钥匙相关                                      $    $           $    $  ANS033.BYTE004  $  HEX(X1,X2);
  $  119.前舱盖配置                                    $    $           $    $  ANS034.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  120.前雾灯配置                                    $    $           $    $  ANS034.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  121.自动灯光配置                                  $    $           $    $  ANS034.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  122.尾门灯配置                                    $    $           $    $  ANS034.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  123.日间行车灯配置                                $    $           $    $  ANS034.BYTE004  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  124.超车灯打开方式                                $    $           $    $  ANS034.BYTE004  $  if((x&0x04)==0x04)y=@04f9;else y=@04fa;
  $  125.背光调节开关配置                              $    $           $    $  ANS034.BYTE007  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  126.照我回家功能外灯延时设置                      $    $           $    $  ANS035.BYTE004  $  if((x&0xE0)==0x00)y=@04d4;else if((x&0xE0)==0x20)y=@04fd;else if((x&0xE0)==0x40)y=@0502;else if((x&0xE0)==0x60)y=@0503;else y=@000f;
  $  127.闭锁反馈方式设置                              $    $           $    $  ANS035.BYTE004  $  if((x&0x18)==0x00)y=@0504;else if((x&0x18)==0x08)y=@000f;else if((x&0x18)==0x10)y=@0505;else y=@0506;
  $  128.照我回家功能配置                              $    $           $    $  ANS035.BYTE004  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  129.寻车功能反馈方式设置                          $    $           $    $  ANS035.BYTE005  $  if((x&0x80)==0x80)y=@0505;else y=@0506;
  $  130.解锁反馈方式设置                              $    $           $    $  ANS035.BYTE005  $  if((x&0x60)==0x00)y=@000f;else if((x&0x60)==0x20)y=@0506;else y=@01a9;
  $  131.其它自动解锁配置                              $    $           $    $  ANS035.BYTE005  $  if((x&0x18)==0x08)y=@0495;else if((x&0x18)==0x10)y=@0526;else y=@01a9;
  $  132.熄火自动解锁配置                              $    $           $    $  ANS035.BYTE005  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  133.修正增益A                                     $    $           $    $  ANS036.BYTE004  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  134.修正增益B                                     $    $           $    $  ANS036.BYTE006  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  135.增益A                                         $    $           $    $  ANS036.BYTE008  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  136.增益B                                         $    $           $    $  ANS036.BYTE010  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  137.后雾灯输入值                                  $    $           $    $  ANS037.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  138.后视镜折叠输入值                              $    $           $    $  ANS038.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  139.内顶灯高边输出                                $    $           $    $  ANS039.BYTE004  $  y=x;
  $  140.内顶灯低边输出                                $    $           $    $  ANS040.BYTE004  $  y=x;
  $  141.SK2锁定状态                                   $    $           $    $  ANS041.BYTE004  $  if((x&0x80)==0x80)y=@0055;else y=@0404;
  $  142.SK2写入状态                                   $    $           $    $  ANS041.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  143.动力模式                                      $    $           $    $  ANS042.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0463;else if(x==0x02)y=@0028;else if(x==0x03)y=@009e;else y=@01a9;
  $  144.安全警报状态                                  $    $           $    $  ANS042.BYTE005  $  if(x==0x00)y=@0527;else if(x==0x01)y=@0528;else if(x==0x02)y=@0529;else if(x==0x03)y=@0189;else y=@01a9;
  $  145.灯光自动控制                                  $    $           $    $  ANS043.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  146.雨量传感器状态                                $    $           $    $  ANS043.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  147.软件版本日期                                  $    $           $    $  ANS044.BYTE004  $  HEX(X1,X2,X3,X4);
  $  148.启动停止开关输入                              $    $           $    $  ANS045.BYTE004  $  if(x==0x01)y=@01db;else y=@01a9;
  $  149.TBOX请求需认证配置                            $    $           $    $  ANS046.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  150.TBOX控制窗功能配置                            $    $           $    $  ANS046.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  151.TBOX远程启动功能配置                          $    $           $    $  ANS046.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  152.TBOX远程钥匙管理功能配置                      $    $           $    $  ANS046.BYTE004  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  153.TBOX远程寻车功能设置                          $    $           $    $  ANS046.BYTE004  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  154.TBOX远程解闭锁控制功能配置                    $    $           $    $  ANS046.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  155.TBOX功能配置                                  $    $           $    $  ANS046.BYTE004  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  156.BCM允许重复发送认证的最大次数设置             $    $           $    $  ANS046.BYTE005  $  if((x&0xC0)==0x40)y=@052a;else if((x&0xC0)==0x80)y=@052b;else if((x&0xC0)==0xC0)y=@052c;else y=@052d;
  $  157.BCM允许认证失败次数                           $    $           $    $  ANS046.BYTE005  $  y=(x&0x30)/16;
  $  158.等待TBOX响应的最长时间                        $    $  s        $    $  ANS046.BYTE005  $  y=(x&0x0F);
  $  159.左转向输入值                                  $    $           $    $  ANS047.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  160.车辆速度                                      $    $  km/h     $    $  ANS048.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  161.车速状态                                      $    $           $    $  ANS048.BYTE006  $  if(x==0x00)y=@00bb;else if(x==0x01)y=@0136;else y=@01a9;
  $  162.前雨刮自动配置                                $    $           $    $  ANS049.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  163.后雨刮配置                                    $    $           $    $  ANS049.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  164.前洗涤与前雨刮联动输出间隔设置                $    $  ms       $    $  ANS049.BYTE005  $  y=x*100;
  $  165.雨刮堵转判断时间设置                          $    $  s        $    $  ANS049.BYTE006  $  y=x;
  $  166.后洗涤与后雨刮联动输出间隔设置                $    $  ms       $    $  ANS049.BYTE007  $  y=x*100;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:701 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
