
    车型ID：1007

    模拟：协议模拟-->1007

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/07000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 D0 00 00 00 00       $%  ANS000:7E9 03 22 F1 D0 00 00 00 00
  $%  REQ001:7E1 03 22 29 63 00 00 00 00       $%  ANS001:7E9 03 22 29 63 00 00 00 00
  $%  REQ002:7E1 03 22 00 02 00 00 00 00       $%  ANS002:7E9 03 22 00 02 00 00 00 00
  $%  REQ003:7E1 03 22 F1 A0 00 00 00 00       $%  ANS003:7E9 03 22 F1 A0 00 00 00 00
  $%  REQ004:7E1 03 22 F1 83 00 00 00 00       $%  ANS004:7E9 03 22 F1 83 00 00 00 00
  $%  REQ005:7E1 03 22 F1 A1 00 00 00 00       $%  ANS005:7E9 03 22 F1 A1 00 00 00 00
  $%  REQ006:7E1 03 22 F1 91 00 00 00 00       $%  ANS006:7E9 03 22 F1 91 00 00 00 00
  $%  REQ007:7E1 03 22 F1 A2 00 00 00 00       $%  ANS007:7E9 03 22 F1 A2 00 00 00 00
  $%  REQ008:7E1 03 22 F1 87 00 00 00 00       $%  ANS008:7E9 03 22 F1 87 00 00 00 00
  $%  REQ009:7E1 03 22 20 4B 00 00 00 00       $%  ANS009:7E9 03 22 20 4B 00 00 00 00
  $%  REQ010:7E1 03 22 20 34 00 00 00 00       $%  ANS010:7E9 03 22 20 34 00 00 00 00
  $%  REQ011:7E1 03 22 12 E7 00 00 00 00       $%  ANS011:7E9 03 22 12 E7 00 00 00 00
  $%  REQ012:7E1 03 22 20 4A 00 00 00 00       $%  ANS012:7E9 03 22 20 4A 00 00 00 00
  $%  REQ013:7E1 03 22 F1 10 00 00 00 00       $%  ANS013:7E9 03 22 F1 10 00 00 00 00
  $%  REQ014:7E1 03 22 29 35 00 00 00 00       $%  ANS014:7E9 03 22 29 35 00 00 00 00
  $%  REQ015:7E1 03 22 F1 29 00 00 00 00       $%  ANS015:7E9 03 22 F1 29 00 00 00 00
  $%  REQ016:7E1 03 22 20 39 00 00 00 00       $%  ANS016:7E9 03 22 20 39 00 00 00 00
  $%  REQ017:7E1 03 22 20 35 00 00 00 00       $%  ANS017:7E9 03 22 20 35 00 00 00 00
  $%  REQ018:7E1 03 22 20 3A 00 00 00 00       $%  ANS018:7E9 03 22 20 3A 00 00 00 00
  $%  REQ019:7E1 03 22 F1 D1 00 00 00 00       $%  ANS019:7E9 03 22 F1 D1 00 00 00 00
  $%  REQ020:7E1 03 22 F1 D2 00 00 00 00       $%  ANS020:7E9 03 22 F1 D2 00 00 00 00
  $%  REQ021:7E1 03 22 F1 D3 00 00 00 00       $%  ANS021:7E9 03 22 F1 D3 00 00 00 00
  $%  REQ022:7E1 03 22 F1 D4 00 00 00 00       $%  ANS022:7E9 03 22 F1 D4 00 00 00 00
  $%  REQ023:7E1 03 22 F1 92 00 00 00 00       $%  ANS023:7E9 03 22 F1 92 00 00 00 00
  $%  REQ024:7E1 03 22 F1 8C 00 00 00 00       $%  ANS024:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ025:7E1 03 22 F1 94 00 00 00 00       $%  ANS025:7E9 03 22 F1 94 00 00 00 00
  $%  REQ026:7E1 03 22 F1 8A 00 00 00 00       $%  ANS026:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ027:7E1 03 22 F1 90 00 00 00 00       $%  ANS027:7E9 03 22 F1 90 00 00 00 00
  $%  REQ028:7E1 03 22 F1 A8 00 00 00 00       $%  ANS028:7E9 03 22 F1 A8 00 00 00 00
  $%  REQ029:7E1 03 22 F1 8B 00 00 00 00       $%  ANS029:7E9 03 22 F1 8B 00 00 00 00

  $%  000:刷写软件零件号代码:                          $%    $%  ANS000.BYTE004  $%  ASCII(X1,X2);
  $%  001:指令换挡:                                    $%    $%  ANS001.BYTE004  $%  HEX(X);
  $%  002:DTC所需的冻结帧存储:                         $%    $%  ANS002.BYTE004  $%  HEX(X1,X2);
  $%  003:电控单元应用软件号:                          $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元刷写软件参考号:                      $%    $%  ANS004.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  005:电控单元标定软件号:                          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元硬件号:                              $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元网络文件参考号:                      $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号:                              $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  009:主处理器之间的最大运行复位上电复位:          $%    $%  ANS009.BYTE004  $%  HEX(X1,X2);
  $%  010:主处理器内存故障源地址:                      $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  011:主处理器运行复位源历史地址1:                 $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  012:主处理器运行重置:                            $%    $%  ANS012.BYTE004  $%  HEX(X1,X2);
  $%  013:电控单元零件号(上次):                        $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  014:测试工具参考号(上次):                        $%    $%  ANS013.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  015:里程读数(上次)KM:                            $%    $%  ANS013.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  016:上次换挡类型:                                $%    $%  ANS014.BYTE004  $%  HEX(X);
  $%  017:主标定刷写历史:                              $%    $%  ANS015.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,63,X64,X65,X66,X67,X68,X69,X70,X71,X72,X73,X74,X75,X76,X77,X78,X79,X80,X81,X82,X83,X84,X85,X86,X87,X88,X89,X90,X91,X92);
  $%  018:当前处理器的完整性故障原因代码(1-32):        $%    $%  ANS016.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  019:处理器故障源:                                $%    $%  ANS017.BYTE004  $%  HEX(X);
  $%  020:当前处理器安全故障原因:                      $%    $%  ANS018.BYTE004  $%  HEX(X1,X2);
  $%  021:软件模块标识符代码01:                        $%    $%  ANS019.BYTE004  $%  ASCII(X1,X2);
  $%  022:软件模块标识符代码02:                        $%    $%  ANS020.BYTE004  $%  ASCII(X1,X2);
  $%  023:软件模块标识符代码03:                        $%    $%  ANS021.BYTE004  $%  ASCII(X1,X2);
  $%  024:软件模块标识符代码04:                        $%    $%  ANS022.BYTE004  $%  ASCII(X1,X2);
  $%  025:供应商电控单元硬件参考号:                    $%    $%  ANS023.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  026:供应商电控单元序列号:                        $%    $%  ANS024.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  027:供应商电控单元软件参考号:                    $%    $%  ANS025.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  028:系统供应商识别码:                            $%    $%  ANS026.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  029:VIN码:                                       $%    $%  ANS027.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  030:车辆特征信息:                                $%    $%  ANS028.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  031:电控单元制造日期:                            $%    $%  ANS029.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 28 10 00 00 00 00       $  ANS000:7E9 03 22 28 10 00 00 00 00
  $  REQ001:7E1 03 22 29 38 00 00 00 00       $  ANS001:7E9 03 22 29 38 00 00 00 00
  $  REQ002:7E1 03 22 F1 86 00 00 00 00       $  ANS002:7E9 03 22 F1 86 00 00 00 00
  $  REQ003:7E1 03 22 00 1E 00 00 00 00       $  ANS003:7E9 03 22 00 1E 00 00 00 00
  $  REQ004:7E1 03 22 F1 C0 00 00 00 00       $  ANS004:7E9 03 22 F1 C0 00 00 00 00
  $  REQ005:7E1 03 22 11 24 00 00 00 00       $  ANS005:7E9 03 22 11 24 00 00 00 00
  $  REQ006:7E1 03 22 28 62 00 00 00 00       $  ANS006:7E9 03 22 28 62 00 00 00 00
  $  REQ007:7E1 03 22 00 42 00 00 00 00       $  ANS007:7E9 03 22 00 42 00 00 00 00
  $  REQ008:7E1 03 22 3D 28 00 00 00 00       $  ANS008:7E9 03 22 3D 28 00 00 00 00
  $  REQ009:7E1 03 22 1A 01 00 00 00 00       $  ANS009:7E9 03 22 1A 01 00 00 00 00
  $  REQ010:7E1 03 22 F1 F0 00 00 00 00       $  ANS010:7E9 03 22 F1 F0 00 00 00 00
  $  REQ011:7E1 03 22 1A 2D 00 00 00 00       $  ANS011:7E9 03 22 1A 2D 00 00 00 00
  $  REQ012:7E1 03 22 00 21 00 00 00 00       $  ANS012:7E9 03 22 00 21 00 00 00 00
  $  REQ013:7E1 03 22 00 31 00 00 00 00       $  ANS013:7E9 03 22 00 31 00 00 00 00
  $  REQ014:7E1 03 22 00 05 00 00 00 00       $  ANS014:7E9 03 22 00 05 00 00 00 00
  $  REQ015:7E1 03 22 00 0C 00 00 00 00       $  ANS015:7E9 03 22 00 0C 00 00 00 00
  $  REQ016:7E1 03 22 19 A1 00 00 00 00       $  ANS016:7E9 03 22 19 A1 00 00 00 00
  $  REQ017:7E1 03 22 11 41 00 00 00 00       $  ANS017:7E9 03 22 11 41 00 00 00 00
  $  REQ018:7E1 03 22 12 41 00 00 00 00       $  ANS018:7E9 03 22 12 41 00 00 00 00
  $  REQ019:7E1 03 22 00 0F 00 00 00 00       $  ANS019:7E9 03 22 00 0F 00 00 00 00
  $  REQ020:7E1 03 22 F1 E2 00 00 00 00       $  ANS020:7E9 03 22 F1 E2 00 00 00 00
  $  REQ021:7E1 03 22 20 33 00 00 00 00       $  ANS021:7E9 03 22 20 33 00 00 00 00
  $  REQ022:7E1 03 22 12 DE 00 00 00 00       $  ANS022:7E9 03 22 12 DE 00 00 00 00
  $  REQ023:7E1 03 22 00 01 00 00 00 00       $  ANS023:7E9 03 22 00 01 00 00 00 00
  $  REQ024:7E1 03 22 00 41 00 00 00 00       $  ANS024:7E9 03 22 00 41 00 00 00 00
  $  REQ025:7E1 03 22 C0 01 00 00 00 00       $  ANS025:7E9 03 22 C0 01 00 00 00 00
  $  REQ026:7E1 03 22 00 30 00 00 00 00       $  ANS026:7E9 03 22 00 30 00 00 00 00
  $  REQ027:7E1 03 22 1C 01 00 00 00 00       $  ANS027:7E9 03 22 1C 01 00 00 00 00
  $  REQ028:7E1 03 22 12 40 00 00 00 00       $  ANS028:7E9 03 22 12 40 00 00 00 00
  $  REQ029:7E1 03 22 28 17 00 00 00 00       $  ANS029:7E9 03 22 28 17 00 00 00 00
  $  REQ030:7E1 03 22 28 18 00 00 00 00       $  ANS030:7E9 03 22 28 18 00 00 00 00
  $  REQ031:7E1 03 22 28 19 00 00 00 00       $  ANS031:7E9 03 22 28 19 00 00 00 00
  $  REQ032:7E1 03 22 28 1A 00 00 00 00       $  ANS032:7E9 03 22 28 1A 00 00 00 00
  $  REQ033:7E1 03 22 28 1B 00 00 00 00       $  ANS033:7E9 03 22 28 1B 00 00 00 00
  $  REQ034:7E1 03 22 28 11 00 00 00 00       $  ANS034:7E9 03 22 28 11 00 00 00 00
  $  REQ035:7E1 03 22 28 12 00 00 00 00       $  ANS035:7E9 03 22 28 12 00 00 00 00
  $  REQ036:7E1 03 22 28 13 00 00 00 00       $  ANS036:7E9 03 22 28 13 00 00 00 00
  $  REQ037:7E1 03 22 28 14 00 00 00 00       $  ANS037:7E9 03 22 28 14 00 00 00 00
  $  REQ038:7E1 03 22 28 15 00 00 00 00       $  ANS038:7E9 03 22 28 15 00 00 00 00
  $  REQ039:7E1 03 22 19 4F 00 00 00 00       $  ANS039:7E9 03 22 19 4F 00 00 00 00
  $  REQ040:7E1 03 22 AF FC 00 00 00 00       $  ANS040:7E9 03 22 AF FC 00 00 00 00
  $  REQ041:7E1 03 22 28 04 00 00 00 00       $  ANS041:7E9 03 22 28 04 00 00 00 00
  $  REQ042:7E1 03 22 28 1E 00 00 00 00       $  ANS042:7E9 03 22 28 1E 00 00 00 00
  $  REQ043:7E1 03 22 28 1F 00 00 00 00       $  ANS043:7E9 03 22 28 1F 00 00 00 00
  $  REQ044:7E1 03 22 F1 C1 00 00 00 00       $  ANS044:7E9 03 22 F1 C1 00 00 00 00
  $  REQ045:7E1 03 22 F1 C2 00 00 00 00       $  ANS045:7E9 03 22 F1 C2 00 00 00 00
  $  REQ046:7E1 03 22 F1 C3 00 00 00 00       $  ANS046:7E9 03 22 F1 C3 00 00 00 00
  $  REQ047:7E1 03 22 F1 C4 00 00 00 00       $  ANS047:7E9 03 22 F1 C4 00 00 00 00
  $  REQ048:7E1 03 22 AF FE 00 00 00 00       $  ANS048:7E9 03 22 AF FE 00 00 00 00
  $  REQ049:7E1 03 22 AF FD 00 00 00 00       $  ANS049:7E9 03 22 AF FD 00 00 00 00
  $  REQ050:7E1 03 22 AF FF 00 00 00 00       $  ANS050:7E9 03 22 AF FF 00 00 00 00
  $  REQ051:7E1 03 22 29 37 00 00 00 00       $  ANS051:7E9 03 22 29 37 00 00 00 00
  $  REQ052:7E1 03 22 28 16 00 00 00 00       $  ANS052:7E9 03 22 28 16 00 00 00 00
  $  REQ053:7E1 03 22 19 92 00 00 00 00       $  ANS053:7E9 03 22 19 92 00 00 00 00
  $  REQ054:7E1 03 22 1F 01 00 00 00 00       $  ANS054:7E9 03 22 1F 01 00 00 00 00
  $  REQ055:7E1 03 22 28 34 00 00 00 00       $  ANS055:7E9 03 22 28 34 00 00 00 00
  $  REQ056:7E1 03 22 28 33 00 00 00 00       $  ANS056:7E9 03 22 28 33 00 00 00 00
  $  REQ057:7E1 03 22 1A 18 00 00 00 00       $  ANS057:7E9 03 22 1A 18 00 00 00 00
  $  REQ058:7E1 03 22 28 1C 00 00 00 00       $  ANS058:7E9 03 22 28 1C 00 00 00 00
  $  REQ059:7E1 03 22 28 09 00 00 00 00       $  ANS059:7E9 03 22 28 09 00 00 00 00
  $  REQ060:7E1 03 22 19 91 00 00 00 00       $  ANS060:7E9 03 22 19 91 00 00 00 00
  $  REQ061:7E1 03 22 1A 26 00 00 00 00       $  ANS061:7E9 03 22 1A 26 00 00 00 00
  $  REQ062:7E1 03 22 28 0C 00 00 00 00       $  ANS062:7E9 03 22 28 0C 00 00 00 00
  $  REQ063:7E1 03 22 3D 00 00 00 00 00       $  ANS063:7E9 03 22 3D 00 00 00 00 00
  $  REQ064:7E1 03 22 19 5D 00 00 00 00       $  ANS064:7E9 03 22 19 5D 00 00 00 00
  $  REQ065:7E1 03 22 28 0F 00 00 00 00       $  ANS065:7E9 03 22 28 0F 00 00 00 00
  $  REQ066:7E1 03 22 1A 1F 00 00 00 00       $  ANS066:7E9 03 22 1A 1F 00 00 00 00
  $  REQ067:7E1 03 22 19 9A 00 00 00 00       $  ANS067:7E9 03 22 19 9A 00 00 00 00
  $  REQ068:7E1 03 22 28 0D 00 00 00 00       $  ANS068:7E9 03 22 28 0D 00 00 00 00
  $  REQ069:7E1 03 22 28 1D 00 00 00 00       $  ANS069:7E9 03 22 28 1D 00 00 00 00
  $  REQ070:7E1 03 22 28 21 00 00 00 00       $  ANS070:7E9 03 22 28 21 00 00 00 00
  $  REQ071:7E1 03 22 19 41 00 00 00 00       $  ANS071:7E9 03 22 19 41 00 00 00 00
  $  REQ072:7E1 03 22 19 40 00 00 00 00       $  ANS072:7E9 03 22 19 40 00 00 00 00
  $  REQ073:7E1 03 22 19 42 00 00 00 00       $  ANS073:7E9 03 22 19 42 00 00 00 00
  $  REQ074:7E1 03 22 28 20 00 00 00 00       $  ANS074:7E9 03 22 28 20 00 00 00 00
  $  REQ075:7E1 03 22 19 51 00 00 00 00       $  ANS075:7E9 03 22 19 51 00 00 00 00
  $  REQ076:7E1 03 22 19 7E 00 00 00 00       $  ANS076:7E9 03 22 19 7E 00 00 00 00
  $  REQ077:7E1 03 22 19 D4 00 00 00 00       $  ANS077:7E9 03 22 19 D4 00 00 00 00
  $  REQ078:7E1 03 22 00 0D 00 00 00 00       $  ANS078:7E9 03 22 00 0D 00 00 00 00

  $  000.加速器有效位置                                             $    $  %            $    $  ANS000.BYTE004  $  y=x1*100/256.0;
  $  001.蓄能器压力                                                 $    $  kPa          $    $  ANS001.BYTE004  $  y=(x1*256+x2)/16.0;
  $  002.当前诊断模式                                               $    $               $    $  ANS002.BYTE004  $  if((x&0x03)==0x01)y=@015f;else if((x&0x03)==0x02)y=@0180;else if((x&0x03)==0x03)y=@00b0;else y=@01a9;
  $  003.辅助输入状态-动力输出状态                                  $    $               $    $  ANS003.BYTE004  $  if((x&0x01)==0x01)y=@00bb;else y=@00b1;
  $  004.刷写软件零件号                                             $    $               $    $  ANS004.BYTE004  $  y=x1*256+x2;
  $  005.制动踏板状态                                               $    $               $    $  ANS005.BYTE004  $  if((x&0x08)==0x08)y=@00bb;else y=@0136;
  $  006.计算传输线压力                                             $    $  kPa          $    $  ANS006.BYTE004  $  y=(x1*256+x2)/16.0;
  $  007.控制模块电压                                               $    $  V            $    $  ANS007.BYTE004  $  y=(x1*256+x2)*0.001;
  $  008.控制器关闭触发器-打开开关                                  $    $               $    $  ANS008.BYTE004  $  if((x&0x80)==0x80)y=@00bb;else y=@0136;
  $  009.控制器关闭触发器-立即                                      $    $               $    $  ANS008.BYTE004  $  if((x&0x40)==0x40)y=@00bb;else y=@0136;
  $  010.液力变矩器变矩比                                           $    $               $    $  ANS009.BYTE004  $  y=(x1*256+x2)*0.000122070;
  $  011.计数器：N挡R挡P挡自动启动                                  $    $               $    $  ANS010.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  012.计数器：D挡制动启动                                        $    $               $    $  ANS010.BYTE009  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  013.计数器：润滑油清洗                                         $    $               $    $  ANS010.BYTE013  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  014.计数器：快充请求                                           $    $               $    $  ANS010.BYTE017  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  015.计数器：关闭钥匙                                           $    $               $    $  ANS010.BYTE021  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  016.计数器：默认                                               $    $               $    $  ANS010.BYTE025  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  017.输出发动机扭矩                                             $    $  Nm           $    $  ANS011.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.25;
  $  018.故障指示灯激活时已行驶的距离                               $    $  km           $    $  ANS012.BYTE004  $  y=x1*256+x2;
  $  019.清除故障码后行驶的距离                                     $    $  km           $    $  ANS013.BYTE004  $  y=x1*256+x2;
  $  020.发动机制冷剂温度                                           $    $  degree C     $    $  ANS014.BYTE004  $  y=x-40;
  $  021.发动机转速                                                 $    $  rpm          $    $  ANS015.BYTE004  $  y=(x1*256+x2)*0.25;
  $  022.齿轮箱速比                                                 $    $               $    $  ANS016.BYTE004  $  y=x*0.01563;
  $  023.点火电压                                                   $    $  V            $    $  ANS017.BYTE004  $  y=x*0.1;
  $  024.点火开关状态                                               $    $               $    $  ANS018.BYTE004  $  if((x&0x07)==0x00)y=@000f;else if((x&0x07)==0x01)y=@0010;else if((x&0x07)==0x02)y=@0011;else if((x&0x07)==0x03)y=@05d2;else y=@01a9;
  $  025.进气温度                                                   $    $  degree C     $    $  ANS019.BYTE004  $  y=x-40;
  $  026.MEC-制造商使能计数器                                       $    $               $    $  ANS020.BYTE004  $  y=x;
  $  027.主处理器Nvm(非易失存储器)故障状态-静止状态                 $    $               $    $  ANS021.BYTE004  $  if((x&0xC0)==0x40)y=@00ac;else if((x&0xC0)==0xC0)y=@00ad;else y=@01a9;
  $  028.主处理器Nvm(非易失存储器)故障状态-累积状态                 $    $               $    $  ANS021.BYTE004  $  if((x&0x30)==0x10)y=@00ac;else if((x&0x30)==0x30)y=@00ad;else y=@01a9;
  $  029.主处理器Nvm(非易失存储器)故障状态-可适应状态               $    $               $    $  ANS021.BYTE004  $  if((x&0x0C)==0x04)y=@00ac;else if((x&0x0C)==0x0C)y=@00ad;else y=@01a9;
  $  030.主处理器Nvm(非易失存储器)故障状态-静态最初校核状态         $    $               $    $  ANS021.BYTE004  $  if((x&0x03)==0x01)y=@00ac;else if((x&0x03)==0x03)y=@00ad;else y=@01a9;
  $  031.主处理器Nvm(非易失存储器)故障状态-累积最初校核状态         $    $               $    $  ANS021.BYTE005  $  if((x&0xC0)==0x40)y=@00ac;else if((x&0xC0)==0xC0)y=@00ad;else y=@01a9;
  $  032.主处理器Nvm(非易失存储器)故障状态-可适应最初校核状态       $    $               $    $  ANS021.BYTE005  $  if((x&0x30)==0x10)y=@00ac;else if((x&0x30)==0x30)y=@00ad;else y=@01a9;
  $  033.主处理器复位来源                                           $    $               $    $  ANS022.BYTE004  $  if(x==0x00)y=@063c;else if(x==0x02) y=@00bd;else if(x==0x03) y=@00be;else if(x==0x04) y=@00bf;else y=@01a9;
  $  034.监测状态自DTC清除-故障指示灯                               $    $               $    $  ANS023.BYTE004  $  if((x&0x80)==0x80)y=@063d;else y=@063e;
  $  035.监测状态自DTC清除-综合部件监测_1                           $    $               $    $  ANS023.BYTE005  $  if((x&0x40)==0x40)y=@0630;else y=@0631;
  $  036.监测状态自DTC清除-燃油系统监测_1                           $    $               $    $  ANS023.BYTE005  $  if((x&0x20)==0x20)y=@0630;else y=@0631;
  $  037.监测状态自DTC清除-失火监测_1                               $    $               $    $  ANS023.BYTE005  $  if((x&0x10)==0x10)y=@0630;else y=@0631;
  $  038.监测状态自DTC清除-EGR(废气再循环)系统监测_2                $    $               $    $  ANS023.BYTE007  $  if((x&0x80)==0x80)y=@0630;else y=@0631;
  $  039.监测状态自DTC清除-氧传感器加热器监测_2                     $    $               $    $  ANS023.BYTE007  $  if((x&0x40)==0x40)y=@0630;else y=@0631;
  $  040.监测状态自DTC清除-氧传感器监测_2                           $    $               $    $  ANS023.BYTE007  $  if((x&0x20)==0x20)y=@0630;else y=@0631;
  $  041.监测状态自DTC清除-A/C系统制冷剂监测_2                      $    $               $    $  ANS023.BYTE007  $  if((x&0x10)==0x10)y=@0630;else y=@0631;
  $  042.监测状态自DTC清除-二级空气系统监测_2                       $    $               $    $  ANS023.BYTE007  $  if((x&0x08)==0x08)y=@0630;else y=@0631;
  $  043.监测状态自DTC清除-蒸发系统监测_2                           $    $               $    $  ANS023.BYTE007  $  if((x&0x04)==0x04)y=@0630;else y=@0631;
  $  044.监测状态自DTC清除-加热催化器监测_2                         $    $               $    $  ANS023.BYTE007  $  if((x&0x02)==0x02)y=@0630;else y=@0631;
  $  045.监测状态自DTC清除-催化剂监测_2                             $    $               $    $  ANS023.BYTE007  $  if((x&0x01)==0x01)y=@0630;else y=@0631;
  $  046.这个驱动周期监控状态-部件_1                                $    $               $    $  ANS024.BYTE005  $  if((x&0x04)==0x04)y=@0630;else y=@0632;
  $  047.这个驱动周期监控状态-燃油系统_1                            $    $               $    $  ANS024.BYTE005  $  if((x&0x02)==0x02)y=@0630;else y=@0632;
  $  048.这个驱动周期监控状态-失火_1                                $    $               $    $  ANS024.BYTE005  $  if((x&0x01)==0x01)y=@0630;else y=@0632;
  $  049.这个驱动周期监控状态-EGR(废气再循环)系统_2                 $    $               $    $  ANS024.BYTE007  $  if((x&0x80)==0x80)y=@0630;else y=@0631;
  $  050.这个驱动周期监控状态-氧传感器加热器_2                      $    $               $    $  ANS024.BYTE007  $  if((x&0x40)==0x40)y=@0630;else y=@0631;
  $  051.这个驱动周期监控状态-氧传感器_2                            $    $               $    $  ANS024.BYTE007  $  if((x&0x20)==0x20)y=@0630;else y=@0631;
  $  052.这个驱动周期监控状态-A/C制冷剂_2                           $    $               $    $  ANS024.BYTE007  $  if((x&0x10)==0x10)y=@0630;else y=@0631;
  $  053.这个驱动周期监控状态-二级空气系统_2                        $    $               $    $  ANS024.BYTE007  $  if((x&0x08)==0x08)y=@0630;else y=@0631;
  $  054.这个驱动周期监控状态-蒸发系统_2                            $    $               $    $  ANS024.BYTE007  $  if((x&0x04)==0x04)y=@0630;else y=@0631;
  $  055.这个驱动周期监控状态-加热催化器_2                          $    $               $    $  ANS024.BYTE007  $  if((x&0x02)==0x02)y=@0630;else y=@0631;
  $  056.这个驱动周期监控状态-催化器_2                              $    $               $    $  ANS024.BYTE007  $  if((x&0x01)==0x01)y=@0630;else y=@0631;
  $  057.网络配置-ABS                                               $    $               $    $  ANS025.BYTE004  $  if((x&0x04)==0x04)y=@00bb;else y=@0136;
  $  058.网络配置-ATS                                               $    $               $    $  ANS025.BYTE004  $  if((x&0x02)==0x02)y=@00bb;else y=@0136;
  $  059.网络配置-TCCM                                              $    $               $    $  ANS025.BYTE004  $  if((x&0x01)==0x01)y=@00bb;else y=@0136;
  $  060.清除故障码后暖机次数                                       $    $               $    $  ANS026.BYTE004  $  y=x;
  $  061.OBD要求的车辆或发动机的认证                                $    $               $    $  ANS027.BYTE004  $  if(x==0x01) y=@062d;else if(x==0x02) y=@062e;else if(x==0x03)y=@00c2;else if(x==0x04)y=@00c3;else if(x==0x05)y=@00c4;else if(x==0x06)y=@00c5;else if(x==0x07)y=@00c6;else if(x==0x08)y=@00c7;else if(x==0x09)y=@062f;else y=@01a9;
  $  062.总里程                                                     $    $  km           $    $  ANS028.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.01562;
  $  063.压力控制电磁阀1指令压力                                    $    $               $    $  ANS029.BYTE004  $  y=(x1*256+x2)/16.0;
  $  064.压力控制电磁阀2指令压力                                    $    $               $    $  ANS030.BYTE004  $  y=(x1*256+x2)/16.0;
  $  065.压力控制电磁阀3指令压力                                    $    $               $    $  ANS031.BYTE004  $  y=(x1*256+x2)/16.0;
  $  066.压力控制电磁阀4指令压力                                    $    $               $    $  ANS032.BYTE004  $  y=(x1*256+x2)/16.0;
  $  067.压力控制电磁阀5指令压力                                    $    $               $    $  ANS033.BYTE004  $  y=(x1*256+x2)/16.0;
  $  068.压力电磁阀1：卡滞在低状态                                  $    $               $    $  ANS034.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  069.压力电磁阀1：卡滞在高状态                                  $    $               $    $  ANS034.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  070.压力电磁阀1：合理状态                                      $    $               $    $  ANS034.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  071.压力电磁阀2：卡滞在低状态                                  $    $               $    $  ANS035.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  072.压力电磁阀2：卡滞在高状态                                  $    $               $    $  ANS035.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  073.压力电磁阀2：合理状态                                      $    $               $    $  ANS035.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  074.压力电磁阀3：卡滞在低状态                                  $    $               $    $  ANS036.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  075.压力电磁阀3：卡滞在高状态                                  $    $               $    $  ANS036.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  076.压力电磁阀3：合理状态                                      $    $               $    $  ANS036.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  077.压力电磁阀4：卡滞在低状态                                  $    $               $    $  ANS037.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  078.压力电磁阀4：卡滞在高状态                                  $    $               $    $  ANS037.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  079.压力电磁阀4：合理状态                                      $    $               $    $  ANS037.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  080.压力电磁阀5：卡滞在低状态                                  $    $               $    $  ANS038.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  081.压力电磁阀5：卡滞在高状态                                  $    $               $    $  ANS038.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  082.压力电磁阀5：合理状态                                      $    $               $    $  ANS038.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  083.换挡杆位置                                                 $    $               $    $  ANS039.BYTE004  $  if(x==0x01)y=@00b4;else if(x==0x02)y=@029b;else if(x==0x04)y=@0515;else if(x==0x06)y=@063b;else y=@01a9;
  $  084.刷写次数                                                   $    $               $    $  ANS040.BYTE004  $  y=x1*256+x2;
  $  085.共享高侧驱动1控制电机：高侧驱动                            $    $               $    $  ANS041.BYTE004  $  if((x&0x80)==0x80)y=@00bb;else y=@0136;
  $  086.共享高侧驱动1控制电机：预留                                $    $               $    $  ANS041.BYTE004  $  if((x&0x40)==0x40)y=@00bb;else y=@0136;
  $  087.共享高侧驱动1控制电机：对地短路                            $    $               $    $  ANS041.BYTE004  $  if((x&0x20)==0x20)y=@00bb;else y=@0136;
  $  088.共享高侧驱动1控制电机：开路                                $    $               $    $  ANS041.BYTE004  $  if((x&0x08)==0x08)y=@00bb;else y=@0136;
  $  089.共享高侧驱动1控制电机：对电源短路                          $    $               $    $  ANS041.BYTE004  $  if((x&0x02)==0x02)y=@00bb;else y=@0136;
  $  090.换挡电磁阀1：卡滞在低状态                                  $    $               $    $  ANS042.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  091.换挡电磁阀1：卡滞在高状态                                  $    $               $    $  ANS042.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  092.换挡电磁阀1：合理状态                                      $    $               $    $  ANS042.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  093.换挡电磁阀2：卡滞在低状态                                  $    $               $    $  ANS043.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  094.换挡电磁阀2：卡滞在高状态                                  $    $               $    $  ANS043.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  095.换挡电磁阀2：合理状态                                      $    $               $    $  ANS043.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  096.软件模块标识符01                                           $    $               $    $  ANS044.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  097.软件模块标识符02                                           $    $               $    $  ANS045.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  098.软件模块标识符03                                           $    $               $    $  ANS046.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  099.软件模块标识符04                                           $    $               $    $  ANS047.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  100.软件兼容性状态-标定应用兼容                                $    $               $    $  ANS048.BYTE004  $  if((x&0x02)==0x02)y=@00b8;else y=@00b7;
  $  101.软件兼容性状态-应用底层兼容                                $    $               $    $  ANS048.BYTE004  $  if((x&0x02)==0x02)y=@00b8;else y=@00b7;
  $  102.软件兼容性状态-标定存在状态                                $    $               $    $  ANS049.BYTE004  $  if((x&0x02)==0x02)y=@00ba;else y=@00b9;
  $  103.软件兼容性状态-程序存在状态                                $    $               $    $  ANS049.BYTE004  $  if((x&0x02)==0x02)y=@00ba;else y=@00b9;
  $  104.软件有效标志                                               $    $               $    $  ANS050.BYTE004  $  if((x&0x01)==0x01)y=@00bb;else y=@0136;
  $  105.发动机状态                                                 $    $               $    $  ANS051.BYTE004  $  if(x==0x00)y=@0077;else if(x==0x01)y=@0078;else if(x==0x02)y=@0079;else if(x==0x03)y=@007a;else if(x==0x04)y=@007b;else if(x==0x05)y=@007c;else if(x==0x06)y=@007d;else y=@01a9;
  $  106.蓄能器电磁阀状态                                           $    $               $    $  ANS051.BYTE005  $  if(x==0x00)y=@007e;else if(x==0x01)y=@007f;else if(x==0x02)y=@0080;else y=@01a9;
  $  107.变速器电磁阀打开请求                                       $    $               $    $  ANS051.BYTE006  $  if(x==0x00)y=@0081;else if(x==0x01)y=@0082;else y=@01a9;
  $  108.变速器启动准备                                             $    $               $    $  ANS051.BYTE007  $  if(x==0x00)y=@0083;else if(x==0x01)y=@0084;else y=@01a9;
  $  109.变速器当前状态                                             $    $               $    $  ANS051.BYTE008  $  if(x==0x01)y=@0085;else if(x==0x02)y=@0086;else if(x==0x03)y=@0087;else if(x==0x04)y=@0088;else if(x==0x05)y=@0089;else if(x==0x06)y=@0633;else if(x==0x07)y=@008b;else y=@0004;
  $  110.蓄能器值                                                   $    $               $    $  ANS051.BYTE009  $  if(x==0x00)y=@008c;else if(x==0x01)y=@008d;else if(x==0x02)y=@008e;else y=@01a9;
  $  111.当前激活错误                                               $    $               $    $  ANS051.BYTE010  $  if(x==0x01)y=@0634;else if(x==0x02)y=@0635;else if(x==0x03)y=@0636;else if(x==0x04)y=@0637;else if(x==0x05)y=@0638;else if(x==0x06)y=@0639;else if(x==0x07)y=@063a;else if(x==0x08)y=@012a;else y=@0004;
  $  112.TCC压力控制电池阀输出状态：卡滞在低状态                    $    $               $    $  ANS052.BYTE004  $  if((x&0x30)==0x00)y=@04dc;else if((x&0x30)==0x10)y=@00b3;else if((x&0x30)==0x20)y=@00ac;else y=@01a9;
  $  113.TCC压力控制电池阀输出状态：卡滞在高状态                    $    $               $    $  ANS052.BYTE004  $  if((x&0x0C)==0x00)y=@04dc;else if((x&0x0C)==0x04)y=@00b3;else if((x&0x0C)==0x08)y=@00ac;else y=@01a9;
  $  114.TCC压力控制电池阀输出状态：合理状态                        $    $               $    $  ANS052.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@00b3;else if((x&0x03)==0x02)y=@00ac;else y=@01a9;
  $  115.最新升档时间                                               $    $  s            $    $  ANS053.BYTE004  $  y=x*0.025;
  $  116.发动机起动后的时间                                         $    $  s            $    $  ANS054.BYTE004  $  y=x1*256+x2;
  $  117.换挡时间                                                   $    $  s            $    $  ANS055.BYTE004  $  y=(x1*256+x2)/160.0;
  $  118.换挡完成时间                                               $    $  s            $    $  ANS056.BYTE004  $  y=(x1*256+x2)/160.0;
  $  119.液力变矩器离合器压力                                       $    $  kPa          $    $  ANS057.BYTE004  $  y=x1*256+x2;
  $  120.液力变矩器离合器压力控制电磁阀控制压力                     $    $  kPa          $    $  ANS058.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  121.液力变矩器离合器参照滑膜                                   $    $               $    $  ANS059.BYTE004  $  y=(x1*256+x2)*0.125;
  $  122.液力变矩器离合器滑膜                                       $    $               $    $  ANS060.BYTE004  $  y=(x1*256+x2)*0.125;
  $  123.液力变矩器离合器滑膜故障                                   $    $               $    $  ANS061.BYTE004  $  y=(x1*256+x2)*0.125;
  $  124.液力变矩器离合器状态                                       $    $               $    $  ANS062.BYTE004  $  if((x&0x40)==0x40)y=@00bb;else y=@0136;
  $  125.液力变矩器离合器系统，齿轮及适应-变速器的传动齿轮          $    $               $    $  ANS063.BYTE004  $  if((x&0xE0)==0x20)y=@0058;else if((x&0xE0)==0x40)y=@0059;else if((x&0xE0)==0x60)y=@005a;else if((x&0xE0)==0x80)y=@005b;else if((x&0xE0)==0xA0)y=@005c;else if((x&0xE0)==0xC0)y=@005d;else y=@0004;
  $  126.液力变矩器离合器系统，齿轮及适应-变矩器离合器控制          $    $               $    $  ANS063.BYTE004  $  if((x&0x10)==0x10)y=@00bb;else y=@0136;
  $  127.液力变矩器离合器系统，齿轮及适应-复位调节                  $    $               $    $  ANS063.BYTE004  $  if((x&0x08)==0x08)y=@00bb;else y=@0136;
  $  128.传输比                                                     $    $               $    $  ANS064.BYTE004  $  y=(x1*256+x2)*0.000244241;
  $  129.变速器基本模式                                             $    $               $    $  ANS065.BYTE004  $  if(x==0x00)y=@0644;else if(x==0x01)y=@005f;else if(x==0x02)y=@0645;else if(x==0x03)y=@0061;else if(x==0x04)y=@0062;else if(x==0x05)y=@0063;else if(x==0x06)y=@0064;else if(x==0x07)y=@0065;else if(x==0x08)y=@0646;else if(x==0x09)y=@0647;else if(x==0x0A)y=@0648;else if(x==0x0B)y=@0649;else if(x==0x0C)y=@006a;else if(x==0x0D)y=@006b;else if(x==0x0E)y=@064a;else if(x==0x0F)y=@064b;else if(x==0x10)y=@064c;else y=@01a9;
  $  130.变速器内部离合器滑膜                                       $    $  kPa          $    $  ANS066.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.125;
  $  131.变速箱档位                                                 $    $               $    $  ANS067.BYTE004  $  if(x==0x01)y=@006f;else if(x==0x02)y=@0070;else if(x==0x03)y=@0299;else if(x==0x04)y=@029a;else if(x==0x05)y=@0073;else if(x==0x06)y=@0074;else y=@0004;
  $  132.变速器控制模块温度                                         $    $  degree C     $    $  ANS068.BYTE004  $  y=x-40;
  $  133.变速箱液压开关状态-开关1                                   $    $               $    $  ANS069.BYTE004  $  if((x&0x80)==0x80)y=@0076;else y=@0075;
  $  134.变速箱液压开关状态-开关2                                   $    $               $    $  ANS069.BYTE004  $  if((x&0x40)==0x40)y=@0076;else y=@0075;
  $  135.变速箱液压开关状态-开关3                                   $    $               $    $  ANS069.BYTE004  $  if((x&0x20)==0x20)y=@0076;else y=@0075;
  $  136.变速箱液压开关状态-开关4                                   $    $               $    $  ANS069.BYTE004  $  if((x&0x10)==0x10)y=@0076;else y=@0075;
  $  137.变速器满油压力                                             $    $  kPa          $    $  ANS070.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.125;
  $  138.变速器输入转速                                             $    $  rpm          $    $  ANS071.BYTE004  $  y=(x1*256+x2)*0.125;
  $  139.变速器温度                                                 $    $  degree C     $    $  ANS072.BYTE004  $  y=x-40;
  $  140.变速器输出转速                                             $    $  rpm          $    $  ANS073.BYTE004  $  y=(x1*256+x2)*0.125;
  $  141.变速器即将选择的离合器                                     $    $               $    $  ANS074.BYTE004  $  if(x==0x01)y=@063f;else if(x==0x02)y=@0640;else if(x==0x03)y=@0641;else if(x==0x04)y=@0642;else if(x==0x05)y=@0643;else if(x==0x06)y=@009c;else y=@01a9;
  $  142.变速器范围：档位位置PRNDL非法                              $    $               $    $  ANS075.BYTE004  $  if((x&0x80)==0x80)y=@00bb;else y=@0136;
  $  143.变速器范围：PRNDL(档位位置) P                              $    $               $    $  ANS075.BYTE004  $  if((x&0x40)==0x40)y=@00bb;else y=@0136;
  $  144.变速器范围：PRNDL(档位位置) C                              $    $               $    $  ANS075.BYTE004  $  if((x&0x20)==0x20)y=@00bb;else y=@0136;
  $  145.变速器范围：PRNDL(档位位置) B                              $    $               $    $  ANS075.BYTE004  $  if((x&0x10)==0x10)y=@00bb;else y=@0136;
  $  146.变速器范围：PRNDL(档位位置) A                              $    $               $    $  ANS075.BYTE004  $  if((x&0x08)==0x08)y=@00bb;else y=@0136;
  $  147.变速器范围：PSM压力开关歧管C                               $    $               $    $  ANS075.BYTE004  $  if((x&0x04)==0x04)y=@00bb;else y=@0136;
  $  148.变速器范围：PSM压力开关歧管B                               $    $               $    $  ANS075.BYTE004  $  if((x&0x02)==0x02)y=@00bb;else y=@0136;
  $  149.变速器范围：PSM压力开关歧管A                               $    $               $    $  ANS075.BYTE004  $  if((x&0x01)==0x01)y=@00bb;else y=@0136;
  $  150.变速器手动模式升档/降档 非正常切换状态                     $    $               $    $  ANS076.BYTE004  $  if((x&0x80)==0x80)y=@00bb;else y=@0136;
  $  151.变速器手动模式升档/降档 驱动换挡控制(DTC)模式状态          $    $               $    $  ANS076.BYTE004  $  if((x&0x40)==0x40)y=@00bb;else y=@0136;
  $  152.变速器手动模式升档/降档 电子选换挡操作状态                 $    $               $    $  ANS076.BYTE004  $  if((x&0x20)==0x20)y=@00bb;else y=@0136;
  $  153.变速器手动模式升档/降档 倒挡状态                           $    $               $    $  ANS076.BYTE004  $  if((x&0x10)==0x10)y=@00bb;else y=@0136;
  $  154.变速器手动模式升档/降档 手动加减档操作状态                 $    $               $    $  ANS076.BYTE004  $  if((x&0x08)==0x08)y=@00bb;else y=@0136;
  $  155.变速器手动模式升档/降档 档位递减状态                       $    $               $    $  ANS076.BYTE004  $  if((x&0x04)==0x04)y=@00bb;else y=@0136;
  $  156.变速器杆上升/下降状态 增加开关                             $    $               $    $  ANS076.BYTE004  $  if((x&0x02)==0x02)y=@00bb;else y=@0136;
  $  157.变速器手动模式升档/降档 加减档模式切换状态                 $    $               $    $  ANS076.BYTE004  $  if((x&0x01)==0x01)y=@00bb;else y=@0136;
  $  158.涡轮转速                                                   $    $  rpm          $    $  ANS077.BYTE004  $  y=(x1*256+x2)*0.125;
  $  159.车速                                                       $    $  km/h         $    $  ANS078.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
