
    车型ID：1014

    模拟：协议模拟-->1014

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/14000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 98 00 00 00 00       $%  ANS000:769 03 22 F1 98 00 00 00 00
  $%  REQ001:761 03 22 F1 A0 00 00 00 00       $%  ANS001:769 03 22 F1 A0 00 00 00 00
  $%  REQ002:761 03 22 F1 83 00 00 00 00       $%  ANS002:769 03 22 F1 83 00 00 00 00
  $%  REQ003:761 03 22 F1 A1 00 00 00 00       $%  ANS003:769 03 22 F1 A1 00 00 00 00
  $%  REQ004:761 03 22 F1 A9 00 00 00 00       $%  ANS004:769 03 22 F1 A9 00 00 00 00
  $%  REQ005:761 03 22 F1 91 00 00 00 00       $%  ANS005:769 03 22 F1 91 00 00 00 00
  $%  REQ006:761 03 22 F1 A5 00 00 00 00       $%  ANS006:769 03 22 F1 A5 00 00 00 00
  $%  REQ007:761 03 22 F1 A2 00 00 00 00       $%  ANS007:769 03 22 F1 A2 00 00 00 00
  $%  REQ008:761 03 22 F1 87 00 00 00 00       $%  ANS008:769 03 22 F1 87 00 00 00 00
  $%  REQ009:761 03 22 F1 AA 00 00 00 00       $%  ANS009:769 03 22 F1 AA 00 00 00 00
  $%  REQ010:761 03 22 F1 10 00 00 00 00       $%  ANS010:769 03 22 F1 10 00 00 00 00
  $%  REQ011:761 03 22 F1 00 00 00 00 00       $%  ANS011:769 03 22 F1 00 00 00 00 00
  $%  REQ012:761 03 22 F1 92 00 00 00 00       $%  ANS012:769 03 22 F1 92 00 00 00 00
  $%  REQ013:761 03 22 F1 8C 00 00 00 00       $%  ANS013:769 03 22 F1 8C 00 00 00 00
  $%  REQ014:761 03 22 F1 94 00 00 00 00       $%  ANS014:769 03 22 F1 94 00 00 00 00
  $%  REQ015:761 03 22 F1 8A 00 00 00 00       $%  ANS015:769 03 22 F1 8A 00 00 00 00
  $%  REQ016:761 03 22 F1 90 00 00 00 00       $%  ANS016:769 03 22 F1 90 00 00 00 00
  $%  REQ017:761 03 22 F1 A8 00 00 00 00       $%  ANS017:769 03 22 F1 A8 00 00 00 00
  $%  REQ018:761 03 22 F1 8B 00 00 00 00       $%  ANS018:769 03 22 F1 8B 00 00 00 00

  $%  000:配置跟踪区:                      $%    $%  ANS000.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11);
  $%  001:电控单元应用软件号:              $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  002:电控单元刷写软件参考号:          $%    $%  ANS002.BYTE011  $%  ASCII(X1,X2,X3);
  $%  003:电控单元标定软件号:              $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元配置文件号:              $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  005:电控单元硬件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元索引信息:                $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3);
  $%  007:电控单元网络文件参考号:          $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号:                  $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  009:电控单元编程流程文件号:          $%    $%  ANS009.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  010:电控单元零件号(上次):            $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  011:测试工具参考号(上次):            $%    $%  ANS010.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  012:里程读数(上次)KM:                $%    $%  ANS010.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  013:软件校验信息域:                  $%    $%  ANS011.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  014:供应商电控单元硬件参考号:        $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  015:供应商电控单元序列号:            $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  016:供应商电控单元软件参考号:        $%    $%  ANS014.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  017:系统供应商识别码:                $%    $%  ANS015.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  018:VIN码:                           $%    $%  ANS016.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  019:车辆特征信息:                    $%    $%  ANS017.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  020:电控单元制造日期:                $%    $%  ANS018.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 B0 02 00 00 00 00       $  ANS000:769 03 22 B0 02 00 00 00 00
  $  REQ001:761 03 22 B0 03 00 00 00 00       $  ANS001:769 03 22 B0 03 00 00 00 00
  $  REQ002:761 03 22 B0 05 00 00 00 00       $  ANS002:769 03 22 B0 05 00 00 00 00
  $  REQ003:761 03 22 B0 A0 00 00 00 00       $  ANS003:769 03 22 B0 A0 00 00 00 00
  $  REQ004:761 03 22 E0 04 00 00 00 00       $  ANS004:769 03 22 E0 04 00 00 00 00
  $  REQ005:761 03 22 B0 07 00 00 00 00       $  ANS005:769 03 22 B0 07 00 00 00 00
  $  REQ006:761 03 22 B0 08 00 00 00 00       $  ANS006:769 03 22 B0 08 00 00 00 00
  $  REQ007:761 03 22 E0 06 00 00 00 00       $  ANS007:769 03 22 E0 06 00 00 00 00
  $  REQ008:761 03 22 D1 01 00 00 00 00       $  ANS008:769 03 22 D1 01 00 00 00 00
  $  REQ009:761 03 22 B1 06 00 00 00 00       $  ANS009:769 03 22 B1 06 00 00 00 00
  $  REQ010:761 03 22 E0 05 00 00 00 00       $  ANS010:769 03 22 E0 05 00 00 00 00
  $  REQ011:761 03 22 B0 A1 00 00 00 00       $  ANS011:769 03 22 B0 A1 00 00 00 00
  $  REQ012:761 03 22 B0 09 00 00 00 00       $  ANS012:769 03 22 B0 09 00 00 00 00
  $  REQ013:761 03 22 B0 AA 00 00 00 00       $  ANS013:769 03 22 B0 AA 00 00 00 00
  $  REQ014:761 03 22 B0 A9 00 00 00 00       $  ANS014:769 03 22 B0 A9 00 00 00 00
  $  REQ015:761 03 22 B1 03 00 00 00 00       $  ANS015:769 03 22 B1 03 00 00 00 00
  $  REQ016:761 03 22 B1 05 00 00 00 00       $  ANS016:769 03 22 B1 05 00 00 00 00
  $  REQ017:761 03 22 B1 02 00 00 00 00       $  ANS017:769 03 22 B1 02 00 00 00 00
  $  REQ018:761 03 22 B0 A3 00 00 00 00       $  ANS018:769 03 22 B0 A3 00 00 00 00
  $  REQ019:761 03 22 B0 A4 00 00 00 00       $  ANS019:769 03 22 B0 A4 00 00 00 00
  $  REQ020:761 03 22 B0 A2 00 00 00 00       $  ANS020:769 03 22 B0 A2 00 00 00 00
  $  REQ021:761 03 22 E0 07 00 00 00 00       $  ANS021:769 03 22 E0 07 00 00 00 00
  $  REQ022:761 03 22 B1 08 00 00 00 00       $  ANS022:769 03 22 B1 08 00 00 00 00
  $  REQ023:761 03 22 E0 08 00 00 00 00       $  ANS023:769 03 22 E0 08 00 00 00 00
  $  REQ024:761 03 22 E0 02 00 00 00 00       $  ANS024:769 03 22 E0 02 00 00 00 00
  $  REQ025:761 03 22 B0 01 00 00 00 00       $  ANS025:769 03 22 B0 01 00 00 00 00
  $  REQ026:761 03 22 D0 08 00 00 00 00       $  ANS026:769 03 22 D0 08 00 00 00 00
  $  REQ027:761 03 22 E0 03 00 00 00 00       $  ANS027:769 03 22 E0 03 00 00 00 00
  $  REQ028:761 03 22 D0 01 00 00 00 00       $  ANS028:769 03 22 D0 01 00 00 00 00
  $  REQ029:761 03 22 D0 02 00 00 00 00       $  ANS029:769 03 22 D0 02 00 00 00 00
  $  REQ030:761 03 22 E0 09 00 00 00 00       $  ANS030:769 03 22 E0 09 00 00 00 00
  $  REQ031:761 03 22 B1 0D 00 00 00 00       $  ANS031:769 03 22 B1 0D 00 00 00 00
  $  REQ032:761 03 22 C0 01 00 00 00 00       $  ANS032:769 03 22 C0 01 00 00 00 00
  $  REQ033:761 03 22 C0 10 00 00 00 00       $  ANS033:769 03 22 C0 10 00 00 00 00
  $  REQ034:761 03 22 C0 11 00 00 00 00       $  ANS034:769 03 22 C0 11 00 00 00 00
  $  REQ035:761 03 22 C0 12 00 00 00 00       $  ANS035:769 03 22 C0 12 00 00 00 00
  $  REQ036:761 03 22 C0 13 00 00 00 00       $  ANS036:769 03 22 C0 13 00 00 00 00
  $  REQ037:761 03 22 C0 14 00 00 00 00       $  ANS037:769 03 22 C0 14 00 00 00 00
  $  REQ038:761 03 22 C0 02 00 00 00 00       $  ANS038:769 03 22 C0 02 00 00 00 00
  $  REQ039:761 03 22 C0 03 00 00 00 00       $  ANS039:769 03 22 C0 03 00 00 00 00
  $  REQ040:761 03 22 C0 04 00 00 00 00       $  ANS040:769 03 22 C0 04 00 00 00 00
  $  REQ041:761 03 22 C0 05 00 00 00 00       $  ANS041:769 03 22 C0 05 00 00 00 00
  $  REQ042:761 03 22 C0 06 00 00 00 00       $  ANS042:769 03 22 C0 06 00 00 00 00
  $  REQ043:761 03 22 C0 07 00 00 00 00       $  ANS043:769 03 22 C0 07 00 00 00 00
  $  REQ044:761 03 22 C0 08 00 00 00 00       $  ANS044:769 03 22 C0 08 00 00 00 00
  $  REQ045:761 03 22 C0 09 00 00 00 00       $  ANS045:769 03 22 C0 09 00 00 00 00
  $  REQ046:761 03 22 C0 0A 00 00 00 00       $  ANS046:769 03 22 C0 0A 00 00 00 00
  $  REQ047:761 03 22 C0 0B 00 00 00 00       $  ANS047:769 03 22 C0 0B 00 00 00 00
  $  REQ048:761 03 22 C0 0C 00 00 00 00       $  ANS048:769 03 22 C0 0C 00 00 00 00
  $  REQ049:761 03 22 C0 0D 00 00 00 00       $  ANS049:769 03 22 C0 0D 00 00 00 00
  $  REQ050:761 03 22 C0 0E 00 00 00 00       $  ANS050:769 03 22 C0 0E 00 00 00 00
  $  REQ051:761 03 22 C0 0F 00 00 00 00       $  ANS051:769 03 22 C0 0F 00 00 00 00

  $  000.系统电源模式                                   $    $               $    $  ANS000.BYTE004  $  if((x&0xC0)==0x00)y=@000f;else if((x&0xC0)==0x40)y=@089b;else if((x&0xC0)==0x80)y=@009d;else y=@05d2;
  $  001.系统电源模式有效性                             $    $               $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  002.倒挡状态                                       $    $               $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@0388;else y=@0669;
  $  003.前舱开关状态                                   $    $               $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  004.前舱开关状态有效性                             $    $               $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  005.遥控汽车起动状态                               $    $               $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@00b2;else y=@0136;
  $  006.DDD疲劳提醒开关状态反馈                        $    $               $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  007.左转向灯                                       $    $               $    $  ANS000.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  008.右转向灯                                       $    $               $    $  ANS000.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  009.位置灯状态                                     $    $               $    $  ANS000.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  010.近光灯状态                                     $    $               $    $  ANS000.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  011.远光灯状态                                     $    $               $    $  ANS000.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  012.前雾灯状态                                     $    $               $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  013.后雾灯状态                                     $    $               $    $  ANS000.BYTE006  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  014.自动灯光控制                                   $    $               $    $  ANS000.BYTE006  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  015.背光灯状态                                     $    $               $    $  ANS000.BYTE006  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  016.日间行车灯状态                                 $    $               $    $  ANS000.BYTE006  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  017.背光亮度有效性                                 $    $               $    $  ANS000.BYTE006  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  018.方向指示开关状态                               $    $               $    $  ANS000.BYTE006  $  if((x&0x06)==0x00)y=@000f;else if((x&0x06)==0x02)y=@08d3;else if((x&0x06)==0x04)y=@08d4;else y=@0035;
  $  019.驾驶员门开关状态                               $    $               $    $  ANS000.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  020.驾驶员侧车门锁定状态                           $    $               $    $  ANS000.BYTE007  $  if((x&0xC0)==0x00)y=@0404;else if((x&0xC0)==0x40)y=@0055;else if((x&0xC0)==0x80)y=@0004;else y=@0136;
  $  021.乘客车门锁定状态                               $    $               $    $  ANS000.BYTE007  $  if((x&0x30)==0x00)y=@0404;else if((x&0x30)==0x10)y=@0055;else if((x&0x30)==0x20)y=@0004;else y=@0136;
  $  022.前排乘务员门开关状态                           $    $               $    $  ANS000.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  023.右后侧门开关状态                               $    $               $    $  ANS000.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  024.左后侧门开关状态                               $    $               $    $  ANS000.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  025.尾门开关状态                                   $    $  %            $    $  ANS000.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  026.背光亮度                                       $    $               $    $  ANS000.BYTE008  $  y=x*0.3921;
  $  027.BCM中VIN码(字节0)                              $    $               $    $  ANS001.BYTE004  $  HEX(X1);
  $  028.BCM中VIN码(字节1)                              $    $               $    $  ANS001.BYTE005  $  HEX(X1);
  $  029.BCM中VIN码(字节2)                              $    $               $    $  ANS001.BYTE006  $  HEX(X1);
  $  030.BCM中VIN码(字节3)                              $    $               $    $  ANS001.BYTE007  $  HEX(X1);
  $  031.BCM中VIN码(字节4)                              $    $               $    $  ANS001.BYTE008  $  HEX(X1);
  $  032.BCM中VIN码(字节5)                              $    $               $    $  ANS001.BYTE009  $  HEX(X1);
  $  033.BCM中VIN码(字节6)                              $    $               $    $  ANS001.BYTE010  $  HEX(X1);
  $  034.BCM中VIN码(字节7)                              $    $               $    $  ANS001.BYTE011  $  HEX(X1);
  $  035.左后轮胎压力                                   $    $  kPa          $    $  ANS002.BYTE004  $  y=x*2.75;
  $  036.左前轮胎压力                                   $    $  kPa          $    $  ANS002.BYTE005  $  y=x*2.75;
  $  037.右后轮胎压力                                   $    $  kPa          $    $  ANS002.BYTE006  $  y=x*2.75;
  $  038.右前轮胎压力                                   $    $  kPa          $    $  ANS002.BYTE007  $  y=x*2.75;
  $  039.轮胎温度                                       $    $  degree C     $    $  ANS002.BYTE008  $  y=x-60;
  $  040.左前轮胎压力报警状态                           $    $               $    $  ANS002.BYTE009  $  if((x&0xE0)==0x00)y=@05c2;else if((x&0xE0)==0x20)y=@05c4;else if((x&0xE0)==0x40)y=@05c5;else if((x&0xE0)==0x60)y=@05c6;else if((x&0xE0)==0x80)y=@05c7;else if((x&0xE0)==0xA0)y=@05c8;else if((x&0xE0)==0xC0)y=@05c9;else y=@05ca;
  $  041.右前轮胎压力报警状态                           $    $               $    $  ANS002.BYTE009  $  if((x&0x1C)==0x00)y=@05c2;else if((x&0x1C)==0x04)y=@05c4;else if((x&0x1C)==0x08)y=@05c5;else if((x&0x1C)==0x0C)y=@05c6;else if((x&0x1C)==0x10)y=@05c7;else if((x&0x1C)==0x14)y=@05c8;else if((x&0x1C)==0x18)y=@05c9;else y=@05ca;
  $  042.右后轮胎压力报警状态                           $    $               $    $  ANS002.BYTE009  $  if((x&0x03)==0x00)y=@05c3;else if((x&0x03)==0x01)y=@00d3;else if((x&0x03)==0x02)y=@00d4;else y=@0004;
  $  043.系统状态                                       $    $               $    $  ANS002.BYTE010  $  if((x&0xE0)==0x00)y=@05c2;else if((x&0xE0)==0x20)y=@05c4;else if((x&0xE0)==0x40)y=@05c5;else if((x&0xE0)==0x60)y=@05c6;else if((x&0xE0)==0x80)y=@05c7;else if((x&0xE0)==0xA0)y=@05c8;else if((x&0xE0)==0xC0)y=@05c9;else y=@05ca;
  $  044.左后轮胎压力报警状态                           $    $               $    $  ANS002.BYTE010  $  if((x&0x1C)==0x00)y=@05c2;else if((x&0x1C)==0x04)y=@05c4;else if((x&0x1C)==0x08)y=@05c5;else if((x&0x1C)==0x0C)y=@05c6;else if((x&0x1C)==0x10)y=@05c7;else if((x&0x1C)==0x14)y=@05c8;else if((x&0x1C)==0x18)y=@05c9;else y=@05ca;
  $  045.温度报警                                       $    $               $    $  ANS002.BYTE010  $  if((x&0x02)==0x02)y=@06db;else y=@06dc;
  $  046.信号状态                                       $    $               $    $  ANS002.BYTE010  $  if((x&0x01)==0x01)y=@08a4;else y=@0701;
  $  047.轮胎位置                                       $    $               $    $  ANS002.BYTE011  $  if((x&0xE0)==0x00)y=@06fa;else if((x&0xE0)==0x20)y=@06fb;else if((x&0xE0)==0x40)y=@06fc;else if((x&0xE0)==0x60)y=@06fd;else if((x&0xE0)==0x80)y=@06fe;else y=@0035;
  $  048.胎压灯状态                                     $    $               $    $  ANS002.BYTE011  $  if((x&0x08)==0x08)y=@06ff;else y=@046a;
  $  049.HVAC采暖通风和空调系统模式                     $    $               $    $  ANS003.BYTE004  $  if((x&0xF0)==0x00)y=@012b;else if((x&0xF0)==0x10)y=@08d5;else if((x&0xF0)==0x20)y=@08d6;else if((x&0xF0)==0x30)y=@0898;else if((x&0xF0)==0x40)y=@0899;else if((x&0xF0)==0x50)y=@089a;else if((x&0xF0)==0x60)y=@08d7;else if((x&0xF0)==0xF0)y=@0136;else y=@01a9;
  $  050.HVAC采暖通风和空调系统循环模式                 $    $               $    $  ANS003.BYTE004  $  if((x&0x0C)==0x00)y=@0895;else if((x&0x0C)==0x04)y=@0896;else if((x&0x0C)==0x08)y=@08d8;else y=@0136;
  $  051.HVAC采暖通风和空调系统状态                     $    $               $    $  ANS003.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  052.HVAC采暖通风和空调系统状态有效性               $    $               $    $  ANS003.BYTE004  $  if((x&0x01)==0x01)y=@0136;else y=@00bb;
  $  053.HVAC采暖通风和空调系统前除霜状态               $    $               $    $  ANS003.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  054.HVAC采暖通风和空调系统前除霜状态有效性         $    $               $    $  ANS003.BYTE005  $  if((x&0x40)==0x40)y=@0136;else y=@00bb;
  $  055.HVAC采暖通风和空调系统后除霜状态               $    $               $    $  ANS003.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  056.HVAC采暖通风和空调系统后除霜状态有效性         $    $               $    $  ANS003.BYTE005  $  if((x&0x10)==0x10)y=@0136;else y=@00bb;
  $  057.HVAC采暖通风和空调系统自动模式指示灯状态       $    $               $    $  ANS003.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  058.HVAC采暖通风和空调系统自动显示状态有效性       $    $               $    $  ANS003.BYTE005  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  059.HVAC采暖通风和空调系统空气净化指示灯状态       $    $               $    $  ANS003.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  060.HVAC采暖通风和空调系统空气净化状态有效性       $    $               $    $  ANS003.BYTE005  $  if((x&0x01)==0x01)y=@0136;else y=@00bb;
  $  061.HVAC采暖通风和空调系统环境温度掩码             $    $               $    $  ANS003.BYTE006  $  if((x&0x80)==0x80)y=@060e;else y=@060f;
  $  062.HVAC采暖通风和空调系统电源状态                 $    $               $    $  ANS003.BYTE006  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  063.HVAC风量                                       $    $               $    $  ANS003.BYTE006  $  if((x&0x3C)==0x00)y=@04d4;else if((x&0x3C)==0x04)y=@04d3;else if((x&0x3C)==0x08)y=@0169;else if((x&0x3C)==0x0C)y=@016a;else if((x&0x3C)==0x10)y=@016b;else if((x&0x3C)==0x14)y=@054a;else if((x&0x3C)==0x18)y=@054b;else if((x&0x3C)==0x1C)y=@054c;else if((x&0x3C)==0x20)y=@054d;else if((x&0x3C)==0x24)y=@08d9;else y=@01a9;
  $  064.平衡值                                         $    $               $    $  ANS004.BYTE004  $  y=(x&0x7F)-(x&0x80);
  $  065.车速                                           $    $  km/h         $    $  ANS005.BYTE004  $  y=(x1*256+x2)*1.8/256;
  $  066.车速状态                                       $    $               $    $  ANS005.BYTE005  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  067.来自转向角的方向盘角度                         $    $  rad          $    $  ANS006.BYTE004  $  y=(x1*256+x2)*0.1;
  $  068.方向盘转速                                     $    $  rad/s        $    $  ANS006.BYTE006  $  y=x*4;
  $  069.SAS校准状态                                    $    $               $    $  ANS006.BYTE007  $  if((x&0x80)==0x80)y=@06f4;else y=@06f5;
  $  070.加速器X                                        $    $  m/s^2        $    $  ANS006.BYTE007  $  y=(x&0x7F)*0.867201-21.430401;
  $  071.加速度有效性                                   $    $               $    $  ANS006.BYTE008  $  if(x==0x00)y=@00bb;else if(x==0x01)y=@0136;else y=@01a9;
  $  072.当前音效                                       $    $               $    $  ANS007.BYTE004  $  if(x==0x00)y=@064f;else if(x==0x01)y=@0650;else if(x==0x02)y=@0651;else if(x==0x03)y=@0652;else if(x==0x04)y=@0653;else if(x==0x04)y=@0654;else y=@01a9;
  $  073.控制LCD背光使能线                              $    $               $    $  ANS008.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  074.控制外部放大器静音线                           $    $               $    $  ANS008.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  075.控制ACC线                                      $    $               $    $  ANS008.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  076.通用输出(复位)                                 $    $               $    $  ANS008.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  077.前屏唤醒                                       $    $               $    $  ANS008.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  078.预留信号线                                     $    $               $    $  ANS008.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  079.打开/关闭蓝牙                                  $    $               $    $  ANS008.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  080.打开/关闭WIFI                                  $    $               $    $  ANS008.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  081.当前电瓶电压                                   $    $  V            $    $  ANS009.BYTE004  $  y=x*0.1;
  $  082.当前MIC电压                                    $    $  V            $    $  ANS009.BYTE005  $  y=x*0.1;
  $  083.当前调谐器天线电压                             $    $  V            $    $  ANS009.BYTE006  $  y=x*0.1;
  $  084.当前左转向轮控制器电压                         $    $  V            $    $  ANS009.BYTE007  $  y=x*0.1;
  $  085.当前右转向轮控制器电压                         $    $  V            $    $  ANS009.BYTE008  $  y=x*0.1;
  $  086.渐变值                                         $    $               $    $  ANS010.BYTE004  $  y=(x&0x7F)-(x&0x80);
  $  087.当前车内温度                                   $    $  degree C     $    $  ANS011.BYTE004  $  y=x*0.5-30;
  $  088.空调自动显示命令                               $    $               $    $  ANS011.BYTE005  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  089.空调双显示的命令                               $    $               $    $  ANS011.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  090.左前座椅加热状态                               $    $               $    $  ANS011.BYTE005  $  if((x&0x30)==0x00)y=@000f;else if((x&0x30)==0x10)y=@06c7;else if((x&0x30)==0x20)y=@06c9;else y=@06cb;
  $  091.右前座椅加热级别                               $    $               $    $  ANS011.BYTE005  $  if((x&0x0C)==0x00)y=@000f;else if((x&0x0C)==0x04)y=@06c7;else if((x&0x0C)==0x08)y=@06c9;else y=@06cb;
  $  092.HVAC采暖通风和空调系统在请求时指示器状态       $    $               $    $  ANS011.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  093.HVAC设定温度                                   $    $  degree C     $    $  ANS012.BYTE004  $  y=x-40;
  $  094.HVAC采暖通风和空调系统环境温度                 $    $  degree C     $    $  ANS012.BYTE005  $  y=x-40;
  $  095.蒸发箱温度                                     $    $  degree C     $    $  ANS012.BYTE006  $  y=x-40;
  $  096.P档变速杆位置                                  $    $               $    $  ANS013.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  097.LDW车道偏离预警系统准确性反馈                  $    $               $    $  ANS014.BYTE004  $  if((x&0xC0)==0x00)y=@0238;else if((x&0xC0)==0x40)y=@06c7;else if((x&0xC0)==0x80)y=@08ce;else y=@06cb;
  $  098.BSD盲点检测系统开关状态                        $    $               $    $  ANS014.BYTE004  $  if((x&0x30)==0x00)y=@0238;else if((x&0x30)==0x10)y=@08cf;else if((x&0x30)==0x20)y=@08d0;else y=@01a9;
  $  099.LSM状态                                        $    $               $    $  ANS014.BYTE004  $  if((x&0x08)==0x08)y=@08d1;else y=@08d2;
  $  100.IFP硬件号                                      $    $               $    $  ANS015.BYTE004  $  y=UINT40(x1,x2,x3,x4,x5);
  $  101.IFP NCF号                                      $    $               $    $  ANS016.BYTE004  $  y=UINT40(x1,x2,x3,x4,x5);
  $  102.IPF 零件号                                     $    $               $    $  ANS017.BYTE004  $  y=UINT40(x1,x2,x3,x4,x5);
  $  103.仪表显示ABS警告                                $    $               $    $  ANS018.BYTE004  $  if((x&0x80)==0x80)y=@0135;else y=@05c2;
  $  104.仪表显示EBD警告                                $    $               $    $  ANS018.BYTE004  $  if((x&0x40)==0x40)y=@0135;else y=@05c2;
  $  105.仪表显示ESP警告                                $    $               $    $  ANS018.BYTE004  $  if((x&0x20)==0x20)y=@0135;else y=@05c2;
  $  106.仪表显示制动系统警告                           $    $               $    $  ANS018.BYTE004  $  if((x&0x10)==0x10)y=@0135;else y=@05c2;
  $  107.仪表显示SRS警告                                $    $               $    $  ANS018.BYTE004  $  if((x&0x08)==0x08)y=@0135;else y=@05c2;
  $  108.仪表显示MIL(发动机故障灯)警告                  $    $               $    $  ANS018.BYTE004  $  if((x&0x04)==0x04)y=@0135;else y=@05c2;
  $  109.仪表显示TCCU警告                               $    $               $    $  ANS018.BYTE004  $  if((x&0x02)==0x02)y=@0135;else y=@05c2;
  $  110.仪表显示燃油警告                               $    $               $    $  ANS018.BYTE004  $  if((x&0x01)==0x01)y=@0135;else y=@05c2;
  $  111.仪表显示EMS警告                                $    $               $    $  ANS018.BYTE005  $  if((x&0x80)==0x80)y=@0135;else y=@05c2;
  $  112.仪表显示发电机警告                             $    $               $    $  ANS018.BYTE005  $  if((x&0x40)==0x40)y=@0135;else y=@05c2;
  $  113.仪表显示油压低警告                             $    $               $    $  ANS018.BYTE005  $  if((x&0x20)==0x20)y=@0135;else y=@05c2;
  $  114.仪表显示前大灯系统警告                         $    $               $    $  ANS018.BYTE005  $  if((x&0x10)==0x10)y=@0135;else y=@05c2;
  $  115.仪表显示冷却液温度警告                         $    $               $    $  ANS018.BYTE005  $  if((x&0x08)==0x08)y=@0135;else y=@05c2;
  $  116.仪表显示钥匙电池电量低警告                     $    $               $    $  ANS018.BYTE005  $  if((x&0x04)==0x04)y=@0135;else y=@05c2;
  $  117.仪表显示TPMS警告                               $    $               $    $  ANS018.BYTE005  $  if((x&0x02)==0x02)y=@0135;else y=@05c2;
  $  118.仪表总里程                                     $    $  km           $    $  ANS019.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  119.仪表保养间隔里程数                             $    $  km           $    $  ANS019.BYTE007  $  y=x1*256*256+x2*256+x3;
  $  120.仪表显示平均油耗                               $    $  L/km         $    $  ANS019.BYTE010  $  y=x*0.1;
  $  121.仪表显示瞬时油耗                               $    $               $    $  ANS019.BYTE011  $  y=x*0.1;
  $  122.仪表显示剩余驾驶距离                           $    $  km           $    $  ANS019.BYTE012  $  y=(x1*256+x2)/16.0;
  $  123.仪表上瞬时油耗有效性                           $    $               $    $  ANS019.BYTE013  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  124.仪表上平均油耗有效性                           $    $               $    $  ANS019.BYTE013  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  125.仪表显示的车速                                 $    $  km/h         $    $  ANS020.BYTE005  $  y=x;
  $  126.仪表语言反馈                                   $    $               $    $  ANS020.BYTE006  $  if((x&0xFE)==0x00)y=@074a;else if((x&0xFE)==0x02)y=@074b;else if((x&0xFE)==0x04)y=@074c;else if((x&0xFE)==0x06)y=@08b5;else if((x&0xFE)==0x08)y=@08b6;else if((x&0xFE)==0x0A)y=@08b7;else if((x&0xFE)==0x0C)y=@08b8;else if((x&0xFE)==0x0E)y=@08b9;else if((x&0xFE)==0x10)y=@08ba;else if((x&0xFE)==0x12)y=@08bb;else if((x&0xFE)==0x14)y=@08bc;else if((x&0xFE)==0x16)y=@08bd;else if((x&0xFE)==0x18)y=@08be;else if((x&0xFE)==0x1A)y=@08bf;else if((x&0xFE)==0x1C)y=@08c0;else if((x&0xFE)==0x1E)y=@08c1;else if((x&0xFE)==0x20)y=@08c2;else if((x&0xFE)==0x22)y=@08c3;else if((x&0xFE)==0x24)y=@08c4;else if((x&0xFE)==0x26)y=@08c5;else if((x&0xFE)==0x28)y=@08c6;else if((x&0xFE)==0x2A)y=@08c7;else if((x&0xFE)==0x2C)y=@08c8;else if((x&0xFE)==0x2E)y=@08c9;else if((x&0xFE)==0x30)y=@08ca;else y=@01a9;
  $  127.仪表上驾驶员侧安全带警告                       $    $               $    $  ANS020.BYTE006  $  if((x&0x01)==0x01)y=@0135;else y=@05c2;
  $  128.系统备用电源模式状态                           $    $               $    $  ANS020.BYTE007  $  if((x&0xC0)==0x00)y=@000f;else if((x&0xC0)==0x40)y=@089b;else if((x&0xC0)==0x80)y=@009d;else y=@05d2;
  $  129.系统备用电源模式已启用                         $    $               $    $  ANS020.BYTE007  $  if((x&0x20)==0x20)y=@00dc;else y=@000f;
  $  130.系统备份电源模式有效性                         $    $               $    $  ANS020.BYTE007  $  if((x&0x10)==0x10)y=@0136;else y=@00bb;
  $  131.仪表显示的信息掩码                             $    $               $    $  ANS020.BYTE007  $  if((x&0x08)==0x08)y=@060e;else y=@060f;
  $  132.LCD亮度                                        $    $               $    $  ANS021.BYTE004  $  y=x;
  $  133.IPF故障码号0                                   $    $               $    $  ANS022.BYTE004  $  HEX(X1);
  $  134.IPF故障码号1                                   $    $               $    $  ANS022.BYTE005  $  HEX(X1);
  $  135.IPF故障码号2                                   $    $               $    $  ANS022.BYTE006  $  HEX(X1);
  $  136.IPF故障码号3                                   $    $               $    $  ANS022.BYTE007  $  HEX(X1);
  $  137.响度补偿开关                                   $    $               $    $  ANS023.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@016d;else y=@000f;
  $  138.NVAI导航系统音量                               $    $               $    $  ANS024.BYTE004  $  y=x;
  $  139.发动机运行激活                                 $    $               $    $  ANS025.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  140.巡航控制激活                                   $    $               $    $  ANS025.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  141.加速器有效位置有效性                           $    $               $    $  ANS025.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  142.绝对大气压力的有效性                           $    $               $    $  ANS025.BYTE004  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  143.燃油液位百分比有效性                           $    $               $    $  ANS025.BYTE004  $  if((x&0x06)==0x00)y=@04dc;else if((x&0x06)==0x02)y=@089c;else if((x&0x06)==0x04)y=@089d;else y=@04dc;
  $  144.发动机转速                                     $    $  rpm          $    $  ANS025.BYTE005  $  y=(x1*256+x2)*0.25;
  $  145.燃油消耗                                       $    $  mL           $    $  ANS025.BYTE007  $  y=x1*256+x2;
  $  146.巡航控制驾驶员设置的速度                       $    $  km/h         $    $  ANS025.BYTE009  $  y=x;
  $  147.冷却风扇级别反馈                               $    $               $    $  ANS025.BYTE010  $  if((x&0x0F)==0x00)y=@0659;else if((x&0x0F)==0x01)y=@04f8;else if((x&0x0F)==0x02)y=@04f7;else if((x&0x0F)==0x03)y=@04f6;else if((x&0x0F)==0x04)y=@04f5;else if((x&0x0F)==0x05)y=@04f4;else if((x&0x0F)==0x06)y=@065a;else if((x&0x0F)==0x07)y=@065b;else if((x&0x0F)==0x08)y=@065c;else if((x&0x0F)==0x09)y=@065d;else if((x&0x0F)==0x0A)y=@065e;else if((x&0x0F)==0x0B)y=@065f;else if((x&0x0F)==0x0C)y=@0660;else if((x&0x0F)==0x0D)y=@0661;else if((x&0x0F)==0x0E)y=@0662;else y=@0663;
  $  148.油门踏板位置有效性                             $    $  %            $    $  ANS025.BYTE011  $  y=x*0.3921;
  $  149.加速器有效位置                                 $    $  %            $    $  ANS025.BYTE012  $  y=x*0.3921;
  $  150.大气压力绝对值                                 $    $  kPa          $    $  ANS025.BYTE013  $  y=x*0.5;
  $  151.燃油液位                                       $    $  %            $    $  ANS025.BYTE014  $  y=x*0.3921;
  $  152.变速箱换挡杆                                   $    $               $    $  ANS026.BYTE004  $  if((x&0xF0)==0x00)y=@0514;else if((x&0xF0)==0x10)y=@00b4;else if((x&0xF0)==0x20)y=@0388;else if((x&0xF0)==0x30)y=@0515;else if((x&0xF0)==0x40)y=@0516;else if((x&0xF0)==0x50)y=@0517;else if((x&0xF0)==0x60)y=@0518;else if((x&0xF0)==0x70)y=@0519;else if((x&0xF0)==0x80)y=@051a;else if((x&0xF0)==0x90)y=@051b;else if((x&0xF0)==0xA0)y=@051c;else if((x&0xF0)==0xB0)y=@051d;else if((x&0xF0)==0xF0)y=@051e;else y=@01a9;
  $  153.变速箱换挡杆位置有效性                         $    $               $    $  ANS026.BYTE004  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  154.手机音量                                       $    $               $    $  ANS027.BYTE004  $  y=x;
  $  155.全局KL.50状态                                  $    $               $    $  ANS028.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  156.全局发动机运行状态                             $    $               $    $  ANS028.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  157.全局KL.15状态                                  $    $               $    $  ANS028.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  158.全局KL.R状态                                   $    $               $    $  ANS028.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  159.系统KL.50状态                                  $    $               $    $  ANS028.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  160.系统发动机运行状态                             $    $               $    $  ANS028.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  161.系统KL.15状态                                  $    $               $    $  ANS028.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  162.系统KL.R状态                                   $    $               $    $  ANS028.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  163.方向盘控制_音量升                              $    $               $    $  ANS029.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  164.方向盘控制_音量降                              $    $               $    $  ANS029.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  165.方向盘控制向上搜索                             $    $               $    $  ANS029.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  166.方向盘控制向下搜索                             $    $               $    $  ANS029.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  167.方向盘控制_静音                                $    $               $    $  ANS029.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  168.方向盘控制_呼叫拒绝                            $    $               $    $  ANS029.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  169.方向盘控制源                                   $    $               $    $  ANS029.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  170.方向盘控制_呼叫中心                            $    $               $    $  ANS029.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  171.方向盘控制_语音控制                            $    $               $    $  ANS029.BYTE006  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  172.MUSIC/CAMERA按键                               $    $               $    $  ANS029.BYTE007  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  173.CAR按键                                        $    $               $    $  ANS029.BYTE007  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  174.HOME按键                                       $    $               $    $  ANS029.BYTE007  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  175.音量+按键                                      $    $               $    $  ANS029.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  176.音量-按键                                      $    $               $    $  ANS029.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  177.音速补偿级别控制                               $    $               $    $  ANS030.BYTE004  $  if(x==0x00)y=@06c7;else if(x==0x01)y=@06c8;else if(x==0x02)y=@06c9;else if(x==0x03)y=@06ca;else if(x==0x04)y=@06cb;else y=@01a9;
  $  178.供应商IFP硬件号                                $    $               $    $  ANS031.BYTE006  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  179.车身颜色类型配置                               $    $               $    $  ANS032.BYTE004  $  if(x==0x00)y=@08f1;else if(x==0x01)y=@06e3;else if(x==0x02)y=@06e4;else if(x==0x03)y=@06e5;else if(x==0x04)y=@06e6;else if(x==0x05)y=@06e7;else if(x==0x06)y=@06e8;else if(x==0x07)y=@06e9;else if(x==0x08)y=@08f2;else if(x==0x09)y=@06eb;else if(x==0x0A)y=@06ec;else if(x==0x0B)y=@06ed;else y=@01a9;
  $  180.空调类型配置                                   $    $               $    $  ANS032.BYTE005  $  if(x==0x00)y=@08f3;else if(x==0x01)y=@08f4;else if(x==0x02)y=@08f5;else if(x==0x03)y=@08f6;else if(x==0x04)y=@08f7;else y=@01a9;
  $  181.座椅加热类型配置                               $    $               $    $  ANS032.BYTE006  $  if(x==0x00)y=@08f8;else if(x==0x01)y=@08f9;else if(x==0x02)y=@08fa;else y=@01a9;
  $  182.胎压监测系统类型配置                           $    $               $    $  ANS032.BYTE007  $  if(x==0x00)y=@06f1;else if(x==0x01)y=@06f2;else if(x==0x02)y=@06f3;else y=@01a9;
  $  183.LDW车道偏离预警系统敏感度配置                  $    $               $    $  ANS033.BYTE006  $  if(x==0x00)y=@06c7;else if(x==0x01)y=@08ce;else if(x==0x02)y=@06cb;else y=@01a9;
  $  184.BSD盲点检测系统配置                            $    $               $    $  ANS034.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  185.DDD疲劳提醒警报配置                            $    $               $    $  ANS034.BYTE005  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  186.亮灯时间                                       $    $               $    $  ANS035.BYTE004  $  if((x&0x30)==0x00)y=@0491;else if((x&0x30)==0x10)y=@0492;else if((x&0x30)==0x20)y=@0493;else y=@01a9;
  $  187.FMH伴我回家照明灯(寻车灯)开关配置              $    $               $    $  ANS035.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  188.寻车反馈配置                                   $    $               $    $  ANS035.BYTE005  $  if(x==0x00)y=@0506;else if(x==0x01)y=@08ee;else y=@01a9;
  $  189.无钥匙解锁配置                                 $    $               $    $  ANS035.BYTE006  $  if((x&0x20)==0x20)y=@08a0;else y=@08a1;
  $  190.钥匙解锁配置                                   $    $               $    $  ANS035.BYTE006  $  if((x&0x10)==0x10)y=@08a0;else y=@08a1;
  $  191.上锁反馈配置                                   $    $               $    $  ANS035.BYTE006  $  if((x&0x0C)==0x00)y=@01a9;else if((x&0x0C)==0x04)y=@0505;else if((x&0x0C)==0x08)y=@0506;else y=@0504;
  $  192.熄火自动解锁                                   $    $               $    $  ANS035.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  193.行车自动锁定                                   $    $               $    $  ANS035.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  194.方向盘自定义配置                               $    $               $    $  ANS036.BYTE004  $  if(x==0x00)y=@08ef;else if(x==0x01)y=@08f0;else y=@01a9;
  $  195.语言配置                                       $    $               $    $  ANS037.BYTE004  $  if(x==0x00)y=@074a;else if(x==0x01)y=@0901;else if(x==0x02)y=@08bf;else if(x==0x03)y=@08ca;else if(x==0x04)y=@08b7;else y=@01a9;
  $  196.LDW车道偏离预警系统配置                        $    $               $    $  ANS038.BYTE004  $  if(x==0x00)y=@0902;else if(x==0x01)y=@0903;else y=@01a9;
  $  197.自动紧急制动配置                               $    $               $    $  ANS038.BYTE005  $  if(x==0x00)y=@0904;else if(x==0x01)y=@0692;else y=@01a9;
  $  198.360度视野类型配置                              $    $               $    $  ANS038.BYTE006  $  if(x==0x00)y=@0721;else if(x==0x01)y=@0722;else if(x==0x02)y=@0692;else y=@01a9;
  $  199.车载显示器类型配置                             $    $               $    $  ANS038.BYTE007  $  if(x==0x00)y=@0723;else if(x==0x01)y=@0724;else if(x==0x02)y=@0725;else if(x==0x03)y=@0726;else y=@01a9;
  $  200.后排乘客区电动玻璃                             $    $               $    $  ANS039.BYTE004  $  if((x&0x80)==0x80)y=@0445;else y=@0112;
  $  201.后排乘客区电动玻璃一键自动下                   $    $               $    $  ANS039.BYTE004  $  if((x&0x40)==0x40)y=@0445;else y=@0112;
  $  202.副驾驶员电动玻璃                               $    $               $    $  ANS039.BYTE004  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  203.副驾驶员电动玻璃一键自动下                     $    $               $    $  ANS039.BYTE004  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  204.副驾驶员电动玻璃一键自动上下(带防夹)           $    $               $    $  ANS039.BYTE004  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  205.驾驶员电动玻璃                                 $    $               $    $  ANS039.BYTE004  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  206.驾驶员电动玻璃一键自动下                       $    $               $    $  ANS039.BYTE004  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  207.驾驶员电动玻璃一键自动上下(带防夹)             $    $               $    $  ANS039.BYTE004  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  208.远程信息处理系统类型配置                       $    $               $    $  ANS039.BYTE005  $  if(x==0x00)y=@08fb;else if(x==0x01)y=@08fc;else if(x==0x02)y=@08fd;else if(x==0x03)y=@08fe;else if(x==0x04)y=@08ff;else if(x==0x05)y=@0900;else y=@01a9;
  $  209.汽车导航配置                                   $    $               $    $  ANS039.BYTE006  $  if(x==0x00)y=@05aa;else if(x==0x01)y=@0739;else y=@01a9;
  $  210.免提配置                                       $    $               $    $  ANS039.BYTE007  $  if(x==0x00)y=@073a;else if(x==0x01)y=@073b;else y=@01a9;
  $  211.车载信息娱乐显示级别类型配置                   $    $               $    $  ANS040.BYTE004  $  if(x==0x00)y=@073c;else if(x==0x01)y=@08dd;else if(x==0x02)y=@08de;else if(x==0x03)y=@08df;else if(x==0x04)y=@073e;else if(x==0x05)y=@073f;else if(x==0x06)y=@08e0;else if(x==0x07)y=@08e1;else y=@01a9;
  $  212.DAB数字音频广播配置                            $    $               $    $  ANS040.BYTE005  $  if(x==0x00)y=@0740;else if(x==0x01)y=@0692;else y=@01a9;
  $  213.停车辅助系统类型配置                           $    $               $    $  ANS040.BYTE006  $  if(x==0x00)y=@0702;else if(x==0x01)y=@0703;else if(x==0x02)y=@0704;else if(x==0x03)y=@0705;else if(x==0x04)y=@0706;else if(x==0x05)y=@0707;else y=@01a9;
  $  214.右后下摄像头类型配置                           $    $               $    $  ANS040.BYTE007  $  if(x==0x00)y=@08e2;else if(x==0x01)y=@08e3;else if(x==0x02)y=@070a;else if(x==0x03)y=@070b;else if(x==0x04)y=@0710;else y=@01a9;
  $  215.方向盘带音量调节配置                           $    $               $    $  ANS041.BYTE004  $  if(x==0x00)y=@08e4;else if(x==0x01)y=@0712;else y=@01a9;
  $  216.汽车音频类型配置                               $    $               $    $  ANS041.BYTE005  $  if(x==0x00)y=@0714;else if(x==0x01)y=@0715;else if(x==0x02)y=@0716;else if(x==0x03)y=@0717;else y=@01a9;
  $  217.AUX端口配置                                    $    $               $    $  ANS041.BYTE006  $  if(x==0x00)y=@0718;else if(x==0x01)y=@0719;else y=@01a9;
  $  218.视频输入功能配置                               $    $               $    $  ANS041.BYTE007  $  if(x==0x00)y=@071a;else if(x==0x01)y=@071b;else y=@01a9;
  $  219.USB端口类型配置                                $    $               $    $  ANS042.BYTE004  $  if(x==0x00)y=@071c;else if(x==0x01)y=@071d;else if(x==0x02)y=@071e;else y=@01a9;
  $  220.收音机频率配置                                 $    $               $    $  ANS042.BYTE005  $  if(x1==0x01)y=@0696;else if(x1==0x02)y=@0697;else if(x2==0x01)y=@0699;else y=@01a9;
  $  221.扬声器类型配置                                 $    $               $    $  ANS042.BYTE007  $  if(x==0x00)y=@069d;else if(x==0x01)y=@069e;else if(x==0x02)y=@069f;else if(x==0x03)y=@06a0;else if(x==0x04)y=@06a1;else y=@01a9;
  $  222.IPOD配置                                       $    $               $    $  ANS043.BYTE004  $  if(x==0x00)y=@06a2;else if(x==0x01)y=@0692;else y=@01a9;
  $  223.汽车车型年份配置                               $    $               $    $  ANS043.BYTE005  $  if(x==0x00)y=@06a3;else if(x==0x01)y=@06a4;else if(x==0x02)y=@06a5;else if(x==0x03)y=@06a6;else if(x==0x04)y=@06a7;else if(x==0x05)y=@06a8;else if(x==0x06)y=@06a9;else if(x==0x07)y=@06aa;else if(x==0x08)y=@06ab;else y=@01a9;
  $  224.车型系列配置                                   $    $               $    $  ANS043.BYTE006  $  if(x==0x00)y=@058f;else if(x==0x01)y=@08da;else if(x==0x02)y=@0590;else if(x==0x03)y=@08db;else if(x==0x04)y=@0591;else if(x==0x05)y=@08dc;else y=@01a9;
  $  225.车身类型配置                                   $    $               $    $  ANS043.BYTE007  $  if(x==0x00)y=@06ac;else if(x==0x01)y=@06ad;else if(x==0x02)y=@06ae;else if(x==0x03)y=@06af;else if(x==0x04)y=@06b0;else if(x==0x05)y=@06b1;else if(x==0x06)y=@06b2;else if(x==0x07)y=@06b3;else if(x==0x08)y=@00f3;else if(x==0x09)y=@06b4;else if(x==0x0A)y=@06b5;else y=@01a9;
  $  226.汽车品牌配置                                   $    $               $    $  ANS044.BYTE004  $  if(x==0x00)y=@066a;else if(x==0x01)y=@066b;else if(x==0x02)y=@066c;else y=@01a9;
  $  227.汽车国家码配置                                 $    $               $    $  ANS044.BYTE005  $  if(x==0x00)y=@00d8;else if(x==0x01)y=@066d;else if(x==0x02)y=@066e;else if(x==0x03)y=@066f;else if(x==0x04)y=@0670;else if(x==0x05)y=@0671;else if(x==0x06)y=@0672;else if(x==0x07)y=@0673;else if(x==0x08)y=@0674;else if(x==0x09)y=@0675;else if(x==0x0A)y=@0676;else if(x==0x0B)y=@0677;else if(x==0x0C)y=@0678;else if(x==0x0D)y=@0679;else if(x==0x0E)y=@067a;else if(x==0x0F)y=@067b;else if(x==0x10)y=@067c;else y=@01a9;
  $  228.汽车驾驶方向类型配置                           $    $               $    $  ANS044.BYTE006  $  if(x==0x00)y=@067d;else if(x==0x01)y=@067e;else y=@01a9;
  $  229.汽车发动机类型配置                             $    $               $    $  ANS044.BYTE007  $  if(x==0x00)y=@067f;else if(x==0x01)y=@0680;else if(x==0x02)y=@0681;else if(x==0x03)y=@0682;else y=@01a9;
  $  230.变速箱类型配置                                 $    $               $    $  ANS045.BYTE004  $  if(x==0x00)y=@0687;else if(x==0x01)y=@0688;else if(x==0x02)y=@0689;else if(x==0x03)y=@068a;else if(x==0x04)y=@068b;else y=@01a9;
  $  231.汽车尾门操作类型配置                           $    $               $    $  ANS045.BYTE005  $  if(x==0x00)y=@0166;else if(x==0x01)y=@0167;else if(x==0x02)y=@0690;else y=@01a9;
  $  232.盲点信息系统配置                               $    $               $    $  ANS045.BYTE006  $  if(x==0x00)y=@08eb;else if(x==0x01)y=@0692;else y=@01a9;
  $  233.行人警告系统配置                               $    $               $    $  ANS045.BYTE007  $  if(x==0x00)y=@08ec;else if(x==0x01)y=@0692;else y=@01a9;
  $  234.车速报警系统配置                               $    $               $    $  ANS046.BYTE004  $  if(x==0x00)y=@08ed;else if(x==0x01)y=@0692;else y=@01a9;
  $  235.自动紧急呼叫配置                               $    $               $    $  ANS046.BYTE005  $  if(x==0x00)y=@043b;else if(x==0x01)y=@0692;else y=@01a9;
  $  236.汽车天窗类型配置                               $    $               $    $  ANS046.BYTE006  $  if(x==0x00)y=@0693;else if(x==0x01)y=@0694;else if(x==0x02)y=@0695;else y=@01a9;
  $  237.混合动力类型配置                               $    $               $    $  ANS046.BYTE007  $  if(x==0x00)y=@06cc;else if(x==0x01)y=@06cd;else if(x==0x02)y=@06ce;else if(x==0x03)y=@06cf;else y=@01a9;
  $  238.ECO主动经济驾驶模式配置                        $    $               $    $  ANS047.BYTE004  $  if(x==0x00)y=@00b2;else if(x==0x01)y=@00b1;else y=@01a9;
  $  239.FCW正面碰撞警告配置                            $    $               $    $  ANS047.BYTE005  $  if(x==0x00)y=@08e5;else if(x==0x01)y=@08e6;else y=@01a9;
  $  240.MIC麦克风类型配置                              $    $               $    $  ANS047.BYTE006  $  if(x==0x00)y=@06d0;else if(x==0x01)y=@06d1;else if(x==0x02)y=@06d2;else y=@01a9;
  $  241.光传感器配置                                   $    $               $    $  ANS047.BYTE007  $  if(x==0x00)y=@06d3;else if(x==0x01)y=@06d4;else y=@01a9;
  $  242.车载空气净化系统类型配置                       $    $               $    $  ANS048.BYTE004  $  if(x==0x00)y=@08e7;else if(x==0x01)y=@08e8;else if(x==0x02)y=@08e9;else if(x==0x03)y=@08ea;else y=@01a9;
  $  243.车型配置                                       $    $               $    $  ANS048.BYTE005  $  if(x==0x7F)y=@06d5;else if(x==0x80)y=@058e;else y=@01a9;
  $  244.变量配置                                       $    $               $    $  ANS048.BYTE006  $  if(x==0x98)y=@06d6;else if(x==0x99)y=@06d7;else y=@01a9;
  $  245.GPS芯片配置                                    $    $               $    $  ANS048.BYTE007  $  if(x==0x00)y=@06d8;else if(x==0x01)y=@06d9;else y=@01a9;
  $  246.语音识别配置                                   $    $               $    $  ANS049.BYTE004  $  if(x==0x00)y=@05b0;else if(x==0x01)y=@06da;else y=@01a9;
  $  247.ESP/ABS节点配置                                $    $               $    $  ANS049.BYTE005  $  if(x==0x00)y=@06b6;else if(x==0x01)y=@06b7;else if(x==0x02)y=@06b8;else y=@01a9;
  $  248.SAS配置                                        $    $               $    $  ANS049.BYTE006  $  if(x==0x00)y=@06b9;else if(x==0x01)y=@06ba;else y=@01a9;
  $  249.PEPS配置                                       $    $               $    $  ANS049.BYTE007  $  if(x==0x00)y=@06bb;else if(x==0x01)y=@003d;else y=@01a9;
  $  250.WIFI配置                                       $    $               $    $  ANS050.BYTE004  $  if(x==0x00)y=@06bc;else if(x==0x01)y=@06bd;else y=@01a9;
  $  251.轴距配置                                       $    $               $    $  ANS050.BYTE005  $  if(x==0x00)y=@06be;else if(x==0x01)y=@06bf;else y=@01a9;
  $  252.底盘高度配置                                   $    $               $    $  ANS050.BYTE006  $  if(x==0x00)y=@06c0;else if(x==0x01)y=@06c1;else y=@01a9;
  $  253.车速限制功能配置                               $    $               $    $  ANS050.BYTE007  $  if(x==0x00)y=@0905;else if(x==0x01)y=@0906;else if(x==0x02)y=@0907;else y=@01a9;
  $  254.门类型配置                                     $    $               $    $  ANS051.BYTE004  $  if(x==0x00)y=@06c2;else if(x==0x01)y=@06c3;else y=@01a9;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
