
    车型ID：101f

    模拟：协议模拟-->101f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 03 19 02 08 00 00 00 00       $#  ANS000:7E8 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/1f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 83 00 00 00 00       $%  ANS000:7E8 03 22 F1 83 00 00 00 00
  $%  REQ001:7E0 03 22 F1 A0 00 00 00 00       $%  ANS001:7E8 03 22 F1 A0 00 00 00 00
  $%  REQ002:7E0 03 22 F1 A1 00 00 00 00       $%  ANS002:7E8 03 22 F1 A1 00 00 00 00
  $%  REQ003:7E0 03 22 F1 91 00 00 00 00       $%  ANS003:7E8 03 22 F1 91 00 00 00 00
  $%  REQ004:7E0 03 22 F1 8B 00 00 00 00       $%  ANS004:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E0 03 22 F1 A2 00 00 00 00       $%  ANS005:7E8 03 22 F1 A2 00 00 00 00
  $%  REQ006:7E0 03 22 F1 10 00 00 00 00       $%  ANS006:7E8 03 22 F1 10 00 00 00 00
  $%  REQ007:7E0 03 22 F1 99 00 00 00 00       $%  ANS007:7E8 03 22 F1 99 00 00 00 00
  $%  REQ008:7E0 03 22 F1 98 00 00 00 00       $%  ANS008:7E8 03 22 F1 98 00 00 00 00
  $%  REQ009:7E0 03 22 F1 92 00 00 00 00       $%  ANS009:7E8 03 22 F1 92 00 00 00 00
  $%  REQ010:7E0 03 22 F1 8C 00 00 00 00       $%  ANS010:7E8 03 22 F1 8C 00 00 00 00
  $%  REQ011:7E0 03 22 F1 94 00 00 00 00       $%  ANS011:7E8 03 22 F1 94 00 00 00 00
  $%  REQ012:7E0 03 22 F1 8A 00 00 00 00       $%  ANS012:7E8 03 22 F1 8A 00 00 00 00
  $%  REQ013:7E0 03 22 F1 90 00 00 00 00       $%  ANS013:7E8 03 22 F1 90 00 00 00 00
  $%  REQ014:7E0 03 22 F1 A8 00 00 00 00       $%  ANS014:7E8 03 22 F1 A8 00 00 00 00
  $%  REQ015:7E0 03 22 F1 87 00 00 00 00       $%  ANS015:7E8 03 22 F1 87 00 00 00 00

  $%  000:启动软件参考号:                      $%    $%  ANS000.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  001:电控单元应用软件号:                  $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  002:电控单元标定软件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                      $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元制造日期:                    $%    $%  ANS004.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  005:电控单元网络文件参考号:              $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):                $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):                $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                    $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:程序重新刷写日期:                    $%    $%  ANS007.BYTE004  $%  HEX(X);
  $%  010:维修站代码或测试设备序列号:          $%    $%  ANS008.BYTE004  $%  ASCII(X);
  $%  011:供应商电控单元硬件参考号:            $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:客户代码:                            $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2);
  $%  013:位置代码:                            $%    $%  ANS010.BYTE010  $%  ASCII(X);
  $%  014:制造代码:                            $%    $%  ANS010.BYTE011  $%  ASCII(X);
  $%  015:年:                                  $%    $%  ANS010.BYTE012  $%  ASCII(X);
  $%  016:日:                                  $%    $%  ANS010.BYTE013  $%  ASCII(X1,X2,X3);
  $%  017:序列号:                              $%    $%  ANS010.BYTE016  $%  ASCII(X1,X2,X3);
  $%  018:序列号2:                             $%    $%  ANS010.BYTE018  $%  ASCII(X1,X2,X3,X4);
  $%  019:供应商电控单元软件参考号:            $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  020:系统供应商识别码:                    $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  021:VIN码:                               $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  022:车辆特征信息:                        $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  023:车辆制造商零部件数量数据识别:        $%    $%  ANS015.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E0 03 22 14 69 00 00 00 00       $  ANS000:7E8 03 22 14 69 00 00 00 00
  $  REQ001:7E0 03 22 11 44 00 00 00 00       $  ANS001:7E8 03 22 11 44 00 00 00 00
  $  REQ002:7E0 03 22 13 3A 00 00 00 00       $  ANS002:7E8 03 22 13 3A 00 00 00 00
  $  REQ003:7E0 03 22 00 43 00 00 00 00       $  ANS003:7E8 03 22 00 43 00 00 00 00
  $  REQ004:7E0 03 22 00 47 00 00 00 00       $  ANS004:7E8 03 22 00 47 00 00 00 00
  $  REQ005:7E0 03 22 00 49 00 00 00 00       $  ANS005:7E8 03 22 00 49 00 00 00 00
  $  REQ006:7E0 03 22 00 4A 00 00 00 00       $  ANS006:7E8 03 22 00 4A 00 00 00 00
  $  REQ007:7E0 03 22 11 9E 00 00 00 00       $  ANS007:7E8 03 22 11 9E 00 00 00 00
  $  REQ008:7E0 03 22 11 9D 00 00 00 00       $  ANS008:7E8 03 22 11 9D 00 00 00 00
  $  REQ009:7E0 03 22 00 33 00 00 00 00       $  ANS009:7E8 03 22 00 33 00 00 00 00
  $  REQ010:7E0 03 22 11 AC 00 00 00 00       $  ANS010:7E8 03 22 11 AC 00 00 00 00
  $  REQ011:7E0 03 22 11 A3 00 00 00 00       $  ANS011:7E8 03 22 11 A3 00 00 00 00
  $  REQ012:7E0 03 22 11 5E 00 00 00 00       $  ANS012:7E8 03 22 11 5E 00 00 00 00
  $  REQ013:7E0 03 22 00 3C 00 00 00 00       $  ANS013:7E8 03 22 00 3C 00 00 00 00
  $  REQ014:7E0 03 22 00 01 00 00 00 00       $  ANS014:7E8 03 22 00 01 00 00 00 00
  $  REQ015:7E0 03 22 00 13 00 00 00 00       $  ANS015:7E8 03 22 00 13 00 00 00 00
  $  REQ016:7E0 03 22 00 14 00 00 00 00       $  ANS016:7E8 03 22 00 14 00 00 00 00
  $  REQ017:7E0 03 22 00 15 00 00 00 00       $  ANS017:7E8 03 22 00 15 00 00 00 00
  $  REQ018:7E0 03 22 11 00 00 00 00 00       $  ANS018:7E8 03 22 11 00 00 00 00 00
  $  REQ019:7E0 03 22 11 01 00 00 00 00       $  ANS019:7E8 03 22 11 01 00 00 00 00
  $  REQ020:7E0 03 22 11 02 00 00 00 00       $  ANS020:7E8 03 22 11 02 00 00 00 00
  $  REQ021:7E0 03 22 11 03 00 00 00 00       $  ANS021:7E8 03 22 11 03 00 00 00 00
  $  REQ022:7E0 03 22 11 04 00 00 00 00       $  ANS022:7E8 03 22 11 04 00 00 00 00
  $  REQ023:7E0 03 22 11 7C 00 00 00 00       $  ANS023:7E8 03 22 11 7C 00 00 00 00
  $  REQ024:7E0 03 22 12 F0 00 00 00 00       $  ANS024:7E8 03 22 12 F0 00 00 00 00
  $  REQ025:7E0 03 22 13 9E 00 00 00 00       $  ANS025:7E8 03 22 13 9E 00 00 00 00
  $  REQ026:7E0 03 22 13 AA 00 00 00 00       $  ANS026:7E8 03 22 13 AA 00 00 00 00
  $  REQ027:7E0 03 22 13 AE 00 00 00 00       $  ANS027:7E8 03 22 13 AE 00 00 00 00
  $  REQ028:7E0 03 22 13 C0 00 00 00 00       $  ANS028:7E8 03 22 13 C0 00 00 00 00
  $  REQ029:7E0 03 22 13 C1 00 00 00 00       $  ANS029:7E8 03 22 13 C1 00 00 00 00
  $  REQ030:7E0 03 22 14 77 00 00 00 00       $  ANS030:7E8 03 22 14 77 00 00 00 00
  $  REQ031:7E0 03 22 15 04 00 00 00 00       $  ANS031:7E8 03 22 15 04 00 00 00 00
  $  REQ032:7E0 03 22 15 51 00 00 00 00       $  ANS032:7E8 03 22 15 51 00 00 00 00
  $  REQ033:7E0 03 22 00 44 00 00 00 00       $  ANS033:7E8 03 22 00 44 00 00 00 00
  $  REQ034:7E0 03 22 00 2E 00 00 00 00       $  ANS034:7E8 03 22 00 2E 00 00 00 00
  $  REQ035:7E0 03 22 00 4C 00 00 00 00       $  ANS035:7E8 03 22 00 4C 00 00 00 00
  $  REQ036:7E0 03 22 00 42 00 00 00 00       $  ANS036:7E8 03 22 00 42 00 00 00 00
  $  REQ037:7E0 03 22 11 6F 00 00 00 00       $  ANS037:7E8 03 22 11 6F 00 00 00 00
  $  REQ038:7E0 03 22 01 0A 00 00 00 00       $  ANS038:7E8 03 22 01 0A 00 00 00 00
  $  REQ039:7E0 03 22 01 0B 00 00 00 00       $  ANS039:7E8 03 22 01 0B 00 00 00 00
  $  REQ040:7E0 03 22 15 42 00 00 00 00       $  ANS040:7E8 03 22 15 42 00 00 00 00
  $  REQ041:7E0 03 22 15 43 00 00 00 00       $  ANS041:7E8 03 22 15 43 00 00 00 00
  $  REQ042:7E0 03 22 15 44 00 00 00 00       $  ANS042:7E8 03 22 15 44 00 00 00 00
  $  REQ043:7E0 03 22 15 45 00 00 00 00       $  ANS043:7E8 03 22 15 45 00 00 00 00
  $  REQ044:7E0 03 22 15 46 00 00 00 00       $  ANS044:7E8 03 22 15 46 00 00 00 00
  $  REQ045:7E0 03 22 15 47 00 00 00 00       $  ANS045:7E8 03 22 15 47 00 00 00 00
  $  REQ046:7E0 03 22 13 AB 00 00 00 00       $  ANS046:7E8 03 22 13 AB 00 00 00 00
  $  REQ047:7E0 03 22 15 3D 00 00 00 00       $  ANS047:7E8 03 22 15 3D 00 00 00 00
  $  REQ048:7E0 03 22 15 41 00 00 00 00       $  ANS048:7E8 03 22 15 41 00 00 00 00
  $  REQ049:7E0 03 22 00 04 00 00 00 00       $  ANS049:7E8 03 22 00 04 00 00 00 00
  $  REQ050:7E0 03 22 00 0E 00 00 00 00       $  ANS050:7E8 03 22 00 0E 00 00 00 00
  $  REQ051:7E0 03 22 00 03 00 00 00 00       $  ANS051:7E8 03 22 00 03 00 00 00 00
  $  REQ052:7E0 03 22 00 07 00 00 00 00       $  ANS052:7E8 03 22 00 07 00 00 00 00
  $  REQ053:7E0 03 22 00 06 00 00 00 00       $  ANS053:7E8 03 22 00 06 00 00 00 00
  $  REQ054:7E0 03 22 00 11 00 00 00 00       $  ANS054:7E8 03 22 00 11 00 00 00 00
  $  REQ055:7E0 03 22 00 05 00 00 00 00       $  ANS055:7E8 03 22 00 05 00 00 00 00
  $  REQ056:7E0 03 22 00 0C 00 00 00 00       $  ANS056:7E8 03 22 00 0C 00 00 00 00
  $  REQ057:7E0 03 22 00 0F 00 00 00 00       $  ANS057:7E8 03 22 00 0F 00 00 00 00
  $  REQ058:7E0 03 22 00 0B 00 00 00 00       $  ANS058:7E8 03 22 00 0B 00 00 00 00
  $  REQ059:7E0 03 22 00 0D 00 00 00 00       $  ANS059:7E8 03 22 00 0D 00 00 00 00
  $  REQ060:7E0 03 22 11 E4 00 00 00 00       $  ANS060:7E8 03 22 11 E4 00 00 00 00
  $  REQ061:7E0 03 22 11 93 00 00 00 00       $  ANS061:7E8 03 22 11 93 00 00 00 00
  $  REQ062:7E0 03 22 11 92 00 00 00 00       $  ANS062:7E8 03 22 11 92 00 00 00 00
  $  REQ063:7E0 03 22 11 9B 00 00 00 00       $  ANS063:7E8 03 22 11 9B 00 00 00 00
  $  REQ064:7E0 03 22 00 31 00 00 00 00       $  ANS064:7E8 03 22 00 31 00 00 00 00
  $  REQ065:7E0 03 22 11 70 00 00 00 00       $  ANS065:7E8 03 22 11 70 00 00 00 00
  $  REQ066:7E0 03 22 11 BB 00 00 00 00       $  ANS066:7E8 03 22 11 BB 00 00 00 00
  $  REQ067:7E0 03 22 13 46 00 00 00 00       $  ANS067:7E8 03 22 13 46 00 00 00 00
  $  REQ068:7E0 03 22 13 45 00 00 00 00       $  ANS068:7E8 03 22 13 45 00 00 00 00
  $  REQ069:7E0 03 22 11 71 00 00 00 00       $  ANS069:7E8 03 22 11 71 00 00 00 00
  $  REQ070:7E0 03 22 13 44 00 00 00 00       $  ANS070:7E8 03 22 13 44 00 00 00 00
  $  REQ071:7E0 03 22 11 C0 00 00 00 00       $  ANS071:7E8 03 22 11 C0 00 00 00 00
  $  REQ072:7E0 03 22 11 BE 00 00 00 00       $  ANS072:7E8 03 22 11 BE 00 00 00 00
  $  REQ073:7E0 03 22 11 BD 00 00 00 00       $  ANS073:7E8 03 22 11 BD 00 00 00 00
  $  REQ074:7E0 03 22 12 B0 00 00 00 00       $  ANS074:7E8 03 22 12 B0 00 00 00 00
  $  REQ075:7E0 03 22 13 EE 00 00 00 00       $  ANS075:7E8 03 22 13 EE 00 00 00 00
  $  REQ076:7E0 03 22 12 B1 00 00 00 00       $  ANS076:7E8 03 22 12 B1 00 00 00 00
  $  REQ077:7E0 03 22 12 B4 00 00 00 00       $  ANS077:7E8 03 22 12 B4 00 00 00 00
  $  REQ078:7E0 03 22 12 B5 00 00 00 00       $  ANS078:7E8 03 22 12 B5 00 00 00 00
  $  REQ079:7E0 03 22 12 B7 00 00 00 00       $  ANS079:7E8 03 22 12 B7 00 00 00 00
  $  REQ080:7E0 03 22 12 B8 00 00 00 00       $  ANS080:7E8 03 22 12 B8 00 00 00 00
  $  REQ081:7E0 03 22 15 22 00 00 00 00       $  ANS081:7E8 03 22 15 22 00 00 00 00
  $  REQ082:7E0 03 22 12 1E 00 00 00 00       $  ANS082:7E8 03 22 12 1E 00 00 00 00
  $  REQ083:7E0 03 22 12 A1 00 00 00 00       $  ANS083:7E8 03 22 12 A1 00 00 00 00
  $  REQ084:7E0 03 22 14 74 00 00 00 00       $  ANS084:7E8 03 22 14 74 00 00 00 00
  $  REQ085:7E0 03 22 14 72 00 00 00 00       $  ANS085:7E8 03 22 14 72 00 00 00 00
  $  REQ086:7E0 03 22 12 39 00 00 00 00       $  ANS086:7E8 03 22 12 39 00 00 00 00
  $  REQ087:7E0 03 22 12 37 00 00 00 00       $  ANS087:7E8 03 22 12 37 00 00 00 00
  $  REQ088:7E0 03 22 12 38 00 00 00 00       $  ANS088:7E8 03 22 12 38 00 00 00 00
  $  REQ089:7E0 03 22 12 35 00 00 00 00       $  ANS089:7E8 03 22 12 35 00 00 00 00
  $  REQ090:7E0 03 22 00 2F 00 00 00 00       $  ANS090:7E8 03 22 00 2F 00 00 00 00
  $  REQ091:7E0 03 22 12 C5 00 00 00 00       $  ANS091:7E8 03 22 12 C5 00 00 00 00
  $  REQ092:7E0 03 22 11 55 00 00 00 00       $  ANS092:7E8 03 22 11 55 00 00 00 00
  $  REQ093:7E0 03 22 11 4E 00 00 00 00       $  ANS093:7E8 03 22 11 4E 00 00 00 00
  $  REQ094:7E0 03 22 11 90 00 00 00 00       $  ANS094:7E8 03 22 11 90 00 00 00 00
  $  REQ095:7E0 03 22 12 ED 00 00 00 00       $  ANS095:7E8 03 22 12 ED 00 00 00 00
  $  REQ096:7E0 03 22 14 4B 00 00 00 00       $  ANS096:7E8 03 22 14 4B 00 00 00 00
  $  REQ097:7E0 03 22 14 4C 00 00 00 00       $  ANS097:7E8 03 22 14 4C 00 00 00 00
  $  REQ098:7E0 03 22 15 05 00 00 00 00       $  ANS098:7E8 03 22 15 05 00 00 00 00
  $  REQ099:7E0 03 22 15 06 00 00 00 00       $  ANS099:7E8 03 22 15 06 00 00 00 00
  $  REQ100:7E0 03 22 15 0B 00 00 00 00       $  ANS100:7E8 03 22 15 0B 00 00 00 00
  $  REQ101:7E0 03 22 15 09 00 00 00 00       $  ANS101:7E8 03 22 15 09 00 00 00 00
  $  REQ102:7E0 03 22 12 92 00 00 00 00       $  ANS102:7E8 03 22 12 92 00 00 00 00
  $  REQ103:7E0 03 22 11 41 00 00 00 00       $  ANS103:7E8 03 22 11 41 00 00 00 00
  $  REQ104:7E0 03 22 14 73 00 00 00 00       $  ANS104:7E8 03 22 14 73 00 00 00 00
  $  REQ105:7E0 03 22 14 71 00 00 00 00       $  ANS105:7E8 03 22 14 71 00 00 00 00
  $  REQ106:7E0 03 22 14 75 00 00 00 00       $  ANS106:7E8 03 22 14 75 00 00 00 00
  $  REQ107:7E0 03 22 11 A0 00 00 00 00       $  ANS107:7E8 03 22 11 A0 00 00 00 00
  $  REQ108:7E0 03 22 11 A6 00 00 00 00       $  ANS108:7E8 03 22 11 A6 00 00 00 00
  $  REQ109:7E0 03 22 12 36 00 00 00 00       $  ANS109:7E8 03 22 12 36 00 00 00 00
  $  REQ110:7E0 03 22 11 4B 00 00 00 00       $  ANS110:7E8 03 22 11 4B 00 00 00 00
  $  REQ111:7E0 03 22 11 52 00 00 00 00       $  ANS111:7E8 03 22 11 52 00 00 00 00
  $  REQ112:7E0 03 22 12 E5 00 00 00 00       $  ANS112:7E8 03 22 12 E5 00 00 00 00
  $  REQ113:7E0 03 22 A0 FF 00 00 00 00       $  ANS113:7E8 03 22 A0 FF 00 00 00 00
  $  REQ114:7E0 03 22 00 21 00 00 00 00       $  ANS114:7E8 03 22 00 21 00 00 00 00
  $  REQ115:7E0 03 22 15 01 00 00 00 00       $  ANS115:7E8 03 22 15 01 00 00 00 00
  $  REQ116:7E0 03 22 12 06 00 00 00 00       $  ANS116:7E8 03 22 12 06 00 00 00 00
  $  REQ117:7E0 03 22 12 05 00 00 00 00       $  ANS117:7E8 03 22 12 05 00 00 00 00
  $  REQ118:7E0 03 22 12 07 00 00 00 00       $  ANS118:7E8 03 22 12 07 00 00 00 00
  $  REQ119:7E0 03 22 12 08 00 00 00 00       $  ANS119:7E8 03 22 12 08 00 00 00 00
  $  REQ120:7E0 03 22 11 E8 00 00 00 00       $  ANS120:7E8 03 22 11 E8 00 00 00 00
  $  REQ121:7E0 03 22 12 27 00 00 00 00       $  ANS121:7E8 03 22 12 27 00 00 00 00
  $  REQ122:7E0 03 22 12 01 00 00 00 00       $  ANS122:7E8 03 22 12 01 00 00 00 00
  $  REQ123:7E0 03 22 12 02 00 00 00 00       $  ANS123:7E8 03 22 12 02 00 00 00 00
  $  REQ124:7E0 03 22 12 03 00 00 00 00       $  ANS124:7E8 03 22 12 03 00 00 00 00
  $  REQ125:7E0 03 22 12 04 00 00 00 00       $  ANS125:7E8 03 22 12 04 00 00 00 00
  $  REQ126:7E0 03 22 12 28 00 00 00 00       $  ANS126:7E8 03 22 12 28 00 00 00 00
  $  REQ127:7E0 03 22 00 30 00 00 00 00       $  ANS127:7E8 03 22 00 30 00 00 00 00
  $  REQ128:7E0 03 22 16 78 00 00 00 00       $  ANS128:7E8 03 22 16 78 00 00 00 00
  $  REQ129:7E0 03 22 11 D7 00 00 00 00       $  ANS129:7E8 03 22 11 D7 00 00 00 00
  $  REQ130:7E0 03 22 12 D4 00 00 00 00       $  ANS130:7E8 03 22 12 D4 00 00 00 00
  $  REQ131:7E0 03 22 12 1A 00 00 00 00       $  ANS131:7E8 03 22 12 1A 00 00 00 00
  $  REQ132:7E0 03 22 12 12 00 00 00 00       $  ANS132:7E8 03 22 12 12 00 00 00 00
  $  REQ133:7E0 03 22 12 3F 00 00 00 00       $  ANS133:7E8 03 22 12 3F 00 00 00 00
  $  REQ134:7E0 03 22 12 41 00 00 00 00       $  ANS134:7E8 03 22 12 41 00 00 00 00
  $  REQ135:7E0 03 22 16 79 00 00 00 00       $  ANS135:7E8 03 22 16 79 00 00 00 00
  $  REQ136:7E0 03 22 11 45 00 00 00 00       $  ANS136:7E8 03 22 11 45 00 00 00 00
  $  REQ137:7E0 03 22 11 46 00 00 00 00       $  ANS137:7E8 03 22 11 46 00 00 00 00
  $  REQ138:7E0 03 22 16 03 00 00 00 00       $  ANS138:7E8 03 22 16 03 00 00 00 00
  $  REQ139:7E0 03 22 00 1C 00 00 00 00       $  ANS139:7E8 03 22 00 1C 00 00 00 00
  $  REQ140:7E0 03 22 14 81 00 00 00 00       $  ANS140:7E8 03 22 14 81 00 00 00 00
  $  REQ141:7E0 03 22 14 82 00 00 00 00       $  ANS141:7E8 03 22 14 82 00 00 00 00
  $  REQ142:7E0 03 22 00 45 00 00 00 00       $  ANS142:7E8 03 22 00 45 00 00 00 00
  $  REQ143:7E0 03 22 11 E6 00 00 00 00       $  ANS143:7E8 03 22 11 E6 00 00 00 00
  $  REQ144:7E0 03 22 12 E2 00 00 00 00       $  ANS144:7E8 03 22 12 E2 00 00 00 00
  $  REQ145:7E0 03 22 12 EF 00 00 00 00       $  ANS145:7E8 03 22 12 EF 00 00 00 00
  $  REQ146:7E0 03 22 13 3C 00 00 00 00       $  ANS146:7E8 03 22 13 3C 00 00 00 00
  $  REQ147:7E0 03 22 13 3D 00 00 00 00       $  ANS147:7E8 03 22 13 3D 00 00 00 00
  $  REQ148:7E0 03 22 13 3E 00 00 00 00       $  ANS148:7E8 03 22 13 3E 00 00 00 00
  $  REQ149:7E0 03 22 13 3F 00 00 00 00       $  ANS149:7E8 03 22 13 3F 00 00 00 00
  $  REQ150:7E0 03 22 00 1F 00 00 00 00       $  ANS150:7E8 03 22 00 1F 00 00 00 00
  $  REQ151:7E0 03 22 00 4D 00 00 00 00       $  ANS151:7E8 03 22 00 4D 00 00 00 00
  $  REQ152:7E0 03 22 12 00 00 00 00 00       $  ANS152:7E8 03 22 12 00 00 00 00 00
  $  REQ153:7E0 03 22 12 A7 00 00 00 00       $  ANS153:7E8 03 22 12 A7 00 00 00 00
  $  REQ154:7E0 03 22 11 64 00 00 00 00       $  ANS154:7E8 03 22 11 64 00 00 00 00
  $  REQ155:7E0 03 22 16 16 00 00 00 00       $  ANS155:7E8 03 22 16 16 00 00 00 00

  $  000.空调压力                                                     $    $  kPa          $    $  ANS000.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.125-4096;
  $  001.空调压力A/D                                                  $    $  V            $    $  ANS001.BYTE004  $  y=x*5/255.0;
  $  002.ABS不平路面                                                  $    $               $    $  ANS002.BYTE004  $  if(x==0xFF)y=@0769;else if(x==0xFE)y=@076a;else y=@076b;
  $  003.绝对负载值                                                   $    $  %            $    $  ANS003.BYTE004  $  y=(x1*256+x2)*100/255.0;
  $  004.绝对节气门位置B                                              $    $  %            $    $  ANS004.BYTE004  $  y=x*100/255.0;
  $  005.加速踏板位置D                                                $    $  %            $    $  ANS005.BYTE004  $  y=x*100/255.0;
  $  006.加速踏板位置E                                                $    $  %            $    $  ANS006.BYTE004  $  y=x*100/255.0;
  $  007.燃油占空比                                                   $    $  rad          $    $  ANS007.BYTE004  $  y=x*0.1;
  $  008.大气压力                                                     $    $  kPa          $    $  ANS008.BYTE004  $  y=x*0.36900367+10.332104;
  $  009.大气压力                                                     $    $  kPa          $    $  ANS009.BYTE004  $  y=x;
  $  010.计算流量-速度密度                                            $    $  g/s          $    $  ANS010.BYTE004  $  y=(x1*256+x2)/256*2;
  $  011.计算温度转换器                                               $    $  degree C     $    $  ANS011.BYTE004  $  y=x*3+300;
  $  012.凸轮轴事件活跃次数                                           $    $               $    $  ANS012.BYTE004  $  y=x;
  $  013.催化剂温度模块1传感器1                                       $    $  degree C     $    $  ANS013.BYTE004  $  y=(((x&0x7F)-(x&0x80))*0.1)-40;
  $  014.故障灯状态                                                   $    $               $    $  ANS014.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  015.排放故障数                                                   $    $               $    $  ANS014.BYTE004  $  y=x&0x7F;
  $  016.综合部件监测                                                 $    $               $    $  ANS014.BYTE005  $  if((x&0x40)==0x40)y=@028e;else y=@028d;
  $  017.燃油系统监测                                                 $    $               $    $  ANS014.BYTE005  $  if((x&0x20)==0x20)y=@028e;else y=@028d;
  $  018.失火监测完成                                                 $    $               $    $  ANS014.BYTE005  $  if((x&0x10)==0x10)y=@028e;else y=@028d;
  $  019.综合部件监测                                                 $    $               $    $  ANS014.BYTE005  $  if((x&0x04)==0x04)y=@028d;else y=@028e;
  $  020.燃油系统监测                                                 $    $               $    $  ANS014.BYTE005  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  021.失火监测                                                     $    $               $    $  ANS014.BYTE005  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  022.EGR(废气再循环)系统                                          $    $               $    $  ANS014.BYTE006  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  023.氧传感器加热器                                               $    $               $    $  ANS014.BYTE006  $  if((x&0x40)==0x40)y=@028d;else y=@028e;
  $  024.氧传感器                                                     $    $               $    $  ANS014.BYTE006  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  025.空调系统制冷剂                                               $    $               $    $  ANS014.BYTE006  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  026.二次空气系统                                                 $    $               $    $  ANS014.BYTE006  $  if((x&0x08)==0x08)y=@028d;else y=@028e;
  $  027.调整后的净化系统                                             $    $               $    $  ANS014.BYTE006  $  if((x&0x04)==0x04)y=@028d;else y=@028e;
  $  028.加热催化器                                                   $    $               $    $  ANS014.BYTE006  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  029.催化器                                                       $    $               $    $  ANS014.BYTE006  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  030.EGR(废气再循环)系统测试完成                                  $    $               $    $  ANS014.BYTE007  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  031.氧气传感器加热测试完成                                       $    $               $    $  ANS014.BYTE007  $  if((x&0x40)==0x40)y=@028d;else y=@028e;
  $  032.氧传感器测试完成                                             $    $               $    $  ANS014.BYTE007  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  033.空调系统制冷剂测试完成                                       $    $               $    $  ANS014.BYTE007  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  034.二次空气系统测试完成                                         $    $               $    $  ANS014.BYTE007  $  if((x&0x08)==0x08)y=@028d;else y=@028e;
  $  035.调整后的净化系统测试完成                                     $    $               $    $  ANS014.BYTE007  $  if((x&0x04)==0x04)y=@028d;else y=@028e;
  $  036.加热催化器测试完成                                           $    $               $    $  ANS014.BYTE007  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  037.催化器测试完成                                               $    $               $    $  ANS014.BYTE007  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  038.制造商装备氧传感器位置(模块2-传感器4)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x80)==0x80)y=@00ba;else y=@00b9;
  $  039.制造商装备氧传感器位置(模块2-传感器3)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x40)==0x40)y=@00ba;else y=@00b9;
  $  040.制造商装备氧传感器位置(模块2-传感器2)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x20)==0x20)y=@00ba;else y=@00b9;
  $  041.制造商装备氧传感器位置(模块2-传感器1)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x10)==0x10)y=@00ba;else y=@00b9;
  $  042.制造商装备氧传感器位置(模块1-传感器4)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x08)==0x08)y=@00ba;else y=@00b9;
  $  043.制造商装备氧传感器位置(模块1-传感器3)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x04)==0x04)y=@00ba;else y=@00b9;
  $  044.制造商装备氧传感器位置(模块1-传感器2)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x02)==0x02)y=@00ba;else y=@00b9;
  $  045.制造商装备氧传感器位置(模块1-传感器1)                        $    $               $    $  ANS015.BYTE004  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  046.(B1-S1)氧传感器电压                                          $    $  V            $    $  ANS016.BYTE004  $  y=x*0.005;
  $  047.(B1-S1)短期燃油修正                                          $    $  %            $    $  ANS016.BYTE005  $  y=x*0.78125-100;
  $  048.(B1-S2)氧传感器电压                                          $    $  V            $    $  ANS017.BYTE004  $  y=x*0.005;
  $  049.(B1-S2)短期燃油修正                                          $    $  %            $    $  ANS017.BYTE005  $  y=x*0.78125-100;
  $  050.燃油泵打开                                                   $    $               $    $  ANS018.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  051.催化剂保护模式                                               $    $               $    $  ANS018.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  052.空调离合器                                                   $    $               $    $  ANS018.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  053.空调请求                                                     $    $               $    $  ANS018.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  054.动力转向                                                     $    $               $    $  ANS018.BYTE004  $  if((x&0x08)==0x08)y=@0767;else y=@02ac;
  $  055.气节门怠速                                                   $    $               $    $  ANS018.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  056.减速燃油停止输送激活                                         $    $               $    $  ANS019.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  057.可变进气歧管阀门                                             $    $               $    $  ANS019.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  058.低燃油灯(可选装)                                             $    $               $    $  ANS019.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  059.维修灯                                                       $    $               $    $  ANS019.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  060.故障灯                                                       $    $               $    $  ANS019.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  061.混合气空燃比浓/稀                                            $    $               $    $  ANS020.BYTE004  $  if((x&0x40)==0x40)y=@07a6;else y=@07a7;
  $  062.爆震存在                                                     $    $               $    $  ANS020.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  063.功率加浓                                                     $    $               $    $  ANS020.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  064.燃油修正学习允许                                             $    $               $    $  ANS020.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  065.车辆防盗                                                     $    $               $    $  ANS020.BYTE004  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  066.氧传感器就绪，B1-S1                                          $    $               $    $  ANS020.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  067.闭环                                                         $    $               $    $  ANS020.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  068.ETC(Electronic Throttle Control)降低发动机功率模式           $    $               $    $  ANS021.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  069.驻车/空挡                                                    $    $               $    $  ANS021.BYTE004  $  if((x&0x10)==0x10)y=@07a8;else y=@07a9;
  $  070.高速风扇                                                     $    $               $    $  ANS021.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  071.低速风扇                                                     $    $               $    $  ANS021.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  072.允许EGR(废气再循环)流量测试                                  $    $               $    $  ANS022.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  073.怠速测试启用                                                 $    $               $    $  ANS022.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  074.EGR(废气再循环)阀门关闭位置错误                              $    $               $    $  ANS022.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  075.EEVAP排气电磁阀                                              $    $               $    $  ANS022.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  076.凸轮轴粘性测试电流失效                                       $    $               $    $  ANS022.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  077.颠簸路面检测                                                 $    $               $    $  ANS022.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  078.氧传感器(B1-S1)主要阶段测试完成                              $    $               $    $  ANS023.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  079.氧传感器(B1-S1)主要阶段数据搜集                              $    $               $    $  ANS023.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  080.钥匙-开学习错误                                              $    $               $    $  ANS024.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  081.测试进行中                                                   $    $               $    $  ANS024.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  082.催化器损坏失火                                               $    $               $    $  ANS024.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  083.学习激活标准                                                 $    $               $    $  ANS024.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  084.因素超出范围                                                 $    $               $    $  ANS024.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  085.反作用元素超出范围                                           $    $               $    $  ANS024.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  086.总数超出范围                                                 $    $               $    $  ANS024.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  087.曲柄脉冲计数错误锁存                                         $    $               $    $  ANS024.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  088.TPS节气门位置传感器距离2误差                                 $    $               $    $  ANS025.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  089.TPS节气门位置传感器1-2相关误差                               $    $               $    $  ANS025.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  090.TPS节气门位置传感器距离1误差                                 $    $               $    $  ANS025.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  091.APS加速踏板位置传感器1-2相关误差                             $    $               $    $  ANS026.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  092.APS加速踏板位置传感器距离2误差                               $    $               $    $  ANS026.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  093.APS加速踏板位置传感器距离1误差                               $    $               $    $  ANS026.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  094.巡航开关状态取消打开                                         $    $               $    $  ANS027.BYTE004  $  if((x&0x08)==0x08)y=@000f;else y=@0028;
  $  095.巡航开关状态设置打开                                         $    $               $    $  ANS027.BYTE004  $  if((x&0x04)==0x04)y=@000f;else y=@0028;
  $  096.巡航开关状态恢复打开                                         $    $               $    $  ANS027.BYTE004  $  if((x&0x02)==0x02)y=@000f;else y=@0028;
  $  097.巡航开关状态取消打开                                         $    $               $    $  ANS027.BYTE004  $  if((x&0x01)==0x01)y=@000f;else y=@0028;
  $  098.爆震传感器1故障计数                                          $    $               $    $  ANS028.BYTE004  $  y=x;
  $  099.爆震传感器1样本计数                                          $    $               $    $  ANS028.BYTE005  $  y=x;
  $  100.爆震系统故障高计数                                           $    $               $    $  ANS029.BYTE004  $  y=x;
  $  101.爆震系统故障低计数                                           $    $               $    $  ANS029.BYTE005  $  y=x;
  $  102.爆震系统样本低计数                                           $    $               $    $  ANS029.BYTE006  $  y=x;
  $  103.填充字节                                                     $    $               $    $  ANS029.BYTE007  $  y=x;
  $  104.所有非诊断相关的指示启用凸轮轴条件                           $    $               $    $  ANS030.BYTE004  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  105.凸轮轴允许包装标志                                           $    $               $    $  ANS030.BYTE004  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  106.怠速催化器请求的测试完成                                     $    $               $    $  ANS031.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  107.怠速催化器测试中断                                           $    $               $    $  ANS031.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  108.怠速催化器测试运行(启用条件满足)                             $    $               $    $  ANS031.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  109.怠速催化器不能进行测试                                       $    $               $    $  ANS031.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  110.巡航使能巡航灯亮                                             $    $               $    $  ANS032.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  111.巡航激活巡航灯亮                                             $    $               $    $  ANS032.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  112.当量比                                                       $    $  %            $    $  ANS033.BYTE004  $  y=(x1*256+x2)*2/256;
  $  113.蒸发清除指令                                                 $    $  %            $    $  ANS034.BYTE004  $  y=x*100/255;
  $  114.节气门开度                                                   $    $  %            $    $  ANS035.BYTE004  $  y=x*100/255;
  $  115.控制模块电压                                                 $    $  V            $    $  ANS036.BYTE004  $  y=(x1*256+x2)*0.001;
  $  116.冷却液温度(启动)                                             $    $  degree C     $    $  ANS037.BYTE004  $  y=x-40;
  $  117.曲轴自适应气缸                                               $    $               $    $  ANS038.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  118.曲轴自适应采样计数                                           $    $               $    $  ANS039.BYTE004  $  HEX(X);
  $  119.巡航理想发动机扭矩                                           $    $               $    $  ANS040.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.0625-2048;
  $  120.巡航解除历史记录0                                            $    $               $    $  ANS041.BYTE004  $  if(x==0x00)y=@0437;else if(x==0x01)y=@07aa;else if(x==0x02)y=@07ab;else if(x==0x03)y=@07ac;else if(x==0x04)y=@07ad;else if(x==0x05)y=@07ae;else if(x==0x06)y=@07af;else if(x==0x07)y=@07b0;else if(x==0x08)y=@07b1;else if(x==0x09)y=@07b2;else if(x==0x0A)y=@000f;else if(x==0x0B)y=@07b3;else if(x==0x0C)y=@07b4;else if(x==0x0D)y=@07b5;else if(x==0x0E)y=@07b6;else if(x==0x0F)y=@07b7;else if(x==0x10)y=@07b8;else if(x==0x11)y=@07b9;else if(x==0x12)y=@07ba;else if(x==0x13)y=@07bb;else if(x==0x14)y=@07bc;else if(x==0x15)y=@07bd;else y=@01a9;
  $  121.巡航解除历史记录1                                            $    $               $    $  ANS042.BYTE004  $  if(x==0x00)y=@0437;else if(x==0x01)y=@07aa;else if(x==0x02)y=@07ab;else if(x==0x03)y=@07ac;else if(x==0x04)y=@07ad;else if(x==0x05)y=@07ae;else if(x==0x06)y=@07af;else if(x==0x07)y=@07b0;else if(x==0x08)y=@07b1;else if(x==0x09)y=@07b2;else if(x==0x0A)y=@000f;else if(x==0x0B)y=@07b3;else if(x==0x0C)y=@07b4;else if(x==0x0D)y=@07b5;else if(x==0x0E)y=@07b6;else if(x==0x0F)y=@07b7;else if(x==0x10)y=@07b8;else if(x==0x11)y=@07b9;else if(x==0x12)y=@07ba;else if(x==0x13)y=@07bb;else if(x==0x14)y=@07bc;else if(x==0x15)y=@07bd;else y=@01a9;
  $  122.巡航解除历史记录2                                            $    $               $    $  ANS043.BYTE004  $  if(x==0x00)y=@0437;else if(x==0x01)y=@07aa;else if(x==0x02)y=@07ab;else if(x==0x03)y=@07ac;else if(x==0x04)y=@07ad;else if(x==0x05)y=@07ae;else if(x==0x06)y=@07af;else if(x==0x07)y=@07b0;else if(x==0x08)y=@07b1;else if(x==0x09)y=@07b2;else if(x==0x0A)y=@000f;else if(x==0x0B)y=@07b3;else if(x==0x0C)y=@07b4;else if(x==0x0D)y=@07b5;else if(x==0x0E)y=@07b6;else if(x==0x0F)y=@07b7;else if(x==0x10)y=@07b8;else if(x==0x11)y=@07b9;else if(x==0x12)y=@07ba;else if(x==0x13)y=@07bb;else if(x==0x14)y=@07bc;else if(x==0x15)y=@07bd;else y=@01a9;
  $  123.巡航解除历史记录3                                            $    $               $    $  ANS044.BYTE004  $  if(x==0x00)y=@0437;else if(x==0x01)y=@07aa;else if(x==0x02)y=@07ab;else if(x==0x03)y=@07ac;else if(x==0x04)y=@07ad;else if(x==0x05)y=@07ae;else if(x==0x06)y=@07af;else if(x==0x07)y=@07b0;else if(x==0x08)y=@07b1;else if(x==0x09)y=@07b2;else if(x==0x0A)y=@000f;else if(x==0x0B)y=@07b3;else if(x==0x0C)y=@07b4;else if(x==0x0D)y=@07b5;else if(x==0x0E)y=@07b6;else if(x==0x0F)y=@07b7;else if(x==0x10)y=@07b8;else if(x==0x11)y=@07b9;else if(x==0x12)y=@07ba;else if(x==0x13)y=@07bb;else if(x==0x14)y=@07bc;else if(x==0x15)y=@07bd;else y=@01a9;
  $  124.巡航解除历史记录4                                            $    $               $    $  ANS045.BYTE004  $  if(x==0x00)y=@0437;else if(x==0x01)y=@07aa;else if(x==0x02)y=@07ab;else if(x==0x03)y=@07ac;else if(x==0x04)y=@07ad;else if(x==0x05)y=@07ae;else if(x==0x06)y=@07af;else if(x==0x07)y=@07b0;else if(x==0x08)y=@07b1;else if(x==0x09)y=@07b2;else if(x==0x0A)y=@000f;else if(x==0x0B)y=@07b3;else if(x==0x0C)y=@07b4;else if(x==0x0D)y=@07b5;else if(x==0x0E)y=@07b6;else if(x==0x0F)y=@07b7;else if(x==0x10)y=@07b8;else if(x==0x11)y=@07b9;else if(x==0x12)y=@07ba;else if(x==0x13)y=@07bb;else if(x==0x14)y=@07bc;else if(x==0x15)y=@07bd;else y=@01a9;
  $  125.巡航模式                                                     $    $               $    $  ANS046.BYTE004  $  if(x==0x00)y=@00db;else if(x==0x01)y=@07be;else if(x==0x02)y=@07bf;else if(x==0x03)y=@07c0;else if(x==0x04)y=@07c1;else if(x==0x05)y=@07c2;else if(x==0x06)y=@07c3;else if(x==0x07)y=@07c4;else if(x==0x08)y=@07c5;else if(x==0x09)y=@07c6;else y=@01a9;
  $  126.巡航速度误差                                                 $    $  km/h         $    $  ANS047.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.0078125-256;
  $  127.巡航目标速度                                                 $    $  km/h         $    $  ANS048.BYTE004  $  y=(x1*256+x2)*2/256;
  $  128.当前负载值                                                   $    $  %            $    $  ANS049.BYTE004  $  y=x*100/255;
  $  129.点火正值提前角 气缸1                                         $    $  rad          $    $  ANS050.BYTE004  $  y=x*0.5-64;
  $  130.通用燃料系统状态1                                            $    $               $    $  ANS051.BYTE004  $  if(x==0x01)y=@07c7;else if(x==0x02)y=@07c8;else if(x==0x03)y=@07c9;else y=@01a9;
  $  131.长期燃油修正                                                 $    $  %            $    $  ANS052.BYTE004  $  y=x*0.78125-100;
  $  132.短期燃油修正                                                 $    $  %            $    $  ANS053.BYTE004  $  y=x*0.78125-100;
  $  133.节气门位置A                                                  $    $  %            $    $  ANS054.BYTE004  $  y=x*100/255;
  $  134.冷却液温度                                                   $    $  degree C     $    $  ANS055.BYTE004  $  y=x-40;
  $  135.发动机转速                                                   $    $  rpm          $    $  ANS056.BYTE004  $  y=(x1*256+x2)*0.25;
  $  136.进气温度                                                     $    $  degree C     $    $  ANS057.BYTE004  $  y=x-40;
  $  137.歧管绝对压力                                                 $    $  kPa          $    $  ANS058.BYTE004  $  y=x;
  $  138.当前车辆速度                                                 $    $  m/s          $    $  ANS059.BYTE004  $  y=x*0.2776646;
  $  139.缸模式失火指数                                               $    $               $    $  ANS060.BYTE004  $  y=x1*256+x2;
  $  140.提供的基本喷油脉宽                                           $    $  ms           $    $  ANS061.BYTE004  $  y=(x1*256+x2)*1000/65535;
  $  141.期望怠速                                                     $    $  rpm          $    $  ANS062.BYTE004  $  y=x*0.08;
  $  142.EGR(废气再循环)阀门期望开度                                  $    $               $    $  ANS063.BYTE004  $  y=x*100/255.0;
  $  143.清除故障码后行驶距离                                         $    $  km           $    $  ANS064.BYTE004  $  y=x;
  $  144.碳罐电池阀占空比                                             $    $  %            $    $  ANS065.BYTE004  $  y=x*100/255.0;
  $  145.EGR(废气再循环)关闭枢轴位置                                  $    $  %            $    $  ANS066.BYTE004  $  y=(x1*256+x2)*200/65536.0;
  $  146.EGR(废气再循环)测试失败次数                                  $    $               $    $  ANS067.BYTE004  $  y=x1*256+x2;
  $  147.EGR(废气再循环)测试通过次数                                  $    $               $    $  ANS068.BYTE004  $  y=x1*256+x2;
  $  148.EGR(废气再循环)占空比                                        $    $  %            $    $  ANS069.BYTE004  $  y=x*100/256.0;
  $  149.EGR(废气再循环) EWMA结果                                     $    $               $    $  ANS070.BYTE004  $  y=x1*256+x2;
  $  150.EGR(废气再循环) EWMA结果                                     $    $  s            $    $  ANS071.BYTE004  $  y=x1*256+x2;
  $  151.EGR(废气再循环)流量失效限制                                  $    $  s            $    $  ANS072.BYTE004  $  y=x1*256+x2;
  $  152.EGR(废气再循环)枢轴位置错误                                  $    $               $    $  ANS071.BYTE004  $  y=(x1*256+x2)*400/65536.0;
  $  153.EGR(废气再循环)试样减速测试                                  $    $               $    $  ANS073.BYTE004  $  y=x;
  $  154.ETC加速踏板位置                                              $    $  %            $    $  ANS074.BYTE004  $  y=(x1*256+x2)*200/65536.0;
  $  155.ETC理想节气门开度                                            $    $  %            $    $  ANS075.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  156.ETC显示节气门开度                                            $    $  %            $    $  ANS076.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  157.ETC踏板位置传感器1                                           $    $  %            $    $  ANS077.BYTE004  $  y=(x1*256+x2)*200/65536.0;
  $  158.ETC踏板位置传感器2                                           $    $  %            $    $  ANS078.BYTE004  $  y=(x1*256+x2)*200/65536.0;
  $  159.ETC节气门位置传感器1                                         $    $  %            $    $  ANS079.BYTE004  $  y=(x1*256+x2)*200/65536.0;
  $  160.ETC节气门位置传感器2                                         $    $  %            $    $  ANS080.BYTE004  $  y=(x1*256+x2)*200/65536.0;
  $  161.ETC无动力节气门位置                                          $    $  %            $    $  ANS081.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  162.发动机里程                                                   $    $  km           $    $  ANS082.BYTE004  $  y=(x1*256+x2)*10;
  $  163.发动机运行时间                                               $    $  s            $    $  ANS083.BYTE004  $  y=x1*256+x2;
  $  164.排气凸轮轴实际位置                                           $    $               $    $  ANS084.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  165.排气凸轮轴理想位置                                           $    $               $    $  ANS085.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  166.排气凸轮轴占空比                                             $    $  %            $    $  ANS085.BYTE004  $  y=x/255;
  $  167.故障情况下的没有运行计数(点火周期中没有运行诊断的次数)       $    $               $    $  ANS086.BYTE004  $  y=x;
  $  168.故障情况下的故障计数(点火周期的故障次数)                     $    $               $    $  ANS087.BYTE004  $  y=x;
  $  169.故障情况下的通过计数(诊断通过的次数)                         $    $               $    $  ANS088.BYTE004  $  y=x;
  $  170.第一次的里程                                                 $    $  km           $    $  ANS089.BYTE004  $  y=(x1*256+x2)*5;
  $  171.输入燃油水平                                                 $    $  %            $    $  ANS090.BYTE004  $  y=x*100/255.0;
  $  172.燃油油位输出                                                 $    $  %            $    $  ANS091.BYTE004  $  y=x*100/255.0;
  $  173.燃油有位传感器                                               $    $  V            $    $  ANS092.BYTE004  $  y=(x*5)/255.0;
  $  174.燃油箱的真空压力A/D                                          $    $  V            $    $  ANS093.BYTE004  $  y=(x*5)/255.0;
  $  175.燃油修正单元                                                 $    $               $    $  ANS094.BYTE004  $  y=x;
  $  176.G传感器唤醒                                                  $    $  V            $    $  ANS095.BYTE004  $  y=((x&0x7F)-(x&0x80))*0.0625-8;
  $  177.怠速催化剂监控氧气存储EWNA值                                 $    $  s            $    $  ANS096.BYTE004  $  y=(x1*256+x2)*1024/65536.0;
  $  178.怠速催化剂监控氧气存储超出阈值                               $    $  s            $    $  ANS097.BYTE004  $  y=(x1*256+x2)*1024/65536.0;
  $  179.怠速催化剂监控器授权的拒绝原因                               $    $               $    $  ANS098.BYTE004  $  if(x==0x00)y=@076e;else if(x==0x01)y=@076f;else if(x==0x02)y=@0770;else if(x==0x03)y=@0771;else if(x==0x04)y=@0772;else if(x==0x05)y=@0773;else if(x==0x06)y=@0774;else if(x==0x07)y=@0775;else if(x==0x08)y=@0776;else if(x==0x09)y=@0777;else if(x==0x0A)y=@0778;else if(x==0x0B)y=@0779;else if(x==0x0C)y=@077a;else if(x==0x0D)y=@077b;else if(x==0x0E)y=@077c;else if(x==0x0F)y=@077d;else if(x==0x10)y=@077e;else if(x==0x11)y=@077f;else if(x==0x12)y=@0780;else if(x==0x13)y=@0632;else if(x==0x14)y=@0781;else if(x==0x15)y=@0782;else if(x==0x16)y=@0783;else if(x==0x17)y=@0784;else y=@01a9;
  $  180.怠速催化器测试中断原因                                       $    $               $    $  ANS099.BYTE004  $  if(x==0x00)y=@0785;else if(x==0x01)y=@0786;else if(x==0x02)y=@0787;else if(x==0x03)y=@0788;else if(x==0x04)y=@0789;else if(x==0x05)y=@0788;else if(x==0x06)y=@078a;else if(x==0x07)y=@078b;else if(x==0x08)y=@078c;else if(x==0x09)y=@078d;else if(x==0x0A)y=@078e;else if(x==0x0B)y=@078f;else if(x==0x0C)y=@0790;else if(x==0x0D)y=@0791;else if(x==0x0E)y=@0792;else y=@01a9;
  $  181.怠速催化器监控器状态计时器                                   $    $  s            $    $  ANS100.BYTE004  $  y=(x1*256+x2)*1024/65536;
  $  182.怠速催化器监控器时间-最后测试结果                            $    $  s            $    $  ANS101.BYTE004  $  y=(x1*256+x2)*1024/65536;
  $  183.怠速转速误差                                                 $    $  rpm          $    $  ANS102.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*4096/32768-4096;
  $  184.点火电压                                                     $    $  V            $    $  ANS103.BYTE004  $  y=x*0.1;
  $  185.进气凸轮轴实际位置                                           $    $               $    $  ANS104.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  186.进气凸轮轴理想位置                                           $    $               $    $  ANS105.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  187.进气凸轮轴占空比                                             $    $  %            $    $  ANS106.BYTE004  $  y=x/255;
  $  188.爆震次数                                                     $    $               $    $  ANS107.BYTE004  $  y=x;
  $  189.爆震延迟                                                     $    $  rad          $    $  ANS108.BYTE004  $  y=x*22.5/255;
  $  190.最后的里程                                                   $    $  km           $    $  ANS109.BYTE004  $  y=(x1*256+x2)*5;
  $  191.EGR(废气再循环)反馈A/D                                       $    $  V            $    $  ANS110.BYTE004  $  y=(x*5)/255.0;
  $  192.EGR(废气再循环)开度                                          $    $  %            $    $  ANS111.BYTE004  $  y=(x*100)/255.0;
  $  193.EGR(废气再循环)流量差异                                      $    $  kPa          $    $  ANS112.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.78125-256;
  $  194.ECM处于工厂生产状态次数                                      $    $               $    $  ANS113.BYTE004  $  HEX(X);
  $  195.MIL(发动机故障灯)灯点亮时里程                                $    $  km           $    $  ANS114.BYTE004  $  y=x;
  $  196.ICMD授权的最大的催化器温度                                   $    $  degree C     $    $  ANS115.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*2048/32768-2048;
  $  197.ICMD授权的最小的催化器温度                                   $    $  degree C     $    $  ANS115.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*2048/32768-2048;
  $  198.气缸1当前失火数                                              $    $               $    $  ANS116.BYTE004  $  y=x;
  $  199.气缸2当前失火数                                              $    $               $    $  ANS117.BYTE004  $  y=x;
  $  200.气缸3当前失火数                                              $    $               $    $  ANS118.BYTE004  $  y=x;
  $  201.气缸4当前失火数                                              $    $               $    $  ANS119.BYTE004  $  y=x;
  $  202.失火周期延迟计数                                             $    $               $    $  ANS120.BYTE004  $  y=x;
  $  203.从第一次失效开始的失火故障                                   $    $               $    $  ANS121.BYTE004  $  y=x1*256+x2;
  $  204.气缸1历史失火数                                              $    $               $    $  ANS122.BYTE004  $  y=x1*256+x2;
  $  205.气缸2历史失火数                                              $    $               $    $  ANS123.BYTE004  $  y=x1*256+x2;
  $  206.气缸3历史失火数                                              $    $               $    $  ANS124.BYTE004  $  y=x1*256+x2;
  $  207.气缸4历史失火数                                              $    $               $    $  ANS125.BYTE004  $  y=x1*256+x2;
  $  208.从第一次失效开始的失火通过                                   $    $               $    $  ANS126.BYTE004  $  y=x1*256+x2;
  $  209.故障码清除后的OBD暖机起动次数                                $    $               $    $  ANS127.BYTE004  $  y=x;
  $  210.氧传感器(B1-S1)加热器电流                                    $    $  A            $    $  ANS128.BYTE004  $  y=(x/256)*0.5;
  $  211.氧传感器响应诊断从稀到浓的翻转次数                           $    $               $    $  ANS129.BYTE004  $  y=x1*256+x2;
  $  212.氧传感器响应浓到稀平均时间                                   $    $  ms           $    $  ANS130.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  213.氧传感器浓道喜响应转换                                       $    $               $    $  ANS131.BYTE004  $  y=x1*256+x2;
  $  214.氧传感器响应-稀到浓的平均时间                                $    $  ms           $    $  ANS132.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  215.氧传感器响应-稀到浓的总时间                                  $    $  ms           $    $  ANS133.BYTE004  $  y=(x1*256+x2)*7.81;
  $  216.氧传感器响应-浓到稀总时间                                    $    $  ms           $    $  ANS134.BYTE004  $  y=(x1*256+x2)*7.81;
  $  217.氧传感器浓/稀到稀/浓响应比率                                 $    $  rad          $    $  ANS132.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  218.氧传感器(B1-S1)加热器电流                                    $    $  A            $    $  ANS135.BYTE004  $  y=(x/256)*0.5;
  $  219.氧传感器电压(B1-S1)                                          $    $  mV           $    $  ANS136.BYTE004  $  y=x*4.34027771;
  $  220.氧传感器电压(B1-S2)                                          $    $  mV           $    $  ANS137.BYTE004  $  y=x*4.34027771;
  $  221.油温来确定VCPC启用                                           $    $  degree C     $    $  ANS138.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  222.车载诊断系统类型                                             $    $               $    $  ANS139.BYTE004  $  if(x==0x01)y=@062d;else if(x==0x02)y=@062e;else if(x==0x03)y=@00c2;else if(x==0x04)y=@00c3;else if(x==0x05)y=@079f;else if(x==0x06)y=@07a0;else if(x==0x07)y=@00c6;else if(x==0x08)y=@00c7;else if(x==0x09)y=@07a1;else if(x==0x0A)y=@07a2;else if(x==0x0B)y=@07a3;else if(x==0x0C)y=@07a4;else if(x==0x0D)y=@07a5;else y=@01a9;
  $  223.氧传感器加热器电流第1排传感器1                               $    $               $    $  ANS140.BYTE004  $  y=(x1*256+x2)*0.02;
  $  224.氧传感器加热器电流第1排传感器2                               $    $               $    $  ANS141.BYTE004  $  y=(x1*256+x2)*0.02;
  $  225.相对节气门位置                                               $    $  %            $    $  ANS142.BYTE004  $  y=x*100/255.0;
  $  226.转速模式失火指数                                             $    $               $    $  ANS143.BYTE004  $  y=x1*256+x2;
  $  227.启动IAT                                                      $    $  degree C     $    $  ANS144.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  228.TEC(半导体致冷器)产线学齿测试次数                            $    $               $    $  ANS145.BYTE004  $  y=x;
  $  229.TEC(半导体致冷器)学习数据 气缸1                              $    $               $    $  ANS146.BYTE004  $  y=x1*256+x2;
  $  230.TEC(半导体致冷器)学习数据 气缸2                              $    $               $    $  ANS147.BYTE004  $  y=x1*256+x2;
  $  231.TEC(半导体致冷器)学习数据 气缸3                              $    $               $    $  ANS148.BYTE004  $  y=x1*256+x2;
  $  232.TEC(半导体致冷器)学习数据 气缸4                              $    $               $    $  ANS149.BYTE004  $  y=x1*256+x2;
  $  233.发动机起动后的时间                                           $    $  s            $    $  ANS150.BYTE004  $  y=x;
  $  234.故障灯激活发动运行时间                                       $    $               $    $  ANS151.BYTE004  $  y=x1*256+x2;
  $  235.当前失火总数                                                 $    $               $    $  ANS152.BYTE004  $  y=x1*256+x2;
  $  236.弱缸                                                         $    $               $    $  ANS153.BYTE004  $  if(x==0x00)y=@079d;else if(x<=0x08)y=@079e;else y=@01a9;
  $  237.车轮/车辆速度输入                                            $    $  kPa          $    $  ANS154.BYTE004  $  y=x;
  $  238.电压参考1                                                    $    $  V            $    $  ANS155.BYTE004  $  y=x*10/255.0;
  $  239.电压参考2                                                    $    $  V            $    $  ANS155.BYTE004  $  y=x*10/255.0;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
