
    车型ID：1032

    模拟：协议模拟-->1032

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/32000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 91 00 00 00 00       $%  ANS002:769 03 22 F1 91 00 00 00 00
  $%  REQ003:761 03 22 F1 A2 00 00 00 00       $%  ANS003:769 03 22 F1 A2 00 00 00 00
  $%  REQ004:761 03 22 F1 87 00 00 00 00       $%  ANS004:769 03 22 F1 87 00 00 00 00
  $%  REQ005:761 03 22 F1 10 00 00 00 00       $%  ANS005:769 03 22 F1 10 00 00 00 00
  $%  REQ006:761 03 22 F1 92 00 00 00 00       $%  ANS006:769 03 22 F1 92 00 00 00 00
  $%  REQ007:761 03 22 F1 8C 00 00 00 00       $%  ANS007:769 03 22 F1 8C 00 00 00 00
  $%  REQ008:761 03 22 F1 94 00 00 00 00       $%  ANS008:769 03 22 F1 94 00 00 00 00
  $%  REQ009:761 03 22 F1 8A 00 00 00 00       $%  ANS009:769 03 22 F1 8A 00 00 00 00
  $%  REQ010:761 03 22 F1 90 00 00 00 00       $%  ANS010:769 03 22 F1 90 00 00 00 00
  $%  REQ011:761 03 22 F1 A8 00 00 00 00       $%  ANS011:769 03 22 F1 A8 00 00 00 00
  $%  REQ012:761 03 22 F1 8B 00 00 00 00       $%  ANS012:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元网络文件参考号:          $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号(上次):            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  006:测试工具参考号(上次):            $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  007:里程读数(上次)KM:                $%    $%  ANS005.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  008:供应商电控单元硬件参考号:        $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  009:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  010:产品线的数量:                    $%    $%  ANS007.BYTE010  $%  HEX(X1);
  $%  011:年:                              $%    $%  ANS007.BYTE011  $%  HEX(X1);
  $%  012:月 :                             $%    $%  ANS007.BYTE012  $%  HEX(X1);
  $%  013:日:                              $%    $%  ANS007.BYTE013  $%  HEX(X1);
  $%  014:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  015:系统供应商识别码:                $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  016:VIN码:                           $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  017:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  018:电控单元制造日期:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 E0 02 00 00 00 00       $  ANS000:769 03 22 E0 02 00 00 00 00
  $  REQ001:761 03 22 E0 03 00 00 00 00       $  ANS001:769 03 22 E0 03 00 00 00 00
  $  REQ002:761 03 22 E0 01 00 00 00 00       $  ANS002:769 03 22 E0 01 00 00 00 00
  $  REQ003:761 03 22 E0 06 00 00 00 00       $  ANS003:769 03 22 E0 06 00 00 00 00
  $  REQ004:761 03 22 D0 02 00 00 00 00       $  ANS004:769 03 22 D0 02 00 00 00 00
  $  REQ005:761 03 22 D0 04 00 00 00 00       $  ANS005:769 03 22 D0 04 00 00 00 00
  $  REQ006:761 03 22 E0 05 00 00 00 00       $  ANS006:769 03 22 E0 05 00 00 00 00
  $  REQ007:761 03 22 E0 04 00 00 00 00       $  ANS007:769 03 22 E0 04 00 00 00 00
  $  REQ008:761 03 22 E0 0B 00 00 00 00       $  ANS008:769 03 22 E0 0B 00 00 00 00
  $  REQ009:761 03 22 E0 0E 00 00 00 00       $  ANS009:769 03 22 E0 0E 00 00 00 00
  $  REQ010:761 03 22 E0 0D 00 00 00 00       $  ANS010:769 03 22 E0 0D 00 00 00 00
  $  REQ011:761 03 22 D0 01 00 00 00 00       $  ANS011:769 03 22 D0 01 00 00 00 00
  $  REQ012:761 03 22 E0 0A 00 00 00 00       $  ANS012:769 03 22 E0 0A 00 00 00 00
  $  REQ013:761 03 22 D0 03 00 00 00 00       $  ANS013:769 03 22 D0 03 00 00 00 00
  $  REQ014:761 03 22 E0 0C 00 00 00 00       $  ANS014:769 03 22 E0 0C 00 00 00 00
  $  REQ015:761 03 22 E0 08 00 00 00 00       $  ANS015:769 03 22 E0 08 00 00 00 00
  $  REQ016:761 03 22 E0 09 00 00 00 00       $  ANS016:769 03 22 E0 09 00 00 00 00
  $  REQ017:761 03 22 C0 01 00 00 00 00       $  ANS017:769 03 22 C0 01 00 00 00 00
  $  REQ018:761 03 22 C0 02 00 00 00 00       $  ANS018:769 03 22 C0 02 00 00 00 00
  $  REQ019:761 03 22 C0 20 00 00 00 00       $  ANS019:769 03 22 C0 20 00 00 00 00
  $  REQ020:761 03 22 C0 23 00 00 00 00       $  ANS020:769 03 22 C0 23 00 00 00 00
  $  REQ021:761 03 22 C0 03 00 00 00 00       $  ANS021:769 03 22 C0 03 00 00 00 00
  $  REQ022:761 03 22 C0 04 00 00 00 00       $  ANS022:769 03 22 C0 04 00 00 00 00
  $  REQ023:761 03 22 C0 05 00 00 00 00       $  ANS023:769 03 22 C0 05 00 00 00 00
  $  REQ024:761 03 22 C0 06 00 00 00 00       $  ANS024:769 03 22 C0 06 00 00 00 00
  $  REQ025:761 03 22 C0 07 00 00 00 00       $  ANS025:769 03 22 C0 07 00 00 00 00
  $  REQ026:761 03 22 C0 08 00 00 00 00       $  ANS026:769 03 22 C0 08 00 00 00 00
  $  REQ027:761 03 22 C0 09 00 00 00 00       $  ANS027:769 03 22 C0 09 00 00 00 00
  $  REQ028:761 03 22 C0 0A 00 00 00 00       $  ANS028:769 03 22 C0 0A 00 00 00 00
  $  REQ029:761 03 22 C0 0B 00 00 00 00       $  ANS029:769 03 22 C0 0B 00 00 00 00
  $  REQ030:761 03 22 C0 0C 00 00 00 00       $  ANS030:769 03 22 C0 0C 00 00 00 00
  $  REQ031:761 03 22 C0 0D 00 00 00 00       $  ANS031:769 03 22 C0 0D 00 00 00 00
  $  REQ032:761 03 22 C0 0E 00 00 00 00       $  ANS032:769 03 22 C0 0E 00 00 00 00
  $  REQ033:761 03 22 C0 0F 00 00 00 00       $  ANS033:769 03 22 C0 0F 00 00 00 00
  $  REQ034:761 03 22 E0 07 00 00 00 00       $  ANS034:769 03 22 E0 07 00 00 00 00

  $  000.加速踏板位置                               $    $  %            $    $  ANS000.BYTE004  $  y=(x*100)/256.0;
  $  001.加速器有效位置                             $    $  %            $    $  ANS001.BYTE004  $  y=(x*100)/256.0;
  $  002.环境温度(小)                               $    $  degree C     $    $  ANS002.BYTE004  $  y=x-40;
  $  003.大气压力                                   $    $  hPa          $    $  ANS003.BYTE004  $  y=x*5;
  $  004.方向指示灯状态                             $    $               $    $  ANS004.BYTE004  $  if((x&0x60)==0x00)y=@000f;else if((x&0x60)==0x20)y=@0667;else if((x&0x60)==0x40)y=@0668;else y=@01a9;
  $  005.日间行车灯状态                             $    $               $    $  ANS004.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  006.尾门开关状态                               $    $               $    $  ANS004.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  007.左后侧门开关状态                           $    $               $    $  ANS004.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  008.右后门开关状态                             $    $               $    $  ANS004.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  009.前排乘务员门开关状态                       $    $               $    $  ANS004.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  010.驾驶员门开关状态                           $    $               $    $  ANS004.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  011.后雾灯状态                                 $    $               $    $  ANS004.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  012.前雾灯状态                                 $    $               $    $  ANS004.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  013.远光灯状态                                 $    $               $    $  ANS004.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  014.近光灯状态                                 $    $               $    $  ANS004.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  015.位置灯状态                                 $    $               $    $  ANS004.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  016.前舱开关状态                               $    $               $    $  ANS004.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  017.系统电源模式                               $    $               $    $  ANS004.BYTE005  $  if((x&0x01)==0x01)y=@0011;else y=@000f;
  $  018.乘客车门锁定状态                           $    $               $    $  ANS004.BYTE006  $  if((x&0x60)==0x00)y=@0052;else if((x&0x60)==0x20)y=@0055;else if((x&0x60)==0x40)y=@01a9;else y=@0136;
  $  019.驾驶员侧车门锁定状态                       $    $               $    $  ANS004.BYTE006  $  if((x&0x18)==0x00)y=@0052;else if((x&0x18)==0x08)y=@0055;else if((x&0x18)==0x10)y=@01a9;else y=@0136;
  $  020.倒挡                                       $    $               $    $  ANS004.BYTE006  $  if((x&0x04)==0x04)y=@0388;else y=@0669;
  $  021.右转向灯状态                               $    $               $    $  ANS004.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  022.左转向灯状态                               $    $               $    $  ANS004.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  023.BVS系统状态                                $    $               $    $  ANS005.BYTE004  $  if((x&0x07)==0x00)y=@012b;if((x&0x07)==0x01)y=@047a;else if((x&0x07)==0x02)y=@047b;else if((x&0x07)==0x03)y=@01ce;else if((x&0x07)==0x04)y=@01cf;else y=@01a9;
  $  024.巡航控制驾驶员设置的速度                   $    $  km/h         $    $  ANS006.BYTE004  $  y=x*0.0625;
  $  025.燃油消耗                                   $    $  mL           $    $  ANS007.BYTE004  $  y=x;
  $  026.燃油箱液位                                 $    $  L            $    $  ANS008.BYTE004  $  y=x;
  $  027.仪表显示平均油耗                           $    $  L/100km      $    $  ANS009.BYTE004  $  y=x*0.1;
  $  028.仪表显示剩余驾驶距离                       $    $  km           $    $  ANS010.BYTE004  $  y=x;
  $  029.全局KL.50状态                              $    $               $    $  ANS011.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  030.全局发动机运行状态                         $    $               $    $  ANS011.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  031.全局KL.15状态                              $    $               $    $  ANS011.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  032.全局KL.R状态                               $    $               $    $  ANS011.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  033.系统KL.50状态                              $    $               $    $  ANS011.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  034.系统发动机运行状态                         $    $               $    $  ANS011.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  035.系统KL.15状态                              $    $               $    $  ANS011.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  036.系统KL.R状态                               $    $               $    $  ANS011.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  037.仪表总里程                                 $    $  km           $    $  ANS012.BYTE004  $  y=x;
  $  038.PEPS钥匙状态                               $    $               $    $  ANS013.BYTE004  $  if((x&0x07)==0x00)y=@000f;else if((x&0x07)==0x01)y=@0463;else if((x&0x07)==0x02)y=@0666;else if((x&0x07)==0x03)y=@009e;else if((x&0x07)==0x07)y=@0136;else y=@01a9;
  $  039.仪表显示总里程                             $    $  km           $    $  ANS014.BYTE004  $  y=x;
  $  040.转向角                                     $    $  rad          $    $  ANS015.BYTE004  $  y=((x&0x7F)-(x&0x80))*0.1;
  $  041.转向速度                                   $    $  rad/s        $    $  ANS016.BYTE004  $  y=x*4;
  $  042.车身颜色类型配置                           $    $               $    $  ANS017.BYTE004  $  if(x==0x00)y=@06e2;else if(x==0x01)y=@06e3;else if(x==0x02)y=@06e4;else if(x==0x03)y=@06e5;else if(x==0x04)y=@06e6;else if(x==0x05)y=@06e7;else if(x==0x06)y=@06e8;else if(x==0x07)y=@06e9;else if(x==0x08)y=@06ea;else if(x==0x09)y=@06eb;else if(x==0x0A)y=@06ec;else if(x==0x0B)y=@06ed;else if(x==0x0C)y=@06ee;else if(x==0x0D)y=@06ef;else if(x==0x0E)y=@06f0;else y=@01a9;
  $  043.胎压监测系统类型配置                       $    $               $    $  ANS017.BYTE007  $  if(x==0x00)y=@06f1;else if(x==0x01)y=@06f2;else if(x==0x02)y=@06f3;else y=@01a9;
  $  044.360度视野类型配置                          $    $               $    $  ANS018.BYTE006  $  if(x==0x00)y=@0721;else if(x==0x01)y=@0722;else if(x==0x02)y=@0692;else y=@01a9;
  $  045.车载显示器类型配置                         $    $               $    $  ANS018.BYTE007  $  if(x==0x10)y=@0723;else if(x==0x11)y=@0724;else if(x==0x02)y=@0725;else if(x==0x03)y=@0726;else if(x==0x15)y=@0727;else if(x==0x14)y=@0728;else y=@01a9;
  $  046.驱动模式配置                               $    $               $    $  ANS019.BYTE004  $  if(x==0x00)y=@0445;else if(x==0x01)y=@0112;else y=@01a9;
  $  047.发动机启停功能                             $    $               $    $  ANS019.BYTE005  $  if(x==0x00)y=@0445;else if(x==0x01)y=@0112;else y=@01a9;
  $  048.电动后视镜配置                             $    $               $    $  ANS019.BYTE006  $  if(x==0x00)y=@0745;else if(x==0x01)y=@06de;else if(x==0x02)y=@06df;else y=@01a9;
  $  049.顶级的DVD屏幕配置                          $    $               $    $  ANS019.BYTE007  $  if(x==0x00)y=@0445;else if(x==0x01)y=@0112;else y=@01a9;
  $  050.车辆的网络配置                             $    $               $    $  ANS020.BYTE004  $  if(x==0x00)y=@06e0;else if(x==0x01)y=@06e1;else if(x==0x02)y=@048e;else if(x==0x03)y=@048c;else y=@01a9;
  $  051.手机互联网                                 $    $               $    $  ANS020.BYTE005  $  if(x==0x00)y=@0445;else if(x==0x01)y=@0112;else y=@01a9;
  $  052.迎宾灯配置                                 $    $               $    $  ANS020.BYTE006  $  if(x==0x00)y=@0445;else if(x==0x01)y=@0112;else y=@01a9;
  $  053.氛围灯配置                                 $    $               $    $  ANS020.BYTE007  $  if(x==0x00)y=@0445;else if(x==0x01)y=@0112;else y=@01a9;
  $  054.后排乘客区电动玻璃                         $    $               $    $  ANS021.BYTE004  $  if((x&0x80)==0x80)y=@0445;else y=@0112;
  $  055.后排乘客区电动玻璃一键自动下               $    $               $    $  ANS021.BYTE004  $  if((x&0x40)==0x40)y=@0445;else y=@0112;
  $  056.副驾驶员电动玻璃                           $    $               $    $  ANS021.BYTE004  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  057.副驾驶员电动玻璃一键自动下                 $    $               $    $  ANS021.BYTE004  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  058.副驾驶员电动玻璃一键自动上下(带防夹)       $    $               $    $  ANS021.BYTE004  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  059.驾驶员电动玻璃                             $    $               $    $  ANS021.BYTE004  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  060.驾驶员电动玻璃一键自动下                   $    $               $    $  ANS021.BYTE004  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  061.驾驶员电动玻璃一键自动上下(带防夹)         $    $               $    $  ANS021.BYTE004  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  062.远程信息处理系统类型配置                   $    $               $    $  ANS021.BYTE005  $  if(x==0x00)y=@0731;else if(x==0x01)y=@0732;else if(x==0x02)y=@0733;else if(x==0x03)y=@0734;else if(x==0x04)y=@0735;else if(x==0x05)y=@0736;else if(x==0x06)y=@0737;else if(x==0x07)y=@0738;else y=@01a9;
  $  063.汽车导航配置                               $    $               $    $  ANS021.BYTE006  $  if(x==0x00)y=@05aa;else if(x==0x01)y=@0739;else y=@01a9;
  $  064.免提配置                                   $    $               $    $  ANS021.BYTE007  $  if(x==0x00)y=@073a;else if(x==0x01)y=@073b;else y=@01a9;
  $  065.车载信息娱乐显示级别类型配置               $    $               $    $  ANS022.BYTE004  $  if(x==0x00)y=@073c;else if(x==0x03)y=@073d;else if(x==0x04)y=@073e;else if(x==0x05)y=@073f;else y=@01a9;
  $  066.DAB数字音频广播配置                        $    $               $    $  ANS022.BYTE005  $  if(x==0x00)y=@0740;else if(x==0x01)y=@0692;else y=@01a9;
  $  067.停车辅助系统类型配置                       $    $               $    $  ANS022.BYTE006  $  if(x==0x00)y=@0702;else if(x==0x01)y=@0703;else if(x==0x02)y=@0704;else if(x==0x03)y=@0705;else if(x==0x04)y=@0706;else if(x==0x05)y=@0707;else y=@01a9;
  $  068.右后下摄像头类型配置                       $    $               $    $  ANS022.BYTE007  $  if(x==0x00)y=@0708;else if(x==0x01)y=@0709;else if(x==0x02)y=@070a;else if(x==0x03)y=@070b;else if(x==0x04)y=@070c;else if(x==0x05)y=@070d;else if(x==0x06)y=@070e;else if(x==0x07)y=@070f;else if(x==0x08)y=@0710;else y=@01a9;
  $  069.方向盘带音量调节配置                       $    $               $    $  ANS023.BYTE004  $  if(x==0x00)y=@0711;else if(x==0x01)y=@0712;else if(x==0x02)y=@0713;else y=@01a9;
  $  070.汽车音频类型配置                           $    $               $    $  ANS023.BYTE005  $  if(x==0x00)y=@0714;else if(x==0x01)y=@0715;else if(x==0x02)y=@0716;else if(x==0x03)y=@0717;else y=@01a9;
  $  071.AUX端口配置                                $    $               $    $  ANS023.BYTE006  $  if(x==0x00)y=@0718;else if(x==0x01)y=@0719;else y=@01a9;
  $  072.视频输入功能配置                           $    $               $    $  ANS023.BYTE007  $  if(x==0x00)y=@071a;else if(x==0x01)y=@071b;else y=@01a9;
  $  073.USB端口类型配置                            $    $               $    $  ANS024.BYTE004  $  if(x==0x00)y=@071c;else if(x==0x01)y=@071d;else if(x==0x02)y=@071e;else y=@01a9;
  $  074.50 KHZ                                     $    $               $    $  ANS024.BYTE005  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  075.100 KHZ                                    $    $               $    $  ANS024.BYTE005  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  076.10 KHZ                                     $    $               $    $  ANS024.BYTE005  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  077.9 KHZ                                      $    $               $    $  ANS024.BYTE005  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  078.87.5-108 MHZ                               $    $               $    $  ANS024.BYTE006  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  079.531-1629 KHZ                               $    $               $    $  ANS024.BYTE006  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  080.522-1710 KHZ                               $    $               $    $  ANS024.BYTE006  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  081.530-1710 KHZ                               $    $               $    $  ANS024.BYTE006  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  082.531-1602 KHZ                               $    $               $    $  ANS024.BYTE006  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  083.扬声器类型配置                             $    $               $    $  ANS024.BYTE007  $  if(x==0x00)y=@069d;else if(x==0x01)y=@069e;else if(x==0x02)y=@069f;else if(x==0x03)y=@06a0;else if(x==0x04)y=@06a1;else y=@01a9;
  $  084.IPOD配置                                   $    $               $    $  ANS025.BYTE004  $  if(x==0x00)y=@06a2;else if(x==0x01)y=@0692;else y=@01a9;
  $  085.汽车车型年份配置                           $    $               $    $  ANS025.BYTE005  $  if(x==0x00)y=@06a3;else if(x==0x01)y=@06a4;else if(x==0x02)y=@06a5;else if(x==0x03)y=@06a6;else if(x==0x04)y=@06a7;else if(x==0x05)y=@06a8;else if(x==0x06)y=@06a9;else if(x==0x07)y=@06aa;else if(x==0x08)y=@06ab;else y=@01a9;
  $  086.车型系列配置                               $    $               $    $  ANS025.BYTE006  $  if(x==0x07)y=@0162;else y=@01a9;
  $  087.车身类型配置                               $    $               $    $  ANS025.BYTE007  $  if(x==0x00)y=@06ac;else if(x==0x01)y=@06ad;else if(x==0x02)y=@06ae;else if(x==0x03)y=@06af;else if(x==0x04)y=@06b0;else if(x==0x05)y=@06b1;else if(x==0x06)y=@06b2;else if(x==0x07)y=@06b3;else if(x==0x08)y=@00f3;else if(x==0x09)y=@06b4;else if(x==0x0A)y=@06b5;else y=@01a9;
  $  088.汽车品牌配置                               $    $               $    $  ANS026.BYTE004  $  if(x==0x00)y=@066a;else if(x==0x01)y=@066b;else if(x==0x02)y=@066c;else y=@01a9;
  $  089.汽车国家码配置                             $    $               $    $  ANS026.BYTE005  $  if(x==0x00)y=@00d8;else if(x==0x01)y=@066d;else if(x==0x02)y=@066e;else if(x==0x03)y=@066f;else if(x==0x04)y=@0670;else if(x==0x05)y=@0671;else if(x==0x06)y=@0672;else if(x==0x07)y=@0673;else if(x==0x08)y=@0674;else if(x==0x09)y=@0675;else if(x==0x0A)y=@0676;else if(x==0x0B)y=@0677;else if(x==0x0C)y=@0678;else if(x==0x0D)y=@0679;else if(x==0x0E)y=@067a;else if(x==0x0F)y=@067b;else if(x==0x10)y=@067c;else y=@01a9;
  $  090.汽车驾驶方向类型配置                       $    $               $    $  ANS026.BYTE006  $  if(x==0x00)y=@067d;else if(x==0x01)y=@067e;else y=@01a9;
  $  091.汽车发动机类型配置                         $    $               $    $  ANS026.BYTE007  $  if(x==0x00)y=@067f;else if(x==0x01)y=@0680;else if(x==0x02)y=@0681;else if(x==0x03)y=@0682;else if(x==0x04)y=@0683;else if(x==0x05)y=@0684;else if(x==0x06)y=@0685;else if(x==0x07)y=@0686;else y=@01a9;
  $  092.变速箱类型配置                             $    $               $    $  ANS027.BYTE004  $  if(x==0x00)y=@0687;else if(x==0x01)y=@0688;else if(x==0x02)y=@0689;else if(x==0x03)y=@068a;else if(x==0x04)y=@068b;else if(x==0x05)y=@068c;else if(x==0x06)y=@068d;else if(x==0x07)y=@068e;else if(x==0x08)y=@068f;else y=@01a9;
  $  093.汽车尾门操作类型配置                       $    $               $    $  ANS027.BYTE005  $  if(x==0x00)y=@0166;else if(x==0x01)y=@0167;else if(x==0x02)y=@0690;else if(x==0x03)y=@0691;else y=@01a9;
  $  094.自动紧急呼叫配置                           $    $               $    $  ANS028.BYTE005  $  if(x==0x00)y=@043b;else if(x==0x01)y=@0692;else y=@01a9;
  $  095.汽车天窗类型配置                           $    $               $    $  ANS028.BYTE006  $  if(x==0x00)y=@0693;else if(x==0x01)y=@0694;else if(x==0x02)y=@0695;else y=@01a9;
  $  096.混合动力类型配置                           $    $               $    $  ANS028.BYTE007  $  if(x==0x00)y=@06cc;else if(x==0x01)y=@06cd;else if(x==0x02)y=@06ce;else if(x==0x03)y=@06cf;else y=@01a9;
  $  097.ECO主动经济驾驶模式配置                    $    $               $    $  ANS029.BYTE004  $  if(x==0x00)y=@00b2;else if(x==0x01)y=@00b1;else y=@01a9;
  $  098.MIC麦克风类型配置                          $    $               $    $  ANS029.BYTE006  $  if(x==0x00)y=@06d0;else if(x==0x01)y=@06d1;else if(x==0x02)y=@06d2;else y=@01a9;
  $  099.光传感器配置                               $    $               $    $  ANS029.BYTE007  $  if(x==0x00)y=@06d3;else if(x==0x01)y=@06d4;else y=@01a9;
  $  100.车型配置                                   $    $               $    $  ANS030.BYTE005  $  if(x==0x7F)y=@06d5;else if(x==0x80)y=@058e;else if(x==0x81)y=@0162;else y=@01a9;
  $  101.变量配置                                   $    $               $    $  ANS030.BYTE006  $  if(x==0x98)y=@06d6;else if(x==0x99)y=@06d7;else y=@01a9;
  $  102.GPS芯片配置                                $    $               $    $  ANS030.BYTE007  $  if(x==0x00)y=@06d8;else if(x==0x01)y=@06d9;else y=@01a9;
  $  103.语音识别配置                               $    $               $    $  ANS031.BYTE004  $  if(x==0x00)y=@05b0;else if(x==0x01)y=@06da;else y=@01a9;
  $  104.ESP/ABS节点配置                            $    $               $    $  ANS031.BYTE005  $  if(x==0x00)y=@06b6;else if(x==0x01)y=@06b7;else if(x==0x02)y=@06b8;else y=@01a9;
  $  105.SAS配置                                    $    $               $    $  ANS031.BYTE006  $  if(x==0x00)y=@06b9;else if(x==0x01)y=@06ba;else y=@01a9;
  $  106.PEPS配置                                   $    $               $    $  ANS031.BYTE007  $  if(x==0x00)y=@06bb;else if(x==0x01)y=@003d;else y=@01a9;
  $  107.WIFI配置                                   $    $               $    $  ANS032.BYTE004  $  if(x==0x00)y=@06bc;else if(x==0x01)y=@06bd;else y=@01a9;
  $  108.轴距配置                                   $    $               $    $  ANS032.BYTE005  $  if(x==0x00)y=@06be;else if(x==0x01)y=@06bf;else y=@01a9;
  $  109.底盘高度配置                               $    $               $    $  ANS032.BYTE006  $  if(x==0x00)y=@06c0;else if(x==0x01)y=@06c1;else y=@01a9;
  $  110.门类型配置                                 $    $               $    $  ANS033.BYTE004  $  if(x==0x00)y=@06c2;else if(x==0x01)y=@06c3;else if(x==0x02)y=@06c4;else if(x==0x03)y=@06c5;else if(x==0x04)y=@06c6;else y=@01a9;
  $  111.车辆速度                                   $    $  km/h         $    $  ANS034.BYTE004  $  y=(x1*256+x2)*0.05625;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
