
    车型ID：1037

    模拟：协议模拟-->1037

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:701 02 10 01 00 00 00 00 00       $~  ANS000:781 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:701 02 3E 80 00 00 00 00 00       $!  ANS000:781 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:701 03 19 02 09 00 00 00 00       $#  ANS000:781 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/37000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:701 04 14 FF FF FF 00 00 00       $$  ANS000:781 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:701 03 22 F1 A0 00 00 00 00       $%  ANS000:781 03 22 F1 A0 00 00 00 00
  $%  REQ001:701 03 22 F1 83 00 00 00 00       $%  ANS001:781 03 22 F1 83 00 00 00 00
  $%  REQ002:701 03 22 F1 91 00 00 00 00       $%  ANS002:781 03 22 F1 91 00 00 00 00
  $%  REQ003:701 03 22 F1 A2 00 00 00 00       $%  ANS003:781 03 22 F1 A2 00 00 00 00
  $%  REQ004:701 03 22 F1 87 00 00 00 00       $%  ANS004:781 03 22 F1 87 00 00 00 00
  $%  REQ005:701 03 22 F1 10 00 00 00 00       $%  ANS005:781 03 22 F1 10 00 00 00 00
  $%  REQ006:701 03 22 F1 92 00 00 00 00       $%  ANS006:781 03 22 F1 92 00 00 00 00
  $%  REQ007:701 03 22 F1 8C 00 00 00 00       $%  ANS007:781 03 22 F1 8C 00 00 00 00
  $%  REQ008:701 03 22 F1 94 00 00 00 00       $%  ANS008:781 03 22 F1 94 00 00 00 00
  $%  REQ009:701 03 22 F1 8A 00 00 00 00       $%  ANS009:781 03 22 F1 8A 00 00 00 00
  $%  REQ010:701 03 22 F1 90 00 00 00 00       $%  ANS010:781 03 22 F1 90 00 00 00 00
  $%  REQ011:701 03 22 F1 A8 00 00 00 00       $%  ANS011:781 03 22 F1 A8 00 00 00 00
  $%  REQ012:701 03 22 F1 8B 00 00 00 00       $%  ANS012:781 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元网络文件参考号:          $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号(上次):            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  006:测试工具参考号(上次):            $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  007:里程读数(上次)KM:                $%    $%  ANS005.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  008:保留状态:                        $%    $%  ANS005.BYTE018  $%  HEX(X1,X2);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商识别码:                $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:VIN码:                           $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  015:电控单元制造日期:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:701 03 22 C1 04 00 00 00 00       $  ANS000:781 03 22 C1 04 00 00 00 00
  $  REQ001:701 03 22 E0 21 00 00 00 00       $  ANS001:781 03 22 E0 21 00 00 00 00
  $  REQ002:701 03 22 C1 01 00 00 00 00       $  ANS002:781 03 22 C1 01 00 00 00 00
  $  REQ003:701 03 22 B5 10 00 00 00 00       $  ANS003:781 03 22 B5 10 00 00 00 00
  $  REQ004:701 03 22 E0 11 00 00 00 00       $  ANS004:781 03 22 E0 11 00 00 00 00
  $  REQ005:701 03 22 E0 03 00 00 00 00       $  ANS005:781 03 22 E0 03 00 00 00 00
  $  REQ006:701 03 22 D3 02 00 00 00 00       $  ANS006:781 03 22 D3 02 00 00 00 00
  $  REQ007:701 03 22 E0 1A 00 00 00 00       $  ANS007:781 03 22 E0 1A 00 00 00 00
  $  REQ008:701 03 22 C1 06 00 00 00 00       $  ANS008:781 03 22 C1 06 00 00 00 00
  $  REQ009:701 03 22 D1 01 00 00 00 00       $  ANS009:781 03 22 D1 01 00 00 00 00
  $  REQ010:701 03 22 D1 02 00 00 00 00       $  ANS010:781 03 22 D1 02 00 00 00 00
  $  REQ011:701 03 22 D1 03 00 00 00 00       $  ANS011:781 03 22 D1 03 00 00 00 00
  $  REQ012:701 03 22 D1 04 00 00 00 00       $  ANS012:781 03 22 D1 04 00 00 00 00
  $  REQ013:701 03 22 D1 05 00 00 00 00       $  ANS013:781 03 22 D1 05 00 00 00 00
  $  REQ014:701 03 22 D1 06 00 00 00 00       $  ANS014:781 03 22 D1 06 00 00 00 00
  $  REQ015:701 03 22 D1 16 00 00 00 00       $  ANS015:781 03 22 D1 16 00 00 00 00
  $  REQ016:701 03 22 D1 17 00 00 00 00       $  ANS016:781 03 22 D1 17 00 00 00 00
  $  REQ017:701 03 22 E0 1E 00 00 00 00       $  ANS017:781 03 22 E0 1E 00 00 00 00
  $  REQ018:701 03 22 E0 20 00 00 00 00       $  ANS018:781 03 22 E0 20 00 00 00 00
  $  REQ019:701 03 22 CF 10 00 00 00 00       $  ANS019:781 03 22 CF 10 00 00 00 00
  $  REQ020:701 03 22 E0 18 00 00 00 00       $  ANS020:781 03 22 E0 18 00 00 00 00
  $  REQ021:701 03 22 E0 02 00 00 00 00       $  ANS021:781 03 22 E0 02 00 00 00 00
  $  REQ022:701 03 22 E0 0B 00 00 00 00       $  ANS022:781 03 22 E0 0B 00 00 00 00
  $  REQ023:701 03 22 D3 01 00 00 00 00       $  ANS023:781 03 22 D3 01 00 00 00 00
  $  REQ024:701 03 22 E0 1F 00 00 00 00       $  ANS024:781 03 22 E0 1F 00 00 00 00
  $  REQ025:701 03 22 E0 1D 00 00 00 00       $  ANS025:781 03 22 E0 1D 00 00 00 00
  $  REQ026:701 03 22 C1 08 00 00 00 00       $  ANS026:781 03 22 C1 08 00 00 00 00
  $  REQ027:701 03 22 E0 04 00 00 00 00       $  ANS027:781 03 22 E0 04 00 00 00 00
  $  REQ028:701 03 22 E0 05 00 00 00 00       $  ANS028:781 03 22 E0 05 00 00 00 00
  $  REQ029:701 03 22 E0 06 00 00 00 00       $  ANS029:781 03 22 E0 06 00 00 00 00
  $  REQ030:701 03 22 E0 07 00 00 00 00       $  ANS030:781 03 22 E0 07 00 00 00 00
  $  REQ031:701 03 22 E0 08 00 00 00 00       $  ANS031:781 03 22 E0 08 00 00 00 00
  $  REQ032:701 03 22 E0 09 00 00 00 00       $  ANS032:781 03 22 E0 09 00 00 00 00
  $  REQ033:701 03 22 E0 0C 00 00 00 00       $  ANS033:781 03 22 E0 0C 00 00 00 00
  $  REQ034:701 03 22 D3 05 00 00 00 00       $  ANS034:781 03 22 D3 05 00 00 00 00
  $  REQ035:701 03 22 C1 02 00 00 00 00       $  ANS035:781 03 22 C1 02 00 00 00 00
  $  REQ036:701 03 22 E0 1B 00 00 00 00       $  ANS036:781 03 22 E0 1B 00 00 00 00
  $  REQ037:701 03 22 C1 05 00 00 00 00       $  ANS037:781 03 22 C1 05 00 00 00 00
  $  REQ038:701 03 22 E0 15 00 00 00 00       $  ANS038:781 03 22 E0 15 00 00 00 00
  $  REQ039:701 03 22 E0 16 00 00 00 00       $  ANS039:781 03 22 E0 16 00 00 00 00
  $  REQ040:701 03 22 D3 04 00 00 00 00       $  ANS040:781 03 22 D3 04 00 00 00 00
  $  REQ041:701 03 22 E0 0E 00 00 00 00       $  ANS041:781 03 22 E0 0E 00 00 00 00
  $  REQ042:701 03 22 E0 10 00 00 00 00       $  ANS042:781 03 22 E0 10 00 00 00 00
  $  REQ043:701 03 22 E0 1C 00 00 00 00       $  ANS043:781 03 22 E0 1C 00 00 00 00
  $  REQ044:701 03 22 D3 03 00 00 00 00       $  ANS044:781 03 22 D3 03 00 00 00 00
  $  REQ045:701 03 22 E0 19 00 00 00 00       $  ANS045:781 03 22 E0 19 00 00 00 00
  $  REQ046:701 03 22 D1 31 00 00 00 00       $  ANS046:781 03 22 D1 31 00 00 00 00
  $  REQ047:701 03 22 E2 11 00 00 00 00       $  ANS047:781 03 22 E2 11 00 00 00 00
  $  REQ048:701 03 22 C1 07 00 00 00 00       $  ANS048:781 03 22 C1 07 00 00 00 00
  $  REQ049:701 03 22 E0 0D 00 00 00 00       $  ANS049:781 03 22 E0 0D 00 00 00 00
  $  REQ050:701 03 22 E0 17 00 00 00 00       $  ANS050:781 03 22 E0 17 00 00 00 00
  $  REQ051:701 03 22 C1 03 00 00 00 00       $  ANS051:781 03 22 C1 03 00 00 00 00
  $  REQ052:701 03 22 E0 0A 00 00 00 00       $  ANS052:781 03 22 E0 0A 00 00 00 00

  $  000.车速自动闭锁配置                              $    $           $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  001.后风窗和后视镜加热配置                        $    $           $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  002.RKE(遥控车门开关)主驾单独解锁配置             $    $           $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  003.PKE(无钥匙进入系统)主驾单独解锁配置           $    $           $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  004.后备箱配置                                    $    $           $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  005.P档解锁配置                                   $    $           $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  006.语音控制天窗                                  $    $           $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  007.P档解锁输出配置                               $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0520;else y=@051f;
  $  008.节能/运动开关                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  009.自适应巡航开关                                $    $           $    $  ANS000.BYTE005  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  010.车窗一键关                                    $    $           $    $  ANS000.BYTE005  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  011.车窗一键开                                    $    $           $    $  ANS000.BYTE005  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  012.天窗一键关                                    $    $           $    $  ANS000.BYTE005  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  013.天窗一键开                                    $    $           $    $  ANS000.BYTE005  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  014.后视镜折叠                                    $    $           $    $  ANS000.BYTE005  $  if((x&0x03)==0)y=@000f;else if((x&0x03)==0x01)y=@0521;else if((x&0x03)==0x02)y=@0522;else y=@0004;
  $  015.锁电机热保护时间设置                          $    $  s        $    $  ANS000.BYTE006  $  y=x;
  $  016.刹车标定偏差设置                              $    $  %        $    $  ANS000.BYTE007  $  y=x;
  $  017.自适应巡航开关                                $    $           $    $  ANS001.BYTE004  $  y=x1*256+x2;
  $  018.配RKE(遥控车门开关)数量设置                   $    $           $    $  ANS002.BYTE004  $  if((x&0xF0)==0x10)y=@04d3;else if((x&0xF0)==0x20)y=@0169;else if((x&0xF0)==0x30)y=@016b;else if((x&0xF0)==0x40)y=@0523;else y=@01a9;
  $  019.负载管理模式设置                              $    $           $    $  ANS002.BYTE004  $  if((x&0x0C)==0x00)y=@01d1;else if((x&0x0C)==0x04)y=@0524;else if((x&0x0C)==0x08)y=@0525;else y=@01a9;
  $  020.生产运行周期设置                              $    $           $    $  ANS002.BYTE004  $  if((x&0x03)==0x00)y=@050b;else if((x&0x03)==0x01)y=@050c;else if((x&0x03)==0x02)y=@050d;else if((x&0x03)==0x03)y=@050e;
  $  021.TCU配置                                       $    $           $    $  ANS002.BYTE005  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  022.PEPS配置                                      $    $           $    $  ANS002.BYTE005  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  023.车辆防盗器配置                                $    $           $    $  ANS002.BYTE005  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  024.左舵或右舵设置                                $    $           $    $  ANS002.BYTE005  $  if((x&0x10)==0x10)y=@050f;else y=@0510;
  $  025.车辆类型配置                                  $    $           $    $  ANS002.BYTE005  $  if((x&0x0F)==0x00)y=@062a;elseif((x&0x0F)==0x01)y=@0512; else y=@01a9;
  $  026.ESP设置                                       $    $           $    $  ANS002.BYTE006  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  027.IPK设置                                       $    $           $    $  ANS002.BYTE006  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  028.EMS配置                                       $    $           $    $  ANS002.BYTE006  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  029.SAS配置                                       $    $           $    $  ANS002.BYTE006  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  030.SRS安全气囊配置                               $    $           $    $  ANS002.BYTE006  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  031.FICM配置                                      $    $           $    $  ANS002.BYTE006  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  032.电动尾门配置                                  $    $           $    $  ANS002.BYTE006  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  033.左后门窗电机配置                              $    $           $    $  ANS002.BYTE007  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  034.左后门窗电机配置                              $    $           $    $  ANS002.BYTE007  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  035.右前门窗电机配置                              $    $           $    $  ANS002.BYTE007  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  036.左前门窗电机配置                              $    $           $    $  ANS002.BYTE007  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  037.遮阳帘配置                                    $    $           $    $  ANS002.BYTE007  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  038.天窗配置                                      $    $           $    $  ANS002.BYTE007  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  039.DDD(疲劳驾驶检测)配置                         $    $           $    $  ANS002.BYTE007  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  040.钥匙插入信号                                  $    $           $    $  ANS003.BYTE004  $  if(x==0x00)y=@0495;else if(x==0x01) y=@0507; else y=@01a9;
  $  041.制动5V反馈值                                  $    $           $    $  ANS004.BYTE004  $  y=(x1*256)+x2;
  $  042.组合灯光开关输入                              $    $           $    $  ANS005.BYTE004  $  if(x==0x00)y=@062b;else if(x==0x01)y=@062c;;else if(x==0x02)y=@0513;else if(x==0x03)y=@000f;else y=@01a9;
  $  043.变速箱档位信号                                $    $           $    $  ANS006.BYTE004  $  if((x&0x0F)==0x00)y=@0514;else if((x&0x0F)==0x01)y=@00b4;else if((x&0x0F)==0x02)y=@0388;else if((x&0x0F)==0x03)y=@0515;else if((x&0x0F)==0x04)y=@0516;else if((x&0x0F)==0x05)y=@0517;else if((x&0x0F)==0x06)y=@0518;else if((x&0x0F)==0x07)y=@0519;else if((x&0x0F)==0x08)y=@051a;else if((x&0x0F)==0x09)y=@051b;else if((x&0x0F)==0x0A)y=@051c;else if((x&0x0F)==0x0B)y=@051d;else if((x&0x0F)==0x0F)y=@051e;else y=@01a9;
  $  044.当前已学习遥控钥匙数量                        $    $           $    $  ANS007.BYTE004  $  y=x;
  $  045.疲劳驾驶参数设置                              $    $           $    $  ANS008.BYTE004  $  y=x;
  $  046.疲劳驾驶性能调节                              $    $           $    $  ANS008.BYTE005  $  y=(x1*256+x2);
  $  047.近光灯开关输入                                $    $           $    $  ANS009.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  048.驾驶员门开关                                  $    $           $    $  ANS009.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  049.右前门开关输入                                $    $           $    $  ANS009.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  050.后视镜折叠设置                                $    $           $    $  ANS009.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  051.远光灯开关输入                                $    $           $    $  ANS009.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  052.前雨刮归位信号输入                            $    $           $    $  ANS009.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  053.危险警报灯开关输入                            $    $           $    $  ANS009.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  054.位置灯开关输入                                $    $           $    $  ANS009.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  055.后窗和后视镜加热开关输入                      $    $           $    $  ANS010.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  056.后雾灯开关                                    $    $           $    $  ANS010.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  057.主驾门解锁/闭锁反馈输入                       $    $           $    $  ANS010.BYTE004  $  if((x&0x20)==0x20)y=@0404;else y=@0055;
  $  058.尾门开关                                      $    $           $    $  ANS010.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  059.右转向灯开关输入                              $    $           $    $  ANS010.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  060.前雨刮低速开关输入                            $    $           $    $  ANS011.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  061.副驾驶门解锁/闭锁反馈输入                     $    $           $    $  ANS011.BYTE004  $  if((x&0x40)==0x40)y=@0404;else y=@0055;
  $  062.左后门开关状态输入                            $    $           $    $  ANS011.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  063.右后门开关状态输入                            $    $           $    $  ANS011.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  064.前雾灯开关输入                                $    $           $    $  ANS011.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  065.钥匙插入信号输入                              $    $           $    $  ANS011.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  066.油箱盖开关输入                                $    $           $    $  ANS011.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  067.前雨刮高速输入                                $    $           $    $  ANS011.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  068.后雨刮器开关输入                              $    $           $    $  ANS012.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  069.后洗涤开关输入                                $    $           $    $  ANS012.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  070.前洗涤开关输入                                $    $           $    $  ANS012.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  071.KLR输入                                       $    $           $    $  ANS013.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  072.KL15点火开关                                  $    $           $    $  ANS013.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  073.倒车灯开关输入                                $    $           $    $  ANS013.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  074.中控锁闭锁开关输入                            $    $           $    $  ANS014.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  075.刹车灯开关输入                                $    $           $    $  ANS014.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  076.远光灯开关输入                                $    $           $    $  ANS014.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  077.左转向灯开关输入                              $    $           $    $  ANS014.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  078.中控锁解锁开关输入                            $    $           $    $  ANS014.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  079.中控闭锁输出                                  $    $           $    $  ANS015.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  080.油箱盖                                        $    $           $    $  ANS015.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  081.中控解锁输出                                  $    $           $    $  ANS015.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  082.主驾驶单独解锁                                $    $           $    $  ANS015.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  083.前洗涤输出                                    $    $           $    $  ANS015.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  084.后备箱解锁                                    $    $           $    $  ANS015.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  085.后雨刮输出                                    $    $           $    $  ANS015.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  086.P档解锁(高配，中高配)                         $    $           $    $  ANS015.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  087.近光灯继电器驱动输出                          $    $           $    $  ANS015.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  088.远光灯继电器                                  $    $           $    $  ANS015.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  089.左前雾灯继电器驱动输出                        $    $           $    $  ANS015.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  090.后窗和后视镜加热继电器驱动输出                $    $           $    $  ANS015.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  091.喇叭继电器                                    $    $           $    $  ANS015.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  092.前雨刮低速继电器驱动输出                      $    $           $    $  ANS015.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  093.前雨刮高速继电器驱动输出                      $    $           $    $  ANS015.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  094.右前雾灯继电器驱动输出                        $    $           $    $  ANS015.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  095.倒车灯输出                                    $    $           $    $  ANS016.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  096.左日间行车灯输出                              $    $           $    $  ANS016.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  097.右日间行车灯输出                              $    $           $    $  ANS016.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  098.后视镜折叠                                    $    $           $    $  ANS016.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  099.后视镜展开                                    $    $           $    $  ANS016.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  100.RAP/ACC继电器输出                             $    $           $    $  ANS016.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  101.KL15 IG1驱动器输出                            $    $           $    $  ANS016.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  102.ACC唤醒输出                                   $    $           $    $  ANS016.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  103.高位制动灯输出                                $    $           $    $  ANS016.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  104.刹车灯                                        $    $           $    $  ANS016.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  105.后洗涤输出                                    $    $           $    $  ANS016.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  106.位置灯输出                                    $    $           $    $  ANS016.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  107.后雾灯输出                                    $    $           $    $  ANS016.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  108.左转向灯输出                                  $    $           $    $  ANS016.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  109.右转向灯输出                                  $    $           $    $  ANS016.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  110.车身防盗状态指示灯                            $    $           $    $  ANS016.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  111.PWM(脉宽调制)调光                             $    $           $    $  ANS017.BYTE004  $  y=x;
  $  112.ECO/SPORT输入                                 $    $           $    $  ANS018.BYTE004  $  y=x1*256+x2;
  $  113.ECU PIN(在IMMO(防盗系统)锁定之前)             $    $           $    $  ANS019.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  114.发动机运行状态                                $    $           $    $  ANS020.BYTE004  $  if(x==0x00)y=@018e;else if(x==0x01)y=@0011;else y=@01a9;
  $  115.前雨刮间歇档位调节输入                        $    $           $    $  ANS021.BYTE004  $  if(((x1*256+x2)>=0)&&((x1*256+x2)<=12))y=@04f4; else if(((x1*256+x2)>=201)&&((x1*256+x2)<=249))y=@04f5; else if(((x1*256+x2)>=335)&&((x1*256+x2)<=421))y=@04f6; else if(((x1*256+x2)>=449)&&((x1*256+x2)<=545))y=@04f7; else if(((x1*256+x2)>=549)&&((x1*256+x2)<=629))y=@04f8; else y=@01a9;
  $  116.前雾灯输入值                                  $    $           $    $  ANS022.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  117.IMMO(防盗系统)锁定状态                        $    $           $    $  ANS023.BYTE004  $  if((x&0x80)==0x80)y=@0055;else y=@0404;
  $  118.PIN写入状态                                   $    $           $    $  ANS023.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@02ac;
  $  119.SK写入状态                                    $    $           $    $  ANS023.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@02ac;
  $  120.VIN码是否写入                                 $    $           $    $  ANS023.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@02ac;
  $  121.钥匙数量                                      $    $           $    $  ANS023.BYTE004  $  y=(x&0x0F);
  $  122.点火开关环形背光                              $    $           $    $  ANS024.BYTE004  $  y=x;
  $  123.点火开关状态                                  $    $           $    $  ANS025.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0507;else if(x==0x02)y=@0464;else if(x==0x03)y=@009e;else y=@01a9;
  $  124.钥匙插入状态                                  $    $           $    $  ANS025.BYTE005  $  if(x==0x00)y=@0495;else if(x==0x01) y=@0507; else y=@01a9;
  $  125.出厂照我回家功能外灯延时设置                  $    $           $    $  ANS026.BYTE004  $  if((x&0xC0)==0x00)y=@04d4;else if((x&0xC0)==0x40)y=@04fd;else if((x&0xC0)==0x80)y=@0502; else y=@0503;
  $  126.出厂寻车功能反馈方式设置                      $    $           $    $  ANS026.BYTE004  $  if((x&0x20)==0x20)y=@0505;else y=@0506;
  $  127.出厂熄火自动解锁配置                          $    $           $    $  ANS026.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  128.出厂氛围灯                                    $    $           $    $  ANS026.BYTE004  $  if((x&0x0C)==0x00)y=@0112;else if((x&0x0C)==0x08)y=@050a;else y=@01a9;
  $  129.出厂RKE(遥控车门开关)主驾单独解锁配置         $    $           $    $  ANS026.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  130.出厂PKE(无钥匙进入系统)主驾单独解锁配置       $    $           $    $  ANS026.BYTE004  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  131.出厂照我回家功能配置                          $    $           $    $  ANS026.BYTE005  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  132.出厂车速自动闭锁配置                          $    $           $    $  ANS026.BYTE005  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  133.出厂闭锁反馈方式配置                          $    $           $    $  ANS026.BYTE005  $  if((x&0x03)==0x00)y=@0504;else if((x&0x03)==0x01)y=@000f;else if((x&0x03)==0x02)y=@0505;else y=@01a9;
  $  134.出厂照地灯工作时间                            $    $           $    $  ANS026.BYTE006  $  if((x&0x60)==0x00)y=@04d4;else if((x&0x60)==0x20)y=@04fd;else if((x&0x60)==0x40)y=@0502; else y=@0503;
  $  135.天窗一键开出厂设置                            $    $           $    $  ANS026.BYTE006  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  136.出厂后视镜折叠                                $    $           $    $  ANS026.BYTE006  $  if((x&0x03)==0)y=@000f;else if((x&0x03)==0x01)y=@0521;else if((x&0x03)==0x02)y=@0522;else y=@0004;
  $  137.启动停止开关输入                              $    $           $    $  ANS027.BYTE004  $  if(x==0x01)y=@01db;else y=@01a9;
  $  138.前舱盖开关输入                                $    $           $    $  ANS028.BYTE004  $  if(x==0x01)y=@01da;else if(x==0x02)y=@01db;else y=@01a9;
  $  139.刹车踏板输入                                  $    $           $    $  ANS029.BYTE004  $  y=(x1*256)+x2;
  $  140.换挡                                          $    $           $    $  ANS030.BYTE004  $  if(x==0x01)y=@0508;else y=@01a9;
  $  141.背光灯开关输入                                $    $           $    $  ANS031.BYTE004  $  if(x==0x02)y=@0509;else if(x==0x03)y=@000f;else y=@01a9;
  $  142.点火开关                                      $    $           $    $  ANS032.BYTE004  $  if((x1*256+x2)<=10)y=@000f;else y=@01a9;
  $  143.碰撞信号                                      $    $           $    $  ANS033.BYTE004  $  y=x;
  $  144.天窗与遮阳使能状态                            $    $           $    $  ANS034.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  145.天窗舒适打开命令                              $    $           $    $  ANS034.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  146.遮阳舒适打开命令                              $    $           $    $  ANS034.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  147.天窗舒适关闭命令                              $    $           $    $  ANS034.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  148.遮阳舒适关闭命令                              $    $           $    $  ANS034.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  149.天窗初始化命令                                $    $           $    $  ANS034.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  150.遮阳初始化命令                                $    $           $    $  ANS034.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  151.车窗使能状态                                  $    $           $    $  ANS034.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  152.左前车窗自动上升                              $    $           $    $  ANS034.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  153.左前车窗手动下降                              $    $           $    $  ANS034.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  154.右前车窗自动上升                              $    $           $    $  ANS034.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  155.右前车窗手动下降                              $    $           $    $  ANS034.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  156.左后车窗自动上升                              $    $           $    $  ANS034.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  157.左后车窗手动下降                              $    $           $    $  ANS034.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  158.右后车窗自动上升                              $    $           $    $  ANS034.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  159.右后车窗手动下降                              $    $           $    $  ANS034.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  160.天窗位置                                      $    $           $    $  ANS034.BYTE006  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  161.天窗状态                                      $    $           $    $  ANS034.BYTE007  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  162.天窗自学习状态                                $    $           $    $  ANS034.BYTE007  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  163.天窗过热保护                                  $    $           $    $  ANS034.BYTE007  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  164.天窗功能中止                                  $    $           $    $  ANS034.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  165.遮阳自学习状态                                $    $           $    $  ANS034.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  166.遮阳过热保护                                  $    $           $    $  ANS034.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  167.遮阳功能中止                                  $    $           $    $  ANS034.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  168.遮阳位置                                      $    $           $    $  ANS034.BYTE008  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  169.左前电源车窗打开完成                          $    $           $    $  ANS034.BYTE009  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  170.左前电源车窗关闭完成                          $    $           $    $  ANS034.BYTE009  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  171.左前电源车窗防夹状态                          $    $           $    $  ANS034.BYTE009  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  172.左前电源车窗手动上升转换线连接                $    $           $    $  ANS034.BYTE009  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  173.左前电源车窗手动下降转换线连接                $    $           $    $  ANS034.BYTE009  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  174.左前电源车窗快线连接                          $    $           $    $  ANS034.BYTE009  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  175.左前电源车窗过热保护                          $    $           $    $  ANS034.BYTE009  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  176.右前电源车窗打开完成                          $    $           $    $  ANS034.BYTE010  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  177.右前电源车窗关闭完成                          $    $           $    $  ANS034.BYTE010  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  178.右前电源车窗防夹状态                          $    $           $    $  ANS034.BYTE010  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  179.右前电源车窗手动上升转换线连接                $    $           $    $  ANS034.BYTE010  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  180.右前电源车窗手动下降转换线连接                $    $           $    $  ANS034.BYTE010  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  181.右前电源车窗快线连接                          $    $           $    $  ANS034.BYTE010  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  182.右前电源车窗过热保护                          $    $           $    $  ANS034.BYTE010  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  183.左后电源车窗打开完成                          $    $           $    $  ANS034.BYTE011  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  184.左后电源车窗关闭完成                          $    $           $    $  ANS034.BYTE011  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  185.左后电源车窗防夹状态                          $    $           $    $  ANS034.BYTE011  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  186.左后电源车窗手动上升转换线连接                $    $           $    $  ANS034.BYTE011  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  187.左后电源车窗手动下降转换线连接                $    $           $    $  ANS034.BYTE011  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  188.左后电源车窗快线连接                          $    $           $    $  ANS034.BYTE011  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  189.左后电源车窗过热保护                          $    $           $    $  ANS034.BYTE011  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  190.右后电源车窗打开完成                          $    $           $    $  ANS034.BYTE012  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  191.右后电源车窗关闭完成                          $    $           $    $  ANS034.BYTE012  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  192.右后电源车窗防夹状态                          $    $           $    $  ANS034.BYTE012  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  193.右后电源车窗手动上升转换线连接                $    $           $    $  ANS034.BYTE012  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  194.右后电源车窗手动下降转换线连接                $    $           $    $  ANS034.BYTE012  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  195.右后电源车窗快线连接                          $    $           $    $  ANS034.BYTE012  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  196.右后电源车窗过热保护                          $    $           $    $  ANS034.BYTE012  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  197.前舱盖配置                                    $    $           $    $  ANS035.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  198.前雾灯配置                                    $    $           $    $  ANS035.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  199.自动灯光配置                                  $    $           $    $  ANS035.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  200.后背箱灯配置                                  $    $           $    $  ANS035.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  201.日间行车灯配置                                $    $           $    $  ANS035.BYTE004  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  202.超车灯打开方式                                $    $           $    $  ANS035.BYTE004  $  if((x&0x04)==0x04)y=@04f9;else y=@04fa;
  $  203.照地灯                                        $    $           $    $  ANS035.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  204.氛围灯点亮时间1                               $    $           $    $  ANS035.BYTE005  $  if((x&0xC0)==0x00)y=@000f;else if((x&0xC0)==0x40)y=@04fb;else if((x&0xC0)==0x80)y=@04fc; else y=@04fd;
  $  205.转向灯类型                                    $    $           $    $  ANS035.BYTE005  $  if((x&0x20)==0x20)y=@04fe;else y=@04ff;
  $  206.单色氛围灯                                    $    $           $    $  ANS035.BYTE005  $  if((x&0x18)==0x00)y=@0112;else if((x&0x18)==0x10)y=@050a;else if((x&0x18)==0x18)y=@0629;else y=@0004;
  $  207.氛围灯点亮时间                                $    $           $    $  ANS035.BYTE005  $  if((x&0x06)==0x00)y=@000f;else if((x&0x06)==0x02)y=@04fd;else if((x&0x06)==0x04)y=@0502;else y=@0503;
  $  208.转向辅助灯                                    $    $           $    $  ANS035.BYTE005  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  209.刹车灯                                        $    $           $    $  ANS035.BYTE007  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  210.照地灯工作时间                                $    $           $    $  ANS035.BYTE007  $  if((x&0x06)==0x00)y=@000f;else if((x&0x06)==0x02)y=@04fd;else if((x&0x06)==0x04)y=@0502;else y=@0503;
  $  211.背光调节开关配置                              $    $           $    $  ANS035.BYTE007  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  212.行驶里程备份                                  $    $  km       $    $  ANS036.BYTE004  $  y=(x1*256*256)+(x2*256)+x3;
  $  213.照我回家功能外灯延时设置                      $    $           $    $  ANS037.BYTE004  $  if((x&0xE0)==0x00)y=@04d4;else if((x&0xE0)==0x20)y=@04fd;else if((x&0xE0)==0x40)y=@0502;else if((x&0xE0)==0x60)y=@0503;else y=@000f;
  $  214.闭锁反馈方式设置                              $    $           $    $  ANS037.BYTE004  $  if((x&0x18)==0x00)y=@0504;else if((x&0x18)==0x08)y=@000f;else if((x&0x18)==0x10)y=@0505;else y=@0506;
  $  215.照我回家功能配置                              $    $           $    $  ANS037.BYTE004  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  216.寻车功能持续时间设置                          $    $           $    $  ANS037.BYTE004  $  if((x&0x03)==0x01)y=@000f;else if((x&0x03)==0x02)y=@04fd;else if((x&0x03)==0x03)y=@0502;else y=@0503;
  $  217.寻车功能反馈方式设置                          $    $           $    $  ANS037.BYTE005  $  if((x&0x80)==0x80)y=@0505;else y=@0506;
  $  218.解锁反馈方式设置                              $    $           $    $  ANS037.BYTE005  $  if((x&0x60)==0x00)y=@000f;else if((x&0x60)==0x20)y=@0506;else y=@01a9;
  $  219.其它自动触发方式设置                          $    $           $    $  ANS037.BYTE005  $  if((x&0x18)==0x08)y=@0495;else if((x&0x18)==0x10)y=@0526;else y=@01a9;
  $  220.熄火自动解锁设置                              $    $           $    $  ANS037.BYTE005  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  221.内顶灯高边输出                                $    $           $    $  ANS038.BYTE004  $  y=x;
  $  222.内顶灯低边输出                                $    $           $    $  ANS039.BYTE004  $  y=x;
  $  223.修正增益A                                     $    $           $    $  ANS040.BYTE004  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  224.修正增益B                                     $    $           $    $  ANS040.BYTE006  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  225.增益A                                         $    $           $    $  ANS040.BYTE008  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  226.增益B                                         $    $           $    $  ANS040.BYTE010  $  if(x1!=0x00)y=@01a9;else if(x2==0x00)y=@000f;else if(x2==0x01) y=@0028;else y=@01a9;
  $  227.后雾灯输入值                                  $    $           $    $  ANS041.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  228.后视镜折叠输入值                              $    $           $    $  ANS042.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  229.保养里程备份                                  $    $  km       $    $  ANS043.BYTE004  $  y=(x1*256*256)+(x2*256)+x3;
  $  230.SK2锁定状态                                   $    $           $    $  ANS044.BYTE004  $  if((x&0x80)==0x80)y=@0055;else y=@0404;
  $  231.SK2写入状态                                   $    $           $    $  ANS044.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  232.动力模式                                      $    $           $    $  ANS045.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0463;else if(x==0x02)y=@0028;else if(x==0x03)y=@009e;else y=@01a9;
  $  233.安全警报状态                                  $    $           $    $  ANS045.BYTE005  $  if(x==0x00)y=@0527;else if(x==0x01)y=@0528;else if(x==0x02)y=@0529;else if(x==0x03)y=@0189;else y=@01a9;
  $  234.灯光自动控制                                  $    $           $    $  ANS046.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  235.雨量传感器状态                                $    $           $    $  ANS046.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  236.软件版本日期                                  $    $           $    $  ANS047.BYTE004  $  HEX(X1,X2,X3,X4);
  $  237.TBOX请求需认证配置                            $    $           $    $  ANS048.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  238.TBOX控制窗功能配置                            $    $           $    $  ANS048.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  239.TBOX远程启动功能配置                          $    $           $    $  ANS048.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  240.TBOX远程钥匙管理功能配置                      $    $           $    $  ANS048.BYTE004  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  241.TBOX远程寻车功能设置                          $    $           $    $  ANS048.BYTE004  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  242.TBOX远程解闭锁控制功能配置                    $    $           $    $  ANS048.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  243.TBOX功能配置                                  $    $           $    $  ANS048.BYTE004  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  244.BCM允许重复发送认证的最大次数设置             $    $           $    $  ANS048.BYTE005  $  if((x&0xC0)==0x40)y=@052a;else if((x&0xC0)==0x80)y=@052b;else if((x&0xC0)==0xC0)y=@052c;else y=@052d;
  $  245.BCM允许认证失败次数                           $    $           $    $  ANS048.BYTE005  $  y=(x&0x30)/16;
  $  246.等待TBOX响应的最长时间                        $    $  s        $    $  ANS048.BYTE005  $  y=(x&0x0F);
  $  247.左转向输入值                                  $    $           $    $  ANS049.BYTE004  $  if(x==0x00)y=@01db;else if(x==0x01)y=@01db;else if(x==0x02)y=@01da;else if(x==0x03)y=@01da;else y=@01a9;
  $  248.车辆速度                                      $    $  km/h     $    $  ANS050.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  249.车速状态                                      $    $           $    $  ANS050.BYTE006  $  if(x==0x00)y=@00bb;else if(x==0x01)y=@0136;else y=@01a9;
  $  250.前雨刮自动配置                                $    $           $    $  ANS051.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  251.后雨刮配置                                    $    $           $    $  ANS051.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  252.M档硬线开路检测                               $    $           $    $  ANS051.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  253.前洗涤与前雨刮联动输出间隔设置                $    $  ms       $    $  ANS051.BYTE005  $  y=x*100;
  $  254.雨刮堵转判断时间设置                          $    $  s        $    $  ANS051.BYTE006  $  y=x;
  $  255.后洗涤与后雨刮联动输出间隔设置                $    $  ms       $    $  ANS051.BYTE007  $  y=x*100;
  $  256.点火开关5V反馈                                $    $           $    $  ANS052.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:701 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
