
    车型ID：1039

    模拟：协议模拟-->1039

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:742 02 10 01 00 00 00 00 00       $~  ANS000:7C2 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:742 02 3E 80 00 00 00 00 00       $!  ANS000:7C2 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:742 03 19 02 09 00 00 00 00       $#  ANS000:7C2 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/39000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:742 04 14 FF FF FF 00 00 00       $$  ANS000:7C2 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:742 03 22 F1 86 00 00 00 00       $%  ANS000:7C2 03 22 F1 86 00 00 00 00
  $%  REQ001:742 03 22 F1 8B 00 00 00 00       $%  ANS001:7C2 03 22 F1 8B 00 00 00 00
  $%  REQ002:742 03 22 F1 91 00 00 00 00       $%  ANS002:7C2 03 22 F1 91 00 00 00 00
  $%  REQ003:742 03 22 F1 A0 00 00 00 00       $%  ANS003:7C2 03 22 F1 A0 00 00 00 00
  $%  REQ004:742 03 22 F1 8C 00 00 00 00       $%  ANS004:7C2 03 22 F1 8C 00 00 00 00
  $%  REQ005:742 03 22 F1 87 00 00 00 00       $%  ANS005:7C2 03 22 F1 87 00 00 00 00
  $%  REQ006:742 03 22 F1 8A 00 00 00 00       $%  ANS006:7C2 03 22 F1 8A 00 00 00 00
  $%  REQ007:742 03 22 F1 90 00 00 00 00       $%  ANS007:7C2 03 22 F1 90 00 00 00 00
  $%  REQ008:742 03 22 F1 A8 00 00 00 00       $%  ANS008:7C2 03 22 F1 A8 00 00 00 00

  $%  000:当前诊断模式:              $%    $%  ANS000.BYTE004  $%  HEX(X);
  $%  001:电控单元安装日期:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6);
  $%  002:博世硬件版本号:            $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:博世软件版本号:            $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:博世电控单元序列号:        $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  005:电控单元零件号:            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:系统供应商识别码:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:VIN码:                     $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  008:车辆特征信息:              $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.输入输出数据
  $  00.输入输出数据
  $  REQ000:742 03 22 54 F0 00 00 00 00       $  ANS000:7C2 03 22 54 F0 00 00 00 00

  $  000.驾驶员安全气囊回路阻值                 $    $  ohm     $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.1;
  $  001.前排乘员安全气囊回路阻值               $    $  ohm     $    $  ANS000.BYTE006  $  y=(x1*256+x2)*0.1;
  $  002.驾驶员安全带预紧器回路阻值             $    $  ohm     $    $  ANS000.BYTE008  $  y=(x1*256+x2)*0.1;
  $  003.前排乘员安全带预紧器回路阻值           $    $  ohm     $    $  ANS000.BYTE010  $  y=(x1*256+x2)*0.1;
  $  004.驾驶员安全带二级预紧器回路阻值         $    $  ohm     $    $  ANS000.BYTE012  $  y=(x1*256+x2)*0.1;
  $  005.前排乘员安全带二级预紧器回路阻值       $    $  ohm     $    $  ANS000.BYTE014  $  y=(x1*256+x2)*0.1;
  $  006.驾驶员侧面气囊回路阻值                 $    $  ohm     $    $  ANS000.BYTE016  $  y=(x1*256+x2)*0.1;
  $  007.前排乘员侧面气囊回路阻值               $    $  ohm     $    $  ANS000.BYTE018  $  y=(x1*256+x2)*0.1;
  $  008.驾驶员膝部安全气囊回路阻值             $    $  ohm     $    $  ANS000.BYTE020  $  y=(x1*256+x2)*0.1;
  $  009.前排乘员膝部安全气囊回路阻值           $    $  ohm     $    $  ANS000.BYTE022  $  y=(x1*256+x2)*0.1;
  $  010.驾驶员侧侧气帘回路阻值                 $    $  ohm     $    $  ANS000.BYTE024  $  y=(x1*256+x2)*0.1;
  $  011.前排乘员侧侧气帘葫芦阻值               $    $  ohm     $    $  ANS000.BYTE026  $  y=(x1*256+x2)*0.1;
  $  012.前排乘员安全气囊使能开关阻值           $    $  ohm     $    $  ANS000.BYTE028  $  y=(x1*256+x2);
  $  013.驾驶员安全带锁扣阻值                   $    $  ohm     $    $  ANS000.BYTE030  $  y=(x1*256+x2);
  $  014.前排乘员安全带锁扣阻值                 $    $  ohm     $    $  ANS000.BYTE032  $  y=(x1*256+x2);
  $  015.后排驾驶员侧安全带锁扣阻值             $    $  ohm     $    $  ANS000.BYTE034  $  y=(x1*256+x2);
  $  016.后排乘员安全带锁扣阻值                 $    $  ohm     $    $  ANS000.BYTE036  $  y=(x1*256+x2);
  $  017.后排中央乘员安全带锁扣阻值             $    $  ohm     $    $  ANS000.BYTE038  $  y=(x1*256+x2);

  $)  01.安全气囊传感器电控单元配置
  $  01.安全气囊传感器电控单元配置
  $  REQ000:742 03 22 F1 01 00 00 00 00       $  ANS000:7C2 03 22 F1 01 00 00 00 00

  $  000.前排乘员安全带预紧器           $    $       $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@0445;else y=@0112;
  $  001.驾驶员安全带预紧器             $    $       $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@0445;else y=@0112;
  $  002.前排乘员安全气囊               $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  003.乘员安全气囊                   $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  004.前排乘员侧侧气帘               $    $       $    $  ANS000.BYTE005  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  005.驾驶员侧面气帘                 $    $       $    $  ANS000.BYTE005  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  006.前排乘员侧面气囊               $    $       $    $  ANS000.BYTE005  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  007.驾驶员侧面气囊                 $    $       $    $  ANS000.BYTE005  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  008.前排乘员安全带二级预紧器       $    $       $    $  ANS000.BYTE005  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  009.驾驶员安全带二级预紧器         $    $       $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  010.后排乘员安全带预紧器           $    $       $    $  ANS000.BYTE006  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  011.后排驾驶员侧安全带预紧器       $    $       $    $  ANS000.BYTE006  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  012.前排乘员侧边加速度传感器       $    $       $    $  ANS000.BYTE007  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  013.驾驶员侧边加速度传感器         $    $       $    $  ANS000.BYTE007  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  014.乘员前置传感器                 $    $       $    $  ANS000.BYTE007  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  015.驾驶员前置传感器               $    $       $    $  ANS000.BYTE007  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  016.后排乘员侧安全带锁扣           $    $       $    $  ANS000.BYTE009  $  if((x&0x40)==0x40)y=@0445;else y=@0112;
  $  017.后排中央乘员安全带锁扣         $    $       $    $  ANS000.BYTE009  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  018.后排驾驶员侧安全带锁扣         $    $       $    $  ANS000.BYTE009  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  019.前排乘员安全气囊使能开关       $    $       $    $  ANS000.BYTE009  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  020.前排乘员安全带锁扣开关         $    $       $    $  ANS000.BYTE009  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  021.驾驶员安全带锁扣开关           $    $       $    $  ANS000.BYTE009  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  022.碰撞输出(通过硬线)             $    $       $    $  ANS000.BYTE011  $  if((x&0x04)==0x04)y=@0445;else y=@0112;

  $)  02.其它数据流
  $  02.其它数据流
  $  REQ000:742 03 22 F1 86 00 00 00 00       $  ANS000:7C2 03 22 F1 86 00 00 00 00
  $  REQ001:742 03 22 64 18 00 00 00 00       $  ANS001:7C2 03 22 64 18 00 00 00 00
  $  REQ002:742 03 22 64 F1 00 00 00 00       $  ANS002:7C2 03 22 64 F1 00 00 00 00
  $  REQ003:742 03 22 64 F0 00 00 00 00       $  ANS003:7C2 03 22 64 F0 00 00 00 00

  $  000.当前诊断模式                     $    $       $    $  ANS000.BYTE004  $  if(x==0x01)y=@015f;else if(x==0x02)y=@01d0;else if(x==0x03)y=@0181;else y=@01a9;
  $  001.客户模式                         $    $       $    $  ANS001.BYTE004  $  if(x==0x00)y=@043c;else if(x==0xFF)y=@043d;else y=@01a9;
  $  002.前排乘员安全气囊使能指示灯       $    $       $    $  ANS002.BYTE004  $  if(x==0x01)y=@0584;else if(x==0x02)y=@0585;else y=@01a9;
  $  003.系统警告灯                       $    $       $    $  ANS003.BYTE004  $  if(x==0x01)y=@0584;else if(x==0x02)y=@0585;else y=@01a9;

  $)  03.碰撞记录数据1
  $  03.碰撞记录数据1
  $  REQ000:742 03 22 54 D2 00 00 00 00       $  ANS000:7C2 03 22 54 D2 00 00 00 00

  $  000.驾驶员侧气囊第一阶段的展开时间                                   $    $  ms       $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.5;
  $  001.驾驶员侧气囊第二阶段的展开时间                                   $    $  ms       $    $  ANS000.BYTE006  $  y=(x1*256+x2)*0.5;
  $  002.前排乘员侧气囊第一阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE008  $  y=(x1*256+x2)*0.5;
  $  003.前排乘员侧气囊第二阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE010  $  y=(x1*256+x2)*0.5;
  $  004.驾驶员侧侧气囊第一阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE012  $  y=(x1*256+x2)*0.5;
  $  005.驾驶员侧侧气帘/管气囊的展开时间                                  $    $  ms       $    $  ANS000.BYTE014  $  y=(x1*256+x2)*0.5;
  $  006.驾驶员预紧器(1)展开时间                                          $    $  ms       $    $  ANS000.BYTE016  $  y=(x1*256+x2)*0.5;
  $  007.前排乘员侧侧气囊第一阶段的展开时间                               $    $  ms       $    $  ANS000.BYTE018  $  y=(x1*256+x2)*0.5;
  $  008.前排乘员侧侧气帘/管气囊的展开时间                                $    $  ms       $    $  ANS000.BYTE020  $  y=(x1*256+x2)*0.5;
  $  009.前排乘员预紧器(1)展开时间                                        $    $  ms       $    $  ANS000.BYTE022  $  y=(x1*256+x2)*0.5;
  $  010.驾驶员侧膝部气囊展开时间                                         $    $           $    $  ANS000.BYTE024  $  y=(x1*256+x2)*0.5;
  $  011.前排乘员侧膝部气囊展开时间                                       $    $           $    $  ANS000.BYTE026  $  y=(x1*256+x2)*0.5;
  $  012.驾驶员预紧器(2)展开时间                                          $    $           $    $  ANS000.BYTE028  $  y=(x1*256+x2)*0.5;
  $  013.前排乘员预紧器(2)展开时间                                        $    $           $    $  ANS000.BYTE030  $  y=(x1*256+x2)*0.5;
  $  014.第二排中央位置预紧器(1)展开时间                                  $    $           $    $  ANS000.BYTE032  $  y=(x1*256+x2)*0.5;
  $  015.第二排驾驶员侧侧气囊第一阶段展开时间                             $    $           $    $  ANS000.BYTE034  $  y=(x1*256+x2)*0.5;
  $  016.第二排乘员侧侧气囊第一阶段展开时间                               $    $           $    $  ANS000.BYTE036  $  y=(x1*256+x2)*0.5;
  $  017.第二排驾驶员侧预紧器(1)展开时间                                  $    $           $    $  ANS000.BYTE038  $  y=(x1*256+x2)*0.5;
  $  018.第二排乘员侧预紧器(1)展开时间                                    $    $           $    $  ANS000.BYTE040  $  y=(x1*256+x2)*0.5;
  $  019.高压电池位激活展开时间                                           $    $           $    $  ANS000.BYTE042  $  y=(x1*256+x2)*0.5;
  $  020.第二排乘员侧安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE044  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  021.第二排乘员侧安全带锁扣开关状态                                   $    $           $    $  ANS000.BYTE044  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  022.第二中央位置安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE045  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  023.第二中央位置侧安全带锁扣开关状态                                 $    $           $    $  ANS000.BYTE045  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  024.第二驾驶员侧安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE046  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  025.第二驾驶员侧侧安全带锁扣开关状态                                 $    $           $    $  ANS000.BYTE046  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  026.前排乘员乘员位置分类配置状态                                     $    $           $    $  ANS000.BYTE047  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  027.前排乘员乘员位置分类开关状态                                     $    $           $    $  ANS000.BYTE047  $  if((x&0x0x03)==0x00)y=@0589;else y=@01a9;
  $  028.前排乘员座椅轨道位置开关配置状态                                 $    $           $    $  ANS000.BYTE048  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  029.前排乘员座椅轨道位置开关状态                                     $    $           $    $  ANS000.BYTE048  $  if((x&0x0x03)==0x00)y=@058a;else y=@01a9;
  $  030.前排乘员安全带配置状态                                           $    $           $    $  ANS000.BYTE049  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  031.前排乘员安全带开关状态                                           $    $           $    $  ANS000.BYTE049  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  032.前排乘员安全气囊抑制开关配置状态                                 $    $           $    $  ANS000.BYTE050  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  033.前排乘员安全气囊抑制开关状态                                     $    $           $    $  ANS000.BYTE050  $  if((x&0x0x03)==0x00)y=@058b;else y=@01a9;
  $  034.驾驶员侧座椅轨道位置开关配置状态                                 $    $           $    $  ANS000.BYTE051  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  035.驾驶员侧座椅轨道位置开关状态                                     $    $           $    $  ANS000.BYTE051  $  if((x&0x0x03)==0x00)y=@058a;else y=@01a9;
  $  036.驾驶员侧安全带配置状态                                           $    $           $    $  ANS000.BYTE052  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  037.驾驶员侧安全带开关状态                                           $    $           $    $  ANS000.BYTE052  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  038.车速                                                             $    $  km/h     $    $  ANS000.BYTE053  $  y=(x1*256+x2)*0.125;
  $  039.点火功能抑制线_所有点火回路低电压端                              $    $           $    $  ANS000.BYTE055  $  if((x&0x40)==0x40)y=@0586;else y=@0587;
  $  040.点火功能抑制线_所有点火回路高电压端                              $    $           $    $  ANS000.BYTE055  $  if((x&0x10)==0x10)y=@0586;else y=@0587;
  $  041.SCON(ECU内部的安全控制单元)-X向信号                              $    $           $    $  ANS000.BYTE055  $  if((x&0x08)==0x08)y=@0586;else y=@0587;
  $  042.SCON(ECU内部的安全控制单元)-Y向信号                              $    $           $    $  ANS000.BYTE055  $  if((x&0x04)==0x04)y=@0586;else y=@0587;
  $  043.SCON(ECU内部的安全控制单元)-PADS向信号                           $    $           $    $  ANS000.BYTE055  $  if((x&0x01)==0x01)y=@0586;else y=@0587;
  $  044.碰撞输出功能使能状态                                             $    $           $    $  ANS000.BYTE056  $  if(x==0x00)y=@01e5;else if(x==0x01)y=@0588;else y=@01a9;
  $  045.碰撞输出状态                                                     $    $           $    $  ANS000.BYTE057  $  if(x==0x00)y=@0188;else if(x==0x01)y=@0189;else y=@01a9;
  $  046.后排中央乘员安全带提醒灯                                         $    $           $    $  ANS000.BYTE058  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@028c;else y=@0004;
  $  047.后排乘员安全带提醒灯                                             $    $           $    $  ANS000.BYTE058  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x04)==0x01)y=@028c;else y=@0004;
  $  048.后排驾驶员侧安全带提醒灯                                         $    $           $    $  ANS000.BYTE058  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@0004;
  $  049.前排乘员安全带提醒灯                                             $    $           $    $  ANS000.BYTE059  $  if((x&0xC0)==0x00)y=@028b;else if((x&0xC0)==0x40)y=@028c;else y=@0004;
  $  050.驾驶员安全提醒灯                                                 $    $           $    $  ANS000.BYTE059  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@028c;else y=@0004;
  $  051.前排乘员安全气囊使能指示灯                                       $    $           $    $  ANS000.BYTE059  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x04)==0x01)y=@028c;else y=@0004;
  $  052.系统警告灯                                                       $    $           $    $  ANS000.BYTE059  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@0004;
  $  053.前排乘员外围压力传感器                                           $    $           $    $  ANS000.BYTE060  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  054.驾驶员前外围压力传感器                                           $    $           $    $  ANS000.BYTE060  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  055.中间乘员加速度传感器                                             $    $           $    $  ANS000.BYTE061  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  056.驾驶员中置加速度传感器                                           $    $           $    $  ANS000.BYTE061  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  057.前排乘员侧边加速度传感器                                         $    $           $    $  ANS000.BYTE061  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  058.驾驶员侧边加速度传感器                                           $    $           $    $  ANS000.BYTE061  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  059.中央前置传感器                                                   $    $           $    $  ANS000.BYTE062  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  060.乘员前置传感器                                                   $    $           $    $  ANS000.BYTE062  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  061.驾驶员前置传感器                                                 $    $           $    $  ANS000.BYTE062  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  062.SMI700(高)X                                                      $    $           $    $  ANS000.BYTE062  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  063.合理性传感器通道2                                                $    $           $    $  ANS000.BYTE063  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  064.合理性传感器通道1                                                $    $           $    $  ANS000.BYTE063  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  065.中央传感器通道2                                                  $    $           $    $  ANS000.BYTE063  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  066.中央传感器通道1                                                  $    $           $    $  ANS000.BYTE063  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  067.预紧器(2)，展开，点火电流持续时间，乘员位                        $    $  ms       $    $  ANS000.BYTE064  $  y=x*0.025;
  $  068.预紧器(2)，展开，点火电流持续时间，驾驶员位                      $    $  ms       $    $  ANS000.BYTE065  $  y=x*0.025;
  $  069.高压电池未激活，展开，点火电流持续时间(1.2A)                     $    $  ms       $    $  ANS000.BYTE066  $  y=x*0.025;
  $  070.膝部气囊展开，点火电流持续时间(1.2A)，前排乘员                   $    $  ms       $    $  ANS000.BYTE067  $  y=x*0.025;
  $  071.膝部气囊展开，点火电流持续时间(1.2A)，驾驶员位                   $    $  ms       $    $  ANS000.BYTE068  $  y=x*0.025;
  $  072.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排中间位置          $    $  ms       $    $  ANS000.BYTE069  $  y=x*0.025;
  $  073.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排乘员侧            $    $  ms       $    $  ANS000.BYTE070  $  y=x*0.025;
  $  074.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排驾驶员侧          $    $  ms       $    $  ANS000.BYTE071  $  y=x*0.025;
  $  075.预紧器(1)，展开，点火电流持续时间(1.2A)，前排乘员                $    $  ms       $    $  ANS000.BYTE072  $  y=x*0.025;
  $  076.预紧器(1)，展开，点火电流持续时间(1.2A)，驾驶员位                $    $  ms       $    $  ANS000.BYTE073  $  y=x*0.025;
  $  077.侧气帘/管气囊展开，点火电流持续时间(1.2A)，乘员侧                $    $  ms       $    $  ANS000.BYTE074  $  y=x*0.025;
  $  078.侧气帘/管气囊展开，点火电流持续时间(1.2A)，驾驶员侧              $    $  ms       $    $  ANS000.BYTE075  $  y=x*0.025;
  $  079.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，第二排乘员侧       $    $  ms       $    $  ANS000.BYTE076  $  y=x*0.025;
  $  080.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，第二排驾驶员       $    $  ms       $    $  ANS000.BYTE077  $  y=x*0.025;
  $  081.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE078  $  y=x*0.025;
  $  082.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE079  $  y=x*0.025;
  $  083.前气囊展开，点火电流持续时间(1.2A)，第二阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE080  $  y=x*0.025;
  $  084.前气囊展开，点火电流持续时间(1.2A)，第二阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE081  $  y=x*0.025;
  $  085.前气囊展开，点火电流持续时间(1.2A)，第一阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE082  $  y=x*0.025;
  $  086.前气囊展开，点火电流持续时间(1.2A)，第一阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE083  $  y=x*0.025;
  $  087.备用电源电压1(碰撞后)                                            $    $  V        $    $  ANS000.BYTE084  $  y=(x1*256+x2)*0.01;
  $  088.电源电压(碰撞后)                                                 $    $  V        $    $  ANS000.BYTE086  $  y=(x1*256+x2)*0.01;
  $  089.备用电源电压1(碰撞前)                                            $    $  V        $    $  ANS000.BYTE088  $  y=(x1*256+x2)*0.01;
  $  090.电源电压(碰撞前)                                                 $    $  V        $    $  ANS000.BYTE090  $  y=(x1*256+x2)*0.01;
  $  091.故障内存(碰撞前)                                                 $    $           $    $  ANS000.BYTE126  $  y=(x1*256+x2);
  $  092.碰撞事件数或总事件数(包括近距离和展开碰撞)                       $    $           $    $  ANS000.BYTE128  $  y=(x1*256+x2);
  $  093.碰撞数                                                           $    $           $    $  ANS000.BYTE130  $  y=(x1*256+x2);
  $  094.事件类型或碰撞严重程度                                           $    $           $    $  ANS000.BYTE132  $  if(x==0x00)y=@0574;else if(x==0x01)y=@0575;else if(x==0x02)y=@0576;else if(x==0x03)y=@0577;else if(x==0x04)y=@0578;else y=@01a9;
  $  095.事件方向                                                         $    $           $    $  ANS000.BYTE133  $  if(x==0x00)y=@0579;else if(x==0x01)y=@057a;else if(x==0x02)y=@057b;else if(x==0x03)y=@057c;else if(x==0x04)y=@057d;else if(x==0x05)y=@057e;else if(x==0x05)y=@057f;else y=@01a9;
  $  096.状态标志或录像机锁定状态                                         $    $           $    $  ANS000.BYTE134  $  if(x==0x00)y=@0580;else if(x==0x01)y=@0581;else if(x==0x02)y=@0582;else if(x==0x03)y=@0583;else y=@01a9;
  $  097.DV采样                                                           $    $  km/h     $    $  ANS000.BYTE148  $  y=(x5*256*256*256+x6*256*256+x7*256+x8)*0.0035336;
  $  098.前侧启动时间                                                     $    $  ms       $    $  ANS000.BYTE156  $  y=x*0.5;
  $  099.前侧复位时间                                                     $    $  ms       $    $  ANS000.BYTE158  $  y=x*0.5;
  $  100.前侧真实性时间                                                   $    $  ms       $    $  ANS000.BYTE160  $  y=x*0.5;
  $  101.前侧启用第二阶段决策时间                                         $    $  ms       $    $  ANS000.BYTE162  $  y=x*0.5;
  $  102.前侧附近碰撞时间                                                 $    $  ms       $    $  ANS000.BYTE164  $  y=x*0.5;
  $  103.前侧安全气带Thd时间                                              $    $  ms       $    $  ANS000.BYTE166  $  y=x*0.5;
  $  104.前侧气囊1Thd时间                                                 $    $  ms       $    $  ANS000.BYTE168  $  y=x*0.5;
  $  105.前侧气囊2Thd时间                                                 $    $  ms       $    $  ANS000.BYTE170  $  y=x*0.5;
  $  106.侧开始时间                                                       $    $  ms       $    $  ANS000.BYTE172  $  y=x*0.5;
  $  107.侧复位时间                                                       $    $  ms       $    $  ANS000.BYTE174  $  y=x*0.5;
  $  108.侧驾驶员位点火标志时间                                           $    $  ms       $    $  ANS000.BYTE176  $  y=x*0.5;
  $  109.侧乘员点火标志时间                                               $    $  ms       $    $  ANS000.BYTE178  $  y=x*0.5;
  $  110.SPR(PPS)ECU的真实性时间                                          $    $  ms       $    $  ANS000.BYTE180  $  y=x*0.5;
  $  111.SPR(PPS)PAS的真实性时间                                          $    $  ms       $    $  ANS000.BYTE182  $  y=x*0.5;
  $  112.驾驶员侧ECUY附近碰撞时间                                         $    $  ms       $    $  ANS000.BYTE184  $  y=x*0.5;
  $  113.乘员侧ECUY附近碰撞时间                                           $    $  ms       $    $  ANS000.BYTE186  $  y=x*0.5;
  $  114.驾驶员侧外围加速度传感器附近碰撞时间                             $    $  ms       $    $  ANS000.BYTE188  $  y=x*0.5;
  $  115.乘员侧外围加速度传感器附近碰撞时间                               $    $  ms       $    $  ANS000.BYTE190  $  y=x*0.5;
  $  116.Sac驾驶员位真实性时间                                            $    $  ms       $    $  ANS000.BYTE192  $  y=x*0.5;
  $  117.Sac乘员位真实性时间                                              $    $  ms       $    $  ANS000.BYTE194  $  y=x*0.5;
  $  118.后侧启动时间                                                     $    $  ms       $    $  ANS000.BYTE196  $  y=x*0.5;
  $  119.后侧复位时间                                                     $    $  ms       $    $  ANS000.BYTE198  $  y=x*0.5;
  $  120.后侧触发1Thd超过时间                                             $    $  ms       $    $  ANS000.BYTE200  $  y=x*0.5;
  $  121.后侧触发2Thd超过时间                                             $    $  ms       $    $  ANS000.BYTE202  $  y=x*0.5;
  $  122.后侧真实性时间                                                   $    $  ms       $    $  ANS000.BYTE204  $  y=x*0.5;
  $  123.后侧附近碰撞时间                                                 $    $  ms       $    $  ANS000.BYTE206  $  y=x*0.5;

  $)  04.碰撞记录数据2
  $  04.碰撞记录数据2
  $  REQ000:742 03 22 54 D3 00 00 00 00       $  ANS000:7C2 03 22 54 D3 00 00 00 00

  $  000.驾驶员侧气囊第一阶段的展开时间                                   $    $  ms       $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.5;
  $  001.驾驶员侧气囊第二阶段的展开时间                                   $    $  ms       $    $  ANS000.BYTE006  $  y=(x1*256+x2)*0.5;
  $  002.前排乘员侧气囊第一阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE008  $  y=(x1*256+x2)*0.5;
  $  003.前排乘员侧气囊第二阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE010  $  y=(x1*256+x2)*0.5;
  $  004.驾驶员侧侧气囊第一阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE012  $  y=(x1*256+x2)*0.5;
  $  005.驾驶员侧侧气帘/管气囊的展开时间                                  $    $  ms       $    $  ANS000.BYTE014  $  y=(x1*256+x2)*0.5;
  $  006.驾驶员预紧器(1)展开时间                                          $    $  ms       $    $  ANS000.BYTE016  $  y=(x1*256+x2)*0.5;
  $  007.前排乘员侧侧气囊第一阶段的展开时间                               $    $  ms       $    $  ANS000.BYTE018  $  y=(x1*256+x2)*0.5;
  $  008.前排乘员侧侧气帘/管气囊的展开时间                                $    $  ms       $    $  ANS000.BYTE020  $  y=(x1*256+x2)*0.5;
  $  009.前排乘员预紧器(1)展开时间                                        $    $  ms       $    $  ANS000.BYTE022  $  y=(x1*256+x2)*0.5;
  $  010.驾驶员侧膝部气囊展开时间                                         $    $           $    $  ANS000.BYTE024  $  y=(x1*256+x2)*0.5;
  $  011.前排乘员侧膝部气囊展开时间                                       $    $           $    $  ANS000.BYTE026  $  y=(x1*256+x2)*0.5;
  $  012.驾驶员预紧器(2)展开时间                                          $    $           $    $  ANS000.BYTE028  $  y=(x1*256+x2)*0.5;
  $  013.前排乘员预紧器(2)展开时间                                        $    $           $    $  ANS000.BYTE030  $  y=(x1*256+x2)*0.5;
  $  014.第二排中央位置预紧器(1)展开时间                                  $    $           $    $  ANS000.BYTE032  $  y=(x1*256+x2)*0.5;
  $  015.第二排驾驶员侧侧气囊第一阶段展开时间                             $    $           $    $  ANS000.BYTE034  $  y=(x1*256+x2)*0.5;
  $  016.第二排乘员侧侧气囊第一阶段展开时间                               $    $           $    $  ANS000.BYTE036  $  y=(x1*256+x2)*0.5;
  $  017.第二排驾驶员侧预紧器(1)展开时间                                  $    $           $    $  ANS000.BYTE038  $  y=(x1*256+x2)*0.5;
  $  018.第二排乘员侧预紧器(1)展开时间                                    $    $           $    $  ANS000.BYTE040  $  y=(x1*256+x2)*0.5;
  $  019.高压电池位激活展开时间                                           $    $           $    $  ANS000.BYTE042  $  y=(x1*256+x2)*0.5;
  $  020.第二排乘员侧安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE044  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  021.第二排乘员侧安全带锁扣开关状态                                   $    $           $    $  ANS000.BYTE044  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  022.第二中央位置安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE045  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  023.第二中央位置侧安全带锁扣开关状态                                 $    $           $    $  ANS000.BYTE045  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  024.第二驾驶员侧安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE046  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  025.第二驾驶员侧侧安全带锁扣开关状态                                 $    $           $    $  ANS000.BYTE046  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  026.前排乘员乘员位置分类配置状态                                     $    $           $    $  ANS000.BYTE047  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  027.前排乘员乘员位置分类开关状态                                     $    $           $    $  ANS000.BYTE047  $  if((x&0x0x03)==0x00)y=@0589;else y=@01a9;
  $  028.前排乘员座椅轨道位置开关配置状态                                 $    $           $    $  ANS000.BYTE048  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  029.前排乘员座椅轨道位置开关状态                                     $    $           $    $  ANS000.BYTE048  $  if((x&0x0x03)==0x00)y=@058a;else y=@01a9;
  $  030.前排乘员安全带配置状态                                           $    $           $    $  ANS000.BYTE049  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  031.前排乘员安全带开关状态                                           $    $           $    $  ANS000.BYTE049  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  032.前排乘员安全气囊抑制开关配置状态                                 $    $           $    $  ANS000.BYTE050  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  033.前排乘员安全气囊抑制开关状态                                     $    $           $    $  ANS000.BYTE050  $  if((x&0x0x03)==0x00)y=@058b;else y=@01a9;
  $  034.驾驶员侧座椅轨道位置开关配置状态                                 $    $           $    $  ANS000.BYTE051  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  035.驾驶员侧座椅轨道位置开关状态                                     $    $           $    $  ANS000.BYTE051  $  if((x&0x0x03)==0x00)y=@058a;else y=@01a9;
  $  036.驾驶员侧安全带配置状态                                           $    $           $    $  ANS000.BYTE052  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  037.驾驶员侧安全带开关状态                                           $    $           $    $  ANS000.BYTE052  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  038.车速                                                             $    $  km/h     $    $  ANS000.BYTE053  $  y=(x1*256+x2)*0.125;
  $  039.点火功能抑制线_所有点火回路低电压端                              $    $           $    $  ANS000.BYTE055  $  if((x&0x40)==0x40)y=@0586;else y=@0587;
  $  040.点火功能抑制线_所有点火回路高电压端                              $    $           $    $  ANS000.BYTE055  $  if((x&0x10)==0x10)y=@0586;else y=@0587;
  $  041.SCON(ECU内部的安全控制单元)-X向信号                              $    $           $    $  ANS000.BYTE055  $  if((x&0x08)==0x08)y=@0586;else y=@0587;
  $  042.SCON(ECU内部的安全控制单元)-Y向信号                              $    $           $    $  ANS000.BYTE055  $  if((x&0x04)==0x04)y=@0586;else y=@0587;
  $  043.SCON(ECU内部的安全控制单元)-PADS向信号                           $    $           $    $  ANS000.BYTE055  $  if((x&0x01)==0x01)y=@0586;else y=@0587;
  $  044.碰撞输出功能使能状态                                             $    $           $    $  ANS000.BYTE056  $  if(x==0x00)y=@01e5;else if(x==0x01)y=@0588;else y=@01a9;
  $  045.碰撞输出状态                                                     $    $           $    $  ANS000.BYTE057  $  if(x==0x00)y=@0188;else if(x==0x01)y=@0189;else y=@01a9;
  $  046.后排中央乘员安全带提醒灯                                         $    $           $    $  ANS000.BYTE058  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@028c;else y=@0004;
  $  047.后排乘员安全带提醒灯                                             $    $           $    $  ANS000.BYTE058  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x04)==0x01)y=@028c;else y=@0004;
  $  048.后排驾驶员侧安全带提醒灯                                         $    $           $    $  ANS000.BYTE058  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@0004;
  $  049.前排乘员安全带提醒灯                                             $    $           $    $  ANS000.BYTE059  $  if((x&0xC0)==0x00)y=@028b;else if((x&0xC0)==0x40)y=@028c;else y=@0004;
  $  050.驾驶员安全提醒灯                                                 $    $           $    $  ANS000.BYTE059  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@028c;else y=@0004;
  $  051.前排乘员安全气囊使能指示灯                                       $    $           $    $  ANS000.BYTE059  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x04)==0x01)y=@028c;else y=@0004;
  $  052.系统警告灯                                                       $    $           $    $  ANS000.BYTE059  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@0004;
  $  053.前排乘员外围压力传感器                                           $    $           $    $  ANS000.BYTE060  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  054.驾驶员前外围压力传感器                                           $    $           $    $  ANS000.BYTE060  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  055.中间乘员加速度传感器                                             $    $           $    $  ANS000.BYTE061  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  056.驾驶员中置加速度传感器                                           $    $           $    $  ANS000.BYTE061  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  057.前排乘员侧边加速度传感器                                         $    $           $    $  ANS000.BYTE061  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  058.驾驶员侧边加速度传感器                                           $    $           $    $  ANS000.BYTE061  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  059.中央前置传感器                                                   $    $           $    $  ANS000.BYTE062  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  060.乘员前置传感器                                                   $    $           $    $  ANS000.BYTE062  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  061.驾驶员前置传感器                                                 $    $           $    $  ANS000.BYTE062  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  062.SMI700(高)X                                                      $    $           $    $  ANS000.BYTE062  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  063.合理性传感器通道2                                                $    $           $    $  ANS000.BYTE063  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  064.合理性传感器通道1                                                $    $           $    $  ANS000.BYTE063  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  065.中央传感器通道2                                                  $    $           $    $  ANS000.BYTE063  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  066.中央传感器通道1                                                  $    $           $    $  ANS000.BYTE063  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  067.预紧器(2)，展开，点火电流持续时间，乘员位                        $    $  ms       $    $  ANS000.BYTE064  $  y=x*0.025;
  $  068.预紧器(2)，展开，点火电流持续时间，驾驶员位                      $    $  ms       $    $  ANS000.BYTE065  $  y=x*0.025;
  $  069.高压电池未激活，展开，点火电流持续时间(1.2A)                     $    $  ms       $    $  ANS000.BYTE066  $  y=x*0.025;
  $  070.膝部气囊展开，点火电流持续时间(1.2A)，前排乘员                   $    $  ms       $    $  ANS000.BYTE067  $  y=x*0.025;
  $  071.膝部气囊展开，点火电流持续时间(1.2A)，驾驶员位                   $    $  ms       $    $  ANS000.BYTE068  $  y=x*0.025;
  $  072.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排中间位置          $    $  ms       $    $  ANS000.BYTE069  $  y=x*0.025;
  $  073.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排乘员侧            $    $  ms       $    $  ANS000.BYTE070  $  y=x*0.025;
  $  074.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排驾驶员侧          $    $  ms       $    $  ANS000.BYTE071  $  y=x*0.025;
  $  075.预紧器(1)，展开，点火电流持续时间(1.2A)，前排乘员                $    $  ms       $    $  ANS000.BYTE072  $  y=x*0.025;
  $  076.预紧器(1)，展开，点火电流持续时间(1.2A)，驾驶员位                $    $  ms       $    $  ANS000.BYTE073  $  y=x*0.025;
  $  077.侧气帘/管气囊展开，点火电流持续时间(1.2A)，乘员侧                $    $  ms       $    $  ANS000.BYTE074  $  y=x*0.025;
  $  078.侧气帘/管气囊展开，点火电流持续时间(1.2A)，驾驶员侧              $    $  ms       $    $  ANS000.BYTE075  $  y=x*0.025;
  $  079.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，第二排乘员侧       $    $  ms       $    $  ANS000.BYTE076  $  y=x*0.025;
  $  080.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，第二排驾驶员       $    $  ms       $    $  ANS000.BYTE077  $  y=x*0.025;
  $  081.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE078  $  y=x*0.025;
  $  082.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE079  $  y=x*0.025;
  $  083.前气囊展开，点火电流持续时间(1.2A)，第二阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE080  $  y=x*0.025;
  $  084.前气囊展开，点火电流持续时间(1.2A)，第二阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE081  $  y=x*0.025;
  $  085.前气囊展开，点火电流持续时间(1.2A)，第一阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE082  $  y=x*0.025;
  $  086.前气囊展开，点火电流持续时间(1.2A)，第一阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE083  $  y=x*0.025;
  $  087.备用电源电压1(碰撞后)                                            $    $  V        $    $  ANS000.BYTE084  $  y=(x1*256+x2)*0.01;
  $  088.电源电压(碰撞后)                                                 $    $  V        $    $  ANS000.BYTE086  $  y=(x1*256+x2)*0.01;
  $  089.备用电源电压1(碰撞前)                                            $    $  V        $    $  ANS000.BYTE088  $  y=(x1*256+x2)*0.01;
  $  090.电源电压(碰撞前)                                                 $    $  V        $    $  ANS000.BYTE090  $  y=(x1*256+x2)*0.01;
  $  091.故障内存(碰撞前)                                                 $    $           $    $  ANS000.BYTE126  $  y=(x1*256+x2);
  $  092.碰撞事件数或总事件数(包括近距离和展开碰撞)                       $    $           $    $  ANS000.BYTE128  $  y=(x1*256+x2);
  $  093.碰撞数                                                           $    $           $    $  ANS000.BYTE130  $  y=(x1*256+x2);
  $  094.事件类型或碰撞严重程度                                           $    $           $    $  ANS000.BYTE132  $  if(x==0x00)y=@0574;else if(x==0x01)y=@0575;else if(x==0x02)y=@0576;else if(x==0x03)y=@0577;else if(x==0x04)y=@0578;else y=@01a9;
  $  095.事件方向                                                         $    $           $    $  ANS000.BYTE133  $  if(x==0x00)y=@0579;else if(x==0x01)y=@057a;else if(x==0x02)y=@057b;else if(x==0x03)y=@057c;else if(x==0x04)y=@057d;else if(x==0x05)y=@057e;else if(x==0x05)y=@057f;else y=@01a9;
  $  096.状态标志或录像机锁定状态                                         $    $           $    $  ANS000.BYTE134  $  if(x==0x00)y=@0580;else if(x==0x01)y=@0581;else if(x==0x02)y=@0582;else if(x==0x03)y=@0583;else y=@01a9;
  $  097.DV采样                                                           $    $  km/h     $    $  ANS000.BYTE148  $  y=(x5*256*256*256+x6*256*256+x7*256+x8)*0.0035336;
  $  098.前侧启动时间                                                     $    $  ms       $    $  ANS000.BYTE156  $  y=x*0.5;
  $  099.前侧复位时间                                                     $    $  ms       $    $  ANS000.BYTE158  $  y=x*0.5;
  $  100.前侧真实性时间                                                   $    $  ms       $    $  ANS000.BYTE160  $  y=x*0.5;
  $  101.前侧启用第二阶段决策时间                                         $    $  ms       $    $  ANS000.BYTE162  $  y=x*0.5;
  $  102.前侧附近碰撞时间                                                 $    $  ms       $    $  ANS000.BYTE164  $  y=x*0.5;
  $  103.前侧安全气带Thd时间                                              $    $  ms       $    $  ANS000.BYTE166  $  y=x*0.5;
  $  104.前侧气囊1Thd时间                                                 $    $  ms       $    $  ANS000.BYTE168  $  y=x*0.5;
  $  105.前侧气囊2Thd时间                                                 $    $  ms       $    $  ANS000.BYTE170  $  y=x*0.5;
  $  106.侧开始时间                                                       $    $  ms       $    $  ANS000.BYTE172  $  y=x*0.5;
  $  107.侧复位时间                                                       $    $  ms       $    $  ANS000.BYTE174  $  y=x*0.5;
  $  108.侧驾驶员位点火标志时间                                           $    $  ms       $    $  ANS000.BYTE176  $  y=x*0.5;
  $  109.侧乘员点火标志时间                                               $    $  ms       $    $  ANS000.BYTE178  $  y=x*0.5;
  $  110.SPR(PPS)ECU的真实性时间                                          $    $  ms       $    $  ANS000.BYTE180  $  y=x*0.5;
  $  111.SPR(PPS)PAS的真实性时间                                          $    $  ms       $    $  ANS000.BYTE182  $  y=x*0.5;
  $  112.驾驶员侧ECUY附近碰撞时间                                         $    $  ms       $    $  ANS000.BYTE184  $  y=x*0.5;
  $  113.乘员侧ECUY附近碰撞时间                                           $    $  ms       $    $  ANS000.BYTE186  $  y=x*0.5;
  $  114.驾驶员侧外围加速度传感器附近碰撞时间                             $    $  ms       $    $  ANS000.BYTE188  $  y=x*0.5;
  $  115.乘员侧外围加速度传感器附近碰撞时间                               $    $  ms       $    $  ANS000.BYTE190  $  y=x*0.5;
  $  116.Sac驾驶员位真实性时间                                            $    $  ms       $    $  ANS000.BYTE192  $  y=x*0.5;
  $  117.Sac乘员位真实性时间                                              $    $  ms       $    $  ANS000.BYTE194  $  y=x*0.5;
  $  118.后侧启动时间                                                     $    $  ms       $    $  ANS000.BYTE196  $  y=x*0.5;
  $  119.后侧复位时间                                                     $    $  ms       $    $  ANS000.BYTE198  $  y=x*0.5;
  $  120.后侧触发1Thd超过时间                                             $    $  ms       $    $  ANS000.BYTE200  $  y=x*0.5;
  $  121.后侧触发2Thd超过时间                                             $    $  ms       $    $  ANS000.BYTE202  $  y=x*0.5;
  $  122.后侧真实性时间                                                   $    $  ms       $    $  ANS000.BYTE204  $  y=x*0.5;
  $  123.后侧附近碰撞时间                                                 $    $  ms       $    $  ANS000.BYTE206  $  y=x*0.5;

  $)  05.碰撞记录数据3
  $  05.碰撞记录数据3
  $  REQ000:742 03 22 54 D4 00 00 00 00       $  ANS000:7C2 03 22 54 D4 00 00 00 00

  $  000.驾驶员侧气囊第一阶段的展开时间                                   $    $  ms       $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.5;
  $  001.驾驶员侧气囊第二阶段的展开时间                                   $    $  ms       $    $  ANS000.BYTE006  $  y=(x1*256+x2)*0.5;
  $  002.前排乘员侧气囊第一阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE008  $  y=(x1*256+x2)*0.5;
  $  003.前排乘员侧气囊第二阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE010  $  y=(x1*256+x2)*0.5;
  $  004.驾驶员侧侧气囊第一阶段的展开时间                                 $    $  ms       $    $  ANS000.BYTE012  $  y=(x1*256+x2)*0.5;
  $  005.驾驶员侧侧气帘/管气囊的展开时间                                  $    $  ms       $    $  ANS000.BYTE014  $  y=(x1*256+x2)*0.5;
  $  006.驾驶员预紧器(1)展开时间                                          $    $  ms       $    $  ANS000.BYTE016  $  y=(x1*256+x2)*0.5;
  $  007.前排乘员侧侧气囊第一阶段的展开时间                               $    $  ms       $    $  ANS000.BYTE018  $  y=(x1*256+x2)*0.5;
  $  008.前排乘员侧侧气帘/管气囊的展开时间                                $    $  ms       $    $  ANS000.BYTE020  $  y=(x1*256+x2)*0.5;
  $  009.前排乘员预紧器(1)展开时间                                        $    $  ms       $    $  ANS000.BYTE022  $  y=(x1*256+x2)*0.5;
  $  010.驾驶员侧膝部气囊展开时间                                         $    $           $    $  ANS000.BYTE024  $  y=(x1*256+x2)*0.5;
  $  011.前排乘员侧膝部气囊展开时间                                       $    $           $    $  ANS000.BYTE026  $  y=(x1*256+x2)*0.5;
  $  012.驾驶员预紧器(2)展开时间                                          $    $           $    $  ANS000.BYTE028  $  y=(x1*256+x2)*0.5;
  $  013.前排乘员预紧器(2)展开时间                                        $    $           $    $  ANS000.BYTE030  $  y=(x1*256+x2)*0.5;
  $  014.第二排中央位置预紧器(1)展开时间                                  $    $           $    $  ANS000.BYTE032  $  y=(x1*256+x2)*0.5;
  $  015.第二排驾驶员侧侧气囊第一阶段展开时间                             $    $           $    $  ANS000.BYTE034  $  y=(x1*256+x2)*0.5;
  $  016.第二排乘员侧侧气囊第一阶段展开时间                               $    $           $    $  ANS000.BYTE036  $  y=(x1*256+x2)*0.5;
  $  017.第二排驾驶员侧预紧器(1)展开时间                                  $    $           $    $  ANS000.BYTE038  $  y=(x1*256+x2)*0.5;
  $  018.第二排乘员侧预紧器(1)展开时间                                    $    $           $    $  ANS000.BYTE040  $  y=(x1*256+x2)*0.5;
  $  019.高压电池位激活展开时间                                           $    $           $    $  ANS000.BYTE042  $  y=(x1*256+x2)*0.5;
  $  020.第二排乘员侧安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE044  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  021.第二排乘员侧安全带锁扣开关状态                                   $    $           $    $  ANS000.BYTE044  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  022.第二中央位置安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE045  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  023.第二中央位置侧安全带锁扣开关状态                                 $    $           $    $  ANS000.BYTE045  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  024.第二驾驶员侧安全带锁扣配置状态                                   $    $           $    $  ANS000.BYTE046  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  025.第二驾驶员侧侧安全带锁扣开关状态                                 $    $           $    $  ANS000.BYTE046  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  026.前排乘员乘员位置分类配置状态                                     $    $           $    $  ANS000.BYTE047  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  027.前排乘员乘员位置分类开关状态                                     $    $           $    $  ANS000.BYTE047  $  if((x&0x0x03)==0x00)y=@0589;else y=@01a9;
  $  028.前排乘员座椅轨道位置开关配置状态                                 $    $           $    $  ANS000.BYTE048  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  029.前排乘员座椅轨道位置开关状态                                     $    $           $    $  ANS000.BYTE048  $  if((x&0x0x03)==0x00)y=@058a;else y=@01a9;
  $  030.前排乘员安全带配置状态                                           $    $           $    $  ANS000.BYTE049  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  031.前排乘员安全带开关状态                                           $    $           $    $  ANS000.BYTE049  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  032.前排乘员安全气囊抑制开关配置状态                                 $    $           $    $  ANS000.BYTE050  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  033.前排乘员安全气囊抑制开关状态                                     $    $           $    $  ANS000.BYTE050  $  if((x&0x0x03)==0x00)y=@058b;else y=@01a9;
  $  034.驾驶员侧座椅轨道位置开关配置状态                                 $    $           $    $  ANS000.BYTE051  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  035.驾驶员侧座椅轨道位置开关状态                                     $    $           $    $  ANS000.BYTE051  $  if((x&0x0x03)==0x00)y=@058a;else y=@01a9;
  $  036.驾驶员侧安全带配置状态                                           $    $           $    $  ANS000.BYTE052  $  if((x&0x04)==0x04)y=@01a9;else y=@0112;
  $  037.驾驶员侧安全带开关状态                                           $    $           $    $  ANS000.BYTE052  $  if((x&0x0x03)==0x00)y=@0446;else y=@01a9;
  $  038.车速                                                             $    $  km/h     $    $  ANS000.BYTE053  $  y=(x1*256+x2)*0.125;
  $  039.点火功能抑制线_所有点火回路低电压端                              $    $           $    $  ANS000.BYTE055  $  if((x&0x40)==0x40)y=@0586;else y=@0587;
  $  040.点火功能抑制线_所有点火回路高电压端                              $    $           $    $  ANS000.BYTE055  $  if((x&0x10)==0x10)y=@0586;else y=@0587;
  $  041.SCON(ECU内部的安全控制单元)-X向信号                              $    $           $    $  ANS000.BYTE055  $  if((x&0x08)==0x08)y=@0586;else y=@0587;
  $  042.SCON(ECU内部的安全控制单元)-Y向信号                              $    $           $    $  ANS000.BYTE055  $  if((x&0x04)==0x04)y=@0586;else y=@0587;
  $  043.SCON(ECU内部的安全控制单元)-PADS向信号                           $    $           $    $  ANS000.BYTE055  $  if((x&0x01)==0x01)y=@0586;else y=@0587;
  $  044.碰撞输出功能使能状态                                             $    $           $    $  ANS000.BYTE056  $  if(x==0x00)y=@01e5;else if(x==0x01)y=@0588;else y=@01a9;
  $  045.碰撞输出状态                                                     $    $           $    $  ANS000.BYTE057  $  if(x==0x00)y=@0188;else if(x==0x01)y=@0189;else y=@01a9;
  $  046.后排中央乘员安全带提醒灯                                         $    $           $    $  ANS000.BYTE058  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@028c;else y=@0004;
  $  047.后排乘员安全带提醒灯                                             $    $           $    $  ANS000.BYTE058  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x04)==0x01)y=@028c;else y=@0004;
  $  048.后排驾驶员侧安全带提醒灯                                         $    $           $    $  ANS000.BYTE058  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@0004;
  $  049.前排乘员安全带提醒灯                                             $    $           $    $  ANS000.BYTE059  $  if((x&0xC0)==0x00)y=@028b;else if((x&0xC0)==0x40)y=@028c;else y=@0004;
  $  050.驾驶员安全提醒灯                                                 $    $           $    $  ANS000.BYTE059  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@028c;else y=@0004;
  $  051.前排乘员安全气囊使能指示灯                                       $    $           $    $  ANS000.BYTE059  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x04)==0x01)y=@028c;else y=@0004;
  $  052.系统警告灯                                                       $    $           $    $  ANS000.BYTE059  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@0004;
  $  053.前排乘员外围压力传感器                                           $    $           $    $  ANS000.BYTE060  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  054.驾驶员前外围压力传感器                                           $    $           $    $  ANS000.BYTE060  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  055.中间乘员加速度传感器                                             $    $           $    $  ANS000.BYTE061  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  056.驾驶员中置加速度传感器                                           $    $           $    $  ANS000.BYTE061  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  057.前排乘员侧边加速度传感器                                         $    $           $    $  ANS000.BYTE061  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  058.驾驶员侧边加速度传感器                                           $    $           $    $  ANS000.BYTE061  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  059.中央前置传感器                                                   $    $           $    $  ANS000.BYTE062  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  060.乘员前置传感器                                                   $    $           $    $  ANS000.BYTE062  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  061.驾驶员前置传感器                                                 $    $           $    $  ANS000.BYTE062  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  062.SMI700(高)X                                                      $    $           $    $  ANS000.BYTE062  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  063.合理性传感器通道2                                                $    $           $    $  ANS000.BYTE063  $  if((x&0xC0)==0x00)y=@00b3;else if((x&0xC0)==0x40)y=@0197;else y=@01a9;
  $  064.合理性传感器通道1                                                $    $           $    $  ANS000.BYTE063  $  if((x&0x30)==0x00)y=@00b3;else if((x&0x30)==0x10)y=@0197;else y=@01a9;
  $  065.中央传感器通道2                                                  $    $           $    $  ANS000.BYTE063  $  if((x&0x0C)==0x00)y=@00b3;else if((x&0x04)==0x01)y=@0197;else y=@01a9;
  $  066.中央传感器通道1                                                  $    $           $    $  ANS000.BYTE063  $  if((x&0x03)==0x00)y=@00b3;else if((x&0x03)==0x01)y=@0197;else y=@01a9;
  $  067.预紧器(2)，展开，点火电流持续时间，乘员位                        $    $  ms       $    $  ANS000.BYTE064  $  y=x*0.025;
  $  068.预紧器(2)，展开，点火电流持续时间，驾驶员位                      $    $  ms       $    $  ANS000.BYTE065  $  y=x*0.025;
  $  069.高压电池未激活，展开，点火电流持续时间(1.2A)                     $    $  ms       $    $  ANS000.BYTE066  $  y=x*0.025;
  $  070.膝部气囊展开，点火电流持续时间(1.2A)，前排乘员                   $    $  ms       $    $  ANS000.BYTE067  $  y=x*0.025;
  $  071.膝部气囊展开，点火电流持续时间(1.2A)，驾驶员位                   $    $  ms       $    $  ANS000.BYTE068  $  y=x*0.025;
  $  072.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排中间位置          $    $  ms       $    $  ANS000.BYTE069  $  y=x*0.025;
  $  073.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排乘员侧            $    $  ms       $    $  ANS000.BYTE070  $  y=x*0.025;
  $  074.预紧器(1)，展开，点火电流持续时间(1.2A)，第二排驾驶员侧          $    $  ms       $    $  ANS000.BYTE071  $  y=x*0.025;
  $  075.预紧器(1)，展开，点火电流持续时间(1.2A)，前排乘员                $    $  ms       $    $  ANS000.BYTE072  $  y=x*0.025;
  $  076.预紧器(1)，展开，点火电流持续时间(1.2A)，驾驶员位                $    $  ms       $    $  ANS000.BYTE073  $  y=x*0.025;
  $  077.侧气帘/管气囊展开，点火电流持续时间(1.2A)，乘员侧                $    $  ms       $    $  ANS000.BYTE074  $  y=x*0.025;
  $  078.侧气帘/管气囊展开，点火电流持续时间(1.2A)，驾驶员侧              $    $  ms       $    $  ANS000.BYTE075  $  y=x*0.025;
  $  079.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，第二排乘员侧       $    $  ms       $    $  ANS000.BYTE076  $  y=x*0.025;
  $  080.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，第二排驾驶员       $    $  ms       $    $  ANS000.BYTE077  $  y=x*0.025;
  $  081.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE078  $  y=x*0.025;
  $  082.侧气囊展开，点火电流持续时间(1.2A)，第一阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE079  $  y=x*0.025;
  $  083.前气囊展开，点火电流持续时间(1.2A)，第二阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE080  $  y=x*0.025;
  $  084.前气囊展开，点火电流持续时间(1.2A)，第二阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE081  $  y=x*0.025;
  $  085.前气囊展开，点火电流持续时间(1.2A)，第一阶段，乘员侧             $    $  ms       $    $  ANS000.BYTE082  $  y=x*0.025;
  $  086.前气囊展开，点火电流持续时间(1.2A)，第一阶段，驾驶员侧           $    $  ms       $    $  ANS000.BYTE083  $  y=x*0.025;
  $  087.备用电源电压1(碰撞后)                                            $    $  V        $    $  ANS000.BYTE084  $  y=(x1*256+x2)*0.01;
  $  088.电源电压(碰撞后)                                                 $    $  V        $    $  ANS000.BYTE086  $  y=(x1*256+x2)*0.01;
  $  089.备用电源电压1(碰撞前)                                            $    $  V        $    $  ANS000.BYTE088  $  y=(x1*256+x2)*0.01;
  $  090.电源电压(碰撞前)                                                 $    $  V        $    $  ANS000.BYTE090  $  y=(x1*256+x2)*0.01;
  $  091.故障内存(碰撞前)                                                 $    $           $    $  ANS000.BYTE126  $  y=(x1*256+x2);
  $  092.碰撞事件数或总事件数(包括近距离和展开碰撞)                       $    $           $    $  ANS000.BYTE128  $  y=(x1*256+x2);
  $  093.碰撞数                                                           $    $           $    $  ANS000.BYTE130  $  y=(x1*256+x2);
  $  094.事件类型或碰撞严重程度                                           $    $           $    $  ANS000.BYTE132  $  if(x==0x00)y=@0574;else if(x==0x01)y=@0575;else if(x==0x02)y=@0576;else if(x==0x03)y=@0577;else if(x==0x04)y=@0578;else y=@01a9;
  $  095.事件方向                                                         $    $           $    $  ANS000.BYTE133  $  if(x==0x00)y=@0579;else if(x==0x01)y=@057a;else if(x==0x02)y=@057b;else if(x==0x03)y=@057c;else if(x==0x04)y=@057d;else if(x==0x05)y=@057e;else if(x==0x05)y=@057f;else y=@01a9;
  $  096.状态标志或录像机锁定状态                                         $    $           $    $  ANS000.BYTE134  $  if(x==0x00)y=@0580;else if(x==0x01)y=@0581;else if(x==0x02)y=@0582;else if(x==0x03)y=@0583;else y=@01a9;
  $  097.DV采样                                                           $    $  km/h     $    $  ANS000.BYTE148  $  y=(x5*256*256*256+x6*256*256+x7*256+x8)*0.0035336;
  $  098.前侧启动时间                                                     $    $  ms       $    $  ANS000.BYTE156  $  y=x*0.5;
  $  099.前侧复位时间                                                     $    $  ms       $    $  ANS000.BYTE158  $  y=x*0.5;
  $  100.前侧真实性时间                                                   $    $  ms       $    $  ANS000.BYTE160  $  y=x*0.5;
  $  101.前侧启用第二阶段决策时间                                         $    $  ms       $    $  ANS000.BYTE162  $  y=x*0.5;
  $  102.前侧附近碰撞时间                                                 $    $  ms       $    $  ANS000.BYTE164  $  y=x*0.5;
  $  103.前侧安全气带Thd时间                                              $    $  ms       $    $  ANS000.BYTE166  $  y=x*0.5;
  $  104.前侧气囊1Thd时间                                                 $    $  ms       $    $  ANS000.BYTE168  $  y=x*0.5;
  $  105.前侧气囊2Thd时间                                                 $    $  ms       $    $  ANS000.BYTE170  $  y=x*0.5;
  $  106.侧开始时间                                                       $    $  ms       $    $  ANS000.BYTE172  $  y=x*0.5;
  $  107.侧复位时间                                                       $    $  ms       $    $  ANS000.BYTE174  $  y=x*0.5;
  $  108.侧驾驶员位点火标志时间                                           $    $  ms       $    $  ANS000.BYTE176  $  y=x*0.5;
  $  109.侧乘员点火标志时间                                               $    $  ms       $    $  ANS000.BYTE178  $  y=x*0.5;
  $  110.SPR(PPS)ECU的真实性时间                                          $    $  ms       $    $  ANS000.BYTE180  $  y=x*0.5;
  $  111.SPR(PPS)PAS的真实性时间                                          $    $  ms       $    $  ANS000.BYTE182  $  y=x*0.5;
  $  112.驾驶员侧ECUY附近碰撞时间                                         $    $  ms       $    $  ANS000.BYTE184  $  y=x*0.5;
  $  113.乘员侧ECUY附近碰撞时间                                           $    $  ms       $    $  ANS000.BYTE186  $  y=x*0.5;
  $  114.驾驶员侧外围加速度传感器附近碰撞时间                             $    $  ms       $    $  ANS000.BYTE188  $  y=x*0.5;
  $  115.乘员侧外围加速度传感器附近碰撞时间                               $    $  ms       $    $  ANS000.BYTE190  $  y=x*0.5;
  $  116.Sac驾驶员位真实性时间                                            $    $  ms       $    $  ANS000.BYTE192  $  y=x*0.5;
  $  117.Sac乘员位真实性时间                                              $    $  ms       $    $  ANS000.BYTE194  $  y=x*0.5;
  $  118.后侧启动时间                                                     $    $  ms       $    $  ANS000.BYTE196  $  y=x*0.5;
  $  119.后侧复位时间                                                     $    $  ms       $    $  ANS000.BYTE198  $  y=x*0.5;
  $  120.后侧触发1Thd超过时间                                             $    $  ms       $    $  ANS000.BYTE200  $  y=x*0.5;
  $  121.后侧触发2Thd超过时间                                             $    $  ms       $    $  ANS000.BYTE202  $  y=x*0.5;
  $  122.后侧真实性时间                                                   $    $  ms       $    $  ANS000.BYTE204  $  y=x*0.5;
  $  123.后侧附近碰撞时间                                                 $    $  ms       $    $  ANS000.BYTE206  $  y=x*0.5;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:742 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
