
    车型ID：1045

    模拟：协议模拟-->1045

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:74B 02 10 01 00 00 00 00 00       $~  ANS000:7CB 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:74B 02 3E 80 00 00 00 00 00       $!  ANS000:7CB 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:74B 03 19 02 09 00 00 00 00       $#  ANS000:7CB 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/45000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:74B 04 14 FF FF FF 00 00 00       $$  ANS000:7CB 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:74B 03 22 F1 A0 00 00 00 00       $%  ANS000:7CB 03 22 F1 A0 00 00 00 00
  $%  REQ001:74B 03 22 F1 83 00 00 00 00       $%  ANS001:7CB 03 22 F1 83 00 00 00 00
  $%  REQ002:74B 03 22 F1 A1 00 00 00 00       $%  ANS002:7CB 03 22 F1 A1 00 00 00 00
  $%  REQ003:74B 03 22 F1 91 00 00 00 00       $%  ANS003:7CB 03 22 F1 91 00 00 00 00
  $%  REQ004:74B 03 22 F1 8B 00 00 00 00       $%  ANS004:7CB 03 22 F1 8B 00 00 00 00
  $%  REQ005:74B 03 22 F1 A2 00 00 00 00       $%  ANS005:7CB 03 22 F1 A2 00 00 00 00
  $%  REQ006:74B 03 22 F1 87 00 00 00 00       $%  ANS006:7CB 03 22 F1 87 00 00 00 00
  $%  REQ007:74B 03 22 F1 10 00 00 00 00       $%  ANS007:7CB 03 22 F1 10 00 00 00 00
  $%  REQ008:74B 03 22 F1 92 00 00 00 00       $%  ANS008:7CB 03 22 F1 92 00 00 00 00
  $%  REQ009:74B 03 22 F1 8C 00 00 00 00       $%  ANS009:7CB 03 22 F1 8C 00 00 00 00
  $%  REQ010:74B 03 22 F1 94 00 00 00 00       $%  ANS010:7CB 03 22 F1 94 00 00 00 00
  $%  REQ011:74B 03 22 F1 8A 00 00 00 00       $%  ANS011:7CB 03 22 F1 8A 00 00 00 00
  $%  REQ012:74B 03 22 F1 90 00 00 00 00       $%  ANS012:7CB 03 22 F1 90 00 00 00 00
  $%  REQ013:74B 03 22 F1 A8 00 00 00 00       $%  ANS013:7CB 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元制造日期:                $%    $%  ANS004.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);
  $%  005:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号(上次):            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  008:测试工具参考号(上次):            $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  009:里程读数(上次)KM:                $%    $%  ANS007.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  010:保留状态:                        $%    $%  ANS007.BYTE018  $%  HEX(X1,X2);
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:供应商电控单元序列号:            $%    $%  ANS009.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  013:供应商电控单元产线号:            $%    $%  ANS009.BYTE009  $%  ASCII(X1,X2);
  $%  014:年:                              $%    $%  ANS009.BYTE011  $%  HEX(X);
  $%  015:月:                              $%    $%  ANS009.BYTE013  $%  HEX(X);
  $%  016:日:                              $%    $%  ANS009.BYTE013  $%  HEX(X);
  $%  017:供应商电控单元软件参考号:        $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  018:系统供应商识别码:                $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  019:VIN码:                           $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  020:车辆特征信息:                    $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:74B 03 22 E0 04 00 00 00 00       $  ANS000:7CB 03 22 E0 04 00 00 00 00
  $  REQ001:74B 03 22 C0 02 00 00 00 00       $  ANS001:7CB 03 22 C0 02 00 00 00 00
  $  REQ002:74B 03 22 E0 06 00 00 00 00       $  ANS002:7CB 03 22 E0 06 00 00 00 00
  $  REQ003:74B 03 22 D0 01 00 00 00 00       $  ANS003:7CB 03 22 D0 01 00 00 00 00
  $  REQ004:74B 03 22 D0 02 00 00 00 00       $  ANS004:7CB 03 22 D0 02 00 00 00 00
  $  REQ005:74B 03 22 E0 01 00 00 00 00       $  ANS005:7CB 03 22 E0 01 00 00 00 00
  $  REQ006:74B 03 22 D0 03 00 00 00 00       $  ANS006:7CB 03 22 D0 03 00 00 00 00
  $  REQ007:74B 03 22 E0 02 00 00 00 00       $  ANS007:7CB 03 22 E0 02 00 00 00 00
  $  REQ008:74B 03 22 E0 03 00 00 00 00       $  ANS008:7CB 03 22 E0 03 00 00 00 00
  $  REQ009:74B 03 22 01 12 00 00 00 00       $  ANS009:7CB 03 22 01 12 00 00 00 00
  $  REQ010:74B 03 22 E0 05 00 00 00 00       $  ANS010:7CB 03 22 E0 05 00 00 00 00
  $  REQ011:74B 03 22 C0 03 00 00 00 00       $  ANS011:7CB 03 22 C0 03 00 00 00 00

  $  000.ABS速度                                                 $    $  km/h     $    $  ANS000.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  001.HVAC(自动空调)                                          $    $           $    $  ANS001.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  002.EPS(电动助力转向)                                       $    $           $    $  ANS001.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  003.EPB(电子手刹)                                           $    $           $    $  ANS001.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  004.ESP(电子稳定系统)                                       $    $           $    $  ANS001.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  005.FICM(娱乐系统大屏含导航)                                $    $           $    $  ANS001.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  006.TCU(变速箱控制单元)                                     $    $           $    $  ANS001.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  007.PDC(驻车距离控制单元)开关状态                           $    $           $    $  ANS002.BYTE004  $  if((x&0x18)==0x00)y=@02ce;else if((x&0x18)==0x08)y=@0a5f;else if((x&0x18)==0x10)y=@0a60;else y=@01a9;
  $  008.BSD(盲点检测系统)开关状态                               $    $           $    $  ANS002.BYTE004  $  if((x&0x06)==0x00)y=@02ce;else if((x&0x06)==0x02)y=@08cf;else if((x&0x06)==0x04)y=@08d0;else y=@01a9;
  $  009.FICM(娱乐系统)中前PDC(驻车距离控制单元)使能             $    $           $    $  ANS002.BYTE004  $  if((x&0x01)==0x01)y=@00f0;else y=@00f1;
  $  010.全局KL.50状态                                           $    $           $    $  ANS003.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  011.全局发动机运行状态                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  012.全局KL.15状态                                           $    $           $    $  ANS003.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  013.全局KL.R状态                                            $    $           $    $  ANS003.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  014.系统KL.50状态                                           $    $           $    $  ANS003.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  015.系统发动机运行状态                                      $    $           $    $  ANS003.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  016.系统KL.15状态                                           $    $           $    $  ANS003.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  017.系统KL.R状态                                            $    $           $    $  ANS003.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  018.右转向灯状态                                            $    $           $    $  ANS004.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  019.左转向灯状态                                            $    $           $    $  ANS004.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  020.右侧LED                                                 $    $           $    $  ANS004.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  021.左侧LED                                                 $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  022.里程表读数                                              $    $  km       $    $  ANS005.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  023.PDC(驻车距离控制单元)开关状态有效性                     $    $           $    $  ANS006.BYTE004  $  if((x&0x08)==0x08)y=@04ec;else y=@00bb;
  $  024.BSD(盲点检测系统)开关状态有效性                         $    $           $    $  ANS006.BYTE004  $  if((x&0x04)==0x04)y=@04ec;else y=@00bb;
  $  025.FICM(娱乐系统)中前PDC(驻车距离控制单元)使能有效性       $    $           $    $  ANS006.BYTE004  $  if((x&0x02)==0x02)y=@04ec;else y=@00bb;
  $  026.SAS(方向盘转向角传感器)状态                             $    $           $    $  ANS006.BYTE004  $  if((x&0x01)==0x01)y=@0664;else y=@0a61;
  $  027.右后侧传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE004  $  y=x*0.1;
  $  028.右后角传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE005  $  y=x*0.1;
  $  029.右后内部传感器余震时间                                  $    $  ms       $    $  ANS007.BYTE006  $  y=x*0.1;
  $  030.左后内部传感器余震时间                                  $    $  ms       $    $  ANS007.BYTE007  $  y=x*0.1;
  $  031.左后角传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE008  $  y=x*0.1;
  $  032.左后侧传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE009  $  y=x*0.1;
  $  033.右前侧传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE010  $  y=x*0.1;
  $  034.右前角传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE011  $  y=x*0.1;
  $  035.右前内部传感器余震时间                                  $    $  ms       $    $  ANS007.BYTE012  $  y=x*0.1;
  $  036.左前内部传感器余震时间                                  $    $  ms       $    $  ANS007.BYTE013  $  y=x*0.1;
  $  037.左前角传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE014  $  y=x*0.1;
  $  038.左前侧传感器余震时间                                    $    $  ms       $    $  ANS007.BYTE015  $  y=x*0.1;
  $  039.转向角                                                  $    $  rad      $    $  ANS008.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.1;
  $  040.系统输入电压                                            $    $  V        $    $  ANS009.BYTE004  $  y=x*0.1;
  $  041.变速器换挡杆位置                                        $    $           $    $  ANS010.BYTE004  $  if(x==0x00)y=@0514;else if(x==0x01)y=@00b4;else if(x==0x02)y=@0388;else if(x==0x03)y=@0515;else if(x==0x04)y=@0516;else if(x==0x05)y=@0517;else if(x==0x06)y=@0518;else if(x==0x07)y=@0519;else if(x==0x08)y=@051a;else if(x==0x09)y=@051b;else if(x==0x0A)y=@051c;else if(x==0x0B)y=@051d;else if(x==0x0F)y=@051e;else y=@01a9;
  $  042.UPA模式                                                 $    $           $    $  ANS011.BYTE004  $  if((x&0x0F)==0x01)y=@01be;else if((x&0x0F)==0x02)y=@0a62;else if((x&0x0F)==0x04)y=@0a63;else if((x&0x0F)==0x08)y=@0a64;else y=@01a9;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:74B 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
