
    车型ID：1064

    模拟：协议模拟-->1064

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/64000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 A2 00 00 00 00       $%  ANS004:769 03 22 F1 A2 00 00 00 00
  $%  REQ005:761 03 22 F1 87 00 00 00 00       $%  ANS005:769 03 22 F1 87 00 00 00 00
  $%  REQ006:761 03 22 F1 10 00 00 00 00       $%  ANS006:769 03 22 F1 10 00 00 00 00
  $%  REQ007:761 03 22 F1 92 00 00 00 00       $%  ANS007:769 03 22 F1 92 00 00 00 00
  $%  REQ008:761 03 22 F1 8C 00 00 00 00       $%  ANS008:769 03 22 F1 8C 00 00 00 00
  $%  REQ009:761 03 22 F1 94 00 00 00 00       $%  ANS009:769 03 22 F1 94 00 00 00 00
  $%  REQ010:761 03 22 F1 8A 00 00 00 00       $%  ANS010:769 03 22 F1 8A 00 00 00 00
  $%  REQ011:761 03 22 F1 90 00 00 00 00       $%  ANS011:769 03 22 F1 90 00 00 00 00
  $%  REQ012:761 03 22 F1 A8 00 00 00 00       $%  ANS012:769 03 22 F1 A8 00 00 00 00
  $%  REQ013:761 03 22 F1 8B 00 00 00 00       $%  ANS013:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  011:供应商电控单元产线号:            $%    $%  ANS008.BYTE010  $%  HEX(X1);
  $%  012:年:                              $%    $%  ANS008.BYTE011  $%  HEX(X1);
  $%  013:月 日:                           $%    $%  ANS008.BYTE012  $%  HEX(X1,X2);
  $%  014:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  015:系统供应商识别码:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  016:VIN码:                           $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  017:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  018:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 D0 02 00 00 00 00       $  ANS000:769 03 22 D0 02 00 00 00 00
  $  REQ001:761 03 22 D0 04 00 00 00 00       $  ANS001:769 03 22 D0 04 00 00 00 00
  $  REQ002:761 03 22 D0 01 00 00 00 00       $  ANS002:769 03 22 D0 01 00 00 00 00
  $  REQ003:761 03 22 C0 11 00 00 00 00       $  ANS003:769 03 22 C0 11 00 00 00 00
  $  REQ004:761 03 22 C0 12 00 00 00 00       $  ANS004:769 03 22 C0 12 00 00 00 00
  $  REQ005:761 03 22 C0 14 00 00 00 00       $  ANS005:769 03 22 C0 14 00 00 00 00
  $  REQ006:761 03 22 C0 10 00 00 00 00       $  ANS006:769 03 22 C0 10 00 00 00 00
  $  REQ007:761 03 22 C0 18 00 00 00 00       $  ANS007:769 03 22 C0 18 00 00 00 00
  $  REQ008:761 03 22 C0 13 00 00 00 00       $  ANS008:769 03 22 C0 13 00 00 00 00
  $  REQ009:761 03 22 C0 16 00 00 00 00       $  ANS009:769 03 22 C0 16 00 00 00 00
  $  REQ010:761 03 22 C0 17 00 00 00 00       $  ANS010:769 03 22 C0 17 00 00 00 00
  $  REQ011:761 03 22 C0 19 00 00 00 00       $  ANS011:769 03 22 C0 19 00 00 00 00
  $  REQ012:761 03 22 C0 01 00 00 00 00       $  ANS012:769 03 22 C0 01 00 00 00 00
  $  REQ013:761 03 22 C0 02 00 00 00 00       $  ANS013:769 03 22 C0 02 00 00 00 00
  $  REQ014:761 03 22 C0 20 00 00 00 00       $  ANS014:769 03 22 C0 20 00 00 00 00
  $  REQ015:761 03 22 C0 03 00 00 00 00       $  ANS015:769 03 22 C0 03 00 00 00 00
  $  REQ016:761 03 22 C0 04 00 00 00 00       $  ANS016:769 03 22 C0 04 00 00 00 00
  $  REQ017:761 03 22 C0 05 00 00 00 00       $  ANS017:769 03 22 C0 05 00 00 00 00
  $  REQ018:761 03 22 C0 06 00 00 00 00       $  ANS018:769 03 22 C0 06 00 00 00 00
  $  REQ019:761 03 22 C0 07 00 00 00 00       $  ANS019:769 03 22 C0 07 00 00 00 00
  $  REQ020:761 03 22 C0 08 00 00 00 00       $  ANS020:769 03 22 C0 08 00 00 00 00
  $  REQ021:761 03 22 C0 09 00 00 00 00       $  ANS021:769 03 22 C0 09 00 00 00 00
  $  REQ022:761 03 22 C0 0A 00 00 00 00       $  ANS022:769 03 22 C0 0A 00 00 00 00
  $  REQ023:761 03 22 C0 0B 00 00 00 00       $  ANS023:769 03 22 C0 0B 00 00 00 00
  $  REQ024:761 03 22 C0 0C 00 00 00 00       $  ANS024:769 03 22 C0 0C 00 00 00 00
  $  REQ025:761 03 22 C0 0D 00 00 00 00       $  ANS025:769 03 22 C0 0D 00 00 00 00
  $  REQ026:761 03 22 C0 0E 00 00 00 00       $  ANS026:769 03 22 C0 0E 00 00 00 00

  $  000.日间行车灯状态                             $    $           $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  001.尾门开关状态                               $    $           $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  002.左后侧门开关状态                           $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  003.右后门开关状态                             $    $           $    $  ANS000.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  004.前排乘务员门开关状态                       $    $           $    $  ANS000.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  005.驾驶员门开关状态                           $    $           $    $  ANS000.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  006.后雾灯状态                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  007.前雾灯状态                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  008.远光灯状态                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  009.近光灯状态                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  010.位置灯状态                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  011.乘客车门锁定状态                           $    $           $    $  ANS000.BYTE006  $  if((x&0xC0)==0x00) y=@000f;else if((x&0xC0)==0x40) y=@0028;else if((x&0xC0)==0x80) y=@0004;else y=@0136;
  $  012.驾驶员门锁状态                             $    $           $    $  ANS000.BYTE006  $  if((x&0x30)==0x00) y=@000f;else if((x&0x30)==0x10) y=@0028;else if((x&0x30)==0x20) y=@0004;else y=@0136;
  $  013.右转向灯状态                               $    $           $    $  ANS000.BYTE006  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  014.左转向灯状态                               $    $           $    $  ANS000.BYTE006  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  015.系统电源模式有效性                         $    $           $    $  ANS000.BYTE006  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@0010;else if((x&0x03)==0x02)y=@009d;else y=@05d2;
  $  016.仪表显示超速功能状态                       $    $           $    $  ANS001.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  017.全局KL.50状态                              $    $           $    $  ANS002.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  018.全局发动机运行状态                         $    $           $    $  ANS002.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  019.全局KL.15状态                              $    $           $    $  ANS002.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  020.全局KL.R状态                               $    $           $    $  ANS002.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  021.系统KL.50状态                              $    $           $    $  ANS002.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  022.系统发动机运行状态                         $    $           $    $  ANS002.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  023.系统KL.15状态                              $    $           $    $  ANS002.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  024.系统KL.R状态                               $    $           $    $  ANS002.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  025.BSD盲点检测系统配置                        $    $           $    $  ANS003.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  026.DDD疲劳提醒警报配置                        $    $           $    $  ANS003.BYTE005  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  027.360度全景泊车车辆起步开启                  $    $           $    $  ANS003.BYTE006  $  if((x&0xF0)==0x00)y=@000f;else if((x&0xF0)==0x10)y=@0028;else y=@01a9;
  $  028.360度全景泊车低速打转向灯开启              $    $           $    $  ANS003.BYTE006  $  if((x&0x0F)==0x00)y=@000f;else if((x&0x0F)==0x01)y=@0028;else y=@01a9;
  $  029.前碰撞系统报警灵敏度配置                   $    $           $    $  ANS003.BYTE007  $  if((x&0xF0)==0x00) y=@098b;else if((x&0xF0)==0x10) y=@08ce;else if((x&0xF0)==0x20) y=@098c;else y=@01a9;
  $  030.前碰撞系统报警配置                         $    $           $    $  ANS003.BYTE007  $  if((x&0x0F)==0x00) y=@098d;else if((x&0x0F)==0x01) y=@098e;else if((x&0x0F)==0x02) y=@098f;else y=@01a9;
  $  031.亮灯时间                                   $    $           $    $  ANS004.BYTE004  $  if((x&0xF0)==0x00)y=@0491;else if((x&0xF0)==0x10)y=@0492;else if((x&0xF0)==0x20)y=@0493;else y=@01a9;
  $  032.FMH伴我回家照明灯(寻车灯)开关配置          $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  033.寻车反馈配置                               $    $           $    $  ANS004.BYTE005  $  if(x==0x00)y=@0990;else if(x==0x01)y=@0991;else y=@01a9;
  $  034.无钥匙解锁配置                             $    $           $    $  ANS004.BYTE006  $  if((x&0x20)==0x20)y=@0992;else y=@0993;
  $  035.钥匙解锁配置                               $    $           $    $  ANS004.BYTE006  $  if((x&0x10)==0x10)y=@0992;else y=@0993;
  $  036.上锁反馈配置                               $    $           $    $  ANS004.BYTE006  $  if((x&0x0C)==0x00) y=@01a9;else if((x&0x0C)==0x04) y=@08ee;else if((x&0x0C)==0x08) y=@0506;else y=@0504;
  $  037.熄火自动解锁                               $    $           $    $  ANS004.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  038.行车自动锁定                               $    $           $    $  ANS004.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  039.座椅自动调出                               $    $           $    $  ANS004.BYTE007  $  if((x&0xC0)==0x00)y=@0afb;else if((x&0xC0)==0x40)y=@0afc;else y=@01a9;
  $  040.清除所有记忆功能                           $    $           $    $  ANS004.BYTE007  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  041.后视镜及座椅钥匙记忆功能                   $    $           $    $  ANS004.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  042.车外后视镜倒车自动下倾                     $    $           $    $  ANS004.BYTE007  $  if((x&0x0E)==0x00) y=@0994;else if((x&0x0E)==0x02) y=@0995;else if((x&0x0E)==0x04) y=@0996;else if((x&0x0E)==0x06) y=@000f;else y=@01a9;
  $  043.自动折叠/展开                              $    $           $    $  ANS004.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  044.语言配置                                   $    $           $    $  ANS005.BYTE004  $  if(x==0x00) y=@074a;else if(x==0x01) y=@0901;else if(x==0x02) y=@08bf;else if(x==0x03) y=@08ca;else if(x==0x04) y=@09ac;else y=@01a9;
  $  045.日期格式                                   $    $           $    $  ANS005.BYTE005  $  if((x&0xF0)==0x00)y=@0b11;else if((x&0xF0)==0x10)y=@0b12;else if((x&0xF0)==0x20)y=@0b13;else y=@01a9;
  $  046.时间格式                                   $    $           $    $  ANS005.BYTE005  $  if((x&0x01)==0x01)y=@08a7;else y=@08a8;
  $  047.超速报警                                   $    $           $    $  ANS006.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  048.超速报警速度设置                           $    $  km/h     $    $  ANS006.BYTE005  $  y=x;
  $  049.LDW车道偏离预警系统配置                    $    $           $    $  ANS006.BYTE007  $  if((x&0xF0)==0x00) y=@098b;else if((x&0xF0)==0x10) y=@08ce;else if((x&0xF0)==0x20) y=@098c;else y=@01a9;
  $  050.车道偏离报警配置                           $    $           $    $  ANS006.BYTE007  $  if((x&0x0F)==0x00) y=@09ad;else if((x&0x0F)==0x01) y=@09ae;else if((x&0x0F)==0x02) y=@09af;else y=@01a9;
  $  051.PM2.5关联净化器自动开启                    $    $           $    $  ANS007.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  052.发动机自动启停                             $    $           $    $  ANS007.BYTE005  $  if(x==0x00)y=@09b0;else if(x==0x01)y=@09b1;else y=@01a9;
  $  053.后视镜折叠与加热                           $    $           $    $  ANS007.BYTE006  $  if(x==0x00)y=@09b2;else if(x==0x01)y=@09b3;else y=@01a9;
  $  054.方向盘自定义                               $    $           $    $  ANS008.BYTE004  $  if(x==0x00)y=@064f;else if(x==0x01)y=@08f0;else y=@01a9;
  $  055.限速标识识别                               $    $           $    $  ANS009.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  056.前泊车PDC                                  $    $           $    $  ANS009.BYTE005  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  057.单色氛围灯                                 $    $           $    $  ANS010.BYTE004  $  if((x&0xF0)==0x00)y=@0491;else if((x&0xF0)==0x10)y=@0492;else if((x&0xF0)==0x20)y=@0493;else y=@01a9;
  $  058.迎宾灯配置                                 $    $           $    $  ANS010.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  059.单色氛围灯                                 $    $           $    $  ANS010.BYTE005  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  060.天窗                                       $    $           $    $  ANS010.BYTE006  $  if(x==0x00)y=@09b4;else if(x==0x01)y=@09b5;else y=@01a9;
  $  061.ATS显示特效                                $    $           $    $  ANS010.BYTE007  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  062.气帘                                       $    $           $    $  ANS011.BYTE004  $  if((x&0xF0)==0x00) y=@09b6;else if((x&0xF0)==0x10) y=@09b7;else y=@01a9;
  $  063.侧气帘                                     $    $           $    $  ANS011.BYTE004  $  if((x&0x0F)==0x00)y=@09b8;else if((x&0x0F)==0x01)y=@09b9;else y=@01a9;
  $  064.安全带未系提醒                             $    $           $    $  ANS011.BYTE005  $  if(x==0x00)y=@0992;else if(x==0x01)y=@0aed;else if(x==0x02)y=@0aee;else y=@01a9;
  $  065.车身颜色类型配置                           $    $           $    $  ANS012.BYTE004  $  if(x==0x00) y=@06e2;else if(x==0x01) y=@06e3;else if(x==0x02) y=@06e4;else if(x==0x03) y=@0997;else if(x==0x04) y=@06e6;else if(x==0x05) y=@06e7;else if(x==0x06) y=@06e8;else if(x==0x07) y=@06e9;else if(x==0x08) y=@06ea;else if(x==0x09) y=@06eb;else if(x==0x0A) y=@06ec;else if(x==0x0B) y=@06ed;else if(x==0x0C) y=@06ee;else if(x==0x0D) y=@06ef;else if(x==0x0E) y=@06f0;else y=@0998;
  $  066.空调类型配置                               $    $           $    $  ANS012.BYTE005  $  if(x==0x00) y=@08f7;else if(x==0x01) y=@0004;else if(x==0x02) y=@0999;else if(x==0x03) y=@099a;else if(x==0x04) y=@099b;else if(x==0x05) y=@099c;else if(x==0x06) y=@099d;else if(x==0x07) y=@099e;else y=@01a9;
  $  067.驾驶员座椅                                 $    $           $    $  ANS012.BYTE006  $  if(x==0x00) y=@099f;else if(x==0x01) y=@09a0;else if(x==0x02) y=@09a1;else if(x==0x03) y=@09a2;else y=@01a9;
  $  068.副驾驶员座椅                               $    $           $    $  ANS012.BYTE007  $  if(x==0x00) y=@099f;else if(x==0x01) y=@09a0;else if(x==0x02) y=@09a1;else if(x==0x03) y=@09a2;else y=@01a9;
  $  069.第二排座椅                                 $    $           $    $  ANS012.BYTE008  $  if(x==0x00) y=@099f;else if(x==0x01) y=@09a0;else if(x==0x02) y=@09a1;else if(x==0x03) y=@09a2;else y=@01a9;
  $  070.第三排座椅                                 $    $           $    $  ANS012.BYTE009  $  if(x==0x00) y=@099f;else if(x==0x01) y=@09a0;else if(x==0x02) y=@09a1;else if(x==0x03) y=@09a2;else y=@01a9;
  $  071.胎压监测系统                               $    $           $    $  ANS012.BYTE010  $  if(x==0x00)y=@06f3;else if(x==0x01)y=@09a3;else y=@01a9;
  $  072.车道偏离警告系统                           $    $           $    $  ANS013.BYTE004  $  if(x==0x00)y=@09a4;else if(x==0x01)y=@09a5;else y=@01a9;
  $  073.车道保持系统                               $    $           $    $  ANS013.BYTE005  $  if(x==0x00)y=@09a6;else if(x==0x01)y=@09a7;else y=@01a9;
  $  074.紧急自动刹车系统                           $    $           $    $  ANS013.BYTE006  $  if(x==0x00)y=@09a8;else if(x==0x01)y=@09a9;else y=@01a9;
  $  075.盲区监测系统                               $    $           $    $  ANS013.BYTE007  $  if(x==0x00)y=@09aa;else if(x==0x01)y=@09ab;else y=@01a9;
  $  076.前向碰撞预警                               $    $           $    $  ANS013.BYTE008  $  if(x==0x00)y=@094f;else if(x==0x01)y=@0950;else y=@01a9;
  $  077.360度全景影像配置                          $    $           $    $  ANS013.BYTE009  $  if(x==0x00)y=@0951;else if(x==0x01)y=@0952;else if(x==0x02)y=@0953;else y=@01a9;
  $  078.车载显示器类型配置                         $    $           $    $  ANS013.BYTE010  $  if(x==0x00)y=@0954;else if(x==0x01)y=@0955;else if(x==0x02)y=@0956;else if(x==0x03)y=@0957;else if(x==0x04)y=@0958;else if(x==0x05)y=@0959;else if(x==0x06)y=@095a;else if(x==0x07)y=@095b;else y=@01a9;
  $  079.车联网匹配                                 $    $           $    $  ANS014.BYTE004  $  if(x==0x00)y=@048c;else if(x==0x01)y=@06e1;else if(x==0x02)y=@048e;else y=@01a9;
  $  080.安卓亿连                                   $    $           $    $  ANS014.BYTE005  $  if(x==0x00)y=@095c;else if(x==0x01)y=@095d;else y=@01a9;
  $  081.Carplay                                    $    $           $    $  ANS014.BYTE006  $  if(x==0x00)y=@095c;else if(x==0x01)y=@095d;else y=@01a9;
  $  082.迎宾灯                                     $    $           $    $  ANS014.BYTE007  $  if(x==0x00)y=@095e;else if(x==0x01)y=@095f;else y=@01a9;
  $  083.氛围灯颜色配置                             $    $           $    $  ANS014.BYTE008  $  if(x==0x00) y=@0960;else if(x==0x01) y=@0961;else if(x==0x02) y=@0962;else if(x==0x03) y=@0963;else if(x==0x04) y=@0964;else if(x==0x05) y=@0965;else if(x==0x06) y=@0966;else y=@01a9;
  $  084.氛围灯分区调节                             $    $           $    $  ANS014.BYTE009  $  if(x==0x00)y=@0967;else if(x==0x01)y=@0968;else y=@01a9;
  $  085.座椅记忆模块                               $    $           $    $  ANS014.BYTE010  $  if(x==0x00)y=@094d;else if(x==0x01)y=@094e;else y=@01a9;
  $  086.后排乘客区电动玻璃                         $    $           $    $  ANS015.BYTE004  $  if((x&0x80)==0x80)y=@0445;else y=@0112;
  $  087.后排乘客区电动玻璃一键自动下               $    $           $    $  ANS015.BYTE004  $  if((x&0x40)==0x40)y=@0445;else y=@0112;
  $  088.副驾驶员电动玻璃                           $    $           $    $  ANS015.BYTE004  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  089.副驾驶员电动玻璃一键自动下                 $    $           $    $  ANS015.BYTE004  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  090.副驾驶员电动玻璃一键自动上下(带防夹)       $    $           $    $  ANS015.BYTE004  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  091.驾驶员电动玻璃                             $    $           $    $  ANS015.BYTE004  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  092.驾驶员电动玻璃一键自动下                   $    $           $    $  ANS015.BYTE004  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  093.驾驶员电动玻璃一键自动上下(带防夹)         $    $           $    $  ANS015.BYTE004  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  094.车辆导航配置                               $    $           $    $  ANS015.BYTE005  $  if(x==0x00)y=@0739;else if(x==0x01)y=@05aa;else y=@01a9;
  $  095.免提配置                                   $    $           $    $  ANS015.BYTE006  $  if(x==0x00)y=@073b;else if(x==0x01)y=@073a;else y=@01a9;
  $  096.车载信息娱乐系统显示级别类型配置           $    $           $    $  ANS016.BYTE004  $  if(x==0x00) y=@073c;else if(x==0x01) y=@097a;else if(x==0x02) y=@097b;else if(x==0x03) y=@097c;else if(x==0x04) y=@097d;else if(x==0x05) y=@097e;else y=@01a9;
  $  097.DAB数字音频广播配置                        $    $           $    $  ANS016.BYTE005  $  if(x==0x00)y=@0692;else if(x==0x01)y=@0740;else y=@01a9;
  $  098.驻车辅助系统类型配置                       $    $           $    $  ANS016.BYTE006  $  if(x==0x00) y=@097f;else if(x==0x01) y=@0980;else if(x==0x02) y=@0981;else if(x==0x03) y=@0982;else y=@01a9;
  $  099.后视摄像头类型配置                         $    $           $    $  ANS016.BYTE007  $  if(x==0x00) y=@0710;else if(x==0x01) y=@0983;else if(x==0x02) y=@0984;else if(x==0x03) y=@0985;else if(x==0x04) y=@0986;else y=@01a9;
  $  100.360度全景摄像类型配置                      $    $           $    $  ANS016.BYTE008  $  if(x==0x00) y=@0987;else if(x==0x01) y=@0988;else if(x==0x02) y=@0989;else if(x==0x03) y=@098a;else y=@01a9;
  $  101.方向盘遥控功能配置                         $    $           $    $  ANS017.BYTE004  $  if(x==0x00) y=@0969;else if(x==0x01) y=@096a;else if(x==0x02) y=@096b;else y=@01a9;
  $  102.汽车音频类型配置                           $    $           $    $  ANS017.BYTE005  $  if(x==0x00)y=@0714;else if(x==0x01)y=@0715;else if(x==0x02)y=@0716;else if(x==0x03)y=@0717;else y=@01a9;
  $  103.AUX(音频)端口配置                          $    $           $    $  ANS017.BYTE006  $  if(x==0x00) y=@096c;else if(x==0x01) y=@0718;else y=@01a9;
  $  104.视频输入功能配置                           $    $           $    $  ANS017.BYTE007  $  if(x==0x00) y=@096d;else if(x==0x01) y=@071a;else y=@01a9;
  $  105.USB端口类型配置                            $    $           $    $  ANS018.BYTE004  $  if(x==0x00)y=@096e;else if(x==0x01)y=@071e;else if(x==0x02)y=@071c;else y=@01a9;
  $  106.200千赫兹--FM                              $    $           $    $  ANS018.BYTE005  $  if((x&0x40)==0x40)y=@0445;else y=@0112;
  $  107.50千赫兹--FM                               $    $           $    $  ANS018.BYTE005  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  108.100千赫兹--FM                              $    $           $    $  ANS018.BYTE005  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  109.10千赫兹--AM                               $    $           $    $  ANS018.BYTE005  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  110.9千赫兹--AM                                $    $           $    $  ANS018.BYTE005  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  111.87.7-107.9兆赫兹--FM                       $    $           $    $  ANS018.BYTE006  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  112.87.5-108兆赫兹--FM                         $    $           $    $  ANS018.BYTE006  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  113.522-1629千赫兹--AM                         $    $           $    $  ANS018.BYTE006  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  114.522-1710千赫兹--AM                         $    $           $    $  ANS018.BYTE006  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  115.530-1710千赫兹--AM                         $    $           $    $  ANS018.BYTE006  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  116.531-1602千赫兹--AM                         $    $           $    $  ANS018.BYTE006  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  117.扬声器类型配置                             $    $           $    $  ANS018.BYTE007  $  if(x==0x00)y=@069d;else if(x==0x01)y=@069e;else if(x==0x02)y=@069f;else if(x==0x03)y=@06a0;else if(x==0x04)y=@06a1;else y=@01a9;
  $  118.IPOD设备配置                               $    $           $    $  ANS019.BYTE004  $  if(x==0x00)y=@0692;else if(x==0x01)y=@096f;else y=@01a9;
  $  119.汽车车型年份配置                           $    $           $    $  ANS019.BYTE005  $  if(x==0x00) y=@0970;else if(x==0x01) y=@0971;else if(x==0x02) y=@0972;else if(x==0x03) y=@0973;else if(x==0x04) y=@0974;else if(x==0x05) y=@0975;else if(x==0x06) y=@0976;else if(x==0x07) y=@0977;else if(x==0x08) y=@0978;else y=@01a9;
  $  120.车型系列配置                               $    $           $    $  ANS019.BYTE006  $  if(x==0x00) y=@0004;else if(x==0x01) y=@0004;else if(x==0x02) y=@0004;else if(x==0x03) y=@0004;else if(x==0x04) y=@0004;else if(x==0x05) y=@0004;else if(x==0x06) y=@058d;else y=@01a9;
  $  121.汽车品牌配置                               $    $           $    $  ANS020.BYTE004  $  if(x==0x00) y=@066a;else if(x==0x01) y=@066b;else if(x==0x02) y=@0979;else y=@01a9;
  $  122.汽车国家代码配置                           $    $           $    $  ANS020.BYTE005  $  if(x==0x00) y=@00d8;else if(x==0x01) y=@066d;else if(x==0x02) y=@066e;else if(x==0x03) y=@066f;else if(x==0x04) y=@0670;else if(x==0x05) y=@0671;else if(x==0x06) y=@0672;else if(x==0x07) y=@0673;else if(x==0x08) y=@0674;else if(x==0x09) y=@0675;else if(x==0x0A) y=@0676;else if(x==0x0B) y=@0677;else if(x==0x0C) y=@0678;else if(x==0x0D) y=@0679;else if(x==0x0E) y=@067a;else if(x==0x0F) y=@067b;else if(x==0x10) y=@067c;else if(x==0x11) y=@09c9;else if(x==0x12) y=@08c2;else if(x==0x13) y=@08b6;else if(x==0x14) y=@09ca;else if(x==0x15) y=@09cb;else if(x==0x16) y=@09cc;else if(x==0x17) y=@08b7;else y=@01a9;
  $  123.主驾驶方向配置                             $    $           $    $  ANS020.BYTE006  $  if(x==0x00)y=@067d;else if(x==0x01)y=@067e;else y=@01a9;
  $  124.自动变速箱                                 $    $           $    $  ANS020.BYTE007  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  125.手动变速箱                                 $    $           $    $  ANS020.BYTE007  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  126.汽油发动机                                 $    $           $    $  ANS020.BYTE007  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  127.柴油发动机                                 $    $           $    $  ANS020.BYTE007  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  128.变速箱类型配置                             $    $           $    $  ANS021.BYTE004  $  if(x==0x00)y=@0687;else if(x==0x01)y=@0688;else if(x==0x02)y=@0689;else y=@01a9;
  $  129.尾门控制类型配置                           $    $           $    $  ANS021.BYTE005  $  if(x==0x00)y=@0690;else if(x==0x01)y=@09cd;else if(x==0x02)y=@09ce;else y=@01a9;
  $  130.行人警告系统配置                           $    $           $    $  ANS021.BYTE006  $  if(x==0x00)y=@0692;else if(x==0x01)y=@08ec;else y=@01a9;
  $  131.车速报警系统配置                           $    $           $    $  ANS022.BYTE004  $  if(x==0x00)y=@0692;else if(x==0x01)y=@09cf;else y=@01a9;
  $  132.自动紧急呼叫配置                           $    $           $    $  ANS022.BYTE005  $  if(x==0x00)y=@0692;else if(x==0x01)y=@03de;else y=@01a9;
  $  133.汽车天窗类型配置                           $    $           $    $  ANS022.BYTE006  $  if(x==0x00)y=@0695;else if(x==0x01)y=@0693;else if(x==0x02)y=@0694;else y=@01a9;
  $  134.混合动力类型配置                           $    $           $    $  ANS022.BYTE007  $  if(x==0x00)y=@09d0;else if(x==0x01)y=@06cd;else if(x==0x02)y=@06ce;else if(x==0x03)y=@09d1;else y=@01a9;
  $  135.主动经济驾驶模式配置                       $    $           $    $  ANS023.BYTE004  $  if(x==0x00)y=@09be;else if(x==0x01)y=@09bf;else y=@01a9;
  $  136.光线传感器配置                             $    $           $    $  ANS023.BYTE005  $  if(x==0x00)y=@09c0;else if(x==0x01)y=@09c1;else y=@01a9;
  $  137.车辆空气净化系统配置                       $    $           $    $  ANS024.BYTE004  $  if(x==0x00)y=@08ea;else if(x==0x01)y=@08e7;else if(x==0x02)y=@08e8;else if(x==0x03)y=@08e9;else y=@01a9;
  $  138.车型配置                                   $    $           $    $  ANS024.BYTE005  $  if(x==0x00)y=@09c2;else if(x==0x01)y=@09c3;else if(x==0x02)y=@09c4;else y=@01a9;
  $  139.GPS芯片配置                                $    $           $    $  ANS024.BYTE006  $  if(x==0x00)y=@09c5;else if(x==0x01)y=@06d9;else y=@01a9;
  $  140.语音识别配置                               $    $           $    $  ANS025.BYTE004  $  if(x==0x00)y=@06da;else if(x==0x01)y=@05b0;else y=@01a9;
  $  141.ESP/ABS节点配置                            $    $           $    $  ANS025.BYTE005  $  if(x==0x00)y=@09c6;else if(x==0x01)y=@09c7;else if(x==0x02)y=@09c8;else y=@01a9;
  $  142.SAS配置                                    $    $           $    $  ANS025.BYTE006  $  if(x==0x00)y=@06ba;else if(x==0x01)y=@06b9;else y=@01a9;
  $  143.PEPS配置                                   $    $           $    $  ANS025.BYTE007  $  if(x==0x00)y=@003d;else if(x==0x01)y=@06bb;else y=@01a9;
  $  144.WIFI配置                                   $    $           $    $  ANS026.BYTE004  $  if(x==0x00)y=@09d2;else if(x==0x01)y=@09d3;else y=@01a9;
  $  145.轴距配置                                   $    $           $    $  ANS026.BYTE005  $  if(x==0x00)y=@06be;else if(x==0x01)y=@06bf;else if(x==0x02)y=@09d4;else y=@01a9;
  $  146.底盘高度配置                               $    $           $    $  ANS026.BYTE006  $  if(x==0x00)y=@06c0;else if(x==0x01)y=@06c1;else y=@01a9;
  $  147.驱动类型配置                               $    $           $    $  ANS026.BYTE007  $  if(x==0x00)y=@09d5;else if(x==0x01)y=@0559;else if(x==0x02)y=@09d6;else if(x==0x03)y=@05dd;else y=@01a9;
  $  148.车速限制功能配置                           $    $           $    $  ANS026.BYTE008  $  if(x==0x00)y=@09d7;else if(x==0x01)y=@09d8;else if(x==0x02)y=@09d9;else y=@01a9;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
