
    车型ID：1086

    模拟：协议模拟-->1086

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k

进入命令:

  $~  REQ000:742 02 10 01 00 00 00 00 00       $~  ANS000:7C2 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:742 02 3E 80 00 00 00 00 00       $!  ANS000:7C2 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:742 03 19 02 09 00 00 00 00       $#  ANS000:7C2 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/5b000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:742 04 14 FF FF FF 00 00 00       $$  ANS000:7C2 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:742 03 22 F1 86 00 00 00 00       $%  ANS000:7C2 03 22 F1 86 00 00 00 00
  $%  REQ001:742 03 22 F1 93 00 00 00 00       $%  ANS001:7C2 03 22 F1 93 00 00 00 00
  $%  REQ002:742 03 22 F1 95 00 00 00 00       $%  ANS002:7C2 03 22 F1 95 00 00 00 00
  $%  REQ003:742 03 22 F1 91 00 00 00 00       $%  ANS003:7C2 03 22 F1 91 00 00 00 00
  $%  REQ004:742 03 22 F1 87 00 00 00 00       $%  ANS004:7C2 03 22 F1 87 00 00 00 00
  $%  REQ005:742 03 22 F1 A0 00 00 00 00       $%  ANS005:7C2 03 22 F1 A0 00 00 00 00
  $%  REQ006:742 03 22 F1 90 00 00 00 00       $%  ANS006:7C2 03 22 F1 90 00 00 00 00
  $%  REQ007:742 03 22 F1 A8 00 00 00 00       $%  ANS007:7C2 03 22 F1 A8 00 00 00 00

  $%  000:当前诊断模式:                                $%    $%  ANS000.BYTE004  $%  HEX(X1);
  $%  001:博世电控单元硬件版本号:                      $%    $%  ANS001.BYTE004  $%  HEX(X1);
  $%  002:博士电控单元软件版本号(BB号):                $%    $%  ANS002.BYTE004  $%  HEX(X1,X2,X3);
  $%  003:博士电控单元软件版本号(阶段):                $%    $%  ANS002.BYTE004  $%  ASCII(X1);
  $%  004:博士电控单元软件版本号(气囊代码):            $%    $%  ANS002.BYTE004  $%  HEX(X1);
  $%  005:博士电控单元软件版本号(项目编号):            $%    $%  ANS002.BYTE004  $%  HEX(X1);
  $%  006:博士电控单元软件版本号(日期):                $%    $%  ANS002.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  007:博士电控单元软件版本号(序列号和类别):        $%    $%  ANS002.BYTE004  $%  HEX(X1);
  $%  008:博士电控单元软件版本号(制造商):              $%    $%  ANS002.BYTE004  $%  ASCII(X1,X2);
  $%  009:SAIC硬件版本号:                              $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  010:SAIC零件号:                                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  011:SAIC软件版本号:                              $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:VIN码:                                       $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  013:车辆特征信息:                                $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.一般数据流
  $  00.一般数据流
  $  REQ000:742 03 22 F1 A5 00 00 00 00       $  ANS000:7C2 03 22 F1 A5 00 00 00 00
  $  REQ001:742 03 22 F1 96 00 00 00 00       $  ANS001:7C2 03 22 F1 96 00 00 00 00
  $  REQ002:742 03 22 F1 9A 00 00 00 00       $  ANS002:7C2 03 22 F1 9A 00 00 00 00
  $  REQ003:742 03 22 F1 9D 00 00 00 00       $  ANS003:7C2 03 22 F1 9D 00 00 00 00
  $  REQ004:742 03 22 F1 98 00 00 00 00       $  ANS004:7C2 03 22 F1 98 00 00 00 00
  $  REQ005:742 03 22 F1 87 00 00 00 00       $  ANS005:7C2 03 22 F1 87 00 00 00 00
  $  REQ006:742 03 22 F1 9B 00 00 00 00       $  ANS006:7C2 03 22 F1 9B 00 00 00 00
  $  REQ007:742 03 22 F1 A8 00 00 00 00       $  ANS007:7C2 03 22 F1 A8 00 00 00 00
  $  REQ008:742 03 22 F1 90 00 00 00 00       $  ANS008:7C2 03 22 F1 90 00 00 00 00

  $  000.前排乘员侧安全带(BTFP)               $    $       $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  001.驾驶员侧安全带(BTFD)                 $    $       $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  002.前乘客气囊(ABFP)                     $    $       $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  003.驾驶员气囊(ABFD)                     $    $       $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  004.前排乘员侧PAS(PASFP)                 $    $       $    $  ANS000.BYTE006  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  005.驾驶员侧PAS(PASFD)                   $    $       $    $  ANS000.BYTE006  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  006.碰撞输出信号来自CAN                  $    $       $    $  ANS000.BYTE008  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  007.系统警告灯状态来自CAN                $    $       $    $  ANS000.BYTE008  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  008.碰撞输出信号来自硬件线               $    $       $    $  ANS000.BYTE009  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  009.博世零件号                           $    $       $    $  ANS001.BYTE004  $  ASCII(x1,x2,x3,x4);
  $  010.EEPROM版本                           $    $       $    $  ANS001.BYTE008  $  HEX(X1);
  $  011.实际运行时间                         $    $       $    $  ANS001.BYTE009  $  HEX(X1,X2,X3,X4);
  $  012.上电/下电 计数器                     $    $       $    $  ANS001.BYTE013  $  HEX(X1,X2,X3,X4);
  $  013.客户模式                             $    $       $    $  ANS002.BYTE004  $  if(x==0x00)y=@043c;else if(x==0xFF)y=@043d;else y=@01a9;
  $  014.车辆生产日期                         $    $       $    $  ANS003.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6);
  $  015.上次保养日期                         $    $       $    $  ANS004.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6);
  $  016.电控单元零件号                       $    $       $    $  ANS005.BYTE004  $  ASCII(X1);
  $  017.电控单元零件号2                      $    $       $    $  ANS005.BYTE005  $  HEX(X1,X2,X3,X4,X5);
  $  018.系统警告灯CAN设备状态                $    $       $    $  ANS006.BYTE004  $  if((x&0xE0)==0x00)y=@028b;else if((x&0xE0)==0x20)y=@043e;else if((x&0xE0)==0xE0)y=@043f;else y=@01a9;
  $  019.系统警告灯CAN设备客户编程状态        $    $       $    $  ANS006.BYTE004  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  020.系统警告灯硬件设备状态               $    $       $    $  ANS006.BYTE004  $  if((x&0x0E)==0x00)y=@028b;else if((x&0x0E)==0x02)y=@043e;else if((x&0x0E)==0x04)y=@04d2;else if((x&0x0E)==0x0E)y=@043f;else y=@01a9;
  $  021.系统警告灯硬件设备客户编程状态       $    $       $    $  ANS006.BYTE004  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  022.碰撞输出CAN设备状态                  $    $       $    $  ANS006.BYTE008  $  if((x&0xE0)==0x00)y=@0441;else if((x&0xE0)==0x20)y=@0442;else if((x&0xE0)==0xE0)y=@04d0;else y=@01a9;
  $  023.碰撞输出CAN设备客户编程状态          $    $       $    $  ANS006.BYTE008  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  024.碰撞输出硬件设备状态                 $    $       $    $  ANS006.BYTE008  $  if((x&0x0E)==0x00)y=@0441;else if((x&0x0E)==0x02)y=@0442;else if((x&0x0E)==0x04)y=@04d1;else if((x&0x0E)==0x0E)y=@04d0;else y=@01a9;
  $  025.碰撞输出硬件设备客户编程状态         $    $       $    $  ANS006.BYTE008  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  026.车辆特征信息                         $    $       $    $  ANS007.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  027.VIN码                                $    $       $    $  ANS008.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);

  $)  01.碰撞记录数据1
  $  01.碰撞记录数据1
  $  REQ000:742 03 22 F1 D2 00 00 00 00       $  ANS000:7C2 03 22 F1 D2 00 00 00 00

  $  000.最终碰撞代码                                         $    $           $    $  ANS000.BYTE004  $  HEX(X);
  $  001.碰撞次数记录器                                       $    $           $    $  ANS000.BYTE005  $  y=x;
  $  002.发生碰撞时后排中间乘员座位安全带指示警告灯状态       $    $           $    $  ANS000.BYTE006  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@043e;else y=@0004;
  $  003.发生碰撞时后排乘客座位安全带指示警告灯状态           $    $           $    $  ANS000.BYTE006  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x0C)==0x04)y=@043e;else y=@0004;
  $  004.发生碰撞时后驾驶侧座位安全带指示警告灯状态           $    $           $    $  ANS000.BYTE006  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@043e;else y=@0004;
  $  005.发生碰撞时前排乘员安全带指示警告灯状态               $    $           $    $  ANS000.BYTE007  $  if((x&0xC0)==0x00)y=@028b;else if((x&0xC0)==0x40)y=@043e;else y=@0004;
  $  006.发生碰撞时驾驶员安全带指示警告灯状态                 $    $           $    $  ANS000.BYTE007  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@043e;else y=@0004;
  $  007.发生碰撞时PADI警告灯状态                             $    $           $    $  ANS000.BYTE007  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x0C)==0x04)y=@043e;else y=@0004;
  $  008.发生碰撞时系统警告灯状态                             $    $           $    $  ANS000.BYTE007  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@043e;else y=@0004;
  $  009.PASFP故障状态                                        $    $           $    $  ANS000.BYTE008  $  if((x&0x08)==0x08)y=@00b3;else y=@0197;
  $  010.PASFD故障状态                                        $    $           $    $  ANS000.BYTE008  $  if((x&0x04)==0x04)y=@00b3;else y=@0197;
  $  011.主传感器柱2故障状态                                  $    $           $    $  ANS000.BYTE008  $  if((x&0x02)==0x02)y=@00b3;else y=@0197;
  $  012.主传感器柱1故障状态                                  $    $           $    $  ANS000.BYTE008  $  if((x&0x01)==0x01)y=@00b3;else y=@0197;
  $  013.DIS ALP全低功率级                                    $    $           $    $  ANS000.BYTE009  $  if((x&0x20)==0x20)y=@00db;else y=@00dc;
  $  014.DIS ALP全高功率级                                    $    $           $    $  ANS000.BYTE009  $  if((x&0x10)==0x10)y=@00db;else y=@00dc;
  $  015.DIS SFL HW硬件线禁能状态                             $    $           $    $  ANS000.BYTE009  $  if((x&0x08)==0x08)y=@00db;else y=@00dc;
  $  016.前排乘员监测坐垫开关状态                             $    $           $    $  ANS000.BYTE011  $  if((x&0xC0)==0x00)y=@0ba5;else if((x&0xC0)==0x40)y=@0ba6;else y=@01a9;
  $  017.前排乘员气囊是否激活开关                             $    $           $    $  ANS000.BYTE011  $  if((x&0x30)==0x00)y=@0ba5;else if((x&0x30)==0x10)y=@0ba6;else y=@01a9;
  $  018.前排乘员扣带安全状态                                 $    $           $    $  ANS000.BYTE011  $  if((x&0x0C)==0x00)y=@0ba5;else if((x&0x0C)==0x04)y=@0ba6;else y=@01a9;
  $  019.驾驶员扣带开关状态                                   $    $           $    $  ANS000.BYTE011  $  if((x&0x03)==0x00)y=@0ba5;else if((x&0x03)==0x01)y=@0ba6;else y=@01a9;
  $  020.从RAM中获取的故障码记录                              $    $           $    $  ANS000.BYTE012  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  021.车速                                                 $    $  km/h     $    $  ANS000.BYTE036  $  y=x1*256+x2;
  $  022.运行时间计数器                                       $    $  s        $    $  ANS000.BYTE038  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  023.碰撞类型                                             $    $           $    $  ANS000.BYTE042  $  if((x1*256+x2)==0x0001)y=@04c9;else if((x1*256+x2)==0x0002)y=@0449;else if((x1*256+x2)==0x0004)y=@044a;else if((x1*256+x2)==0x0008)y=@044b;else if((x1*256+x2)==0x0020)y=@044d;else if((x1*256+x2)==0x0040)y=@044e;else if((x1*256+x2)==0x0080)y=@044f;else if((x1*256+x2)==0x0100)y=@044c;else y=@0004;
  $  024.前Algo启动时间                                       $    $  ms       $    $  ANS000.BYTE044  $  y=(x1*256+x2)*0.5;
  $  025.侧碰撞算法启动时间                                   $    $  ms       $    $  ANS000.BYTE046  $  y=(x1*256+x2)*0.5;
  $  026.后碰撞算法启动时间                                   $    $  ms       $    $  ANS000.BYTE048  $  y=(x1*256+x2)*0.5;
  $  027.碰撞发生到阈值接近的时间                             $    $  ms       $    $  ANS000.BYTE050  $  y=(x1*256+x2)*0.5;
  $  028.碰撞发生到安全带预紧阈值超出的时间                   $    $  ms       $    $  ANS000.BYTE052  $  y=(x1*256+x2)*0.5;
  $  029.碰撞发生到前气囊引爆阈值超出的时间                   $    $  ms       $    $  ANS000.BYTE054  $  y=(x1*256+x2)*0.5;
  $  030.碰撞发生到侧气囊引爆阈值超出的时间                   $    $  ms       $    $  ANS000.BYTE056  $  y=(x1*256+x2)*0.5;
  $  031.算法复位时间                                         $    $  ms       $    $  ANS000.BYTE058  $  y=(x1*256+x2)*0.5;
  $  032.碰撞发生到ECU X轴最大加速度时间                      $    $  ms       $    $  ANS000.BYTE060  $  y=(x1*256+x2)*0.5;
  $  033.碰撞发生到ECU Y轴最大加速度时间                      $    $  ms       $    $  ANS000.BYTE062  $  y=(x1*256+x2)*0.5;
  $  034.碰撞发生到前驾驶员PAS最大加速时间                    $    $  ms       $    $  ANS000.BYTE064  $  y=(x1*256+x2)*0.5;
  $  035.碰撞发生到前排乘员PAS最大加速时间                    $    $  ms       $    $  ANS000.BYTE066  $  y=(x1*256+x2)*0.5;
  $  036.碰撞发生到PASMD/UFSD最大加速属时间                   $    $  ms       $    $  ANS000.BYTE068  $  y=(x1*256+x2)*0.5;
  $  037.碰撞发生到PASMP/UFSP最大加速时间                     $    $  ms       $    $  ANS000.BYTE070  $  y=(x1*256+x2)*0.5;
  $  038.可靠性                                               $    $           $    $  ANS000.BYTE075  $  if(x==0x00)y=@04ca;else if(x==0x01)y=@04cb;else if(x==0x02)y=@04cc;else y=@01a9;
  $  039.Algo激活期间X轴最大加速度时间                        $    $  g        $    $  ANS000.BYTE076  $  y=x*0.8;
  $  040.Algo激活期间Y轴最大加速度时间                        $    $  g        $    $  ANS000.BYTE077  $  y=x*0.8;
  $  041.Algo激活期间PASFD最大加速时间                        $    $  g        $    $  ANS000.BYTE078  $  y=x;
  $  042.Algo激活期间PASFP最大加速时间                        $    $  g        $    $  ANS000.BYTE079  $  y=x;
  $  043.Algo激活期间PASFD/UFSD最大加速时间                   $    $  g        $    $  ANS000.BYTE080  $  y=x;
  $  044.Algo激活期间PASFP/UFSP最大加速时间                   $    $  g        $    $  ANS000.BYTE081  $  y=x;
  $  045.Delta速度                                            $    $           $    $  ANS000.BYTE082  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  046.驾驶员安全带引爆计数器                               $    $           $    $  ANS000.BYTE102  $  y=x;
  $  047.前排乘员安全带引爆计数器                             $    $           $    $  ANS000.BYTE103  $  y=x;
  $  048.驾驶员气囊引爆计数器                                 $    $           $    $  ANS000.BYTE104  $  y=x;
  $  049.前排乘员气囊引爆计数器                               $    $           $    $  ANS000.BYTE105  $  y=x;
  $  050.驾驶员侧气囊引爆计数器                               $    $           $    $  ANS000.BYTE106  $  y=x;
  $  051.乘员侧气囊引爆计数器                                 $    $           $    $  ANS000.BYTE107  $  y=x;
  $  052.驾驶员气帘引爆计数器                                 $    $           $    $  ANS000.BYTE108  $  y=x;
  $  053.前排乘员气帘引爆计数器                               $    $           $    $  ANS000.BYTE109  $  y=x;
  $  054.驾驶员膝气袋引爆计数器                               $    $           $    $  ANS000.BYTE110  $  y=x;
  $  055.前排乘员膝气袋引爆计数器                             $    $           $    $  ANS000.BYTE111  $  y=x;
  $  056.后驾驶侧安全带引爆计数器                             $    $           $    $  ANS000.BYTE112  $  y=x;
  $  057.后乘客侧安全带引爆计数器                             $    $           $    $  ANS000.BYTE113  $  y=x;
  $  058.后驾驶侧侧气囊引爆计数器                             $    $           $    $  ANS000.BYTE114  $  y=x;
  $  059.后乘客侧侧气囊引爆计数器                             $    $           $    $  ANS000.BYTE115  $  y=x;
  $  060.在碰撞发生时的能量储备电压                           $    $  V        $    $  ANS000.BYTE116  $  y=x*0.2;
  $  061.在气囊引爆后的能量储备电压                           $    $  V        $    $  ANS000.BYTE117  $  y=x*0.2;
  $  062.引爆前电源电压                                       $    $  V        $    $  ANS000.BYTE118  $  y=x*0.1;
  $  063.引爆后电源电压                                       $    $  V        $    $  ANS000.BYTE119  $  y=x*0.1;
  $  064.碰撞输出状态                                         $    $           $    $  ANS000.BYTE120  $  if((x&0x01)==0x01)y=@0004;else y=@04cf;

  $)  02.碰撞记录数据2
  $  02.碰撞记录数据2
  $  REQ000:742 03 22 F1 D3 00 00 00 00       $  ANS000:7C2 03 22 F1 D3 00 00 00 00

  $  000.最终碰撞代码                                         $    $           $    $  ANS000.BYTE004  $  HEX(X);
  $  001.碰撞次数记录器                                       $    $           $    $  ANS000.BYTE005  $  y=x;
  $  002.发生碰撞时后排中间乘员座位安全带指示警告灯状态       $    $           $    $  ANS000.BYTE006  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@043e;else y=@0004;
  $  003.发生碰撞时后排乘客座位安全带指示警告灯状态           $    $           $    $  ANS000.BYTE006  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x0C)==0x04)y=@043e;else y=@0004;
  $  004.发生碰撞时后驾驶侧座位安全带指示警告灯状态           $    $           $    $  ANS000.BYTE006  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@043e;else y=@0004;
  $  005.发生碰撞时前排乘员安全带指示警告灯状态               $    $           $    $  ANS000.BYTE007  $  if((x&0xC0)==0x00)y=@028b;else if((x&0xC0)==0x40)y=@043e;else y=@0004;
  $  006.发生碰撞时驾驶员安全带指示警告灯状态                 $    $           $    $  ANS000.BYTE007  $  if((x&0x30)==0x00)y=@028b;else if((x&0x30)==0x10)y=@043e;else y=@0004;
  $  007.发生碰撞时PADI警告灯状态                             $    $           $    $  ANS000.BYTE007  $  if((x&0x0C)==0x00)y=@028b;else if((x&0x0C)==0x04)y=@043e;else y=@0004;
  $  008.发生碰撞时系统警告灯状态                             $    $           $    $  ANS000.BYTE007  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@043e;else y=@0004;
  $  009.PASFP故障状态                                        $    $           $    $  ANS000.BYTE008  $  if((x&0x08)==0x08)y=@00b3;else y=@0197;
  $  010.PASFD故障状态                                        $    $           $    $  ANS000.BYTE008  $  if((x&0x04)==0x04)y=@00b3;else y=@0197;
  $  011.主传感器柱2故障状态                                  $    $           $    $  ANS000.BYTE008  $  if((x&0x02)==0x02)y=@00b3;else y=@0197;
  $  012.主传感器柱1故障状态                                  $    $           $    $  ANS000.BYTE008  $  if((x&0x01)==0x01)y=@00b3;else y=@0197;
  $  013.DIS ALP全低功率级                                    $    $           $    $  ANS000.BYTE009  $  if((x&0x20)==0x20)y=@00db;else y=@00dc;
  $  014.DIS ALP全高功率级                                    $    $           $    $  ANS000.BYTE009  $  if((x&0x10)==0x10)y=@00db;else y=@00dc;
  $  015.DIS SFL HW硬件线禁能状态                             $    $           $    $  ANS000.BYTE009  $  if((x&0x08)==0x08)y=@00db;else y=@00dc;
  $  016.前排乘员监测坐垫开关状态                             $    $           $    $  ANS000.BYTE011  $  if((x&0xC0)==0x00)y=@0ba5;else if((x&0xC0)==0x40)y=@0ba6;else y=@01a9;
  $  017.前排乘员气囊是否激活开关                             $    $           $    $  ANS000.BYTE011  $  if((x&0x30)==0x00)y=@0ba5;else if((x&0x30)==0x10)y=@0ba6;else y=@01a9;
  $  018.前排乘员扣带安全状态                                 $    $           $    $  ANS000.BYTE011  $  if((x&0x0C)==0x00)y=@0ba5;else if((x&0x0C)==0x04)y=@0ba6;else y=@01a9;
  $  019.驾驶员扣带开关状态                                   $    $           $    $  ANS000.BYTE011  $  if((x&0x03)==0x00)y=@0ba5;else if((x&0x03)==0x01)y=@0ba6;else y=@01a9;
  $  020.从RAM中获取的故障码记录                              $    $           $    $  ANS000.BYTE012  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  021.车速                                                 $    $  km/h     $    $  ANS000.BYTE036  $  y=x1*256+x2;
  $  022.运行时间计数器                                       $    $  s        $    $  ANS000.BYTE038  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  023.碰撞类型                                             $    $           $    $  ANS000.BYTE042  $  if((x1*256+x2)==0x0001)y=@04c9;else if((x1*256+x2)==0x0002)y=@0449;else if((x1*256+x2)==0x0004)y=@044a;else if((x1*256+x2)==0x0008)y=@044b;else if((x1*256+x2)==0x0020)y=@044d;else if((x1*256+x2)==0x0040)y=@044e;else if((x1*256+x2)==0x0080)y=@044f;else if((x1*256+x2)==0x0100)y=@044c;else y=@0004;
  $  024.前Algo启动时间                                       $    $  ms       $    $  ANS000.BYTE044  $  y=(x1*256+x2)*0.5;
  $  025.侧碰撞算法启动时间                                   $    $  ms       $    $  ANS000.BYTE046  $  y=(x1*256+x2)*0.5;
  $  026.后碰撞算法启动时间                                   $    $  ms       $    $  ANS000.BYTE048  $  y=(x1*256+x2)*0.5;
  $  027.碰撞发生到阈值接近的时间                             $    $  ms       $    $  ANS000.BYTE050  $  y=(x1*256+x2)*0.5;
  $  028.碰撞发生到安全带预紧阈值超出的时间                   $    $  ms       $    $  ANS000.BYTE052  $  y=(x1*256+x2)*0.5;
  $  029.碰撞发生到前气囊引爆阈值超出的时间                   $    $  ms       $    $  ANS000.BYTE054  $  y=(x1*256+x2)*0.5;
  $  030.碰撞发生到侧气囊引爆阈值超出的时间                   $    $  ms       $    $  ANS000.BYTE056  $  y=(x1*256+x2)*0.5;
  $  031.算法复位时间                                         $    $  ms       $    $  ANS000.BYTE058  $  y=(x1*256+x2)*0.5;
  $  032.碰撞发生到ECU X轴最大加速度时间                      $    $  ms       $    $  ANS000.BYTE060  $  y=(x1*256+x2)*0.5;
  $  033.碰撞发生到ECU Y轴最大加速度时间                      $    $  ms       $    $  ANS000.BYTE062  $  y=(x1*256+x2)*0.5;
  $  034.碰撞发生到前驾驶员PAS最大加速时间                    $    $  ms       $    $  ANS000.BYTE064  $  y=(x1*256+x2)*0.5;
  $  035.碰撞发生到前排乘员PAS最大加速时间                    $    $  ms       $    $  ANS000.BYTE066  $  y=(x1*256+x2)*0.5;
  $  036.碰撞发生到PASMD/UFSD最大加速属时间                   $    $  ms       $    $  ANS000.BYTE068  $  y=(x1*256+x2)*0.5;
  $  037.碰撞发生到PASMP/UFSP最大加速时间                     $    $  ms       $    $  ANS000.BYTE070  $  y=(x1*256+x2)*0.5;
  $  038.可靠性                                               $    $           $    $  ANS000.BYTE075  $  if(x==0x00)y=@04ca;else if(x==0x01)y=@04cb;else if(x==0x02)y=@04cc;else y=@01a9;
  $  039.Algo激活期间X轴最大加速度时间                        $    $  g        $    $  ANS000.BYTE076  $  y=x*0.8;
  $  040.Algo激活期间Y轴最大加速度时间                        $    $  g        $    $  ANS000.BYTE077  $  y=x*0.8;
  $  041.Algo激活期间PASFD最大加速时间                        $    $  g        $    $  ANS000.BYTE078  $  y=x;
  $  042.Algo激活期间PASFP最大加速时间                        $    $  g        $    $  ANS000.BYTE079  $  y=x;
  $  043.Algo激活期间PASFD/UFSD最大加速时间                   $    $  g        $    $  ANS000.BYTE080  $  y=x;
  $  044.Algo激活期间PASFP/UFSP最大加速时间                   $    $  g        $    $  ANS000.BYTE081  $  y=x;
  $  045.Delta速度                                            $    $           $    $  ANS000.BYTE082  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  046.驾驶员安全带引爆计数器                               $    $           $    $  ANS000.BYTE102  $  y=x;
  $  047.前排乘员安全带引爆计数器                             $    $           $    $  ANS000.BYTE103  $  y=x;
  $  048.驾驶员气囊引爆计数器                                 $    $           $    $  ANS000.BYTE104  $  y=x;
  $  049.前排乘员气囊引爆计数器                               $    $           $    $  ANS000.BYTE105  $  y=x;
  $  050.驾驶员侧气囊引爆计数器                               $    $           $    $  ANS000.BYTE106  $  y=x;
  $  051.乘员侧气囊引爆计数器                                 $    $           $    $  ANS000.BYTE107  $  y=x;
  $  052.驾驶员气帘引爆计数器                                 $    $           $    $  ANS000.BYTE108  $  y=x;
  $  053.前排乘员气帘引爆计数器                               $    $           $    $  ANS000.BYTE109  $  y=x;
  $  054.驾驶员膝气袋引爆计数器                               $    $           $    $  ANS000.BYTE110  $  y=x;
  $  055.前排乘员膝气袋引爆计数器                             $    $           $    $  ANS000.BYTE111  $  y=x;
  $  056.后驾驶侧安全带引爆计数器                             $    $           $    $  ANS000.BYTE112  $  y=x;
  $  057.后乘客侧安全带引爆计数器                             $    $           $    $  ANS000.BYTE113  $  y=x;
  $  058.后驾驶侧侧气囊引爆计数器                             $    $           $    $  ANS000.BYTE114  $  y=x;
  $  059.后乘客侧侧气囊引爆计数器                             $    $           $    $  ANS000.BYTE115  $  y=x;
  $  060.在碰撞发生时的能量储备电压                           $    $  V        $    $  ANS000.BYTE116  $  y=x*0.2;
  $  061.在气囊引爆后的能量储备电压                           $    $  V        $    $  ANS000.BYTE117  $  y=x*0.2;
  $  062.引爆前电源电压                                       $    $  V        $    $  ANS000.BYTE118  $  y=x*0.1;
  $  063.引爆后电源电压                                       $    $  V        $    $  ANS000.BYTE119  $  y=x*0.1;
  $  064.碰撞输出状态                                         $    $           $    $  ANS000.BYTE120  $  if((x&0x01)==0x01)y=@0004;else y=@04cf;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:742 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
