
    车型ID：108c

    模拟：协议模拟-->108c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/8c000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 A0 00 00 00 00       $%  ANS000:7E9 03 22 F1 A0 00 00 00 00
  $%  REQ001:7E1 03 22 F1 83 00 00 00 00       $%  ANS001:7E9 03 22 F1 83 00 00 00 00
  $%  REQ002:7E1 03 22 F1 A1 00 00 00 00       $%  ANS002:7E9 03 22 F1 A1 00 00 00 00
  $%  REQ003:7E1 03 22 F1 91 00 00 00 00       $%  ANS003:7E9 03 22 F1 91 00 00 00 00
  $%  REQ004:7E1 03 22 F1 A2 00 00 00 00       $%  ANS004:7E9 03 22 F1 A2 00 00 00 00
  $%  REQ005:7E1 03 22 F1 87 00 00 00 00       $%  ANS005:7E9 03 22 F1 87 00 00 00 00
  $%  REQ006:7E1 03 22 F1 10 00 00 00 00       $%  ANS006:7E9 03 22 F1 10 00 00 00 00
  $%  REQ007:7E1 03 22 F1 92 00 00 00 00       $%  ANS007:7E9 03 22 F1 92 00 00 00 00
  $%  REQ008:7E1 03 22 F1 8C 00 00 00 00       $%  ANS008:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ009:7E1 03 22 F1 94 00 00 00 00       $%  ANS009:7E9 03 22 F1 94 00 00 00 00
  $%  REQ010:7E1 03 22 F1 8A 00 00 00 00       $%  ANS010:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ011:7E1 03 22 F1 90 00 00 00 00       $%  ANS011:7E9 03 22 F1 90 00 00 00 00
  $%  REQ012:7E1 03 22 F1 A8 00 00 00 00       $%  ANS012:7E9 03 22 F1 A8 00 00 00 00
  $%  REQ013:7E1 03 22 F1 8B 00 00 00 00       $%  ANS013:7E9 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试参考号(上次):                $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商识别码:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:VIN码:                           $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  015:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.换档杆相关数据流
  $  00.换档杆相关数据流
  $  REQ000:7E1 03 22 1C 9A 00 00 00 00       $  ANS000:7E9 03 22 1C 9A 00 00 00 00

  $  000.齿轮换档错误计数器       $    $       $    $  ANS000.BYTE004  $  y=x;
  $  001.自动模式错误计数器       $    $       $    $  ANS000.BYTE005  $  y=x;
  $  002.ECO按键错误计数器        $    $       $    $  ANS000.BYTE006  $  y=x;

  $)  01.执行器相关数据流
  $  01.执行器相关数据流
  $  REQ000:7E1 03 22 1C 98 00 00 00 00       $  ANS000:7E9 03 22 1C 98 00 00 00 00

  $  000.总齿轮换档计数器                 $    $         $    $  ANS000.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  001.泵打开计数器                     $    $         $    $  ANS000.BYTE008  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  002.泵错误计数器                     $    $         $    $  ANS000.BYTE012  $  y=x;
  $  003.压力误差计数器                   $    $         $    $  ANS000.BYTE013  $  y=x;
  $  004.拒绝脱离计数器                   $    $         $    $  ANS000.BYTE014  $  y=x;
  $  005.离合器在换档期间失败计数器       $    $         $    $  ANS000.BYTE015  $  y=x;
  $  006.啮合失败的计数器                 $    $         $    $  ANS000.BYTE016  $  y=x;
  $  007.换挡失败的计数器                 $    $         $    $  ANS000.BYTE017  $  y=x;
  $  008.换档块计数器                     $    $         $    $  ANS000.BYTE018  $  y=x;
  $  009.脱离失效的计数器                 $    $         $    $  ANS000.BYTE019  $  y=x;
  $  010.离合器打开故障计数器             $    $         $    $  ANS000.BYTE020  $  y=x;
  $  011.泄露高计数器                     $    $         $    $  ANS000.BYTE021  $  y=x;
  $  012.N档啮合计数器                    $    $         $    $  ANS000.BYTE022  $  y=x1*256+x2;
  $  013.1档啮合计数器                    $    $         $    $  ANS000.BYTE024  $  y=x1*256+x2;
  $  014.2档啮合计数器                    $    $         $    $  ANS000.BYTE026  $  y=x1*256+x2;
  $  015.3档啮合计数器                    $    $         $    $  ANS000.BYTE028  $  y=x1*256+x2;
  $  016.4档啮合计数器                    $    $         $    $  ANS000.BYTE030  $  y=x1*256+x2;
  $  017.5档啮合计数器                    $    $         $    $  ANS000.BYTE032  $  y=x1*256+x2;
  $  018.6档啮合计数器                    $    $         $    $  ANS000.BYTE034  $  y=x1*256+x2;
  $  019.R档啮合计数器                    $    $         $    $  ANS000.BYTE036  $  y=x1*256+x2;
  $  020.齿轮传动距离N                    $    $  km     $    $  ANS000.BYTE038  $  y=x1*256+x2;
  $  021.齿轮传动距离1                    $    $  km     $    $  ANS000.BYTE040  $  y=x1*256+x2;
  $  022.齿轮传动距离2                    $    $  km     $    $  ANS000.BYTE042  $  y=x1*256+x2;
  $  023.齿轮传动距离3                    $    $  km     $    $  ANS000.BYTE044  $  y=x1*256+x2;
  $  024.齿轮传动距离4                    $    $  km     $    $  ANS000.BYTE046  $  y=x1*256+x2;
  $  025.齿轮传动距离5                    $    $  km     $    $  ANS000.BYTE048  $  y=x1*256+x2;
  $  026.齿轮传动距离6                    $    $  km     $    $  ANS000.BYTE050  $  y=x1*256+x2;
  $  027.齿轮传动距离R                    $    $  km     $    $  ANS000.BYTE052  $  y=x1*256+x2;
  $  028.泵加热时间                       $    $  s      $    $  ANS000.BYTE054  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  029.离合器超速计数器                 $    $         $    $  ANS000.BYTE058  $  y=x;
  $  030.齿轮啮合错误计数器               $    $         $    $  ANS000.BYTE059  $  y=x;
  $  031.离合器关闭计数器                 $    $         $    $  ANS000.BYTE060  $  y=x;
  $  032.N档齿轮重试计数器                $    $         $    $  ANS000.BYTE061  $  y=x;
  $  033.1档齿轮重试计数器                $    $         $    $  ANS000.BYTE062  $  y=x;
  $  034.2档齿轮重试计数器                $    $         $    $  ANS000.BYTE063  $  y=x;
  $  035.3档齿轮重试计数器                $    $         $    $  ANS000.BYTE064  $  y=x;
  $  036.4档齿轮重试计数器                $    $         $    $  ANS000.BYTE065  $  y=x;
  $  037.5档齿轮重试计数器                $    $         $    $  ANS000.BYTE066  $  y=x;
  $  038.6档齿轮重试计数器                $    $         $    $  ANS000.BYTE067  $  y=x;
  $  039.R档齿轮重试计数器                $    $         $    $  ANS000.BYTE068  $  y=x;
  $  040.齿轮挡块重试计数器N              $    $         $    $  ANS000.BYTE069  $  y=x;
  $  041.齿轮挡块重试计数器1              $    $         $    $  ANS000.BYTE070  $  y=x;
  $  042.齿轮挡块重试计数器2              $    $         $    $  ANS000.BYTE071  $  y=x;
  $  043.齿轮挡块重试计数器3              $    $         $    $  ANS000.BYTE072  $  y=x;
  $  044.齿轮挡块重试计数器4              $    $         $    $  ANS000.BYTE073  $  y=x;
  $  045.齿轮挡块重试计数器5              $    $         $    $  ANS000.BYTE074  $  y=x;
  $  046.齿轮挡块重试计数器6              $    $         $    $  ANS000.BYTE075  $  y=x;
  $  047.齿轮挡块重试计数器R              $    $         $    $  ANS000.BYTE076  $  y=x;
  $  048.齿轮换档失败的计数器N            $    $         $    $  ANS000.BYTE077  $  y=x;
  $  049.齿轮换档失败的计数器1            $    $         $    $  ANS000.BYTE078  $  y=x;
  $  050.齿轮换档失败的计数器2            $    $         $    $  ANS000.BYTE079  $  y=x;
  $  051.齿轮换档失败的计数器3            $    $         $    $  ANS000.BYTE080  $  y=x;
  $  052.齿轮换档失败的计数器4            $    $         $    $  ANS000.BYTE081  $  y=x;
  $  053.齿轮换档失败的计数器5            $    $         $    $  ANS000.BYTE082  $  y=x;
  $  054.齿轮换档失败的计数器6            $    $         $    $  ANS000.BYTE083  $  y=x;
  $  055.齿轮换档失败的计数器R            $    $         $    $  ANS000.BYTE084  $  y=x;
  $  056.泵过热计数器                     $    $         $    $  ANS000.BYTE085  $  y=x;
  $  057.系统误用的计数器                 $    $         $    $  ANS000.BYTE086  $  y=x;
  $  058.档位自学习有效性                 $    $         $    $  ANS000.BYTE087  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  059.EV换档零点完成                   $    $         $    $  ANS000.BYTE087  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  060.离合器零流量完成                 $    $         $    $  ANS000.BYTE087  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  061.磨损指数学习完成                 $    $         $    $  ANS000.BYTE087  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  062.啮合学习完成                     $    $         $    $  ANS000.BYTE087  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  063.网格自动执行成功执行计数器       $    $         $    $  ANS000.BYTE088  $  y=x;

  $)  02.变速箱相关数据流
  $  02.变速箱相关数据流
  $  REQ000:7E1 03 22 1C 99 00 00 00 00       $  ANS000:7E9 03 22 1C 99 00 00 00 00

  $  000.总齿轮换档计数器               $    $         $    $  ANS000.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  001.意外脱离的计数器               $    $         $    $  ANS000.BYTE008  $  y=x;
  $  002.啮合失败的计数器               $    $         $    $  ANS000.BYTE009  $  y=x;
  $  003.换档失败的计数器               $    $         $    $  ANS000.BYTE010  $  y=x;
  $  004.换档块计数器                   $    $         $    $  ANS000.BYTE011  $  y=x;
  $  005.脱离失效的计数器               $    $         $    $  ANS000.BYTE012  $  y=x;
  $  006.N档啮合计数器                  $    $         $    $  ANS000.BYTE013  $  y=x1*256+x2;
  $  007.1档啮合计数器                  $    $         $    $  ANS000.BYTE015  $  y=x1*256+x2;
  $  008.2档啮合计数器                  $    $         $    $  ANS000.BYTE017  $  y=x1*256+x2;
  $  009.3档啮合计数器                  $    $         $    $  ANS000.BYTE019  $  y=x1*256+x2;
  $  010.4档啮合计数器                  $    $         $    $  ANS000.BYTE021  $  y=x1*256+x2;
  $  011.5档啮合计数器                  $    $         $    $  ANS000.BYTE023  $  y=x1*256+x2;
  $  012.6档啮合计数器                  $    $         $    $  ANS000.BYTE025  $  y=x1*256+x2;
  $  013.R档啮合计数器                  $    $         $    $  ANS000.BYTE027  $  y=x1*256+x2;
  $  014.齿轮传动距离N                  $    $  km     $    $  ANS000.BYTE029  $  y=x1*256+x2;
  $  015.齿轮传动距离1                  $    $  km     $    $  ANS000.BYTE031  $  y=x1*256+x2;
  $  016.齿轮传动距离2                  $    $  km     $    $  ANS000.BYTE033  $  y=x1*256+x2;
  $  017.齿轮传动距离3                  $    $  km     $    $  ANS000.BYTE035  $  y=x1*256+x2;
  $  018.齿轮传动距离4                  $    $  km     $    $  ANS000.BYTE037  $  y=x1*256+x2;
  $  019.齿轮传动距离5                  $    $  km     $    $  ANS000.BYTE039  $  y=x1*256+x2;
  $  020.齿轮传动距离6                  $    $  km     $    $  ANS000.BYTE041  $  y=x1*256+x2;
  $  021.齿轮传动距离R                  $    $  km     $    $  ANS000.BYTE043  $  y=x1*256+x2;
  $  022.离合器超速计数器               $    $         $    $  ANS000.BYTE045  $  y=x;
  $  023.齿轮啮合错误计数器             $    $         $    $  ANS000.BYTE046  $  y=x;
  $  024.N档齿轮重试计数器              $    $         $    $  ANS000.BYTE047  $  y=x;
  $  025.1档齿轮重试计数器              $    $         $    $  ANS000.BYTE048  $  y=x;
  $  026.2档齿轮重试计数器              $    $         $    $  ANS000.BYTE049  $  y=x;
  $  027.3档齿轮重试计数器              $    $         $    $  ANS000.BYTE050  $  y=x;
  $  028.4档齿轮重试计数器              $    $         $    $  ANS000.BYTE051  $  y=x;
  $  029.5档齿轮重试计数器              $    $         $    $  ANS000.BYTE052  $  y=x;
  $  030.6档齿轮重试计数器              $    $         $    $  ANS000.BYTE053  $  y=x;
  $  031.R档齿轮重试计数器              $    $         $    $  ANS000.BYTE054  $  y=x;
  $  032.齿轮挡块重试计数器N            $    $         $    $  ANS000.BYTE055  $  y=x;
  $  033.齿轮挡块重试计数器1            $    $         $    $  ANS000.BYTE056  $  y=x;
  $  034.齿轮挡块重试计数器2            $    $         $    $  ANS000.BYTE057  $  y=x;
  $  035.齿轮挡块重试计数器3            $    $         $    $  ANS000.BYTE058  $  y=x;
  $  036.齿轮挡块重试计数器4            $    $         $    $  ANS000.BYTE059  $  y=x;
  $  037.齿轮挡块重试计数器5            $    $         $    $  ANS000.BYTE060  $  y=x;
  $  038.齿轮挡块重试计数器6            $    $         $    $  ANS000.BYTE061  $  y=x;
  $  039.齿轮挡块重试计数器R            $    $         $    $  ANS000.BYTE062  $  y=x;
  $  040.齿轮换档失败的计数器N          $    $         $    $  ANS000.BYTE063  $  y=x;
  $  041.齿轮换档失败的计数器1          $    $         $    $  ANS000.BYTE064  $  y=x;
  $  042.齿轮换档失败的计数器2          $    $         $    $  ANS000.BYTE065  $  y=x;
  $  043.齿轮换档失败的计数器3          $    $         $    $  ANS000.BYTE066  $  y=x;
  $  044.齿轮换档失败的计数器4          $    $         $    $  ANS000.BYTE067  $  y=x;
  $  045.齿轮换档失败的计数器5          $    $         $    $  ANS000.BYTE068  $  y=x;
  $  046.齿轮换档失败的计数器6          $    $         $    $  ANS000.BYTE069  $  y=x;
  $  047.齿轮换档失败的计数器R          $    $         $    $  ANS000.BYTE070  $  y=x;
  $  048.档位自学习有效性               $    $         $    $  ANS000.BYTE071  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  049.EV换档零点完成                 $    $         $    $  ANS000.BYTE071  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  050.离合器零流量完成               $    $         $    $  ANS000.BYTE071  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  051.磨损指数学习完成               $    $         $    $  ANS000.BYTE071  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  052.啮合学习完成                   $    $         $    $  ANS000.BYTE071  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  053.档位自学习成功执行计数器       $    $         $    $  ANS000.BYTE072  $  y=x;

  $)  03.车辆使用相关数据流
  $  03.车辆使用相关数据流
  $  REQ000:7E1 03 22 1C 9D 00 00 00 00       $  ANS000:7E9 03 22 1C 9D 00 00 00 00

  $  000.总换档计数器                 $    $         $    $  ANS000.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  001.泵打开计数器                 $    $         $    $  ANS000.BYTE008  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  002.N档啮合计数器                $    $         $    $  ANS000.BYTE012  $  y=x1*256+x2;
  $  003.1档啮合计数器                $    $         $    $  ANS000.BYTE014  $  y=x1*256+x2;
  $  004.2档啮合计数器                $    $         $    $  ANS000.BYTE016  $  y=x1*256+x2;
  $  005.3档啮合计数器                $    $         $    $  ANS000.BYTE018  $  y=x1*256+x2;
  $  006.4档啮合计数器                $    $         $    $  ANS000.BYTE020  $  y=x1*256+x2;
  $  007.5档啮合计数器                $    $         $    $  ANS000.BYTE022  $  y=x1*256+x2;
  $  008.6档啮合计数器                $    $         $    $  ANS000.BYTE024  $  y=x1*256+x2;
  $  009.R档啮合计数器                $    $         $    $  ANS000.BYTE026  $  y=x1*256+x2;
  $  010.齿轮传动距离N                $    $  km     $    $  ANS000.BYTE028  $  y=x1*256+x2;
  $  011.齿轮传动距离1                $    $  km     $    $  ANS000.BYTE030  $  y=x1*256+x2;
  $  012.齿轮传动距离2                $    $  km     $    $  ANS000.BYTE032  $  y=x1*256+x2;
  $  013.齿轮传动距离3                $    $  km     $    $  ANS000.BYTE034  $  y=x1*256+x2;
  $  014.齿轮传动距离4                $    $  km     $    $  ANS000.BYTE036  $  y=x1*256+x2;
  $  015.齿轮传动距离5                $    $  km     $    $  ANS000.BYTE038  $  y=x1*256+x2;
  $  016.齿轮传动距离6                $    $  km     $    $  ANS000.BYTE040  $  y=x1*256+x2;
  $  017.齿轮传动距离R                $    $  km     $    $  ANS000.BYTE042  $  y=x1*256+x2;
  $  018.泵的总时间开启               $    $  s      $    $  ANS000.BYTE044  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  019.TCU打开总时间                $    $  s      $    $  ANS000.BYTE048  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  020.齿轮箱自学成功的计数器       $    $         $    $  ANS000.BYTE052  $  y=x;

  $)  04.离合器相关数据流
  $  04.离合器相关数据流
  $  REQ000:7E1 03 22 1C 97 00 00 00 00       $  ANS000:7E9 03 22 1C 97 00 00 00 00

  $  000.啮合点                       $    $       $    $  ANS000.BYTE004  $  y=x1*256+x2;
  $  001.离合器关闭位置               $    $       $    $  ANS000.BYTE006  $  y=x1*256+x2;
  $  002.离合器磨损指数               $    $       $    $  ANS000.BYTE008  $  y=x1*256+x2;
  $  003.离合器过热时间               $    $       $    $  ANS000.BYTE010  $  y=x1*256+x2;
  $  004.档位自学习有效性             $    $       $    $  ANS000.BYTE012  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  005.EV换档零点完成               $    $       $    $  ANS000.BYTE012  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  006.离合器零流量完成             $    $       $    $  ANS000.BYTE012  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  007.磨损指数学习完成             $    $       $    $  ANS000.BYTE012  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  008.啮合学习完成                 $    $       $    $  ANS000.BYTE012  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  009.磨损指数快速自学习计数       $    $       $    $  ANS000.BYTE013  $  y=x;

  $)  05.油泵相关数据流
  $  05.油泵相关数据流
  $  REQ000:7E1 03 22 1C 9C 00 00 00 00       $  ANS000:7E9 03 22 1C 9C 00 00 00 00

  $  000.泵打开计数器           $    $        $    $  ANS000.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  001.泵故障误差计数器       $    $        $    $  ANS000.BYTE008  $  y=x*2;
  $  002.压力低误差计数器       $    $        $    $  ANS000.BYTE009  $  y=x*3;
  $  003.泵送时间               $    $  s     $    $  ANS000.BYTE010  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  004.泵过热计数器           $    $        $    $  ANS000.BYTE014  $  y=x;
  $  005.系统误用的计数器       $    $        $    $  ANS000.BYTE015  $  y=x;

  $)  06.故障计数
  $  06.故障计数
  $  REQ000:7E1 03 22 1E EE 00 00 00 00       $  ANS000:7E9 03 22 1E EE 00 00 00 00

  $  000.总换档计数器                           $    $         $    $  ANS000.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  001.泵打开计数器                           $    $         $    $  ANS000.BYTE008  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  002.离合器过热时间                         $    $         $    $  ANS000.BYTE012  $  y=x1*256+x2;
  $  003.泵故障误差计数器                       $    $         $    $  ANS000.BYTE014  $  y=x;
  $  004.压力低误差计数器                       $    $         $    $  ANS000.BYTE015  $  y=x;
  $  005.解除不需要的计数器                     $    $         $    $  ANS000.BYTE016  $  y=x;
  $  006.换档期间离合器关闭计数器               $    $         $    $  ANS000.BYTE017  $  y=x;
  $  007.啮合失败的计数器                       $    $         $    $  ANS000.BYTE018  $  y=x;
  $  008.换档失败的计数器                       $    $         $    $  ANS000.BYTE019  $  y=x;
  $  009.换档锁定的计数器                       $    $         $    $  ANS000.BYTE020  $  y=x;
  $  010.脱离失效的计数器                       $    $         $    $  ANS000.BYTE021  $  y=x;
  $  011.离合器打开失败的计数器                 $    $         $    $  ANS000.BYTE022  $  y=x;
  $  012.高泄露计数器                           $    $         $    $  ANS000.BYTE023  $  y=x;
  $  013.每个档位的计数器                       $    $         $    $  ANS000.BYTE032  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  014.每个档位的驾驶距离                     $    $  km     $    $  ANS000.BYTE048  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  015.泵打开总时间                           $    $         $    $  ANS000.BYTE056  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  016.离合器超速计数器                       $    $         $    $  ANS000.BYTE060  $  y=x;
  $  017.齿轮啮合错误计数器                     $    $         $    $  ANS000.BYTE061  $  y=x;
  $  018.换档前离合器打开计数器                 $    $         $    $  ANS000.BYTE062  $  y=x;
  $  019.齿轮为每个档位啮合重试计数器           $    $         $    $  ANS000.BYTE063  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  020.每个档位的换档重试计数器               $    $         $    $  ANS000.BYTE071  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  021.每个档位换档重试失败的计数器           $    $         $    $  ANS000.BYTE079  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  022.杠杆隧道开关的计数器总是关闭错误       $    $         $    $  ANS000.BYTE087  $  y=x;
  $  023.AUTO按钮计数器                         $    $         $    $  ANS000.BYTE088  $  y=x;
  $  024.泵温度计数器                           $    $         $    $  ANS000.BYTE089  $  y=x;
  $  025.系统误用的计数器                       $    $         $    $  ANS000.BYTE090  $  y=x;
  $  026.低电量计数器                           $    $         $    $  ANS000.BYTE091  $  y=x;
  $  027.泵继电器卡住错误计数器                 $    $         $    $  ANS000.BYTE092  $  y=x;
  $  028.ECO开关错误计数器                      $    $         $    $  ANS000.BYTE093  $  y=x;

  $)  07.一般数据流
  $  07.一般数据流
  $  REQ000:7E1 03 22 1C A5 00 00 00 00       $  ANS000:7E9 03 22 1C A5 00 00 00 00
  $  REQ001:7E1 03 22 1C 93 00 00 00 00       $  ANS001:7E9 03 22 1C 93 00 00 00 00
  $  REQ002:7E1 03 22 01 12 00 00 00 00       $  ANS002:7E9 03 22 01 12 00 00 00 00
  $  REQ003:7E1 03 22 1C 43 00 00 00 00       $  ANS003:7E9 03 22 1C 43 00 00 00 00
  $  REQ004:7E1 03 22 1C 50 00 00 00 00       $  ANS004:7E9 03 22 1C 50 00 00 00 00
  $  REQ005:7E1 03 22 1C 42 00 00 00 00       $  ANS005:7E9 03 22 1C 42 00 00 00 00
  $  REQ006:7E1 03 22 1C 5D 00 00 00 00       $  ANS006:7E9 03 22 1C 5D 00 00 00 00
  $  REQ007:7E1 03 22 1C 0B 00 00 00 00       $  ANS007:7E9 03 22 1C 0B 00 00 00 00
  $  REQ008:7E1 03 22 1C 60 00 00 00 00       $  ANS008:7E9 03 22 1C 60 00 00 00 00
  $  REQ009:7E1 03 22 1C 5F 00 00 00 00       $  ANS009:7E9 03 22 1C 5F 00 00 00 00
  $  REQ010:7E1 03 22 1C A1 00 00 00 00       $  ANS010:7E9 03 22 1C A1 00 00 00 00
  $  REQ011:7E1 03 22 1C 1C 00 00 00 00       $  ANS011:7E9 03 22 1C 1C 00 00 00 00
  $  REQ012:7E1 03 22 1C 1B 00 00 00 00       $  ANS012:7E9 03 22 1C 1B 00 00 00 00
  $  REQ013:7E1 03 22 1C 1D 00 00 00 00       $  ANS013:7E9 03 22 1C 1D 00 00 00 00
  $  REQ014:7E1 03 22 1C 18 00 00 00 00       $  ANS014:7E9 03 22 1C 18 00 00 00 00
  $  REQ015:7E1 03 22 1C 01 00 00 00 00       $  ANS015:7E9 03 22 1C 01 00 00 00 00
  $  REQ016:7E1 03 22 1C 0A 00 00 00 00       $  ANS016:7E9 03 22 1C 0A 00 00 00 00
  $  REQ017:7E1 03 22 1C A2 00 00 00 00       $  ANS017:7E9 03 22 1C A2 00 00 00 00
  $  REQ018:7E1 03 22 1C A0 00 00 00 00       $  ANS018:7E9 03 22 1C A0 00 00 00 00
  $  REQ019:7E1 03 22 1C 13 00 00 00 00       $  ANS019:7E9 03 22 1C 13 00 00 00 00
  $  REQ020:7E1 03 22 1C 16 00 00 00 00       $  ANS020:7E9 03 22 1C 16 00 00 00 00
  $  REQ021:7E1 03 22 1C 62 00 00 00 00       $  ANS021:7E9 03 22 1C 62 00 00 00 00
  $  REQ022:7E1 03 22 1C A3 00 00 00 00       $  ANS022:7E9 03 22 1C A3 00 00 00 00
  $  REQ023:7E1 03 22 1C 51 00 00 00 00       $  ANS023:7E9 03 22 1C 51 00 00 00 00
  $  REQ024:7E1 03 22 D0 01 00 00 00 00       $  ANS024:7E9 03 22 D0 01 00 00 00 00
  $  REQ025:7E1 03 22 1C 12 00 00 00 00       $  ANS025:7E9 03 22 1C 12 00 00 00 00
  $  REQ026:7E1 03 22 E1 01 00 00 00 00       $  ANS026:7E9 03 22 E1 01 00 00 00 00
  $  REQ027:7E1 03 22 1C 14 00 00 00 00       $  ANS027:7E9 03 22 1C 14 00 00 00 00
  $  REQ028:7E1 03 22 1C 15 00 00 00 00       $  ANS028:7E9 03 22 1C 15 00 00 00 00
  $  REQ029:7E1 03 22 AF FC 00 00 00 00       $  ANS029:7E9 03 22 AF FC 00 00 00 00
  $  REQ030:7E1 03 22 1C 58 00 00 00 00       $  ANS030:7E9 03 22 1C 58 00 00 00 00
  $  REQ031:7E1 03 22 1C 59 00 00 00 00       $  ANS031:7E9 03 22 1C 59 00 00 00 00
  $  REQ032:7E1 03 22 F1 F2 00 00 00 00       $  ANS032:7E9 03 22 F1 F2 00 00 00 00
  $  REQ033:7E1 03 22 1C 02 00 00 00 00       $  ANS033:7E9 03 22 1C 02 00 00 00 00
  $  REQ034:7E1 03 22 1C 1E 00 00 00 00       $  ANS034:7E9 03 22 1C 1E 00 00 00 00
  $  REQ035:7E1 03 22 1C 1F 00 00 00 00       $  ANS035:7E9 03 22 1C 1F 00 00 00 00
  $  REQ036:7E1 03 22 1C 1A 00 00 00 00       $  ANS036:7E9 03 22 1C 1A 00 00 00 00
  $  REQ037:7E1 03 22 1C A4 00 00 00 00       $  ANS037:7E9 03 22 1C A4 00 00 00 00
  $  REQ038:7E1 03 22 AF FE 00 00 00 00       $  ANS038:7E9 03 22 AF FE 00 00 00 00
  $  REQ039:7E1 03 22 AF FD 00 00 00 00       $  ANS039:7E9 03 22 AF FD 00 00 00 00
  $  REQ040:7E1 03 22 AF FF 00 00 00 00       $  ANS040:7E9 03 22 AF FF 00 00 00 00
  $  REQ041:7E1 03 22 1C 52 00 00 00 00       $  ANS041:7E9 03 22 1C 52 00 00 00 00
  $  REQ042:7E1 03 22 1C 17 00 00 00 00       $  ANS042:7E9 03 22 1C 17 00 00 00 00
  $  REQ043:7E1 03 22 1C 5A 00 00 00 00       $  ANS043:7E9 03 22 1C 5A 00 00 00 00
  $  REQ044:7E1 03 22 1C 77 00 00 00 00       $  ANS044:7E9 03 22 1C 77 00 00 00 00
  $  REQ045:7E1 03 22 1C 0C 00 00 00 00       $  ANS045:7E9 03 22 1C 0C 00 00 00 00
  $  REQ046:7E1 03 22 1C 05 00 00 00 00       $  ANS046:7E9 03 22 1C 05 00 00 00 00
  $  REQ047:7E1 03 22 1C 41 00 00 00 00       $  ANS047:7E9 03 22 1C 41 00 00 00 00
  $  REQ048:7E1 03 22 1C 0E 00 00 00 00       $  ANS048:7E9 03 22 1C 0E 00 00 00 00
  $  REQ049:7E1 03 22 1C 0D 00 00 00 00       $  ANS049:7E9 03 22 1C 0D 00 00 00 00
  $  REQ050:7E1 03 22 1C 0F 00 00 00 00       $  ANS050:7E9 03 22 1C 0F 00 00 00 00
  $  REQ051:7E1 03 22 1C B1 00 00 00 00       $  ANS051:7E9 03 22 1C B1 00 00 00 00
  $  REQ052:7E1 03 22 1C 10 00 00 00 00       $  ANS052:7E9 03 22 1C 10 00 00 00 00
  $  REQ053:7E1 03 22 1C 03 00 00 00 00       $  ANS053:7E9 03 22 1C 03 00 00 00 00
  $  REQ054:7E1 03 22 1C 04 00 00 00 00       $  ANS054:7E9 03 22 1C 04 00 00 00 00
  $  REQ055:7E1 03 22 1C 5B 00 00 00 00       $  ANS055:7E9 03 22 1C 5B 00 00 00 00
  $  REQ056:7E1 03 22 1C 47 00 00 00 00       $  ANS056:7E9 03 22 1C 47 00 00 00 00
  $  REQ057:7E1 03 22 01 0C 00 00 00 00       $  ANS057:7E9 03 22 01 0C 00 00 00 00
  $  REQ058:7E1 03 22 1C 78 00 00 00 00       $  ANS058:7E9 03 22 1C 78 00 00 00 00
  $  REQ059:7E1 03 22 1C 45 00 00 00 00       $  ANS059:7E9 03 22 1C 45 00 00 00 00
  $  REQ060:7E1 03 22 1C 44 00 00 00 00       $  ANS060:7E9 03 22 1C 44 00 00 00 00
  $  REQ061:7E1 03 22 1C 61 00 00 00 00       $  ANS061:7E9 03 22 1C 61 00 00 00 00
  $  REQ062:7E1 03 22 1C 8A 00 00 00 00       $  ANS062:7E9 03 22 1C 8A 00 00 00 00
  $  REQ063:7E1 03 22 1C 95 00 00 00 00       $  ANS063:7E9 03 22 1C 95 00 00 00 00
  $  REQ064:7E1 03 22 1C 06 00 00 00 00       $  ANS064:7E9 03 22 1C 06 00 00 00 00
  $  REQ065:7E1 03 22 1C 65 00 00 00 00       $  ANS065:7E9 03 22 1C 65 00 00 00 00
  $  REQ066:7E1 03 22 1C 64 00 00 00 00       $  ANS066:7E9 03 22 1C 64 00 00 00 00
  $  REQ067:7E1 03 22 1C 92 00 00 00 00       $  ANS067:7E9 03 22 1C 92 00 00 00 00
  $  REQ068:7E1 03 22 1C 8E 00 00 00 00       $  ANS068:7E9 03 22 1C 8E 00 00 00 00
  $  REQ069:7E1 03 22 1C 91 00 00 00 00       $  ANS069:7E9 03 22 1C 91 00 00 00 00
  $  REQ070:7E1 03 22 1C 94 00 00 00 00       $  ANS070:7E9 03 22 1C 94 00 00 00 00
  $  REQ071:7E1 03 22 1C 8F 00 00 00 00       $  ANS071:7E9 03 22 1C 8F 00 00 00 00
  $  REQ072:7E1 03 22 1C 90 00 00 00 00       $  ANS072:7E9 03 22 1C 90 00 00 00 00
  $  REQ073:7E1 03 22 1C 8D 00 00 00 00       $  ANS073:7E9 03 22 1C 8D 00 00 00 00
  $  REQ074:7E1 03 22 1C 79 00 00 00 00       $  ANS074:7E9 03 22 1C 79 00 00 00 00
  $  REQ075:7E1 03 22 1C 80 00 00 00 00       $  ANS075:7E9 03 22 1C 80 00 00 00 00
  $  REQ076:7E1 03 22 1C 8C 00 00 00 00       $  ANS076:7E9 03 22 1C 8C 00 00 00 00
  $  REQ077:7E1 03 22 1C 11 00 00 00 00       $  ANS077:7E9 03 22 1C 11 00 00 00 00
  $  REQ078:7E1 03 22 1C 5E 00 00 00 00       $  ANS078:7E9 03 22 1C 5E 00 00 00 00

  $  000.加速度偏移状态                         $    $               $    $  ANS000.BYTE004  $  if(x==0x00) y=@028e;else if(x==0x01)y=@028d;else y=@01a9;
  $  001.档位自学习有效性                       $    $               $    $  ANS001.BYTE004  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  002.EV换档零点完成                         $    $               $    $  ANS001.BYTE004  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  003.离合器零流量完成                       $    $               $    $  ANS001.BYTE004  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  004.磨损指数学习完成                       $    $               $    $  ANS001.BYTE004  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  005.啮合学习完成                           $    $               $    $  ANS001.BYTE004  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  006.电瓶电压                               $    $  V            $    $  ANS002.BYTE004  $  y=x*0.1;
  $  007.离合器电磁阀IO学习值                   $    $  mA           $    $  ANS003.BYTE004  $  y=x*7.8;
  $  008.离合器错误开启计数                     $    $               $    $  ANS004.BYTE004  $  y=x;
  $  009.离合器啮合点自动设置                   $    $  mm           $    $  ANS005.BYTE004  $  y=(x1*256+x2)*0.037;
  $  010.离合器超速计数                         $    $               $    $  ANS006.BYTE004  $  y=x;
  $  011.离合器速度                             $    $  rpm          $    $  ANS007.BYTE004  $  y=(x1*256+x2);
  $  012.换档过程中离合器未按要求闭合次数       $    $               $    $  ANS008.BYTE004  $  y=x;
  $  013.起步阶段离合器未按要求闭合次数         $    $               $    $  ANS009.BYTE004  $  y=x;
  $  014.当前故障                               $    $               $    $  ANS010.BYTE004  $  if(x==0x00) y=@0197;else if(x==0x01)y=@00b3;else y=@01a9;
  $  015.N档运行距离                            $    $               $    $  ANS011.BYTE004  $  y=(x1*256+x2);
  $  016.1档运行距离                            $    $               $    $  ANS011.BYTE006  $  y=(x1*256+x2);
  $  017.2档运行距离                            $    $               $    $  ANS011.BYTE008  $  y=(x1*256+x2);
  $  018.3档运行距离                            $    $               $    $  ANS011.BYTE010  $  y=(x1*256+x2);
  $  019.4档运行距离                            $    $               $    $  ANS011.BYTE012  $  y=(x1*256+x2);
  $  020.5档运行距离                            $    $               $    $  ANS011.BYTE014  $  y=(x1*256+x2);
  $  021.6档运行距离                            $    $               $    $  ANS011.BYTE016  $  y=(x1*256+x2);
  $  022.R档运行距离                            $    $               $    $  ANS011.BYTE018  $  y=(x1*256+x2);
  $  023.N档接合计数                            $    $               $    $  ANS012.BYTE004  $  y=(x1*256+x2);
  $  024.1档接合计数                            $    $               $    $  ANS012.BYTE006  $  y=(x1*256+x2);
  $  025.2档接合计数                            $    $               $    $  ANS012.BYTE008  $  y=(x1*256+x2);
  $  026.3档接合计数                            $    $               $    $  ANS012.BYTE010  $  y=(x1*256+x2);
  $  027.4档接合计数                            $    $               $    $  ANS012.BYTE012  $  y=(x1*256+x2);
  $  028.5档接合计数                            $    $               $    $  ANS012.BYTE014  $  y=(x1*256+x2);
  $  029.6档接合计数                            $    $               $    $  ANS012.BYTE016  $  y=(x1*256+x2);
  $  030.R档接合计数                            $    $               $    $  ANS012.BYTE018  $  y=(x1*256+x2);
  $  031.N档接合重试计数                        $    $               $    $  ANS013.BYTE004  $  y=x;
  $  032.1档接合重试计数                        $    $               $    $  ANS013.BYTE005  $  y=x;
  $  033.2档接合重试计数                        $    $               $    $  ANS013.BYTE006  $  y=x;
  $  034.3档接合重试计数                        $    $               $    $  ANS013.BYTE007  $  y=x;
  $  035.4档接合重试计数                        $    $               $    $  ANS013.BYTE008  $  y=x;
  $  036.5档接合重试计数                        $    $               $    $  ANS013.BYTE009  $  y=x;
  $  037.6档接合重试计数                        $    $               $    $  ANS013.BYTE010  $  y=x;
  $  038.R档接合重试计数                        $    $               $    $  ANS013.BYTE010  $  y=x;
  $  039.N档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE004  $  y=(x1*256+x2);
  $  040.1档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE006  $  y=(x1*256+x2);
  $  041.2档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE008  $  y=(x1*256+x2);
  $  042.3档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE010  $  y=(x1*256+x2);
  $  043.4档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE012  $  y=(x1*256+x2);
  $  044.5档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE014  $  y=(x1*256+x2);
  $  045.6档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE016  $  y=(x1*256+x2);
  $  046.R档电磁阀工作时的挂挡极限位置          $    $               $    $  ANS014.BYTE018  $  y=(x1*256+x2);
  $  047.接合拨叉位置                           $    $  mm           $    $  ANS015.BYTE004  $  y=(x1*256+x2)*0.05;
  $  048.发动机转速                             $    $  rpm          $    $  ANS016.BYTE004  $  y=(x1*256+x2);
  $  049.档位指示                               $    $               $    $  ANS017.BYTE004  $  if(x==0x00) y=@0297;else if(x==0x01)y=@0298;else y=@01a9;
  $  050.换档模式                               $    $               $    $  ANS018.BYTE004  $  if(x==0x00) y=@0296;else if(x==0x01)y=@0253;else if(x==0x04)y=@0267;else if(x==0x05)y=@0136;else y=@01a9;
  $  051.齿轮啮合                               $    $               $    $  ANS019.BYTE004  $  if(x==0x00) y=@0001;else if(x==0x01)y=@006f;else if(x==0x02)y=@0070;else if(x==0x03)y=@0299;else if(x==0x04)y=@029a;else if(x==0x05)y=@0073;else if(x==0x06)y=@0074;else if(x==0x07)y=@029b;else y=@01a9;
  $  052.齿轮啮合                               $    $               $    $  ANS020.BYTE004  $  if(x==0x00) y=@0001;else if(x==0x01)y=@006f;else if(x==0x02)y=@0070;else if(x==0x03)y=@0299;else if(x==0x04)y=@029a;else if(x==0x05)y=@0073;else if(x==0x06)y=@0074;else y=@01a9;
  $  053.变速箱下线自调试错误代码               $    $               $    $  ANS021.BYTE004  $  if(x==0x00) y=@029c;else if(x==0x01)y=@029d;else if(x==0x02)y=@029e;else if(x==0x03)y=@029f;else if(x==0x04)y=@02a0;else if(x==0x05)y=@02a1;else if(x==0x06)y=@02a2;else if(x==0x07)y=@02a3;else if(x==0x08)y=@02a4;else if(x==0x09)y=@02a5;else if(x==0x0A)y=@02a6;else if(x==0x0B)y=@02a7;else if(x==0x0C)y=@02a8;else if(x==0x0D)y=@027c;else if(x==0x0E)y=@027d;else if(x==0x0F)y=@027e;else y=@01a9;
  $  054.普通故障                               $    $               $    $  ANS022.BYTE004  $  if(x==0x00) y=@027f;else if(x==0x01)y=@0280;else y=@01a9;
  $  055.档位格栅合理性                         $    $               $    $  ANS023.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  056.全局KL.50状态                          $    $               $    $  ANS024.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  057.全局发动机运行状态                     $    $               $    $  ANS024.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  058.全局KL.15状态                          $    $               $    $  ANS024.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  059.全局KL.R状态                           $    $               $    $  ANS024.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  060.系统KL.50状态                          $    $               $    $  ANS024.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  061.系统发动机运行状态                     $    $               $    $  ANS024.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  062.系统KL.15状态                          $    $               $    $  ANS024.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  063.系统KL.R状态                           $    $               $    $  ANS024.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  064.变速杆位置                             $    $               $    $  ANS025.BYTE004  $  if(x==0xFF) y=@028f;else if(x==0xFC)y=@0290;else if(x==0xFB)y=@0291;else if(x==0xFA)y=@0292;else if(x==0xF9)y=@0293;else if(x==0xF3)y=@0294;else y=@01a9;
  $  065.里程表读数                             $    $  km           $    $  ANS026.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  066.模式开关                               $    $               $    $  ANS027.BYTE004  $  if((x&0x20)==0x20)y=@0295;else y=@0296;
  $  067.驾驶员车门开启                         $    $               $    $  ANS027.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  068.制动CAN信号                            $    $               $    $  ANS027.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  069.K15                                    $    $               $    $  ANS027.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  070.K50                                    $    $               $    $  ANS027.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  071.曲柄继电器                             $    $               $    $  ANS028.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  072.蜂鸣器打开                             $    $               $    $  ANS028.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  073.泵继电器                               $    $               $    $  ANS028.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  074.刷写次数                               $    $               $    $  ANS029.BYTE004  $  y=(x1*256+x2);
  $  075.泵启动计数                             $    $               $    $  ANS030.BYTE004  $  y=(x1*256+x2)*42949/65535.0;
  $  076.泵启动时间                             $    $  min          $    $  ANS031.BYTE004  $  y=(x1*256+x2)*42949/65535.0;
  $  077.SMP软件版本                            $    $               $    $  ANS032.BYTE004  $  y=(x1*256+x2);
  $  078.选择栏位置                             $    $  mm           $    $  ANS033.BYTE004  $  y=(x1*256+x2)*0.05;
  $  079.N档选择错误重试计数                    $    $               $    $  ANS034.BYTE004  $  y=x;
  $  080.1档选择错误重试计数                    $    $               $    $  ANS034.BYTE005  $  y=x;
  $  081.2档选择错误重试计数                    $    $               $    $  ANS034.BYTE006  $  y=x;
  $  082.3档选择错误重试计数                    $    $               $    $  ANS034.BYTE007  $  y=x;
  $  083.4档选择错误重试计数                    $    $               $    $  ANS034.BYTE008  $  y=x;
  $  084.5档选择错误重试计数                    $    $               $    $  ANS034.BYTE009  $  y=x;
  $  085.6档选择错误重试计数                    $    $               $    $  ANS034.BYTE010  $  y=x;
  $  086.R档选择错误重试计数                    $    $               $    $  ANS034.BYTE010  $  y=x;
  $  087.N档选择锁定重试计数                    $    $               $    $  ANS035.BYTE004  $  y=x;
  $  088.1档选择锁定重试计数                    $    $               $    $  ANS035.BYTE005  $  y=x;
  $  089.2档选择锁定重试计数                    $    $               $    $  ANS035.BYTE006  $  y=x;
  $  090.3档选择锁定重试计数                    $    $               $    $  ANS035.BYTE007  $  y=x;
  $  091.4档选择锁定重试计数                    $    $               $    $  ANS035.BYTE008  $  y=x;
  $  092.5档选择锁定重试计数                    $    $               $    $  ANS035.BYTE009  $  y=x;
  $  093.6档选择锁定重试计数                    $    $               $    $  ANS035.BYTE010  $  y=x;
  $  094.R档选择锁定重试计数                    $    $               $    $  ANS035.BYTE010  $  y=x;
  $  095.N档选档位置区间                        $    $               $    $  ANS036.BYTE004  $  y=(x1*256+x2);
  $  096.1档选档位置区间                        $    $               $    $  ANS036.BYTE006  $  y=(x1*256+x2);
  $  097.2档选档位置区间                        $    $               $    $  ANS036.BYTE008  $  y=(x1*256+x2);
  $  098.3档选档位置区间                        $    $               $    $  ANS036.BYTE010  $  y=(x1*256+x2);
  $  099.4档选档位置区间                        $    $               $    $  ANS036.BYTE012  $  y=(x1*256+x2);
  $  100.5档选档位置区间                        $    $               $    $  ANS036.BYTE014  $  y=(x1*256+x2);
  $  101.6档选档位置区间                        $    $               $    $  ANS036.BYTE016  $  y=(x1*256+x2);
  $  102.R档选档位置区间                        $    $               $    $  ANS036.BYTE018  $  y=(x1*256+x2);
  $  103.保养提示                               $    $               $    $  ANS037.BYTE004  $  if(x==0x00) y=@028b;else if(x==0x01)y=@028c;else y=@01a9;
  $  104.软件兼容性状态                         $    $               $    $  ANS038.BYTE004  $  y=x;
  $  105.软件完整性状态                         $    $               $    $  ANS039.BYTE004  $  y=x;
  $  106.软件有效标志位                         $    $               $    $  ANS040.BYTE004  $  y=x;
  $  107.连续格栅调整计数                       $    $               $    $  ANS041.BYTE004  $  y=x;
  $  108.确认挂入N档位置                        $    $               $    $  ANS042.BYTE004  $  y=(x1*256+x2);
  $  109.确认挂入1档位置                        $    $               $    $  ANS042.BYTE006  $  y=(x1*256+x2);
  $  110.确认挂入2档位置                        $    $               $    $  ANS042.BYTE008  $  y=(x1*256+x2);
  $  111.确认挂入3档位置                        $    $               $    $  ANS042.BYTE010  $  y=(x1*256+x2);
  $  112.确认挂入4档位置                        $    $               $    $  ANS042.BYTE012  $  y=(x1*256+x2);
  $  113.确认挂入5档位置                        $    $               $    $  ANS042.BYTE014  $  y=(x1*256+x2);
  $  114.确认挂入6档位置                        $    $               $    $  ANS042.BYTE016  $  y=(x1*256+x2);
  $  115.确认挂入R档位置                        $    $               $    $  ANS042.BYTE018  $  y=(x1*256+x2);
  $  116.系统启动时间                           $    $  min          $    $  ANS043.BYTE004  $  y=(x1*256+x2)*42949/65535.0;
  $  117.总变速杆计数                           $    $               $    $  ANS044.BYTE004  $  y=(x1*256+x2)*42949/65535.0;
  $  118.车辆速度                               $    $  km/h         $    $  ANS045.BYTE004  $  y=x;
  $  119.加速踏板位置                           $    $  %            $    $  ANS046.BYTE004  $  y=x*102/255.0;
  $  120.自动设置封闭离合器位置                 $    $  mm           $    $  ANS047.BYTE004  $  y=(x1*256+x2)*0.037;
  $  121.偶数档EV电流                           $    $  mm           $    $  ANS048.BYTE004  $  y=(x1*256+x2)*0.05;
  $  122.奇数档EV电流                           $    $  mm           $    $  ANS049.BYTE004  $  y=(x1*256+x2)*0.05;
  $  123.离合器EV电流                           $    $  mm           $    $  ANS050.BYTE004  $  y=x*7.8;
  $  124.换档EV电流                             $    $  mm           $    $  ANS051.BYTE004  $  y=x*7.8;
  $  125.发动机给出的扭矩清除                   $    $  Nm           $    $  ANS052.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000));
  $  126.离合器执行器位置                       $    $  mm           $    $  ANS053.BYTE004  $  y=(x1*256+x2)*0.037;
  $  127.离合器执行器位置参考值                 $    $  mm           $    $  ANS054.BYTE004  $  y=(x1*256+x2)*0.037;
  $  128.离合器过热时间                         $    $  s            $    $  ANS055.BYTE004  $  y=(x1*256+x2);
  $  129.离合器磨损指数                         $    $               $    $  ANS056.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000));
  $  130.发动机水温                             $    $  degree C     $    $  ANS057.BYTE004  $  y=((x&0x7F)-(x&0x80)+40);
  $  131.错误啮合计数                           $    $               $    $  ANS058.BYTE004  $  y=x;
  $  132.估计离合器温度                         $    $  degree C     $    $  ANS059.BYTE004  $  y=x;
  $  133.估计油温                               $    $  degree C     $    $  ANS060.BYTE004  $  y=x;
  $  134.脱离故障计数                           $    $               $    $  ANS061.BYTE004  $  y=x;
  $  135.变速杆卡滞计数                         $    $               $    $  ANS062.BYTE004  $  y=x;
  $  136.高泄露阀计数                           $    $               $    $  ANS063.BYTE004  $  y=x;
  $  137.液压管路压力                           $    $  bar          $    $  ANS064.BYTE004  $  y=x;
  $  138.阀激活时的离合器EV泄露                 $    $               $    $  ANS065.BYTE004  $  y=(x1*256+x2)*0.6;
  $  139.阀关闭泄露                             $    $               $    $  ANS066.BYTE004  $  y=(x1*256+x2)*0.6;
  $  140.低电压计数                             $    $               $    $  ANS067.BYTE004  $  y=x;
  $  141.低压错误计数                           $    $               $    $  ANS068.BYTE004  $  y=x;
  $  142.误用错误计数                           $    $               $    $  ANS069.BYTE004  $  y=x;
  $  143.意外齿轮分离计数                       $    $               $    $  ANS070.BYTE004  $  y=x;
  $  144.泵错误计数                             $    $               $    $  ANS071.BYTE004  $  y=x;
  $  145.泵过热计数                             $    $               $    $  ANS072.BYTE004  $  y=x;
  $  146.泵继电器卡滞计数                       $    $               $    $  ANS073.BYTE004  $  y=x;
  $  147.选择错误计数                           $    $               $    $  ANS074.BYTE004  $  y=x;
  $  148.选择锁定错误计数                       $    $               $    $  ANS075.BYTE004  $  y=x;
  $  149.运动开过卡滞计数                       $    $               $    $  ANS076.BYTE004  $  y=x;
  $  150.请求发动机扭矩                         $    $  Nm           $    $  ANS077.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000));
  $  151.不正确齿轮啮合计数                     $    $               $    $  ANS078.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
