
    车型ID：1090

    模拟：协议模拟-->1090

;******************************************************************************************************************************************************

    通讯线: $~08$~08$~10400

进入命令:

  $~  REQ000:81 58 F1 81 4B       $~  ANS000:81 58 F1 81 4B
  $~  REQ001:80 58 F1 02 10 81 5C       $~  ANS001:80 58 F1 02 10 81 5C

空闲命令:

  $!  REQ000:80 58 F1 02 3E 01 0A       $!  ANS000:80 58 F1 02 3E 01 0A

退出命令:

  $@  REQ000:80 58 F1 01 82 4C       $@  ANS000:80 58 F1 01 82 4C


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:80 58 F1 04 18 00 FF 00 E4       $#  ANS000:80 58 F1 04 18 00 FF 00 E4

  帧长控制故障码个数，从$#ANS000.BYTE6$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/90000000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:80 58 F1 03 14 FF 00 DF       $$  ANS000:80 58 F1 03 14 FF 00 DF

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:80 58 F1 02 21 B0 9C       $%  ANS000:80 58 F1 02 21 B0 9C
  $%  REQ001:80 58 F1 02 21 C0 AC       $%  ANS001:80 58 F1 02 21 C0 AC
  $%  REQ002:80 58 F1 02 21 C1 AD       $%  ANS002:80 58 F1 02 21 C1 AD
  $%  REQ003:80 58 F1 02 21 80 6C       $%  ANS003:80 58 F1 02 21 80 6C
  $%  REQ004:80 58 F1 02 21 81 6D       $%  ANS004:80 58 F1 02 21 81 6D

  $%  000:车辆生产日期:                $%    $%  ANS000.BYTE006  $%  HEX(X1,X2,X3,X4);
  $%  001:客户最后一次检修日期:        $%    $%  ANS001.BYTE006  $%  HEX(X1,X2,X3,X4);
  $%  002:电控单元安装日期:            $%    $%  ANS002.BYTE006  $%  HEX(X1,X2,X3,X4);
  $%  003:EEPROM版本:                  $%    $%  ANS002.BYTE010  $%  HEX(X1,X2,X3);
  $%  004:博世零件号:                  $%    $%  ANS002.BYTE013  $%  ASCII(x1,x2,x3,x4);
  $%  005:产品序列号:                  $%    $%  ANS002.BYTE017  $%  HEX(X1,X2,X3,X4);
  $%  006:用户项目号:                  $%    $%  ANS002.BYTE021  $%  HEX(X1,X2);
  $%  007:软件版本号:                  $%    $%  ANS002.BYTE036  $%  HEX(X1,X2);
  $%  008:实际运行时间:                $%    $%  ANS002.BYTE046  $%  y=x1*256*256+x2*256+x3;
  $%  009:开-关机计数器:               $%    $%  ANS002.BYTE049  $%  y=x1*256+x2;
  $%  010:博世硬件版本号:              $%    $%  ANS002.BYTE051  $%  y=x;
  $%  011:博世软件版本号:              $%    $%  ANS002.BYTE052  $%  y=x;
  $%  012:用户零件号:                  $%    $%  ANS003.BYTE006  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13);
  $%  013:SW号:                        $%    $%  ANS003.BYTE019  $%  ASCII(X1,X2,X3,X4,X5,X6,X7);
  $%  014:VIN码:                       $%    $%  ANS004.BYTE006  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.一般数据流
  $  00.一般数据流
  $  REQ000:80 58 F1 02 21 D5 C1       $  ANS000:80 58 F1 02 21 D5 C1
  $  REQ001:80 58 F1 02 21 D6 C2       $  ANS001:80 58 F1 02 21 D6 C2
  $  REQ002:80 58 F1 02 21 D0 BC       $  ANS002:80 58 F1 02 21 D0 BC
  $  REQ003:80 58 F1 02 21 80 6C       $  ANS003:80 58 F1 02 21 80 6C

  $  000.前气囊引爆的次数                       $    $       $    $  ANS000.BYTE006  $  y=x;
  $  001.安全带预紧器引爆的次数                 $    $       $    $  ANS000.BYTE009  $  y=x;
  $  002.总的碰撞次数包含引爆和接近引爆         $    $       $    $  ANS000.BYTE010  $  y=x;
  $  003.加速度信息所属的碰撞记录区             $    $       $    $  ANS000.BYTE011  $  if((x&0x10)==0x10)y=@000f;else y=@0052;
  $  004.碰撞记录2被锁定                        $    $       $    $  ANS000.BYTE011  $  if((x&0x02)==0x02)y=@000f;else y=@0052;
  $  005.碰撞记录1被锁定                        $    $       $    $  ANS000.BYTE011  $  if((x&0x01)==0x01)y=@000f;else y=@0052;
  $  006.加速度信息所属的碰撞记录区1            $    $       $    $  ANS000.BYTE012  $  if((x&0x40)==0x40)y=@04d3;else y=@04d4;
  $  007.加速度信息所属的碰撞记录区2            $    $       $    $  ANS000.BYTE012  $  if((x&0x20)==0x20)y=@04d3;else y=@04d4;
  $  008.含有最新数据的碰撞记录区               $    $       $    $  ANS000.BYTE013  $  HEX(X1);
  $  009.碰撞记录已经被正确记录                 $    $       $    $  ANS001.BYTE006  $  HEX(X1);
  $  010.加速度数据所属的碰撞记录区1            $    $       $    $  ANS001.BYTE007  $  if((x&0x80)==0x80)y=@04d3;else y=@04d4;
  $  011.加速度数据所属的碰撞记录区2            $    $       $    $  ANS001.BYTE007  $  if((x&0x40)==0x40)y=@04d3;else y=@04d4;
  $  012.乘员安全带预紧器存在                   $    $       $    $  ANS002.BYTE006  $  if((x&0x08)==0x08)y=@00ba;else y=@00b9;
  $  013.驾驶员安全带预紧器存在                 $    $       $    $  ANS002.BYTE006  $  if((x&0x04)==0x04)y=@00ba;else y=@00b9;
  $  014.乘员前气囊存在                         $    $       $    $  ANS002.BYTE006  $  if((x&0x02)==0x02)y=@00ba;else y=@00b9;
  $  015.驾驶员前气囊存在                       $    $       $    $  ANS002.BYTE006  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  016.碰撞输出                               $    $       $    $  ANS002.BYTE010  $  if((x&0x10)==0x10)y=@00ba;else y=@00b9;
  $  017.故障灯                                 $    $       $    $  ANS002.BYTE010  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  018.乘员安全带预紧器存在(实际)             $    $       $    $  ANS002.BYTE011  $  if((x&0x08)==0x08)y=@00ba;else y=@00b9;
  $  019.驾驶员安全带预紧器存在(实际)           $    $       $    $  ANS002.BYTE011  $  if((x&0x04)==0x04)y=@00ba;else y=@00b9;
  $  020.乘员前气囊存在(实际)                   $    $       $    $  ANS002.BYTE011  $  if((x&0x02)==0x02)y=@00ba;else y=@00b9;
  $  021.驾驶员前气囊存在(实际)                 $    $       $    $  ANS002.BYTE011  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  022.碰撞输出(实际)                         $    $       $    $  ANS002.BYTE015  $  if((x&0x10)==0x10)y=@00ba;else y=@00b9;
  $  023.故障灯(实际)                           $    $       $    $  ANS002.BYTE015  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  024.乘员安全带预紧器存在(配置错误)         $    $       $    $  ANS002.BYTE016  $  if((x&0x08)==0x08)y=@00ba;else y=@00b9;
  $  025.驾驶员安全带预紧器存在(配置错误)       $    $       $    $  ANS002.BYTE016  $  if((x&0x04)==0x04)y=@00ba;else y=@00b9;
  $  026.乘员前气囊存在(配置错误)               $    $       $    $  ANS002.BYTE016  $  if((x&0x02)==0x02)y=@00ba;else y=@00b9;
  $  027.驾驶员前气囊存在(配置错误)             $    $       $    $  ANS002.BYTE016  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  028.碰撞输出(配置错误)                     $    $       $    $  ANS002.BYTE020  $  if((x&0x10)==0x10)y=@00ba;else y=@00b9;
  $  029.故障灯(配置错误)                       $    $       $    $  ANS002.BYTE020  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  030.点火回路失效使故障灯亮                 $    $       $    $  ANS003.BYTE026  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  031.算法失效使故障灯亮                     $    $       $    $  ANS003.BYTE026  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  032.诊断通讯使故障灯亮                     $    $       $    $  ANS003.BYTE026  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  033.气囊引爆使故障灯亮                     $    $       $    $  ANS003.BYTE026  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  034.客户生产模式使故障灯亮                 $    $       $    $  ANS003.BYTE026  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  035.历史故障使故障灯亮                     $    $       $    $  ANS003.BYTE026  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  036.当前故障使故障灯亮                     $    $       $    $  ANS003.BYTE026  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  037.事故计数器                             $    $       $    $  ANS003.BYTE027  $  y=x;
  $  038.副驾驶安全气囊点火状态                 $    $       $    $  ANS003.BYTE028  $  if((x&0x04)==0x04)y=@00b1;else y=@00bb;
  $  039.引爆后模式                             $    $       $    $  ANS003.BYTE031  $  if((x&0x20)==0x20)y=@0fca;else y=@0fcb;
  $  040.引爆前模式                             $    $       $    $  ANS003.BYTE031  $  if((x&0x10)==0x10)y=@0fca;else y=@0fcb;
  $  041.客户售后模式                           $    $       $    $  ANS003.BYTE031  $  if((x&0x08)==0x08)y=@0fca;else y=@0fcb;
  $  042.客户生产模式                           $    $       $    $  ANS003.BYTE031  $  if((x&0x04)==0x04)y=@0fca;else y=@0fcb;
  $  043.客户开发模式                           $    $       $    $  ANS003.BYTE031  $  if((x&0x02)==0x02)y=@0fca;else y=@0fcb;
  $  044.博士开发模式                           $    $       $    $  ANS003.BYTE031  $  if((x&0x01)==0x01)y=@0fca;else y=@0fcb;

  $)  01.碰撞记录数据2
  $  01.碰撞记录数据2
  $  REQ000:80 58 F1 02 21 D3 BF       $  ANS000:80 58 F1 02 21 D3 BF

  $  000.碰撞记录完成标识                           $    $            $    $  ANS000.BYTE006  $  if(x==0xAA)y=@0fcc;else if(x==0xFF)y=@0fcd;else y=@01a9;
  $  001.碰撞记录有关系的碰撞次数                   $    $            $    $  ANS000.BYTE007  $  y=x;
  $  002.系统警告灯                                 $    $            $    $  ANS000.BYTE008  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@01a9;
  $  003.中央传感器1状态                            $    $            $    $  ANS000.BYTE009  $  if((x&0x02)==0x02)y=@00b3;else y=@0197;
  $  004.中央传感器2状态                            $    $            $    $  ANS000.BYTE009  $  if((x&0x01)==0x01)y=@00b3;else y=@0197;
  $  005.运行时间计数器                             $    $  s         $    $  ANS000.BYTE047  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  006.ECU Y轴侧近距离碰撞                        $    $            $    $  ANS000.BYTE051  $  if((x&0x01)==0x01)y=@00c9;else y=@00ca;
  $  007.前气囊接近引爆                             $    $            $    $  ANS000.BYTE052  $  if((x&0x10)==0x10)y=@00c9;else y=@00ca;
  $  008.预拉紧式安全带引爆                         $    $            $    $  ANS000.BYTE052  $  if((x&0x08)==0x08)y=@00c9;else y=@00ca;
  $  009.前气囊引爆                                 $    $            $    $  ANS000.BYTE052  $  if((x&0x01)==0x01)y=@00c9;else y=@00ca;
  $  010.正面碰撞有可靠性                           $    $            $    $  ANS000.BYTE053  $  if((x&0x01)==0x01)y=@00c9;else y=@00ca;
  $  011.算法启动时间                               $    $  ms        $    $  ANS000.BYTE054  $  y=x*0.5;
  $  012.从发生碰撞到接近引爆的时间                 $    $  ms        $    $  ANS000.BYTE055  $  y=(x1*256+x2)*0.5;
  $  013.从发生碰撞到前算法到前气囊预计的时间       $    $  ms        $    $  ANS000.BYTE057  $  y=(x1*256+x2)*0.5;
  $  014.从发生碰撞到预拉紧式安全带引爆的时间       $    $  ms        $    $  ANS000.BYTE061  $  y=(x1*256+x2)*0.5;
  $  015.从发生碰撞到前气囊引爆的时间               $    $  ms        $    $  ANS000.BYTE063  $  y=(x1*256+x2)*0.5;
  $  016.从发生碰撞到算法运行的时间                 $    $  ms        $    $  ANS000.BYTE067  $  y=(x1*256+x2)*0.5;
  $  017.算法启动期间X轴方向最大加速度              $    $  m/s^2     $    $  ANS000.BYTE069  $  if(x<0x80) y=x*7.84;else y=(x-256)*7.84;
  $  018.算法启动期间Y轴方向最大加速度              $    $  m/s^2     $    $  ANS000.BYTE070  $  if(x<0x80) y=x*7.84;else y=(x-256)*7.84;
  $  019.从发生碰撞到X轴方向最大加速度的时间        $    $  ms        $    $  ANS000.BYTE075  $  y=(x1*256+x2)*0.5;
  $  020.从发生碰撞到Y轴方向最大加速度的时间        $    $  ms        $    $  ANS000.BYTE077  $  y=(x1*256+x2)*0.5;
  $  021.速度变量1                                  $    $  km/h      $    $  ANS000.BYTE087  $  y=x;
  $  022.速度变量2                                  $    $  km/h      $    $  ANS000.BYTE088  $  y=x;
  $  023.速度变量3                                  $    $  km/h      $    $  ANS000.BYTE089  $  y=x;
  $  024.速度变量4                                  $    $  km/h      $    $  ANS000.BYTE090  $  y=x;
  $  025.速度变量5                                  $    $  km/h      $    $  ANS000.BYTE091  $  y=x;
  $  026.速度变量6                                  $    $  km/h      $    $  ANS000.BYTE092  $  y=x;
  $  027.速度变量7                                  $    $  km/h      $    $  ANS000.BYTE093  $  y=x;
  $  028.速度变量8                                  $    $  km/h      $    $  ANS000.BYTE094  $  y=x;
  $  029.速度变量9                                  $    $  km/h      $    $  ANS000.BYTE095  $  y=x;
  $  030.速度变量10                                 $    $  km/h      $    $  ANS000.BYTE096  $  y=x;
  $  031.速度变量11                                 $    $  km/h      $    $  ANS000.BYTE097  $  y=x;
  $  032.速度变量12                                 $    $  km/h      $    $  ANS000.BYTE098  $  y=x;
  $  033.速度变量13                                 $    $  km/h      $    $  ANS000.BYTE099  $  y=x;
  $  034.速度变量14                                 $    $  km/h      $    $  ANS000.BYTE100  $  y=x;
  $  035.速度变量15                                 $    $  km/h      $    $  ANS000.BYTE101  $  y=x;
  $  036.速度变量16                                 $    $  km/h      $    $  ANS000.BYTE102  $  y=x;
  $  037.速度变量17                                 $    $  km/h      $    $  ANS000.BYTE103  $  y=x;
  $  038.速度变量18                                 $    $  km/h      $    $  ANS000.BYTE104  $  y=x;
  $  039.速度变量19                                 $    $  km/h      $    $  ANS000.BYTE105  $  y=x;
  $  040.速度变量20                                 $    $  km/h      $    $  ANS000.BYTE106  $  y=x;
  $  041.电流流过的时间1                            $    $  ms        $    $  ANS000.BYTE107  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  042.电流流过的时间2                            $    $  ms        $    $  ANS000.BYTE110  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  043.电流流过的时间3                            $    $  ms        $    $  ANS000.BYTE113  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  044.电流流过的时间4                            $    $  ms        $    $  ANS000.BYTE116  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  045.在碰撞发生时的能量储备电压                 $    $  V         $    $  ANS000.BYTE119  $  y=x*0.2;
  $  046.在气囊引爆后的能量储备电压                 $    $  V         $    $  ANS000.BYTE120  $  y=x*0.2;
  $  047.引爆前电源电压                             $    $  V         $    $  ANS000.BYTE121  $  y=x*0.1;
  $  048.引爆后电源电压                             $    $  V         $    $  ANS000.BYTE122  $  y=x*0.1;
  $  049.碰撞输出信号已发送                         $    $            $    $  ANS000.BYTE123  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;

  $)  02.碰撞记录数据1
  $  02.碰撞记录数据1
  $  REQ000:80 58 F1 02 21 D2 BE       $  ANS000:80 58 F1 02 21 D2 BE

  $  000.碰撞记录完成标识                           $    $            $    $  ANS000.BYTE006  $  if(x==0xAA)y=@0fcc;else if(x==0xFF)y=@0fcd;else y=@01a9;
  $  001.碰撞记录有关系的碰撞次数                   $    $            $    $  ANS000.BYTE007  $  y=x;
  $  002.系统警告灯                                 $    $            $    $  ANS000.BYTE008  $  if((x&0x03)==0x00)y=@028b;else if((x&0x03)==0x01)y=@028c;else y=@01a9;
  $  003.中央传感器1状态                            $    $            $    $  ANS000.BYTE009  $  if((x&0x02)==0x02)y=@00b3;else y=@0197;
  $  004.中央传感器2状态                            $    $            $    $  ANS000.BYTE009  $  if((x&0x01)==0x01)y=@00b3;else y=@0197;
  $  005.运行时间计数器                             $    $  s         $    $  ANS000.BYTE047  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  006.ECU Y轴侧近距离碰撞                        $    $            $    $  ANS000.BYTE051  $  if((x&0x01)==0x01)y=@00c9;else y=@00ca;
  $  007.前气囊接近引爆                             $    $            $    $  ANS000.BYTE052  $  if((x&0x10)==0x10)y=@00c9;else y=@00ca;
  $  008.预拉紧式安全带引爆                         $    $            $    $  ANS000.BYTE052  $  if((x&0x08)==0x08)y=@00c9;else y=@00ca;
  $  009.前气囊引爆                                 $    $            $    $  ANS000.BYTE052  $  if((x&0x01)==0x01)y=@00c9;else y=@00ca;
  $  010.正面碰撞有可靠性                           $    $            $    $  ANS000.BYTE053  $  if((x&0x01)==0x01)y=@00c9;else y=@00ca;
  $  011.算法启动时间                               $    $  ms        $    $  ANS000.BYTE054  $  y=x*0.5;
  $  012.从发生碰撞到接近引爆的时间                 $    $  ms        $    $  ANS000.BYTE055  $  y=(x1*256+x2)*0.5;
  $  013.从发生碰撞到前算法到前气囊预计的时间       $    $  ms        $    $  ANS000.BYTE057  $  y=(x1*256+x2)*0.5;
  $  014.从发生碰撞到预拉紧式安全带引爆的时间       $    $  ms        $    $  ANS000.BYTE061  $  y=(x1*256+x2)*0.5;
  $  015.从发生碰撞到前气囊引爆的时间               $    $  ms        $    $  ANS000.BYTE063  $  y=(x1*256+x2)*0.5;
  $  016.从发生碰撞到算法运行的时间                 $    $  ms        $    $  ANS000.BYTE067  $  y=(x1*256+x2)*0.5;
  $  017.算法启动期间X轴方向最大加速度              $    $  m/s^2     $    $  ANS000.BYTE069  $  if(x<0x80) y=x*7.84;else y=(x-256)*7.84;
  $  018.算法启动期间Y轴方向最大加速度              $    $  m/s^2     $    $  ANS000.BYTE070  $  if(x<0x80) y=x*7.84;else y=(x-256)*7.84;
  $  019.从发生碰撞到X轴方向最大加速度的时间        $    $  ms        $    $  ANS000.BYTE075  $  y=(x1*256+x2)*0.5;
  $  020.从发生碰撞到Y轴方向最大加速度的时间        $    $  ms        $    $  ANS000.BYTE077  $  y=(x1*256+x2)*0.5;
  $  021.速度变量1                                  $    $  km/h      $    $  ANS000.BYTE087  $  y=x;
  $  022.速度变量2                                  $    $  km/h      $    $  ANS000.BYTE088  $  y=x;
  $  023.速度变量3                                  $    $  km/h      $    $  ANS000.BYTE089  $  y=x;
  $  024.速度变量4                                  $    $  km/h      $    $  ANS000.BYTE090  $  y=x;
  $  025.速度变量5                                  $    $  km/h      $    $  ANS000.BYTE091  $  y=x;
  $  026.速度变量6                                  $    $  km/h      $    $  ANS000.BYTE092  $  y=x;
  $  027.速度变量7                                  $    $  km/h      $    $  ANS000.BYTE093  $  y=x;
  $  028.速度变量8                                  $    $  km/h      $    $  ANS000.BYTE094  $  y=x;
  $  029.速度变量9                                  $    $  km/h      $    $  ANS000.BYTE095  $  y=x;
  $  030.速度变量10                                 $    $  km/h      $    $  ANS000.BYTE096  $  y=x;
  $  031.速度变量11                                 $    $  km/h      $    $  ANS000.BYTE097  $  y=x;
  $  032.速度变量12                                 $    $  km/h      $    $  ANS000.BYTE098  $  y=x;
  $  033.速度变量13                                 $    $  km/h      $    $  ANS000.BYTE099  $  y=x;
  $  034.速度变量14                                 $    $  km/h      $    $  ANS000.BYTE100  $  y=x;
  $  035.速度变量15                                 $    $  km/h      $    $  ANS000.BYTE101  $  y=x;
  $  036.速度变量16                                 $    $  km/h      $    $  ANS000.BYTE102  $  y=x;
  $  037.速度变量17                                 $    $  km/h      $    $  ANS000.BYTE103  $  y=x;
  $  038.速度变量18                                 $    $  km/h      $    $  ANS000.BYTE104  $  y=x;
  $  039.速度变量19                                 $    $  km/h      $    $  ANS000.BYTE105  $  y=x;
  $  040.速度变量20                                 $    $  km/h      $    $  ANS000.BYTE106  $  y=x;
  $  041.电流流过的时间1                            $    $  ms        $    $  ANS000.BYTE107  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  042.电流流过的时间2                            $    $  ms        $    $  ANS000.BYTE110  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  043.电流流过的时间3                            $    $  ms        $    $  ANS000.BYTE113  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  044.电流流过的时间4                            $    $  ms        $    $  ANS000.BYTE116  $  y=(x1*256*256+x2*256+x3)*0.025;
  $  045.在碰撞发生时的能量储备电压                 $    $  V         $    $  ANS000.BYTE119  $  y=x*0.2;
  $  046.在气囊引爆后的能量储备电压                 $    $  V         $    $  ANS000.BYTE120  $  y=x*0.2;
  $  047.引爆前电源电压                             $    $  V         $    $  ANS000.BYTE121  $  y=x*0.1;
  $  048.引爆后电源电压                             $    $  V         $    $  ANS000.BYTE122  $  y=x*0.1;
  $  049.碰撞输出信号已发送                         $    $            $    $  ANS000.BYTE123  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;

;******************************************************************************************************************************************************

