
    车型ID：1099

    模拟：协议模拟-->1099

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:700 02 10 01 00 00 00 00 00       $~  ANS000:780 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:700 02 3E 80 00 00 00 00 00       $!  ANS000:780 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:700 03 19 02 09 00 00 00 00       $#  ANS000:780 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/99000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:700 04 14 FF FF FF 00 00 00       $$  ANS000:780 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:700 03 22 F1 A0 00 00 00 00       $%  ANS000:780 03 22 F1 A0 00 00 00 00
  $%  REQ001:700 03 22 F1 83 00 00 00 00       $%  ANS001:780 03 22 F1 83 00 00 00 00
  $%  REQ002:700 03 22 F1 A1 00 00 00 00       $%  ANS002:780 03 22 F1 A1 00 00 00 00
  $%  REQ003:700 03 22 F1 91 00 00 00 00       $%  ANS003:780 03 22 F1 91 00 00 00 00
  $%  REQ004:700 03 22 F1 8B 00 00 00 00       $%  ANS004:780 03 22 F1 8B 00 00 00 00
  $%  REQ005:700 03 22 F1 A2 00 00 00 00       $%  ANS005:780 03 22 F1 A2 00 00 00 00
  $%  REQ006:700 03 22 F1 87 00 00 00 00       $%  ANS006:780 03 22 F1 87 00 00 00 00
  $%  REQ007:700 03 22 F1 10 00 00 00 00       $%  ANS007:780 03 22 F1 10 00 00 00 00
  $%  REQ008:700 03 22 F1 92 00 00 00 00       $%  ANS008:780 03 22 F1 92 00 00 00 00
  $%  REQ009:700 03 22 F1 8C 00 00 00 00       $%  ANS009:780 03 22 F1 8C 00 00 00 00
  $%  REQ010:700 03 22 F1 94 00 00 00 00       $%  ANS010:780 03 22 F1 94 00 00 00 00
  $%  REQ011:700 03 22 F1 8A 00 00 00 00       $%  ANS011:780 03 22 F1 8A 00 00 00 00
  $%  REQ012:700 03 22 F1 90 00 00 00 00       $%  ANS012:780 03 22 F1 90 00 00 00 00
  $%  REQ013:700 03 22 F1 A8 00 00 00 00       $%  ANS013:780 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元制造日期:                $%    $%  ANS004.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);
  $%  005:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号(上次):            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  008:测试参考号(上次):                $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  009:里程读数(上次)KM:                $%    $%  ANS007.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  010:供应商电控单元硬件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:供应商电控单元序列号:            $%    $%  ANS009.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:供应商电控单元软件参考号:        $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:系统供应商识别码:                $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  014:VIN码:                           $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  015:车辆特征信息:                    $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:700 03 22 D4 11 00 00 00 00       $  ANS000:780 03 22 D4 11 00 00 00 00
  $  REQ001:700 03 22 D4 12 00 00 00 00       $  ANS001:780 03 22 D4 12 00 00 00 00
  $  REQ002:700 03 22 C1 11 00 00 00 00       $  ANS002:780 03 22 C1 11 00 00 00 00
  $  REQ003:700 03 22 C1 12 00 00 00 00       $  ANS003:780 03 22 C1 12 00 00 00 00
  $  REQ004:700 03 22 E1 11 00 00 00 00       $  ANS004:780 03 22 E1 11 00 00 00 00
  $  REQ005:700 03 22 E1 07 00 00 00 00       $  ANS005:780 03 22 E1 07 00 00 00 00
  $  REQ006:700 03 22 E1 05 00 00 00 00       $  ANS006:780 03 22 E1 05 00 00 00 00
  $  REQ007:700 03 22 E1 04 00 00 00 00       $  ANS007:780 03 22 E1 04 00 00 00 00
  $  REQ008:700 03 22 B1 03 00 00 00 00       $  ANS008:780 03 22 B1 03 00 00 00 00
  $  REQ009:700 03 22 D1 1B 00 00 00 00       $  ANS009:780 03 22 D1 1B 00 00 00 00
  $  REQ010:700 03 22 E1 08 00 00 00 00       $  ANS010:780 03 22 E1 08 00 00 00 00
  $  REQ011:700 03 22 E1 06 00 00 00 00       $  ANS011:780 03 22 E1 06 00 00 00 00
  $  REQ012:700 03 22 E1 09 00 00 00 00       $  ANS012:780 03 22 E1 09 00 00 00 00
  $  REQ013:700 03 22 E1 10 00 00 00 00       $  ANS013:780 03 22 E1 10 00 00 00 00
  $  REQ014:700 03 22 D4 01 00 00 00 00       $  ANS014:780 03 22 D4 01 00 00 00 00
  $  REQ015:700 03 22 D4 02 00 00 00 00       $  ANS015:780 03 22 D4 02 00 00 00 00
  $  REQ016:700 03 22 B1 01 00 00 00 00       $  ANS016:780 03 22 B1 01 00 00 00 00
  $  REQ017:700 03 22 C0 12 00 00 00 00       $  ANS017:780 03 22 C0 12 00 00 00 00
  $  REQ018:700 03 22 B1 02 00 00 00 00       $  ANS018:780 03 22 B1 02 00 00 00 00

  $  000.电子驻车指示灯                      $    $               $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  001.电子驻车故障灯                      $    $               $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  002.电子驻车提示信息                    $    $               $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  003.EBD故障灯                           $    $               $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  004.ABS故障灯                           $    $               $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  005.ESP故障灯                           $    $               $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  006.ESP显示灯                           $    $               $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  007.ESP关闭灯                           $    $               $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  008.巡航白色警示灯                      $    $               $    $  ANS000.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  009.巡航绿色警示灯                      $    $               $    $  ANS000.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  010.温度报警                            $    $               $    $  ANS000.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  011.TPMS系统状态                        $    $               $    $  ANS000.BYTE005  $  if((x&0x0C)==0x00)y=@05c3;else if((x&0x0C)==0x04)y=@00d3;else if((x&0x0C)==0x08)y=@00d4;else y=@0004;
  $  012.胎压灯状态                          $    $               $    $  ANS000.BYTE005  $  if((x&0x03)==0x00)y=@046a;else if((x&0x03)==0x01)y=@06ff;else if((x&0x03)==0x02)y=@046c;else y=@0004;
  $  013.右前轮胎压力报警状态                $    $               $    $  ANS001.BYTE004  $  if((x&0x38)==0x00) y=@05c2;else if((x&0x38)==0x08) y=@0fd6;else if((x&0x38)==0x10) y=@05c5;else if((x&0x38)==0x18) y=@0fd7;else if((x&0x38)==0x20) y=@05c7;else if((x&0x38)==0x28) y=@05c8;else if((x&0x38)==0x30) y=@05c9;else y=@0fd8;
  $  014.左前轮胎压力报警状态                $    $               $    $  ANS001.BYTE004  $  if((x&0x07)==0x00) y=@05c2;else if((x&0x07)==0x01) y=@0fd6;else if((x&0x07)==0x02) y=@05c5;else if((x&0x07)==0x03) y=@0fd7;else if((x&0x07)==0x04) y=@05c7;else if((x&0x07)==0x05) y=@05c8;else if((x&0x07)==0x06) y=@05c9;else y=@0fd8;
  $  015.右后轮胎压力报警状态                $    $               $    $  ANS001.BYTE005  $  if((x&0x38)==0x00) y=@05c2;else if((x&0x38)==0x08) y=@0fd6;else if((x&0x38)==0x10) y=@05c5;else if((x&0x38)==0x18) y=@0fd7;else if((x&0x38)==0x20) y=@05c7;else if((x&0x38)==0x28) y=@05c8;else if((x&0x38)==0x30) y=@05c9;else y=@0fd8;
  $  016.左后轮胎压力报警状态                $    $               $    $  ANS001.BYTE005  $  if((x&0x07)==0x00) y=@05c2;else if((x&0x07)==0x01) y=@0fd6;else if((x&0x07)==0x02) y=@05c5;else if((x&0x07)==0x03) y=@0fd7;else if((x&0x07)==0x04) y=@05c7;else if((x&0x07)==0x05) y=@05c8;else if((x&0x07)==0x06) y=@05c9;else y=@0fd8;
  $  017.欧6配置                             $    $               $    $  ANS002.BYTE004  $  if((x&0x80)==0x80)y=@0f4f;else y=@0f50;
  $  018.变速箱类型配置                      $    $               $    $  ANS002.BYTE004  $  if((x&0x40)==0x40)y=@003b;else y=@0596;
  $  019.TPMS启用                            $    $               $    $  ANS002.BYTE004  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  020.ESP启用                             $    $               $    $  ANS002.BYTE004  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  021.巡航控制启用                        $    $               $    $  ANS002.BYTE004  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  022.超速启用                            $    $               $    $  ANS002.BYTE004  $  if((x&0x06)==0x00) y=@0ba1;else if((x&0x06)==0x02) y=@0ba2;else if((x&0x06)==0x04) y=@0ba3;else y=@0ba4;
  $  023.超速报警启用                        $    $               $    $  ANS002.BYTE004  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  024.巡航类型                            $    $               $    $  ANS002.BYTE005  $  if((x&0xC0)==0x00)y=@0112;else if((x&0xC0)==0x40)y=@05ef;else if((x&0xC0)==0x80)y=@0fad;else y=@0004;
  $  025.BSD配置                             $    $               $    $  ANS002.BYTE005  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  026.疲劳驾驶配置                        $    $               $    $  ANS002.BYTE005  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  027.TBOX配置                            $    $               $    $  ANS002.BYTE005  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  028.自动灯配置                          $    $               $    $  ANS002.BYTE005  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  029.巡航类型                            $    $               $    $  ANS002.BYTE005  $  if((x&0x02)==0x02)y=@0fae;else y=@0faf;
  $  030.语言类型                            $    $               $    $  ANS002.BYTE005  $  if((x&0x01)==0x01)y=@0486;else y=@0487;
  $  031.无线电类型                          $    $               $    $  ANS002.BYTE006  $  if((x&0x0C)==0x00)y=@0fb0;else if((x&0x0C)==0x04)y=@0fb1;else y=@0004;
  $  032.维护配置                            $    $               $    $  ANS002.BYTE007  $  y=(x1*256+x2);
  $  033.OSEK配置                            $    $               $    $  ANS003.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  034.EPB配置                             $    $               $    $  ANS003.BYTE004  $  if((x&0x01)==0x01)y=@050a;else y=@0112;
  $  035.仪表显示的发动机转速                $    $  rpm          $    $  ANS004.BYTE004  $  y=(x1*256+x2);
  $  036.仪表显示的车速                      $    $  km/h         $    $  ANS005.BYTE004  $  y=x;
  $  037.发动机冷却液温度                    $    $  degree C     $    $  ANS006.BYTE004  $  y=x-60;
  $  038.发动机转速(来自CAN)                 $    $  rpm          $    $  ANS007.BYTE004  $  y=(x1*256+x2)*0.25;
  $  039.倒档输出信息状态                    $    $               $    $  ANS008.BYTE004  $  if((x&0x08)==0x08)y=@0fd4;else y=@0fd5;
  $  040.手刹输出信息状态                    $    $               $    $  ANS008.BYTE004  $  if((x&0x04)==0x04)y=@000f;else y=@0f64;
  $  041.倒档输入状态                        $    $               $    $  ANS008.BYTE004  $  if((x&0x02)==0x02)y=@0fd4;else y=@0fd5;
  $  042.手刹输入状态                        $    $               $    $  ANS008.BYTE004  $  if((x&0x01)==0x01)y=@000f;else y=@0f64;
  $  043.EBD警告灯                           $    $               $    $  ANS009.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  044.ESP关闭指示灯                       $    $               $    $  ANS009.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  045.ESP工作指示灯                       $    $               $    $  ANS009.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  046.TCU警告灯                           $    $               $    $  ANS009.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  047.座椅安全带指示灯                    $    $               $    $  ANS009.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  048.TPMS警告灯                          $    $               $    $  ANS009.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  049.发动机冷却液过热警告灯              $    $               $    $  ANS009.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  050.燃油液位过低警告                    $    $               $    $  ANS009.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  051.自动巡航状态指示灯                  $    $               $    $  ANS009.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  052.ABS警告灯                           $    $               $    $  ANS009.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  053.发动机系统OBD故障                   $    $               $    $  ANS009.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  054.发动机系统故障                      $    $               $    $  ANS009.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  055.燃油含水警告                        $    $               $    $  ANS009.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  056.电热塞指示灯                        $    $               $    $  ANS009.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  057.燃油信号输入                        $    $               $    $  ANS010.BYTE004  $  y=(x1*256+x2);
  $  058.车速信号输入频率                    $    $  Hz           $    $  ANS011.BYTE004  $  y=(x1*256+x2);
  $  059.左前轮胎压力                        $    $  kPa          $    $  ANS012.BYTE004  $  y=x*701/255.0;
  $  060.右前轮胎压力                        $    $  kPa          $    $  ANS012.BYTE005  $  y=x*701/255.0;
  $  061.左后轮胎压力                        $    $  kPa          $    $  ANS012.BYTE006  $  y=x*701/255.0;
  $  062.右后轮胎压力                        $    $  kPa          $    $  ANS012.BYTE007  $  y=x*701/255.0;
  $  063.左前轮胎温度                        $    $  degree C     $    $  ANS013.BYTE004  $  y=x+60;
  $  064.右前轮胎温度                        $    $  degree C     $    $  ANS013.BYTE005  $  y=x+60;
  $  065.左后轮胎温度                        $    $  degree C     $    $  ANS013.BYTE006  $  y=x+60;
  $  066.右后轮胎温度                        $    $  degree C     $    $  ANS013.BYTE007  $  y=x+60;
  $  067.电热塞指示灯                        $    $               $    $  ANS014.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  068.燃油积水警告灯                      $    $               $    $  ANS014.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  069.发动机故障灯状态                    $    $               $    $  ANS014.BYTE004  $  if((x&0x0C)==0x00)y=@000f;else if((x&0x0C)==0x04)y=@0028;else if((x&0x0C)==0x08)y=@0298;else y=@0004;
  $  070.发动机MIL(发动机故障灯)灯状态       $    $               $    $  ANS014.BYTE004  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@0028;else if((x&0x03)==0x02)y=@0298;else y=@0004;
  $  071.变速箱故障状态                      $    $               $    $  ANS014.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  072.换档模式                            $    $               $    $  ANS014.BYTE005  $  if((x&0x70)==0x00)y=@0552;else if((x&0x70)==0x10)y=@0508;else if((x&0x70)==0x20)y=@0fcf;else if((x&0x70)==0x30)y=@0fd0;else if((x&0x70)==0x40)y=@054f;else if((x&0x70)==0x50)y=@0262;else if((x&0x70)==0x60)y=@01a9;else y=@0fd1;
  $  073.齿轮啮合                            $    $               $    $  ANS014.BYTE005  $  if((x&0x0F)==0x00) y=@0262;else if((x&0x0F)==0x01) y=@006f;else if((x&0x0F)==0x02) y=@0070;else if((x&0x0F)==0x03) y=@0299;else if((x&0x0F)==0x04) y=@029a;else if((x&0x0F)==0x05) y=@0073;else if((x&0x0F)==0x06) y=@0074;else if((x&0x0F)==0x07) y=@0263;else if((x&0x0F)==0x0F) y=@0136;else y=@0004;
  $  074.尿素指示灯                          $    $               $    $  ANS015.BYTE004  $  if((x&0x30)==0x00)y=@000f;else if((x&0x30)==0x10)y=@0028;else if((x&0x30)==0x20)y=@0fb2;else y=@0fb3;
  $  075.保养提示                            $    $               $    $  ANS015.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  076.档位显示                            $    $               $    $  ANS015.BYTE004  $  if((x&0x04)==0x04)y=@0298;else y=@00d2;
  $  077.喇叭鸣叫请求                        $    $               $    $  ANS015.BYTE004  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@0fd2;else if((x&0x03)==0x02)y=@0fd3;else y=@0004;
  $  078.实际里程读数                        $    $  km           $    $  ANS016.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  079.最后里程读数                        $    $  km           $    $  ANS017.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  080.显示里程                            $    $  km           $    $  ANS018.BYTE004  $  y=x1*256*256+x2*256+x3;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:700 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
