
    车型ID：10ac

    模拟：协议模拟-->10ac

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:706 02 10 01 00 00 00 00 00       $~  ANS000:786 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:706 02 3E 80 00 00 00 00 00       $!  ANS000:786 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:706 03 19 02 09 00 00 00 00       $#  ANS000:786 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/a9000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:706 04 14 FF FF FF 00 00 00       $$  ANS000:786 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:706 03 22 F1 A0 00 00 00 00       $%  ANS000:786 03 22 F1 A0 00 00 00 00
  $%  REQ001:706 03 22 F1 83 00 00 00 00       $%  ANS001:786 03 22 F1 83 00 00 00 00
  $%  REQ002:706 03 22 F1 91 00 00 00 00       $%  ANS002:786 03 22 F1 91 00 00 00 00
  $%  REQ003:706 03 22 F1 8B 00 00 00 00       $%  ANS003:786 03 22 F1 8B 00 00 00 00
  $%  REQ004:706 03 22 F1 92 00 00 00 00       $%  ANS004:786 03 22 F1 92 00 00 00 00
  $%  REQ005:706 03 22 F1 87 00 00 00 00       $%  ANS005:786 03 22 F1 87 00 00 00 00
  $%  REQ006:706 03 22 F1 10 00 00 00 00       $%  ANS006:786 03 22 F1 10 00 00 00 00
  $%  REQ007:706 03 22 F1 8C 00 00 00 00       $%  ANS007:786 03 22 F1 8C 00 00 00 00
  $%  REQ008:706 03 22 F1 94 00 00 00 00       $%  ANS008:786 03 22 F1 94 00 00 00 00
  $%  REQ009:706 03 22 F1 8A 00 00 00 00       $%  ANS009:786 03 22 F1 8A 00 00 00 00
  $%  REQ010:706 03 22 F1 90 00 00 00 00       $%  ANS010:786 03 22 F1 90 00 00 00 00
  $%  REQ011:706 03 22 F1 A8 00 00 00 00       $%  ANS011:786 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:年:                              $%    $%  ANS003.BYTE004  $%  HEX(X1);
  $%  004:月:                              $%    $%  ANS003.BYTE005  $%  HEX(X1);
  $%  005:日:                              $%    $%  ANS003.BYTE006  $%  HEX(X1);
  $%  006:电控单元网络参考号:              $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次):                  $%    $%  ANS006.BYTE015  $%  HEX(X1,X2,X3);
  $%  011:保留:                            $%    $%  ANS006.BYTE018  $%  HEX(X1,X2);
  $%  012:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  014:系统供应商标识号:                $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6);
  $%  015:车辆识别代码:                    $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  016:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:706 03 22 D1 19 00 00 00 00       $  ANS000:786 03 22 D1 19 00 00 00 00
  $  REQ001:706 03 22 C0 03 00 00 00 00       $  ANS001:786 03 22 C0 03 00 00 00 00
  $  REQ002:706 03 22 C1 04 00 00 00 00       $  ANS002:786 03 22 C1 04 00 00 00 00
  $  REQ003:706 03 22 D1 05 00 00 00 00       $  ANS003:786 03 22 D1 05 00 00 00 00
  $  REQ004:706 03 22 C1 01 00 00 00 00       $  ANS004:786 03 22 C1 01 00 00 00 00
  $  REQ005:706 03 22 01 12 00 00 00 00       $  ANS005:786 03 22 01 12 00 00 00 00
  $  REQ006:706 03 22 E0 1B 00 00 00 00       $  ANS006:786 03 22 E0 1B 00 00 00 00
  $  REQ007:706 03 22 E0 1E 00 00 00 00       $  ANS007:786 03 22 E0 1E 00 00 00 00
  $  REQ008:706 03 22 C0 02 00 00 00 00       $  ANS008:786 03 22 C0 02 00 00 00 00
  $  REQ009:706 03 22 E0 1A 00 00 00 00       $  ANS009:786 03 22 E0 1A 00 00 00 00
  $  REQ010:706 03 22 C1 06 00 00 00 00       $  ANS010:786 03 22 C1 06 00 00 00 00
  $  REQ011:706 03 22 C1 08 00 00 00 00       $  ANS011:786 03 22 C1 08 00 00 00 00
  $  REQ012:706 03 22 D1 06 00 00 00 00       $  ANS012:786 03 22 D1 06 00 00 00 00
  $  REQ013:706 03 22 CF 10 00 00 00 00       $  ANS013:786 03 22 CF 10 00 00 00 00
  $  REQ014:706 03 22 D1 10 00 00 00 00       $  ANS014:786 03 22 D1 10 00 00 00 00
  $  REQ015:706 03 22 D1 11 00 00 00 00       $  ANS015:786 03 22 D1 11 00 00 00 00
  $  REQ016:706 03 22 E0 18 00 00 00 00       $  ANS016:786 03 22 E0 18 00 00 00 00
  $  REQ017:706 03 22 D1 02 00 00 00 00       $  ANS017:786 03 22 D1 02 00 00 00 00
  $  REQ018:706 03 22 E1 01 00 00 00 00       $  ANS018:786 03 22 E1 01 00 00 00 00
  $  REQ019:706 03 22 D3 10 00 00 00 00       $  ANS019:786 03 22 D3 10 00 00 00 00
  $  REQ020:706 03 22 D3 13 00 00 00 00       $  ANS020:786 03 22 D3 13 00 00 00 00
  $  REQ021:706 03 22 D1 13 00 00 00 00       $  ANS021:786 03 22 D1 13 00 00 00 00
  $  REQ022:706 03 22 D0 01 00 00 00 00       $  ANS022:786 03 22 D0 01 00 00 00 00
  $  REQ023:706 03 22 D1 01 00 00 00 00       $  ANS023:786 03 22 D1 01 00 00 00 00
  $  REQ024:706 03 22 D1 17 00 00 00 00       $  ANS024:786 03 22 D1 17 00 00 00 00
  $  REQ025:706 03 22 C1 02 00 00 00 00       $  ANS025:786 03 22 C1 02 00 00 00 00
  $  REQ026:706 03 22 62 05 00 00 00 00       $  ANS026:786 03 22 62 05 00 00 00 00
  $  REQ027:706 03 22 D1 03 00 00 00 00       $  ANS027:786 03 22 D1 03 00 00 00 00
  $  REQ028:706 03 22 C1 05 00 00 00 00       $  ANS028:786 03 22 C1 05 00 00 00 00
  $  REQ029:706 03 22 E0 1C 00 00 00 00       $  ANS029:786 03 22 E0 1C 00 00 00 00
  $  REQ030:706 03 22 D3 03 00 00 00 00       $  ANS030:786 03 22 D3 03 00 00 00 00
  $  REQ031:706 03 22 E2 11 00 00 00 00       $  ANS031:786 03 22 E2 11 00 00 00 00
  $  REQ032:706 03 22 C1 07 00 00 00 00       $  ANS032:786 03 22 C1 07 00 00 00 00
  $  REQ033:706 03 22 C1 09 00 00 00 00       $  ANS033:786 03 22 C1 09 00 00 00 00
  $  REQ034:706 03 22 D3 02 00 00 00 00       $  ANS034:786 03 22 D3 02 00 00 00 00
  $  REQ035:706 03 22 62 06 00 00 00 00       $  ANS035:786 03 22 62 06 00 00 00 00
  $  REQ036:706 03 22 E0 17 00 00 00 00       $  ANS036:786 03 22 E0 17 00 00 00 00
  $  REQ037:706 03 22 D1 15 00 00 00 00       $  ANS037:786 03 22 D1 15 00 00 00 00
  $  REQ038:706 03 22 62 04 00 00 00 00       $  ANS038:786 03 22 62 04 00 00 00 00
  $  REQ039:706 03 22 C1 03 00 00 00 00       $  ANS039:786 03 22 C1 03 00 00 00 00
  $  REQ040:706 03 22 D1 04 00 00 00 00       $  ANS040:786 03 22 D1 04 00 00 00 00

  $  000.5V输出                                                $    $           $    $  ANS000.BYTE004  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  001.KLR 唤醒输出                                          $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0) y=@0d00;else if(((x&0x08)>>3)==1) y=@0d01;else y=@0035;
  $  002.B+ 唤醒输出                                           $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0) y=@0d00;else if(((x&0x02)>>1)==1) y=@0d01;else y=@0035;
  $  003.P档解锁输出                                           $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  004.KL15继电器                                            $    $           $    $  ANS000.BYTE005  $  if(((x&0x02)>>1)==0) y=@0d00;else if(((x&0x02)>>1)==1) y=@0d01;else y=@0035;
  $  005.KLR继电器                                             $    $           $    $  ANS000.BYTE005  $  if((x&0x01)==0) y=@0d00;else if((x&0x01)==1) y=@0d01;else y=@0035;
  $  006.在BCM中全部的IDE                                      $    $           $    $  ANS001.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  007.车速自动闭锁配置                                      $    $           $    $  ANS002.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  008.后风窗加热配置                                        $    $           $    $  ANS002.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  009.RKE主驾单独解锁配置                                   $    $           $    $  ANS002.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  010.尾门配置                                              $    $           $    $  ANS002.BYTE004  $  if(((x&0x18)>>3)==0) y=@00b9;else if(((x&0x18)>>3)==1) y=@0028;else if(((x&0x18)>>3)==2) y=@000f;else y=@0035;
  $  011.P档解锁有无配置                                       $    $           $    $  ANS002.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  012.后视镜折叠有无配置                                    $    $           $    $  ANS002.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  013.PKE主驾单独解锁配置                                   $    $           $    $  ANS002.BYTE004  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  014.左后门配置                                            $    $           $    $  ANS002.BYTE005  $  if(((x&0xC0)>>6)==0) y=@00b9;else if(((x&0xC0)>>6)==1) y=@0028;else if(((x&0xC0)>>6)==2) y=@000f;else y=@0035;
  $  015.右后门配置                                            $    $           $    $  ANS002.BYTE005  $  if(((x&0x30)>>4)==0) y=@00b9;else if(((x&0x30)>>4)==1) y=@0028;else if(((x&0x30)>>4)==2) y=@000f;else y=@0035;
  $  016.慢充电子锁                                            $    $           $    $  ANS002.BYTE005  $  if(((x&0x04)>>2)==0) y=@0136;else if(((x&0x04)>>2)==1) y=@0d0a;else y=@0035;
  $  017.油箱盖解锁配置                                        $    $           $    $  ANS002.BYTE005  $  if((x&0x03)==0) y=@00b9;else if((x&0x03)==1) y=@0c5f;else if((x&0x03)==2) y=@0c60;else y=@0035;
  $  018.锁电机热保护时间                                      $    $  s        $    $  ANS002.BYTE006  $  y=x;
  $  019.自动重上锁计时时间                                    $    $  s        $    $  ANS002.BYTE007  $  y=x;
  $  020.ECO(经济模式)/SPORT(运动模式)开关                     $    $           $    $  ANS003.BYTE006  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0cf9;else if(((x&0x30)>>4)==2) y=@0d0b;else y=@0035;
  $  021.ACC(自适应巡航控制)巡航开关                           $    $           $    $  ANS003.BYTE006  $  if((x&0x0F)==1) y=@0c62;else if((x&0x0F)==2) y=@0c63;else if((x&0x0F)==3) y=@0c64;else if((x&0x0F)==4) y=@0c65;else if((x&0x0F)==5) y=@0c66;else if((x&0x0F)==6) y=@0c67;else if((x&0x0F)==7) y=@0c68;else y=@0035;
  $  022.负载管理模式                                          $    $           $    $  ANS004.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0044;else if(((x&0x0C)>>2)==1) y=@0524;else if(((x&0x0C)>>2)==2) y=@01d2;else y=@0035;
  $  023.生产运行周期                                          $    $           $    $  ANS004.BYTE004  $  if((x&0x03)==0) y=@050b;else if((x&0x03)==1) y=@050c;else if((x&0x03)==2) y=@050d;else if((x&0x03)==3) y=@050e;else y=@0035;
  $  024.TCU(变速箱控制单元)是否配置                           $    $           $    $  ANS004.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  025.PEPS                                                  $    $           $    $  ANS004.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  026.IMMO(防盗)是否配置                                    $    $           $    $  ANS004.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  027.左舵或右舵                                            $    $           $    $  ANS004.BYTE005  $  if(((x&0x10)>>4)==0) y=@0510;else if(((x&0x10)>>4)==1) y=@050f;else y=@0035;
  $  028.车辆类型                                              $    $           $    $  ANS004.BYTE005  $  y=(x&0x0F);
  $  029.ABS(防抱死制动系统)是否配置                           $    $           $    $  ANS004.BYTE006  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  030.ESP(电子稳定系统)是否配置                             $    $           $    $  ANS004.BYTE006  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  031.IPK(仪表)是否配置                                     $    $           $    $  ANS004.BYTE006  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  032.EMS(发动机管理系统)是否配置                           $    $           $    $  ANS004.BYTE006  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  033.SAS(方向盘转向角传感器)是否配置                       $    $           $    $  ANS004.BYTE006  $  if(((x&0x08)>>3)==0) y=@00b9;else if(((x&0x08)>>3)==1) y=@00ba;else y=@0035;
  $  034.SRS(安全气囊)是否配置                                 $    $           $    $  ANS004.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  035.FICM(娱乐系统大屏含导航)是否配置                      $    $           $    $  ANS004.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  036.PLG(电动尾门)是否配置                                 $    $           $    $  ANS004.BYTE006  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  037.转向变道灯开关滤波时间                                $    $           $    $  ANS004.BYTE007  $  if(((x&0xC0)>>6)==0) y=@0539;else if(((x&0xC0)>>6)==1) y=@053a;else if(((x&0xC0)>>6)==2) y=@053b;else if(((x&0xC0)>>6)==3) y=@0c83;else y=@0035;
  $  038.VCU(整车控制器)是否配置                               $    $           $    $  ANS004.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  039.胎压监控是否配置                                      $    $           $    $  ANS004.BYTE007  $  if(((x&0x06)>>1)==0) y=@00b9;else if(((x&0x06)>>1)==1) y=@0cd7;else if(((x&0x06)>>1)==2) y=@0d08;else if(((x&0x06)>>1)==3) y=@0d09;else y=@0035;
  $  040.RFA(射频放大器)是否配置                               $    $           $    $  ANS004.BYTE007  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  041.BCM(车身控制管理系统)电源                             $    $  V        $    $  ANS005.BYTE004  $  y=x*0.1;
  $  042.行驶里程备份                                          $    $  km       $    $  ANS006.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  043.背光灯等级百分比                                      $    $  %        $    $  ANS007.BYTE004  $  y=x;
  $  044.当前IDE                                               $    $           $    $  ANS008.BYTE004  $  HEX(X1,X2,X3,X4);
  $  045.当前学习RKE(遥控钥匙)数量                             $    $           $    $  ANS009.BYTE004  $  y=x;
  $  046.疲劳驾驶参数选择                                      $    $           $    $  ANS010.BYTE004  $  y=x;
  $  047.疲劳驾驶性能调节                                      $    $           $    $  ANS010.BYTE005  $  y=(x1*256+x2)*0.00390625;
  $  048.DDD(疲劳驾驶检测)配置                                 $    $           $    $  ANS010.BYTE007  $  if((x&0x01)==0) y=@0136;else if((x&0x01)==1) y=@0d0a;else y=@0035;
  $  049.照我回家配置                                          $    $           $    $  ANS011.BYTE004  $  if(((x&0xE0)>>5)==0) y=@000f;else if(((x&0xE0)>>5)==1) y=@0491;else if(((x&0xE0)>>5)==2) y=@0492;else if(((x&0xE0)>>5)==3) y=@0493;else y=@0035;
  $  050.自动解锁个性化菜单配置字                              $    $           $    $  ANS011.BYTE005  $  if(((x&0x04)>>2)==0) y=@0cb4;else if(((x&0x04)>>2)==1) y=@0c0a;else y=@0035;
  $  051.氛围灯使能默认配置                                    $    $           $    $  ANS011.BYTE004  $  if(((x&0x0C)>>2)==0) y=@00b9;else if(((x&0x0C)>>2)==1) y=@00ba;else y=@0035;
  $  052.RKE主驾单独解锁配置                                   $    $           $    $  ANS011.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  053.PKE主驾单独解锁配置                                   $    $           $    $  ANS011.BYTE004  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  054.车速闭锁默认配置                                      $    $           $    $  ANS011.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  055.闭锁反馈方式                                          $    $           $    $  ANS011.BYTE004  $  if(((x&0x18)>>3)==0) y=@000f;else if(((x&0x18)>>3)==1) y=@0506;else if(((x&0x18)>>3)==2) y=@0c71;else if(((x&0x18)>>3)==3) y=@0504;else y=@0035;
  $  056.照地灯时间默认配置                                    $    $           $    $  ANS011.BYTE006  $  if(((x&0x60)>>5)==0) y=@0d02;else if(((x&0x60)>>5)==1) y=@0491;else if(((x&0x60)>>5)==2) y=@0492;else if(((x&0x60)>>5)==3) y=@0493;else y=@0035;
  $  057.后视镜折叠有无配置                                    $    $           $    $  ANS011.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  058.解锁迎宾模式配置                                      $    $           $    $  ANS011.BYTE007  $  if(((x&0x38)>>3)==0) y=@0d03;else if(((x&0x38)>>3)==1) y=@0abd;else if(((x&0x38)>>3)==2) y=@0abe;else if(((x&0x38)>>3)==3) y=@0c3b;else if(((x&0x38)>>3)==4) y=@0c3c;else y=@0035;
  $  059.闭锁迎宾模式配置                                      $    $           $    $  ANS011.BYTE007  $  if((x&0x07)==0) y=@0d03;else if((x&0x07)==1) y=@0abd;else if((x&0x07)==2) y=@0abe;else if((x&0x07)==3) y=@0c3b;else if((x&0x07)==4) y=@0c3c;else y=@0035;
  $  060.碰撞信号百分比                                        $    $  %        $    $  ANS012.BYTE004  $  y=x;
  $  061.左转向灯故障信号百分比                                $    $  %        $    $  ANS012.BYTE005  $  y=x;
  $  062.右转向灯故障信号百分比                                $    $  %        $    $  ANS012.BYTE006  $  y=x;
  $  063.ECU PIN(在IMMO锁住之前)                               $    $           $    $  ANS013.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  064.右远光灯输出（单光源)                                 $    $           $    $  ANS014.BYTE004  $  if(((x&0x80)>>7)==0) y=@0d00;else if(((x&0x80)>>7)==1) y=@0d01;else y=@0035;
  $  065.左远光灯输出（单光源）                                $    $           $    $  ANS014.BYTE004  $  if(((x&0x40)>>6)==0) y=@0d00;else if(((x&0x40)>>6)==1) y=@0d01;else y=@0035;
  $  066.右近光灯输出（灯泡)                                   $    $           $    $  ANS014.BYTE004  $  if(((x&0x08)>>3)==0) y=@0d00;else if(((x&0x08)>>3)==1) y=@0d01;else y=@0035;
  $  067.左近光灯输出（灯泡)                                   $    $           $    $  ANS014.BYTE004  $  if(((x&0x04)>>2)==0) y=@0d00;else if(((x&0x04)>>2)==1) y=@0d01;else y=@0035;
  $  068.右/右前转向灯输出                                     $    $           $    $  ANS014.BYTE005  $  if(((x&0x20)>>5)==0) y=@0d00;else if(((x&0x20)>>5)==1) y=@0d01;else y=@0035;
  $  069.左/左前转向灯输出                                     $    $           $    $  ANS014.BYTE005  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  070.左/位置灯输出                                         $    $           $    $  ANS014.BYTE005  $  if((x&0x01)==0) y=@0d00;else if((x&0x01)==1) y=@0d01;else y=@0035;
  $  071.倒挡信号硬线输出                                      $    $           $    $  ANS015.BYTE004  $  if(((x&0x80)>>7)==0) y=@0d00;else if(((x&0x80)>>7)==1) y=@0d01;else y=@0035;
  $  072.后雾灯输出                                            $    $           $    $  ANS015.BYTE004  $  if(((x&0x04)>>2)==0) y=@0d00;else if(((x&0x04)>>2)==1) y=@0d01;else y=@0035;
  $  073.倒车灯输出                                            $    $           $    $  ANS015.BYTE005  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  074.高位制动灯                                            $    $           $    $  ANS015.BYTE005  $  if(((x&0x04)>>2)==0) y=@0d00;else if(((x&0x04)>>2)==1) y=@0d01;else y=@0035;
  $  075.左刹车灯输出A                                         $    $           $    $  ANS015.BYTE005  $  if((x&0x01)==0) y=@0d00;else if((x&0x01)==1) y=@0d01;else y=@0035;
  $  076.发动机运行状态                                        $    $           $    $  ANS016.BYTE004  $  if(x==0) y=@018e;else if(x==1) y=@0c2c;else y=@0103;
  $  077.超车灯开关                                            $    $           $    $  ANS017.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  078.远光灯开关                                            $    $           $    $  ANS017.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  079.位置灯开关                                            $    $           $    $  ANS017.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  080.近光灯开关                                            $    $           $    $  ANS017.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  081.危险报警灯开关                                        $    $           $    $  ANS017.BYTE005  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  082.左转向灯开关                                          $    $           $    $  ANS017.BYTE005  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  083.右转向灯开关                                          $    $           $    $  ANS017.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  084.后雾灯开关                                            $    $           $    $  ANS017.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  085.喇叭开关                                              $    $           $    $  ANS017.BYTE006  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  086.倒车灯开关                                            $    $           $    $  ANS017.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  087.刹车灯开关                                            $    $           $    $  ANS017.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  088.前内顶灯关闭开关                                      $    $           $    $  ANS017.BYTE009  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  089.前内顶灯打开开关                                      $    $           $    $  ANS017.BYTE009  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  090.前内顶灯自动开关                                      $    $           $    $  ANS017.BYTE009  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  091.全局里程信息                                          $    $  km       $    $  ANS018.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  092.防盗锁状态                                            $    $           $    $  ANS019.BYTE004  $  if(((x&0x80)>>7)==0) y=@012e;else if(((x&0x80)>>7)==1) y=@0055;else y=@0035;
  $  093.PIN写入状态                                           $    $           $    $  ANS019.BYTE004  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@00ca;else y=@0035;
  $  094.SK写入状态                                            $    $           $    $  ANS019.BYTE004  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@00ca;else y=@0035;
  $  095.VIN写入状态                                           $    $           $    $  ANS019.BYTE004  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0035;
  $  096.IMMO钥匙学习数量                                      $    $           $    $  ANS019.BYTE004  $  y=(x&0x0F);
  $  097.SK2锁状态                                             $    $           $    $  ANS020.BYTE004  $  if(((x&0x80)>>7)==0) y=@012e;else if(((x&0x80)>>7)==1) y=@0055;else y=@0035;
  $  098.SK2写入状态                                           $    $           $    $  ANS020.BYTE004  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@00ca;else y=@0035;
  $  099.厢货内灯输出                                          $    $           $    $  ANS021.BYTE004  $  if(((x&0x40)>>6)==0) y=@0d00;else if(((x&0x40)>>6)==1) y=@0d01;else y=@0035;
  $  100.背光输出                                              $    $           $    $  ANS021.BYTE004  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  101.内灯输出B                                             $    $           $    $  ANS021.BYTE004  $  if(((x&0x02)>>1)==0) y=@0d00;else if(((x&0x02)>>1)==1) y=@0d01;else y=@0035;
  $  102.节电输出                                              $    $           $    $  ANS021.BYTE004  $  if((x&0x01)==0) y=@0d00;else if((x&0x01)==1) y=@0d01;else y=@0035;
  $  103.喇叭输出                                              $    $           $    $  ANS021.BYTE005  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  104.全局KL50状态                                          $    $           $    $  ANS022.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  105.全局发动机运行状态                                    $    $           $    $  ANS022.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  106.全局KL15状态                                          $    $           $    $  ANS022.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  107.全局ACC/KLR状态                                       $    $           $    $  ANS022.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  108.KL50状态                                              $    $           $    $  ANS022.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  109.发动机运行状态                                        $    $           $    $  ANS022.BYTE004  $  if(x==0) y=@018e;else if(x==1) y=@0c2c;else y=@0103;
  $  110.KL15状态                                              $    $           $    $  ANS022.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  111.ACC/KLR状态                                           $    $           $    $  ANS022.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  112.KL15                                                  $    $           $    $  ANS023.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  113.ACC                                                   $    $           $    $  ANS023.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  114.启动停止开关有效性                                    $    $           $    $  ANS023.BYTE005  $  if(((x&0x20)>>5)==0) y=@0197;else if(((x&0x20)>>5)==1) y=@0266;else y=@0035;
  $  115.启动停止开关                                          $    $           $    $  ANS023.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  116.点火开关有效性                                        $    $           $    $  ANS023.BYTE005  $  if(((x&0x08)>>3)==0) y=@0197;else if(((x&0x08)>>3)==1) y=@0266;else y=@0035;
  $  117.点火状态开关                                          $    $           $    $  ANS023.BYTE005  $  if((x&0x07)==0) y=@0c32;else if((x&0x07)==1) y=@0d06;else if((x&0x07)==2) y=@0464;else if((x&0x07)==3) y=@0d07;else y=@0035;
  $  118.主驾门解锁                                            $    $           $    $  ANS024.BYTE004  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  119.中控闭锁                                              $    $           $    $  ANS024.BYTE004  $  if(((x&0x02)>>1)==0) y=@0d00;else if(((x&0x02)>>1)==1) y=@0d01;else y=@0035;
  $  120.中控解锁                                              $    $           $    $  ANS024.BYTE004  $  if((x&0x01)==0) y=@0d00;else if((x&0x01)==1) y=@0d01;else y=@0035;
  $  121.充电枪解锁                                            $    $           $    $  ANS024.BYTE005  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  122.尾门解锁                                              $    $           $    $  ANS024.BYTE005  $  if((x&0x01)==0) y=@0d00;else if((x&0x01)==1) y=@0d01;else y=@0035;
  $  123.前舱盖是否配置                                        $    $           $    $  ANS025.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  124.前雾灯是否配置                                        $    $           $    $  ANS025.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  125.位置灯超时强制熄灭配置                                $    $           $    $  ANS025.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  126.后备箱灯是否配置                                      $    $           $    $  ANS025.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  127.大灯配置                                              $    $           $    $  ANS025.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0c34;else if(((x&0x0C)>>2)==1) y=@0c35;else if(((x&0x0C)>>2)==2) y=@0c36;else y=@0035;
  $  128.位置灯熄灭配置                                        $    $           $    $  ANS025.BYTE004  $  if((x&0x01)==0) y=@0c38;else if((x&0x01)==1) y=@0c39;else y=@0035;
  $  129.前雾灯辅助照明配置                                    $    $           $    $  ANS025.BYTE005  $  if(((x&0xC0)>>6)==0) y=@00b9;else if(((x&0xC0)>>6)==1) y=@0c4a;else if(((x&0xC0)>>6)==2) y=@0c4b;else y=@0035;
  $  130.日行灯熄灭配置1                                       $    $           $    $  ANS025.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@0c4c;else y=@0035;
  $  131.背光灯默认亮度                                        $    $           $    $  ANS025.BYTE005  $  if(((x&0x18)>>3)==0) y=@000f;else if(((x&0x18)>>3)==1) y=@0c4d;else if(((x&0x18)>>3)==2) y=@0cc8;else if(((x&0x18)>>3)==3) y=@0c4f;else y=@0035;
  $  132.氛围灯点亮时间                                        $    $           $    $  ANS025.BYTE005  $  if(((x&0x06)>>1)==0) y=@000f;else if(((x&0x06)>>1)==1) y=@04fd;else if(((x&0x06)>>1)==2) y=@0502;else if(((x&0x06)>>1)==3) y=@0503;else y=@0035;
  $  133.日行灯配置                                            $    $           $    $  ANS025.BYTE005  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  134.转向灯类型配置字                                      $    $           $    $  ANS025.BYTE006  $  if(((x&0xC0)>>6)==0) y=@0c51;else if(((x&0xC0)>>6)==1) y=@04fe;else if(((x&0xC0)>>6)==2) y=@0c53;else if(((x&0xC0)>>6)==3) y=@0c54;else y=@0035;
  $  135.自动灯光判断配置                                      $    $           $    $  ANS025.BYTE006  $  if(((x&0x30)>>4)==0) y=@00b9;else if(((x&0x30)>>4)==1) y=@0c56;else if(((x&0x30)>>4)==2) y=@0c57;else if(((x&0x30)>>4)==3) y=@0035;else y=@0035;
  $  136.照地灯配置                                            $    $           $    $  ANS025.BYTE006  $  if(((x&0x0C)>>2)==0) y=@00b9;else if(((x&0x0C)>>2)==1) y=@0491;else y=@0035;
  $  137.大灯迎宾灯功能配置                                    $    $           $    $  ANS025.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  138.前雾灯倒车灯配置                                      $    $           $    $  ANS025.BYTE006  $  if((x&0x01)==0) y=@0cce;else if((x&0x01)==1) y=@0ccf;else y=@0035;
  $  139.解锁迎宾模式配置                                      $    $           $    $  ANS025.BYTE007  $  if(((x&0x38)>>3)==0) y=@0d03;else if(((x&0x38)>>3)==1) y=@0abd;else if(((x&0x38)>>3)==2) y=@0abe;else if(((x&0x38)>>3)==3) y=@0c3b;else if(((x&0x38)>>3)==4) y=@0c3c;else y=@0035;
  $  140.闭锁迎宾模式配置                                      $    $           $    $  ANS025.BYTE007  $  if((x&0x07)==0) y=@0d03;else if((x&0x07)==1) y=@0abd;else if((x&0x07)==2) y=@0abe;else if((x&0x07)==3) y=@0c3b;else if((x&0x07)==4) y=@0c3c;else y=@0035;
  $  141.迎宾持续时间                                          $    $           $    $  ANS025.BYTE008  $  y=x*0.5;
  $  142.刹车灯点亮百分比                                      $    $  %        $    $  ANS025.BYTE011  $  y=((x&0xF0)>>4);
  $  143.刹车灯熄灭百分比                                      $    $  %        $    $  ANS025.BYTE011  $  y=(x&0x0F);
  $  144.闭锁源记录 1                                          $    $           $    $  ANS026.BYTE004  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  145.闭锁源记录 2                                          $    $           $    $  ANS026.BYTE005  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  146.闭锁源记录 3                                          $    $           $    $  ANS026.BYTE006  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  147.闭锁源记录 4                                          $    $           $    $  ANS026.BYTE007  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  148.闭锁源记录 5                                          $    $           $    $  ANS026.BYTE008  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  149.闭锁源记录 6                                          $    $           $    $  ANS026.BYTE009  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  150.闭锁源记录 7                                          $    $           $    $  ANS026.BYTE010  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  151.闭锁源记录 8                                          $    $           $    $  ANS026.BYTE011  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  152.闭锁源记录 9                                          $    $           $    $  ANS026.BYTE012  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  153.闭锁源记录 10                                         $    $           $    $  ANS026.BYTE013  $  if(x==1) y=@0c58;else if(x==2) y=@0cd1;else if(x==3) y=@0cd2;else if(x==4) y=@0d04;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else if(x==7) y=@0d05;else y=@0035;
  $  154.中控解锁开关                                          $    $           $    $  ANS027.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  155.中控闭锁开关                                          $    $           $    $  ANS027.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  156.副驾锁反馈                                            $    $           $    $  ANS027.BYTE006  $  if(((x&0x10)>>4)==0) y=@0c42;else if(((x&0x10)>>4)==1) y=@0c43;else y=@0035;
  $  157.主驾门锁反馈                                          $    $           $    $  ANS027.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  158.右后门开关                                            $    $           $    $  ANS027.BYTE007  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  159.左后门半开                                            $    $           $    $  ANS027.BYTE007  $  if(((x&0x10)>>4)==0) y=@0c42;else if(((x&0x10)>>4)==1) y=@0c43;else y=@0035;
  $  160.乘客门开开                                            $    $           $    $  ANS027.BYTE007  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  161.驾驶门开关                                            $    $           $    $  ANS027.BYTE007  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  162.后背门开关                                            $    $           $    $  ANS027.BYTE008  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  163.照我回家配置                                          $    $           $    $  ANS028.BYTE004  $  if(((x&0xE0)>>5)==0) y=@000f;else if(((x&0xE0)>>5)==1) y=@0491;else if(((x&0xE0)>>5)==2) y=@0492;else if(((x&0xE0)>>5)==3) y=@0493;else y=@0035;
  $  164.闭锁反馈方式                                          $    $           $    $  ANS028.BYTE004  $  if(((x&0x18)>>3)==0) y=@000f;else if(((x&0x18)>>3)==1) y=@0506;else if(((x&0x18)>>3)==2) y=@0c71;else if(((x&0x18)>>3)==3) y=@0504;else y=@0035;
  $  165.驾驶模式记忆配置                                      $    $           $    $  ANS028.BYTE004  $  if(((x&0x04)>>2)==0) y=@0d10;else if(((x&0x04)>>2)==1) y=@0c45;else y=@0035;
  $  166.寻车功能持续时间                                      $    $           $    $  ANS028.BYTE004  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@0491;else if((x&0x03)==2) y=@0492;else if((x&0x03)==3) y=@0493;else y=@0035;
  $  167.寻车功能反馈方式                                      $    $           $    $  ANS028.BYTE005  $  if(((x&0x80)>>7)==0) y=@0506;else if(((x&0x80)>>7)==1) y=@0c71;else y=@0035;
  $  168.解锁反馈方式                                          $    $           $    $  ANS028.BYTE005  $  if(((x&0x60)>>5)==0) y=@000f;else if(((x&0x60)>>5)==1) y=@0506;else y=@0035;
  $  169.熄火解锁触发方式                                      $    $           $    $  ANS028.BYTE005  $  if(((x&0x18)>>3)==0) y=@0c6a;else if(((x&0x18)>>3)==1) y=@0495;else if(((x&0x18)>>3)==2) y=@0cb4;else y=@0035;
  $  170.自动解锁个性化菜单配置字                              $    $           $    $  ANS028.BYTE005  $  if(((x&0x04)>>2)==0) y=@0cb4;else if(((x&0x04)>>2)==1) y=@0c0a;else y=@0035;
  $  171.遥控关天窗配置                                        $    $           $    $  ANS028.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  172.遥控开天窗配置                                        $    $           $    $  ANS028.BYTE005  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  173.PLG(电动尾门)信号发送时间配置                         $    $  ms       $    $  ANS028.BYTE006  $  y=x*10;
  $  174.智能巡航开关                                          $    $           $    $  ANS028.BYTE007  $  if(((x&0x80)>>7)==0) y=@0136;else if(((x&0x80)>>7)==1) y=@0d0a;else y=@0035;
  $  175.巡航开关                                              $    $           $    $  ANS028.BYTE007  $  if(((x&0x40)>>6)==0) y=@0136;else if(((x&0x40)>>6)==1) y=@0d0a;else y=@0035;
  $  176.遥控升窗配置                                          $    $           $    $  ANS028.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  177.遥控降窗配置                                          $    $           $    $  ANS028.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  178.ECO(经济模式)/SPORT(运动模式)配置                     $    $           $    $  ANS028.BYTE007  $  if(((x&0x0C)>>2)==0) y=@0c5e;else if(((x&0x0C)>>2)==1) y=@0cb5;else if(((x&0x0C)>>2)==2) y=@0cb6;else y=@0035;
  $  179.换挡器配置                                            $    $           $    $  ANS028.BYTE007  $  if((x&0x03)==0) y=@0cb7;else if((x&0x03)==1) y=@0cb8;else if((x&0x03)==2) y=@0c5e;else y=@0035;
  $  180.保养里程备份                                          $    $  km       $    $  ANS029.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  181.SK2锁定状态                                           $    $           $    $  ANS030.BYTE004  $  if(((x&0x80)>>7)==0) y=@012e;else if(((x&0x80)>>7)==1) y=@0055;else y=@0035;
  $  182.SK2写入状态                                           $    $           $    $  ANS030.BYTE004  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@00ca;else y=@0035;
  $  183.软件版本日期                                          $    $           $    $  ANS031.BYTE004  $  HEX(X1,X2,X3,X4);
  $  184.TBOX(远程监控模块)请求需认证配置                      $    $           $    $  ANS032.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  185.TBOX算法配置                                          $    $           $    $  ANS032.BYTE004  $  if(((x&0x40)>>6)==0) y=@0c02;else if(((x&0x40)>>6)==1) y=@0c03;else y=@0035;
  $  186.TBOX(远程监控模块)控制车窗配置                        $    $           $    $  ANS032.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  187.TBOX(远程监控模块)远程启动功能配置                    $    $           $    $  ANS032.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  188.TBOX(远程监控模块)远程钥匙管理功能                    $    $           $    $  ANS032.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b9;else if(((x&0x08)>>3)==1) y=@00ba;else y=@0035;
  $  189.TBOX(远程监控模块)远程寻车功能配置                    $    $           $    $  ANS032.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  190.TBOX(远程监控模块)远程解闭锁控制功能配置字            $    $           $    $  ANS032.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  191.TBOX(远程监控模块)功能配置字                          $    $           $    $  ANS032.BYTE004  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  192.BCM(车身控制管理系统)允许重复发送认证的最大次数       $    $           $    $  ANS032.BYTE005  $  if(((x&0xC0)>>6)==0) y=@0d0c;else if(((x&0xC0)>>6)==1) y=@0d0d;else if(((x&0xC0)>>6)==2) y=@0d0e;else if(((x&0xC0)>>6)==3) y=@0d0f;else y=@0035;
  $  193.BCM(车身控制管理系统)允许认证失败次数                 $    $           $    $  ANS032.BYTE005  $  if(((x&0x30)>>4)==0) y=@0d0c;else if(((x&0x30)>>4)==1) y=@0d0d;else if(((x&0x30)>>4)==2) y=@0d0e;else if(((x&0x30)>>4)==3) y=@0d0f;else y=@0035;
  $  194.TBOX(远程监控模块)响应等待时间                        $    $  s        $    $  ANS032.BYTE005  $  y=(x&0x0F);
  $  195.温度补偿误差阈值                                      $    $  kPa      $    $  ANS033.BYTE004  $  y=x;
  $  196.胎压地区配置字                                        $    $           $    $  ANS033.BYTE005  $  if((x&0x03)==0) y=@0c87;else if((x&0x03)==1) y=@0c88;else if((x&0x03)==2) y=@0c89;else y=@0035;
  $  197.高压报警使能配置字                                    $    $           $    $  ANS033.BYTE006  $  if(((x&0x80)>>7)==0) y=@0112;else if(((x&0x80)>>7)==1) y=@00f0;else y=@0035;
  $  198.高压报警阈值配置                                      $    $  kPa      $    $  ANS033.BYTE006  $  y=(x&0x7F)*2.75+440;
  $  199.前轮标准冷态胎压值配置                                $    $  kPa      $    $  ANS033.BYTE007  $  y=x*2.75;
  $  200.后轮标准冷态胎压值配置                                $    $  kPa      $    $  ANS033.BYTE008  $  y=x*2.75;
  $  201.变速箱档位信号                                        $    $           $    $  ANS034.BYTE004  $  if((x&0x0F)==0) y=@0262;else if((x&0x0F)==1) y=@04d3;else if((x&0x0F)==10) y=@0103;else if((x&0x0F)==11) y=@0263;else if((x&0x0F)==12) y=@0103;else if((x&0x0F)==13) y=@0187;else if((x&0x0F)==14) y=@0103;else if((x&0x0F)==15) y=@042f;else if((x&0x0F)==2) y=@0169;else if((x&0x0F)==3) y=@016a;else if((x&0x0F)==4) y=@016b;else if((x&0x0F)==5) y=@054a;else if((x&0x0F)==6) y=@054b;else if((x&0x0F)==7) y=@0103;else if((x&0x0F)==8) y=@0103;else y=@0103;
  $  202.解锁源记录 1                                          $    $           $    $  ANS035.BYTE004  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  203.解锁源记录 2                                          $    $           $    $  ANS035.BYTE005  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  204.解锁源记录 3                                          $    $           $    $  ANS035.BYTE006  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  205.解锁源记录 4                                          $    $           $    $  ANS035.BYTE007  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  206.解锁源记录 5                                          $    $           $    $  ANS035.BYTE008  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  207.解锁源记录 6                                          $    $           $    $  ANS035.BYTE009  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  208.解锁源记录 7                                          $    $           $    $  ANS035.BYTE010  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  209.解锁源记录 8                                          $    $           $    $  ANS035.BYTE011  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  210.解锁源记录 9                                          $    $           $    $  ANS035.BYTE012  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  211.解锁源记录 10                                         $    $           $    $  ANS035.BYTE013  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0d11;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else if(x==7) y=@0d05;else y=@0035;
  $  212.车速信号                                              $    $  km/h     $    $  ANS036.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  213.车速状态                                              $    $           $    $  ANS036.BYTE006  $  if(x==0) y=@0d0a;else if(x==1) y=@0136;else y=@0103;
  $  214.前喷水电机输出                                        $    $           $    $  ANS037.BYTE005  $  if(((x&0x10)>>4)==0) y=@0d00;else if(((x&0x10)>>4)==1) y=@0d01;else y=@0035;
  $  215.前雨刮高速输出                                        $    $           $    $  ANS037.BYTE005  $  if(((x&0x02)>>1)==0) y=@0d00;else if(((x&0x02)>>1)==1) y=@0d01;else y=@0035;
  $  216.前雨刮低速输出                                        $    $           $    $  ANS037.BYTE005  $  if((x&0x01)==0) y=@0d00;else if((x&0x01)==1) y=@0d01;else y=@0035;
  $  217.唤醒源记录 1                                          $    $           $    $  ANS038.BYTE004  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  218.唤醒源记录 2                                          $    $           $    $  ANS038.BYTE005  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  219.唤醒源记录 3                                          $    $           $    $  ANS038.BYTE006  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  220.唤醒源记录 4                                          $    $           $    $  ANS038.BYTE007  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  221.唤醒源记录 5                                          $    $           $    $  ANS038.BYTE008  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  222.唤醒源记录 6                                          $    $           $    $  ANS038.BYTE009  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  223.唤醒源记录 7                                          $    $           $    $  ANS038.BYTE010  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  224.唤醒源记录 8                                          $    $           $    $  ANS038.BYTE011  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  225.唤醒源记录 9                                          $    $           $    $  ANS038.BYTE012  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  226.唤醒源记录 10                                         $    $           $    $  ANS038.BYTE013  $  if(x==0) y=@0c98;else if(x==1) y=@0d12;else if(x==16) y=@0d13;else if(x==18) y=@0d14;else if(x==2) y=@0d15;else if(x==32) y=@0d16;else if(x==34) y=@0d17;else if(x==35) y=@0d18;else if(x==4) y=@0d19;else if(x==48) y=@0d1a;else if(x==49) y=@0d1b;else if(x==6) y=@0d1c;else if(x==80) y=@0cad;else if(x==87) y=@0c1f;else y=@0035;
  $  227.前雨刮自动                                            $    $           $    $  ANS039.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  228.后雨刮有无配置                                        $    $           $    $  ANS039.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  229.背光灯是否可调节                                      $    $           $    $  ANS039.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  230.前雨刮前洗涤开关有效接合时间                          $    $  ms       $    $  ANS039.BYTE005  $  y=x*100;
  $  231.雨刮堵转判断时间                                      $    $  s        $    $  ANS039.BYTE006  $  y=x;
  $  232.后雨刮前洗涤开关有效接合时间                          $    $  ms       $    $  ANS039.BYTE007  $  y=x*100;
  $  233.前雨刮归位信号                                        $    $           $    $  ANS040.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  234.前洗涤开关                                            $    $           $    $  ANS040.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  235.前雨刮点动开关                                        $    $           $    $  ANS040.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  236.前雨刮高速开关                                        $    $           $    $  ANS040.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  237.前雨刮低速开关                                        $    $           $    $  ANS040.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  238.前雨刮灵敏度(间歇档位)                                $    $           $    $  ANS040.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  239.前雨刮间歇/自动开关                                   $    $           $    $  ANS040.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:706 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
