
    车型ID：10ad

    模拟：协议模拟-->10ad

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k

进入命令:

  $~  REQ000:706 02 10 01 00 00 00 00 00       $~  ANS000:786 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:706 02 3E 80 00 00 00 00 00       $!  ANS000:786 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:706 03 19 02 09 00 00 00 00       $#  ANS000:786 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/aa000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:706 04 14 FF FF FF 00 00 00       $$  ANS000:786 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:706 03 22 F1 A0 00 00 00 00       $%  ANS000:786 03 22 F1 A0 00 00 00 00
  $%  REQ001:706 03 22 F1 83 00 00 00 00       $%  ANS001:786 03 22 F1 83 00 00 00 00
  $%  REQ002:706 03 22 F1 91 00 00 00 00       $%  ANS002:786 03 22 F1 91 00 00 00 00
  $%  REQ003:706 03 22 F1 8B 00 00 00 00       $%  ANS003:786 03 22 F1 8B 00 00 00 00
  $%  REQ004:706 03 22 F1 92 00 00 00 00       $%  ANS004:786 03 22 F1 92 00 00 00 00
  $%  REQ005:706 03 22 F1 87 00 00 00 00       $%  ANS005:786 03 22 F1 87 00 00 00 00
  $%  REQ006:706 03 22 F1 10 00 00 00 00       $%  ANS006:786 03 22 F1 10 00 00 00 00
  $%  REQ007:706 03 22 F1 8C 00 00 00 00       $%  ANS007:786 03 22 F1 8C 00 00 00 00
  $%  REQ008:706 03 22 F1 94 00 00 00 00       $%  ANS008:786 03 22 F1 94 00 00 00 00
  $%  REQ009:706 03 22 F1 8A 00 00 00 00       $%  ANS009:786 03 22 F1 8A 00 00 00 00
  $%  REQ010:706 03 22 F1 90 00 00 00 00       $%  ANS010:786 03 22 F1 90 00 00 00 00
  $%  REQ011:706 03 22 F1 A8 00 00 00 00       $%  ANS011:786 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:年:                              $%    $%  ANS003.BYTE004  $%  HEX(X1);
  $%  004:月:                              $%    $%  ANS003.BYTE005  $%  HEX(X1);
  $%  005:日:                              $%    $%  ANS003.BYTE006  $%  HEX(X1);
  $%  006:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号（上次）:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号（上次）:          $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数（上次）KM:              $%    $%  ANS006.BYTE015  $%  HEX(X1,X2,X3);
  $%  011:保留状态:                        $%    $%  ANS006.BYTE018  $%  HEX(X1,X2);
  $%  012:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  014:系统供应商识别号:                $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6);
  $%  015:VIN:                             $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  016:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:706 03 22 D1 19 00 00 00 00       $  ANS000:786 03 22 D1 19 00 00 00 00
  $  REQ001:706 03 22 C1 04 00 00 00 00       $  ANS001:786 03 22 C1 04 00 00 00 00
  $  REQ002:706 03 22 D1 05 00 00 00 00       $  ANS002:786 03 22 D1 05 00 00 00 00
  $  REQ003:706 03 22 C1 01 00 00 00 00       $  ANS003:786 03 22 C1 01 00 00 00 00
  $  REQ004:706 03 22 01 12 00 00 00 00       $  ANS004:786 03 22 01 12 00 00 00 00
  $  REQ005:706 03 22 E0 1B 00 00 00 00       $  ANS005:786 03 22 E0 1B 00 00 00 00
  $  REQ006:706 03 22 E0 1E 00 00 00 00       $  ANS006:786 03 22 E0 1E 00 00 00 00
  $  REQ007:706 03 22 C0 02 00 00 00 00       $  ANS007:786 03 22 C0 02 00 00 00 00
  $  REQ008:706 03 22 E0 1A 00 00 00 00       $  ANS008:786 03 22 E0 1A 00 00 00 00
  $  REQ009:706 03 22 C1 06 00 00 00 00       $  ANS009:786 03 22 C1 06 00 00 00 00
  $  REQ010:706 03 22 C1 08 00 00 00 00       $  ANS010:786 03 22 C1 08 00 00 00 00
  $  REQ011:706 03 22 D1 06 00 00 00 00       $  ANS011:786 03 22 D1 06 00 00 00 00
  $  REQ012:706 03 22 CF 10 00 00 00 00       $  ANS012:786 03 22 CF 10 00 00 00 00
  $  REQ013:706 03 22 D1 10 00 00 00 00       $  ANS013:786 03 22 D1 10 00 00 00 00
  $  REQ014:706 03 22 D1 11 00 00 00 00       $  ANS014:786 03 22 D1 11 00 00 00 00
  $  REQ015:706 03 22 E0 18 00 00 00 00       $  ANS015:786 03 22 E0 18 00 00 00 00
  $  REQ016:706 03 22 D1 02 00 00 00 00       $  ANS016:786 03 22 D1 02 00 00 00 00
  $  REQ017:706 03 22 E1 01 00 00 00 00       $  ANS017:786 03 22 E1 01 00 00 00 00
  $  REQ018:706 03 22 D3 10 00 00 00 00       $  ANS018:786 03 22 D3 10 00 00 00 00
  $  REQ019:706 03 22 D3 13 00 00 00 00       $  ANS019:786 03 22 D3 13 00 00 00 00
  $  REQ020:706 03 22 D1 13 00 00 00 00       $  ANS020:786 03 22 D1 13 00 00 00 00
  $  REQ021:706 03 22 D0 01 00 00 00 00       $  ANS021:786 03 22 D0 01 00 00 00 00
  $  REQ022:706 03 22 D1 01 00 00 00 00       $  ANS022:786 03 22 D1 01 00 00 00 00
  $  REQ023:706 03 22 D1 17 00 00 00 00       $  ANS023:786 03 22 D1 17 00 00 00 00
  $  REQ024:706 03 22 C1 02 00 00 00 00       $  ANS024:786 03 22 C1 02 00 00 00 00
  $  REQ025:706 03 22 62 05 00 00 00 00       $  ANS025:786 03 22 62 05 00 00 00 00
  $  REQ026:706 03 22 D1 03 00 00 00 00       $  ANS026:786 03 22 D1 03 00 00 00 00
  $  REQ027:706 03 22 C1 05 00 00 00 00       $  ANS027:786 03 22 C1 05 00 00 00 00
  $  REQ028:706 03 22 E0 1C 00 00 00 00       $  ANS028:786 03 22 E0 1C 00 00 00 00
  $  REQ029:706 03 22 D3 03 00 00 00 00       $  ANS029:786 03 22 D3 03 00 00 00 00
  $  REQ030:706 03 22 E2 11 00 00 00 00       $  ANS030:786 03 22 E2 11 00 00 00 00
  $  REQ031:706 03 22 C1 07 00 00 00 00       $  ANS031:786 03 22 C1 07 00 00 00 00
  $  REQ032:706 03 22 C1 09 00 00 00 00       $  ANS032:786 03 22 C1 09 00 00 00 00
  $  REQ033:706 03 22 D3 02 00 00 00 00       $  ANS033:786 03 22 D3 02 00 00 00 00
  $  REQ034:706 03 22 62 06 00 00 00 00       $  ANS034:786 03 22 62 06 00 00 00 00
  $  REQ035:706 03 22 E0 17 00 00 00 00       $  ANS035:786 03 22 E0 17 00 00 00 00
  $  REQ036:706 03 22 D1 15 00 00 00 00       $  ANS036:786 03 22 D1 15 00 00 00 00
  $  REQ037:706 03 22 62 04 00 00 00 00       $  ANS037:786 03 22 62 04 00 00 00 00
  $  REQ038:706 03 22 C1 03 00 00 00 00       $  ANS038:786 03 22 C1 03 00 00 00 00
  $  REQ039:706 03 22 D1 04 00 00 00 00       $  ANS039:786 03 22 D1 04 00 00 00 00

  $  000.5V输出                                                    $    $           $    $  ANS000.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  001.KLR 唤醒输出                                              $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0004;
  $  002.TCU(变速箱控制单元) 唤醒输出                              $    $           $    $  ANS000.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  003.B+ 唤醒输出                                               $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  004.EMS(发动机管理系统) 唤醒输出                              $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  005.P档解锁输出                                               $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  006.KL15继电器                                                $    $           $    $  ANS000.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  007.KLR继电器                                                 $    $           $    $  ANS000.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  008.车速自动闭锁                                              $    $           $    $  ANS001.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0004;
  $  009.后风窗和后视镜加热配置                                    $    $           $    $  ANS001.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0004;
  $  010.RKE主驾单独解锁                                           $    $           $    $  ANS001.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  011.后备箱门配置                                              $    $           $    $  ANS001.BYTE004  $  if(((x&0x18)>>3)==0x00) y=@00b9;else if(((x&0x18)>>3)==0x01) y=@0028;else if(((x&0x18)>>3)==0x02) y=@000f;else y=@0004;
  $  012.P档解锁配置                                               $    $           $    $  ANS001.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0004;
  $  013.后视镜折叠有无配置                                        $    $           $    $  ANS001.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0004;
  $  014.PKE主驾单独解锁                                           $    $           $    $  ANS001.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0004;
  $  015.左后门配置                                                $    $           $    $  ANS001.BYTE005  $  if(((x&0xC0)>>6)==0x00) y=@00b9;else if(((x&0xC0)>>6)==0x01) y=@0028;else if(((x&0xC0)>>6)==0x02) y=@000f;else y=@0004;
  $  016.右后门配置                                                $    $           $    $  ANS001.BYTE005  $  if(((x&0x30)>>4)==0x00) y=@00b9;else if(((x&0x30)>>4)==0x01) y=@0028;else if(((x&0x30)>>4)==0x02) y=@000f;else y=@0004;
  $  017.慢充电子锁                                                $    $           $    $  ANS001.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@0136;else if(((x&0x04)>>2)==0x01) y=@00bb;else y=@0004;
  $  018.油箱盖解锁配置                                            $    $           $    $  ANS001.BYTE005  $  if((x&0x03)==0x00) y=@00b9;else if((x&0x03)==0x01) y=@0c5f;else if((x&0x03)==0x02) y=@0c60;else y=@0004;
  $  019.锁电机热保护时间                                          $    $  s        $    $  ANS001.BYTE006  $  y=x;
  $  020.自动重上锁计时时间                                        $    $  s        $    $  ANS001.BYTE007  $  y=x;
  $  021.后视镜折叠                                                $    $           $    $  ANS002.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  022.ECO(经济模式)/SPORT(运动模式)开关                         $    $           $    $  ANS002.BYTE006  $  if(((x&0x30)>>4)==0x00) y=@000f;else if(((x&0x30)>>4)==0x01) y=@0cf9;else if(((x&0x30)>>4)==0x02) y=@0295;else y=@0004;
  $  023.ACC(自适应巡航控制)巡航开关                               $    $           $    $  ANS002.BYTE006  $  if((x&0x0F)==0x01) y=@0c62;else if((x&0x0F)==0x02) y=@0c63;else if((x&0x0F)==0x03) y=@0c64;else if((x&0x0F)==0x04) y=@0c65;else if((x&0x0F)==0x05) y=@0c66;else if((x&0x0F)==0x06) y=@0c67;else if((x&0x0F)==0x07) y=@0c68;else y=@0004;
  $  024.M-档位                                                    $    $           $    $  ANS002.BYTE007  $  if(((x&0x30)>>4)==0x00) y=@0c69;else if(((x&0x30)>>4)==0x01) y=@0c69;else if(((x&0x30)>>4)==0x02) y=@0c69;else y=@0004;
  $  025.配RKE(遥控钥匙)数量                                       $    $           $    $  ANS003.BYTE004  $  if(((x&0xF0)>>4)==0x00) y=@04d4;else if(((x&0xF0)>>4)==0x01) y=@04d3;else if(((x&0xF0)>>4)==0x02) y=@0169;else if(((x&0xF0)>>4)==0x03) y=@016b;else if(((x&0xF0)>>4)==0x04) y=@0523;else y=@0004;
  $  026.负载管理模式设置                                          $    $           $    $  ANS003.BYTE004  $  if(((x&0x0C)>>2)==0x00) y=@00e5;else if(((x&0x0C)>>2)==0x01) y=@0524;else if(((x&0x0C)>>2)==0x02) y=@0525;else y=@0004;
  $  027.生产运行周期设置                                          $    $           $    $  ANS003.BYTE004  $  if((x&0x03)==0x00) y=@050b;else if((x&0x03)==0x01) y=@050c;else if((x&0x03)==0x02) y=@050d;else if((x&0x03)==0x03) y=@050e;else y=@0004;
  $  028.TCU(自动变速箱控制单元)                                   $    $           $    $  ANS003.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0004;
  $  029.PEPS(无钥匙系统)                                          $    $           $    $  ANS003.BYTE005  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0004;
  $  030.防盗系统                                                  $    $           $    $  ANS003.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  031.左舵或右舵设置                                            $    $           $    $  ANS003.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@0510;else if(((x&0x10)>>4)==0x01) y=@050f;else y=@0004;
  $  032.车辆类型设置                                              $    $           $    $  ANS003.BYTE005  $  y=(x&0x0F);
  $  033.ABS(防抱死制动系统)是否配置                               $    $           $    $  ANS003.BYTE006  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0004;
  $  034.ESP(电子稳定程序)                                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0004;
  $  035.IPK(仪表)                                                 $    $           $    $  ANS003.BYTE006  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  036.EMS(发动机管理系统)                                       $    $           $    $  ANS003.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0004;
  $  037.SAS(方向盘转向角传感器)是否配置                           $    $           $    $  ANS003.BYTE006  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0004;
  $  038.SRS(安全气囊)是否配置                                     $    $           $    $  ANS003.BYTE006  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0004;
  $  039.娱乐系统控制模块                                          $    $           $    $  ANS003.BYTE006  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0004;
  $  040.PLG(电动尾门)是否配置                                     $    $           $    $  ANS003.BYTE006  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0004;
  $  041.转向变道灯开关滤波时间                                    $    $           $    $  ANS003.BYTE007  $  if(((x&0xC0)>>6)==0x00) y=@0539;else if(((x&0xC0)>>6)==0x01) y=@053a;else if(((x&0xC0)>>6)==0x02) y=@053b;else if(((x&0xC0)>>6)==0x03) y=@0c83;else y=@0004;
  $  042.VCU(整车控制器)是否配置                                   $    $           $    $  ANS003.BYTE007  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  043.胎压监控是否配置                                          $    $           $    $  ANS003.BYTE007  $  if(((x&0x06)>>1)==0x00) y=@00b9;else if(((x&0x06)>>1)==0x01) y=@0cd7;else if(((x&0x06)>>1)==0x02) y=@0c6e;else if(((x&0x06)>>1)==0x03) y=@0c6f;else y=@0004;
  $  044.RFA(射频放大器)是否配置                                   $    $           $    $  ANS003.BYTE007  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0004;
  $  045.BCM(车身控制管理系统)电源                                 $    $  V        $    $  ANS004.BYTE004  $  y=x*0.1;
  $  046.行驶里程备份                                              $    $  km       $    $  ANS005.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  047.背光灯等级百分比                                          $    $  %        $    $  ANS006.BYTE004  $  y=x;
  $  048.当前IDE                                                   $    $           $    $  ANS007.BYTE004  $  HEX(X1,X2,X3,X4);
  $  049.当前学习RKE(遥控钥匙)数量                                 $    $           $    $  ANS008.BYTE004  $  y=x;
  $  050.疲劳驾驶参数选择                                          $    $           $    $  ANS009.BYTE004  $  y=x;
  $  051.疲劳驾驶性能调节                                          $    $           $    $  ANS009.BYTE005  $  y=(x1*256+x2);
  $  052.DDD（疲劳驾驶检测）配置                                   $    $           $    $  ANS009.BYTE007  $  if((x&0x01)==0x00) y=@0136;else if((x&0x01)==0x01) y=@00bb;else y=@0004;
  $  053.照我回家功能外灯延时设置                                  $    $           $    $  ANS010.BYTE004  $  if(((x&0xE0)>>5)==0x00) y=@000f;else if(((x&0xE0)>>5)==0x01) y=@0491;else if(((x&0xE0)>>5)==0x02) y=@0492;else if(((x&0xE0)>>5)==0x03) y=@0493;else y=@0004;
  $  054.自动解锁个性化菜单配置字                                  $    $           $    $  ANS010.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@0cb4;else if(((x&0x04)>>2)==0x01) y=@0c0a;else y=@0004;
  $  055.氛围灯使能默认配置                                        $    $           $    $  ANS010.BYTE004  $  if(((x&0x0C)>>2)==0x00) y=@00b9;else if(((x&0x0C)>>2)==0x01) y=@00ba;else y=@0004;
  $  056.RKE主驾单独解锁                                           $    $           $    $  ANS010.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  057.PKE主驾单独解锁                                           $    $           $    $  ANS010.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0004;
  $  058.车速闭锁默认配置                                          $    $           $    $  ANS010.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0004;
  $  059.闭锁反馈方式                                              $    $           $    $  ANS010.BYTE004  $  if(((x&0x18)>>3)==0x00) y=@000f;else if(((x&0x18)>>3)==0x01) y=@0506;else if(((x&0x18)>>3)==0x02) y=@0505;else if(((x&0x18)>>3)==0x03) y=@0504;else y=@0004;
  $  060.后视镜折叠有无配置                                        $    $           $    $  ANS010.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0004;
  $  061.碰撞信号百分比                                            $    $  %        $    $  ANS011.BYTE004  $  y=x;
  $  062.左转向灯故障信号百分比                                    $    $  %        $    $  ANS011.BYTE005  $  y=x;
  $  063.右转向灯故障信号百分比                                    $    $  %        $    $  ANS011.BYTE006  $  y=x;
  $  064.ECU PIN(在IMMO锁止之前)                                   $    $           $    $  ANS012.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  065.右远光灯输出(双光源)                                      $    $           $    $  ANS013.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0004;
  $  066.左远光灯输出(双光源)                                      $    $           $    $  ANS013.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  067.右近光灯输出(灯泡)                                        $    $           $    $  ANS013.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0004;
  $  068.左近光灯输出(灯泡)                                        $    $           $    $  ANS013.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  069.右转向灯输出                                              $    $           $    $  ANS013.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0004;
  $  070.左转向灯输出                                              $    $           $    $  ANS013.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  071.调光电机                                                  $    $           $    $  ANS013.BYTE005  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0004;
  $  072.位置灯输出                                                $    $           $    $  ANS013.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  073.倒挡信号硬线输出                                          $    $           $    $  ANS014.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0004;
  $  074.右日行灯输出                                              $    $           $    $  ANS014.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0004;
  $  075.左日行灯输出                                              $    $           $    $  ANS014.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  076.后雾灯输出                                                $    $           $    $  ANS014.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  077.照地灯                                                    $    $           $    $  ANS014.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0004;
  $  078.倒车灯输出                                                $    $           $    $  ANS014.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  079.高位制动灯                                                $    $           $    $  ANS014.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  080.刹车灯输出A                                               $    $           $    $  ANS014.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  081.发动机运行状态                                            $    $           $    $  ANS015.BYTE004  $  if(x==0x00) y=@018e;else if(x==0x01) y=@0c2c;else y=@0103;
  $  082.远光灯开关输入                                            $    $           $    $  ANS016.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0004;
  $  083.远光灯开关                                                $    $           $    $  ANS016.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  084.位置灯开关输入                                            $    $           $    $  ANS016.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  085.自动灯开关                                                $    $           $    $  ANS016.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  086.近光灯开关                                                $    $           $    $  ANS016.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  087.危险报警灯开关                                            $    $           $    $  ANS016.BYTE005  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0004;
  $  088.左转向灯开关                                              $    $           $    $  ANS016.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0004;
  $  089.右转向灯开关                                              $    $           $    $  ANS016.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  090.后雾灯开关                                                $    $           $    $  ANS016.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  091.前雾灯开关输入                                            $    $           $    $  ANS016.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  092.喇叭开关                                                  $    $           $    $  ANS016.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  093.倒车灯开关                                                $    $           $    $  ANS016.BYTE006  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  094.刹车灯开关输入                                            $    $           $    $  ANS016.BYTE006  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  095.RLS(雨量光照传感器)点亮近光灯请求                         $    $           $    $  ANS016.BYTE008  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  096.RLS(雨量光照传感器)点亮位置灯请求                         $    $           $    $  ANS016.BYTE008  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  097.前内顶灯关闭开关                                          $    $           $    $  ANS016.BYTE009  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  098.前内顶灯打开开关                                          $    $           $    $  ANS016.BYTE009  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  099.前内顶灯自动开关                                          $    $           $    $  ANS016.BYTE009  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  100.背光灯调节-开关                                           $    $           $    $  ANS016.BYTE010  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  101.AEB指示灯开关                                             $    $           $    $  ANS016.BYTE010  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  102.自动灯光阈值                                              $    $  V        $    $  ANS016.BYTE007  $  y=x*0.05;
  $  103.全局里程信息                                              $    $  km       $    $  ANS017.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  104.IMMO锁定状态                                              $    $           $    $  ANS018.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0052;else if(((x&0x80)>>7)==0x01) y=@0055;else y=@0004;
  $  105.PIN写入状态                                               $    $           $    $  ANS018.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@02ac;else if(((x&0x40)>>6)==0x01) y=@00ca;else y=@0004;
  $  106.SK写入状态                                                $    $           $    $  ANS018.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@02ac;else if(((x&0x20)>>5)==0x01) y=@00ca;else y=@0004;
  $  107.VIN写入状态                                               $    $           $    $  ANS018.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@02ac;else if(((x&0x10)>>4)==0x01) y=@00ca;else y=@0004;
  $  108.IMMO钥匙学习数量                                          $    $           $    $  ANS018.BYTE004  $  y=(x&0x0F);
  $  109.SK2锁状态                                                 $    $           $    $  ANS019.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0052;else if(((x&0x80)>>7)==0x01) y=@0055;else y=@0004;
  $  110.SK2写入状态                                               $    $           $    $  ANS019.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@02ac;else if(((x&0x40)>>6)==0x01) y=@00ca;else y=@0004;
  $  111.氛围灯                                                    $    $           $    $  ANS020.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0004;
  $  112.背光输出                                                  $    $           $    $  ANS020.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  113.后备箱灯输出                                              $    $           $    $  ANS020.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0004;
  $  114.内灯输出B                                                 $    $           $    $  ANS020.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  115.节电输出                                                  $    $           $    $  ANS020.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  116.喇叭输出                                                  $    $           $    $  ANS020.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  117.设防指示灯                                                $    $           $    $  ANS020.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  118.中控锁指示灯                                              $    $           $    $  ANS020.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  119.全局KL50状态                                              $    $           $    $  ANS021.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0004;
  $  120.全局发动机运行状态                                        $    $           $    $  ANS021.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0004;
  $  121.全局KL15状态                                              $    $           $    $  ANS021.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0004;
  $  122.全局ACC/KLR状态                                           $    $           $    $  ANS021.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  123.KL50状态                                                  $    $           $    $  ANS021.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0004;
  $  124.发动机运行状态                                            $    $           $    $  ANS021.BYTE004  $  if(x==0x00) y=@018e;else if(x==0x01) y=@0c2c;else y=@0103;
  $  125.KL15状态                                                  $    $           $    $  ANS021.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  126.ACC/KLR状态                                               $    $           $    $  ANS021.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  127.KL15                                                      $    $           $    $  ANS022.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  128.点火打开                                                  $    $           $    $  ANS022.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  129.启动停止开关有效性                                        $    $           $    $  ANS022.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@04dc;else if(((x&0x20)>>5)==0x01) y=@00b3;else y=@0004;
  $  130.启停开关                                                  $    $           $    $  ANS022.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  131.点火开关有效性                                            $    $           $    $  ANS022.BYTE005  $  if(((x&0x08)>>3)==0x00) y=@04dc;else if(((x&0x08)>>3)==0x01) y=@00b3;else y=@0004;
  $  132.点火开关                                                  $    $           $    $  ANS022.BYTE005  $  if((x&0x07)==0x00) y=@0c32;else if((x&0x07)==0x01) y=@0cc9;else if((x&0x07)==0x02) y=@0666;else if((x&0x07)==0x03) y=@009e;else y=@0004;
  $  133.PEPS(无钥匙控制无钥匙启动系统)启停开关信号有效位          $    $           $    $  ANS022.BYTE006  $  if(((x&0x20)>>5)==0x00) y=@00bb;else if(((x&0x20)>>5)==0x01) y=@0136;else y=@0004;
  $  134.PEPS(无钥匙控制无钥匙启动系统)启停开关信号                $    $           $    $  ANS022.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  135.PEPS(无钥匙控制无钥匙启动系统)钥匙状态信号有效位          $    $           $    $  ANS022.BYTE006  $  if(((x&0x08)>>3)==0x00) y=@00bb;else if(((x&0x08)>>3)==0x01) y=@0136;else y=@0004;
  $  136.PEPS(无钥匙控制无钥匙启动系统)钥匙状态                    $    $           $    $  ANS022.BYTE006  $  if((x&0x07)==0x00) y=@000f;else if((x&0x07)==0x01) y=@0463;else if((x&0x07)==0x02) y=@0666;else if((x&0x07)==0x03) y=@009e;else if((x&0x07)==0x07) y=@0136;else y=@0004;
  $  137.主驾门解锁                                                $    $           $    $  ANS023.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  138.中控闭锁                                                  $    $           $    $  ANS023.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  139.中控解锁                                                  $    $           $    $  ANS023.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  140.充电枪解锁                                                $    $           $    $  ANS023.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  141.油箱盖解锁                                                $    $           $    $  ANS023.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  142.尾门解锁                                                  $    $           $    $  ANS023.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  143.前舱盖配置                                                $    $           $    $  ANS024.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0004;
  $  144.前雾灯配置                                                $    $           $    $  ANS024.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0004;
  $  145.位置灯超时强制熄灭配置                                    $    $           $    $  ANS024.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  146.后备箱灯配置                                              $    $           $    $  ANS024.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0004;
  $  147.大灯配置                                                  $    $           $    $  ANS024.BYTE004  $  if(((x&0x0C)>>2)==0x00) y=@04fa;else if(((x&0x0C)>>2)==0x01) y=@04f9;else if(((x&0x0C)>>2)==0x02) y=@0c36;else y=@0004;
  $  148.位置灯熄灭配置                                            $    $           $    $  ANS024.BYTE004  $  if((x&0x01)==0x00) y=@0c38;else if((x&0x01)==0x01) y=@0c39;else y=@0004;
  $  149.前雾灯辅助照明配置                                        $    $           $    $  ANS024.BYTE005  $  if(((x&0xC0)>>6)==0x00) y=@00b9;else if(((x&0xC0)>>6)==0x01) y=@0c4a;else if(((x&0xC0)>>6)==0x02) y=@0c4b;else y=@0004;
  $  150.日行灯熄灭配置1                                           $    $           $    $  ANS024.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@0c4c;else y=@0004;
  $  151.背光灯默认亮度                                            $    $           $    $  ANS024.BYTE005  $  if(((x&0x18)>>3)==0x00) y=@000f;else if(((x&0x18)>>3)==0x01) y=@0c4d;else if(((x&0x18)>>3)==0x02) y=@0cc8;else if(((x&0x18)>>3)==0x03) y=@0c4f;else y=@0004;
  $  152.氛围灯点亮时间                                            $    $           $    $  ANS024.BYTE005  $  if(((x&0x06)>>1)==0x00) y=@000f;else if(((x&0x06)>>1)==0x01) y=@04fd;else if(((x&0x06)>>1)==0x02) y=@0502;else if(((x&0x06)>>1)==0x03) y=@0503;else y=@0004;
  $  153.日行灯配置                                                $    $           $    $  ANS024.BYTE005  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0004;
  $  154.转向灯类型配置字                                          $    $           $    $  ANS024.BYTE006  $  if(((x&0xC0)>>6)==0x00) y=@0c51;else if(((x&0xC0)>>6)==0x01) y=@04fe;else if(((x&0xC0)>>6)==0x02) y=@0c53;else if(((x&0xC0)>>6)==0x03) y=@0c54;else y=@0004;
  $  155.自动灯光判断配置                                          $    $           $    $  ANS024.BYTE006  $  if(((x&0x30)>>4)==0x00) y=@00b9;else if(((x&0x30)>>4)==0x01) y=@0c56;else if(((x&0x30)>>4)==0x02) y=@0c57;else if(((x&0x30)>>4)==0x03) y=@0004;else y=@0004;
  $  156.照地灯配置                                                $    $           $    $  ANS024.BYTE006  $  if(((x&0x0C)>>2)==0x00) y=@00b9;else if(((x&0x0C)>>2)==0x01) y=@0491;else y=@0004;
  $  157.大灯迎宾灯功能配置                                        $    $           $    $  ANS024.BYTE006  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0004;
  $  158.前雾灯倒车灯配置                                          $    $           $    $  ANS024.BYTE006  $  if((x&0x01)==0x00) y=@0cce;else if((x&0x01)==0x01) y=@0ccf;else y=@0004;
  $  159.刹车灯点亮百分比                                          $    $  %        $    $  ANS024.BYTE011  $  y=((x&0xF0)>>4);
  $  160.刹车灯熄灭百分比                                          $    $  %        $    $  ANS024.BYTE011  $  y=(x&0x0F);
  $  161.闭锁源记录 1                                              $    $           $    $  ANS025.BYTE004  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0cd1;else if(x==0x03) y=@0cd2;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  162.闭锁源记录 2                                              $    $           $    $  ANS025.BYTE005  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  163.闭锁源记录 3                                              $    $           $    $  ANS025.BYTE006  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  164.闭锁源记录 4                                              $    $           $    $  ANS025.BYTE007  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  165.闭锁源记录 5                                              $    $           $    $  ANS025.BYTE008  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  166.闭锁源记录 6                                              $    $           $    $  ANS025.BYTE009  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  167.闭锁源记录 7                                              $    $           $    $  ANS025.BYTE010  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  168.闭锁源记录 8                                              $    $           $    $  ANS025.BYTE011  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  169.闭锁源记录 9                                              $    $           $    $  ANS025.BYTE012  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  170.闭锁源记录 10                                             $    $           $    $  ANS025.BYTE013  $  if(x==0x01) y=@0cd0;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0cd3;else y=@0004;
  $  171.中控锁解锁开关输入                                        $    $           $    $  ANS026.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  172.中控锁闭锁开关输入                                        $    $           $    $  ANS026.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  173.油箱盖解锁开关                                            $    $           $    $  ANS026.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@0c42;else if(((x&0x04)>>2)==0x01) y=@0c43;else y=@0004;
  $  174.PEPS(无钥匙控制无钥匙启动系统)尾门解锁开关信号            $    $           $    $  ANS026.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@0c42;else if(((x&0x02)>>1)==0x01) y=@0c43;else y=@0004;
  $  175.尾门解锁开关                                              $    $           $    $  ANS026.BYTE005  $  if((x&0x01)==0x00) y=@0c42;else if((x&0x01)==0x01) y=@0c43;else y=@0004;
  $  176.副驾锁反馈                                                $    $           $    $  ANS026.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@0c42;else if(((x&0x10)>>4)==0x01) y=@0c43;else y=@0004;
  $  177.主驾门锁反馈                                              $    $           $    $  ANS026.BYTE006  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  178.右后门开关                                                $    $           $    $  ANS026.BYTE007  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0004;
  $  179.左后门开关状态输入                                        $    $           $    $  ANS026.BYTE007  $  if(((x&0x10)>>4)==0x00) y=@0c42;else if(((x&0x10)>>4)==0x01) y=@0c43;else y=@0004;
  $  180.乘客门开开                                                $    $           $    $  ANS026.BYTE007  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  181.驾驶门开关                                                $    $           $    $  ANS026.BYTE007  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  182.车盖半开                                                  $    $           $    $  ANS026.BYTE008  $  if(((x&0x04)>>2)==0x00) y=@0c42;else if(((x&0x04)>>2)==0x01) y=@0c43;else y=@0004;
  $  183.后背门开关                                                $    $           $    $  ANS026.BYTE008  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  184.照我回家功能外灯延时设置                                  $    $           $    $  ANS027.BYTE004  $  if(((x&0xE0)>>5)==0x00) y=@000f;else if(((x&0xE0)>>5)==0x01) y=@0491;else if(((x&0xE0)>>5)==0x02) y=@0492;else if(((x&0xE0)>>5)==0x03) y=@0493;else y=@0004;
  $  185.闭锁反馈方式                                              $    $           $    $  ANS027.BYTE004  $  if(((x&0x18)>>3)==0x00) y=@000f;else if(((x&0x18)>>3)==0x01) y=@0506;else if(((x&0x18)>>3)==0x02) y=@0505;else if(((x&0x18)>>3)==0x03) y=@0504;else y=@0004;
  $  186.寻车功能持续时间设置                                      $    $           $    $  ANS027.BYTE004  $  if((x&0x03)==0x00) y=@000f;else if((x&0x03)==0x01) y=@0491;else if((x&0x03)==0x02) y=@0492;else if((x&0x03)==0x03) y=@0493;else y=@0004;
  $  187.寻车功能反馈方式设置                                      $    $           $    $  ANS027.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@0506;else if(((x&0x80)>>7)==0x01) y=@0505;else y=@0004;
  $  188.解锁反馈方式设置                                          $    $           $    $  ANS027.BYTE005  $  if(((x&0x60)>>5)==0x00) y=@000f;else if(((x&0x60)>>5)==0x01) y=@0506;else y=@0004;
  $  189.熄火解锁触发方式                                          $    $           $    $  ANS027.BYTE005  $  if(((x&0x18)>>3)==0x00) y=@0c6a;else if(((x&0x18)>>3)==0x01) y=@0495;else if(((x&0x18)>>3)==0x02) y=@0cb4;else y=@0004;
  $  190.自动解锁个性化菜单配置字                                  $    $           $    $  ANS027.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@0cb4;else if(((x&0x04)>>2)==0x01) y=@0c0a;else y=@0004;
  $  191.遥控关天窗配置                                            $    $           $    $  ANS027.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0004;
  $  192.遥控开天窗配置                                            $    $           $    $  ANS027.BYTE005  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0004;
  $  193.PLG(电动尾门)信号发送时间配置                             $    $  ms       $    $  ANS027.BYTE006  $  y=x*10;
  $  194.智能巡航开关                                              $    $           $    $  ANS027.BYTE007  $  if(((x&0x80)>>7)==0x00) y=@0136;else if(((x&0x80)>>7)==0x01) y=@00bb;else y=@0004;
  $  195.巡航开关                                                  $    $           $    $  ANS027.BYTE007  $  if(((x&0x40)>>6)==0x00) y=@0136;else if(((x&0x40)>>6)==0x01) y=@00bb;else y=@0004;
  $  196.遥控升窗配置                                              $    $           $    $  ANS027.BYTE007  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  197.遥控降窗配置                                              $    $           $    $  ANS027.BYTE007  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0004;
  $  198.ECO(经济模式)/SPORT(运动模式)配置                         $    $           $    $  ANS027.BYTE007  $  if(((x&0x0C)>>2)==0x00) y=@0c5e;else if(((x&0x0C)>>2)==0x01) y=@0cb5;else if(((x&0x0C)>>2)==0x02) y=@0cb6;else y=@0004;
  $  199.换挡器配置                                                $    $           $    $  ANS027.BYTE007  $  if((x&0x03)==0x00) y=@0cda;else if((x&0x03)==0x01) y=@0cb8;else if((x&0x03)==0x02) y=@0c5e;else y=@0004;
  $  200.保养里程备份                                              $    $  km       $    $  ANS028.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  201.SK2锁定状态                                               $    $           $    $  ANS029.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0052;else if(((x&0x80)>>7)==0x01) y=@0055;else y=@0004;
  $  202.SK2写入状态                                               $    $           $    $  ANS029.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@02ac;else if(((x&0x40)>>6)==0x01) y=@00ca;else y=@0004;
  $  203.软件版本日期                                              $    $           $    $  ANS030.BYTE004  $  HEX(X1,X2,X3,X4);
  $  204.TBOX(远程监控模块)请求需认证配置                          $    $           $    $  ANS031.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0004;
  $  205.TBOX算法配置                                              $    $           $    $  ANS031.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@0c02;else if(((x&0x40)>>6)==0x01) y=@0c03;else y=@0004;
  $  206.TBOX(远程监控模块)控制窗功能配置                          $    $           $    $  ANS031.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0004;
  $  207.TBOX(远程监控模块)远程启动功能配置                        $    $           $    $  ANS031.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0004;
  $  208.TBOX(远程监控模块)远程钥匙管理功能配置                    $    $           $    $  ANS031.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0004;
  $  209.TBOX(远程监控模块)远程寻车功能配置                        $    $           $    $  ANS031.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0004;
  $  210.TBOX(远程监控模块)远程解闭锁控制功能配置                  $    $           $    $  ANS031.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0004;
  $  211.TBOX(远程监控模块)功能配置字                              $    $           $    $  ANS031.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0004;
  $  212.BCM(车身控制管理系统)允许重复发送认证的最大次数设置       $    $           $    $  ANS031.BYTE005  $  if(((x&0xC0)>>6)==0x00) y=@09e1;else if(((x&0xC0)>>6)==0x01) y=@052a;else if(((x&0xC0)>>6)==0x02) y=@052b;else if(((x&0xC0)>>6)==0x03) y=@0c04;else y=@0004;
  $  213.BCM(车身控制管理系统)允许认证失败次数                     $    $           $    $  ANS031.BYTE005  $  if(((x&0x30)>>4)==0x00) y=@09e1;else if(((x&0x30)>>4)==0x01) y=@052a;else if(((x&0x30)>>4)==0x02) y=@052b;else if(((x&0x30)>>4)==0x03) y=@0c04;else y=@0004;
  $  214.等待TBOX(远程监控模块)响应最长时间                        $    $  s        $    $  ANS031.BYTE005  $  y=(x&0x0F);
  $  215.温度补偿误差阈值                                          $    $  kPa      $    $  ANS032.BYTE004  $  y=x;
  $  216.胎压地区配置字                                            $    $           $    $  ANS032.BYTE005  $  if((x&0x03)==0x00) y=@0cdb;else if((x&0x03)==0x01) y=@0c88;else if((x&0x03)==0x02) y=@0c89;else y=@0004;
  $  217.高压报警使能配置字                                        $    $           $    $  ANS032.BYTE006  $  if(((x&0x80)>>7)==0x00) y=@00f1;else if(((x&0x80)>>7)==0x01) y=@00f0;else y=@0004;
  $  218.高压报警阈值配置                                          $    $  %        $    $  ANS032.BYTE006  $  y=(x&0x7F);
  $  219.前轮标准冷态胎压值配置                                    $    $  kPa      $    $  ANS032.BYTE007  $  y=x*2.75;
  $  220.后轮标准冷态胎压值配置                                    $    $  kPa      $    $  ANS032.BYTE008  $  y=x*2.75;
  $  221.变速箱档位信号                                            $    $           $    $  ANS033.BYTE004  $  if((x&0x0F)==0x00) y=@0262;else if((x&0x0F)==0x01) y=@04d3;else if((x&0x0F)==0x02) y=@0169;else if((x&0x0F)==0x03) y=@016a;else if((x&0x0F)==0x04) y=@016b;else if((x&0x0F)==0x05) y=@054a;else if((x&0x0F)==0x06) y=@054b;else if((x&0x0F)==0x07) y=@0103;else if((x&0x0F)==0x08) y=@0103;else if((x&0x0F)==0x09) y=@0103;else if((x&0x0F)==0x0A) y=@0103;else if((x&0x0F)==0x0B) y=@0263;else if((x&0x0F)==0x0C) y=@0103;else if((x&0x0F)==0x0D) y=@0187;else if((x&0x0F)==0x0E) y=@0103;else if((x&0x0F)==0x0F) y=@042f;else y=@0004;
  $  222.解锁源记录 1                                              $    $           $    $  ANS034.BYTE004  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0cdd;else if(x==0x03) y=@0cde;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  223.解锁源记录 2                                              $    $           $    $  ANS034.BYTE005  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  224.解锁源记录 3                                              $    $           $    $  ANS034.BYTE006  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  225.解锁源记录 4                                              $    $           $    $  ANS034.BYTE007  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  226.解锁源记录 5                                              $    $           $    $  ANS034.BYTE008  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  227.解锁源记录 6                                              $    $           $    $  ANS034.BYTE009  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  228.解锁源记录 7                                              $    $           $    $  ANS034.BYTE010  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  229.解锁源记录 8                                              $    $           $    $  ANS034.BYTE011  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  230.解锁源记录 9                                              $    $           $    $  ANS034.BYTE012  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  231.解锁源记录 10                                             $    $           $    $  ANS034.BYTE013  $  if(x==0x01) y=@0cdc;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0004;
  $  232.车速                                                      $    $  km/h     $    $  ANS035.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  233.车速状态                                                  $    $           $    $  ANS035.BYTE006  $  if(x==0x00) y=@00bb;else if(x==0x01) y=@0136;else y=@0103;
  $  234.后喷水电机输出                                            $    $           $    $  ANS036.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  235.后雨刮低速输出                                            $    $           $    $  ANS036.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  236.前喷水电机输出                                            $    $           $    $  ANS036.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  237.前雨刮高速输出                                            $    $           $    $  ANS036.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  238.前雨刮低速输出                                            $    $           $    $  ANS036.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  239.唤醒源记录 1                                              $    $           $    $  ANS037.BYTE004  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  240.唤醒源记录 2                                              $    $           $    $  ANS037.BYTE005  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  241.唤醒源记录 3                                              $    $           $    $  ANS037.BYTE006  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  242.唤醒源记录 4                                              $    $           $    $  ANS037.BYTE007  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  243.唤醒源记录 5                                              $    $           $    $  ANS037.BYTE008  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  244.唤醒源记录 6                                              $    $           $    $  ANS037.BYTE009  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  245.唤醒源记录 7                                              $    $           $    $  ANS037.BYTE010  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  246.唤醒源记录 8                                              $    $           $    $  ANS037.BYTE011  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  247.唤醒源记录 9                                              $    $           $    $  ANS037.BYTE012  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  248.唤醒源记录 10                                             $    $           $    $  ANS037.BYTE013  $  if(x==0x01) y=@0cfa;else if(x==0x02) y=@0c12;else if(x==0x03) y=@0cfb;else if(x==0x04) y=@0c14;else if(x==0x05) y=@0cfc;else if(x==0x06) y=@0c16;else if(x==0x07) y=@0cfd;else if(x==0x08) y=@0cfe;else if(x==0x09) y=@0a27;else if(x==0x0A) y=@0cff;else if(x==0x0B) y=@0c1a;else if(x==0x0C) y=@0c1b;else if(x==0x0D) y=@0004;else if(x==0x0E) y=@0004;else if(x==0x0F) y=@0004;else if(x==0x10) y=@0c1c;else if(x==0x11) y=@0c1d;else if(x==0x12) y=@0c1e;else if(x==0x13) y=@0c1f;else if(x==0xFF)y=@0c20;else y=@0004;
  $  249.前雨刮自动配置                                            $    $           $    $  ANS038.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0004;
  $  250.后雨刮配置                                                $    $           $    $  ANS038.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0004;
  $  251.背光灯是否可调节                                          $    $           $    $  ANS038.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0004;
  $  252.前洗涤与前雨刮联动输出间隔设置                            $    $  ms       $    $  ANS038.BYTE005  $  y=x*100;
  $  253.雨刮堵转判断时间设置                                      $    $  s        $    $  ANS038.BYTE006  $  y=x;
  $  254.后洗涤与后雨刮联动输出间隔设置                            $    $  ms       $    $  ANS038.BYTE007  $  y=x*100;
  $  255.前雨刮归位信号输入                                        $    $           $    $  ANS039.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  256.前洗涤开关输入                                            $    $           $    $  ANS039.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0004;
  $  257.前雨刮点动开关                                            $    $           $    $  ANS039.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0004;
  $  258.前雨刮高速开关                                            $    $           $    $  ANS039.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0004;
  $  259.前雨刮低速开关                                            $    $           $    $  ANS039.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  260.前雨刮灵敏度(间歇档位)                                    $    $           $    $  ANS039.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  261.前雨刮间歇/自动开关                                       $    $           $    $  ANS039.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  262.后雨刮归位信号                                            $    $           $    $  ANS039.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  263.后洗涤开关                                                $    $           $    $  ANS039.BYTE006  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0004;
  $  264.后雨刮低速开关                                            $    $           $    $  ANS039.BYTE006  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;
  $  265.自动雨刮高速请求                                          $    $           $    $  ANS039.BYTE008  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0004;
  $  266.自动雨刮低速请求                                          $    $           $    $  ANS039.BYTE008  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0004;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:706 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
