
    车型ID：10af

    模拟：协议模拟-->10af

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:701 02 10 01 00 00 00 00 00       $~  ANS000:781 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:701 02 3E 80 00 00 00 00 00       $!  ANS000:781 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:701 03 19 02 09 00 00 00 00       $#  ANS000:781 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/ac000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:701 04 14 FF FF FF 00 00 00       $$  ANS000:781 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:701 03 22 F1 A0 00 00 00 00       $%  ANS000:781 03 22 F1 A0 00 00 00 00
  $%  REQ001:701 03 22 F1 83 00 00 00 00       $%  ANS001:781 03 22 F1 83 00 00 00 00
  $%  REQ002:701 03 22 F1 91 00 00 00 00       $%  ANS002:781 03 22 F1 91 00 00 00 00
  $%  REQ003:701 03 22 F1 A2 00 00 00 00       $%  ANS003:781 03 22 F1 A2 00 00 00 00
  $%  REQ004:701 03 22 F1 87 00 00 00 00       $%  ANS004:781 03 22 F1 87 00 00 00 00
  $%  REQ005:701 03 22 F1 10 00 00 00 00       $%  ANS005:781 03 22 F1 10 00 00 00 00
  $%  REQ006:701 03 22 F1 92 00 00 00 00       $%  ANS006:781 03 22 F1 92 00 00 00 00
  $%  REQ007:701 03 22 F1 8C 00 00 00 00       $%  ANS007:781 03 22 F1 8C 00 00 00 00
  $%  REQ008:701 03 22 F1 94 00 00 00 00       $%  ANS008:781 03 22 F1 94 00 00 00 00
  $%  REQ009:701 03 22 F1 8A 00 00 00 00       $%  ANS009:781 03 22 F1 8A 00 00 00 00
  $%  REQ010:701 03 22 F1 90 00 00 00 00       $%  ANS010:781 03 22 F1 90 00 00 00 00
  $%  REQ011:701 03 22 F1 A8 00 00 00 00       $%  ANS011:781 03 22 F1 A8 00 00 00 00
  $%  REQ012:701 03 22 F1 8B 00 00 00 00       $%  ANS012:781 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元网络参考号:              $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号(上次):            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  006:测试参考号（上次）:              $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  007:里程读数（上次）KM:              $%    $%  ANS005.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  008:供应商电控单元硬件参考号:        $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  009:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  011:系统供应商识别号:                $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:VIN:                             $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  013:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  014:电控单元制造日期:                $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3);
  $%  015:电控单元制造日期 1:              $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:701 03 22 C1 04 00 00 00 00       $  ANS000:781 03 22 C1 04 00 00 00 00
  $  REQ001:701 03 22 C1 01 00 00 00 00       $  ANS001:781 03 22 C1 01 00 00 00 00
  $  REQ002:701 03 22 B5 10 00 00 00 00       $  ANS002:781 03 22 B5 10 00 00 00 00
  $  REQ003:701 03 22 E0 1B 00 00 00 00       $  ANS003:781 03 22 E0 1B 00 00 00 00
  $  REQ004:701 03 22 E0 1C 00 00 00 00       $  ANS004:781 03 22 E0 1C 00 00 00 00
  $  REQ005:701 03 22 E0 11 00 00 00 00       $  ANS005:781 03 22 E0 11 00 00 00 00
  $  REQ006:701 03 22 E0 06 00 00 00 00       $  ANS006:781 03 22 E0 06 00 00 00 00
  $  REQ007:701 03 22 E0 03 00 00 00 00       $  ANS007:781 03 22 E0 03 00 00 00 00
  $  REQ008:701 03 22 E0 0C 00 00 00 00       $  ANS008:781 03 22 E0 0C 00 00 00 00
  $  REQ009:701 03 22 D3 02 00 00 00 00       $  ANS009:781 03 22 D3 02 00 00 00 00
  $  REQ010:701 03 22 C0 02 00 00 00 00       $  ANS010:781 03 22 C0 02 00 00 00 00
  $  REQ011:701 03 22 E0 1A 00 00 00 00       $  ANS011:781 03 22 E0 1A 00 00 00 00
  $  REQ012:701 03 22 C1 06 00 00 00 00       $  ANS012:781 03 22 C1 06 00 00 00 00
  $  REQ013:701 03 22 D1 01 00 00 00 00       $  ANS013:781 03 22 D1 01 00 00 00 00
  $  REQ014:701 03 22 D1 02 00 00 00 00       $  ANS014:781 03 22 D1 02 00 00 00 00
  $  REQ015:701 03 22 D1 03 00 00 00 00       $  ANS015:781 03 22 D1 03 00 00 00 00
  $  REQ016:701 03 22 D1 04 00 00 00 00       $  ANS016:781 03 22 D1 04 00 00 00 00
  $  REQ017:701 03 22 D1 05 00 00 00 00       $  ANS017:781 03 22 D1 05 00 00 00 00
  $  REQ018:701 03 22 D1 06 00 00 00 00       $  ANS018:781 03 22 D1 06 00 00 00 00
  $  REQ019:701 03 22 D1 16 00 00 00 00       $  ANS019:781 03 22 D1 16 00 00 00 00
  $  REQ020:701 03 22 D1 17 00 00 00 00       $  ANS020:781 03 22 D1 17 00 00 00 00
  $  REQ021:701 03 22 E0 1E 00 00 00 00       $  ANS021:781 03 22 E0 1E 00 00 00 00
  $  REQ022:701 03 22 E0 08 00 00 00 00       $  ANS022:781 03 22 E0 08 00 00 00 00
  $  REQ023:701 03 22 CF 10 00 00 00 00       $  ANS023:781 03 22 CF 10 00 00 00 00
  $  REQ024:701 03 22 E0 18 00 00 00 00       $  ANS024:781 03 22 E0 18 00 00 00 00
  $  REQ025:701 03 22 E0 02 00 00 00 00       $  ANS025:781 03 22 E0 02 00 00 00 00
  $  REQ026:701 03 22 E0 0B 00 00 00 00       $  ANS026:781 03 22 E0 0B 00 00 00 00
  $  REQ027:701 03 22 E0 07 00 00 00 00       $  ANS027:781 03 22 E0 07 00 00 00 00
  $  REQ028:701 03 22 E0 05 00 00 00 00       $  ANS028:781 03 22 E0 05 00 00 00 00
  $  REQ029:701 03 22 D3 01 00 00 00 00       $  ANS029:781 03 22 D3 01 00 00 00 00
  $  REQ030:701 03 22 E0 0A 00 00 00 00       $  ANS030:781 03 22 E0 0A 00 00 00 00
  $  REQ031:701 03 22 E0 1F 00 00 00 00       $  ANS031:781 03 22 E0 1F 00 00 00 00
  $  REQ032:701 03 22 E0 09 00 00 00 00       $  ANS032:781 03 22 E0 09 00 00 00 00
  $  REQ033:701 03 22 E0 1D 00 00 00 00       $  ANS033:781 03 22 E0 1D 00 00 00 00
  $  REQ034:701 03 22 C1 08 00 00 00 00       $  ANS034:781 03 22 C1 08 00 00 00 00
  $  REQ035:701 03 22 E3 58 00 00 00 00       $  ANS035:781 03 22 E3 58 00 00 00 00
  $  REQ036:701 03 22 C1 02 00 00 00 00       $  ANS036:781 03 22 C1 02 00 00 00 00
  $  REQ037:701 03 22 62 05 00 00 00 00       $  ANS037:781 03 22 62 05 00 00 00 00
  $  REQ038:701 03 22 C1 05 00 00 00 00       $  ANS038:781 03 22 C1 05 00 00 00 00
  $  REQ039:701 03 22 D3 04 00 00 00 00       $  ANS039:781 03 22 D3 04 00 00 00 00
  $  REQ040:701 03 22 E0 0E 00 00 00 00       $  ANS040:781 03 22 E0 0E 00 00 00 00
  $  REQ041:701 03 22 E0 10 00 00 00 00       $  ANS041:781 03 22 E0 10 00 00 00 00
  $  REQ042:701 03 22 E0 15 00 00 00 00       $  ANS042:781 03 22 E0 15 00 00 00 00
  $  REQ043:701 03 22 E0 16 00 00 00 00       $  ANS043:781 03 22 E0 16 00 00 00 00
  $  REQ044:701 03 22 D3 03 00 00 00 00       $  ANS044:781 03 22 D3 03 00 00 00 00
  $  REQ045:701 03 22 E0 19 00 00 00 00       $  ANS045:781 03 22 E0 19 00 00 00 00
  $  REQ046:701 03 22 D1 31 00 00 00 00       $  ANS046:781 03 22 D1 31 00 00 00 00
  $  REQ047:701 03 22 E2 11 00 00 00 00       $  ANS047:781 03 22 E2 11 00 00 00 00
  $  REQ048:701 03 22 E0 04 00 00 00 00       $  ANS048:781 03 22 E0 04 00 00 00 00
  $  REQ049:701 03 22 C1 07 00 00 00 00       $  ANS049:781 03 22 C1 07 00 00 00 00
  $  REQ050:701 03 22 E0 0D 00 00 00 00       $  ANS050:781 03 22 E0 0D 00 00 00 00
  $  REQ051:701 03 22 62 06 00 00 00 00       $  ANS051:781 03 22 62 06 00 00 00 00
  $  REQ052:701 03 22 E0 17 00 00 00 00       $  ANS052:781 03 22 E0 17 00 00 00 00
  $  REQ053:701 03 22 62 04 00 00 00 00       $  ANS053:781 03 22 62 04 00 00 00 00
  $  REQ054:701 03 22 C1 03 00 00 00 00       $  ANS054:781 03 22 C1 03 00 00 00 00

  $  000.车速自动闭锁                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  001.后风窗和后视镜加热配置               $    $           $    $  ANS000.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  002.RKE主驾单独解锁                      $    $           $    $  ANS000.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  003.PKE主驾单独解锁                      $    $           $    $  ANS000.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  004.后备箱门配置                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0035;
  $  005.P档解锁配置                          $    $           $    $  ANS000.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  006.语音控制天窗车窗                     $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  007.ECO/SPORT开关                        $    $           $    $  ANS000.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  008.后视镜折叠                           $    $           $    $  ANS000.BYTE005  $  if((x&0x03)==0x00) y=@000f;else if((x&0x03)==0x01) y=@0521;else if((x&0x03)==0x02) y=@0522;else if((x&0x03)==0x03) y=@0035;else y=@0035;
  $  009.锁电机热保护时间设置                 $    $  s        $    $  ANS000.BYTE006  $  y=x;
  $  010.刹车片标定临界值设置                 $    $  %        $    $  ANS000.BYTE007  $  y=x;
  $  011.配RKE数量设置                        $    $           $    $  ANS001.BYTE004  $  if(((x&0xF0)>>4)==0x00) y=@04d4;else if(((x&0xF0)>>4)==0x01) y=@04d3;else if(((x&0xF0)>>4)==0x02) y=@0169;else if(((x&0xF0)>>4)==0x03) y=@016b;else if(((x&0xF0)>>4)==0x04) y=@05f7;else y=@0103;
  $  012.负载管理模式设置                     $    $           $    $  ANS001.BYTE004  $  if(((x&0x0C)>>2)==0x00) y=@00d2;else if(((x&0x0C)>>2)==0x01) y=@0524;else if(((x&0x0C)>>2)==0x02) y=@0525;else y=@0103;
  $  013.生产运行周期设置                     $    $           $    $  ANS001.BYTE004  $  if((x&0x03)==0x00) y=@050b;else if((x&0x03)==0x01) y=@050c;else if((x&0x03)==0x02) y=@050d;else if((x&0x03)==0x03) y=@050e;else y=@0103;
  $  014.TCU配置                              $    $           $    $  ANS001.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  015.PEPS配置                             $    $           $    $  ANS001.BYTE005  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  016.IMMO配置                             $    $           $    $  ANS001.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  017.左舵或右舵设置                       $    $           $    $  ANS001.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@0510;else if(((x&0x10)>>4)==0x01) y=@050f;else y=@0035;
  $  018.车辆类型                             $    $           $    $  ANS001.BYTE005  $  y=x;
  $  019.ABS配置                              $    $           $    $  ANS001.BYTE006  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0103;
  $  020.ESP配置                              $    $           $    $  ANS001.BYTE006  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0103;
  $  021.IPK是否配置                          $    $           $    $  ANS001.BYTE006  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0103;
  $  022.EMS是否配置                          $    $           $    $  ANS001.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0103;
  $  023.SAS是否配置                          $    $           $    $  ANS001.BYTE006  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0103;
  $  024.SRS是否配置                          $    $           $    $  ANS001.BYTE006  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0103;
  $  025.FICM是否配置                         $    $           $    $  ANS001.BYTE006  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0103;
  $  026.右后门窗电机是否配置                 $    $           $    $  ANS001.BYTE007  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  027.左后门窗电机是否配置                 $    $           $    $  ANS001.BYTE007  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  028.右前门窗电机是否配置                 $    $           $    $  ANS001.BYTE007  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  029.左前门窗电机是否配置                 $    $           $    $  ANS001.BYTE007  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0035;
  $  030.DDD（疲劳驾驶检测）配置              $    $           $    $  ANS001.BYTE007  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  031.钥匙插入信号                         $    $           $    $  ANS002.BYTE004  $  if(x==0x00) y=@0c21;else if(x==0x01) y=@0507;else y=@0035;
  $  032.行驶里程备份                         $    $  km       $    $  ANS003.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  033.保养里程备份                         $    $  km       $    $  ANS004.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  034.刹车片5V反馈                         $    $           $    $  ANS005.BYTE004  $  y=(x1*256+x2);
  $  035.制动踏板输入                         $    $           $    $  ANS006.BYTE004  $  y=(x1*256+x2);
  $  036.组合灯光开关输入                     $    $           $    $  ANS007.BYTE004  $  if(((x1*256+x2)>=0x00)&&((x1*256+x2)<=0x54))y=@062b;else if(((x1*256+x2)>=0x55)&&((x1*256+x2)<=0x182)) y=@062c;else if(((x1*256+x2)>=0x183)&&((x1*256+x2)<=0x205))y=@0513;else if(((x1*256+x2)>=0x26A)&&((x1*256+x2)<=0x3FF))y=@000f;else y=@0035;
  $  037.存在Crash信号                        $    $           $    $  ANS008.BYTE004  $  y=x;
  $  038.档位                                 $    $           $    $  ANS009.BYTE004  $  if((x&0x0F)==0x00) y=@0514;else if((x&0x0F)==0x01) y=@0003;else if((x&0x0F)==0x02) y=@0002;else if((x&0x0F)==0x03) y=@0001;else if((x&0x0F)==0x04) y=@0c22;else if((x&0x0F)==0x05) y=@0c23;else if((x&0x0F)==0x06) y=@0c24;else if((x&0x0F)==0x07) y=@0c25;else if((x&0x0F)==0x08) y=@0c26;else if((x&0x0F)==0x09) y=@0c27;else if((x&0x0F)==0x0A) y=@0c28;else if((x&0x0F)==0x0B) y=@0c29;else if((x&0x0F)==0x0F) y=@0c2a;else y=@0035;
  $  039.当前IDE                              $    $           $    $  ANS010.BYTE004  $  HEX(X1,X2,X3,X4);
  $  040.当前已学习遥控钥匙数量               $    $           $    $  ANS011.BYTE004  $  y=x;
  $  041.疲劳驾驶参数选择                     $    $           $    $  ANS012.BYTE004  $  y=x;
  $  042.疲劳驾驶性能调节                     $    $           $    $  ANS012.BYTE005  $  y=(x1*256+x2);
  $  043.近光灯开关输入                       $    $           $    $  ANS013.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  044.左前门开关状态输入                   $    $           $    $  ANS013.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  045.乘客门开关                           $    $           $    $  ANS013.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  046.后视镜折叠开关输入                   $    $           $    $  ANS013.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  047.超车灯开关输入                       $    $           $    $  ANS013.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  048.前雨刮归位信号输入                   $    $           $    $  ANS013.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  049.危险警报灯开关输入                   $    $           $    $  ANS013.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0035;
  $  050.位置灯开关                           $    $           $    $  ANS013.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  051.后窗和后视镜加热开关输入             $    $           $    $  ANS014.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  052.后雾灯开关输入                       $    $           $    $  ANS014.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  053.主驾门解锁/闭锁反馈输入              $    $           $    $  ANS014.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@0436;else if(((x&0x20)>>5)==0x01) y=@0404;else y=@0035;
  $  054.右转向灯开关                         $    $           $    $  ANS014.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  055.前雨刮低速开关输入                   $    $           $    $  ANS015.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  056.副驾门解锁_闭锁反馈输入              $    $           $    $  ANS015.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@0436;else if(((x&0x40)>>6)==0x01) y=@0404;else y=@0035;
  $  057.左后门开关状态输入                   $    $           $    $  ANS015.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  058.右后门开关状态输入                   $    $           $    $  ANS015.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  059.前雾灯开关输入                       $    $           $    $  ANS015.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  060.钥匙插入信号输入                     $    $           $    $  ANS015.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  061.油箱盖开关输入                       $    $           $    $  ANS015.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0035;
  $  062.前雨刮高速输入                       $    $           $    $  ANS015.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  063.前雨刷开关                           $    $           $    $  ANS016.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  064.KLR 输入                             $    $           $    $  ANS017.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  065.KL15输入                             $    $           $    $  ANS017.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  066.倒车灯开关输入                       $    $           $    $  ANS017.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  067.中控锁闭锁开关输入                   $    $           $    $  ANS018.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  068.刹车灯开关                           $    $           $    $  ANS018.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  069.远光灯开关                           $    $           $    $  ANS018.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  070.左转向灯开关输入                     $    $           $    $  ANS018.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  071.保留                                 $    $           $    $  ANS018.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  072.中控锁解锁开关输入                   $    $           $    $  ANS018.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  073.中控闭锁输出                         $    $           $    $  ANS019.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  074.油箱盖输出                           $    $           $    $  ANS019.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  075.中控解锁输出                         $    $           $    $  ANS019.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  076.主驾单独解锁                         $    $           $    $  ANS019.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  077.前洗涤输出                           $    $           $    $  ANS019.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  078.P档解锁                              $    $           $    $  ANS019.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  079.近光灯继电器                         $    $           $    $  ANS019.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  080.远光灯继电器驱动输出                 $    $           $    $  ANS019.BYTE005  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  081.前雾灯继电器驱动输出                 $    $           $    $  ANS019.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  082.后窗和后视镜加热继电器驱动输出       $    $           $    $  ANS019.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  083.喇叭继电器驱动输                     $    $           $    $  ANS019.BYTE005  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  084.前雨刮继电器驱动输出                 $    $           $    $  ANS019.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  085.前雨刮高速继电器驱动输出             $    $           $    $  ANS019.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0035;
  $  086.右前雾灯继电器驱动输出               $    $           $    $  ANS019.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  087.倒档灯                               $    $           $    $  ANS020.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  088.左日间行车灯输出                     $    $           $    $  ANS020.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  089.右日间行车灯输出                     $    $           $    $  ANS020.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  090.后视镜折叠                           $    $           $    $  ANS020.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  091.后视镜展开                           $    $           $    $  ANS020.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  092.RAP/ACC继电器输出                    $    $           $    $  ANS020.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  093.KL15 Relay IG1                       $    $           $    $  ANS020.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0035;
  $  094.ACC 唤醒                             $    $           $    $  ANS020.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  095.高位制动灯输出                       $    $           $    $  ANS020.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  096.刹车灯输出                           $    $           $    $  ANS020.BYTE005  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  097.位置灯                               $    $           $    $  ANS020.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  098.后雾灯输出                           $    $           $    $  ANS020.BYTE005  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  099.左转向灯                             $    $           $    $  ANS020.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  100.右转向灯                             $    $           $    $  ANS020.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0035;
  $  101.车身防盗状态指示灯                   $    $           $    $  ANS020.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  102.背光脉冲宽度调制                     $    $           $    $  ANS021.BYTE004  $  y=x;
  $  103.背光灯开关输入                       $    $           $    $  ANS022.BYTE004  $  if(((x1*256+x2)>=0x7C)&&((x1*256+x2)<=0xD8)) y=@0c2b;else if(((x1*256+x2)>=0x13B)&&((x1*256+x2)<=0x238))y=@0509;else if(((x1*256+x2)>=0x26F)&&((x1*256+x2)<=0x3FF))y=@000f;else y=@0035;
  $  104.ECU PIN在防盗锁止前                  $    $           $    $  ANS023.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  105.发动机运行状态                       $    $           $    $  ANS024.BYTE004  $  if(x==0x00) y=@018e;else if(x==0x01) y=@0c2c;else y=@0035;
  $  106.前雨刮间歇档位调节输入               $    $           $    $  ANS025.BYTE004  $  if(((x1*256+x2)>=0x00)&&((x1*256+x2)<=0x0C))y=@0c2d;else if(((x1*256+x2)>=0xB9)&&((x1*256+x2)<=0xFA)) y=@0c2e;else if(((x1*256+x2)>=0x14F)&&((x1*256+x2)<=0x1A5))y=@04f6;else if(((x1*256+x2)>=0x1C1)&&((x1*256+x2)<=0x221))y=@04f7;else if(((x1*256+x2)>=0x229)&&((x1*256+x2)<=0x275))y=@04f8;else y=@0035;
  $  107.前雾灯输入状态                       $    $           $    $  ANS026.BYTE004  $  if(((x1*256+x2)>=0x00)&&((x1*256+x2)<=0x1F4))y=@0a41;else if(((x1*256+x2)>=0x1F5)&&((x1*256+x2)<=0x3FF))y=@0a42;else y=@0035;
  $  108.换挡                                 $    $           $    $  ANS027.BYTE004  $  if(((x1*256+x2)>=0x4F)&&((x1*256+x2)<=0x82))y=@0c2f;else if(((x1*256+x2)>=0x110)&&((x1*256+x2)<=0x167))y=@0c30;else if(((x1*256+x2)>=0x1C4)&&((x1*256+x2)<=0x217))y=@0508;else y=@0035;
  $  109.前舱盖开关输入                       $    $           $    $  ANS028.BYTE004  $  if(((x1*256+x2)>=0x18B)&&((x1*256+x2)<=0x221))y=@0a41;else if(((x1*256+x2)>=0x222)&&((x1*256+x2)<=0xFFFF))y=@0035;else y=@0a42;
  $  110.防盗 锁定或未锁定                    $    $           $    $  ANS029.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0404;else if(((x&0x80)>>7)==0x01) y=@0436;else y=@0035;
  $  111.PIN码是否写入                        $    $           $    $  ANS029.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@02ac;else if(((x&0x40)>>6)==0x01) y=@0100;else y=@0035;
  $  112.SK是否写入                           $    $           $    $  ANS029.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@02ac;else if(((x&0x20)>>5)==0x01) y=@0100;else y=@0035;
  $  113.VIN码是否写入                        $    $           $    $  ANS029.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@02ac;else if(((x&0x10)>>4)==0x01) y=@0100;else y=@0035;
  $  114.钥匙数量                             $    $           $    $  ANS029.BYTE004  $  y=(x&0x0F);
  $  115.5V点火反馈                           $    $           $    $  ANS030.BYTE004  $  if(((x1*256+x2)>=0x136)&&((x1*256+x2)<=0x17C))y=@009d;else if(((x1*256+x2)>=0x19A)&&((x1*256+x2)<=0x1EA))y=@0666;else if(((x1*256+x2)>=0x226)&&((x1*256+x2)<=0x280))y=@000f;else if(((x1*256+x2)>=0x280)&&((x1*256+x2)<=0x3FF))y=@0a27;else y=@0035;
  $  116.点火环PWM                            $    $           $    $  ANS031.BYTE004  $  y=x;
  $  117.点火开关                             $    $           $    $  ANS032.BYTE004  $  if(((x1*256+x2)>=0x00)&&((x1*256+x2)<=0x0A))y=@000f;else if(((x1*256+x2)>=0x12C)&&((x1*256+x2)<=0x17C))y=@0666;else if(((x1*256+x2)>=0x208)&&((x1*256+x2)<=0x280))y=@009d;else if(((x1*256+x2)>=0x3B6)&&((x1*256+x2)<=0x3FF))y=@0507;else y=@0035;
  $  118.点火开关状态                         $    $           $    $  ANS033.BYTE004  $  if(x==0x00) y=@000f;else if(x==0x01) y=@0507;else if(x==0x02) y=@0666;else if(x==0x03) y=@009e;else y=@0035;
  $  119.钥匙插入状态                         $    $           $    $  ANS033.BYTE005  $  if(x==0x00) y=@0c21;else if(x==0x01) y=@0507;else y=@0035;
  $  120.出厂照我回家功能外灯延时             $    $           $    $  ANS034.BYTE004  $  if(((x&0xC0)>>6)==0x00) y=@04d4;else if(((x&0xC0)>>6)==0x01) y=@04fd;else if(((x&0xC0)>>6)==0x02) y=@0502;else if(((x&0xC0)>>6)==0x03) y=@0503;else y=@0035;
  $  121.出厂寻车功能反馈方式                 $    $           $    $  ANS034.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@0506;else if(((x&0x20)>>5)==0x01) y=@0498;else y=@0035;
  $  122.出厂熄火自动解锁                     $    $           $    $  ANS034.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  123.出厂RKE主驾单独解锁                  $    $           $    $  ANS034.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  124.出厂PKE主驾单独解锁                  $    $           $    $  ANS034.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  125.出厂照我回家功能                     $    $           $    $  ANS034.BYTE005  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0035;
  $  126.出厂车速自动闭锁                     $    $           $    $  ANS034.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  127.出厂闭锁反馈方式                     $    $           $    $  ANS034.BYTE005  $  if((x&0x03)==0x00) y=@0504;else if((x&0x03)==0x01) y=@000f;else if((x&0x03)==0x02) y=@0498;else if((x&0x03)==0x03) y=@0506;else y=@0035;
  $  128.钥匙参考                             $    $           $    $  ANS035.BYTE004  $  HEX(X1,X2);
  $  129.前舱盖配置                           $    $           $    $  ANS036.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  130.前雾灯配置                           $    $           $    $  ANS036.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  131.自动灯光                             $    $           $    $  ANS036.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  132.尾门灯配置                           $    $           $    $  ANS036.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  133.日间行车灯配置                       $    $           $    $  ANS036.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0035;
  $  134.远光灯打开方式                       $    $           $    $  ANS036.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@04fa;else if(((x&0x04)>>2)==0x01) y=@04f9;else y=@0035;
  $  135.背光调节开关配置                     $    $           $    $  ANS036.BYTE007  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  136.闭锁源记录                           $    $           $    $  ANS037.BYTE004  $  if(x10==0x01) y=@0c0b;else if(x10==0x02) y=@0c0c;else if(x10==0x03) y=@0c0d;else if(x10==0x04) y=@0c0e;else if(x10==0x05) y=@0c0f;else if(x10==0x06) y=@0c10;else y=@0035;
  $  137.照我回家配置                         $    $           $    $  ANS038.BYTE004  $  if(((x&0xE0)>>5)==0x00) y=@04d4;else if(((x&0xE0)>>5)==0x01) y=@04fd;else if(((x&0xE0)>>5)==0x02) y=@0502;else if(((x&0xE0)>>5)==0x03) y=@0503;else y=@0103;
  $  138.闭锁反馈方式设置                     $    $           $    $  ANS038.BYTE004  $  if(((x&0x18)>>3)==0x00) y=@0504;else if(((x&0x18)>>3)==0x01) y=@000f;else if(((x&0x18)>>3)==0x02) y=@0498;else if(((x&0x18)>>3)==0x03) y=@0506;else y=@0035;
  $  139.照我回家功能                         $    $           $    $  ANS038.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  140.寻车功能反馈方式设置                 $    $           $    $  ANS038.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@0506;else if(((x&0x80)>>7)==0x01) y=@0498;else y=@0035;
  $  141.解锁反馈方式设置                     $    $           $    $  ANS038.BYTE005  $  if(((x&0x60)>>5)==0x00) y=@000f;else if(((x&0x60)>>5)==0x01) y=@0506;else y=@0103;
  $  142.其他自动触发方式                     $    $           $    $  ANS038.BYTE005  $  if(((x&0x18)>>3)==0x00) y=@0187;else if(((x&0x18)>>3)==0x01) y=@0495;else if(((x&0x18)>>3)==0x02) y=@0526;else y=@0103;
  $  143.熄火自动解锁                         $    $           $    $  ANS038.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  144.固定增益A                            $    $           $    $  ANS039.BYTE004  $  if((x1*256+x2)==0x00) y=@000f;else if((x1*256+x2)==0x01) y=@0028;else y=@0035;
  $  145.修正增益B                            $    $           $    $  ANS039.BYTE006  $  if((x1*256+x2)==0x00) y=@000f;else if((x1*256+x2)==0x01) y=@0028;else y=@0035;
  $  146.增益A                                $    $           $    $  ANS039.BYTE008  $  if((x1*256+x2)==0x00) y=@000f;else if((x1*256+x2)==0x01) y=@0028;else y=@0035;
  $  147.增益B                                $    $           $    $  ANS039.BYTE010  $  if((x1*256+x2)==0x00) y=@000f;else if((x1*256+x2)==0x01) y=@0028;else y=@0035;
  $  148.后雾灯输入状态                       $    $           $    $  ANS040.BYTE004  $  if(((x1*256+x2)>=0x00)&&((x1*256+x2)<=0x1F4))y=@0a41;else if(((x1*256+x2)>=0x1F5)&&((x1*256+x2)<=0x3FF))y=@0a42;else y=@0035;
  $  149.后视镜折叠输入状态                   $    $           $    $  ANS041.BYTE004  $  if(((x1*256+x2)>=0x00)&&((x1*256+x2)<=0x1F4))y=@0a41;else if(((x1*256+x2)>=0x1F5)&&((x1*256+x2)<=0x3FF))y=@0a42;else y=@0035;
  $  150.内顶灯高边输出                       $    $           $    $  ANS042.BYTE004  $  y=x;
  $  151.内顶灯低边输出                       $    $           $    $  ANS043.BYTE004  $  y=x;
  $  152.SK2锁定状态                          $    $           $    $  ANS044.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0404;else if(((x&0x80)>>7)==0x01) y=@0436;else y=@0035;
  $  153.SK2写入状态                          $    $           $    $  ANS044.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@02ac;else if(((x&0x40)>>6)==0x01) y=@0100;else y=@0035;
  $  154.电源模式                             $    $           $    $  ANS045.BYTE004  $  if(x==0x00) y=@000f;else if(x==0x01) y=@016c;else if(x==0x02) y=@0028;else if(x==0x03) y=@009e;else y=@0035;
  $  155.安全警报状态                         $    $           $    $  ANS045.BYTE005  $  if(x==0x00) y=@09e6;else if(x==0x01) y=@0c00;else if(x==0x02) y=@0c01;else if(x==0x03) y=@0529;else y=@0035;
  $  156.自动灯光控制                         $    $           $    $  ANS046.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  157.光雨量传感器状态                     $    $           $    $  ANS046.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  158.软件版本日期                         $    $           $    $  ANS047.BYTE004  $  HEX(X1,X2,X3,X4);
  $  159.启动停止开关输入                     $    $           $    $  ANS048.BYTE004  $  if(((x1*256+x2)>=0xA4)&&((x1*256+x2)<=0x117)) y=@0a41;else if(((x1*256+x2)>=0x15F)&&((x1*256+x2)<=0x1C8))y=@0a42;else y=@0035;
  $  160.TBOX请求需认证配置                   $    $           $    $  ANS049.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  161.TBOX算法配置                         $    $           $    $  ANS049.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@0c02;else if(((x&0x40)>>6)==0x01) y=@0c03;else y=@0035;
  $  162.TBOX控制窗功能配置字                 $    $           $    $  ANS049.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  163.TBOX远程启动功能配置                 $    $           $    $  ANS049.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  164.TBOX远程钥匙管理功能 配置            $    $           $    $  ANS049.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0035;
  $  165.TBOX远程寻车功能配                   $    $           $    $  ANS049.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  166.TBOX远程解闭锁控制功能配置           $    $           $    $  ANS049.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  167.TBOX功能配置字                       $    $           $    $  ANS049.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  168.BCM允许重复发送认证的最大次数        $    $           $    $  ANS049.BYTE005  $  if(((x&0xC0)>>6)==0x00) y=@09e1;else if(((x&0xC0)>>6)==0x01) y=@052a;else if(((x&0xC0)>>6)==0x02) y=@052b;else if(((x&0xC0)>>6)==0x03) y=@0c04;else y=@0035;
  $  169.BCM允许认证失败次数                  $    $           $    $  ANS049.BYTE005  $  y=((x&0x30)>>4);
  $  170.等待TBOX响应最长时间                 $    $  s        $    $  ANS049.BYTE005  $  y=(x&0x0F);
  $  171.左转向灯输入状态                     $    $           $    $  ANS050.BYTE004  $  if(((x1*256+x2)>=0x00)&&((x1*256+x2)<=0x1F4))y=@0a41;else if(((x1*256+x2)>=0x1F5)&&((x1*256+x2)<=0x3FF))y=@0a42;else y=@0035;
  $  172.解锁资源存储                         $    $           $    $  ANS051.BYTE004  $  if(x10==0x01) y=@0c05;else if(x10==0x02) y=@0c06;else if(x10==0x03) y=@0c07;else if(x10==0x04) y=@0c08;else if(x10==0x05) y=@0c09;else if(x10==0x06) y=@0c0a;else y=@0035;
  $  173.车速                                 $    $  km/h     $    $  ANS052.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  174.车速状态                             $    $           $    $  ANS052.BYTE006  $  if(x==0x00) y=@00bb;else if(x==0x01) y=@00b3;else y=@0035;
  $  175.唤醒源记录                           $    $           $    $  ANS053.BYTE004  $  if(x10==0x01) y=@0c11;else if(x10==0x02) y=@0c12;else if(x10==0x03) y=@0c13;else if(x10==0x04) y=@0c14;else if(x10==0x05) y=@0c15;else if(x10==0x06) y=@0c16;else if(x10==0x07) y=@0c17;else if(x10==0x08) y=@0c18;else if(x10==0x09) y=@0507;else if(x10==0x0A) y=@0c19;else if(x10==0x0B) y=@0c1a;else if(x10==0x0C) y=@0c1b;else if(x10==0x10) y=@0c1c;else if((x10>=0x10000)&&(x10<=0xFFFF))y=@0035;else if(x10==0x11) y=@0c1d;else if(x10==0x12) y=@0c1e;else if(x10==0x13) y=@0c1f;else y=@0c20;
  $  176.前雨刮自动配置                       $    $           $    $  ANS054.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  177.后雨刮配置                           $    $           $    $  ANS054.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  178.前洗涤与前雨刮联动输出间隔设置       $    $  ms       $    $  ANS054.BYTE005  $  y=x*100;
  $  179.雨刮堵转判断时间设置                 $    $  s        $    $  ANS054.BYTE006  $  y=x;
  $  180.后洗涤与后雨刮联动输出间隔设置       $    $  ms       $    $  ANS054.BYTE007  $  y=x*100;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:701 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
