
    车型ID：10b1

    模拟：协议模拟-->10b1

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:701 02 10 01 00 00 00 00 00       $~  ANS000:781 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:701 02 3E 80 00 00 00 00 00       $!  ANS000:781 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:701 03 19 02 09 00 00 00 00       $#  ANS000:781 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/ae000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:701 04 14 FF FF FF 00 00 00       $$  ANS000:781 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:701 03 22 F1 A0 00 00 00 00       $%  ANS000:781 03 22 F1 A0 00 00 00 00
  $%  REQ001:701 03 22 F1 83 00 00 00 00       $%  ANS001:781 03 22 F1 83 00 00 00 00
  $%  REQ002:701 03 22 F1 91 00 00 00 00       $%  ANS002:781 03 22 F1 91 00 00 00 00
  $%  REQ003:701 03 22 F1 8B 00 00 00 00       $%  ANS003:781 03 22 F1 8B 00 00 00 00
  $%  REQ004:701 03 22 F1 A2 00 00 00 00       $%  ANS004:781 03 22 F1 A2 00 00 00 00
  $%  REQ005:701 03 22 F1 87 00 00 00 00       $%  ANS005:781 03 22 F1 87 00 00 00 00
  $%  REQ006:701 03 22 F1 10 00 00 00 00       $%  ANS006:781 03 22 F1 10 00 00 00 00
  $%  REQ007:701 03 22 F1 92 00 00 00 00       $%  ANS007:781 03 22 F1 92 00 00 00 00
  $%  REQ008:701 03 22 F1 8C 00 00 00 00       $%  ANS008:781 03 22 F1 8C 00 00 00 00
  $%  REQ009:701 03 22 F1 94 00 00 00 00       $%  ANS009:781 03 22 F1 94 00 00 00 00
  $%  REQ010:701 03 22 F1 8A 00 00 00 00       $%  ANS010:781 03 22 F1 8A 00 00 00 00
  $%  REQ011:701 03 22 F1 90 00 00 00 00       $%  ANS011:781 03 22 F1 90 00 00 00 00
  $%  REQ012:701 03 22 F1 A8 00 00 00 00       $%  ANS012:781 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:年:                              $%    $%  ANS003.BYTE004  $%  HEX(X1);
  $%  004:月:                              $%    $%  ANS003.BYTE005  $%  HEX(X1);
  $%  005:日:                              $%    $%  ANS003.BYTE006  $%  HEX(X1);
  $%  006:电控单元网络软件号:              $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次):                  $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  014:系统供应商标识号:                $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6);
  $%  015:车辆识别代码:                    $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  016:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:701 03 22 D1 19 00 00 00 00       $  ANS000:781 03 22 D1 19 00 00 00 00
  $  REQ001:701 03 22 C1 04 00 00 00 00       $  ANS001:781 03 22 C1 04 00 00 00 00
  $  REQ002:701 03 22 D1 05 00 00 00 00       $  ANS002:781 03 22 D1 05 00 00 00 00
  $  REQ003:701 03 22 C1 01 00 00 00 00       $  ANS003:781 03 22 C1 01 00 00 00 00
  $  REQ004:701 03 22 E0 1A 00 00 00 00       $  ANS004:781 03 22 E0 1A 00 00 00 00
  $  REQ005:701 03 22 C1 06 00 00 00 00       $  ANS005:781 03 22 C1 06 00 00 00 00
  $  REQ006:701 03 22 C1 08 00 00 00 00       $  ANS006:781 03 22 C1 08 00 00 00 00
  $  REQ007:701 03 22 E0 1E 00 00 00 00       $  ANS007:781 03 22 E0 1E 00 00 00 00
  $  REQ008:701 03 22 CF 10 00 00 00 00       $  ANS008:781 03 22 CF 10 00 00 00 00
  $  REQ009:701 03 22 D1 10 00 00 00 00       $  ANS009:781 03 22 D1 10 00 00 00 00
  $  REQ010:701 03 22 D1 11 00 00 00 00       $  ANS010:781 03 22 D1 11 00 00 00 00
  $  REQ011:701 03 22 E0 18 00 00 00 00       $  ANS011:781 03 22 E0 18 00 00 00 00
  $  REQ012:701 03 22 D1 02 00 00 00 00       $  ANS012:781 03 22 D1 02 00 00 00 00
  $  REQ013:701 03 22 D3 10 00 00 00 00       $  ANS013:781 03 22 D3 10 00 00 00 00
  $  REQ014:701 03 22 D3 13 00 00 00 00       $  ANS014:781 03 22 D3 13 00 00 00 00
  $  REQ015:701 03 22 D1 13 00 00 00 00       $  ANS015:781 03 22 D1 13 00 00 00 00
  $  REQ016:701 03 22 D1 01 00 00 00 00       $  ANS016:781 03 22 D1 01 00 00 00 00
  $  REQ017:701 03 22 D1 06 00 00 00 00       $  ANS017:781 03 22 D1 06 00 00 00 00
  $  REQ018:701 03 22 D1 17 00 00 00 00       $  ANS018:781 03 22 D1 17 00 00 00 00
  $  REQ019:701 03 22 C1 02 00 00 00 00       $  ANS019:781 03 22 C1 02 00 00 00 00
  $  REQ020:701 03 22 62 05 00 00 00 00       $  ANS020:781 03 22 62 05 00 00 00 00
  $  REQ021:701 03 22 D1 03 00 00 00 00       $  ANS021:781 03 22 D1 03 00 00 00 00
  $  REQ022:701 03 22 E0 1B 00 00 00 00       $  ANS022:781 03 22 E0 1B 00 00 00 00
  $  REQ023:701 03 22 C1 05 00 00 00 00       $  ANS023:781 03 22 C1 05 00 00 00 00
  $  REQ024:701 03 22 E0 1C 00 00 00 00       $  ANS024:781 03 22 E0 1C 00 00 00 00
  $  REQ025:701 03 22 E2 11 00 00 00 00       $  ANS025:781 03 22 E2 11 00 00 00 00
  $  REQ026:701 03 22 C1 07 00 00 00 00       $  ANS026:781 03 22 C1 07 00 00 00 00
  $  REQ027:701 03 22 C1 09 00 00 00 00       $  ANS027:781 03 22 C1 09 00 00 00 00
  $  REQ028:701 03 22 D3 02 00 00 00 00       $  ANS028:781 03 22 D3 02 00 00 00 00
  $  REQ029:701 03 22 62 06 00 00 00 00       $  ANS029:781 03 22 62 06 00 00 00 00
  $  REQ030:701 03 22 E0 17 00 00 00 00       $  ANS030:781 03 22 E0 17 00 00 00 00
  $  REQ031:701 03 22 D1 15 00 00 00 00       $  ANS031:781 03 22 D1 15 00 00 00 00
  $  REQ032:701 03 22 62 04 00 00 00 00       $  ANS032:781 03 22 62 04 00 00 00 00
  $  REQ033:701 03 22 C1 03 00 00 00 00       $  ANS033:781 03 22 C1 03 00 00 00 00
  $  REQ034:701 03 22 D1 04 00 00 00 00       $  ANS034:781 03 22 D1 04 00 00 00 00

  $  000.KLR 唤醒输出                        $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@016d;else y=@0035;
  $  001.TCU唤醒输出                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  002.B+ 唤醒输出                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  003.EMS唤醒输出                         $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  004.P档解锁输出                         $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  005.KL15继电器                          $    $           $    $  ANS000.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  006.KLR继电器                           $    $           $    $  ANS000.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  007.车速自动闭锁配置                    $    $           $    $  ANS001.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  008.后风窗加热配置                      $    $           $    $  ANS001.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  009.RKE主驾单独解锁配置                 $    $           $    $  ANS001.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  010.尾门配置                            $    $           $    $  ANS001.BYTE004  $  if(((x&0x18)>>3)==0x00) y=@0c49;else if(((x&0x18)>>3)==0x01) y=@016d;else if(((x&0x18)>>3)==0x02) y=@000f;else if(((x&0x18)>>3)==0x03) y=@0178;else y=@0035;
  $  011.P档解锁有无配置                     $    $           $    $  ANS001.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  012.后视镜折叠有无配置                  $    $           $    $  ANS001.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  013.PKE主驾单独解锁配置                 $    $           $    $  ANS001.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  014.左后门配置                          $    $           $    $  ANS001.BYTE005  $  if(((x&0xC0)>>6)==0x00) y=@00b9;else if(((x&0xC0)>>6)==0x01) y=@0cbf;else if(((x&0xC0)>>6)==0x02) y=@0cc0;else if(((x&0xC0)>>6)==0x03) y=@0178;else y=@0035;
  $  015.右后门配置                          $    $           $    $  ANS001.BYTE005  $  if(((x&0x30)>>4)==0x00) y=@00b9;else if(((x&0x30)>>4)==0x01) y=@0cbf;else if(((x&0x30)>>4)==0x02) y=@0cc0;else if(((x&0x30)>>4)==0x03) y=@0178;else y=@0035;
  $  016.慢充电子锁                          $    $           $    $  ANS001.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@01df;else if(((x&0x04)>>2)==0x01) y=@00bb;else y=@0035;
  $  017.油箱盖解锁配置                      $    $           $    $  ANS001.BYTE005  $  if((x&0x03)==0x00) y=@0c5e;else if((x&0x03)==0x01) y=@0c5f;else if((x&0x03)==0x02) y=@0c60;else if((x&0x03)==0x03) y=@0178;else y=@0035;
  $  018.锁电机热保护时间                    $    $  s        $    $  ANS001.BYTE006  $  y=x;
  $  019.自动重上锁计时时间                  $    $  s        $    $  ANS001.BYTE007  $  y=x;
  $  020.后视镜折叠                          $    $           $    $  ANS002.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  021.ECO/SPORT开关                       $    $           $    $  ANS002.BYTE006  $  if(((x&0x30)>>4)==0x00) y=@000f;else if(((x&0x30)>>4)==0x01) y=@0252;else if(((x&0x30)>>4)==0x02) y=@0cc3;else if(((x&0x30)>>4)==0x03) y=@0035;else y=@0035;
  $  022.ACC/CC巡航开关                      $    $           $    $  ANS002.BYTE006  $  if((x&0x0F)==0x01) y=@0c62;else if((x&0x0F)==0x02) y=@0c63;else if((x&0x0F)==0x03) y=@0c64;else if((x&0x0F)==0x04) y=@0c65;else if((x&0x0F)==0x05) y=@0c66;else if((x&0x0F)==0x06) y=@0c67;else if((x&0x0F)==0x07) y=@0c68;else y=@0103;
  $  023.M档位                               $    $           $    $  ANS002.BYTE007  $  if(((x&0x30)>>4)==0x00) y=@0cc4;else if(((x&0x30)>>4)==0x01) y=@0cc4;else if(((x&0x30)>>4)==0x02) y=@0cc4;else if(((x&0x30)>>4)==0x03) y=@0035;else y=@0035;
  $  024.配RKE数量                           $    $           $    $  ANS003.BYTE004  $  if(((x&0xF0)>>4)==0x00) y=@04d4;else if(((x&0xF0)>>4)==0x01) y=@04d3;else if(((x&0xF0)>>4)==0x02) y=@0169;else if(((x&0xF0)>>4)==0x03) y=@016b;else if(((x&0xF0)>>4)==0x04) y=@0523;else if(((x&0xF0)>>4)==0x05) y=@0178;else if(((x&0xF0)>>4)==0x06) y=@0179;else if(((x&0xF0)>>4)==0x07) y=@017e;else if(((x&0xF0)>>4)==0x08) y=@0cc1;else if(((x&0xF0)>>4)==0x09) y=@0c73;else if(((x&0xF0)>>4)==0x0A) y=@0c74;else if(((x&0xF0)>>4)==0x0B) y=@0c75;else if(((x&0xF0)>>4)==0x0C) y=@0cc5;else if(((x&0xF0)>>4)==0x0D) y=@0cc6;else if(((x&0xF0)>>4)==0x0E) y=@0c78;else if(((x&0xF0)>>4)==0x0F) y=@0c79;else y=@0035;
  $  025.负载管理模式                        $    $           $    $  ANS003.BYTE004  $  if(((x&0x0C)>>2)==0x00) y=@00d2;else if(((x&0x0C)>>2)==0x01) y=@0524;else if(((x&0x0C)>>2)==0x02) y=@01d2;else if(((x&0x0C)>>2)==0x03) y=@0178;else y=@0035;
  $  026.生产运行周期                        $    $           $    $  ANS003.BYTE004  $  if((x&0x03)==0x00) y=@0c7a;else if((x&0x03)==0x01) y=@0c7b;else if((x&0x03)==0x02) y=@0c7c;else if((x&0x03)==0x03) y=@0c7d;else y=@0035;
  $  027.TCU是否配置                         $    $           $    $  ANS003.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  028.PEPS是否配置                        $    $           $    $  ANS003.BYTE005  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  029.IMMO是否配置                        $    $           $    $  ANS003.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  030.左舵或右舵设置                      $    $           $    $  ANS003.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@0510;else if(((x&0x10)>>4)==0x01) y=@050f;else y=@0035;
  $  031.车辆类型设置                        $    $           $    $  ANS003.BYTE005  $  if((x&0x0F)==0x00) y=@0178;else if((x&0x0F)==0x01) y=@0179;else if((x&0x0F)==0x02) y=@017e;else if((x&0x0F)==0x03) y=@0cc1;else if((x&0x0F)==0x04) y=@0c73;else if((x&0x0F)==0x05) y=@0c74;else if((x&0x0F)==0x06) y=@0c75;else if((x&0x0F)==0x07) y=@0cc5;else if((x&0x0F)==0x08) y=@0cc6;else if((x&0x0F)==0x09) y=@0c78;else if((x&0x0F)==0x0A) y=@0c79;else if((x&0x0F)==0x0B) y=@0c7e;else if((x&0x0F)==0x0C) y=@0c7f;else if((x&0x0F)==0x0D) y=@0c80;else if((x&0x0F)==0x0E) y=@0c81;else if((x&0x0F)==0x0F) y=@0c82;else y=@0035;
  $  032.ABS配置                             $    $           $    $  ANS003.BYTE006  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  033.ESP是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  034.IPK是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  035.EMS是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  036.SAS是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0035;
  $  037.SRS是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  038.FICM是否配置                        $    $           $    $  ANS003.BYTE006  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  039.电动尾门是否配置                    $    $           $    $  ANS003.BYTE006  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  040.转向变道灯开关滤波时间              $    $           $    $  ANS003.BYTE007  $  if(((x&0xC0)>>6)==0x00) y=@0539;else if(((x&0xC0)>>6)==0x01) y=@053a;else if(((x&0xC0)>>6)==0x02) y=@053b;else if(((x&0xC0)>>6)==0x03) y=@0c83;else y=@0035;
  $  041.VCU是否配置                         $    $           $    $  ANS003.BYTE007  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  042.TPMS是否配置                        $    $           $    $  ANS003.BYTE007  $  if(((x&0x06)>>1)==0x00) y=@00b9;else if(((x&0x06)>>1)==0x01) y=@00ba;else if(((x&0x06)>>1)==0x02) y=@0c6e;else if(((x&0x06)>>1)==0x03) y=@0c6f;else y=@0035;
  $  043.RFA是否配置                         $    $           $    $  ANS003.BYTE007  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  044.当前已学习遥控钥匙数量              $    $           $    $  ANS004.BYTE004  $  y=x;
  $  045.疲劳驾驶性能调节                    $    $           $    $  ANS005.BYTE005  $  y=(x1*256+x2)*0.00390631;
  $  046.DDD配置                             $    $           $    $  ANS005.BYTE007  $  if((x&0x01)==0x00) y=@01df;else if((x&0x01)==0x01) y=@00bb;else y=@0035;
  $  047.照我回家配置                        $    $           $    $  ANS006.BYTE004  $  if(((x&0xE0)>>5)==0x00) y=@000f;else if(((x&0xE0)>>5)==0x01) y=@04fd;else if(((x&0xE0)>>5)==0x02) y=@0502;else if(((x&0xE0)>>5)==0x03) y=@0503;else if(((x&0xE0)>>5)==0x04) y=@0178;else if(((x&0xE0)>>5)==0x05) y=@0179;else if(((x&0xE0)>>5)==0x06) y=@017e;else if(((x&0xE0)>>5)==0x07) y=@0cc1;else y=@0035;
  $  048.寻车功能反馈方式                    $    $           $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@0cc2;else if(((x&0x80)>>7)==0x01) y=@0c71;else y=@0035;
  $  049.自动解锁默认配置                    $    $           $    $  ANS006.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  050.氛围灯使能默认配置                  $    $           $    $  ANS006.BYTE004  $  if(((x&0x0C)>>2)==0x00) y=@00b9;else if(((x&0x0C)>>2)==0x01) y=@00ba;else y=@0103;
  $  051.RKE主驾单独解锁配置                 $    $           $    $  ANS006.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  052.PKE主驾单独解锁配置                 $    $           $    $  ANS006.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  053.车速闭锁默认配置                    $    $           $    $  ANS006.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  054.闭锁反馈方式                        $    $           $    $  ANS006.BYTE004  $  if(((x&0x18)>>3)==0x00) y=@000f;else if(((x&0x18)>>3)==0x01) y=@0cc2;else if(((x&0x18)>>3)==0x02) y=@0505;else if(((x&0x18)>>3)==0x03) y=@0504;else y=@0035;
  $  055.照地灯时间默认配置                  $    $           $    $  ANS006.BYTE006  $  if(((x&0x60)>>5)==0x00) y=@0cbc;else if(((x&0x60)>>5)==0x01) y=@0c46;else if(((x&0x60)>>5)==0x02) y=@0c47;else if(((x&0x60)>>5)==0x03) y=@0c48;else y=@0035;
  $  056.后视镜折叠                          $    $           $    $  ANS006.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  057.解锁迎宾模式配置                    $    $           $    $  ANS006.BYTE007  $  if(((x&0x38)>>3)==0x00) y=@0cbd;else if(((x&0x38)>>3)==0x01) y=@0abd;else if(((x&0x38)>>3)==0x02) y=@0abe;else if(((x&0x38)>>3)==0x03) y=@0cbe;else if(((x&0x38)>>3)==0x04) y=@0c3c;else if(((x&0x38)>>3)==0x05) y=@0178;else if(((x&0x38)>>3)==0x06) y=@0179;else if(((x&0x38)>>3)==0x07) y=@017e;else y=@0035;
  $  058.闭锁迎宾模式配置                    $    $           $    $  ANS006.BYTE007  $  if((x&0x07)==0x00) y=@0cbd;else if((x&0x07)==0x01) y=@0abd;else if((x&0x07)==0x02) y=@0abe;else if((x&0x07)==0x03) y=@0cbe;else if((x&0x07)==0x04) y=@0c3c;else if((x&0x07)==0x05) y=@0178;else if((x&0x07)==0x06) y=@0179;else if((x&0x07)==0x07) y=@017e;else y=@0035;
  $  059.PWM调光                             $    $           $    $  ANS007.BYTE004  $  y=x;
  $  060.ECU PIN(在IMMO锁住之前)             $    $           $    $  ANS008.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  061.右远光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@016d;else y=@0035;
  $  062.左远光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@016d;else y=@0035;
  $  063.右近光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@016d;else y=@0035;
  $  064.左近光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  065.右转向灯输出                        $    $           $    $  ANS009.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@016d;else y=@0035;
  $  066.左转向灯输出                        $    $           $    $  ANS009.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  067.位置灯输出                          $    $           $    $  ANS009.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  068.右日行灯输出                        $    $           $    $  ANS010.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@016d;else y=@0035;
  $  069.左日行灯输出                        $    $           $    $  ANS010.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  070.后雾灯输出                          $    $           $    $  ANS010.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  071.照地灯                              $    $           $    $  ANS010.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@016d;else y=@0035;
  $  072.倒车灯输出                          $    $           $    $  ANS010.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  073.高位制动灯+右刹车灯输出             $    $           $    $  ANS010.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  074.左刹车灯输出                        $    $           $    $  ANS010.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  075.发动机运行状态                      $    $           $    $  ANS011.BYTE004  $  if(x==0x00) y=@018e;else if(x==0x01) y=@0011;else y=@0035;
  $  076.超车灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@016d;else y=@0035;
  $  077.远光灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  078.位置灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  079.自动灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  080.近光灯开关                          $    $           $    $  ANS012.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  081.危险报警灯开关                      $    $           $    $  ANS012.BYTE005  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@016d;else y=@0035;
  $  082.左转向灯开关                        $    $           $    $  ANS012.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@016d;else y=@0035;
  $  083.右转向灯开关                        $    $           $    $  ANS012.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  084.后雾灯开关                          $    $           $    $  ANS012.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  085.前雾灯开关                          $    $           $    $  ANS012.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  086.喇叭开关                            $    $           $    $  ANS012.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  087.倒车灯开关                          $    $           $    $  ANS012.BYTE006  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  088.刹车灯开关                          $    $           $    $  ANS012.BYTE006  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  089.RLS点亮近光灯请求                   $    $           $    $  ANS012.BYTE008  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  090.RLS点亮位置灯请求                   $    $           $    $  ANS012.BYTE008  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  091.前内顶灯OFF开关                     $    $           $    $  ANS012.BYTE009  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  092.前内顶灯ON开关                      $    $           $    $  ANS012.BYTE009  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  093.前内顶灯自动开关                    $    $           $    $  ANS012.BYTE009  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  094.背光灯调节+开关                     $    $           $    $  ANS012.BYTE010  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  095.AEB指示灯开关                       $    $           $    $  ANS012.BYTE010  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  096.自动灯光阈值                        $    $  V        $    $  ANS012.BYTE007  $  y=x*0.05;
  $  097.IMMO锁定状态                        $    $           $    $  ANS013.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0052;else if(((x&0x80)>>7)==0x01) y=@0055;else y=@0035;
  $  098.PIN写入状态                         $    $           $    $  ANS013.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00c9;else if(((x&0x40)>>6)==0x01) y=@0100;else y=@0035;
  $  099.密钥写入状态                        $    $           $    $  ANS013.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00c9;else if(((x&0x20)>>5)==0x01) y=@0100;else y=@0035;
  $  100.VIN码写入状态                       $    $           $    $  ANS013.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00c9;else if(((x&0x10)>>4)==0x01) y=@0100;else y=@0035;
  $  101.密钥数量                            $    $           $    $  ANS013.BYTE004  $  y=(x&0x0F);
  $  102.SK2锁定状态                         $    $           $    $  ANS014.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0052;else if(((x&0x80)>>7)==0x01) y=@0055;else y=@0035;
  $  103.SK2锁定状态                         $    $           $    $  ANS014.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00c9;else if(((x&0x40)>>6)==0x01) y=@0100;else y=@0035;
  $  104.氛围灯                              $    $           $    $  ANS015.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@016d;else y=@0035;
  $  105.背光输出                            $    $           $    $  ANS015.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  106.后备箱灯输出                        $    $           $    $  ANS015.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@016d;else y=@0035;
  $  107.内灯输出B                           $    $           $    $  ANS015.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  108.节电输出                            $    $           $    $  ANS015.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  109.喇叭输出                            $    $           $    $  ANS015.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  110.设防指示灯                          $    $           $    $  ANS015.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  111.中控锁指示灯                        $    $           $    $  ANS015.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  112.KL15                                $    $           $    $  ANS016.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  113.自适应巡航系统                      $    $           $    $  ANS016.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  114.起停开关有效位                      $    $           $    $  ANS016.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@0096;else if(((x&0x20)>>5)==0x01) y=@0119;else y=@0035;
  $  115.起停开关                            $    $           $    $  ANS016.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  116.点火开关有效位                      $    $           $    $  ANS016.BYTE005  $  if(((x&0x08)>>3)==0x00) y=@0096;else if(((x&0x08)>>3)==0x01) y=@0119;else y=@0035;
  $  117.点火开关                            $    $           $    $  ANS016.BYTE005  $  if((x&0x07)==0x00) y=@0c32;else if((x&0x07)==0x01) y=@0c33;else if((x&0x07)==0x02) y=@0464;else if((x&0x07)==0x03) y=@016e;else y=@0035;
  $  118.PEPS起停开关信号有效位              $    $           $    $  ANS016.BYTE006  $  if(((x&0x20)>>5)==0x00) y=@00bb;else if(((x&0x20)>>5)==0x01) y=@01df;else y=@0035;
  $  119.PEPE起停开关信号                    $    $           $    $  ANS016.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  120.PEPS密钥状态信号有效位              $    $           $    $  ANS016.BYTE006  $  if(((x&0x08)>>3)==0x00) y=@00bb;else if(((x&0x08)>>3)==0x01) y=@01df;else y=@0035;
  $  121.PEPS密钥状态信号                    $    $           $    $  ANS016.BYTE006  $  if((x&0x07)==0x00) y=@000f;else if((x&0x07)==0x01) y=@016c;else if((x&0x07)==0x02) y=@0464;else if((x&0x07)==0x03) y=@016e;else if((x&0x07)==0x07) y=@01df;else y=@0103;
  $  122.碰撞信号百分比                      $    $           $    $  ANS017.BYTE004  $  y=x;
  $  123.左转向灯故障信号百分比              $    $           $    $  ANS017.BYTE005  $  y=x;
  $  124.右转向灯故障信号百分比              $    $           $    $  ANS017.BYTE006  $  y=x;
  $  125.主驾门解锁                          $    $           $    $  ANS018.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  126.中控闭锁                            $    $           $    $  ANS018.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  127.中控解锁                            $    $           $    $  ANS018.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  128.充电枪解锁                          $    $           $    $  ANS018.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  129.油箱盖解锁                          $    $           $    $  ANS018.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  130.尾门解锁                            $    $           $    $  ANS018.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  131.前舱盖是否配置                      $    $           $    $  ANS019.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  132.前雾灯是否配置                      $    $           $    $  ANS019.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  133.位置灯超时强制熄灭配置              $    $           $    $  ANS019.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  134.后备箱灯是否配置                    $    $           $    $  ANS019.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  135.大灯配置                            $    $           $    $  ANS019.BYTE004  $  if(((x&0x0C)>>2)==0x00) y=@0c34;else if(((x&0x0C)>>2)==0x01) y=@0c35;else if(((x&0x0C)>>2)==0x02) y=@0c36;else if(((x&0x0C)>>2)==0x03) y=@0178;else y=@0035;
  $  136.位置灯熄灭配置                      $    $           $    $  ANS019.BYTE004  $  if((x&0x01)==0x00) y=@0c38;else if((x&0x01)==0x01) y=@0c39;else y=@0035;
  $  137.前雾灯辅助照明配置                  $    $           $    $  ANS019.BYTE005  $  if(((x&0xC0)>>6)==0x00) y=@0c49;else if(((x&0xC0)>>6)==0x01) y=@0c4a;else if(((x&0xC0)>>6)==0x02) y=@0c4b;else if(((x&0xC0)>>6)==0x03) y=@0178;else y=@0035;
  $  138.日行灯熄灭配置1                     $    $           $    $  ANS019.BYTE005  $  if(((x&0x20)>>5)==0x00) y=@0c49;else if(((x&0x20)>>5)==0x01) y=@0c4c;else y=@0035;
  $  139.背光灯默认亮度                      $    $           $    $  ANS019.BYTE005  $  if(((x&0x18)>>3)==0x00) y=@000f;else if(((x&0x18)>>3)==0x01) y=@0c4d;else if(((x&0x18)>>3)==0x02) y=@0c4e;else if(((x&0x18)>>3)==0x03) y=@0c4f;else y=@0035;
  $  140.氛围灯点亮时间                      $    $           $    $  ANS019.BYTE005  $  if(((x&0x06)>>1)==0x00) y=@000f;else if(((x&0x06)>>1)==0x01) y=@04fd;else if(((x&0x06)>>1)==0x02) y=@0c50;else if(((x&0x06)>>1)==0x03) y=@0503;else y=@0035;
  $  141.日行灯配置                          $    $           $    $  ANS019.BYTE005  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  142.转向灯类型配置                      $    $           $    $  ANS019.BYTE006  $  if(((x&0xC0)>>6)==0x00) y=@0c51;else if(((x&0xC0)>>6)==0x01) y=@0c52;else if(((x&0xC0)>>6)==0x02) y=@0c53;else if(((x&0xC0)>>6)==0x03) y=@0c54;else y=@0035;
  $  143.自动灯光判断配置                    $    $           $    $  ANS019.BYTE006  $  if(((x&0x30)>>4)==0x00) y=@0c55;else if(((x&0x30)>>4)==0x01) y=@0c56;else if(((x&0x30)>>4)==0x02) y=@0c57;else if(((x&0x30)>>4)==0x03) y=@0178;else y=@0035;
  $  144.照地灯配置                          $    $           $    $  ANS019.BYTE006  $  if(((x&0x0C)>>2)==0x00) y=@0c55;else if(((x&0x0C)>>2)==0x01) y=@0c46;else if(((x&0x0C)>>2)==0x02) y=@0c47;else if(((x&0x0C)>>2)==0x03) y=@0c48;else y=@0035;
  $  145.迎宾灯功能配置                      $    $           $    $  ANS019.BYTE006  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  146.解锁迎宾模式配置                    $    $           $    $  ANS019.BYTE007  $  if(((x&0x38)>>3)==0x00) y=@0cbd;else if(((x&0x38)>>3)==0x01) y=@0abd;else if(((x&0x38)>>3)==0x02) y=@0abe;else if(((x&0x38)>>3)==0x03) y=@0cbe;else if(((x&0x38)>>3)==0x04) y=@0c3c;else if(((x&0x38)>>3)==0x05) y=@0178;else if(((x&0x38)>>3)==0x06) y=@0179;else if(((x&0x38)>>3)==0x07) y=@017e;else y=@0035;
  $  147.闭锁迎宾模式配置                    $    $           $    $  ANS019.BYTE007  $  if((x&0x07)==0x00) y=@0cbd;else if((x&0x07)==0x01) y=@0abd;else if((x&0x07)==0x02) y=@0abe;else if((x&0x07)==0x03) y=@0cbe;else if((x&0x07)==0x04) y=@0c3c;else if((x&0x07)==0x05) y=@0178;else if((x&0x07)==0x06) y=@0179;else if((x&0x07)==0x07) y=@017e;else y=@0035;
  $  148.迎宾持续时间                        $    $  s        $    $  ANS019.BYTE008  $  y=x*0.5;
  $  149.刹车灯点亮百分比                    $    $  %        $    $  ANS019.BYTE011  $  y=((x&0xF0)>>4);
  $  150.刹车灯熄灭百分比                    $    $  %        $    $  ANS019.BYTE011  $  y=(x&0x0F);
  $  151.闭锁源1                             $    $           $    $  ANS020.BYTE004  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  152.闭锁源2                             $    $           $    $  ANS020.BYTE005  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  153.闭锁源3                             $    $           $    $  ANS020.BYTE006  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  154.闭锁源4                             $    $           $    $  ANS020.BYTE007  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  155.闭锁源5                             $    $           $    $  ANS020.BYTE008  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  156.闭锁源6                             $    $           $    $  ANS020.BYTE009  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  157.闭锁源7                             $    $           $    $  ANS020.BYTE010  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  158.闭锁源8                             $    $           $    $  ANS020.BYTE011  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  159.闭锁源9                             $    $           $    $  ANS020.BYTE012  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  160.闭锁源10                            $    $           $    $  ANS020.BYTE013  $  if(x==0x01) y=@0c58;else if(x==0x02) y=@0c0c;else if(x==0x03) y=@0c59;else if(x==0x04) y=@0c5a;else if(x==0x05) y=@0c5b;else if(x==0x06) y=@0c5c;else y=@0035;
  $  161.主解锁开关                          $    $           $    $  ANS021.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@0c42;else if(((x&0x02)>>1)==0x01) y=@0c43;else y=@0035;
  $  162.主闭锁开关                          $    $           $    $  ANS021.BYTE004  $  if((x&0x01)==0x00) y=@0c42;else if((x&0x01)==0x01) y=@0c43;else y=@0035;
  $  163.油箱盖解锁开关                      $    $           $    $  ANS021.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@0c42;else if(((x&0x04)>>2)==0x01) y=@0c43;else y=@0035;
  $  164.PEPS尾门解锁开关信号                $    $           $    $  ANS021.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@0c42;else if(((x&0x02)>>1)==0x01) y=@0c43;else y=@0035;
  $  165.尾门解锁开关                        $    $           $    $  ANS021.BYTE005  $  if((x&0x01)==0x00) y=@0c42;else if((x&0x01)==0x01) y=@0c43;else y=@0035;
  $  166.PAS锁住FB                           $    $           $    $  ANS021.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@0c42;else if(((x&0x10)>>4)==0x01) y=@0c43;else y=@0035;
  $  167.主驾门锁反馈                        $    $           $    $  ANS021.BYTE006  $  if((x&0x01)==0x00) y=@0c42;else if((x&0x01)==0x01) y=@0c43;else y=@0035;
  $  168.右后门开关                          $    $           $    $  ANS021.BYTE007  $  if(((x&0x40)>>6)==0x00) y=@0c42;else if(((x&0x40)>>6)==0x01) y=@0c43;else y=@0035;
  $  169.左后门开关                          $    $           $    $  ANS021.BYTE007  $  if(((x&0x10)>>4)==0x00) y=@0c42;else if(((x&0x10)>>4)==0x01) y=@0c43;else y=@0035;
  $  170.乘客门开关                          $    $           $    $  ANS021.BYTE007  $  if(((x&0x04)>>2)==0x00) y=@0c42;else if(((x&0x04)>>2)==0x01) y=@0c43;else y=@0035;
  $  171.驾驶门开关                          $    $           $    $  ANS021.BYTE007  $  if((x&0x01)==0x00) y=@0c42;else if((x&0x01)==0x01) y=@0c43;else y=@0035;
  $  172.引擎罩开关                          $    $           $    $  ANS021.BYTE008  $  if(((x&0x04)>>2)==0x00) y=@0c42;else if(((x&0x04)>>2)==0x01) y=@0c43;else y=@0035;
  $  173.后背门开关                          $    $           $    $  ANS021.BYTE008  $  if((x&0x01)==0x00) y=@0c42;else if((x&0x01)==0x01) y=@0c43;else y=@0035;
  $  174.行驶里程备份                        $    $  km       $    $  ANS022.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  175.照我回家配置                        $    $           $    $  ANS023.BYTE004  $  if(((x&0xE0)>>5)==0x00) y=@000f;else if(((x&0xE0)>>5)==0x01) y=@04fd;else if(((x&0xE0)>>5)==0x02) y=@0502;else if(((x&0xE0)>>5)==0x03) y=@0503;else if(((x&0xE0)>>5)==0x04) y=@0178;else if(((x&0xE0)>>5)==0x05) y=@0179;else if(((x&0xE0)>>5)==0x06) y=@017e;else if(((x&0xE0)>>5)==0x07) y=@0cc1;else y=@0035;
  $  176.闭锁反馈方式                        $    $           $    $  ANS023.BYTE004  $  if(((x&0x18)>>3)==0x00) y=@000f;else if(((x&0x18)>>3)==0x01) y=@0cc2;else if(((x&0x18)>>3)==0x02) y=@0505;else if(((x&0x18)>>3)==0x03) y=@0504;else y=@0035;
  $  177.驾驶模式记忆配置                    $    $           $    $  ANS023.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@0c44;else if(((x&0x04)>>2)==0x01) y=@0c45;else y=@0035;
  $  178.寻车功能持续时间                    $    $           $    $  ANS023.BYTE004  $  if((x&0x03)==0x00) y=@000f;else if((x&0x03)==0x01) y=@0c46;else if((x&0x03)==0x02) y=@0c47;else if((x&0x03)==0x03) y=@0c48;else y=@0035;
  $  179.寻车功能反馈方式                    $    $           $    $  ANS023.BYTE005  $  if(((x&0x80)>>7)==0x00) y=@0cc2;else if(((x&0x80)>>7)==0x01) y=@0c71;else y=@0035;
  $  180.解锁反馈方式                        $    $           $    $  ANS023.BYTE005  $  if(((x&0x60)>>5)==0x00) y=@000f;else if(((x&0x60)>>5)==0x01) y=@0cc2;else if(((x&0x60)>>5)==0x02) y=@0178;else if(((x&0x60)>>5)==0x03) y=@0179;else y=@0035;
  $  181.熄火解锁触发方式                    $    $           $    $  ANS023.BYTE005  $  if(((x&0x18)>>3)==0x00) y=@0494;else if(((x&0x18)>>3)==0x01) y=@0495;else if(((x&0x18)>>3)==0x02) y=@0526;else if(((x&0x18)>>3)==0x03) y=@0178;else y=@0035;
  $  182.自动解锁个性化菜单配置字            $    $           $    $  ANS023.BYTE005  $  if(((x&0x04)>>2)==0x00) y=@0cb4;else if(((x&0x04)>>2)==0x01) y=@0c0a;else y=@0035;
  $  183.遥控关天窗配置                      $    $           $    $  ANS023.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  184.遥控开天窗配置                      $    $           $    $  ANS023.BYTE005  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  185.PLG信号发送时间配置                 $    $  ms       $    $  ANS023.BYTE006  $  y=x*10;
  $  186.智能巡航开关                        $    $           $    $  ANS023.BYTE007  $  if(((x&0x80)>>7)==0x00) y=@01df;else if(((x&0x80)>>7)==0x01) y=@00bb;else y=@0035;
  $  187.巡航开关                            $    $           $    $  ANS023.BYTE007  $  if(((x&0x40)>>6)==0x00) y=@01df;else if(((x&0x40)>>6)==0x01) y=@00bb;else y=@0035;
  $  188.遥控升窗配置                        $    $           $    $  ANS023.BYTE007  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  189.遥控降窗配置                        $    $           $    $  ANS023.BYTE007  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  190.ECO/Sport配置                       $    $           $    $  ANS023.BYTE007  $  if(((x&0x0C)>>2)==0x00) y=@0c5e;else if(((x&0x0C)>>2)==0x01) y=@0cb5;else if(((x&0x0C)>>2)==0x02) y=@0cb6;else if(((x&0x0C)>>2)==0x03) y=@0178;else y=@0035;
  $  191.换挡器配置                          $    $           $    $  ANS023.BYTE007  $  if((x&0x03)==0x00) y=@0cb7;else if((x&0x03)==0x01) y=@0cb8;else if((x&0x03)==0x02) y=@0cb9;else if((x&0x03)==0x03) y=@0cba;else y=@0035;
  $  192.保养里程备份                        $    $  km       $    $  ANS024.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  193.软件版本日期                        $    $           $    $  ANS025.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  194.TBOX请求需认证配置                  $    $           $    $  ANS026.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  195.TBOX算法配置                        $    $           $    $  ANS026.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@0cbb;else if(((x&0x40)>>6)==0x01) y=@0c03;else y=@0035;
  $  196.TBOX控制车窗配置                    $    $           $    $  ANS026.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@00b9;else if(((x&0x20)>>5)==0x01) y=@00ba;else y=@0035;
  $  197.TBOX远程启动功能配置                $    $           $    $  ANS026.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  198.TBOX远程钥匙管理功能                $    $           $    $  ANS026.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@00b9;else if(((x&0x08)>>3)==0x01) y=@00ba;else y=@0035;
  $  199.TBOX远程寻车功能配置                $    $           $    $  ANS026.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@00b9;else if(((x&0x04)>>2)==0x01) y=@00ba;else y=@0035;
  $  200.TBOX远程解闭锁控制功能配置字        $    $           $    $  ANS026.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@00b9;else if(((x&0x02)>>1)==0x01) y=@00ba;else y=@0035;
  $  201.TBOX功能配置字                      $    $           $    $  ANS026.BYTE004  $  if((x&0x01)==0x00) y=@00b9;else if((x&0x01)==0x01) y=@00ba;else y=@0035;
  $  202.BCM允许重复发送认证的最大次数       $    $           $    $  ANS026.BYTE005  $  if(((x&0xC0)>>6)==0x00) y=@09e1;else if(((x&0xC0)>>6)==0x01) y=@0c84;else if(((x&0xC0)>>6)==0x02) y=@0c85;else if(((x&0xC0)>>6)==0x03) y=@0c86;else y=@0035;
  $  203.BCM允许认证失败次数                 $    $           $    $  ANS026.BYTE005  $  if(((x&0x30)>>4)==0x00) y=@09e1;else if(((x&0x30)>>4)==0x01) y=@0c84;else if(((x&0x30)>>4)==0x02) y=@0c85;else if(((x&0x30)>>4)==0x03) y=@0c86;else y=@0035;
  $  204.等待TBOX最长响应时间                $    $  s        $    $  ANS026.BYTE005  $  y=(x&0x0F);
  $  205.温度补偿误差阈值                    $    $  kPa      $    $  ANS027.BYTE004  $  y=x;
  $  206.胎压地区配置字                      $    $           $    $  ANS027.BYTE005  $  if((x&0x03)==0x00) y=@0c87;else if((x&0x03)==0x01) y=@0c88;else if((x&0x03)==0x02) y=@0c89;else if((x&0x03)==0x03) y=@0178;else y=@0035;
  $  207.高压报警使能配置字                  $    $           $    $  ANS027.BYTE006  $  if(((x&0x80)>>7)==0x00) y=@00db;else if(((x&0x80)>>7)==0x01) y=@00dc;else y=@0035;
  $  208.高压报警阈值配置                    $    $  kPa      $    $  ANS027.BYTE006  $  y=(x&0x7F)*2.75+440;
  $  209.前轮标准冷态胎压值配置              $    $  kPa      $    $  ANS027.BYTE007  $  y=x*2.75;
  $  210.后轮标准冷态胎压值配置              $    $  kPa      $    $  ANS027.BYTE008  $  y=x*2.75;
  $  211.变速器档位信号                      $    $           $    $  ANS028.BYTE004  $  if((x&0x0F)==0x00) y=@0c8a;else if((x&0x0F)==0x01) y=@0003;else if((x&0x0F)==0x02) y=@029b;else if((x&0x0F)==0x03) y=@0001;else if((x&0x0F)==0x04) y=@0c22;else if((x&0x0F)==0x05) y=@0c23;else if((x&0x0F)==0x06) y=@0c24;else if((x&0x0F)==0x07) y=@0c25;else if((x&0x0F)==0x08) y=@0c26;else if((x&0x0F)==0x09) y=@0c27;else if((x&0x0F)==0x0A) y=@0c28;else if((x&0x0F)==0x0B) y=@0c29;else if((x&0x0F)==0x0F) y=@0c2a;else y=@0103;
  $  212.解锁源1                             $    $           $    $  ANS029.BYTE004  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  213.解锁源2                             $    $           $    $  ANS029.BYTE005  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  214.解锁源3                             $    $           $    $  ANS029.BYTE006  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  215.解锁源4                             $    $           $    $  ANS029.BYTE007  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  216.解锁源5                             $    $           $    $  ANS029.BYTE008  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  217.解锁源6                             $    $           $    $  ANS029.BYTE009  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  218.解锁源7                             $    $           $    $  ANS029.BYTE010  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  219.解锁源8                             $    $           $    $  ANS029.BYTE011  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  220.解锁源9                             $    $           $    $  ANS029.BYTE012  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  221.解锁源10                            $    $           $    $  ANS029.BYTE013  $  if(x==0x01) y=@0c95;else if(x==0x02) y=@0c06;else if(x==0x03) y=@0c07;else if(x==0x04) y=@0c96;else if(x==0x05) y=@0c97;else if(x==0x06) y=@0c0a;else y=@0035;
  $  222.车速                                $    $  km/h     $    $  ANS030.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  223.车辆速度状态                        $    $           $    $  ANS030.BYTE006  $  if(x==0x00) y=@00bb;else if(x==0x01) y=@01df;else y=@0035;
  $  224.后喷水电机输出                      $    $           $    $  ANS031.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  225.后雨刮低速输出                      $    $           $    $  ANS031.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  226.前喷水电机输出                      $    $           $    $  ANS031.BYTE005  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  227.前雨刮高速输出                      $    $           $    $  ANS031.BYTE005  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  228.前雨刮低速输出                      $    $           $    $  ANS031.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  229.唤醒源存储器1                       $    $           $    $  ANS032.BYTE004  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  230.唤醒源存储器2                       $    $           $    $  ANS032.BYTE005  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  231.唤醒源存储器3                       $    $           $    $  ANS032.BYTE006  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  232.唤醒源存储器4                       $    $           $    $  ANS032.BYTE007  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  233.唤醒源存储器5                       $    $           $    $  ANS032.BYTE008  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  234.唤醒源存储器6                       $    $           $    $  ANS032.BYTE009  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  235.唤醒源存储器7                       $    $           $    $  ANS032.BYTE010  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  236.唤醒源存储器8                       $    $           $    $  ANS032.BYTE011  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  237.唤醒源存储器9                       $    $           $    $  ANS032.BYTE012  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  238.唤醒源存储器10                      $    $           $    $  ANS032.BYTE013  $  if(x==0x00) y=@0c98;else if(x==0x01) y=@0c99;else if(x==0x02) y=@0c9a;else if(x==0x03) y=@0c9b;else if(x==0x04) y=@0c9c;else if(x==0x05) y=@0c9d;else if(x==0x06) y=@0c9e;else if(x==0x10) y=@0c9f;else if(x==0x11) y=@0ca0;else if(x==0x12) y=@0ca1;else if(x==0x20) y=@0ca2;else if(x==0x21) y=@0ca3;else if(x==0x22) y=@0ca4;else if(x==0x23) y=@0ca5;else if(x==0x24) y=@0ca6;else if(x==0x30) y=@0ca7;else if(x==0x31) y=@0ca8;else if(x==0x32) y=@0ca9;else if(x==0x33) y=@0caa;else if(x==0x40) y=@0cab;else if(x==0x41) y=@0cac;else if(x==0x50) y=@0cad;else if(x==0x52) y=@0c1d;else if(x==0x54) y=@0cae;else if(x==0x57) y=@0c1f;else y=@0035;
  $  239.前雨刮自动配置                      $    $           $    $  ANS033.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@00b9;else if(((x&0x80)>>7)==0x01) y=@00ba;else y=@0035;
  $  240.后雨刮有无配置                      $    $           $    $  ANS033.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@00b9;else if(((x&0x40)>>6)==0x01) y=@00ba;else y=@0035;
  $  241.背光灯是否可调节                    $    $           $    $  ANS033.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@00b9;else if(((x&0x10)>>4)==0x01) y=@00ba;else y=@0035;
  $  242.前雨刮前洗涤开关有效接合时间        $    $  s        $    $  ANS033.BYTE005  $  y=x*0.1;
  $  243.雨刮堵转判断时间                    $    $  s        $    $  ANS033.BYTE006  $  y=x;
  $  244.后雨刮前洗涤开关有效接合时间        $    $  s        $    $  ANS033.BYTE007  $  y=x*0.1;
  $  245.前雨刮归位信号                      $    $           $    $  ANS034.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  246.前洗涤开关                          $    $           $    $  ANS034.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@016d;else y=@0035;
  $  247.前雨刮点动开关                      $    $           $    $  ANS034.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@016d;else y=@0035;
  $  248.前雨刮高速开关                      $    $           $    $  ANS034.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@016d;else y=@0035;
  $  249.前雨刮低速开关                      $    $           $    $  ANS034.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  250.前雨刮灵敏度(间歇档位)              $    $           $    $  ANS034.BYTE005  $  if(((x&0xF0)>>4)==0x00) y=@0caf;else if(((x&0xF0)>>4)==0x01) y=@0cb0;else if(((x&0xF0)>>4)==0x02) y=@0cb1;else if(((x&0xF0)>>4)==0x03) y=@0cb2;else if(((x&0xF0)>>4)==0x04) y=@0cb3;else y=@0035;
  $  251.前雨刮间歇/自动开关                 $    $           $    $  ANS034.BYTE005  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  252.后雨刮归位信号                      $    $           $    $  ANS034.BYTE006  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  253.后洗涤开关                          $    $           $    $  ANS034.BYTE006  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@016d;else y=@0035;
  $  254.后雨刮低速开关                      $    $           $    $  ANS034.BYTE006  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;
  $  255.自动雨刮高速请求                    $    $           $    $  ANS034.BYTE008  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@016d;else y=@0035;
  $  256.自动雨刮低速请求                    $    $           $    $  ANS034.BYTE008  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@016d;else y=@0035;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:701 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
