
    车型ID：10b2

    模拟：协议模拟-->10b2

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:701 02 10 01 00 00 00 00 00       $~  ANS000:781 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:701 02 3E 80 00 00 00 00 00       $!  ANS000:781 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:701 03 19 02 09 00 00 00 00       $#  ANS000:781 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/af000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:701 04 14 FF FF FF 00 00 00       $$  ANS000:781 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:701 03 22 F1 A0 00 00 00 00       $%  ANS000:781 03 22 F1 A0 00 00 00 00
  $%  REQ001:701 03 22 F1 83 00 00 00 00       $%  ANS001:781 03 22 F1 83 00 00 00 00
  $%  REQ002:701 03 22 F1 91 00 00 00 00       $%  ANS002:781 03 22 F1 91 00 00 00 00
  $%  REQ003:701 03 22 F1 8B 00 00 00 00       $%  ANS003:781 03 22 F1 8B 00 00 00 00
  $%  REQ004:701 03 22 F1 A2 00 00 00 00       $%  ANS004:781 03 22 F1 A2 00 00 00 00
  $%  REQ005:701 03 22 F1 87 00 00 00 00       $%  ANS005:781 03 22 F1 87 00 00 00 00
  $%  REQ006:701 03 22 F1 10 00 00 00 00       $%  ANS006:781 03 22 F1 10 00 00 00 00
  $%  REQ007:701 03 22 F1 92 00 00 00 00       $%  ANS007:781 03 22 F1 92 00 00 00 00
  $%  REQ008:701 03 22 F1 8C 00 00 00 00       $%  ANS008:781 03 22 F1 8C 00 00 00 00
  $%  REQ009:701 03 22 F1 94 00 00 00 00       $%  ANS009:781 03 22 F1 94 00 00 00 00
  $%  REQ010:701 03 22 F1 8A 00 00 00 00       $%  ANS010:781 03 22 F1 8A 00 00 00 00
  $%  REQ011:701 03 22 F1 90 00 00 00 00       $%  ANS011:781 03 22 F1 90 00 00 00 00
  $%  REQ012:701 03 22 F1 A8 00 00 00 00       $%  ANS012:781 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:年:                              $%    $%  ANS003.BYTE004  $%  HEX(X1);
  $%  004:月:                              $%    $%  ANS003.BYTE005  $%  HEX(X1);
  $%  005:日:                              $%    $%  ANS003.BYTE006  $%  HEX(X1);
  $%  006:电控单元网络软件号:              $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次):                  $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  014:系统供应商标识号:                $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6);
  $%  015:车辆识别代码:                    $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  016:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:701 03 22 D1 19 00 00 00 00       $  ANS000:781 03 22 D1 19 00 00 00 00
  $  REQ001:701 03 22 C1 04 00 00 00 00       $  ANS001:781 03 22 C1 04 00 00 00 00
  $  REQ002:701 03 22 D1 05 00 00 00 00       $  ANS002:781 03 22 D1 05 00 00 00 00
  $  REQ003:701 03 22 C1 01 00 00 00 00       $  ANS003:781 03 22 C1 01 00 00 00 00
  $  REQ004:701 03 22 E0 1A 00 00 00 00       $  ANS004:781 03 22 E0 1A 00 00 00 00
  $  REQ005:701 03 22 C1 06 00 00 00 00       $  ANS005:781 03 22 C1 06 00 00 00 00
  $  REQ006:701 03 22 C1 08 00 00 00 00       $  ANS006:781 03 22 C1 08 00 00 00 00
  $  REQ007:701 03 22 E0 1E 00 00 00 00       $  ANS007:781 03 22 E0 1E 00 00 00 00
  $  REQ008:701 03 22 CF 10 00 00 00 00       $  ANS008:781 03 22 CF 10 00 00 00 00
  $  REQ009:701 03 22 D1 10 00 00 00 00       $  ANS009:781 03 22 D1 10 00 00 00 00
  $  REQ010:701 03 22 D1 11 00 00 00 00       $  ANS010:781 03 22 D1 11 00 00 00 00
  $  REQ011:701 03 22 E0 18 00 00 00 00       $  ANS011:781 03 22 E0 18 00 00 00 00
  $  REQ012:701 03 22 D1 02 00 00 00 00       $  ANS012:781 03 22 D1 02 00 00 00 00
  $  REQ013:701 03 22 D3 10 00 00 00 00       $  ANS013:781 03 22 D3 10 00 00 00 00
  $  REQ014:701 03 22 D3 13 00 00 00 00       $  ANS014:781 03 22 D3 13 00 00 00 00
  $  REQ015:701 03 22 D1 13 00 00 00 00       $  ANS015:781 03 22 D1 13 00 00 00 00
  $  REQ016:701 03 22 D1 01 00 00 00 00       $  ANS016:781 03 22 D1 01 00 00 00 00
  $  REQ017:701 03 22 D0 01 00 00 00 00       $  ANS017:781 03 22 D0 01 00 00 00 00
  $  REQ018:701 03 22 D1 06 00 00 00 00       $  ANS018:781 03 22 D1 06 00 00 00 00
  $  REQ019:701 03 22 D1 17 00 00 00 00       $  ANS019:781 03 22 D1 17 00 00 00 00
  $  REQ020:701 03 22 C1 02 00 00 00 00       $  ANS020:781 03 22 C1 02 00 00 00 00
  $  REQ021:701 03 22 62 05 00 00 00 00       $  ANS021:781 03 22 62 05 00 00 00 00
  $  REQ022:701 03 22 D1 03 00 00 00 00       $  ANS022:781 03 22 D1 03 00 00 00 00
  $  REQ023:701 03 22 E0 1B 00 00 00 00       $  ANS023:781 03 22 E0 1B 00 00 00 00
  $  REQ024:701 03 22 E1 01 00 00 00 00       $  ANS024:781 03 22 E1 01 00 00 00 00
  $  REQ025:701 03 22 C1 05 00 00 00 00       $  ANS025:781 03 22 C1 05 00 00 00 00
  $  REQ026:701 03 22 E0 1C 00 00 00 00       $  ANS026:781 03 22 E0 1C 00 00 00 00
  $  REQ027:701 03 22 E2 11 00 00 00 00       $  ANS027:781 03 22 E2 11 00 00 00 00
  $  REQ028:701 03 22 01 12 00 00 00 00       $  ANS028:781 03 22 01 12 00 00 00 00
  $  REQ029:701 03 22 C1 07 00 00 00 00       $  ANS029:781 03 22 C1 07 00 00 00 00
  $  REQ030:701 03 22 C1 09 00 00 00 00       $  ANS030:781 03 22 C1 09 00 00 00 00
  $  REQ031:701 03 22 D3 02 00 00 00 00       $  ANS031:781 03 22 D3 02 00 00 00 00
  $  REQ032:701 03 22 62 06 00 00 00 00       $  ANS032:781 03 22 62 06 00 00 00 00
  $  REQ033:701 03 22 E0 17 00 00 00 00       $  ANS033:781 03 22 E0 17 00 00 00 00
  $  REQ034:701 03 22 D1 15 00 00 00 00       $  ANS034:781 03 22 D1 15 00 00 00 00
  $  REQ035:701 03 22 62 04 00 00 00 00       $  ANS035:781 03 22 62 04 00 00 00 00
  $  REQ036:701 03 22 C1 03 00 00 00 00       $  ANS036:781 03 22 C1 03 00 00 00 00
  $  REQ037:701 03 22 D1 04 00 00 00 00       $  ANS037:781 03 22 D1 04 00 00 00 00

  $  000.KLR 唤醒输出                        $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  001.TCU唤醒输出                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  002.B+ 唤醒输出                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  003.EMS唤醒输出                         $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  004.P档解锁输出                         $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  005.KL15继电器                          $    $           $    $  ANS000.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  006.KLR继电器                           $    $           $    $  ANS000.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  007.车速自动闭锁配置                    $    $           $    $  ANS001.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  008.后风窗加热配置                      $    $           $    $  ANS001.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  009.RKE主驾单独解锁配置                 $    $           $    $  ANS001.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  010.尾门配置                            $    $           $    $  ANS001.BYTE004  $  if(((x&0x18)>>3)==0) y=@0112;else if(((x&0x18)>>3)==1) y=@016d;else if(((x&0x18)>>3)==2) y=@000f;else y=@0035;
  $  011.P档解锁有无配置                     $    $           $    $  ANS001.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  012.后视镜折叠有无配置                  $    $           $    $  ANS001.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  013.PKE主驾单独解锁配置                 $    $           $    $  ANS001.BYTE004  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  014.左后门配置                          $    $           $    $  ANS001.BYTE005  $  if(((x&0xC0)>>6)==0) y=@0112;else if(((x&0xC0)>>6)==1) y=@0ef3;else if(((x&0xC0)>>6)==2) y=@0ef4;else y=@0035;
  $  015.右后门配置                          $    $           $    $  ANS001.BYTE005  $  if(((x&0x30)>>4)==0) y=@0112;else if(((x&0x30)>>4)==1) y=@0ef3;else if(((x&0x30)>>4)==2) y=@0ef4;else y=@0035;
  $  016.慢充电子锁                          $    $           $    $  ANS001.BYTE005  $  if(((x&0x04)>>2)==0) y=@01df;else if(((x&0x04)>>2)==1) y=@00bb;else y=@0035;
  $  017.油箱盖解锁配置                      $    $           $    $  ANS001.BYTE005  $  if((x&0x03)==0) y=@0c5e;else if((x&0x03)==1) y=@0c5f;else if((x&0x03)==2) y=@0c60;else if((x&0x03)==3) y=@0cd5;else y=@0035;
  $  018.锁电机热保护时间                    $    $  s        $    $  ANS001.BYTE006  $  y=x;
  $  019.自动重上锁计时时间                  $    $  s        $    $  ANS001.BYTE007  $  y=x;
  $  020.后视镜折叠                          $    $           $    $  ANS002.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  021.ECO/SPORT开关                       $    $           $    $  ANS002.BYTE006  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0cc3;else if(((x&0x30)>>4)==2) y=@0252;else if(((x&0x30)>>4)==3) y=@0035;else y=@0035;
  $  022.ACC/CC巡航开关                      $    $           $    $  ANS002.BYTE006  $  if((x&0x0F)==1) y=@0c62;else if((x&0x0F)==2) y=@0c63;else if((x&0x0F)==3) y=@0c64;else if((x&0x0F)==4) y=@0c65;else if((x&0x0F)==5) y=@0c66;else if((x&0x0F)==6) y=@0c67;else if((x&0x0F)==7) y=@0c68;else y=@0103;
  $  023.M档位                               $    $           $    $  ANS002.BYTE007  $  if(((x&0x30)>>4)==0) y=@0cc4;else if(((x&0x30)>>4)==1) y=@0cc4;else if(((x&0x30)>>4)==2) y=@0cc4;else if(((x&0x30)>>4)==3) y=@0035;else y=@0035;
  $  024.PRND                                $    $           $    $  ANS002.BYTE007  $  if((x&0x0F)==0) y=@0ef5;else if((x&0x0F)==1) y=@0187;else if((x&0x0F)==2) y=@0c6b;else if((x&0x0F)==4) y=@0c6c;else if((x&0x0F)==8) y=@0c6d;else y=@0103;
  $  025.配RKE数量                           $    $           $    $  ANS003.BYTE004  $  if(((x&0xF0)>>4)==0) y=@04d4;else if(((x&0xF0)>>4)==1) y=@04d3;else if(((x&0xF0)>>4)==2) y=@0169;else if(((x&0xF0)>>4)==3) y=@016b;else if(((x&0xF0)>>4)==4) y=@0523;else y=@0035;
  $  026.负载管理模式                        $    $           $    $  ANS003.BYTE004  $  if(((x&0x0C)>>2)==0) y=@00d2;else if(((x&0x0C)>>2)==1) y=@0524;else if(((x&0x0C)>>2)==2) y=@01d2;else y=@0035;
  $  027.生产运行周期                        $    $           $    $  ANS003.BYTE004  $  if((x&0x03)==0) y=@0c7a;else if((x&0x03)==1) y=@0c7b;else if((x&0x03)==2) y=@0c7c;else if((x&0x03)==3) y=@0c7d;else y=@0035;
  $  028.TCU是否配置                         $    $           $    $  ANS003.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  029.PEPS是否配置                        $    $           $    $  ANS003.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  030.IMMO是否配置                        $    $           $    $  ANS003.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  031.左舵或右舵设置                      $    $           $    $  ANS003.BYTE005  $  if(((x&0x10)>>4)==0) y=@0510;else if(((x&0x10)>>4)==1) y=@050f;else y=@0035;
  $  032.车辆类型设置                        $    $           $    $  ANS003.BYTE005  $  y=(x&0x0F);
  $  033.ABS是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  034.ESP是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  035.IPK是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  036.EMS是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  037.SAS是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x08)>>3)==0) y=@00b9;else if(((x&0x08)>>3)==1) y=@00ba;else y=@0035;
  $  038.SRS是否配置                         $    $           $    $  ANS003.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  039.FICM是否配置                        $    $           $    $  ANS003.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  040.电动尾门是否配置                    $    $           $    $  ANS003.BYTE006  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  041.转向变道灯开关滤波时间              $    $           $    $  ANS003.BYTE007  $  if(((x&0xC0)>>6)==0) y=@0539;else if(((x&0xC0)>>6)==1) y=@053a;else if(((x&0xC0)>>6)==2) y=@053b;else if(((x&0xC0)>>6)==3) y=@0c83;else y=@0035;
  $  042.VCU是否配置                         $    $           $    $  ANS003.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  043.TPMS是否配置                        $    $           $    $  ANS003.BYTE007  $  if(((x&0x06)>>1)==0) y=@00b9;else if(((x&0x06)>>1)==1) y=@00ba;else if(((x&0x06)>>1)==2) y=@0c6e;else if(((x&0x06)>>1)==3) y=@0c6f;else y=@0035;
  $  044.RFA是否配置                         $    $           $    $  ANS003.BYTE007  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  045.当前已学习遥控钥匙数量              $    $           $    $  ANS004.BYTE004  $  y=x;
  $  046.DDD配置                             $    $           $    $  ANS005.BYTE007  $  if((x&0x01)==0) y=@01df;else if((x&0x01)==1) y=@00bb;else y=@0035;
  $  047.照我回家配置                        $    $           $    $  ANS006.BYTE004  $  if(((x&0xE0)>>5)==0) y=@000f;else if(((x&0xE0)>>5)==1) y=@04fd;else if(((x&0xE0)>>5)==2) y=@0502;else if(((x&0xE0)>>5)==3) y=@0503;else y=@0035;
  $  048.寻车功能反馈方式                    $    $           $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0) y=@0cc2;else if(((x&0x80)>>7)==1) y=@0c71;else y=@0035;
  $  049.自动解锁默认配置                    $    $           $    $  ANS006.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  050.氛围灯使能默认配置                  $    $           $    $  ANS006.BYTE004  $  if(((x&0x0C)>>2)==0) y=@00b9;else if(((x&0x0C)>>2)==1) y=@00ba;else if(((x&0x0C)>>2)==2) y=@0c37;else if(((x&0x0C)>>2)==3) y=@0c3d;else y=@0035;
  $  051.RKE主驾单独解锁配置                 $    $           $    $  ANS006.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  052.PKE主驾单独解锁配置                 $    $           $    $  ANS006.BYTE004  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  053.车速闭锁默认配置                    $    $           $    $  ANS006.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  054.闭锁反馈方式                        $    $           $    $  ANS006.BYTE004  $  if(((x&0x18)>>3)==0) y=@000f;else if(((x&0x18)>>3)==1) y=@0cc2;else if(((x&0x18)>>3)==2) y=@0505;else if(((x&0x18)>>3)==3) y=@0504;else y=@0035;
  $  055.照地灯时间默认配置                  $    $           $    $  ANS006.BYTE006  $  if(((x&0x60)>>5)==0) y=@0c72;else if(((x&0x60)>>5)==1) y=@0c46;else if(((x&0x60)>>5)==2) y=@0c47;else if(((x&0x60)>>5)==3) y=@0c48;else y=@0035;
  $  056.后视镜折叠                          $    $           $    $  ANS006.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  057.解锁迎宾模式配置                    $    $           $    $  ANS006.BYTE007  $  if(((x&0x38)>>3)==0) y=@0c3a;else if(((x&0x38)>>3)==1) y=@0abd;else if(((x&0x38)>>3)==2) y=@0abe;else if(((x&0x38)>>3)==3) y=@0c3b;else if(((x&0x38)>>3)==4) y=@0c3c;else if(((x&0x38)>>3)==5) y=@0da3;else if(((x&0x38)>>3)==6) y=@0da4;else if(((x&0x38)>>3)==7) y=@0da5;else y=@0035;
  $  058.闭锁迎宾模式配置                    $    $           $    $  ANS006.BYTE007  $  if((x&0x07)==0) y=@0c3a;else if((x&0x07)==1) y=@0abd;else if((x&0x07)==2) y=@0abe;else if((x&0x07)==3) y=@0c3b;else if((x&0x07)==4) y=@0c3c;else if((x&0x07)==5) y=@0da3;else if((x&0x07)==6) y=@0da4;else if((x&0x07)==7) y=@0da5;else y=@0035;
  $  059.PWM调光                             $    $           $    $  ANS007.BYTE004  $  y=x;
  $  060.ECU PIN(在IMMO锁住之前)             $    $           $    $  ANS008.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  061.右远光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  062.左远光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@016d;else y=@0035;
  $  063.右近光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  064.左近光灯输出                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  065.右转向灯输出                        $    $           $    $  ANS009.BYTE005  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  066.左转向灯输出                        $    $           $    $  ANS009.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  067.位置灯输出                          $    $           $    $  ANS009.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  068.右日行灯输出                        $    $           $    $  ANS010.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  069.左日行灯输出                        $    $           $    $  ANS010.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  070.后雾灯输出                          $    $           $    $  ANS010.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  071.照地灯                              $    $           $    $  ANS010.BYTE005  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  072.倒车灯输出                          $    $           $    $  ANS010.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  073.高位制动灯+刹车灯输出B              $    $           $    $  ANS010.BYTE005  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  074.刹车灯输出A                         $    $           $    $  ANS010.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  075.发动机运行状态                      $    $           $    $  ANS011.BYTE004  $  if(x==0) y=@018e;else if(x==1) y=@0011;else y=@0035;
  $  076.超车灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  077.远光灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  078.位置灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  079.自动灯开关                          $    $           $    $  ANS012.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  080.近光灯开关                          $    $           $    $  ANS012.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  081.危险报警灯开关                      $    $           $    $  ANS012.BYTE005  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@016d;else y=@0035;
  $  082.左转向灯开关                        $    $           $    $  ANS012.BYTE005  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  083.右转向灯开关                        $    $           $    $  ANS012.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  084.后雾灯开关                          $    $           $    $  ANS012.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  085.前雾灯开关                          $    $           $    $  ANS012.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  086.倒车灯开关                          $    $           $    $  ANS012.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  087.刹车灯开关                          $    $           $    $  ANS012.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  088.RLS点亮近光灯请求                   $    $           $    $  ANS012.BYTE008  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  089.RLS点亮位置灯请求                   $    $           $    $  ANS012.BYTE008  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  090.背光灯调节+开关                     $    $           $    $  ANS012.BYTE010  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  091.AEB指示灯开关                       $    $           $    $  ANS012.BYTE010  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  092.自动灯光阈值                        $    $  V        $    $  ANS012.BYTE007  $  y=x*0.05;
  $  093.IMMO锁定状态                        $    $           $    $  ANS013.BYTE004  $  if(((x&0x80)>>7)==0) y=@0052;else if(((x&0x80)>>7)==1) y=@0055;else y=@0035;
  $  094.PIN写入状态                         $    $           $    $  ANS013.BYTE004  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@0100;else y=@0035;
  $  095.密钥写入状态                        $    $           $    $  ANS013.BYTE004  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@0100;else y=@0035;
  $  096.VIN码写入状态                       $    $           $    $  ANS013.BYTE004  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@0100;else y=@0035;
  $  097.密钥数量                            $    $           $    $  ANS013.BYTE004  $  y=(x&0x0F);
  $  098.SK2锁定状态                         $    $           $    $  ANS014.BYTE004  $  if(((x&0x80)>>7)==0) y=@0052;else if(((x&0x80)>>7)==1) y=@0055;else y=@0035;
  $  099.SK2写入状态                         $    $           $    $  ANS014.BYTE004  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@0100;else y=@0035;
  $  100.氛围灯                              $    $           $    $  ANS015.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  101.背光输出                            $    $           $    $  ANS015.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  102.后备箱灯输出                        $    $           $    $  ANS015.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  103.内灯输出B                           $    $           $    $  ANS015.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  104.节电输出                            $    $           $    $  ANS015.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  105.喇叭输出                            $    $           $    $  ANS015.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  106.设防指示灯                          $    $           $    $  ANS015.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  107.中控锁指示灯                        $    $           $    $  ANS015.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  108.KL15                                $    $           $    $  ANS016.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  109.自适应巡航系统                      $    $           $    $  ANS016.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  110.起停开关有效位                      $    $           $    $  ANS016.BYTE005  $  if(((x&0x20)>>5)==0) y=@0096;else if(((x&0x20)>>5)==1) y=@0119;else y=@0035;
  $  111.起停开关                            $    $           $    $  ANS016.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  112.点火开关有效位                      $    $           $    $  ANS016.BYTE005  $  if(((x&0x08)>>3)==0) y=@0096;else if(((x&0x08)>>3)==1) y=@0119;else y=@0035;
  $  113.点火开关                            $    $           $    $  ANS016.BYTE005  $  if((x&0x07)==0) y=@0c32;else if((x&0x07)==1) y=@0c33;else if((x&0x07)==2) y=@0464;else if((x&0x07)==3) y=@016e;else y=@0035;
  $  114.PEPS起停开关信号有效位              $    $           $    $  ANS016.BYTE006  $  if(((x&0x20)>>5)==0) y=@00bb;else if(((x&0x20)>>5)==1) y=@01df;else y=@0035;
  $  115.PEPE起停开关信号                    $    $           $    $  ANS016.BYTE006  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  116.PEPS密钥状态信号有效位              $    $           $    $  ANS016.BYTE006  $  if(((x&0x08)>>3)==0) y=@00bb;else if(((x&0x08)>>3)==1) y=@01df;else y=@0035;
  $  117.PEPS密钥状态信号                    $    $           $    $  ANS016.BYTE006  $  if((x&0x07)==0) y=@000f;else if((x&0x07)==1) y=@016c;else if((x&0x07)==2) y=@0464;else if((x&0x07)==3) y=@016e;else if((x&0x07)==7) y=@01df;else y=@0103;
  $  118.全局KL.50状态                       $    $           $    $  ANS017.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  119.全局发动机运行状态                  $    $           $    $  ANS017.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@016d;else y=@0035;
  $  120.全局 KL.15 状态                     $    $           $    $  ANS017.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  121.全局KL.R状态                        $    $           $    $  ANS017.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  122.系统KL.50状态                       $    $           $    $  ANS017.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  123.全局发动机运行状态                  $    $           $    $  ANS017.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  124.系统KL.15状态                       $    $           $    $  ANS017.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  125.系统KL.R状态                        $    $           $    $  ANS017.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  126.碰撞信号百分比                      $    $           $    $  ANS018.BYTE004  $  y=x;
  $  127.PDC信号百分比                       $    $           $    $  ANS018.BYTE005  $  y=x;
  $  128.主驾门解锁                          $    $           $    $  ANS019.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  129.中控闭锁                            $    $           $    $  ANS019.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  130.中控解锁                            $    $           $    $  ANS019.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  131.D20加油盖单独解锁                   $    $           $    $  ANS019.BYTE005  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  132.充电枪解锁                          $    $           $    $  ANS019.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  133.D20加油盖单独闭锁                   $    $           $    $  ANS019.BYTE005  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  134.油箱盖解锁                          $    $           $    $  ANS019.BYTE005  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  135.尾门解锁                            $    $           $    $  ANS019.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  136.前舱盖是否配置                      $    $           $    $  ANS020.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  137.前雾灯是否配置                      $    $           $    $  ANS020.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  138.位置灯超时强制熄灭配置              $    $           $    $  ANS020.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  139.后备箱灯是否配置                    $    $           $    $  ANS020.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  140.大灯配置                            $    $           $    $  ANS020.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0c34;else if(((x&0x0C)>>2)==1) y=@0c35;else if(((x&0x0C)>>2)==2) y=@0c36;else y=@0035;
  $  141.位置灯熄灭配置                      $    $           $    $  ANS020.BYTE004  $  if((x&0x01)==0) y=@0c38;else if((x&0x01)==1) y=@0c39;else y=@0035;
  $  142.前雾灯辅助照明配置                  $    $           $    $  ANS020.BYTE005  $  if(((x&0xC0)>>6)==0) y=@0112;else if(((x&0xC0)>>6)==1) y=@0c4a;else if(((x&0xC0)>>6)==2) y=@0c4b;else y=@0035;
  $  143.日行灯熄灭配置1                     $    $           $    $  ANS020.BYTE005  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0c4c;else y=@0035;
  $  144.背光灯默认亮度                      $    $           $    $  ANS020.BYTE005  $  if(((x&0x18)>>3)==0) y=@000f;else if(((x&0x18)>>3)==1) y=@0c4d;else if(((x&0x18)>>3)==2) y=@0c4e;else if(((x&0x18)>>3)==3) y=@0c4f;else y=@0035;
  $  145.氛围灯点亮时间                      $    $           $    $  ANS020.BYTE005  $  if(((x&0x06)>>1)==0) y=@000f;else if(((x&0x06)>>1)==1) y=@04fd;else if(((x&0x06)>>1)==2) y=@0c50;else if(((x&0x06)>>1)==3) y=@0503;else y=@0035;
  $  146.日行灯配置                          $    $           $    $  ANS020.BYTE005  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  147.转向灯类型配置                      $    $           $    $  ANS020.BYTE006  $  if(((x&0xC0)>>6)==0) y=@0c51;else if(((x&0xC0)>>6)==1) y=@0c52;else if(((x&0xC0)>>6)==2) y=@0c53;else if(((x&0xC0)>>6)==3) y=@0c54;else y=@0035;
  $  148.自动灯光判断配置                    $    $           $    $  ANS020.BYTE006  $  if(((x&0x30)>>4)==0) y=@0c55;else if(((x&0x30)>>4)==1) y=@0c56;else if(((x&0x30)>>4)==2) y=@0c57;else if(((x&0x30)>>4)==3) y=@0035;else y=@0035;
  $  149.照地灯配置                          $    $           $    $  ANS020.BYTE006  $  if(((x&0x0C)>>2)==0) y=@0c55;else if(((x&0x0C)>>2)==1) y=@0c46;else if(((x&0x0C)>>2)==2) y=@0c47;else if(((x&0x0C)>>2)==3) y=@0c48;else y=@0035;
  $  150.迎宾灯功能配置                      $    $           $    $  ANS020.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  151.后雾灯倒车灯通道配置                $    $           $    $  ANS020.BYTE006  $  if((x&0x01)==0) y=@0cce;else if((x&0x01)==1) y=@0ccf;else y=@0035;
  $  152.解锁迎宾模式配置                    $    $           $    $  ANS020.BYTE007  $  if(((x&0x38)>>3)==0) y=@0c3a;else if(((x&0x38)>>3)==1) y=@0abd;else if(((x&0x38)>>3)==2) y=@0abe;else if(((x&0x38)>>3)==3) y=@0c3b;else if(((x&0x38)>>3)==4) y=@0c3c;else if(((x&0x38)>>3)==5) y=@0da3;else if(((x&0x38)>>3)==6) y=@0da4;else if(((x&0x38)>>3)==7) y=@0da5;else y=@0035;
  $  153.闭锁迎宾模式配置                    $    $           $    $  ANS020.BYTE007  $  if((x&0x07)==0) y=@0c3a;else if((x&0x07)==1) y=@0abd;else if((x&0x07)==2) y=@0abe;else if((x&0x07)==3) y=@0c3b;else if((x&0x07)==4) y=@0c3c;else if((x&0x07)==5) y=@0da3;else if((x&0x07)==6) y=@0da4;else if((x&0x07)==7) y=@0da5;else y=@0035;
  $  154.迎宾持续时间                        $    $           $    $  ANS020.BYTE008  $  y=x*0.5;
  $  155.刹车灯点亮百分比                    $    $  %        $    $  ANS020.BYTE011  $  y=((x&0xF0)>>4);
  $  156.刹车灯熄灭百分比                    $    $  %        $    $  ANS020.BYTE011  $  y=(x&0x0F);
  $  157.闭锁源1                             $    $           $    $  ANS021.BYTE004  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  158.闭锁源2                             $    $           $    $  ANS021.BYTE005  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  159.闭锁源3                             $    $           $    $  ANS021.BYTE006  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  160.闭锁源4                             $    $           $    $  ANS021.BYTE007  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  161.闭锁源5                             $    $           $    $  ANS021.BYTE008  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  162.闭锁源6                             $    $           $    $  ANS021.BYTE009  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  163.闭锁源7                             $    $           $    $  ANS021.BYTE010  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  164.闭锁源8                             $    $           $    $  ANS021.BYTE011  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  165.闭锁源9                             $    $           $    $  ANS021.BYTE012  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  166.闭锁源10                            $    $           $    $  ANS021.BYTE013  $  if(x==1) y=@0c58;else if(x==2) y=@0c0c;else if(x==3) y=@0c0d;else if(x==4) y=@0c5a;else if(x==5) y=@0c5b;else if(x==6) y=@0c5c;else y=@0103;
  $  167.主解锁开关                          $    $           $    $  ANS022.BYTE004  $  if(((x&0x02)>>1)==0) y=@0c42;else if(((x&0x02)>>1)==1) y=@0c43;else y=@0035;
  $  168.主闭锁开关                          $    $           $    $  ANS022.BYTE004  $  if((x&0x01)==0) y=@0c42;else if((x&0x01)==1) y=@0c43;else y=@0035;
  $  169.油箱盖解锁开关                      $    $           $    $  ANS022.BYTE005  $  if(((x&0x04)>>2)==0) y=@0c42;else if(((x&0x04)>>2)==1) y=@0c43;else y=@0035;
  $  170.PEPS尾门解锁开关信号                $    $           $    $  ANS022.BYTE005  $  if(((x&0x02)>>1)==0) y=@0c42;else if(((x&0x02)>>1)==1) y=@0c43;else y=@0035;
  $  171.尾门解锁开关                        $    $           $    $  ANS022.BYTE005  $  if((x&0x01)==0) y=@0c42;else if((x&0x01)==1) y=@0c43;else y=@0035;
  $  172.副驾驶锁住反馈                      $    $           $    $  ANS022.BYTE006  $  if(((x&0x10)>>4)==0) y=@0c42;else if(((x&0x10)>>4)==1) y=@0c43;else y=@0035;
  $  173.驾驶员上锁反馈                      $    $           $    $  ANS022.BYTE006  $  if((x&0x01)==0) y=@0c42;else if((x&0x01)==1) y=@0c43;else y=@0035;
  $  174.右后门开关                          $    $           $    $  ANS022.BYTE007  $  if(((x&0x40)>>6)==0) y=@0c42;else if(((x&0x40)>>6)==1) y=@0c43;else y=@0035;
  $  175.左后门开关                          $    $           $    $  ANS022.BYTE007  $  if(((x&0x10)>>4)==0) y=@0c42;else if(((x&0x10)>>4)==1) y=@0c43;else y=@0035;
  $  176.乘客门开关                          $    $           $    $  ANS022.BYTE007  $  if(((x&0x04)>>2)==0) y=@0c42;else if(((x&0x04)>>2)==1) y=@0c43;else y=@0035;
  $  177.驾驶员门开关                        $    $           $    $  ANS022.BYTE007  $  if((x&0x01)==0) y=@0c42;else if((x&0x01)==1) y=@0c43;else y=@0035;
  $  178.引擎罩开关                          $    $           $    $  ANS022.BYTE008  $  if(((x&0x04)>>2)==0) y=@0c42;else if(((x&0x04)>>2)==1) y=@0c43;else y=@0035;
  $  179.尾门开关                            $    $           $    $  ANS022.BYTE008  $  if((x&0x01)==0) y=@0c42;else if((x&0x01)==1) y=@0c43;else y=@0035;
  $  180.行驶里程备份                        $    $  km       $    $  ANS023.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  181.全局里程表读数                      $    $  km       $    $  ANS024.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  182.照我回家配置                        $    $           $    $  ANS025.BYTE004  $  if(((x&0xE0)>>5)==0) y=@000f;else if(((x&0xE0)>>5)==1) y=@04fd;else if(((x&0xE0)>>5)==2) y=@0502;else if(((x&0xE0)>>5)==3) y=@0503;else y=@0035;
  $  183.闭锁反馈方式                        $    $           $    $  ANS025.BYTE004  $  if(((x&0x18)>>3)==0) y=@000f;else if(((x&0x18)>>3)==1) y=@0cc2;else if(((x&0x18)>>3)==2) y=@0505;else if(((x&0x18)>>3)==3) y=@0504;else y=@0035;
  $  184.驾驶模式记忆配置                    $    $           $    $  ANS025.BYTE004  $  if(((x&0x04)>>2)==0) y=@0d10;else if(((x&0x04)>>2)==1) y=@0c45;else y=@0035;
  $  185.寻车功能持续时间                    $    $           $    $  ANS025.BYTE004  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@0c46;else if((x&0x03)==2) y=@0c47;else if((x&0x03)==3) y=@0c48;else y=@0035;
  $  186.寻车功能反馈方式                    $    $           $    $  ANS025.BYTE005  $  if(((x&0x80)>>7)==0) y=@0cc2;else if(((x&0x80)>>7)==1) y=@0c71;else y=@0035;
  $  187.解锁反馈方式                        $    $           $    $  ANS025.BYTE005  $  if(((x&0x60)>>5)==0) y=@000f;else if(((x&0x60)>>5)==1) y=@0cc2;else y=@0035;
  $  188.熄火解锁触发方式                    $    $           $    $  ANS025.BYTE005  $  if(((x&0x18)>>3)==0) y=@0187;else if(((x&0x18)>>3)==1) y=@0495;else if(((x&0x18)>>3)==2) y=@0526;else y=@0035;
  $  189.自动解锁个性化菜单配置字            $    $           $    $  ANS025.BYTE005  $  if(((x&0x04)>>2)==0) y=@0cb4;else if(((x&0x04)>>2)==1) y=@0c0a;else y=@0035;
  $  190.遥控关天窗配置                      $    $           $    $  ANS025.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  191.遥控开天窗配置                      $    $           $    $  ANS025.BYTE005  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  192.PLG信号发送时间配置                 $    $  ms       $    $  ANS025.BYTE006  $  y=x*10;
  $  193.智能巡航开关                        $    $           $    $  ANS025.BYTE007  $  if(((x&0x80)>>7)==0) y=@01df;else if(((x&0x80)>>7)==1) y=@00bb;else y=@0035;
  $  194.巡航开关                            $    $           $    $  ANS025.BYTE007  $  if(((x&0x40)>>6)==0) y=@01df;else if(((x&0x40)>>6)==1) y=@00bb;else y=@0035;
  $  195.遥控升窗配置                        $    $           $    $  ANS025.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  196.遥控降窗配置                        $    $           $    $  ANS025.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  197.ECO/Sport配置                       $    $           $    $  ANS025.BYTE007  $  if(((x&0x0C)>>2)==0) y=@0c5e;else if(((x&0x0C)>>2)==1) y=@0cb5;else if(((x&0x0C)>>2)==2) y=@0cb6;else y=@0035;
  $  198.换挡器配置                          $    $           $    $  ANS025.BYTE007  $  if((x&0x03)==0) y=@0cb7;else if((x&0x03)==1) y=@0cb8;else if((x&0x03)==2) y=@0ef6;else if((x&0x03)==3) y=@0cba;else y=@0035;
  $  199.保养里程备份                        $    $  km       $    $  ANS026.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  200.软件版本日期                        $    $           $    $  ANS027.BYTE004  $  HEX(X1,X2,X3,X4);
  $  201.系统供电电压                        $    $  V        $    $  ANS028.BYTE004  $  y=x*0.1;
  $  202.TBOX请求需认证配置                  $    $           $    $  ANS029.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  203.TBOX算法配置                        $    $           $    $  ANS029.BYTE004  $  if(((x&0x40)>>6)==0) y=@0c02;else if(((x&0x40)>>6)==1) y=@0c03;else y=@0035;
  $  204.TBOX控制车窗配置                    $    $           $    $  ANS029.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b9;else if(((x&0x20)>>5)==1) y=@00ba;else y=@0035;
  $  205.TBOX远程启动功能配置                $    $           $    $  ANS029.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  206.TBOX远程钥匙管理功能                $    $           $    $  ANS029.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b9;else if(((x&0x08)>>3)==1) y=@00ba;else y=@0035;
  $  207.TBOX远程寻车功能配置                $    $           $    $  ANS029.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b9;else if(((x&0x04)>>2)==1) y=@00ba;else y=@0035;
  $  208.TBOX远程解闭锁控制功能配置字        $    $           $    $  ANS029.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0035;
  $  209.TBOX功能配置字                      $    $           $    $  ANS029.BYTE004  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0035;
  $  210.BCM允许重复发送认证的最大次数       $    $           $    $  ANS029.BYTE005  $  if(((x&0xC0)>>6)==0) y=@09e1;else if(((x&0xC0)>>6)==1) y=@0c84;else if(((x&0xC0)>>6)==2) y=@0c85;else if(((x&0xC0)>>6)==3) y=@0c86;else y=@0035;
  $  211.BCM允许认证失败次数                 $    $           $    $  ANS029.BYTE005  $  if(((x&0x30)>>4)==0) y=@09e1;else if(((x&0x30)>>4)==1) y=@0c84;else if(((x&0x30)>>4)==2) y=@0c85;else if(((x&0x30)>>4)==3) y=@0c86;else y=@0035;
  $  212.等待TBOX最长响应时间                $    $  s        $    $  ANS029.BYTE005  $  y=(x&0x0F);
  $  213.温度补偿误差阈值                    $    $  kPa      $    $  ANS030.BYTE004  $  y=x;
  $  214.胎压地区配置字                      $    $           $    $  ANS030.BYTE005  $  if((x&0x03)==0) y=@0c87;else if((x&0x03)==1) y=@0c88;else if((x&0x03)==2) y=@0c89;else y=@0035;
  $  215.高压报警使能配置字                  $    $           $    $  ANS030.BYTE006  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  216.高压报警阈值配置                    $    $  kPa      $    $  ANS030.BYTE006  $  y=(x&0x7F)*2.75+440;
  $  217.前轮标准冷态胎压值配置              $    $  kPa      $    $  ANS030.BYTE007  $  y=x*2.75;
  $  218.后轮标准冷态胎压值配置              $    $  kPa      $    $  ANS030.BYTE008  $  y=x*2.75;
  $  219.变速器档位信号                      $    $           $    $  ANS031.BYTE004  $  if((x&0x0F)==0) y=@0c8a;else if((x&0x0F)==1) y=@0c8b;else if((x&0x0F)==10) y=@0da3;else if((x&0x0F)==11) y=@0da4;else if((x&0x0F)==12) y=@0da5;else if((x&0x0F)==13) y=@0c76;else if((x&0x0F)==14) y=@0c77;else if((x&0x0F)==15) y=@0da2;else if((x&0x0F)==2) y=@00b5;else if((x&0x0F)==3) y=@0001;else if((x&0x0F)==4) y=@0ef7;else if((x&0x0F)==5) y=@01dd;else if((x&0x0F)==6) y=@0c37;else if((x&0x0F)==7) y=@0c3d;else if((x&0x0F)==8) y=@017e;else if((x&0x0F)==9) y=@0c70;else y=@0103;
  $  220.解锁源1                             $    $           $    $  ANS032.BYTE004  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  221.解锁源2                             $    $           $    $  ANS032.BYTE005  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  222.解锁源3                             $    $           $    $  ANS032.BYTE006  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  223.解锁源4                             $    $           $    $  ANS032.BYTE007  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  224.解锁源5                             $    $           $    $  ANS032.BYTE008  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  225.解锁源6                             $    $           $    $  ANS032.BYTE009  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  226.解锁源7                             $    $           $    $  ANS032.BYTE010  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  227.解锁源8                             $    $           $    $  ANS032.BYTE011  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  228.解锁源9                             $    $           $    $  ANS032.BYTE012  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  229.解锁源10                            $    $           $    $  ANS032.BYTE013  $  if(x==1) y=@0c95;else if(x==2) y=@0c06;else if(x==3) y=@0c07;else if(x==4) y=@0c96;else if(x==5) y=@0c97;else if(x==6) y=@0c0a;else y=@0103;
  $  230.车速                                $    $  km/h     $    $  ANS033.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  231.车辆速度状态                        $    $           $    $  ANS033.BYTE006  $  if(x==0) y=@00bb;else if(x==1) y=@01df;else y=@0035;
  $  232.后喷水电机输出                      $    $           $    $  ANS034.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  233.后雨刮低速输出                      $    $           $    $  ANS034.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  234.前喷水电机输出                      $    $           $    $  ANS034.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  235.前雨刮高速输出                      $    $           $    $  ANS034.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  236.前雨刮低速输出                      $    $           $    $  ANS034.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  237.唤醒源存储器1                       $    $           $    $  ANS035.BYTE004  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  238.唤醒源存储器2                       $    $           $    $  ANS035.BYTE005  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  239.唤醒源存储器3                       $    $           $    $  ANS035.BYTE006  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  240.唤醒源存储器4                       $    $           $    $  ANS035.BYTE007  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  241.唤醒源存储器5                       $    $           $    $  ANS035.BYTE008  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  242.唤醒源存储器6                       $    $           $    $  ANS035.BYTE009  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  243.唤醒源存储器7                       $    $           $    $  ANS035.BYTE010  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  244.唤醒源存储器8                       $    $           $    $  ANS035.BYTE011  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  245.唤醒源存储器9                       $    $           $    $  ANS035.BYTE012  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  246.唤醒源存储器10                      $    $           $    $  ANS035.BYTE013  $  if(x==0) y=@0c98;else if(x==1) y=@0c99;else if(x==16) y=@0c9f;else if(x==17) y=@0ca0;else if(x==18) y=@0ca1;else if(x==2) y=@0c9a;else if(x==3) y=@0c9b;else if(x==32) y=@0ca2;else if(x==33) y=@0ca3;else if(x==34) y=@0ca4;else if(x==35) y=@0ca5;else if(x==36) y=@0ca6;else if(x==4) y=@0c9c;else if(x==48) y=@0ca7;else if(x==49) y=@0ca8;else if(x==5) y=@0c9d;else if(x==50) y=@0ca9;else if(x==51) y=@0caa;else if(x==6) y=@0c9e;else if(x==64) y=@0cab;else if(x==65) y=@0cac;else if(x==80) y=@0cad;else if(x==82) y=@0c1d;else if(x==84) y=@0cae;else if(x==87) y=@0c1f;else y=@0035;
  $  247.前雨刮自动配置                      $    $           $    $  ANS036.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b9;else if(((x&0x80)>>7)==1) y=@00ba;else y=@0035;
  $  248.后雨刮有无配置                      $    $           $    $  ANS036.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b9;else if(((x&0x40)>>6)==1) y=@00ba;else y=@0035;
  $  249.背光灯是否可调节                    $    $           $    $  ANS036.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b9;else if(((x&0x10)>>4)==1) y=@00ba;else y=@0035;
  $  250.前雨刮前洗涤开关有效接合时间        $    $  ms       $    $  ANS036.BYTE005  $  y=x*100;
  $  251.雨刮堵转判断时间                    $    $  s        $    $  ANS036.BYTE006  $  y=x;
  $  252.后雨刮前洗涤开关有效接合时间        $    $  ms       $    $  ANS036.BYTE007  $  y=x*100;
  $  253.前雨刮归位信号                      $    $           $    $  ANS037.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  254.前洗涤开关                          $    $           $    $  ANS037.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  255.前雨刮点动开关                      $    $           $    $  ANS037.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  256.前雨刮高速开关                      $    $           $    $  ANS037.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  257.前雨刮低速开关                      $    $           $    $  ANS037.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  258.前雨刮灵敏度(间歇档位)              $    $           $    $  ANS037.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0caf;else if(((x&0xF0)>>4)==1) y=@0cb0;else if(((x&0xF0)>>4)==2) y=@0cb1;else if(((x&0xF0)>>4)==3) y=@0cb2;else if(((x&0xF0)>>4)==4) y=@0cb3;else y=@0035;
  $  259.前雨刮间歇/自动开关                 $    $           $    $  ANS037.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  260.后雨刮归位信号                      $    $           $    $  ANS037.BYTE006  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  261.后洗涤开关                          $    $           $    $  ANS037.BYTE006  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  262.后雨刮低速开关                      $    $           $    $  ANS037.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  263.自动雨刮高速请求                    $    $           $    $  ANS037.BYTE008  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  264.自动雨刮低速请求                    $    $           $    $  ANS037.BYTE008  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:701 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
