
    车型ID：10d6

    模拟：协议模拟-->10d6

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d3000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 A2 00 00 00 00       $%  ANS004:769 03 22 F1 A2 00 00 00 00
  $%  REQ005:761 03 22 F1 87 00 00 00 00       $%  ANS005:769 03 22 F1 87 00 00 00 00
  $%  REQ006:761 03 22 F1 10 00 00 00 00       $%  ANS006:769 03 22 F1 10 00 00 00 00
  $%  REQ007:761 03 22 F1 92 00 00 00 00       $%  ANS007:769 03 22 F1 92 00 00 00 00
  $%  REQ008:761 03 22 F1 8C 00 00 00 00       $%  ANS008:769 03 22 F1 8C 00 00 00 00
  $%  REQ009:761 03 22 F1 94 00 00 00 00       $%  ANS009:769 03 22 F1 94 00 00 00 00
  $%  REQ010:761 03 22 F1 8A 00 00 00 00       $%  ANS010:769 03 22 F1 8A 00 00 00 00
  $%  REQ011:761 03 22 F1 90 00 00 00 00       $%  ANS011:769 03 22 F1 90 00 00 00 00
  $%  REQ012:761 03 22 F1 A8 00 00 00 00       $%  ANS012:769 03 22 F1 A8 00 00 00 00
  $%  REQ013:761 03 22 F1 8B 00 00 00 00       $%  ANS013:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:                 $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元名称:                       $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  002:发布时间:                           $%    $%  ANS001.BYTE008  $%  ASCII(X1,X2,X3);
  $%  003:射频识别版本:                       $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  004:电控单元标定软件号:                 $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元硬件号:                     $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元网络文件参考号:             $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                     $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号（上次）:             $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号（上次）:             $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数（上次）:                   $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  011:供应商电控单元硬件参考号:           $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:Parts identification code 1:        $%    $%  ANS008.BYTE004  $%  ASCII(X1);
  $%  013:Parts identification code 2:        $%    $%  ANS008.BYTE005  $%  HEX(X1);
  $%  014:Part number:                        $%    $%  ANS008.BYTE006  $%  HEX(X1,X2,X3,X4);
  $%  015:供应商代码:                         $%    $%  ANS008.BYTE010  $%  ASCII(X1);
  $%  016:年:                                 $%    $%  ANS008.BYTE011  $%  ASCII(X1);
  $%  017:月:                                 $%    $%  ANS008.BYTE012  $%  HEX(X1);
  $%  018:日:                                 $%    $%  ANS008.BYTE013  $%  HEX(X1,X2);
  $%  019:序列号:                             $%    $%  ANS008.BYTE015  $%  HEX(X1,X2,X3,X4);
  $%  020:供应商电控单元软件参考号:           $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  021:系统供应商识别号 2:                 $%    $%  ANS010.BYTE005  $%  HEX(X1,X2,X3,X4,X5);
  $%  022:VIN:                                $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  023:车辆特征信息:                       $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  024:电控单元制造日期:                   $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 E0 01 00 00 00 00       $  ANS000:769 03 22 E0 01 00 00 00 00
  $  REQ001:761 03 22 E0 00 00 00 00 00       $  ANS001:769 03 22 E0 00 00 00 00 00
  $  REQ002:761 03 22 E0 03 00 00 00 00       $  ANS002:769 03 22 E0 03 00 00 00 00
  $  REQ003:761 03 22 C0 01 00 00 00 00       $  ANS003:769 03 22 C0 01 00 00 00 00
  $  REQ004:761 03 22 C0 10 00 00 00 00       $  ANS004:769 03 22 C0 10 00 00 00 00
  $  REQ005:761 03 22 C0 11 00 00 00 00       $  ANS005:769 03 22 C0 11 00 00 00 00
  $  REQ006:761 03 22 C0 12 00 00 00 00       $  ANS006:769 03 22 C0 12 00 00 00 00
  $  REQ007:761 03 22 C0 13 00 00 00 00       $  ANS007:769 03 22 C0 13 00 00 00 00
  $  REQ008:761 03 22 C0 14 00 00 00 00       $  ANS008:769 03 22 C0 14 00 00 00 00
  $  REQ009:761 03 22 C0 16 00 00 00 00       $  ANS009:769 03 22 C0 16 00 00 00 00
  $  REQ010:761 03 22 C0 17 00 00 00 00       $  ANS010:769 03 22 C0 17 00 00 00 00
  $  REQ011:761 03 22 C0 18 00 00 00 00       $  ANS011:769 03 22 C0 18 00 00 00 00
  $  REQ012:761 03 22 C0 02 00 00 00 00       $  ANS012:769 03 22 C0 02 00 00 00 00
  $  REQ013:761 03 22 C0 20 00 00 00 00       $  ANS013:769 03 22 C0 20 00 00 00 00
  $  REQ014:761 03 22 C0 21 00 00 00 00       $  ANS014:769 03 22 C0 21 00 00 00 00
  $  REQ015:761 03 22 C0 22 00 00 00 00       $  ANS015:769 03 22 C0 22 00 00 00 00
  $  REQ016:761 03 22 C0 23 00 00 00 00       $  ANS016:769 03 22 C0 23 00 00 00 00
  $  REQ017:761 03 22 C0 24 00 00 00 00       $  ANS017:769 03 22 C0 24 00 00 00 00
  $  REQ018:761 03 22 C0 25 00 00 00 00       $  ANS018:769 03 22 C0 25 00 00 00 00
  $  REQ019:761 03 22 C0 26 00 00 00 00       $  ANS019:769 03 22 C0 26 00 00 00 00
  $  REQ020:761 03 22 C0 27 00 00 00 00       $  ANS020:769 03 22 C0 27 00 00 00 00
  $  REQ021:761 03 22 C0 28 00 00 00 00       $  ANS021:769 03 22 C0 28 00 00 00 00
  $  REQ022:761 03 22 C0 03 00 00 00 00       $  ANS022:769 03 22 C0 03 00 00 00 00
  $  REQ023:761 03 22 C0 04 00 00 00 00       $  ANS023:769 03 22 C0 04 00 00 00 00
  $  REQ024:761 03 22 C0 05 00 00 00 00       $  ANS024:769 03 22 C0 05 00 00 00 00
  $  REQ025:761 03 22 C0 06 00 00 00 00       $  ANS025:769 03 22 C0 06 00 00 00 00
  $  REQ026:761 03 22 C0 07 00 00 00 00       $  ANS026:769 03 22 C0 07 00 00 00 00
  $  REQ027:761 03 22 C0 08 00 00 00 00       $  ANS027:769 03 22 C0 08 00 00 00 00
  $  REQ028:761 03 22 C0 09 00 00 00 00       $  ANS028:769 03 22 C0 09 00 00 00 00
  $  REQ029:761 03 22 C0 0A 00 00 00 00       $  ANS029:769 03 22 C0 0A 00 00 00 00
  $  REQ030:761 03 22 C0 0B 00 00 00 00       $  ANS030:769 03 22 C0 0B 00 00 00 00
  $  REQ031:761 03 22 C0 0C 00 00 00 00       $  ANS031:769 03 22 C0 0C 00 00 00 00
  $  REQ032:761 03 22 C0 0D 00 00 00 00       $  ANS032:769 03 22 C0 0D 00 00 00 00
  $  REQ033:761 03 22 C0 0E 00 00 00 00       $  ANS033:769 03 22 C0 0E 00 00 00 00
  $  REQ034:761 03 22 C0 0F 00 00 00 00       $  ANS034:769 03 22 C0 0F 00 00 00 00
  $  REQ035:761 03 22 E0 02 00 00 00 00       $  ANS035:769 03 22 E0 02 00 00 00 00

  $  000.电池寿命                                       $    $  %        $    $  ANS000.BYTE004  $  y=x;
  $  001.电池电压                                       $    $  V        $    $  ANS001.BYTE004  $  y=x*0.1;
  $  002.保持行驶距离                                   $    $  km       $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.车身颜色类型配置                               $    $           $    $  ANS003.BYTE004  $  if(x==0x00) y=@06e2;else if(x==0x01) y=@06e3;else if(x==0x02) y=@06e4;else if(x==0x03) y=@0997;else if(x==0x05) y=@06e7;else if(x==0x06) y=@06e8;else if(x==0x07) y=@06e9;else if(x==0x08) y=@06ea;else if(x==0x09) y=@134f;else if(x==0x0A) y=@1244;else if(x==0x0B) y=@1245;else if(x==0x0C) y=@06ee;else if(x==0x0D) y=@06ef;else if(x==0x0E) y=@06f0;else if(x==0x0F) y=@0998;else if(x==0x10) y=@1246;else if(x==0x11) y=@1247;else if(x==0x12) y=@0cf5;else if(x==0x13) y=@1248;else if(x==0x14) y=@0cf4;else y=@0103;
  $  004.胎压监测系统类型配置                           $    $           $    $  ANS003.BYTE005  $  if(x==0) y=@06f1;else if(x==1) y=@06f2;else if(x==2) y=@06f3;else if(x==3) y=@09a3;else y=@0103;
  $  005.第三排座椅通风                                 $    $           $    $  ANS003.BYTE006  $  if(((x&0x80)>>7)==0) y=@00c9;else if(((x&0x80)>>7)==1) y=@00ca;else y=@0004;
  $  006.第三排座椅加热                                 $    $           $    $  ANS003.BYTE006  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@00ca;else y=@0004;
  $  007.第二排座椅通风                                 $    $           $    $  ANS003.BYTE006  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@00ca;else y=@0004;
  $  008.第二排座椅加热                                 $    $           $    $  ANS003.BYTE006  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0004;
  $  009.副驾驶员座椅通风                               $    $           $    $  ANS003.BYTE006  $  if(((x&0x08)>>3)==0) y=@00c9;else if(((x&0x08)>>3)==1) y=@00ca;else y=@0004;
  $  010.副驾驶员座椅加热                               $    $           $    $  ANS003.BYTE006  $  if(((x&0x04)>>2)==0) y=@00c9;else if(((x&0x04)>>2)==1) y=@00ca;else y=@0004;
  $  011.驾驶员座椅通风                                 $    $           $    $  ANS003.BYTE006  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  012.主驾座椅加热                                   $    $           $    $  ANS003.BYTE006  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  013.空调区配置                                     $    $           $    $  ANS003.BYTE007  $  if(((x&0xC0)>>6)==0) y=@0112;else if(((x&0xC0)>>6)==1) y=@130b;else if(((x&0xC0)>>6)==2) y=@130c;else if(((x&0xC0)>>6)==3) y=@0004;else y=@0004;
  $  014.空调类型配置                                   $    $           $    $  ANS003.BYTE007  $  if(((x&0x30)>>4)==0) y=@0112;else if(((x&0x30)>>4)==1) y=@130d;else if(((x&0x30)>>4)==2) y=@130e;else if(((x&0x30)>>4)==3) y=@0004;else y=@0004;
  $  015.空调位置配置                                   $    $           $    $  ANS003.BYTE007  $  if(((x&0x0C)>>2)==0) y=@0112;else if(((x&0x0C)>>2)==1) y=@0999;else if(((x&0x0C)>>2)==2) y=@099a;else if(((x&0x0C)>>2)==3) y=@0004;else y=@0004;
  $  016.空调类型配置                                   $    $           $    $  ANS003.BYTE007  $  if((x&0x03)==0) y=@0112;else if((x&0x03)==1) y=@130f;else if((x&0x03)==2) y=@1310;else if((x&0x03)==3) y=@0004;else y=@0004;
  $  017.超速报警标志                                   $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  018.超速报警                                       $    $  km/h     $    $  ANS004.BYTE005  $  y=x;
  $  019.报警灵敏度                                     $    $           $    $  ANS004.BYTE007  $  if(((x&0xF0)>>4)==0) y=@098b;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@098c;else y=@0004;
  $  020.车道偏离警告                                   $    $           $    $  ANS004.BYTE007  $  if((x&0x0F)==0) y=@122b;else if((x&0x0F)==1) y=@122c;else if((x&0x0F)==2) y=@122d;else y=@0004;
  $  021.盲点检测报警                                   $    $           $    $  ANS005.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  022.驾驶员疲劳提示                                 $    $           $    $  ANS005.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  023.360度全景停车（低速开启转向灯）                $    $           $    $  ANS005.BYTE006  $  if(((x&0xF0)>>4)==0) y=@000f;else if(((x&0xF0)>>4)==1) y=@0028;else y=@0004;
  $  024.360度全景泊车(车辆起步开启)                    $    $           $    $  ANS005.BYTE006  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0004;
  $  025.前碰撞系统（报警灵敏度）                       $    $           $    $  ANS005.BYTE007  $  if(((x&0xF0)>>4)==0) y=@098b;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@098c;else y=@0004;
  $  026.正面碰撞系统（前碰撞警告）                     $    $           $    $  ANS005.BYTE007  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else if((x&0x0F)==2) y=@1327;else y=@0004;
  $  027.伴我回家(保持亮灯时间)                         $    $           $    $  ANS006.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0004;
  $  028.回家功能状态                                   $    $           $    $  ANS006.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  029.寻车反馈                                       $    $           $    $  ANS006.BYTE005  $  if(x==0) y=@0111;else if(x==1) y=@08ee;else y=@0004;
  $  030.无钥匙解锁                                     $    $           $    $  ANS006.BYTE006  $  if(((x&0x20)>>5)==0) y=@131a;else if(((x&0x20)>>5)==1) y=@08a0;else y=@0004;
  $  031.钥匙解锁                                       $    $           $    $  ANS006.BYTE006  $  if(((x&0x10)>>4)==0) y=@131a;else if(((x&0x10)>>4)==1) y=@08a0;else y=@0004;
  $  032.车辆上锁反馈                                   $    $           $    $  ANS006.BYTE006  $  if(((x&0x0C)>>2)==1) y=@08ee;else if(((x&0x0C)>>2)==2) y=@0111;else if(((x&0x0C)>>2)==3) y=@131e;else y=@0004;
  $  033.熄火自动解锁                                   $    $           $    $  ANS006.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  034.行车自动落锁                                   $    $           $    $  ANS006.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  035.座椅自动调节                                   $    $           $    $  ANS006.BYTE007  $  if(((x&0xC0)>>6)==0) y=@131f;else if(((x&0xC0)>>6)==1) y=@1320;else y=@0004;
  $  036.清除所有记忆功能                               $    $           $    $  ANS006.BYTE007  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  037.后视镜及座椅钥匙记忆功能                       $    $           $    $  ANS006.BYTE007  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0004;
  $  038.车外后视镜倒车自动下倾                         $    $           $    $  ANS006.BYTE007  $  if(((x&0x0E)>>1)==0) y=@0994;else if(((x&0x0E)>>1)==1) y=@0995;else if(((x&0x0E)>>1)==2) y=@0996;else if(((x&0x0E)>>1)==3) y=@1357;else y=@0004;
  $  039.自动折叠/展开                                  $    $           $    $  ANS006.BYTE007  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  040.方向盘自定义                                   $    $           $    $  ANS007.BYTE004  $  if(x==0) y=@064f;else if(x==1) y=@1325;else y=@0004;
  $  041.语言                                           $    $           $    $  ANS008.BYTE004  $  if(x==0) y=@0487;else if(x==1) y=@0901;else if(x==2) y=@08bf;else if(x==3) y=@08ca;else if(x==4) y=@08b7;else y=@0004;
  $  042.日期格式                                       $    $           $    $  ANS008.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0b11;else if(((x&0xF0)>>4)==1) y=@0b12;else if(((x&0xF0)>>4)==2) y=@0b13;else y=@0004;
  $  043.时间格式                                       $    $           $    $  ANS008.BYTE005  $  if((x&0x01)==0) y=@05ed;else if((x&0x01)==1) y=@05ec;else y=@0004;
  $  044.限速标识识别                                   $    $           $    $  ANS009.BYTE006  $  if(x==0) y=@000f;else if(x==1) y=@12fc;else if(x==2) y=@12fd;else if(x==3) y=@12fe;else y=@0004;
  $  045.前方停车距离控制                               $    $           $    $  ANS009.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  046.迎宾灯(保持亮灯时间)                           $    $           $    $  ANS010.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0004;
  $  047.迎宾灯状态                                     $    $           $    $  ANS010.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  048.单色氛围灯                                     $    $           $    $  ANS010.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  049.一键升窗                                       $    $           $    $  ANS010.BYTE006  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  050.ATS(全地形系统)显示特效                        $    $           $    $  ANS010.BYTE007  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  051.空气净化器                                     $    $           $    $  ANS011.BYTE004  $  if(((x&0xF0)>>4)==0) y=@000f;else if(((x&0xF0)>>4)==1) y=@0028;else y=@0004;
  $  052.LDW(车道偏离预警)系统配置                      $    $           $    $  ANS012.BYTE004  $  if(x==0) y=@125a;else if(x==1) y=@0903;else y=@0004;
  $  053.自动紧急制动配置                               $    $           $    $  ANS012.BYTE005  $  if(x==0) y=@0904;else if(x==1) y=@0692;else y=@0004;
  $  054.360度全景影像配置                              $    $           $    $  ANS012.BYTE006  $  if(x==0) y=@125c;else if(x==1) y=@1350;else if(x==2) y=@0692;else y=@0004;
  $  055.车载显示器类型配置                             $    $           $    $  ANS012.BYTE007  $  if(x==0) y=@1261;else if(x==1) y=@1351;else if(x==2) y=@1352;else if(x==3) y=@1266;else if(x==4) y=@1264;else if(x==5) y=@1262;else if(x==6) y=@1263;else if(x==7) y=@1268;else if(x==8) y=@1269;else y=@0004;
  $  056.驾驶模式                                       $    $           $    $  ANS013.BYTE004  $  if(x==0) y=@126b;else if(x==1) y=@0b03;else y=@0004;
  $  057.发动机启停功能                                 $    $           $    $  ANS013.BYTE005  $  if(x==0) y=@0a7f;else if(x==1) y=@0a80;else y=@0004;
  $  058.后视镜                                         $    $           $    $  ANS013.BYTE006  $  if(x==0) y=@1353;else if(x==1) y=@1354;else y=@0004;
  $  059.后视镜下倾                                     $    $           $    $  ANS013.BYTE007  $  if(x==0) y=@1355;else if(x==1) y=@1356;else y=@0004;
  $  060.驾驶员座椅                                     $    $           $    $  ANS014.BYTE004  $  if(x==0) y=@1341;else if(x==1) y=@1342;else if(x==2) y=@1343;else y=@0004;
  $  061.副驾驶员侧座椅                                 $    $           $    $  ANS014.BYTE005  $  if(x==0) y=@1344;else if(x==1) y=@1345;else if(x==2) y=@1346;else y=@0004;
  $  062.第二排座椅                                     $    $           $    $  ANS014.BYTE006  $  if(x==0) y=@0b0c;else if(x==1) y=@1347;else if(x==2) y=@1348;else if(x==3) y=@1349;else if(x==4) y=@134a;else y=@0004;
  $  063.第三排座椅                                     $    $           $    $  ANS014.BYTE007  $  if(x==0) y=@0b0f;else if(x==1) y=@0b10;else y=@0004;
  $  064.副驾驶员气囊                                   $    $           $    $  ANS015.BYTE004  $  if(((x&0xF0)>>4)==0) y=@00c9;else if(((x&0xF0)>>4)==1) y=@00ca;else y=@0004;
  $  065.驾驶员安全气囊                                 $    $           $    $  ANS015.BYTE004  $  if((x&0x0F)==0) y=@00c9;else if((x&0x0F)==1) y=@00ca;else y=@0004;
  $  066.气帘                                           $    $           $    $  ANS015.BYTE005  $  if(((x&0xF0)>>4)==0) y=@00c9;else if(((x&0xF0)>>4)==1) y=@00ca;else y=@0004;
  $  067.主副驾侧气囊                                   $    $           $    $  ANS015.BYTE005  $  if((x&0x0F)==0) y=@00c9;else if((x&0x0F)==1) y=@00ca;else y=@0004;
  $  068.安全带提示                                     $    $           $    $  ANS015.BYTE006  $  if(x==0) y=@0992;else if(x==1) y=@0aed;else if(x==2) y=@0aee;else y=@0004;
  $  069.手机互联网                                     $    $           $    $  ANS016.BYTE004  $  if(x==0) y=@0af1;else if(x==1) y=@095c;else if(x==2) y=@134b;else if(x==3) y=@134c;else y=@0004;
  $  070.迎宾灯                                         $    $           $    $  ANS016.BYTE005  $  if(x==0) y=@095f;else if(x==1) y=@095e;else y=@0004;
  $  071.欢迎模式                                       $    $           $    $  ANS016.BYTE006  $  if(x==0) y=@133d;else if(x==1) y=@133e;else y=@0004;
  $  072.车道保持辅助系统                               $    $           $    $  ANS017.BYTE004  $  if(x==0) y=@09a7;else if(x==1) y=@09a6;else y=@0004;
  $  073.自适应巡航控制                                 $    $           $    $  ANS017.BYTE005  $  if(x==0) y=@0ff0;else if(x==1) y=@11eb;else y=@0004;
  $  074.交通标志识别                                   $    $           $    $  ANS017.BYTE006  $  if(x==0) y=@12f6;else if(x==1) y=@12f7;else y=@0004;
  $  075.座椅记忆系统                                   $    $           $    $  ANS017.BYTE007  $  if(x==0) y=@094e;else if(x==1) y=@094d;else y=@0004;
  $  076.驾驶预警系统                                   $    $           $    $  ANS018.BYTE004  $  if(x==0) y=@12f4;else if(x==1) y=@133f;else y=@0004;
  $  077.自动氛围灯                                     $    $           $    $  ANS018.BYTE005  $  if(x==0) y=@1340;else if(x==1) y=@0960;else y=@0004;
  $  078.颜色                                           $    $           $    $  ANS018.BYTE006  $  if(x==0) y=@11db;else if(x==1) y=@11dc;else if(x==2) y=@0963;else if(x==3) y=@0964;else if(x==4) y=@0965;else if(x==5) y=@0966;else y=@0004;
  $  079.氛围灯开关模式                                 $    $           $    $  ANS019.BYTE004  $  if(x==0) y=@1290;else if(x==1) y=@0993;else y=@0004;
  $  080.IP 区域                                        $    $           $    $  ANS019.BYTE005  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0004;
  $  081.顶棚区域                                       $    $           $    $  ANS019.BYTE006  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0004;
  $  082.前门                                           $    $           $    $  ANS019.BYTE007  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0004;
  $  083.后门                                           $    $           $    $  ANS019.BYTE008  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0004;
  $  084.尾门                                           $    $           $    $  ANS019.BYTE009  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0004;
  $  085.行车自动落锁                                   $    $           $    $  ANS020.BYTE004  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0004;
  $  086.熄火自动解锁                                   $    $           $    $  ANS020.BYTE005  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0004;
  $  087.车辆上锁反馈                                   $    $           $    $  ANS020.BYTE006  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0004;
  $  088.无钥匙解锁                                     $    $           $    $  ANS020.BYTE007  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0004;
  $  089.钥匙解锁                                       $    $           $    $  ANS020.BYTE007  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0004;
  $  090.HUD                                            $    $           $    $  ANS021.BYTE004  $  if(x==0) y=@1249;else if(x==1) y=@12a2;else if(x==2) y=@124b;else y=@0004;
  $  091.顶高                                           $    $           $    $  ANS021.BYTE005  $  if(x==0) y=@09c4;else if(x==1) y=@09c2;else if(x==2) y=@08ce;else y=@0004;
  $  092.后排乘客区电动玻璃                             $    $           $    $  ANS022.BYTE004  $  if(((x&0x80)>>7)==0) y=@0112;else if(((x&0x80)>>7)==1) y=@0445;else y=@0004;
  $  093.后排乘客区电动玻璃一键自动下                   $    $           $    $  ANS022.BYTE004  $  if(((x&0x40)>>6)==0) y=@0112;else if(((x&0x40)>>6)==1) y=@0445;else y=@0004;
  $  094.后排乘客区电动玻璃一键自动上下（带防夹）       $    $           $    $  ANS022.BYTE004  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0004;
  $  095.副驾驶员电动玻璃                               $    $           $    $  ANS022.BYTE004  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0004;
  $  096.副驾驶员电动玻璃一键自动下                     $    $           $    $  ANS022.BYTE004  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0004;
  $  097.后排乘客区电动玻璃一键自动上下（带防夹）       $    $           $    $  ANS022.BYTE004  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0004;
  $  098.驾驶员电动玻璃一键自动下                       $    $           $    $  ANS022.BYTE004  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0004;
  $  099.驾驶员电动玻璃一键自动上下（带防夹）           $    $           $    $  ANS022.BYTE004  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0004;
  $  100.远程信息处理系统类型配置                       $    $           $    $  ANS022.BYTE005  $  if(x==0) y=@11fd;else if(x==1) y=@11fe;else if(x==2) y=@11ff;else if(x==3) y=@1200;else if(x==4) y=@1201;else if(x==5) y=@1202;else if(x==6) y=@1203;else if(x==7) y=@1204;else y=@0004;
  $  101.车辆导航配置                                   $    $           $    $  ANS022.BYTE006  $  if(x==0) y=@05aa;else if(x==1) y=@0739;else y=@0004;
  $  102.免提配置                                       $    $           $    $  ANS022.BYTE007  $  if(x==0) y=@073a;else if(x==1) y=@073b;else y=@0004;
  $  103.车载信息娱乐显示级别类型配置                   $    $           $    $  ANS023.BYTE004  $  if(x==0) y=@073c;else if(x==1) y=@1205;else if(x==2) y=@1206;else if(x==3) y=@135f;else if(x==4) y=@1360;else if(x==5) y=@1361;else y=@0004;
  $  104.DAB数字音频广播配置                            $    $           $    $  ANS023.BYTE005  $  if(x==0) y=@12ec;else if(x==1) y=@0692;else y=@0004;
  $  105.后驻车辅助系统                                 $    $           $    $  ANS023.BYTE006  $  if(((x&0xE0)>>5)==0) y=@12a6;else if(((x&0xE0)>>5)==1) y=@12a7;else if(((x&0xE0)>>5)==2) y=@1362;else if(((x&0xE0)>>5)==3) y=@12a9;else if(((x&0xE0)>>5)==4) y=@12aa;else if(((x&0xE0)>>5)==5) y=@12ab;else if(((x&0xE0)>>5)==6) y=@12ac;else if(((x&0xE0)>>5)==7) y=@12ad;else y=@0004;
  $  106.前驻车辅助系统                                 $    $           $    $  ANS023.BYTE006  $  if(((x&0x1C)>>2)==0) y=@12ae;else if(((x&0x1C)>>2)==1) y=@12af;else if(((x&0x1C)>>2)==2) y=@1363;else if(((x&0x1C)>>2)==3) y=@12b1;else if(((x&0x1C)>>2)==4) y=@12b2;else if(((x&0x1C)>>2)==5) y=@12b3;else if(((x&0x1C)>>2)==6) y=@12b4;else if(((x&0x1C)>>2)==7) y=@12b5;else y=@0004;
  $  107.后雷达                                         $    $           $    $  ANS023.BYTE006  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0004;
  $  108.前雷达                                         $    $           $    $  ANS023.BYTE006  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0004;
  $  109.右后下摄像头类型配置                           $    $           $    $  ANS023.BYTE007  $  if(x==0x00) y=@12b6;else if(x==0x01) y=@11f1;else if(x==0x02) y=@070d;else if(x==0x03) y=@0708;else if(x==0x04) y=@070f;else if(x==0x05) y=@12b7;else if(x==0x06) y=@098a;else if(x==0x07) y=@0989;else if(x==0x08) y=@12ba;else if(x==0x09) y=@12bb;else if(x==0x0A) y=@12bc;else if(x==0x0B) y=@12bd;else if(x==0x0C) y=@12be;else y=@0004;
  $  110.方向盘遥控功能配置                             $    $           $    $  ANS024.BYTE004  $  if(x==0) y=@0711;else if(x==1) y=@0712;else if(x==2) y=@11f4;else y=@0004;
  $  111.汽车音频类型配置                               $    $           $    $  ANS024.BYTE005  $  if(x==0) y=@0714;else if(x==1) y=@0715;else if(x==2) y=@11f5;else if(x==3) y=@0717;else y=@0004;
  $  112.AUX(音频)端口配置                              $    $           $    $  ANS024.BYTE006  $  if(x==0) y=@0718;else if(x==1) y=@096c;else y=@0004;
  $  113.视频输入功能配置                               $    $           $    $  ANS024.BYTE007  $  if(x==0) y=@071a;else if(x==1) y=@071b;else y=@0004;
  $  114.USB端口类型配置                                $    $           $    $  ANS025.BYTE004  $  if(x==0) y=@11f6;else if(x==1) y=@11f7;else if(x==2) y=@071c;else if(x==3) y=@071d;else y=@0004;
  $  115.FM 50kHZ                                       $    $           $    $  ANS025.BYTE005  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0004;
  $  116.FM 100kHZ                                      $    $           $    $  ANS025.BYTE005  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0004;
  $  117.AM 10kHZ                                       $    $           $    $  ANS025.BYTE005  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0004;
  $  118.AM 9kHZ                                        $    $           $    $  ANS025.BYTE005  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0004;
  $  119.FM 87.5~108MHZ                                 $    $           $    $  ANS025.BYTE006  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0004;
  $  120.531~1629KHZ                                    $    $           $    $  ANS025.BYTE006  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0004;
  $  121.AM 522~1710KHZ                                 $    $           $    $  ANS025.BYTE006  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0004;
  $  122.AM 530 ~1710KHZ                                $    $           $    $  ANS025.BYTE006  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0004;
  $  123.AM 531~1602KHZ                                 $    $           $    $  ANS025.BYTE006  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0004;
  $  124.扬声器类型配置                                 $    $           $    $  ANS025.BYTE007  $  if(x==0) y=@069d;else if(x==1) y=@069e;else if(x==2) y=@11f8;else if(x==3) y=@11f9;else if(x==4) y=@12c0;else if(x==5) y=@11fa;else y=@0004;
  $  125.iPod设备配置                                   $    $           $    $  ANS026.BYTE004  $  if(x==0) y=@096f;else if(x==1) y=@0692;else y=@0004;
  $  126.汽车车型年份配置                               $    $           $    $  ANS026.BYTE005  $  if(x==0) y=@06a5;else if(x==1) y=@06a6;else if(x==2) y=@06a7;else if(x==3) y=@06a8;else if(x==4) y=@06a9;else if(x==5) y=@06aa;else if(x==6) y=@06ab;else if(x==7) y=@1332;else if(x==8) y=@1333;else y=@0004;
  $  127.空气净化器系统                                 $    $           $    $  ANS026.BYTE006  $  if(x==0) y=@08e7;else if(x==1) y=@08e8;else if(x==2) y=@08e9;else if(x==3) y=@08ea;else y=@0004;
  $  128.车身类型配置                                   $    $           $    $  ANS026.BYTE007  $  if(x==0x00) y=@1279;else if(x==0x01) y=@127a;else if(x==0x02) y=@127b;else if(x==0x03) y=@127c;else if(x==0x04) y=@127d;else if(x==0x05) y=@127e;else if(x==0x06) y=@127f;else if(x==0x07) y=@1280;else if(x==0x08) y=@00f3;else if(x==0x09) y=@06b4;else if(x==0x0A) y=@06b5;else if(x==0x1B) y=@135e;else y=@0004;
  $  129.汽车品牌配置                                   $    $           $    $  ANS027.BYTE004  $  if(x==0) y=@066a;else if(x==1) y=@066b;else if(x==2) y=@0cf7;else y=@0004;
  $  130.汽车国家代码配置                               $    $           $    $  ANS027.BYTE005  $  if(x==0x00) y=@00d8;else if(x==0x01) y=@066d;else if(x==0x02) y=@066e;else if(x==0x03) y=@066f;else if(x==0x04) y=@0670;else if(x==0x05) y=@0671;else if(x==0x06) y=@0672;else if(x==0x07) y=@0673;else if(x==0x08) y=@0674;else if(x==0x09) y=@0675;else if(x==0x0A) y=@0676;else if(x==0x0B) y=@0677;else if(x==0x0C) y=@0678;else if(x==0x0D) y=@0679;else if(x==0x0E) y=@067a;else if(x==0x0F) y=@067b;else if(x==0x10) y=@067c;else if(x==0x11) y=@1335;else if(x==0x12) y=@08c2;else if(x==0x13) y=@08b6;else if(x==0x14) y=@08b8;else if(x==0x15) y=@09cb;else if(x==0x16) y=@09cc;else if(x==0x17) y=@08b7;else y=@0004;
  $  131.主驾驶方向配置                                 $    $           $    $  ANS027.BYTE006  $  if(x==0) y=@067d;else if(x==1) y=@067e;else y=@0004;
  $  132.汽车发动机类型配置                             $    $           $    $  ANS027.BYTE007  $  if(x==0) y=@1365;else if(x==1) y=@1366;else if(x==2) y=@1367;else if(x==3) y=@1368;else if(x==4) y=@1369;else if(x==5) y=@136a;else y=@0004;
  $  133.变速箱类型配置                                 $    $           $    $  ANS028.BYTE004  $  if(x==0) y=@0688;else if(x==1) y=@1298;else if(x==2) y=@00fa;else if(x==3) y=@1299;else y=@0004;
  $  134.汽车尾门操作类型配置                           $    $           $    $  ANS028.BYTE005  $  if(x==0) y=@09cd;else if(x==1) y=@09ce;else if(x==2) y=@0690;else if(x==3) y=@0b14;else y=@0004;
  $  135.盲点信息系统配置                               $    $           $    $  ANS028.BYTE006  $  if(x==0) y=@09ab;else if(x==1) y=@0692;else y=@0004;
  $  136.行人警告系统配置                               $    $           $    $  ANS028.BYTE007  $  if(x==0) y=@08ec;else if(x==1) y=@0692;else y=@0004;
  $  137.速度警报系统配置                               $    $           $    $  ANS029.BYTE004  $  if(x==0) y=@08ed;else if(x==1) y=@0692;else y=@0004;
  $  138.自动紧急呼叫配置                               $    $           $    $  ANS029.BYTE005  $  if(x==0) y=@03de;else if(x==1) y=@0692;else y=@0004;
  $  139.汽车天窗类型配置                               $    $           $    $  ANS029.BYTE006  $  if(x==0) y=@1272;else if(x==1) y=@0b15;else if(x==2) y=@0695;else y=@0004;
  $  140.混合动力类型配置                               $    $           $    $  ANS029.BYTE007  $  if(x==0) y=@09d0;else if(x==1) y=@06cd;else if(x==2) y=@06ce;else if(x==3) y=@06cf;else y=@0004;
  $  141.生态驱动模式配置                               $    $           $    $  ANS030.BYTE004  $  if(x==0) y=@1275;else if(x==1) y=@09be;else y=@0004;
  $  142.FCW正面碰撞警告配置                            $    $           $    $  ANS030.BYTE005  $  if(x==0) y=@0950;else if(x==1) y=@094f;else y=@0004;
  $  143.MIC麦克风类型配置                              $    $           $    $  ANS030.BYTE006  $  if(x==0) y=@1364;else if(x==1) y=@06d1;else if(x==2) y=@129d;else y=@0004;
  $  144.光线传感器配置                                 $    $           $    $  ANS030.BYTE007  $  if(x==0) y=@09c1;else if(x==1) y=@09c0;else y=@0004;
  $  145.车辆类型                                       $    $           $    $  ANS031.BYTE004  $  if(x==1) y=@1235;else if(x==2) y=@12da;else if(x==3) y=@12db;else if(x==4) y=@0d9f;else if(x==5) y=@12dd;else if(x==6) y=@135a;else if(x==7) y=@12df;else y=@0004;
  $  146.语音识别                                       $    $           $    $  ANS032.BYTE004  $  if(x==0) y=@1287;else if(x==1) y=@06da;else y=@0004;
  $  147.ABS/ESP                                        $    $           $    $  ANS032.BYTE005  $  if(x==0) y=@09c7;else if(x==1) y=@06b7;else if(x==2) y=@09c6;else y=@0004;
  $  148.方向盘转角信号                                 $    $           $    $  ANS032.BYTE006  $  if(x==0) y=@129e;else if(x==1) y=@135b;else y=@0004;
  $  149.PEPS(无钥匙控制无钥匙启动系统)                 $    $           $    $  ANS032.BYTE007  $  if(x==0) y=@135c;else if(x==1) y=@12a1;else y=@0004;
  $  150.WIFI(无线网络)                                 $    $           $    $  ANS033.BYTE004  $  if(x==0) y=@09d3;else if(x==1) y=@09d2;else y=@0004;
  $  151.轴距                                           $    $           $    $  ANS033.BYTE005  $  if(x==0) y=@06be;else if(x==1) y=@06bf;else if(x==2) y=@1336;else y=@0004;
  $  152.底盘高度                                       $    $           $    $  ANS033.BYTE006  $  if(x==0) y=@06c0;else if(x==1) y=@06c1;else if(x==3) y=@135d;else y=@0004;
  $  153.驱动类型                                       $    $           $    $  ANS033.BYTE007  $  if(x==0) y=@0883;else if(x==1) y=@1338;else if(x==2) y=@1288;else if(x==3) y=@05dd;else y=@0004;
  $  154.车门                                           $    $           $    $  ANS034.BYTE004  $  if(x==0) y=@1358;else if(x==1) y=@1359;else y=@0004;
  $  155.超速报警                                       $    $           $    $  ANS034.BYTE005  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0004;
  $  156.限速标识识别                                   $    $           $    $  ANS034.BYTE006  $  if(x==0) y=@000f;else if(x==1) y=@12fc;else if(x==2) y=@12fd;else if(x==3) y=@12fe;else y=@0004;
  $  157.GPS                                            $    $           $    $  ANS034.BYTE007  $  if(x==0) y=@09c5;else if(x==1) y=@133c;else y=@0004;
  $  158.车辆里程数                                     $    $  km       $    $  ANS035.BYTE004  $  y=(x1*256*256+x2*256+x3);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
