
    车型ID：10db

    模拟：协议模拟-->10db

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d8000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 A2 00 00 00 00       $%  ANS004:769 03 22 F1 A2 00 00 00 00
  $%  REQ005:761 03 22 F1 87 00 00 00 00       $%  ANS005:769 03 22 F1 87 00 00 00 00
  $%  REQ006:761 03 22 F1 10 00 00 00 00       $%  ANS006:769 03 22 F1 10 00 00 00 00
  $%  REQ007:761 03 22 F1 92 00 00 00 00       $%  ANS007:769 03 22 F1 92 00 00 00 00
  $%  REQ008:761 03 22 F1 8C 00 00 00 00       $%  ANS008:769 03 22 F1 8C 00 00 00 00
  $%  REQ009:761 03 22 F1 94 00 00 00 00       $%  ANS009:769 03 22 F1 94 00 00 00 00
  $%  REQ010:761 03 22 F1 8A 00 00 00 00       $%  ANS010:769 03 22 F1 8A 00 00 00 00
  $%  REQ011:761 03 22 F1 90 00 00 00 00       $%  ANS011:769 03 22 F1 90 00 00 00 00
  $%  REQ012:761 03 22 F1 A8 00 00 00 00       $%  ANS012:769 03 22 F1 A8 00 00 00 00
  $%  REQ013:761 03 22 F1 8B 00 00 00 00       $%  ANS013:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元名称:                    $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  002:发布时间:                        $%    $%  ANS001.BYTE008  $%  ASCII(X1,X2,X3);
  $%  003:射频识别版本:                    $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  004:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号（上次）:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号（上次）:          $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数（上次）:                $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:车辆零件识别号:                  $%    $%  ANS008.BYTE005  $%  ASCII(X1,X2);
  $%  013:零件号标识码:                    $%    $%  ANS008.BYTE007  $%  ASCII(X1,X2,X3,X4);
  $%  014:供应商代码:                      $%    $%  ANS008.BYTE011  $%  ASCII(X1);
  $%  015:年:                              $%    $%  ANS008.BYTE012  $%  ASCII(X1);
  $%  016:月:                              $%    $%  ANS008.BYTE013  $%  ASCII(X1);
  $%  017:日:                              $%    $%  ANS008.BYTE014  $%  ASCII(X1,X2);
  $%  018:序列号:                          $%    $%  ANS008.BYTE016  $%  ASCII(X1,X2,X3,X4);
  $%  019:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  020:系统供应商识别号:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  021:VIN:                             $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  022:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  023:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 B1 06 00 00 00 00       $  ANS000:769 03 22 B1 06 00 00 00 00
  $  REQ001:761 03 22 B1 0C 00 00 00 00       $  ANS001:769 03 22 B1 0C 00 00 00 00
  $  REQ002:761 03 22 B1 01 00 00 00 00       $  ANS002:769 03 22 B1 01 00 00 00 00
  $  REQ003:761 03 22 B1 0B 00 00 00 00       $  ANS003:769 03 22 B1 0B 00 00 00 00
  $  REQ004:761 03 22 B1 04 00 00 00 00       $  ANS004:769 03 22 B1 04 00 00 00 00
  $  REQ005:761 03 22 B0 0A 00 00 00 00       $  ANS005:769 03 22 B0 0A 00 00 00 00
  $  REQ006:761 03 22 D1 02 00 00 00 00       $  ANS006:769 03 22 D1 02 00 00 00 00
  $  REQ007:761 03 22 C0 0C 00 00 00 00       $  ANS007:769 03 22 C0 0C 00 00 00 00
  $  REQ008:761 03 22 C0 01 00 00 00 00       $  ANS008:769 03 22 C0 01 00 00 00 00
  $  REQ009:761 03 22 C0 10 00 00 00 00       $  ANS009:769 03 22 C0 10 00 00 00 00
  $  REQ010:761 03 22 C0 11 00 00 00 00       $  ANS010:769 03 22 C0 11 00 00 00 00
  $  REQ011:761 03 22 C0 12 00 00 00 00       $  ANS011:769 03 22 C0 12 00 00 00 00
  $  REQ012:761 03 22 C0 13 00 00 00 00       $  ANS012:769 03 22 C0 13 00 00 00 00
  $  REQ013:761 03 22 C0 14 00 00 00 00       $  ANS013:769 03 22 C0 14 00 00 00 00
  $  REQ014:761 03 22 C0 16 00 00 00 00       $  ANS014:769 03 22 C0 16 00 00 00 00
  $  REQ015:761 03 22 C0 17 00 00 00 00       $  ANS015:769 03 22 C0 17 00 00 00 00
  $  REQ016:761 03 22 C0 18 00 00 00 00       $  ANS016:769 03 22 C0 18 00 00 00 00
  $  REQ017:761 03 22 C0 02 00 00 00 00       $  ANS017:769 03 22 C0 02 00 00 00 00
  $  REQ018:761 03 22 C0 20 00 00 00 00       $  ANS018:769 03 22 C0 20 00 00 00 00
  $  REQ019:761 03 22 C0 21 00 00 00 00       $  ANS019:769 03 22 C0 21 00 00 00 00
  $  REQ020:761 03 22 C0 22 00 00 00 00       $  ANS020:769 03 22 C0 22 00 00 00 00
  $  REQ021:761 03 22 C0 23 00 00 00 00       $  ANS021:769 03 22 C0 23 00 00 00 00
  $  REQ022:761 03 22 C0 24 00 00 00 00       $  ANS022:769 03 22 C0 24 00 00 00 00
  $  REQ023:761 03 22 C0 25 00 00 00 00       $  ANS023:769 03 22 C0 25 00 00 00 00
  $  REQ024:761 03 22 C0 26 00 00 00 00       $  ANS024:769 03 22 C0 26 00 00 00 00
  $  REQ025:761 03 22 C0 27 00 00 00 00       $  ANS025:769 03 22 C0 27 00 00 00 00
  $  REQ026:761 03 22 C0 03 00 00 00 00       $  ANS026:769 03 22 C0 03 00 00 00 00
  $  REQ027:761 03 22 C0 04 00 00 00 00       $  ANS027:769 03 22 C0 04 00 00 00 00
  $  REQ028:761 03 22 C0 05 00 00 00 00       $  ANS028:769 03 22 C0 05 00 00 00 00
  $  REQ029:761 03 22 C0 06 00 00 00 00       $  ANS029:769 03 22 C0 06 00 00 00 00
  $  REQ030:761 03 22 C0 07 00 00 00 00       $  ANS030:769 03 22 C0 07 00 00 00 00
  $  REQ031:761 03 22 C0 08 00 00 00 00       $  ANS031:769 03 22 C0 08 00 00 00 00
  $  REQ032:761 03 22 C0 09 00 00 00 00       $  ANS032:769 03 22 C0 09 00 00 00 00
  $  REQ033:761 03 22 C0 0A 00 00 00 00       $  ANS033:769 03 22 C0 0A 00 00 00 00
  $  REQ034:761 03 22 C0 0B 00 00 00 00       $  ANS034:769 03 22 C0 0B 00 00 00 00
  $  REQ035:761 03 22 C0 0D 00 00 00 00       $  ANS035:769 03 22 C0 0D 00 00 00 00
  $  REQ036:761 03 22 C0 0E 00 00 00 00       $  ANS036:769 03 22 C0 0E 00 00 00 00
  $  REQ037:761 03 22 C0 0F 00 00 00 00       $  ANS037:769 03 22 C0 0F 00 00 00 00

  $  000.当前电瓶电压                          $    $  V        $    $  ANS000.BYTE004  $  y=x*0.1;
  $  001.当前MIC电压                           $    $  V        $    $  ANS000.BYTE005  $  y=x*0.1;
  $  002.当前调谐器天线电压                    $    $  V        $    $  ANS000.BYTE006  $  y=x*0.1;
  $  003.当前左转向轮控制器电压                $    $  V        $    $  ANS000.BYTE007  $  y=x*0.1;
  $  004.当前右方向盘控制电压                  $    $  V        $    $  ANS000.BYTE008  $  y=x*0.1;
  $  005.FICM MPU 软件号                       $    $           $    $  ANS001.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  006.FICM PDSN 号                          $    $           $    $  ANS002.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  007.配置(时区)                            $    $           $    $  ANS003.BYTE004  $  y=x;
  $  008.IFP软件版本                           $    $           $    $  ANS004.BYTE004  $  y=UINT64(x3,x4,x5,x6,x7,x8,x9,x10);
  $  009.动力模式                              $    $           $    $  ANS005.BYTE004  $  if(((x&0xE0)>>5)==0) y=@0137;else if(((x&0xE0)>>5)==1) y=@009d;else if(((x&0xE0)>>5)==2) y=@0a00;else if(((x&0xE0)>>5)==3) y=@0474;else if(((x&0xE0)>>5)==4) y=@0655;else if(((x&0xE0)>>5)==5) y=@122e;else if(((x&0xE0)>>5)==6) y=@0657;else if(((x&0xE0)>>5)==7) y=@0525;else y=@0103;
  $  010.方向盘控制_音量升                     $    $           $    $  ANS006.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0004;
  $  011.方向盘控制音量减小                    $    $           $    $  ANS006.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0004;
  $  012.方向盘控制上寻                        $    $           $    $  ANS006.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  013.方向盘控制_向下搜索                   $    $           $    $  ANS006.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0004;
  $  014.方向盘控制_静音                       $    $           $    $  ANS006.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0004;
  $  015.方向盘控制_呼叫拒绝                   $    $           $    $  ANS006.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0004;
  $  016.方向盘控制源                          $    $           $    $  ANS006.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  017.方向盘*按键                           $    $           $    $  ANS006.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  018.方向盘控制语音控制                    $    $           $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0004;
  $  019.FIP_HOME                              $    $           $    $  ANS006.BYTE006  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0004;
  $  020.汽车空气净化器系统                    $    $           $    $  ANS007.BYTE004  $  if(x==0) y=@08ea;else if(x==1) y=@122f;else if(x==2) y=@1230;else if(x==3) y=@1231;else if(x==4) y=@1232;else if(x==5) y=@1233;else if(x==6) y=@1234;else y=@0103;
  $  021.车辆类型                              $    $           $    $  ANS007.BYTE005  $  if(x==127) y=@06d5;else if(x==128) y=@058e;else if(x==129) y=@0162;else if(x==130) y=@1235;else if(x==131) y=@0d75;else if(x==132) y=@1236;else if(x==133) y=@1237;else if(x==134) y=@0d9f;else if(x==135) y=@1238;else if(x==136) y=@1239;else if(x==137) y=@123a;else y=@0103;
  $  022.板卡信息                              $    $           $    $  ANS007.BYTE006  $  if(x==136) y=@123b;else if(x==137) y=@123c;else if(x==160) y=@123d;else if(x==161) y=@123e;else if(x==208) y=@123f;else if(x==209) y=@1240;else if(x==211) y=@1241;else if(x==227) y=@1242;else y=@0103;
  $  023.导航芯片                              $    $           $    $  ANS007.BYTE007  $  if(x==0) y=@09c5;else if(x==1) y=@06d9;else y=@0103;
  $  024.车身颜色类型配置                      $    $           $    $  ANS008.BYTE004  $  if(x==0x00) y=@06e2;else if(x==0x01) y=@06e3;else if(x==0x02) y=@06e4;else if(x==0x03) y=@0997;else if(x==0x04) y=@06e6;else if(x==0x05) y=@06e7;else if(x==0x06) y=@06e8;else if(x==0x07) y=@0cf4;else if(x==0x08) y=@06ea;else if(x==0x09) y=@1243;else if(x==0x0A) y=@1244;else if(x==0x0B) y=@1245;else if(x==0x0C) y=@06ee;else if(x==0x0D) y=@06ef;else if(x==0x0E) y=@06f0;else if(x==0x0F) y=@0998;else if(x==0x10) y=@1246;else if(x==0x11) y=@1247;else if(x==0x12) y=@0cf5;else if(x==0x13) y=@1248;else y=@0103;
  $  025.空调类型配置                          $    $           $    $  ANS008.BYTE005  $  if(x==0x00) y=@120d;else if(x==0x01) y=@120e;else if(x==0x02) y=@120f;else if(x==0x03) y=@1210;else if(x==0x04) y=@1211;else if(x==0x05) y=@1212;else if(x==0x06) y=@1213;else if(x==0x07) y=@1214;else if(x==0x08) y=@1215;else if(x==0x09) y=@1216;else if(x==0x0A) y=@1217;else if(x==0x0B) y=@1218;else y=@0103;
  $  026.第三排座椅加热                        $    $           $    $  ANS008.BYTE006  $  if(((x&0xC0)>>6)==0) y=@1219;else if(((x&0xC0)>>6)==1) y=@121a;else if(((x&0xC0)>>6)==2) y=@121b;else if(((x&0xC0)>>6)==3) y=@121c;else y=@0004;
  $  027.第二排座椅加热                        $    $           $    $  ANS008.BYTE006  $  if(((x&0x30)>>4)==0) y=@121d;else if(((x&0x30)>>4)==1) y=@121e;else if(((x&0x30)>>4)==2) y=@121f;else if(((x&0x30)>>4)==3) y=@1220;else y=@0004;
  $  028.副驾驶员座椅加热                      $    $           $    $  ANS008.BYTE006  $  if(((x&0x0C)>>2)==0) y=@1221;else if(((x&0x0C)>>2)==1) y=@1222;else if(((x&0x0C)>>2)==2) y=@1223;else if(((x&0x0C)>>2)==3) y=@1224;else y=@0004;
  $  029.主驾座椅加热                          $    $           $    $  ANS008.BYTE006  $  if((x&0x03)==0) y=@1225;else if((x&0x03)==1) y=@1226;else if((x&0x03)==2) y=@1227;else if((x&0x03)==3) y=@1228;else y=@0004;
  $  030.胎压监测系统类型配置                  $    $           $    $  ANS008.BYTE007  $  if(x==0) y=@06f3;else if(x==1) y=@1229;else if(x==2) y=@122a;else y=@0103;
  $  031.超速报警标志                          $    $           $    $  ANS009.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  032.超速报警                              $    $  km/h     $    $  ANS009.BYTE005  $  y=x;
  $  033.报警灵敏度                            $    $           $    $  ANS009.BYTE007  $  if(((x&0xF0)>>4)==0) y=@098b;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@098c;else y=@0103;
  $  034.车道偏离警告                          $    $           $    $  ANS009.BYTE007  $  if((x&0x0F)==0) y=@122b;else if((x&0x0F)==1) y=@122c;else if((x&0x0F)==2) y=@122d;else y=@0103;
  $  035.盲点检测报警                          $    $           $    $  ANS010.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  036.驾驶员疲劳提示                        $    $           $    $  ANS010.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  037.360度全景停车（低速开启转向灯）       $    $           $    $  ANS010.BYTE006  $  if(((x&0xF0)>>4)==0) y=@000f;else if(((x&0xF0)>>4)==1) y=@0028;else y=@0103;
  $  038.360度全景泊车(车辆起步开启)           $    $           $    $  ANS010.BYTE006  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  039.前碰撞系统（报警灵敏度）              $    $           $    $  ANS010.BYTE007  $  if(((x&0xF0)>>4)==0) y=@098b;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@098c;else y=@0103;
  $  040.正面碰撞系统（前碰撞警告）            $    $           $    $  ANS010.BYTE007  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else if((x&0x0F)==2) y=@1327;else y=@0103;
  $  041.伴我回家(保持亮灯时间)                $    $           $    $  ANS011.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0004;
  $  042.回家功能状态                          $    $           $    $  ANS011.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  043.寻车反馈                              $    $           $    $  ANS011.BYTE005  $  if(x==0) y=@0111;else if(x==1) y=@08ee;else y=@0004;
  $  044.无钥匙解锁                            $    $           $    $  ANS011.BYTE006  $  if(((x&0x20)>>5)==0) y=@131a;else if(((x&0x20)>>5)==1) y=@08a0;else y=@0004;
  $  045.钥匙解锁                              $    $           $    $  ANS011.BYTE006  $  if(((x&0x10)>>4)==0) y=@131a;else if(((x&0x10)>>4)==1) y=@08a0;else y=@0004;
  $  046.车辆上锁反馈                          $    $           $    $  ANS011.BYTE006  $  if(((x&0x0C)>>2)==1) y=@08ee;else if(((x&0x0C)>>2)==2) y=@0111;else if(((x&0x0C)>>2)==3) y=@131e;else y=@0004;
  $  047.熄火自动解锁                          $    $           $    $  ANS011.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  048.行车自动落锁                          $    $           $    $  ANS011.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  049.座椅自动调节                          $    $           $    $  ANS011.BYTE007  $  if(((x&0xC0)>>6)==0) y=@131f;else if(((x&0xC0)>>6)==1) y=@1320;else y=@0004;
  $  050.清除所有记忆功能                      $    $           $    $  ANS011.BYTE007  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  051.后视镜及座椅钥匙记忆功能              $    $           $    $  ANS011.BYTE007  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0004;
  $  052.车外后视镜倒车自动下倾                $    $           $    $  ANS011.BYTE007  $  if(((x&0x0E)>>1)==0) y=@0994;else if(((x&0x0E)>>1)==1) y=@0995;else if(((x&0x0E)>>1)==2) y=@0996;else if(((x&0x0E)>>1)==3) y=@1357;else y=@0004;
  $  053.自动折叠/展开                         $    $           $    $  ANS011.BYTE007  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  054.方向盘自定义                          $    $           $    $  ANS012.BYTE004  $  if(x==0) y=@064f;else if(x==1) y=@1325;else y=@0103;
  $  055.语言                                  $    $           $    $  ANS013.BYTE004  $  if(x==0) y=@0487;else if(x==1) y=@0901;else if(x==2) y=@08bf;else if(x==3) y=@08ca;else if(x==4) y=@08b7;else y=@0004;
  $  056.日期格式                              $    $           $    $  ANS013.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0b11;else if(((x&0xF0)>>4)==1) y=@0b12;else if(((x&0xF0)>>4)==2) y=@0b13;else y=@0004;
  $  057.时间格式                              $    $           $    $  ANS013.BYTE005  $  if((x&0x01)==0) y=@05ed;else if((x&0x01)==1) y=@05ec;else y=@0004;
  $  058.限速标识识别                          $    $           $    $  ANS014.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  059.前方停车距离控制                      $    $           $    $  ANS014.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  060.迎宾灯(保持亮灯时间)                  $    $           $    $  ANS015.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0004;
  $  061.迎宾灯状态                            $    $           $    $  ANS015.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  062.单色氛围灯                            $    $           $    $  ANS015.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  063.一键升窗                              $    $           $    $  ANS015.BYTE006  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  064.ATS(全地形系统)显示特效               $    $           $    $  ANS015.BYTE007  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0004;
  $  065.空气净化器                            $    $           $    $  ANS016.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  066.车道偏离警告系统                      $    $           $    $  ANS017.BYTE004  $  if(x==0) y=@1259;else if(x==1) y=@125a;else y=@0103;
  $  067.紧急自动刹车系统                      $    $           $    $  ANS017.BYTE005  $  if(x==0) y=@125b;else if(x==1) y=@0904;else y=@0103;
  $  068.360度全景影像配置                     $    $           $    $  ANS017.BYTE006  $  if(x==0) y=@125c;else if(x==1) y=@125d;else if(x==2) y=@0951;else if(x==3) y=@125e;else if(x==4) y=@125f;else if(x==5) y=@1260;else y=@0103;
  $  069.车载显示器类型配置                    $    $           $    $  ANS017.BYTE007  $  if(x==0x00) y=@1261;else if(x==0x01) y=@0004;else if(x==0x02) y=@1262;else if(x==0x03) y=@1263;else if(x==0x04) y=@0004;else if(x==0x05) y=@1264;else if(x==0x06) y=@017e;else if(x==0x07) y=@0cc1;else if(x==0x08) y=@1265;else if(x==0x09) y=@0c73;else if(x==0x0A) y=@0c74;else if(x==0x0B) y=@0c75;else if(x==0x0C) y=@0c76;else if(x==0x0D) y=@0c77;else if(x==0x0E) y=@0c78;else if(x==0x0F) y=@0c79;else if(x==0x10) y=@1266;else if(x==0x11) y=@1267;else if(x==0x12) y=@0c7e;else if(x==0x13) y=@0c7f;else if(x==0x14) y=@1268;else if(x==0x15) y=@1269;else if(x==0x16) y=@126a;else y=@0103;
  $  070.驾驶模式                              $    $           $    $  ANS018.BYTE004  $  if(x==0) y=@126b;else if(x==1) y=@0b03;else y=@0103;
  $  071.发动机启停功能                        $    $           $    $  ANS018.BYTE005  $  if(x==0) y=@126c;else if(x==1) y=@126d;else y=@0103;
  $  072.后视镜类型                            $    $           $    $  ANS018.BYTE006  $  if(x==0) y=@06de;else if(x==1) y=@126e;else if(x==2) y=@06df;else if(x==3) y=@126f;else y=@0103;
  $  073.变道辅助系统                          $    $           $    $  ANS018.BYTE007  $  if(x==0) y=@0692;else if(x==1) y=@1270;else y=@0103;
  $  074.抬头显示                              $    $           $    $  ANS019.BYTE004  $  if(x==0) y=@1249;else if(x==1) y=@124a;else if(x==2) y=@124b;else if(x==3) y=@124c;else if(x==4) y=@0004;else y=@0103;
  $  075.车外温度传感器                        $    $           $    $  ANS019.BYTE005  $  if(x==0) y=@124d;else if(x==1) y=@124e;else y=@0103;
  $  076.APA泊车                               $    $           $    $  ANS019.BYTE006  $  if(x==0) y=@124f;else if(x==1) y=@1250;else if(x==2) y=@1251;else if(x==3) y=@1252;else y=@0103;
  $  077.后方穿越提醒                          $    $           $    $  ANS019.BYTE007  $  if(x==0) y=@1253;else if(x==1) y=@1254;else y=@0103;
  $  078.副驾驶员气囊                          $    $           $    $  ANS020.BYTE004  $  if(((x&0xF0)>>4)==0) y=@1255;else if(((x&0xF0)>>4)==1) y=@1256;else y=@0103;
  $  079.驾驶员安全气囊                        $    $           $    $  ANS020.BYTE004  $  if((x&0x0F)==0) y=@1257;else if((x&0x0F)==1) y=@1258;else y=@0103;
  $  080.气帘                                  $    $           $    $  ANS020.BYTE005  $  if(((x&0xF0)>>4)==0) y=@09b6;else if(((x&0xF0)>>4)==1) y=@09b7;else y=@0103;
  $  081.主副驾侧气囊                          $    $           $    $  ANS020.BYTE005  $  if((x&0x0F)==0) y=@09b8;else if((x&0x0F)==1) y=@09b9;else y=@0103;
  $  082.安全带提示                            $    $           $    $  ANS020.BYTE006  $  if(x==0) y=@0992;else if(x==1) y=@0aed;else if(x==2) y=@0aee;else y=@0103;
  $  083.雨量传感器                            $    $           $    $  ANS020.BYTE007  $  if(x==0) y=@0aef;else if(x==1) y=@0af0;else y=@0103;
  $  084.车联网                                $    $           $    $  ANS021.BYTE004  $  if(x==0) y=@048c;else if(x==1) y=@06e0;else if(x==2) y=@06e1;else if(x==3) y=@048e;else y=@0103;
  $  085.手机互联网                            $    $           $    $  ANS021.BYTE005  $  if(x==0) y=@095c;else if(x==1) y=@0af1;else y=@0103;
  $  086.Car Play                              $    $           $    $  ANS021.BYTE006  $  if(x==0) y=@095c;else if(x==1) y=@0af1;else y=@0103;
  $  087.Carlife                               $    $           $    $  ANS021.BYTE007  $  if(x==0) y=@095c;else if(x==1) y=@0af1;else y=@0103;
  $  088.车道保持辅助系统                      $    $           $    $  ANS022.BYTE004  $  if(x==0) y=@09a7;else if(x==1) y=@09a6;else y=@0103;
  $  089.自适应巡航控制                        $    $           $    $  ANS022.BYTE005  $  if(x==0) y=@0463;else if(x==1) y=@11eb;else y=@0103;
  $  090.限速识别                              $    $           $    $  ANS022.BYTE006  $  if(x==0) y=@11ec;else if(x==1) y=@11ed;else y=@0103;
  $  091.座椅记忆系统                          $    $           $    $  ANS022.BYTE007  $  if(x==0) y=@094e;else if(x==1) y=@094d;else y=@0103;
  $  092.驾驶预警系统                          $    $           $    $  ANS023.BYTE004  $  if(x==0) y=@12f4;else if(x==1) y=@133f;else y=@0103;
  $  093.迎宾灯                                $    $           $    $  ANS023.BYTE005  $  if(x==0) y=@095e;else if(x==1) y=@095f;else y=@0103;
  $  094.氛围灯分区调整                        $    $           $    $  ANS023.BYTE006  $  if(x==0) y=@0967;else if(x==1) y=@11ee;else if(x==2) y=@11ef;else if(x==3) y=@11f0;else y=@0103;
  $  095.氛围灯颜色                            $    $           $    $  ANS023.BYTE007  $  if(x==0) y=@0960;else if(x==1) y=@11db;else if(x==2) y=@11dc;else if(x==3) y=@0963;else if(x==4) y=@0964;else if(x==5) y=@0965;else if(x==6) y=@11dd;else if(x==7) y=@11de;else y=@0103;
  $  096.ANC                                   $    $           $    $  ANS024.BYTE004  $  if(x==0) y=@11df;else if(x==1) y=@11e0;else y=@0103;
  $  097.支架                                  $    $           $    $  ANS024.BYTE005  $  if(x==0) y=@11e1;else if(x==1) y=@11e2;else y=@0103;
  $  098.立即充电                              $    $           $    $  ANS024.BYTE006  $  if(x==0) y=@11e3;else if(x==1) y=@11e4;else if(x==2) y=@11e5;else y=@0103;
  $  099.天眼                                  $    $           $    $  ANS024.BYTE007  $  if(x==0) y=@11e6;else if(x==1) y=@11e7;else y=@0103;
  $  100.雨天自动关窗                          $    $           $    $  ANS025.BYTE004  $  if(x==0) y=@11e8;else if(x==1) y=@11e9;else y=@0103;
  $  101.行车记录仪                            $    $           $    $  ANS025.BYTE005  $  if(x==0) y=@00ca;else if(x==1) y=@00c9;else y=@0103;
  $  102.网中网                                $    $           $    $  ANS025.BYTE006  $  if(x==0) y=@00ca;else if(x==1) y=@00c9;else y=@0103;
  $  103.哨兵模式                              $    $           $    $  ANS025.BYTE007  $  if(x==0) y=@00ca;else if(x==1) y=@00c9;else y=@0103;
  $  104.后排乘客区车窗玻璃升降类型            $    $           $    $  ANS026.BYTE004  $  if(((x&0x30)>>4)==0) y=@11ea;else if(((x&0x30)>>4)==1) y=@072f;else if(((x&0x30)>>4)==2) y=@0730;else if(((x&0x30)>>4)==3) y=@0004;else y=@0004;
  $  105.副驾车窗玻璃升降类型                  $    $           $    $  ANS026.BYTE004  $  if(((x&0x0C)>>2)==0) y=@11fb;else if(((x&0x0C)>>2)==1) y=@072d;else if(((x&0x0C)>>2)==2) y=@072e;else if(((x&0x0C)>>2)==3) y=@0004;else y=@0004;
  $  106.主驾车窗玻璃升降类型                  $    $           $    $  ANS026.BYTE004  $  if((x&0x03)==0) y=@11fc;else if((x&0x03)==1) y=@072a;else if((x&0x03)==2) y=@072b;else if((x&0x03)==3) y=@0004;else y=@0004;
  $  107.远程信息处理系统类型配置              $    $           $    $  ANS026.BYTE005  $  if(x==0) y=@11fd;else if(x==1) y=@11fe;else if(x==2) y=@11ff;else if(x==3) y=@1200;else if(x==4) y=@1201;else if(x==5) y=@1202;else if(x==6) y=@1203;else if(x==7) y=@1204;else y=@0103;
  $  108.车辆导航配置                          $    $           $    $  ANS026.BYTE006  $  if(x==0) y=@0739;else if(x==1) y=@05aa;else y=@0103;
  $  109.免提配置                              $    $           $    $  ANS026.BYTE007  $  if(x==0) y=@073b;else if(x==1) y=@073a;else y=@0103;
  $  110.车载信息娱乐显示级别类型配置          $    $           $    $  ANS027.BYTE004  $  if(x==0) y=@073c;else if(x==1) y=@1205;else if(x==2) y=@1206;else if(x==3) y=@1207;else if(x==4) y=@1208;else if(x==5) y=@1209;else if(x==6) y=@120a;else y=@0103;
  $  111.DAB数字音频广播配置                   $    $           $    $  ANS027.BYTE005  $  if(x==0) y=@0692;else if(x==1) y=@120b;else y=@0103;
  $  112.停车辅助系统类型配置                  $    $           $    $  ANS027.BYTE006  $  if(x==0) y=@097f;else if(x==1) y=@0980;else if(x==2) y=@0981;else if(x==3) y=@0982;else if(x==4) y=@120c;else y=@0103;
  $  113.右后下摄像头类型配置                  $    $           $    $  ANS027.BYTE007  $  if(x==0) y=@0710;else if(x==1) y=@11f1;else if(x==2) y=@070d;else if(x==3) y=@08e2;else if(x==4) y=@11f2;else if(x==5) y=@070a;else if(x==6) y=@098a;else y=@0103;
  $  114.方向盘遥控功能配置                    $    $           $    $  ANS028.BYTE004  $  if(x==0) y=@11f3;else if(x==1) y=@0711;else if(x==2) y=@11f4;else y=@0103;
  $  115.汽车音频类型配置                      $    $           $    $  ANS028.BYTE005  $  if(x==0) y=@0714;else if(x==1) y=@0715;else if(x==2) y=@11f5;else if(x==3) y=@0717;else y=@0103;
  $  116.AUX(音频)端口配置                     $    $           $    $  ANS028.BYTE006  $  if(x==0) y=@096c;else if(x==1) y=@0718;else y=@0103;
  $  117.视频输入功能配置                      $    $           $    $  ANS028.BYTE007  $  if(x==0) y=@071b;else if(x==1) y=@071a;else y=@0103;
  $  118.USB端口类型配置                       $    $           $    $  ANS029.BYTE004  $  if(x==0) y=@11f6;else if(x==1) y=@11f7;else if(x==2) y=@071c;else if(x==3) y=@071d;else y=@0103;
  $  119.FM收音机步进 50KHz                    $    $           $    $  ANS029.BYTE005  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@00ca;else y=@0004;
  $  120.FM收音机步进 100KHz                   $    $           $    $  ANS029.BYTE005  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0004;
  $  121.AM收音机步进 10KHz                    $    $           $    $  ANS029.BYTE005  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  122.AM收音机步进 9KHz                     $    $           $    $  ANS029.BYTE005  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  123.收音机频段 FM 87.5~108 MHZ            $    $           $    $  ANS029.BYTE006  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0004;
  $  124.收音机频段 AM 531~1629 KHZ            $    $           $    $  ANS029.BYTE006  $  if(((x&0x08)>>3)==0) y=@00c9;else if(((x&0x08)>>3)==1) y=@00ca;else y=@0004;
  $  125.收音机频段 AM 522~1710 KHZ            $    $           $    $  ANS029.BYTE006  $  if(((x&0x04)>>2)==0) y=@00c9;else if(((x&0x04)>>2)==1) y=@00ca;else y=@0004;
  $  126.收音机频段 AM 530~1710 KHZ            $    $           $    $  ANS029.BYTE006  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  127.收音机频段 AM 531~1602 KHZ            $    $           $    $  ANS029.BYTE006  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  128.扬声器类型配置                        $    $           $    $  ANS029.BYTE007  $  if(x==0) y=@069d;else if(x==1) y=@069e;else if(x==2) y=@11f8;else if(x==3) y=@11f9;else if(x==4) y=@11fa;else y=@0103;
  $  129.iPod设备配置                          $    $           $    $  ANS030.BYTE004  $  if(x==0) y=@0692;else if(x==1) y=@096f;else y=@0103;
  $  130.汽车车型年份配置                      $    $           $    $  ANS030.BYTE005  $  if(x==0) y=@06a3;else if(x==1) y=@0971;else if(x==2) y=@06a5;else if(x==3) y=@06a6;else if(x==4) y=@06a7;else if(x==5) y=@06a8;else if(x==6) y=@06a9;else if(x==7) y=@06aa;else if(x==8) y=@06ab;else y=@0103;
  $  131.欢迎模式配置                          $    $           $    $  ANS030.BYTE006  $  if(x==0) y=@1277;else if(x==1) y=@1278;else y=@0103;
  $  132.车身类型配置                          $    $           $    $  ANS030.BYTE007  $  if(x==0x00) y=@1279;else if(x==0x01) y=@127a;else if(x==0x02) y=@127b;else if(x==0x03) y=@127c;else if(x==0x04) y=@127d;else if(x==0x05) y=@127e;else if(x==0x06) y=@127f;else if(x==0x07) y=@1280;else if(x==0x08) y=@00f3;else if(x==0x09) y=@06b4;else if(x==0x0A) y=@06b5;else y=@0103;
  $  133.汽车品牌配置                          $    $           $    $  ANS031.BYTE004  $  if(x==0x00) y=@066a;else if(x==0x01) y=@066b;else if(x==0x02) y=@0cf7;else if(x==0x03) y=@1281;else y=@0103;
  $  134.汽车国家代码配置                      $    $           $    $  ANS031.BYTE005  $  if(x==0x00) y=@00d8;else if(x==0x01) y=@066d;else if(x==0x02) y=@066e;else if(x==0x03) y=@066f;else if(x==0x04) y=@0670;else if(x==0x05) y=@0671;else if(x==0x06) y=@0672;else if(x==0x07) y=@0673;else if(x==0x08) y=@0674;else if(x==0x09) y=@0675;else if(x==0x0A) y=@0676;else if(x==0x0B) y=@0677;else if(x==0x0C) y=@0678;else if(x==0x0D) y=@0679;else if(x==0x0E) y=@067a;else if(x==0x0F) y=@067b;else if(x==0x10) y=@067c;else if(x==0x11) y=@09c9;else if(x==0x12) y=@08c2;else y=@0103;
  $  135.主驾驶方向配置                        $    $           $    $  ANS031.BYTE006  $  if(x==0) y=@067d;else if(x==1) y=@067e;else y=@0103;
  $  136.汽车发动机类型配置                    $    $           $    $  ANS031.BYTE007  $  if(x==0) y=@1282;else if(x==1) y=@1283;else y=@0103;
  $  137.变速箱类型配置                        $    $           $    $  ANS032.BYTE004  $  if(x==0) y=@00e3;else if(x==1) y=@00e2;else if(x==2) y=@1092;else if(x==3) y=@0004;else if(x==4) y=@0004;else y=@0103;
  $  138.汽车尾门操作类型配置                  $    $           $    $  ANS032.BYTE005  $  if(x==0) y=@0690;else if(x==1) y=@09cd;else if(x==2) y=@09ce;else if(x==3) y=@1284;else y=@0103;
  $  139.盲点信息系统配置                      $    $           $    $  ANS032.BYTE006  $  if(x==0) y=@0692;else if(x==1) y=@09ab;else y=@0103;
  $  140.行人警告系统配置                      $    $           $    $  ANS032.BYTE007  $  if(x==0) y=@0692;else if(x==1) y=@1271;else y=@0103;
  $  141.速度警报系统配置                      $    $           $    $  ANS033.BYTE004  $  if(x==0) y=@09cf;else if(x==1) y=@0692;else y=@0103;
  $  142.自动紧急呼叫配置                      $    $           $    $  ANS033.BYTE005  $  if(x==0) y=@0692;else if(x==1) y=@03de;else y=@0103;
  $  143.汽车天窗类型配置                      $    $           $    $  ANS033.BYTE006  $  if(x==0) y=@0695;else if(x==1) y=@1272;else if(x==2) y=@0b15;else if(x==3) y=@1273;else y=@0103;
  $  144.混合动力类型配置                      $    $           $    $  ANS033.BYTE007  $  if(x==0) y=@09d0;else if(x==1) y=@06cd;else if(x==2) y=@06ce;else if(x==3) y=@06cf;else if(x==4) y=@1274;else y=@0103;
  $  145.生态驱动模式配置                      $    $           $    $  ANS034.BYTE004  $  if(x==0) y=@09be;else if(x==1) y=@1275;else y=@0103;
  $  146.FCW正面碰撞警告配置                   $    $           $    $  ANS034.BYTE005  $  if(x==0) y=@094f;else if(x==1) y=@0950;else y=@0103;
  $  147.吸顶屏                                $    $           $    $  ANS034.BYTE006  $  if(x==0) y=@0692;else if(x==1) y=@1276;else y=@0103;
  $  148.光线传感器配置                        $    $           $    $  ANS034.BYTE007  $  if(x==0) y=@09c0;else if(x==1) y=@09c1;else y=@0103;
  $  149.语音识别                              $    $           $    $  ANS035.BYTE004  $  if(x==0) y=@06da;else if(x==1) y=@1287;else y=@0103;
  $  150.ABS/ESP                               $    $           $    $  ANS035.BYTE005  $  if(x==0) y=@09c6;else if(x==1) y=@09c7;else if(x==2) y=@06b7;else y=@0103;
  $  151.SAS(方向盘转向角传感器)是否配置       $    $           $    $  ANS035.BYTE006  $  if(x==0) y=@06ba;else if(x==1) y=@06b9;else y=@0103;
  $  152.PEPS(无钥匙控制无钥匙启动系统)        $    $           $    $  ANS035.BYTE007  $  if(x==0) y=@003d;else if(x==1) y=@06bb;else y=@0103;
  $  153.WIFI(无线网络)                        $    $           $    $  ANS036.BYTE004  $  if(x==0) y=@09d2;else if(x==1) y=@09d3;else y=@0103;
  $  154.轴距                                  $    $           $    $  ANS036.BYTE005  $  if(x==0) y=@06be;else if(x==1) y=@06bf;else y=@0103;
  $  155.底盘高度                              $    $           $    $  ANS036.BYTE006  $  if(x==0) y=@06c0;else if(x==1) y=@06c1;else if(x==3) y=@135d;else y=@0103;
  $  156.驱动类型                              $    $           $    $  ANS036.BYTE007  $  if(x==0) y=@09d5;else if(x==1) y=@0559;else if(x==2) y=@1288;else if(x==3) y=@05dd;else y=@0103;
  $  157.外置高清360模块                       $    $           $    $  ANS037.BYTE004  $  if(x==0) y=@00c9;else if(x==1) y=@00ca;else y=@0103;
  $  158.超速报警                              $    $           $    $  ANS037.BYTE005  $  if(x==0) y=@0028;else if(x==1) y=@000f;else y=@0103;
  $  159.车速限制                              $    $           $    $  ANS037.BYTE006  $  if(x==0) y=@12d0;else if(x==1) y=@12fc;else if(x==2) y=@13a9;else y=@0103;
  $  160.前向PDC                               $    $           $    $  ANS037.BYTE007  $  if(x==0) y=@1285;else if(x==1) y=@1286;else y=@0103;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
