
    车型ID：1113

    模拟：协议模拟-->1113

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:742 02 10 01 00 00 00 00 00       $~  ANS000:7C2 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:742 02 3E 80 00 00 00 00 00       $!  ANS000:7C2 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:742 03 19 02 09 00 00 00 00       $#  ANS000:7C2 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/11000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:742 04 14 FF FF FF 00 00 00       $$  ANS000:7C2 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:742 03 22 F1 86 00 00 00 00       $%  ANS000:7C2 03 22 F1 86 00 00 00 00
  $%  REQ001:742 03 22 F1 A0 00 00 00 00       $%  ANS001:7C2 03 22 F1 A0 00 00 00 00
  $%  REQ002:742 03 22 F1 83 00 00 00 00       $%  ANS002:7C2 03 22 F1 83 00 00 00 00
  $%  REQ003:742 03 22 F1 91 00 00 00 00       $%  ANS003:7C2 03 22 F1 91 00 00 00 00
  $%  REQ004:742 03 22 F1 8B 00 00 00 00       $%  ANS004:7C2 03 22 F1 8B 00 00 00 00
  $%  REQ005:742 03 22 F1 A2 00 00 00 00       $%  ANS005:7C2 03 22 F1 A2 00 00 00 00
  $%  REQ006:742 03 22 F1 87 00 00 00 00       $%  ANS006:7C2 03 22 F1 87 00 00 00 00
  $%  REQ007:742 03 22 F1 A1 00 00 00 00       $%  ANS007:7C2 03 22 F1 A1 00 00 00 00
  $%  REQ008:742 03 22 F1 10 00 00 00 00       $%  ANS008:7C2 03 22 F1 10 00 00 00 00
  $%  REQ009:742 03 22 F1 92 00 00 00 00       $%  ANS009:7C2 03 22 F1 92 00 00 00 00
  $%  REQ010:742 03 22 F1 8C 00 00 00 00       $%  ANS010:7C2 03 22 F1 8C 00 00 00 00
  $%  REQ011:742 03 22 F1 94 00 00 00 00       $%  ANS011:7C2 03 22 F1 94 00 00 00 00
  $%  REQ012:742 03 22 F1 8A 00 00 00 00       $%  ANS012:7C2 03 22 F1 8A 00 00 00 00
  $%  REQ013:742 03 22 F1 90 00 00 00 00       $%  ANS013:7C2 03 22 F1 90 00 00 00 00
  $%  REQ014:742 03 22 F1 A8 00 00 00 00       $%  ANS014:7C2 03 22 F1 A8 00 00 00 00

  $%  000:主动诊断会话:                    $%    $%  ANS000.BYTE004  $%  HEX(X1);
  $%  001:电控单元应用软件号:              $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  002:电控单元刷写软件参考号:          $%    $%  ANS002.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元制造日期:                $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3);
  $%  005:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元标定软件号:              $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS008.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次):                  $%    $%  ANS008.BYTE015  $%  HEX(X1,X2,X3);
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:产品序列号:                      $%    $%  ANS010.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  013:生产线号码:                      $%    $%  ANS010.BYTE009  $%  ASCII(X1,X2);
  $%  014:年/月/日:                        $%    $%  ANS010.BYTE011  $%  HEX(X1,X2,X3);
  $%  015:供应商电控单元软件参考号:        $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  016:系统供应商标识号:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  017:车辆识别代码:                    $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  018:车辆特征信息:                    $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:742 03 22 C0 02 00 00 00 00       $  ANS000:7C2 03 22 C0 02 00 00 00 00
  $  REQ001:742 03 22 B0 03 00 00 00 00       $  ANS001:7C2 03 22 B0 03 00 00 00 00
  $  REQ002:742 03 22 B0 02 00 00 00 00       $  ANS002:7C2 03 22 B0 02 00 00 00 00
  $  REQ003:742 03 22 B0 01 00 00 00 00       $  ANS003:7C2 03 22 B0 01 00 00 00 00
  $  REQ004:742 03 22 C0 01 00 00 00 00       $  ANS004:7C2 03 22 C0 01 00 00 00 00
  $  REQ005:742 03 22 B0 04 00 00 00 00       $  ANS005:7C2 03 22 B0 04 00 00 00 00
  $  REQ006:742 03 22 20 40 00 00 00 00       $  ANS006:7C2 03 22 20 40 00 00 00 00
  $  REQ007:742 03 22 20 45 00 00 00 00       $  ANS007:7C2 03 22 20 45 00 00 00 00
  $  REQ008:742 03 22 D0 02 00 00 00 00       $  ANS008:7C2 03 22 D0 02 00 00 00 00
  $  REQ009:742 03 22 20 50 00 00 00 00       $  ANS009:7C2 03 22 20 50 00 00 00 00
  $  REQ010:742 03 22 C0 03 00 00 00 00       $  ANS010:7C2 03 22 C0 03 00 00 00 00
  $  REQ011:742 03 22 B0 05 00 00 00 00       $  ANS011:7C2 03 22 B0 05 00 00 00 00

  $  000.第二排右乘客扣开关输入BS2R                                    $    $           $    $  ANS000.BYTE004  $  if(((x&0x40)>>6)==0) y=@0119;else if(((x&0x40)>>6)==1) y=@011f;else y=@0035;
  $  001.第二排中间乘客扣开关输入BS2M                                  $    $           $    $  ANS000.BYTE004  $  if(((x&0x20)>>5)==0) y=@0119;else if(((x&0x20)>>5)==1) y=@011f;else y=@0035;
  $  002.第二排左乘客扣开关输入BS2L                                    $    $           $    $  ANS000.BYTE004  $  if(((x&0x10)>>4)==0) y=@0119;else if(((x&0x10)>>4)==1) y=@011f;else y=@0035;
  $  003.乘客扣开关输入BSP                                             $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0) y=@0119;else if(((x&0x08)>>3)==1) y=@011f;else y=@0035;
  $  004.驾驶员扣开关                                                  $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0) y=@0119;else if(((x&0x02)>>1)==1) y=@011f;else y=@0035;
  $  005.乘客气囊禁用开关(PADS)                                        $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  006.第三排右乘客扣开关输入                                        $    $           $    $  ANS000.BYTE005  $  if(((x&0x20)>>5)==0) y=@0119;else if(((x&0x20)>>5)==1) y=@011f;else y=@0035;
  $  007.第三排左乘客扣开关输入                                        $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0) y=@0119;else if(((x&0x10)>>4)==1) y=@011f;else y=@0035;
  $  008.硬件碰撞输出                                                  $    $           $    $  ANS000.BYTE006  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  009.SBR策略                                                       $    $           $    $  ANS000.BYTE007  $  if(((x&0x80)>>7)==0) y=@0113;else if(((x&0x80)>>7)==1) y=@0114;else y=@0035;
  $  010.网络碰撞信号                                                  $    $           $    $  ANS000.BYTE007  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  011.安全气囊控制单元在单次点火循环内的使用时间                    $    $  s        $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  012.安全气囊控制单元使用时间                                      $    $  s        $    $  ANS002.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  013.ACU(安全气囊控制器) 操作状态                                  $    $           $    $  ANS003.BYTE004  $  if(x==0) y=@0115;else if(x==1) y=@0116;else y=@0035;
  $  014.副驾驶乘员探测传感器状态(预留)                                $    $           $    $  ANS003.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0117;else if(((x&0xF0)>>4)==1) y=@0118;else if(((x&0xF0)>>4)==2) y=@0119;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0035;
  $  015.副驾驶气囊禁用开关状态                                        $    $           $    $  ANS003.BYTE005  $  if((x&0x0F)==0) y=@011a;else if((x&0x0F)==2) y=@011b;else if((x&0x0F)==4) y=@0119;else if((x&0x0F)==7) y=@0112;else y=@0035;
  $  016.前排副驾驶安全带插锁(占位传感器)状态                          $    $           $    $  ANS003.BYTE006  $  if(((x&0xF0)>>4)==0) y=@0108;else if(((x&0xF0)>>4)==1) y=@0109;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0035;
  $  017.前排驾驶员安全带插锁状态                                      $    $           $    $  ANS003.BYTE006  $  if((x&0x0F)==0) y=@010b;else if((x&0x0F)==1) y=@010c;else if((x&0x0F)==3) y=@010a;else y=@0035;
  $  018.ACU(安全气囊控制器) 激活状态                                  $    $           $    $  ANS003.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00b2;else y=@0035;
  $  019.VIN码锁定状态                                                 $    $           $    $  ANS003.BYTE007  $  if(((x&0x08)>>3)==0) y=@0052;else if(((x&0x08)>>3)==1) y=@016f;else y=@0035;
  $  020.碰撞发生与否                                                  $    $           $    $  ANS003.BYTE007  $  if(((x&0x04)>>2)==0) y=@010f;else if(((x&0x04)>>2)==1) y=@0110;else y=@0035;
  $  021.气囊警告灯状态                                                $    $           $    $  ANS003.BYTE007  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@016d;else if((x&0x03)==2) y=@0111;else y=@0035;
  $  022.副驾驶安全带提醒输出状态                                      $    $           $    $  ANS003.BYTE008  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@016d;else if(((x&0xC0)>>6)==2) y=@0111;else if(((x&0xC0)>>6)==3) y=@0112;else y=@0035;
  $  023.驾驶员安全带提醒输出状态                                      $    $           $    $  ANS003.BYTE008  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@016d;else if(((x&0x30)>>4)==2) y=@0111;else if(((x&0x30)>>4)==3) y=@0112;else y=@0035;
  $  024.副驾驶气囊 OFF 指示灯状态                                     $    $           $    $  ANS003.BYTE008  $  if(((x&0x0C)>>2)==0) y=@000f;else if(((x&0x0C)>>2)==1) y=@016d;else if(((x&0x0C)>>2)==2) y=@0119;else if(((x&0x0C)>>2)==3) y=@011c;else y=@0035;
  $  025.副驾驶气囊 ON 指示灯状态                                      $    $           $    $  ANS003.BYTE008  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@016d;else if((x&0x03)==2) y=@0119;else if((x&0x03)==3) y=@011c;else y=@0035;
  $  026.第二排左侧乘员探测传感器状态(预留)                            $    $           $    $  ANS003.BYTE009  $  if(((x&0xF0)>>4)==0) y=@0117;else if(((x&0xF0)>>4)==1) y=@0118;else if(((x&0xF0)>>4)==2) y=@0119;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0035;
  $  027.第二排中间乘 员探测传感器状态(预留)                           $    $           $    $  ANS003.BYTE009  $  if((x&0x0F)==0) y=@0117;else if((x&0x0F)==1) y=@0118;else if((x&0x0F)==2) y=@0119;else if((x&0x0F)==3) y=@010a;else y=@0035;
  $  028.第二排右侧乘员探测传感器状态(预留)                            $    $           $    $  ANS003.BYTE010  $  if(((x&0xF0)>>4)==0) y=@0117;else if(((x&0xF0)>>4)==1) y=@0118;else if(((x&0xF0)>>4)==2) y=@0119;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0035;
  $  029.第三排左侧乘员安全带插锁(+乘员占位传感器)状 态                $    $           $    $  ANS003.BYTE010  $  if((x&0x0F)==0) y=@0108;else if((x&0x0F)==1) y=@0109;else if((x&0x0F)==2) y=@0035;else if((x&0x0F)==3) y=@010a;else y=@0035;
  $  030.第二排左侧乘员安全带插锁(+乘员占位传感器)状态                 $    $           $    $  ANS003.BYTE011  $  if(((x&0xF0)>>4)==0) y=@0108;else if(((x&0xF0)>>4)==1) y=@0109;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0035;
  $  031.第二排中间乘员安全带插锁(+乘员占位传感器)状态                 $    $           $    $  ANS003.BYTE011  $  if((x&0x0F)==0) y=@0108;else if((x&0x0F)==1) y=@0109;else if((x&0x0F)==3) y=@010a;else y=@0035;
  $  032.第二排右侧乘员安全带插锁(+乘员占位传感器)状态                 $    $           $    $  ANS003.BYTE012  $  if(((x&0xF0)>>4)==0) y=@0108;else if(((x&0xF0)>>4)==1) y=@0109;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0035;
  $  033.第三排右侧乘员安全带插锁(+乘员占位传感器)状态                 $    $           $    $  ANS003.BYTE012  $  if((x&0x0F)==0) y=@0108;else if((x&0x0F)==1) y=@0109;else if((x&0x0F)==2) y=@0035;else if((x&0x0F)==3) y=@010a;else y=@0035;
  $  034.第二排左侧安全带提醒输出状态                                  $    $           $    $  ANS003.BYTE013  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@016d;else if(((x&0xC0)>>6)==2) y=@0111;else if(((x&0xC0)>>6)==3) y=@0112;else y=@0035;
  $  035.第二排中间安全带提醒输出状态                                  $    $           $    $  ANS003.BYTE013  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@016d;else if(((x&0x30)>>4)==2) y=@0111;else if(((x&0x30)>>4)==3) y=@0112;else y=@0035;
  $  036.第二排右侧安全带提醒输出状态                                  $    $           $    $  ANS003.BYTE013  $  if(((x&0x0C)>>2)==0) y=@000f;else if(((x&0x0C)>>2)==1) y=@016d;else if(((x&0x0C)>>2)==2) y=@0111;else if(((x&0x0C)>>2)==3) y=@0112;else y=@0035;
  $  037.乘客安全气囊(PAB)正面爆裂(第1阶段)FAP                         $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  038.驾驶员安全气囊(DAB)正面爆裂(第1阶段)FAD                       $    $           $    $  ANS004.BYTE005  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  039.第一排右帘安全气囊爆裂                                        $    $           $    $  ANS004.BYTE006  $  if(((x&0x02)>>1)==0) y=@0119;else if(((x&0x02)>>1)==1) y=@011f;else y=@0035;
  $  040.第一排右侧安全气囊爆裂                                        $    $           $    $  ANS004.BYTE006  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  041.第一排左帘安全气囊爆裂                                        $    $           $    $  ANS004.BYTE007  $  if(((x&0x02)>>1)==0) y=@0119;else if(((x&0x02)>>1)==1) y=@011f;else y=@0035;
  $  042.第一排左侧安全气囊爆裂                                        $    $           $    $  ANS004.BYTE007  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  043.第二排左侧预紧器牵引器BP2L                                    $    $           $    $  ANS004.BYTE008  $  if(((x&0x20)>>5)==0) y=@0119;else if(((x&0x20)>>5)==1) y=@011f;else y=@0035;
  $  044.第二排右侧预紧器牵引器BP2L                                    $    $           $    $  ANS004.BYTE008  $  if(((x&0x10)>>4)==0) y=@0119;else if(((x&0x10)>>4)==1) y=@011f;else y=@0035;
  $  045.带式预紧器乘客BLP                                             $    $           $    $  ANS004.BYTE008  $  if(((x&0x08)>>3)==0) y=@0119;else if(((x&0x08)>>3)==1) y=@011f;else y=@0035;
  $  046.带式预紧器驾驶员BLD                                           $    $           $    $  ANS004.BYTE008  $  if(((x&0x04)>>2)==0) y=@0119;else if(((x&0x04)>>2)==1) y=@011f;else y=@0035;
  $  047.第一排乘客座椅安全带预紧器牵引器BRP                           $    $           $    $  ANS004.BYTE008  $  if(((x&0x02)>>1)==0) y=@0119;else if(((x&0x02)>>1)==1) y=@011f;else y=@0035;
  $  048.第一排驾驶员座椅安全带预紧器拉钩BRD                           $    $           $    $  ANS004.BYTE008  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  049.FIS                                                           $    $           $    $  ANS004.BYTE009  $  if(((x&0x04)>>2)==0) y=@0119;else if(((x&0x04)>>2)==1) y=@011f;else y=@0035;
  $  050.右侧B支柱                                                     $    $           $    $  ANS004.BYTE009  $  if(((x&0x02)>>1)==0) y=@0119;else if(((x&0x02)>>1)==1) y=@011f;else y=@0035;
  $  051.左侧B支柱                                                     $    $           $    $  ANS004.BYTE009  $  if((x&0x01)==0) y=@0119;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  052.一级驾驶员气囊(DAB)点火回路电阻值                             $    $           $    $  ANS005.BYTE004  $  y=x*0.1;
  $  053.第二排左侧安全带预拉紧点火回路电阻值                          $    $           $    $  ANS005.BYTE005  $  y=x*0.1;
  $  054.一级副驾驶气囊(PAB)点火回路电阻值                             $    $           $    $  ANS005.BYTE006  $  y=x*0.1;
  $  055.第二排右侧安全带预拉紧点火回路电阻值                          $    $           $    $  ANS005.BYTE007  $  y=x*0.1;
  $  056.驾驶员二级预拉紧安全带点火回路电阻值                          $    $           $    $  ANS005.BYTE008  $  y=x*0.1;
  $  057.副驾驶二级预拉紧安全带点火回路电阻值                          $    $           $    $  ANS005.BYTE009  $  y=x*0.1;
  $  058.左侧侧气帘点火回路电阻值                                      $    $           $    $  ANS005.BYTE010  $  y=x*0.1;
  $  059.右侧侧气帘点火回路电阻值                                      $    $           $    $  ANS005.BYTE011  $  y=x*0.1;
  $  060.驾驶员预拉紧安全带点火回路电阻值                              $    $           $    $  ANS005.BYTE012  $  y=x*0.1;
  $  061.副驶预拉紧安全带点火回路电阻值                                $    $           $    $  ANS005.BYTE013  $  y=x*0.1;
  $  062.右侧侧气囊点火回路电阻值                                      $    $           $    $  ANS005.BYTE014  $  y=x*0.1;
  $  063.左侧侧气囊点火回路电阻值                                      $    $           $    $  ANS005.BYTE015  $  y=x*0.1;
  $  064.第二排左侧侧气帘点火回路电阻值                                $    $           $    $  ANS005.BYTE016  $  y=x*0.1;
  $  065.第二排右侧侧气帘点火回路电阻值                                $    $           $    $  ANS005.BYTE017  $  y=x*0.1;
  $  066.副驾二级安全带预紧点火回路（碰撞数据1）                       $    $           $    $  ANS006.BYTE006  $  if(((x&0x08)>>3)==0) y=@0423;else if(((x&0x08)>>3)==1) y=@0424;else y=@0035;
  $  067.第一排副驾驶侧预拉紧安全带（碰撞数据1）                       $    $           $    $  ANS006.BYTE006  $  if(((x&0x02)>>1)==0) y=@0423;else if(((x&0x02)>>1)==1) y=@0424;else y=@0035;
  $  068.第一排驾驶员侧预拉紧安全带（碰撞数据1）                       $    $           $    $  ANS006.BYTE006  $  if((x&0x01)==0) y=@0423;else if((x&0x01)==1) y=@0424;else y=@0035;
  $  069.第一排 右侧侧气帘点火回路（碰撞数据1）                        $    $           $    $  ANS006.BYTE007  $  if(((x&0x80)>>7)==0) y=@0423;else if(((x&0x80)>>7)==1) y=@0424;else y=@0035;
  $  070.第一排 左侧侧气帘点火回路（碰撞数据1）                        $    $           $    $  ANS006.BYTE007  $  if(((x&0x40)>>6)==0) y=@0423;else if(((x&0x40)>>6)==1) y=@0424;else y=@0035;
  $  071.第一排 右侧侧气囊点火回路（碰撞数据1）                        $    $           $    $  ANS006.BYTE007  $  if(((x&0x20)>>5)==0) y=@0423;else if(((x&0x20)>>5)==1) y=@0424;else y=@0035;
  $  072.第一排 左侧侧气囊点火回路（碰撞数据1）                        $    $           $    $  ANS006.BYTE007  $  if(((x&0x10)>>4)==0) y=@0423;else if(((x&0x10)>>4)==1) y=@0424;else y=@0035;
  $  073.副驾驶 前气囊点火回路(第一级)（碰撞数据1）                    $    $           $    $  ANS006.BYTE007  $  if(((x&0x08)>>3)==0) y=@0423;else if(((x&0x08)>>3)==1) y=@0424;else y=@0035;
  $  074.驾驶员 前气囊点火回路(第一级)（碰撞数据1）                    $    $           $    $  ANS006.BYTE007  $  if(((x&0x04)>>2)==0) y=@0423;else if(((x&0x04)>>2)==1) y=@0424;else y=@0035;
  $  075.第二排右侧安全带预紧点火回路（碰撞数据1）                     $    $           $    $  ANS006.BYTE007  $  if(((x&0x02)>>1)==0) y=@0423;else if(((x&0x02)>>1)==1) y=@0424;else y=@0035;
  $  076.第二排左侧安全带预紧点火回路（碰撞数据1）                     $    $           $    $  ANS006.BYTE007  $  if((x&0x01)==0) y=@0423;else if((x&0x01)==1) y=@0424;else y=@0035;
  $  077.副驾驶 前气囊点火回路(第二级)（碰撞数据1）                    $    $           $    $  ANS006.BYTE012  $  if(((x&0x02)>>1)==0) y=@0423;else if(((x&0x02)>>1)==1) y=@0424;else y=@0035;
  $  078.驾驶员 前气囊点火回路(第二级)（碰撞数据1）                    $    $           $    $  ANS006.BYTE012  $  if((x&0x01)==0) y=@0423;else if((x&0x01)==1) y=@0424;else y=@0035;
  $  079.碰撞输出硬件状态（碰撞数据1）                                 $    $           $    $  ANS006.BYTE013  $  if((x&0x01)==0) y=@0425;else if((x&0x01)==1) y=@0426;else y=@0035;
  $  080.碰撞输出CAN状态（碰撞数据1）                                  $    $           $    $  ANS006.BYTE014  $  if(x==0) y=@0427;else if(x==1) y=@0428;else if(x==2) y=@0429;else if(x==3) y=@042a;else y=@0035;
  $  081.系统运行时间（碰撞数据1）                                     $    $           $    $  ANS006.BYTE015  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.05;
  $  082.点火循环计数器（碰撞数据1）                                   $    $           $    $  ANS006.BYTE019  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  083.信号完整性抑制算法（碰撞数据1）                               $    $           $    $  ANS006.BYTE023  $  if(((x&0x04)>>2)==0) y=@042b;else if(((x&0x04)>>2)==1) y=@042c;else y=@0035;
  $  084.车辆信息禁用算法（碰撞数据1）                                 $    $           $    $  ANS006.BYTE023  $  if(((x&0x02)>>1)==0) y=@042d;else if(((x&0x02)>>1)==1) y=@042e;else y=@0035;
  $  085.轻微碰撞检测禁用算法（碰撞数据1）                             $    $           $    $  ANS006.BYTE023  $  if((x&0x01)==0) y=@0413;else if((x&0x01)==1) y=@0414;else y=@0035;
  $  086.车辆动力学抑制算法（碰撞数据1）                               $    $           $    $  ANS006.BYTE024  $  if(((x&0x80)>>7)==0) y=@0415;else if(((x&0x80)>>7)==1) y=@0416;else y=@0035;
  $  087.行人应变抑制算法（碰撞数据1）                                 $    $           $    $  ANS006.BYTE024  $  if(((x&0x20)>>5)==0) y=@0417;else if(((x&0x20)>>5)==1) y=@0418;else y=@0035;
  $  088.俯仰抑制算法（碰撞数据1）                                     $    $           $    $  ANS006.BYTE024  $  if(((x&0x10)>>4)==0) y=@0419;else if(((x&0x10)>>4)==1) y=@041a;else y=@0035;
  $  089.防侧翻算法（碰撞数据1）                                       $    $           $    $  ANS006.BYTE024  $  if(((x&0x08)>>3)==0) y=@041b;else if(((x&0x08)>>3)==1) y=@041c;else y=@0035;
  $  090.侧面抑制算法（碰撞数据1）                                     $    $           $    $  ANS006.BYTE024  $  if(((x&0x04)>>2)==0) y=@041d;else if(((x&0x04)>>2)==1) y=@041e;else y=@0035;
  $  091.后部抑制算法（碰撞数据1）                                     $    $           $    $  ANS006.BYTE024  $  if(((x&0x02)>>1)==0) y=@041f;else if(((x&0x02)>>1)==1) y=@0420;else y=@0035;
  $  092.前部抑制算法（碰撞数据1）                                     $    $           $    $  ANS006.BYTE024  $  if((x&0x01)==0) y=@0421;else if((x&0x01)==1) y=@0422;else y=@0035;
  $  093.EVZ电压（碰撞数据1）                                          $    $           $    $  ANS006.BYTE027  $  y=(x1*256+x2)*0.044;
  $  094.蓄电池电压（碰撞数据1）                                       $    $           $    $  ANS006.BYTE029  $  y=(x1*256+x2)*0.001;
  $  095.驾驶员安全带扣开关状态最后有效状态（碰撞数据1）               $    $           $    $  ANS006.BYTE071  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  096.驾驶员安全带扣开关状态当前状态位（碰撞数据1）                 $    $           $    $  ANS006.BYTE071  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  097.BSP状态乘客带扣开关状态最后有效状态（碰撞数据1）              $    $           $    $  ANS006.BYTE072  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  098.BSP状态乘客带扣开关状态当前状态位（碰撞数据1）                $    $           $    $  ANS006.BYTE072  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  099.BSRL状态第二排左后带扣开关最后有效状态（碰撞数据1）           $    $           $    $  ANS006.BYTE073  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  100.BSRL状态第二排左后带扣开关当前状态位（碰撞数据1）             $    $           $    $  ANS006.BYTE073  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  101.BSRC状态第二排中间带扣开关状态最后有效状态（碰撞数据1）       $    $           $    $  ANS006.BYTE074  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  102.BSRC状态第二排中间带扣开关状态当前状态位（碰撞数据1）         $    $           $    $  ANS006.BYTE074  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  103.BSRR状态第二行右扣最后有效状态（碰撞数据1）                   $    $           $    $  ANS006.BYTE075  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  104.BSRR状态第二行右扣当前状态位（碰撞数据1）                     $    $           $    $  ANS006.BYTE075  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  105.PADS状态最后有效状态（碰撞数据1）                             $    $           $    $  ANS006.BYTE076  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0434;else if(((x&0xF0)>>4)==0x02) y=@0435;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  106.PADS状态当前状态位（碰撞数据1）                               $    $           $    $  ANS006.BYTE076  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0434;else if((x&0x0F)==0x02) y=@0435;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  107.副驾驶乘员占位传感器状态1（碰撞数据1）                        $    $           $    $  ANS006.BYTE077  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  108.副驾驶乘员占位传感器状态2（碰撞数据1）                        $    $           $    $  ANS006.BYTE077  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  109.后排左侧乘员占位传感器状态1（碰撞数据1）                      $    $           $    $  ANS006.BYTE078  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  110.后排左侧乘员占位传感器状态2（碰撞数据1）                      $    $           $    $  ANS006.BYTE078  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  111.后排中间乘员占位传感器状态1（碰撞数据1）                      $    $           $    $  ANS006.BYTE079  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  112.后排中间乘员占位传感器状态2（碰撞数据1）                      $    $           $    $  ANS006.BYTE079  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  113.后排右侧乘员占位传感器状态1（碰撞数据1）                      $    $           $    $  ANS006.BYTE080  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  114.后排右侧乘员占位传感器状态2（碰撞数据1）                      $    $           $    $  ANS006.BYTE080  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  115.警告灯状态（碰撞数据1）                                       $    $           $    $  ANS006.BYTE081  $  if(x==0) y=@016d;else if(x==1) y=@000f;else if(x==2) y=@0298;else if(x==3) y=@0019;else if(x==4) y=@0112;else y=@0035;
  $  116.安全气囊关闭灯状态（碰撞数据1）                               $    $           $    $  ANS006.BYTE082  $  if(x==0) y=@016d;else if(x==1) y=@000f;else if(x==3) y=@0019;else if(x==4) y=@0112;else y=@0035;
  $  117.安全气囊打开指示灯状态（碰撞数据1）                           $    $           $    $  ANS006.BYTE083  $  if(x==0) y=@016d;else if(x==1) y=@000f;else if(x==3) y=@0019;else if(x==4) y=@0112;else y=@0035;
  $  118.车速（碰撞数据1）                                             $    $           $    $  ANS006.BYTE085  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22);
  $  119.副驾二级安全带预紧点火回路（碰撞数据2）                       $    $           $    $  ANS007.BYTE006  $  if(((x&0x08)>>3)==0) y=@0423;else if(((x&0x08)>>3)==1) y=@0424;else y=@0035;
  $  120.第一排副驾驶侧预拉紧安全带（碰撞数据2）                       $    $           $    $  ANS007.BYTE006  $  if(((x&0x02)>>1)==0) y=@0423;else if(((x&0x02)>>1)==1) y=@0424;else y=@0035;
  $  121.第一排驾驶员侧预拉紧安全带（碰撞数据2）                       $    $           $    $  ANS007.BYTE006  $  if((x&0x01)==0) y=@0423;else if((x&0x01)==1) y=@0424;else y=@0035;
  $  122.第一排 右侧侧气帘点火回路（碰撞数据2）                        $    $           $    $  ANS007.BYTE007  $  if(((x&0x80)>>7)==0) y=@0423;else if(((x&0x80)>>7)==1) y=@0424;else y=@0035;
  $  123.第一排 左侧侧气帘点火回路（碰撞数据2）                        $    $           $    $  ANS007.BYTE007  $  if(((x&0x40)>>6)==0) y=@0423;else if(((x&0x40)>>6)==1) y=@0424;else y=@0035;
  $  124.第一排 右侧侧气囊点火回路（碰撞数据2）                        $    $           $    $  ANS007.BYTE007  $  if(((x&0x20)>>5)==0) y=@0423;else if(((x&0x20)>>5)==1) y=@0424;else y=@0035;
  $  125.第一排 左侧侧气囊点火回路（碰撞数据2）                        $    $           $    $  ANS007.BYTE007  $  if(((x&0x10)>>4)==0) y=@0423;else if(((x&0x10)>>4)==1) y=@0424;else y=@0035;
  $  126.副驾驶 前气囊点火回路(第一级)（碰撞数据2）                    $    $           $    $  ANS007.BYTE007  $  if(((x&0x08)>>3)==0) y=@0423;else if(((x&0x08)>>3)==1) y=@0424;else y=@0035;
  $  127.驾驶员 前气囊点火回路(第一级)（碰撞数据2）                    $    $           $    $  ANS007.BYTE007  $  if(((x&0x04)>>2)==0) y=@0423;else if(((x&0x04)>>2)==1) y=@0424;else y=@0035;
  $  128.第二排右侧安全带预紧点火回路（碰撞数据2）                     $    $           $    $  ANS007.BYTE007  $  if(((x&0x02)>>1)==0) y=@0423;else if(((x&0x02)>>1)==1) y=@0424;else y=@0035;
  $  129.第二排左侧安全带预紧点火回路（碰撞数据2）                     $    $           $    $  ANS007.BYTE007  $  if((x&0x01)==0) y=@0423;else if((x&0x01)==1) y=@0424;else y=@0035;
  $  130.副驾驶 前气囊点火回路(第二级)（碰撞数据2）                    $    $           $    $  ANS007.BYTE012  $  if(((x&0x02)>>1)==0) y=@0423;else if(((x&0x02)>>1)==1) y=@0424;else y=@0035;
  $  131.驾驶员 前气囊点火回路(第二级)（碰撞数据2）                    $    $           $    $  ANS007.BYTE012  $  if((x&0x01)==0) y=@0423;else if((x&0x01)==1) y=@0424;else y=@0035;
  $  132.碰撞输出硬件状态（碰撞数据2）                                 $    $           $    $  ANS007.BYTE013  $  if((x&0x01)==0) y=@0425;else if((x&0x01)==1) y=@0426;else y=@0035;
  $  133.碰撞输出CAN状态（碰撞数据2）                                  $    $           $    $  ANS007.BYTE014  $  if(x==0) y=@0427;else if(x==1) y=@0428;else if(x==2) y=@0429;else if(x==3) y=@042a;else y=@0035;
  $  134.系统运行时间（碰撞数据2）                                     $    $           $    $  ANS007.BYTE015  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.05;
  $  135.点火循环计数器（碰撞数据2）                                   $    $           $    $  ANS007.BYTE019  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  136.信号完整性抑制算法（碰撞数据2）                               $    $           $    $  ANS007.BYTE023  $  if(((x&0x04)>>2)==0) y=@042b;else if(((x&0x04)>>2)==1) y=@042c;else y=@0035;
  $  137.车辆信息禁用算法（碰撞数据2）                                 $    $           $    $  ANS007.BYTE023  $  if(((x&0x02)>>1)==0) y=@042d;else if(((x&0x02)>>1)==1) y=@042e;else y=@0035;
  $  138.轻微碰撞检测禁用算法（碰撞数据2）                             $    $           $    $  ANS007.BYTE023  $  if((x&0x01)==0) y=@0413;else if((x&0x01)==1) y=@0414;else y=@0035;
  $  139.车辆动力学抑制算法（碰撞数据2）                               $    $           $    $  ANS007.BYTE024  $  if(((x&0x80)>>7)==0) y=@0415;else if(((x&0x80)>>7)==1) y=@0416;else y=@0035;
  $  140.行人应变抑制算法（碰撞数据2）                                 $    $           $    $  ANS007.BYTE024  $  if(((x&0x20)>>5)==0) y=@0417;else if(((x&0x20)>>5)==1) y=@0418;else y=@0035;
  $  141.俯仰抑制算法（碰撞数据2）                                     $    $           $    $  ANS007.BYTE024  $  if(((x&0x10)>>4)==0) y=@0419;else if(((x&0x10)>>4)==1) y=@041a;else y=@0035;
  $  142.防侧翻算法（碰撞数据2）                                       $    $           $    $  ANS007.BYTE024  $  if(((x&0x08)>>3)==0) y=@041b;else if(((x&0x08)>>3)==1) y=@041c;else y=@0035;
  $  143.侧面抑制算法（碰撞数据2）                                     $    $           $    $  ANS007.BYTE024  $  if(((x&0x04)>>2)==0) y=@041d;else if(((x&0x04)>>2)==1) y=@041e;else y=@0035;
  $  144.后部抑制算法（碰撞数据2）                                     $    $           $    $  ANS007.BYTE024  $  if(((x&0x02)>>1)==0) y=@041f;else if(((x&0x02)>>1)==1) y=@0420;else y=@0035;
  $  145.前部抑制算法（碰撞数据2）                                     $    $           $    $  ANS007.BYTE024  $  if((x&0x01)==0) y=@0421;else if((x&0x01)==1) y=@0422;else y=@0035;
  $  146.驾驶员安全带扣开关状态最后有效状态（碰撞数据2）               $    $           $    $  ANS007.BYTE071  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  147.驾驶员安全带扣开关状态当前状态位（碰撞数据2）                 $    $           $    $  ANS007.BYTE071  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  148.BSP状态乘客带扣开关状态最后有效状态（碰撞数据2）              $    $           $    $  ANS007.BYTE072  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  149.BSP状态乘客带扣开关状态当前状态位（碰撞数据2）                $    $           $    $  ANS007.BYTE072  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  150.BSRL状态第二排左后带扣开关最后有效状态（碰撞数据2）           $    $           $    $  ANS007.BYTE073  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  151.BSRL状态第二排左后带扣开关当前状态位（碰撞数据2）             $    $           $    $  ANS007.BYTE073  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  152.BSRC状态第二排中间带扣开关状态最后有效状态（碰撞数据2）       $    $           $    $  ANS007.BYTE074  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  153.BSRC状态第二排中间带扣开关状态当前状态位（碰撞数据2）         $    $           $    $  ANS007.BYTE074  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  154.BSRR状态第二行右扣最后有效状态（碰撞数据2）                   $    $           $    $  ANS007.BYTE075  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0432;else if(((x&0xF0)>>4)==0x02) y=@0433;else if(((x&0xF0)>>4)==0x0B) y=@0112;else y=@0035;
  $  155.BSRR状态第二行右扣当前状态位（碰撞数据2）                     $    $           $    $  ANS007.BYTE075  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0432;else if((x&0x0F)==0x02) y=@0433;else if((x&0x0F)==0x0B) y=@0112;else y=@0035;
  $  156.PADS状态最后有效状态（碰撞数据2）                             $    $           $    $  ANS007.BYTE076  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0434;else if(((x&0xF0)>>4)==0x02) y=@0435;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  157.PADS状态当前状态位（碰撞数据2）                               $    $           $    $  ANS007.BYTE076  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0434;else if((x&0x0F)==0x02) y=@0435;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  158.副驾驶乘员占位传感器状态1（碰撞数据2）                        $    $           $    $  ANS007.BYTE077  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  159.副驾驶乘员占位传感器状态2（碰撞数据2）                        $    $           $    $  ANS007.BYTE077  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  160.后排左侧乘员占位传感器状态1（碰撞数据2）                      $    $           $    $  ANS007.BYTE078  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  161.后排左侧乘员占位传感器状态2（碰撞数据2）                      $    $           $    $  ANS007.BYTE078  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  162.后排中间乘员占位传感器状态1（碰撞数据2）                      $    $           $    $  ANS007.BYTE079  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  163.后排中间乘员占位传感器状态2（碰撞数据2）                      $    $           $    $  ANS007.BYTE079  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  164.后排右侧乘员占位传感器状态1（碰撞数据2）                      $    $           $    $  ANS007.BYTE080  $  if(((x&0xF0)>>4)==0x00) y=@042f;else if(((x&0xF0)>>4)==0x01) y=@0430;else if(((x&0xF0)>>4)==0x02) y=@0431;else if(((x&0xF0)>>4)==0x0B) y=@0112;else if(((x&0xF0)>>4)==0x0F) y=@00b3;else y=@0035;
  $  165.后排右侧乘员占位传感器状态2（碰撞数据2）                      $    $           $    $  ANS007.BYTE080  $  if((x&0x0F)==0x00) y=@042f;else if((x&0x0F)==0x01) y=@0430;else if((x&0x0F)==0x02) y=@0431;else if((x&0x0F)==0x0B) y=@0112;else if((x&0x0F)==0x0F) y=@00b3;else y=@0035;
  $  166.警告灯状态（碰撞数据2）                                       $    $           $    $  ANS007.BYTE081  $  if(x==0) y=@016d;else if(x==1) y=@000f;else if(x==2) y=@0298;else if(x==3) y=@0019;else if(x==4) y=@0112;else y=@0035;
  $  167.安全气囊关闭灯状态（碰撞数据2）                               $    $           $    $  ANS007.BYTE082  $  if(x==0) y=@016d;else if(x==1) y=@000f;else if(x==3) y=@0019;else if(x==4) y=@0112;else y=@0035;
  $  168.安全气囊打开指示灯状态（碰撞数据2）                           $    $           $    $  ANS007.BYTE083  $  if(x==0) y=@016d;else if(x==1) y=@000f;else if(x==3) y=@0019;else if(x==4) y=@0112;else y=@0035;
  $  169.PAB(乘客安全气囊)关闭                                         $    $           $    $  ANS008.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  170.PAB(乘客安全气囊)打开                                         $    $           $    $  ANS008.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  171.碰撞输出                                                      $    $           $    $  ANS008.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  172.数据块1碰撞类型后碰撞                                         $    $           $    $  ANS009.BYTE004  $  y=((x&0x10)>>4);
  $  173.数据块1碰撞类型右侧碰撞                                       $    $           $    $  ANS009.BYTE004  $  y=((x&0x08)>>3);
  $  174.数据块1碰撞类型左侧面碰撞                                     $    $           $    $  ANS009.BYTE004  $  y=((x&0x04)>>2);
  $  175.数据块1碰撞类型前碰撞                                         $    $           $    $  ANS009.BYTE004  $  y=((x&0x02)>>1);
  $  176.数据块1崩溃类型BPT碰撞                                        $    $           $    $  ANS009.BYTE004  $  y=(x&0x01);
  $  177.数据块2碰撞类型后碰撞                                         $    $           $    $  ANS009.BYTE005  $  y=((x&0x10)>>4);
  $  178.数据块2碰撞类型右侧碰撞                                       $    $           $    $  ANS009.BYTE005  $  y=((x&0x08)>>3);
  $  179.数据块2碰撞类型左侧面碰撞                                     $    $           $    $  ANS009.BYTE005  $  y=((x&0x04)>>2);
  $  180.数据块2碰撞类型前碰撞                                         $    $           $    $  ANS009.BYTE005  $  y=((x&0x02)>>1);
  $  181.数据块2崩溃类型BPT碰撞                                        $    $           $    $  ANS009.BYTE005  $  y=(x&0x01);
  $  182.使用期限碰撞计数                                              $    $           $    $  ANS009.BYTE006  $  y=x;
  $  183.第一行SBR车辆速度阈值V2                                       $    $  km/h     $    $  ANS010.BYTE004  $  y=x;
  $  184.前SBR定时器阈值T                                              $    $  km/h     $    $  ANS010.BYTE005  $  y=x;
  $  185.前SBR定时器阈值T                                              $    $  s        $    $  ANS010.BYTE006  $  y=x;
  $  186.第二和第三排SBR车辆速度阈值V1                                 $    $           $    $  ANS010.BYTE007  $  y=x;
  $  187.第二和第三排SBR车辆速度阈值V2                                 $    $           $    $  ANS010.BYTE008  $  y=x;
  $  188.第二和第三SBR定时器阈值T1                                     $    $           $    $  ANS010.BYTE009  $  y=x;
  $  189.第二和第三SBR定时器阈值T2                                     $    $           $    $  ANS010.BYTE010  $  y=x;
  $  190.车速信号读取(通过 CAN)                                        $    $  km/h     $    $  ANS011.BYTE004  $  y=(x1*256+x2)*0.01563;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:742 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
