
    车型ID：1114

    模拟：协议模拟-->1114

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:742 02 10 01 00 00 00 00 00       $~  ANS000:7C2 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:742 02 3E 80 00 00 00 00 00       $!  ANS000:7C2 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:742 03 19 02 09 00 00 00 00       $#  ANS000:7C2 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/12000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:742 04 14 FF FF FF 00 00 00       $$  ANS000:7C2 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:742 03 22 F1 86 00 00 00 00       $%  ANS000:7C2 03 22 F1 86 00 00 00 00
  $%  REQ001:742 03 22 F1 93 00 00 00 00       $%  ANS001:7C2 03 22 F1 93 00 00 00 00
  $%  REQ002:742 03 22 F1 95 00 00 00 00       $%  ANS002:7C2 03 22 F1 95 00 00 00 00
  $%  REQ003:742 03 22 F1 91 00 00 00 00       $%  ANS003:7C2 03 22 F1 91 00 00 00 00
  $%  REQ004:742 03 22 F1 87 00 00 00 00       $%  ANS004:7C2 03 22 F1 87 00 00 00 00
  $%  REQ005:742 03 22 F1 A0 00 00 00 00       $%  ANS005:7C2 03 22 F1 A0 00 00 00 00
  $%  REQ006:742 03 22 F1 90 00 00 00 00       $%  ANS006:7C2 03 22 F1 90 00 00 00 00
  $%  REQ007:742 03 22 F1 A8 00 00 00 00       $%  ANS007:7C2 03 22 F1 A8 00 00 00 00

  $%  000:主动诊断会话:                        $%    $%  ANS000.BYTE004  $%  HEX(X1);
  $%  001:博世控制器硬件版本号:                $%    $%  ANS001.BYTE004  $%  HEX(X1);
  $%  002:博世控制器软件版本(BB号):            $%    $%  ANS002.BYTE004  $%  HEX(X1,X2,X3);
  $%  003:博世控制器软件版本 (阶段):           $%    $%  ANS002.BYTE004  $%  ASCII(X1);
  $%  004:博世控制器软件版本(气囊代号):        $%    $%  ANS002.BYTE004  $%  HEX(X1);
  $%  005:博世控制器软件版本(项目编号):        $%    $%  ANS002.BYTE004  $%  HEX(X1);
  $%  006:博世控制器软件版本(日期):            $%    $%  ANS002.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  007:读取博世电控单元软件版本:            $%    $%  ANS002.BYTE004  $%  HEX(X1);
  $%  008:博世控制器软件版本(制造商):          $%    $%  ANS002.BYTE004  $%  ASCII(X1,X2);
  $%  009:读SAIC硬件版本号:                    $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  010:SAIC零件号:                          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  011:读SAIC软件版本号:                    $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:车辆识别代码:                        $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  013:车辆特征信息:                        $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:742 03 22 F1 A5 00 00 00 00       $  ANS000:7C2 03 22 F1 A5 00 00 00 00
  $  REQ001:742 03 22 F1 96 00 00 00 00       $  ANS001:7C2 03 22 F1 96 00 00 00 00
  $  REQ002:742 03 22 F1 D2 00 00 00 00       $  ANS002:7C2 03 22 F1 D2 00 00 00 00
  $  REQ003:742 03 22 F1 D3 00 00 00 00       $  ANS003:7C2 03 22 F1 D3 00 00 00 00
  $  REQ004:742 03 22 F1 9A 00 00 00 00       $  ANS004:7C2 03 22 F1 9A 00 00 00 00
  $  REQ005:742 03 22 F1 9D 00 00 00 00       $  ANS005:7C2 03 22 F1 9D 00 00 00 00
  $  REQ006:742 03 22 F1 98 00 00 00 00       $  ANS006:7C2 03 22 F1 98 00 00 00 00
  $  REQ007:742 03 22 F1 9B 00 00 00 00       $  ANS007:7C2 03 22 F1 9B 00 00 00 00
  $  REQ008:742 03 22 F1 A8 00 00 00 00       $  ANS008:7C2 03 22 F1 A8 00 00 00 00
  $  REQ009:742 03 22 F1 90 00 00 00 00       $  ANS009:7C2 03 22 F1 90 00 00 00 00

  $  000.前排乘员双侧安全气帘（CABFP）                        $    $           $    $  ANS000.BYTE004  $  if(((x&0x80)>>7)==0) y=@0112;else if(((x&0x80)>>7)==1) y=@0445;else y=@0035;
  $  001.前驾驶员双侧安全气帘（CABFD）                        $    $           $    $  ANS000.BYTE004  $  if(((x&0x40)>>6)==0) y=@0112;else if(((x&0x40)>>6)==1) y=@0445;else y=@0035;
  $  002.前排乘员侧气囊（SABFP）                              $    $           $    $  ANS000.BYTE004  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0035;
  $  003.驾驶员侧气囊（SABFD）                                $    $           $    $  ANS000.BYTE004  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  004.前排乘员侧安全带（BTFP）                             $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0035;
  $  005.驾驶员侧安全带（BTFD）                               $    $           $    $  ANS000.BYTE004  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0035;
  $  006.前乘客气囊（ABFP）                                   $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  007.驾驶员气囊（ABFD）                                   $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  008.后排乘员安全带预紧器(BT1RP)                          $    $           $    $  ANS000.BYTE005  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0035;
  $  009.后排驾驶员侧安全带预紧器(BT1RD)                      $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  010.前排乘员侧膝部气囊(KABFP)                            $    $           $    $  ANS000.BYTE005  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0035;
  $  011.驾驶员侧膝部气囊(KABFD)                              $    $           $    $  ANS000.BYTE005  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0035;
  $  012.后排乘员安全气囊 (SABRP)                             $    $           $    $  ANS000.BYTE005  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  013.后排驾驶员安全气囊 (SABRP)                           $    $           $    $  ANS000.BYTE005  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  014.乘员侧前置传感器 (UFSFP)                             $    $           $    $  ANS000.BYTE006  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0035;
  $  015.驾驶员侧前置传感器 (UFSFD)                           $    $           $    $  ANS000.BYTE006  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  016.后排乘员外侧传感器(PASRP)                            $    $           $    $  ANS000.BYTE006  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0035;
  $  017.后排驾驶员外侧传感器(PASRD)                          $    $           $    $  ANS000.BYTE006  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0035;
  $  018.前排乘员外侧传感器(PASFP)                            $    $           $    $  ANS000.BYTE006  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  019.前驾驶员侧传感器 (PASFD)                             $    $           $    $  ANS000.BYTE006  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  020.后排中央安全带锁扣(BLRM)                             $    $           $    $  ANS000.BYTE007  $  if(((x&0x40)>>6)==0) y=@0112;else if(((x&0x40)>>6)==1) y=@0445;else y=@0035;
  $  021.后排乘员安全带锁扣（BLRP）                           $    $           $    $  ANS000.BYTE007  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0035;
  $  022.后排驾驶员侧安全带锁扣(BLRD)                         $    $           $    $  ANS000.BYTE007  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  023.前排乘员地垫检测（PDM）                              $    $           $    $  ANS000.BYTE007  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0035;
  $  024.前排乘员安全带锁扣 (BLFP)                            $    $           $    $  ANS000.BYTE007  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0035;
  $  025.前排驾驶员侧安全带锁扣(BLFD)                         $    $           $    $  ANS000.BYTE007  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  026.前排乘员安全气囊使能开关（PADS）                     $    $           $    $  ANS000.BYTE007  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  027.碰撞输出信号来自CAN                                  $    $           $    $  ANS000.BYTE008  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  028.系统警告灯状态来自CAN                                $    $           $    $  ANS000.BYTE008  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  029.碰撞输出信号来自硬件线                               $    $           $    $  ANS000.BYTE009  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  030.博世零件号                                           $    $           $    $  ANS001.BYTE004  $  ASCII(X1,X2,X3,X4);
  $  031.EEPROM版本                                           $    $           $    $  ANS001.BYTE008  $  HEX(X1);
  $  032.实际运行时间                                         $    $           $    $  ANS001.BYTE009  $  HEX(X1,X2,X3,X4);
  $  033.上电/下电 计数器                                     $    $           $    $  ANS001.BYTE013  $  HEX(X1,X2,X3,X4);
  $  034.最终碰撞代码                                         $    $           $    $  ANS002.BYTE004  $  HEX(X1);
  $  035.碰撞次数记录器                                       $    $           $    $  ANS002.BYTE005  $  y=x;
  $  036.发生碰撞时后排中间乘员座位安全带指示警告灯状态       $    $           $    $  ANS002.BYTE006  $  if(((x&0x30)>>4)==0) y=@028b;else if(((x&0x30)>>4)==1) y=@043e;else if(((x&0x30)>>4)==16) y=@043f;else y=@0035;
  $  037.发生碰撞时后排乘员座位安全带指示警告灯状态           $    $           $    $  ANS002.BYTE006  $  if(((x&0x0C)>>2)==0) y=@028b;else if(((x&0x0C)>>2)==1) y=@043e;else if(((x&0x0C)>>2)==16) y=@043f;else y=@0035;
  $  038.发生碰撞时后驾驶侧座位安全带指示警告灯状态           $    $           $    $  ANS002.BYTE006  $  if((x&0x03)==0) y=@028b;else if((x&0x03)==1) y=@043e;else if((x&0x03)==16) y=@043f;else y=@0035;
  $  039.发生碰撞时前排乘员安全带指示警告灯状态               $    $           $    $  ANS002.BYTE007  $  if(((x&0xC0)>>6)==0) y=@028b;else if(((x&0xC0)>>6)==1) y=@043e;else if(((x&0xC0)>>6)==16) y=@043f;else y=@0035;
  $  040.发生碰撞时驾驶员安全带指示警告灯状态                 $    $           $    $  ANS002.BYTE007  $  if(((x&0x30)>>4)==0) y=@028b;else if(((x&0x30)>>4)==1) y=@043e;else if(((x&0x30)>>4)==16) y=@043f;else y=@0035;
  $  041.发生碰撞时PADI警告灯状态                             $    $           $    $  ANS002.BYTE007  $  if(((x&0x0C)>>2)==0) y=@028b;else if(((x&0x0C)>>2)==1) y=@043e;else if(((x&0x0C)>>2)==16) y=@043f;else y=@0035;
  $  042.发生碰撞时系统警告灯状态                             $    $           $    $  ANS002.BYTE007  $  if((x&0x03)==0) y=@028b;else if((x&0x03)==1) y=@043e;else if((x&0x03)==16) y=@043f;else y=@0035;
  $  043.PASFP故障状态                                        $    $           $    $  ANS002.BYTE008  $  if(((x&0x08)>>3)==0) y=@0197;else if(((x&0x08)>>3)==1) y=@00b3;else y=@0035;
  $  044.PASFD故障状态                                        $    $           $    $  ANS002.BYTE008  $  if(((x&0x04)>>2)==0) y=@0197;else if(((x&0x04)>>2)==1) y=@00b3;else y=@0035;
  $  045.主传感器柱2 故障状态                                 $    $           $    $  ANS002.BYTE008  $  if(((x&0x02)>>1)==0) y=@0197;else if(((x&0x02)>>1)==1) y=@00b3;else y=@0035;
  $  046.主传感器柱1 故障状态                                 $    $           $    $  ANS002.BYTE008  $  if((x&0x01)==0) y=@0197;else if((x&0x01)==1) y=@00b3;else y=@0035;
  $  047.DIS ALP 全低功率级                                   $    $           $    $  ANS002.BYTE009  $  if(((x&0x20)>>5)==0) y=@00dc;else if(((x&0x20)>>5)==1) y=@00db;else y=@0035;
  $  048.DIS AHP 全高功率级                                   $    $           $    $  ANS002.BYTE009  $  if(((x&0x10)>>4)==0) y=@00dc;else if(((x&0x10)>>4)==1) y=@00db;else y=@0035;
  $  049.DIS SFL HW硬件线禁能状态                             $    $           $    $  ANS002.BYTE009  $  if(((x&0x08)>>3)==0) y=@00dc;else if(((x&0x08)>>3)==1) y=@00db;else y=@0035;
  $  050.前排乘员监测坐垫开关状态                             $    $           $    $  ANS002.BYTE011  $  if(((x&0xC0)>>6)==0) y=@0454;else if(((x&0xC0)>>6)==1) y=@0455;else if(((x&0xC0)>>6)==16) y=@00b3;else y=@0035;
  $  051.前排乘员气囊是否激活开关                             $    $           $    $  ANS002.BYTE011  $  if(((x&0x30)>>4)==0) y=@0456;else if(((x&0x30)>>4)==1) y=@0457;else if(((x&0x30)>>4)==16) y=@00b3;else y=@0035;
  $  052.前排乘员扣带开关状态                                 $    $           $    $  ANS002.BYTE011  $  if(((x&0x0C)>>2)==0) y=@0446;else if(((x&0x0C)>>2)==1) y=@0447;else if(((x&0x0C)>>2)==16) y=@00b3;else y=@0035;
  $  053.驾驶员扣带开关状态                                   $    $           $    $  ANS002.BYTE011  $  if((x&0x03)==0) y=@0446;else if((x&0x03)==1) y=@0447;else if((x&0x03)==16) y=@00b3;else y=@0035;
  $  054.从RAM中获取的故障码记录                              $    $           $    $  ANS002.BYTE012  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  055.车速                                                 $    $  km/h     $    $  ANS002.BYTE036  $  y=x1*256+x2;
  $  056.运行时间计数器                                       $    $  s        $    $  ANS002.BYTE038  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  057.碰撞类型                                             $    $           $    $  ANS002.BYTE042  $  if((x1*256+x2)==0x01) y=@0448;else if((x1*256+x2)==0x02) y=@0449;else if((x1*256+x2)==0x04) y=@044a;else if((x1*256+x2)==0x08) y=@044b;else if((x1*256+x2)==0x10) y=@0035;else if((x1*256+x2)==0x100) y=@044c;else if((x1*256+x2)==0x20) y=@044d;else if((x1*256+x2)==0x40) y=@044e;else if((x1*256+x2)==0x80) y=@044f;else y=@0035;
  $  058.前Algo启动时间                                       $    $  ms       $    $  ANS002.BYTE044  $  y=(x1*256+x2)*0.5;
  $  059.侧碰撞算法启动时间                                   $    $  ms       $    $  ANS002.BYTE046  $  y=(x1*256+x2)*0.5;
  $  060.后碰撞算法启动时间                                   $    $  ms       $    $  ANS002.BYTE048  $  y=(x1*256+x2)*0.5;
  $  061.碰撞发生到阈值接近的时间                             $    $  ms       $    $  ANS002.BYTE050  $  y=(x1*256+x2)*0.5;
  $  062.碰撞发生到安全带预紧阈值超出的时间                   $    $  ms       $    $  ANS002.BYTE052  $  y=(x1*256+x2)*0.5;
  $  063.碰撞发生到前气囊引爆阈值超出时间                     $    $  ms       $    $  ANS002.BYTE054  $  y=(x1*256+x2)*0.5;
  $  064.碰撞发生到侧气囊引爆阈值超出时间                     $    $  ms       $    $  ANS002.BYTE056  $  y=(x1*256+x2)*0.5;
  $  065.算法复位时间                                         $    $  ms       $    $  ANS002.BYTE058  $  y=(x1*256+x2)*0.5;
  $  066.碰撞发生到ECU X轴最大加速时间                        $    $  ms       $    $  ANS002.BYTE060  $  y=(x1*256+x2)*0.5;
  $  067.碰撞发生到ECU Y轴最大加速时间                        $    $  ms       $    $  ANS002.BYTE062  $  y=(x1*256+x2)*0.5;
  $  068.碰撞发生到前驾驶员PAS最大加速时间                    $    $  ms       $    $  ANS002.BYTE064  $  y=(x1*256+x2)*0.5;
  $  069.碰撞发生到前排乘员PAS最大加速时间                    $    $  ms       $    $  ANS002.BYTE066  $  y=(x1*256+x2)*0.5;
  $  070.碰撞发生到PASMD/UFSD最大加速时间                     $    $  ms       $    $  ANS002.BYTE068  $  y=(x1*256+x2)*0.5;
  $  071.碰撞发生到PASMP/UFSP最大加速时间                     $    $  ms       $    $  ANS002.BYTE070  $  y=(x1*256+x2)*0.5;
  $  072.可靠性                                               $    $           $    $  ANS002.BYTE075  $  if(x==0) y=@0450;else if(x==1) y=@0451;else if(x==2) y=@0452;else y=@0035;
  $  073.Algo激活期间X轴最大加速时间                          $    $  g        $    $  ANS002.BYTE076  $  y=x*0.8;
  $  074.Algo激活期间Y轴最大加速时间                          $    $  g        $    $  ANS002.BYTE077  $  y=x*0.8;
  $  075.Algo激活期间PASFD最大加速时间                        $    $  g        $    $  ANS002.BYTE078  $  y=x;
  $  076.Algo激活期间PASFP最大加速时间                        $    $  g        $    $  ANS002.BYTE079  $  y=x;
  $  077.Algo激活期间PASMD/UFSD最大加速时间                   $    $  g        $    $  ANS002.BYTE080  $  y=x;
  $  078.Algo激活期间PASMP/UFSP最大加速时间                   $    $  g        $    $  ANS002.BYTE081  $  y=x;
  $  079.Delta速度                                            $    $           $    $  ANS002.BYTE082  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  080.驾驶员安全带引爆计数器                               $    $           $    $  ANS002.BYTE102  $  y=x;
  $  081.前排乘员安全带引爆计数器                             $    $           $    $  ANS002.BYTE103  $  y=x;
  $  082.驾驶员气囊引爆计数器                                 $    $           $    $  ANS002.BYTE104  $  y=x;
  $  083.前排乘员气囊引爆计数器                               $    $           $    $  ANS002.BYTE105  $  y=x;
  $  084.驾驶员侧气囊引爆计数器                               $    $           $    $  ANS002.BYTE106  $  y=x;
  $  085.乘员侧气囊引爆计数器                                 $    $           $    $  ANS002.BYTE107  $  y=x;
  $  086.驾驶员气帘引爆计数器                                 $    $           $    $  ANS002.BYTE108  $  y=x;
  $  087.前排乘员气帘引爆计数器                               $    $           $    $  ANS002.BYTE109  $  y=x;
  $  088.驾驶员膝气袋引爆计数器                               $    $           $    $  ANS002.BYTE110  $  y=x;
  $  089.前排乘员膝气袋引爆计数器                             $    $           $    $  ANS002.BYTE111  $  y=x;
  $  090.后驾驶侧安全带引爆计数器                             $    $           $    $  ANS002.BYTE112  $  y=x;
  $  091.后乘客侧安全带引爆计数器                             $    $           $    $  ANS002.BYTE113  $  y=x;
  $  092.后驾驶侧侧气囊引爆计数器                             $    $           $    $  ANS002.BYTE114  $  y=x;
  $  093.后乘客侧侧气囊引爆计数器                             $    $           $    $  ANS002.BYTE115  $  y=x;
  $  094.在碰撞发生时的能量储备电压                           $    $  V        $    $  ANS002.BYTE116  $  y=x*0.2;
  $  095.在气囊引爆后的能量储备电压                           $    $  V        $    $  ANS002.BYTE117  $  y=x*0.2;
  $  096.引爆前电源电压                                       $    $  V        $    $  ANS002.BYTE118  $  y=x*0.1;
  $  097.引爆后电源电压                                       $    $  V        $    $  ANS002.BYTE119  $  y=x*0.1;
  $  098.碰撞输出状态                                         $    $           $    $  ANS002.BYTE120  $  if((x&0x01)==0) y=@0453;else y=@0035;
  $  099.最终碰撞代码                                         $    $           $    $  ANS003.BYTE004  $  HEX(X1);
  $  100.碰撞次数记录器                                       $    $           $    $  ANS003.BYTE005  $  y=x;
  $  101.发生碰撞时后排中间乘员座位安全带指示警告灯状态       $    $           $    $  ANS003.BYTE006  $  if(((x&0x30)>>4)==0) y=@028b;else if(((x&0x30)>>4)==1) y=@043e;else if(((x&0x30)>>4)==16) y=@043f;else y=@0035;
  $  102.发生碰撞时后排乘员座位安全带指示警告灯状态           $    $           $    $  ANS003.BYTE006  $  if(((x&0x0C)>>2)==0) y=@028b;else if(((x&0x0C)>>2)==1) y=@043e;else if(((x&0x0C)>>2)==16) y=@043f;else y=@0035;
  $  103.发生碰撞时后驾驶侧座位安全带指示警告灯状态           $    $           $    $  ANS003.BYTE006  $  if((x&0x03)==0) y=@028b;else if((x&0x03)==1) y=@043e;else if((x&0x03)==16) y=@043f;else y=@0035;
  $  104.发生碰撞时前排乘员安全带指示警告灯状态               $    $           $    $  ANS003.BYTE007  $  if(((x&0xC0)>>6)==0) y=@028b;else if(((x&0xC0)>>6)==1) y=@043e;else if(((x&0xC0)>>6)==16) y=@043f;else y=@0035;
  $  105.发生碰撞时驾驶员安全带指示警告灯状态                 $    $           $    $  ANS003.BYTE007  $  if(((x&0x30)>>4)==0) y=@028b;else if(((x&0x30)>>4)==1) y=@043e;else if(((x&0x30)>>4)==16) y=@043f;else y=@0035;
  $  106.发生碰撞时PADI警告灯状态                             $    $           $    $  ANS003.BYTE007  $  if(((x&0x0C)>>2)==0) y=@028b;else if(((x&0x0C)>>2)==1) y=@043e;else if(((x&0x0C)>>2)==16) y=@043f;else y=@0035;
  $  107.发生碰撞时系统警告灯状态                             $    $           $    $  ANS003.BYTE007  $  if((x&0x03)==0) y=@028b;else if((x&0x03)==1) y=@043e;else if((x&0x03)==16) y=@043f;else y=@0035;
  $  108.PASFP故障状态                                        $    $           $    $  ANS003.BYTE008  $  if(((x&0x08)>>3)==0) y=@0197;else if(((x&0x08)>>3)==1) y=@00b3;else y=@0035;
  $  109.PASFD故障状态                                        $    $           $    $  ANS003.BYTE008  $  if(((x&0x04)>>2)==0) y=@0197;else if(((x&0x04)>>2)==1) y=@00b3;else y=@0035;
  $  110.主传感器柱2 故障状态                                 $    $           $    $  ANS003.BYTE008  $  if(((x&0x02)>>1)==0) y=@0197;else if(((x&0x02)>>1)==1) y=@00b3;else y=@0035;
  $  111.主传感器柱1 故障状态                                 $    $           $    $  ANS003.BYTE008  $  if((x&0x01)==0) y=@0197;else if((x&0x01)==1) y=@00b3;else y=@0035;
  $  112.DIS ALP 全低功率级                                   $    $           $    $  ANS003.BYTE009  $  if(((x&0x20)>>5)==0) y=@00dc;else if(((x&0x20)>>5)==1) y=@00db;else y=@0035;
  $  113.DIS AHP 全高功率级                                   $    $           $    $  ANS003.BYTE009  $  if(((x&0x10)>>4)==0) y=@00dc;else if(((x&0x10)>>4)==1) y=@00db;else y=@0035;
  $  114.DIS SFL HW硬件线禁能状态                             $    $           $    $  ANS003.BYTE009  $  if(((x&0x08)>>3)==0) y=@00dc;else if(((x&0x08)>>3)==1) y=@00db;else y=@0035;
  $  115.前排乘员监测坐垫开关状态                             $    $           $    $  ANS003.BYTE011  $  if(((x&0xC0)>>6)==0) y=@0454;else if(((x&0xC0)>>6)==1) y=@0455;else if(((x&0xC0)>>6)==16) y=@00b3;else y=@0035;
  $  116.前排乘员气囊是否激活开关                             $    $           $    $  ANS003.BYTE011  $  if(((x&0x30)>>4)==0) y=@0456;else if(((x&0x30)>>4)==1) y=@0457;else if(((x&0x30)>>4)==16) y=@00b3;else y=@0035;
  $  117.前排乘员扣带开关状态                                 $    $           $    $  ANS003.BYTE011  $  if(((x&0x0C)>>2)==0) y=@0446;else if(((x&0x0C)>>2)==1) y=@0447;else if(((x&0x0C)>>2)==16) y=@00b3;else y=@0035;
  $  118.驾驶员扣带开关状态                                   $    $           $    $  ANS003.BYTE011  $  if((x&0x03)==0) y=@0446;else if((x&0x03)==1) y=@0447;else if((x&0x03)==16) y=@00b3;else y=@0035;
  $  119.从RAM中获取的故障码记录                              $    $           $    $  ANS003.BYTE012  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  120.车速                                                 $    $  km/h     $    $  ANS003.BYTE036  $  y=x1*256+x2;
  $  121.运行时间计数器                                       $    $  s        $    $  ANS003.BYTE038  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  122.碰撞类型                                             $    $           $    $  ANS003.BYTE042  $  if((x1*256+x2)==0x01) y=@0448;else if((x1*256+x2)==0x02) y=@0449;else if((x1*256+x2)==0x04) y=@044a;else if((x1*256+x2)==0x08) y=@044b;else if((x1*256+x2)==0x10) y=@0035;else if((x1*256+x2)==0x100) y=@044c;else if((x1*256+x2)==0x20) y=@044d;else if((x1*256+x2)==0x40) y=@044e;else if((x1*256+x2)==0x80) y=@044f;else y=@0035;
  $  123.前Algo启动时间                                       $    $  ms       $    $  ANS003.BYTE044  $  y=(x1*256+x2)*0.5;
  $  124.侧碰撞算法启动时间                                   $    $  ms       $    $  ANS003.BYTE046  $  y=(x1*256+x2)*0.5;
  $  125.后碰撞算法启动时间                                   $    $  ms       $    $  ANS003.BYTE048  $  y=(x1*256+x2)*0.5;
  $  126.碰撞发生到阈值接近的时间                             $    $  ms       $    $  ANS003.BYTE050  $  y=(x1*256+x2)*0.5;
  $  127.碰撞发生到安全带预紧阈值超出的时间                   $    $  ms       $    $  ANS003.BYTE052  $  y=(x1*256+x2)*0.5;
  $  128.碰撞发生到前气囊引爆阈值超出时间                     $    $  ms       $    $  ANS003.BYTE054  $  y=(x1*256+x2)*0.5;
  $  129.碰撞发生到侧气囊引爆阈值超出时间                     $    $  ms       $    $  ANS003.BYTE056  $  y=(x1*256+x2)*0.5;
  $  130.算法复位时间                                         $    $  ms       $    $  ANS003.BYTE058  $  y=(x1*256+x2)*0.5;
  $  131.碰撞发生到ECU X轴最大加速时间                        $    $  ms       $    $  ANS003.BYTE060  $  y=(x1*256+x2)*0.5;
  $  132.碰撞发生到ECU Y轴最大加速时间                        $    $  ms       $    $  ANS003.BYTE062  $  y=(x1*256+x2)*0.5;
  $  133.碰撞发生到前驾驶员PAS最大加速时间                    $    $  ms       $    $  ANS003.BYTE064  $  y=(x1*256+x2)*0.5;
  $  134.碰撞发生到前排乘员PAS最大加速时间                    $    $  ms       $    $  ANS003.BYTE066  $  y=(x1*256+x2)*0.5;
  $  135.碰撞发生到PASMD/UFSD最大加速时间                     $    $  ms       $    $  ANS003.BYTE068  $  y=(x1*256+x2)*0.5;
  $  136.碰撞发生到PASMP/UFSP最大加速时间                     $    $  ms       $    $  ANS003.BYTE070  $  y=(x1*256+x2)*0.5;
  $  137.可靠性                                               $    $           $    $  ANS003.BYTE075  $  if(x==0) y=@0450;else if(x==1) y=@0451;else if(x==2) y=@0452;else y=@0035;
  $  138.Algo激活期间X轴最大加速时间                          $    $  g        $    $  ANS003.BYTE076  $  y=x*0.8;
  $  139.Algo激活期间Y轴最大加速时间                          $    $  g        $    $  ANS003.BYTE077  $  y=x*0.8;
  $  140.Algo激活期间PASFD最大加速时间                        $    $  g        $    $  ANS003.BYTE078  $  y=x;
  $  141.Algo激活期间PASFP最大加速时间                        $    $  g        $    $  ANS003.BYTE079  $  y=x;
  $  142.Algo激活期间PASMD/UFSD最大加速时间                   $    $  g        $    $  ANS003.BYTE080  $  y=x;
  $  143.Algo激活期间PASMP/UFSP最大加速时间                   $    $  g        $    $  ANS003.BYTE081  $  y=x;
  $  144.Delta速度                                            $    $           $    $  ANS003.BYTE082  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  145.驾驶员安全带引爆计数器                               $    $           $    $  ANS003.BYTE102  $  y=x;
  $  146.前排乘员安全带引爆计数器                             $    $           $    $  ANS003.BYTE103  $  y=x;
  $  147.驾驶员气囊引爆计数器                                 $    $           $    $  ANS003.BYTE104  $  y=x;
  $  148.前排乘员气囊引爆计数器                               $    $           $    $  ANS003.BYTE105  $  y=x;
  $  149.驾驶员侧气囊引爆计数器                               $    $           $    $  ANS003.BYTE106  $  y=x;
  $  150.乘员侧气囊引爆计数器                                 $    $           $    $  ANS003.BYTE107  $  y=x;
  $  151.驾驶员气帘引爆计数器                                 $    $           $    $  ANS003.BYTE108  $  y=x;
  $  152.前排乘员气帘引爆计数器                               $    $           $    $  ANS003.BYTE109  $  y=x;
  $  153.驾驶员膝气袋引爆计数器                               $    $           $    $  ANS003.BYTE110  $  y=x;
  $  154.前排乘员膝气袋引爆计数器                             $    $           $    $  ANS003.BYTE111  $  y=x;
  $  155.后驾驶侧安全带引爆计数器                             $    $           $    $  ANS003.BYTE112  $  y=x;
  $  156.后乘客侧安全带引爆计数器                             $    $           $    $  ANS003.BYTE113  $  y=x;
  $  157.后驾驶侧侧气囊引爆计数器                             $    $           $    $  ANS003.BYTE114  $  y=x;
  $  158.后乘客侧侧气囊引爆计数器                             $    $           $    $  ANS003.BYTE115  $  y=x;
  $  159.在碰撞发生时的能量储备电压                           $    $  V        $    $  ANS003.BYTE116  $  y=x*0.2;
  $  160.在气囊引爆后的能量储备电压                           $    $  V        $    $  ANS003.BYTE117  $  y=x*0.2;
  $  161.引爆前电源电压                                       $    $  V        $    $  ANS003.BYTE118  $  y=x*0.1;
  $  162.引爆后电源电压                                       $    $  V        $    $  ANS003.BYTE119  $  y=x*0.1;
  $  163.碰撞输出状态                                         $    $           $    $  ANS003.BYTE120  $  if((x&0x01)==0) y=@0453;else y=@0035;
  $  164.客户模式                                             $    $           $    $  ANS004.BYTE004  $  if(x==0) y=@043c;else if(x==255) y=@043d;else y=@0035;
  $  165.车辆生产日期                                         $    $           $    $  ANS005.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6);
  $  166.上次保养日期                                         $    $           $    $  ANS006.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6);
  $  167.系统警告灯CAN设备状态                                $    $           $    $  ANS007.BYTE004  $  if(((x&0xE0)>>5)==0) y=@028b;else if(((x&0xE0)>>5)==1) y=@043e;else if(((x&0xE0)>>5)==7) y=@043f;else y=@0035;
  $  168.系统警告灯CAN设备客户编程状态                        $    $           $    $  ANS007.BYTE004  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  169.系统警告灯硬件设备状态                               $    $           $    $  ANS007.BYTE004  $  if(((x&0x0E)>>1)==0) y=@028b;else if(((x&0x0E)>>1)==1) y=@043e;else if(((x&0x0E)>>1)==2) y=@0440;else if(((x&0x0E)>>1)==7) y=@043f;else y=@0035;
  $  170.系统警告灯硬件设备客户编程状态                       $    $           $    $  ANS007.BYTE004  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  171.碰撞输出CAN设备状态                                  $    $           $    $  ANS007.BYTE008  $  if(((x&0xE0)>>5)==0) y=@0441;else if(((x&0xE0)>>5)==1) y=@0442;else if(((x&0xE0)>>5)==7) y=@0443;else y=@0035;
  $  172.碰撞输出CAN设备客户编程状态                          $    $           $    $  ANS007.BYTE008  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  173.碰撞输出硬件设备状态                                 $    $           $    $  ANS007.BYTE008  $  if(((x&0x0E)>>1)==0) y=@0441;else if(((x&0x0E)>>1)==1) y=@0442;else if(((x&0x0E)>>1)==2) y=@0444;else if(((x&0x0E)>>1)==7) y=@0443;else y=@0035;
  $  174.碰撞输出硬件设备客户编程状态                         $    $           $    $  ANS007.BYTE008  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  175.车辆特征信息                                         $    $           $    $  ANS008.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  176.车架号                                               $    $           $    $  ANS009.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:742 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
