
    车型ID：1117

    模拟：协议模拟-->1117

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:711 02 10 01 00 00 00 00 00       $~  ANS000:719 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:711 02 3E 80 00 00 00 00 00       $!  ANS000:719 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:711 03 19 02 09 00 00 00 00       $#  ANS000:719 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/15000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:711 04 14 FF FF FF 00 00 00       $$  ANS000:719 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:711 03 22 F1 A0 00 00 00 00       $%  ANS000:719 03 22 F1 A0 00 00 00 00
  $%  REQ001:711 03 22 F1 83 00 00 00 00       $%  ANS001:719 03 22 F1 83 00 00 00 00
  $%  REQ002:711 03 22 F1 91 00 00 00 00       $%  ANS002:719 03 22 F1 91 00 00 00 00
  $%  REQ003:711 03 22 F1 8B 00 00 00 00       $%  ANS003:719 03 22 F1 8B 00 00 00 00
  $%  REQ004:711 03 22 F1 A2 00 00 00 00       $%  ANS004:719 03 22 F1 A2 00 00 00 00
  $%  REQ005:711 03 22 F1 87 00 00 00 00       $%  ANS005:719 03 22 F1 87 00 00 00 00
  $%  REQ006:711 03 22 F1 10 00 00 00 00       $%  ANS006:719 03 22 F1 10 00 00 00 00
  $%  REQ007:711 03 22 F1 92 00 00 00 00       $%  ANS007:719 03 22 F1 92 00 00 00 00
  $%  REQ008:711 03 22 F1 8C 00 00 00 00       $%  ANS008:719 03 22 F1 8C 00 00 00 00
  $%  REQ009:711 03 22 F1 94 00 00 00 00       $%  ANS009:719 03 22 F1 94 00 00 00 00
  $%  REQ010:711 03 22 F1 8A 00 00 00 00       $%  ANS010:719 03 22 F1 8A 00 00 00 00
  $%  REQ011:711 03 22 F1 90 00 00 00 00       $%  ANS011:719 03 22 F1 90 00 00 00 00
  $%  REQ012:711 03 22 F1 A8 00 00 00 00       $%  ANS012:719 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元制造日期:                $%    $%  ANS003.BYTE004  $%  HEX(X1,X2,X3);
  $%  004:电控单元网络参考号:              $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试参考号（上次）:              $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数（上次）KM:              $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商识别号:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:VIN:                             $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:711 03 22 C0 01 00 00 00 00       $  ANS000:719 03 22 C0 01 00 00 00 00
  $  REQ001:711 03 22 C0 04 00 00 00 00       $  ANS001:719 03 22 C0 04 00 00 00 00
  $  REQ002:711 03 22 C0 03 00 00 00 00       $  ANS002:719 03 22 C0 03 00 00 00 00
  $  REQ003:711 03 22 C0 06 00 00 00 00       $  ANS003:719 03 22 C0 06 00 00 00 00
  $  REQ004:711 03 22 C0 02 00 00 00 00       $  ANS004:719 03 22 C0 02 00 00 00 00
  $  REQ005:711 03 22 C0 05 00 00 00 00       $  ANS005:719 03 22 C0 05 00 00 00 00
  $  REQ006:711 03 22 B2 00 00 00 00 00       $  ANS006:719 03 22 B2 00 00 00 00 00
  $  REQ007:711 03 22 B2 10 00 00 00 00       $  ANS007:719 03 22 B2 10 00 00 00 00
  $  REQ008:711 03 22 CA 10 00 00 00 00       $  ANS008:719 03 22 CA 10 00 00 00 00
  $  REQ009:711 03 22 CA 01 00 00 00 00       $  ANS009:719 03 22 CA 01 00 00 00 00
  $  REQ010:711 03 22 CA 0A 00 00 00 00       $  ANS010:719 03 22 CA 0A 00 00 00 00
  $  REQ011:711 03 22 CA 02 00 00 00 00       $  ANS011:719 03 22 CA 02 00 00 00 00
  $  REQ012:711 03 22 CA 03 00 00 00 00       $  ANS012:719 03 22 CA 03 00 00 00 00
  $  REQ013:711 03 22 CA 04 00 00 00 00       $  ANS013:719 03 22 CA 04 00 00 00 00
  $  REQ014:711 03 22 CA 05 00 00 00 00       $  ANS014:719 03 22 CA 05 00 00 00 00
  $  REQ015:711 03 22 CA 06 00 00 00 00       $  ANS015:719 03 22 CA 06 00 00 00 00
  $  REQ016:711 03 22 CA 07 00 00 00 00       $  ANS016:719 03 22 CA 07 00 00 00 00
  $  REQ017:711 03 22 CA 08 00 00 00 00       $  ANS017:719 03 22 CA 08 00 00 00 00
  $  REQ018:711 03 22 CA 09 00 00 00 00       $  ANS018:719 03 22 CA 09 00 00 00 00
  $  REQ019:711 03 22 B1 00 00 00 00 00       $  ANS019:719 03 22 B1 00 00 00 00 00
  $  REQ020:711 03 22 B1 01 00 00 00 00       $  ANS020:719 03 22 B1 01 00 00 00 00
  $  REQ021:711 03 22 B1 02 00 00 00 00       $  ANS021:719 03 22 B1 02 00 00 00 00
  $  REQ022:711 03 22 B0 01 00 00 00 00       $  ANS022:719 03 22 B0 01 00 00 00 00
  $  REQ023:711 03 22 B1 82 00 00 00 00       $  ANS023:719 03 22 B1 82 00 00 00 00
  $  REQ024:711 03 22 B1 83 00 00 00 00       $  ANS024:719 03 22 B1 83 00 00 00 00
  $  REQ025:711 03 22 B2 15 00 00 00 00       $  ANS025:719 03 22 B2 15 00 00 00 00
  $  REQ026:711 03 22 CF 10 00 00 00 00       $  ANS026:719 03 22 CF 10 00 00 00 00
  $  REQ027:711 03 22 C0 0B 00 00 00 00       $  ANS027:719 03 22 C0 0B 00 00 00 00
  $  REQ028:711 03 22 B0 00 00 00 00 00       $  ANS028:719 03 22 B0 00 00 00 00 00
  $  REQ029:711 03 22 B1 84 00 00 00 00       $  ANS029:719 03 22 B1 84 00 00 00 00
  $  REQ030:711 03 22 B0 06 00 00 00 00       $  ANS030:719 03 22 B0 06 00 00 00 00
  $  REQ031:711 03 22 B0 04 00 00 00 00       $  ANS031:719 03 22 B0 04 00 00 00 00
  $  REQ032:711 03 22 B1 80 00 00 00 00       $  ANS032:719 03 22 B1 80 00 00 00 00
  $  REQ033:711 03 22 B1 81 00 00 00 00       $  ANS033:719 03 22 B1 81 00 00 00 00
  $  REQ034:711 03 22 B0 05 00 00 00 00       $  ANS034:719 03 22 B0 05 00 00 00 00
  $  REQ035:711 03 22 B0 84 00 00 00 00       $  ANS035:719 03 22 B0 84 00 00 00 00
  $  REQ036:711 03 22 B2 90 00 00 00 00       $  ANS036:719 03 22 B2 90 00 00 00 00
  $  REQ037:711 03 22 B0 83 00 00 00 00       $  ANS037:719 03 22 B0 83 00 00 00 00
  $  REQ038:711 03 22 B0 82 00 00 00 00       $  ANS038:719 03 22 B0 82 00 00 00 00
  $  REQ039:711 03 22 B0 07 00 00 00 00       $  ANS039:719 03 22 B0 07 00 00 00 00
  $  REQ040:711 03 22 C1 06 00 00 00 00       $  ANS040:719 03 22 C1 06 00 00 00 00
  $  REQ041:711 03 22 C0 0A 00 00 00 00       $  ANS041:719 03 22 C0 0A 00 00 00 00
  $  REQ042:711 03 22 C0 07 00 00 00 00       $  ANS042:719 03 22 C0 07 00 00 00 00
  $  REQ043:711 03 22 C0 09 00 00 00 00       $  ANS043:719 03 22 C0 09 00 00 00 00

  $  000.APN1名称                            $    $          $    $  ANS000.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  001.APN1名称                            $    $          $    $  ANS001.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  002.APN1 密码                           $    $          $    $  ANS002.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  003.APN1 密码                           $    $          $    $  ANS003.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  004.APN1 用户名                         $    $          $    $  ANS004.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  005.APN1 用户名                         $    $          $    $  ANS005.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  006.APP(应用软件)激活状态               $    $          $    $  ANS006.BYTE004  $  if((x&0x03)==0) y=@0035;else if((x&0x03)==1) y=@03fc;else if((x&0x03)==2) y=@034e;else if((x&0x03)==3) y=@034f;else y=@0035;
  $  007.Ecall已启用                         $    $          $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  008.启用BCAL                            $    $          $    $  ANS006.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  009.启用ICALL                           $    $          $    $  ANS006.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  010.启用车辆状态                        $    $          $    $  ANS006.BYTE005  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  011.启用了旅程                          $    $          $    $  ANS006.BYTE005  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  012.在线娱乐功能开关                    $    $          $    $  ANS006.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  013.车辆被盗追踪功能开关                $    $          $    $  ANS006.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  014.启用远程控制                        $    $          $    $  ANS006.BYTE005  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  015.蓝牙键输入已启用                    $    $          $    $  ANS006.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  016.远程故障码检测功能开关              $    $          $    $  ANS006.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  017.数据采集功能开关                    $    $          $    $  ANS006.BYTE006  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  018.最后的关键交换结果                  $    $          $    $  ANS007.BYTE004  $  if(((x&0xFE)>>1)==0) y=@033c;else if(((x&0xFE)>>1)==1) y=@03ed;else if(((x&0xFE)>>1)==2) y=@03ee;else if(((x&0xFE)>>1)==3) y=@03ef;else if(((x&0xFE)>>1)==4) y=@0340;else if(((x&0xFE)>>1)==5) y=@03f0;else if(((x&0xFE)>>1)==6) y=@03f1;else if(((x&0xFE)>>1)==7) y=@002f;else y=@0035;
  $  019.完成初始密钥交换                    $    $          $    $  ANS007.BYTE004  $  if((x&0x01)==0) y=@028e;else if((x&0x01)==1) y=@043a;else y=@0035;
  $  020.配置检查状态                        $    $          $    $  ANS007.BYTE005  $  if((x&0x01)==0) y=@0412;else if((x&0x01)==1) y=@03ed;else y=@0035;
  $  021.获取数据库信息                      $    $          $    $  ANS008.BYTE004  $  y=x;
  $  022.MCC1                                $    $          $    $  ANS009.BYTE004  $  ASCII(X1,X2,X3);
  $  023.MNC1                                $    $          $    $  ANS009.BYTE007  $  ASCII(X1,X2,X3);
  $  024.默认电话号码                        $    $          $    $  ANS009.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  025.默认公共服务号码1                   $    $          $    $  ANS009.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  026.Call类型                            $    $          $    $  ANS009.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  027.是否云端获取号码1                   $    $          $    $  ANS009.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  028.MCC10                               $    $          $    $  ANS010.BYTE004  $  ASCII(X1,X2,X3);
  $  029.MNC10                               $    $          $    $  ANS010.BYTE007  $  ASCII(X1,X2,X3);
  $  030.默认电话号码10                      $    $          $    $  ANS010.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  031.默认公共服务号码10                  $    $          $    $  ANS010.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  032.呼叫类型10                          $    $          $    $  ANS010.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  033.是否云端获取号码10                  $    $          $    $  ANS010.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  034.MCC2                                $    $          $    $  ANS011.BYTE004  $  ASCII(X1,X2,X3);
  $  035.MNC2                                $    $          $    $  ANS011.BYTE007  $  ASCII(X1,X2,X3);
  $  036.默认电话号码2                       $    $          $    $  ANS011.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  037.默认公共服务号码2                   $    $          $    $  ANS011.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  038.Call类型2                           $    $          $    $  ANS011.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  039.是否云端获取号码2                   $    $          $    $  ANS011.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  040.MCC3                                $    $          $    $  ANS012.BYTE004  $  ASCII(X1,X2,X3);
  $  041.MNC3                                $    $          $    $  ANS012.BYTE007  $  ASCII(X1,X2,X3);
  $  042.默认电话号码3                       $    $          $    $  ANS012.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  043.默认公共服务号码3                   $    $          $    $  ANS012.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  044.Call类型3                           $    $          $    $  ANS012.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  045.是否云端获取号码3                   $    $          $    $  ANS012.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  046.MCC4移动国家码4                     $    $          $    $  ANS013.BYTE004  $  ASCII(X1,X2,X3);
  $  047.MNC4移动网络码4                     $    $          $    $  ANS013.BYTE007  $  ASCII(X1,X2,X3);
  $  048.默认电话号码4                       $    $          $    $  ANS013.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  049.默认公共服务号码4                   $    $          $    $  ANS013.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  050.Call类型4                           $    $          $    $  ANS013.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  051.是否云端获取号码4                   $    $          $    $  ANS013.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  052.MCC5移动国家码5                     $    $          $    $  ANS014.BYTE004  $  ASCII(X1,X2,X3);
  $  053.MNC5移动网络码5                     $    $          $    $  ANS014.BYTE007  $  ASCII(X1,X2,X3);
  $  054.默认电话号码5                       $    $          $    $  ANS014.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  055.默认公共服务号码5                   $    $          $    $  ANS014.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  056.Call类型5                           $    $          $    $  ANS014.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  057.是否云端获取号码5                   $    $          $    $  ANS014.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  058.MCC6                                $    $          $    $  ANS015.BYTE004  $  ASCII(X1,X2,X3);
  $  059.MNC6移动网络码6                     $    $          $    $  ANS015.BYTE007  $  ASCII(X1,X2,X3);
  $  060.默认电话号码6                       $    $          $    $  ANS015.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  061.默认公共服务号码6                   $    $          $    $  ANS015.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  062.Call类型6                           $    $          $    $  ANS015.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  063.是否云端获取号码6                   $    $          $    $  ANS015.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  064.MCC7                                $    $          $    $  ANS016.BYTE004  $  ASCII(X1,X2,X3);
  $  065.MNC7                                $    $          $    $  ANS016.BYTE007  $  ASCII(X1,X2,X3);
  $  066.默认电话号码7                       $    $          $    $  ANS016.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  067.默认公共服务号码7                   $    $          $    $  ANS016.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  068.呼叫类型7                           $    $          $    $  ANS016.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  069.是否云端获取号码7                   $    $          $    $  ANS016.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  070.MCC8                                $    $          $    $  ANS017.BYTE004  $  ASCII(X1,X2,X3);
  $  071.MNC8                                $    $          $    $  ANS017.BYTE007  $  ASCII(X1,X2,X3);
  $  072.默认电话号码8                       $    $          $    $  ANS017.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  073.默认公共服务号码8                   $    $          $    $  ANS017.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  074.呼叫类型8                           $    $          $    $  ANS017.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  075.是否云端获取号码8                   $    $          $    $  ANS017.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  076.MCC9                                $    $          $    $  ANS018.BYTE004  $  ASCII(X1,X2,X3);
  $  077.MNC9                                $    $          $    $  ANS018.BYTE007  $  ASCII(X1,X2,X3);
  $  078.默认电话号码9                       $    $          $    $  ANS018.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  079.默认公共服务号码9                   $    $          $    $  ANS018.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  080.呼叫类型9                           $    $          $    $  ANS018.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0035;
  $  081.是否云端获取号码9                   $    $          $    $  ANS018.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0035;
  $  082.GPS天线状态                         $    $          $    $  ANS019.BYTE004  $  if((x&0x01)==0) y=@0339;else if((x&0x01)==1) y=@033a;else y=@0035;
  $  083.经度                                $    $          $    $  ANS020.BYTE004  $  if(x1<0x80) y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.000001;else y=((x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000)*0.000001;
  $  084.维度                                $    $          $    $  ANS020.BYTE008  $  if(x1<0x80) y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.0001;else y=((x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000)*0.0001;
  $  085.GPS时间                             $    $  s       $    $  ANS021.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  086.GPS精度                             $    $          $    $  ANS021.BYTE008  $  y=x*0.1;
  $  087.GPS速度                             $    $  kph     $    $  ANS021.BYTE009  $  y=x;
  $  088.GPS方向                             $    $          $    $  ANS021.BYTE010  $  y=x*2;
  $  089.GPS搜星个数                         $    $          $    $  ANS021.BYTE011  $  if(((x&0x70)>>4)==0) y=@034a;else if(((x&0x70)>>4)==1) y=@03f3;else if(((x&0x70)>>4)==2) y=@034c;else y=@0035;
  $  090.GPS搜星个数                         $    $          $    $  ANS021.BYTE011  $  y=(x&0x0F);
  $  091.内部SIM IC的ICCID代码               $    $          $    $  ANS022.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  092.APN1 IP地址                         $    $          $    $  ANS023.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  093.APN2 IP地址                         $    $          $    $  ANS024.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  094.防盗状态                            $    $          $    $  ANS025.BYTE004  $  if(x==0) y=@03f4;else if(x==1) y=@03f5;else y=@0035;
  $  095.防盗PIN码                           $    $          $    $  ANS026.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  096.信息娱乐系统 APN信息                $    $          $    $  ANS027.BYTE004  $  y=x;
  $  097.MPU软件版本                         $    $          $    $  ANS028.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  098.二级天线连接                        $    $          $    $  ANS029.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0339;else if(((x&0x0C)>>2)==1) y=@033a;else y=@0035;
  $  099.主天线连接                          $    $          $    $  ANS029.BYTE004  $  if((x&0x03)==0) y=@0339;else if((x&0x03)==1) y=@033a;else y=@0035;
  $  100.Modem硬件版本                       $    $          $    $  ANS030.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  101.SIM卡IMEI                           $    $          $    $  ANS031.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  102.SIM卡MCC移动国家码                  $    $          $    $  ANS032.BYTE004  $  ASCII(X1,X2,X3);
  $  103.MNC移动网络码                       $    $          $    $  ANS032.BYTE007  $  ASCII(X1,X2,X3);
  $  104.信号强度                            $    $          $    $  ANS033.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.1-150;
  $  105.使用SIM卡种类                       $    $          $    $  ANS033.BYTE006  $  if(((x&0x40)>>6)==0) y=@033b;else if(((x&0x40)>>6)==1) y=@033b;else y=@0035;
  $  106.网络制式                            $    $          $    $  ANS033.BYTE006  $  if(((x&0x38)>>3)==0) y=@03e1;else if(((x&0x38)>>3)==1) y=@03e2;else if(((x&0x38)>>3)==2) y=@03e3;else if(((x&0x38)>>3)==3) y=@03e4;else if(((x&0x38)>>3)==4) y=@03e5;else if(((x&0x38)>>3)==5) y=@03e6;else if(((x&0x38)>>3)==6) y=@03e7;else y=@0035;
  $  107.接收到的信号强度显示                $    $          $    $  ANS033.BYTE006  $  y=(x&0x07);
  $  108.网络状态                            $    $          $    $  ANS033.BYTE007  $  if((x&0x07)==0) y=@03e8;else if((x&0x07)==1) y=@03e9;else if((x&0x07)==2) y=@03ea;else if((x&0x07)==3) y=@03eb;else if((x&0x07)==4) y=@01e5;else if((x&0x07)==5) y=@03ec;else y=@0035;
  $  109.NAD 软件版本                        $    $          $    $  ANS034.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  110.PDP(分组数据协议)连接成功次数       $    $          $    $  ANS035.BYTE004  $  y=(x1*256+x2);
  $  111.PDP(分组数据协议)连接失败次数       $    $          $    $  ANS035.BYTE006  $  y=(x1*256+x2);
  $  112.PDP(分组数据协议)断掉次数           $    $          $    $  ANS035.BYTE008  $  y=(x1*256+x2);
  $  113.识别无效的PIN时间                   $    $          $    $  ANS036.BYTE004  $  y=((x&0xF0)>>4);
  $  114.标识PIN的标志被锁定                 $    $          $    $  ANS036.BYTE004  $  if((x&0x01)==0) y=@0404;else if((x&0x01)==1) y=@0436;else y=@0035;
  $  115.PIN码剩余锁定时间                   $    $  min     $    $  ANS036.BYTE005  $  y=(x1*256+x2);
  $  116.Modem唤醒                           $    $          $    $  ANS037.BYTE004  $  if(((x&0x04)>>2)==0) y=@0437;else if(((x&0x04)>>2)==1) y=@011f;else y=@0035;
  $  117.CAN2唤醒                            $    $          $    $  ANS037.BYTE004  $  if(((x&0x02)>>1)==0) y=@0437;else if(((x&0x02)>>1)==1) y=@011f;else y=@0035;
  $  118.CAN1唤醒                            $    $          $    $  ANS037.BYTE004  $  if((x&0x01)==0) y=@0437;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  119.周期性唤醒                          $    $          $    $  ANS037.BYTE005  $  if((x&0x01)==0) y=@0437;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  120.TBOX系统时间                        $    $  s       $    $  ANS038.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  121.TBOX ID                             $    $          $    $  ANS039.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  122.进入休眠模式时间                    $    $  min     $    $  ANS040.BYTE004  $  y=x;
  $  123.允许周期唤醒时间                    $    $  d       $    $  ANS040.BYTE005  $  y=x;
  $  124.TSP APN 信息                        $    $          $    $  ANS041.BYTE004  $  y=x;
  $  125.后台IP地址                          $    $          $    $  ANS042.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  126.后台IP端口                          $    $          $    $  ANS043.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:711 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
