
    车型ID：1119

    模拟：协议模拟-->1119

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:711 02 10 01 00 00 00 00 00       $~  ANS000:719 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:711 02 3E 80 00 00 00 00 00       $!  ANS000:719 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:711 03 19 02 09 00 00 00 00       $#  ANS000:719 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/17000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:711 04 14 FF FF FF 00 00 00       $$  ANS000:719 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:711 03 22 F1 A0 00 00 00 00       $%  ANS000:719 03 22 F1 A0 00 00 00 00
  $%  REQ001:711 03 22 F1 83 00 00 00 00       $%  ANS001:719 03 22 F1 83 00 00 00 00
  $%  REQ002:711 03 22 F1 A1 00 00 00 00       $%  ANS002:719 03 22 F1 A1 00 00 00 00
  $%  REQ003:711 03 22 F1 91 00 00 00 00       $%  ANS003:719 03 22 F1 91 00 00 00 00
  $%  REQ004:711 03 22 F1 A2 00 00 00 00       $%  ANS004:719 03 22 F1 A2 00 00 00 00
  $%  REQ005:711 03 22 F1 87 00 00 00 00       $%  ANS005:719 03 22 F1 87 00 00 00 00
  $%  REQ006:711 03 22 F1 10 00 00 00 00       $%  ANS006:719 03 22 F1 10 00 00 00 00
  $%  REQ007:711 03 22 F1 92 00 00 00 00       $%  ANS007:719 03 22 F1 92 00 00 00 00
  $%  REQ008:711 03 22 F1 8C 00 00 00 00       $%  ANS008:719 03 22 F1 8C 00 00 00 00
  $%  REQ009:711 03 22 F1 94 00 00 00 00       $%  ANS009:719 03 22 F1 94 00 00 00 00
  $%  REQ010:711 03 22 F1 8A 00 00 00 00       $%  ANS010:719 03 22 F1 8A 00 00 00 00
  $%  REQ011:711 03 22 F1 90 00 00 00 00       $%  ANS011:719 03 22 F1 90 00 00 00 00
  $%  REQ012:711 03 22 F1 A8 00 00 00 00       $%  ANS012:719 03 22 F1 A8 00 00 00 00
  $%  REQ013:711 03 22 F1 8B 00 00 00 00       $%  ANS013:719 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号（上次）:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号（上次）:          $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数（上次）:                $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商标识号:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:车辆识别代码:                    $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  015:电控单元生产日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:711 03 22 C0 01 00 00 00 00       $  ANS000:719 03 22 C0 01 00 00 00 00
  $  REQ001:711 03 22 C0 04 00 00 00 00       $  ANS001:719 03 22 C0 04 00 00 00 00
  $  REQ002:711 03 22 C0 03 00 00 00 00       $  ANS002:719 03 22 C0 03 00 00 00 00
  $  REQ003:711 03 22 C0 06 00 00 00 00       $  ANS003:719 03 22 C0 06 00 00 00 00
  $  REQ004:711 03 22 C0 02 00 00 00 00       $  ANS004:719 03 22 C0 02 00 00 00 00
  $  REQ005:711 03 22 C0 05 00 00 00 00       $  ANS005:719 03 22 C0 05 00 00 00 00
  $  REQ006:711 03 22 B2 00 00 00 00 00       $  ANS006:719 03 22 B2 00 00 00 00 00
  $  REQ007:711 03 22 B2 50 00 00 00 00       $  ANS007:719 03 22 B2 50 00 00 00 00
  $  REQ008:711 03 22 B0 03 00 00 00 00       $  ANS008:719 03 22 B0 03 00 00 00 00
  $  REQ009:711 03 22 B2 10 00 00 00 00       $  ANS009:719 03 22 B2 10 00 00 00 00
  $  REQ010:711 03 22 CA 01 00 00 00 00       $  ANS010:719 03 22 CA 01 00 00 00 00
  $  REQ011:711 03 22 CA 0A 00 00 00 00       $  ANS011:719 03 22 CA 0A 00 00 00 00
  $  REQ012:711 03 22 CA 02 00 00 00 00       $  ANS012:719 03 22 CA 02 00 00 00 00
  $  REQ013:711 03 22 CA 03 00 00 00 00       $  ANS013:719 03 22 CA 03 00 00 00 00
  $  REQ014:711 03 22 CA 04 00 00 00 00       $  ANS014:719 03 22 CA 04 00 00 00 00
  $  REQ015:711 03 22 CA 05 00 00 00 00       $  ANS015:719 03 22 CA 05 00 00 00 00
  $  REQ016:711 03 22 CA 06 00 00 00 00       $  ANS016:719 03 22 CA 06 00 00 00 00
  $  REQ017:711 03 22 CA 07 00 00 00 00       $  ANS017:719 03 22 CA 07 00 00 00 00
  $  REQ018:711 03 22 CA 08 00 00 00 00       $  ANS018:719 03 22 CA 08 00 00 00 00
  $  REQ019:711 03 22 CA 09 00 00 00 00       $  ANS019:719 03 22 CA 09 00 00 00 00
  $  REQ020:711 03 22 CA 81 00 00 00 00       $  ANS020:719 03 22 CA 81 00 00 00 00
  $  REQ021:711 03 22 CF 01 00 00 00 00       $  ANS021:719 03 22 CF 01 00 00 00 00
  $  REQ022:711 03 22 B1 00 00 00 00 00       $  ANS022:719 03 22 B1 00 00 00 00 00
  $  REQ023:711 03 22 B1 01 00 00 00 00       $  ANS023:719 03 22 B1 01 00 00 00 00
  $  REQ024:711 03 22 B1 02 00 00 00 00       $  ANS024:719 03 22 B1 02 00 00 00 00
  $  REQ025:711 03 22 B0 01 00 00 00 00       $  ANS025:719 03 22 B0 01 00 00 00 00
  $  REQ026:711 03 22 CA 12 00 00 00 00       $  ANS026:719 03 22 CA 12 00 00 00 00
  $  REQ027:711 03 22 B1 82 00 00 00 00       $  ANS027:719 03 22 B1 82 00 00 00 00
  $  REQ028:711 03 22 B1 83 00 00 00 00       $  ANS028:719 03 22 B1 83 00 00 00 00
  $  REQ029:711 03 22 B2 15 00 00 00 00       $  ANS029:719 03 22 B2 15 00 00 00 00
  $  REQ030:711 03 22 CF 10 00 00 00 00       $  ANS030:719 03 22 CF 10 00 00 00 00
  $  REQ031:711 03 22 CA 80 00 00 00 00       $  ANS031:719 03 22 CA 80 00 00 00 00
  $  REQ032:711 03 22 B0 08 00 00 00 00       $  ANS032:719 03 22 B0 08 00 00 00 00
  $  REQ033:711 03 22 B0 00 00 00 00 00       $  ANS033:719 03 22 B0 00 00 00 00 00
  $  REQ034:711 03 22 B1 84 00 00 00 00       $  ANS034:719 03 22 B1 84 00 00 00 00
  $  REQ035:711 03 22 B0 04 00 00 00 00       $  ANS035:719 03 22 B0 04 00 00 00 00
  $  REQ036:711 03 22 B0 06 00 00 00 00       $  ANS036:719 03 22 B0 06 00 00 00 00
  $  REQ037:711 03 22 B0 05 00 00 00 00       $  ANS037:719 03 22 B0 05 00 00 00 00
  $  REQ038:711 03 22 B1 80 00 00 00 00       $  ANS038:719 03 22 B1 80 00 00 00 00
  $  REQ039:711 03 22 B1 81 00 00 00 00       $  ANS039:719 03 22 B1 81 00 00 00 00
  $  REQ040:711 03 22 B1 85 00 00 00 00       $  ANS040:719 03 22 B1 85 00 00 00 00
  $  REQ041:711 03 22 B0 84 00 00 00 00       $  ANS041:719 03 22 B0 84 00 00 00 00
  $  REQ042:711 03 22 B2 90 00 00 00 00       $  ANS042:719 03 22 B2 90 00 00 00 00
  $  REQ043:711 03 22 B0 83 00 00 00 00       $  ANS043:719 03 22 B0 83 00 00 00 00
  $  REQ044:711 03 22 B0 82 00 00 00 00       $  ANS044:719 03 22 B0 82 00 00 00 00
  $  REQ045:711 03 22 B0 07 00 00 00 00       $  ANS045:719 03 22 B0 07 00 00 00 00
  $  REQ046:711 03 22 C1 06 00 00 00 00       $  ANS046:719 03 22 C1 06 00 00 00 00
  $  REQ047:711 03 22 C0 07 00 00 00 00       $  ANS047:719 03 22 C0 07 00 00 00 00
  $  REQ048:711 03 22 C0 09 00 00 00 00       $  ANS048:719 03 22 C0 09 00 00 00 00
  $  REQ049:711 03 22 C0 08 00 00 00 00       $  ANS049:719 03 22 C0 08 00 00 00 00
  $  REQ050:711 03 22 CA 22 00 00 00 00       $  ANS050:719 03 22 CA 22 00 00 00 00

  $  000.APN1名称                          $    $          $    $  ANS000.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  001.APN2名称                          $    $          $    $  ANS001.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  002.APN1 密码                         $    $          $    $  ANS002.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  003.APN2密码                          $    $          $    $  ANS003.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  004.APN1 用户名                       $    $          $    $  ANS004.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  005.APN2用户名                        $    $          $    $  ANS005.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  006.应用模式                          $    $          $    $  ANS006.BYTE004  $  if((x&0x03)==0) y=@0035;else if((x&0x03)==1) y=@03fc;else if((x&0x03)==2) y=@034e;else if((x&0x03)==3) y=@03fd;else y=@0035;
  $  007.Ecall已启用                       $    $          $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  008.bCall已启用                       $    $          $    $  ANS006.BYTE005  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  009.Icall已启用                       $    $          $    $  ANS006.BYTE005  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  010.车辆状态已启用                    $    $          $    $  ANS006.BYTE005  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  011.星辰已启用                        $    $          $    $  ANS006.BYTE005  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  012.在线信息娱乐功能已启用            $    $          $    $  ANS006.BYTE005  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  013.被盗车辆跟踪已启用                $    $          $    $  ANS006.BYTE005  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  014.远程控制已启用                    $    $          $    $  ANS006.BYTE005  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  015.蓝牙密钥输入已启用                $    $          $    $  ANS006.BYTE006  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  016.远程故障诊断码已启用              $    $          $    $  ANS006.BYTE006  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  017.数据收集已启用                    $    $          $    $  ANS006.BYTE006  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  018.当前保存钥匙总数                  $    $          $    $  ANS007.BYTE004  $  y=x;
  $  019.当前钥匙的预订值                  $    $          $    $  ANS007.BYTE005  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  020.当前钥匙开始时间                  $    $  s       $    $  ANS007.BYTE009  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  021.当前钥匙结束时间                  $    $  s       $    $  ANS007.BYTE013  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  022.蓝牙模块版本                      $    $          $    $  ANS008.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  023.密钥交换反馈                      $    $          $    $  ANS009.BYTE004  $  if(((x&0xFE)>>1)==0x00) y=@03f6;else if(((x&0xFE)>>1)==0x01) y=@03ed;else if(((x&0xFE)>>1)==0x02) y=@03ee;else if(((x&0xFE)>>1)==0x03) y=@03ef;else if(((x&0xFE)>>1)==0x04) y=@0340;else if(((x&0xFE)>>1)==0x05) y=@03f7;else if(((x&0xFE)>>1)==0x06) y=@03f1;else if(((x&0xFE)>>1)==0x07) y=@002f;else if(((x&0xFE)>>1)==0x08) y=@0343;else if(((x&0xFE)>>1)==0x09) y=@03f8;else if(((x&0xFE)>>1)==0x0A) y=@03f9;else if(((x&0xFE)>>1)==0x0B) y=@0346;else if(((x&0xFE)>>1)==0x0C) y=@0347;else if(((x&0xFE)>>1)==0x0D) y=@03fa;else if(((x&0xFE)>>1)==0x0E) y=@03fb;else y=@0035;
  $  024.密钥交换完成状态                  $    $          $    $  ANS009.BYTE004  $  if((x&0x01)==0) y=@028e;else if((x&0x01)==1) y=@02cf;else y=@0035;
  $  025.配置状态                          $    $          $    $  ANS009.BYTE005  $  if((x&0x01)==0) y=@0412;else if((x&0x01)==1) y=@03ed;else y=@0035;
  $  026.MCC1                              $    $          $    $  ANS010.BYTE004  $  ASCII(X1,X2,X3);
  $  027.MNC1                              $    $          $    $  ANS010.BYTE007  $  ASCII(X1,X2,X3);
  $  028.默认电话号码1                     $    $          $    $  ANS010.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  029.默认公共服务号码1                 $    $          $    $  ANS010.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  030.Call类型1                         $    $          $    $  ANS010.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  031.是否云端获取号码1                 $    $          $    $  ANS010.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  032.MCC10                             $    $          $    $  ANS011.BYTE004  $  ASCII(X1,X2,X3);
  $  033.MNC10                             $    $          $    $  ANS011.BYTE007  $  ASCII(X1,X2,X3);
  $  034.默认电话号码10                    $    $          $    $  ANS011.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  035.默认公共服务号码10                $    $          $    $  ANS011.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  036.Call类型10                        $    $          $    $  ANS011.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  037.是否云端获取号码10                $    $          $    $  ANS011.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  038.MCC2                              $    $          $    $  ANS012.BYTE004  $  ASCII(X1,X2,X3);
  $  039.MNC2                              $    $          $    $  ANS012.BYTE007  $  ASCII(X1,X2,X3);
  $  040.默认电话号码2                     $    $          $    $  ANS012.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  041.默认公共服务号码2                 $    $          $    $  ANS012.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  042.Call类型2                         $    $          $    $  ANS012.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  043.是否云端获取号码2                 $    $          $    $  ANS012.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  044.MCC3                              $    $          $    $  ANS013.BYTE004  $  ASCII(X1,X2,X3);
  $  045.MNC3                              $    $          $    $  ANS013.BYTE007  $  ASCII(X1,X2,X3);
  $  046.默认电话号码3                     $    $          $    $  ANS013.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  047.默认公共服务号码3                 $    $          $    $  ANS013.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  048.Call类型3                         $    $          $    $  ANS013.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  049.是否云端获取号码3                 $    $          $    $  ANS013.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  050.MCC4                              $    $          $    $  ANS014.BYTE004  $  ASCII(X1,X2,X3);
  $  051.MNC4                              $    $          $    $  ANS014.BYTE007  $  ASCII(X1,X2,X3);
  $  052.默认电话号码4                     $    $          $    $  ANS014.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  053.默认公共服务号码4                 $    $          $    $  ANS014.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  054.Call类型4                         $    $          $    $  ANS014.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  055.是否云端获取号码4                 $    $          $    $  ANS014.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  056.MCC5                              $    $          $    $  ANS015.BYTE004  $  ASCII(X1,X2,X3);
  $  057.MNC5                              $    $          $    $  ANS015.BYTE007  $  ASCII(X1,X2,X3);
  $  058.默认电话号码5                     $    $          $    $  ANS015.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  059.默认公共服务号码5                 $    $          $    $  ANS015.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  060.Call类型5                         $    $          $    $  ANS015.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  061.是否云端获取号码5                 $    $          $    $  ANS015.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  062.MCC6                              $    $          $    $  ANS016.BYTE004  $  ASCII(X1,X2,X3);
  $  063.MNC6                              $    $          $    $  ANS016.BYTE007  $  ASCII(X1,X2,X3);
  $  064.默认电话号码6                     $    $          $    $  ANS016.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  065.默认公共服务号码6                 $    $          $    $  ANS016.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  066.Call类型6                         $    $          $    $  ANS016.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  067.是否云端获取号码6                 $    $          $    $  ANS016.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  068.MCC7                              $    $          $    $  ANS017.BYTE004  $  ASCII(X1,X2,X3);
  $  069.MNC7                              $    $          $    $  ANS017.BYTE007  $  ASCII(X1,X2,X3);
  $  070.默认电话号码7                     $    $          $    $  ANS017.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  071.默认公共服务号码7                 $    $          $    $  ANS017.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  072.Call类型7                         $    $          $    $  ANS017.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  073.是否云端获取号码7                 $    $          $    $  ANS017.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  074.MCC8                              $    $          $    $  ANS018.BYTE004  $  ASCII(X1,X2,X3);
  $  075.MNC8                              $    $          $    $  ANS018.BYTE007  $  ASCII(X1,X2,X3);
  $  076.默认电话号码8                     $    $          $    $  ANS018.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  077.默认公共服务号码8                 $    $          $    $  ANS018.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  078.Call类型8                         $    $          $    $  ANS018.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  079.是否云端获取号码8                 $    $          $    $  ANS018.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  080.MCC9                              $    $          $    $  ANS019.BYTE004  $  ASCII(X1,X2,X3);
  $  081.MNC9                              $    $          $    $  ANS019.BYTE007  $  ASCII(X1,X2,X3);
  $  082.默认电话号码9                     $    $          $    $  ANS019.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  083.默认公共服务号码9                 $    $          $    $  ANS019.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  084.Call类型9                         $    $          $    $  ANS019.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  085.是否云端获取号码9                 $    $          $    $  ANS019.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  086.大数据通道开关8                   $    $          $    $  ANS020.BYTE004  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  087.大数据通道开关7                   $    $          $    $  ANS020.BYTE004  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  088.大数据通道开关6                   $    $          $    $  ANS020.BYTE004  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  089.大数据通道开关5                   $    $          $    $  ANS020.BYTE004  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  090.大数据通道开关4                   $    $          $    $  ANS020.BYTE004  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  091.大数据通道开关3                   $    $          $    $  ANS020.BYTE004  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  092.大数据通道开关2                   $    $          $    $  ANS020.BYTE004  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  093.大数据通道开关1                   $    $          $    $  ANS020.BYTE004  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  094.大数据通道开关16                  $    $          $    $  ANS020.BYTE005  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  095.大数据通道开关15                  $    $          $    $  ANS020.BYTE005  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  096.大数据通道开关14                  $    $          $    $  ANS020.BYTE005  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  097.大数据通道开关13                  $    $          $    $  ANS020.BYTE005  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  098.大数据通道开关12                  $    $          $    $  ANS020.BYTE005  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  099.大数据通道开关11                  $    $          $    $  ANS020.BYTE005  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  100.大数据通道开关10                  $    $          $    $  ANS020.BYTE005  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  101.大数据通道开关9                   $    $          $    $  ANS020.BYTE005  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  102.大数据通道开关24                  $    $          $    $  ANS020.BYTE006  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  103.大数据通道开关23                  $    $          $    $  ANS020.BYTE006  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  104.大数据通道开关22                  $    $          $    $  ANS020.BYTE006  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  105.大数据通道开关21                  $    $          $    $  ANS020.BYTE006  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  106.大数据通道开关20                  $    $          $    $  ANS020.BYTE006  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  107.大数据通道开关19                  $    $          $    $  ANS020.BYTE006  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  108.大数据通道开关18                  $    $          $    $  ANS020.BYTE006  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  109.大数据通道开关17                  $    $          $    $  ANS020.BYTE006  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  110.大数据通道开关32                  $    $          $    $  ANS020.BYTE007  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  111.大数据通道开关31                  $    $          $    $  ANS020.BYTE007  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  112.大数据通道开关30                  $    $          $    $  ANS020.BYTE007  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  113.大数据通道开关29                  $    $          $    $  ANS020.BYTE007  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  114.大数据通道开关28                  $    $          $    $  ANS020.BYTE007  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  115.大数据通道开关27                  $    $          $    $  ANS020.BYTE007  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  116.大数据通道开关26                  $    $          $    $  ANS020.BYTE007  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  117.大数据通道开关25                  $    $          $    $  ANS020.BYTE007  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  118.大数据通道开关40                  $    $          $    $  ANS020.BYTE008  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  119.大数据通道开关39                  $    $          $    $  ANS020.BYTE008  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  120.大数据通道开关38                  $    $          $    $  ANS020.BYTE008  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  121.大数据通道开关37                  $    $          $    $  ANS020.BYTE008  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  122.大数据通道开关36                  $    $          $    $  ANS020.BYTE008  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  123.大数据通道开关35                  $    $          $    $  ANS020.BYTE008  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  124.大数据通道开关34                  $    $          $    $  ANS020.BYTE008  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  125.大数据通道开关33                  $    $          $    $  ANS020.BYTE008  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  126.触发事件开关8                     $    $          $    $  ANS021.BYTE004  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  127.触发事件开关7                     $    $          $    $  ANS021.BYTE004  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  128.触发事件开关6                     $    $          $    $  ANS021.BYTE004  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  129.触发事件开关5                     $    $          $    $  ANS021.BYTE004  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  130.触发事件开关4                     $    $          $    $  ANS021.BYTE004  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  131.触发事件开关3                     $    $          $    $  ANS021.BYTE004  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  132.触发事件开关2                     $    $          $    $  ANS021.BYTE004  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  133.触发事件开关1                     $    $          $    $  ANS021.BYTE004  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  134.触发事件开关16                    $    $          $    $  ANS021.BYTE005  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  135.触发事件开关15                    $    $          $    $  ANS021.BYTE005  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  136.触发事件开关14                    $    $          $    $  ANS021.BYTE005  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  137.触发事件开关13                    $    $          $    $  ANS021.BYTE005  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  138.触发事件开关12                    $    $          $    $  ANS021.BYTE005  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  139.触发事件开关11                    $    $          $    $  ANS021.BYTE005  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  140.触发事件开关10                    $    $          $    $  ANS021.BYTE005  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  141.触发事件开关9                     $    $          $    $  ANS021.BYTE005  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  142.触发事件开关24                    $    $          $    $  ANS021.BYTE006  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  143.触发事件开关23                    $    $          $    $  ANS021.BYTE006  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  144.触发事件开关22                    $    $          $    $  ANS021.BYTE006  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  145.触发事件开关21                    $    $          $    $  ANS021.BYTE006  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  146.触发事件开关20                    $    $          $    $  ANS021.BYTE006  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  147.触发事件开关19                    $    $          $    $  ANS021.BYTE006  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  148.触发事件开关18                    $    $          $    $  ANS021.BYTE006  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  149.触发事件开关17                    $    $          $    $  ANS021.BYTE006  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  150.触发事件开关32                    $    $          $    $  ANS021.BYTE007  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  151.触发事件开关31                    $    $          $    $  ANS021.BYTE007  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  152.触发事件开关30                    $    $          $    $  ANS021.BYTE007  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  153.触发事件开关29                    $    $          $    $  ANS021.BYTE007  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  154.触发事件开关28                    $    $          $    $  ANS021.BYTE007  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  155.触发事件开关27                    $    $          $    $  ANS021.BYTE007  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  156.触发事件开关26                    $    $          $    $  ANS021.BYTE007  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  157.触发事件开关25                    $    $          $    $  ANS021.BYTE007  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  158.触发事件开关40                    $    $          $    $  ANS021.BYTE008  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  159.触发事件开关39                    $    $          $    $  ANS021.BYTE008  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  160.触发事件开关38                    $    $          $    $  ANS021.BYTE008  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  161.触发事件开关37                    $    $          $    $  ANS021.BYTE008  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  162.触发事件开关36                    $    $          $    $  ANS021.BYTE008  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  163.触发事件开关35                    $    $          $    $  ANS021.BYTE008  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  164.触发事件开关34                    $    $          $    $  ANS021.BYTE008  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  165.触发事件开关33                    $    $          $    $  ANS021.BYTE008  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  166.GNSS天线状态                      $    $          $    $  ANS022.BYTE004  $  if((x&0x01)==0) y=@0339;else if((x&0x01)==1) y=@0354;else y=@0035;
  $  167.经度                              $    $          $    $  ANS023.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*1*0.000001;
  $  168.维度                              $    $          $    $  ANS023.BYTE008  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*1*0.000001;
  $  169.GNSS时间                          $    $  s       $    $  ANS024.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  170.GNSS精度                          $    $          $    $  ANS024.BYTE008  $  y=x*0.1;
  $  171.GNSS速度                          $    $  kph     $    $  ANS024.BYTE009  $  y=x;
  $  172.GNSS方向                          $    $          $    $  ANS024.BYTE010  $  y=x*2;
  $  173.GNSS状态                          $    $          $    $  ANS024.BYTE011  $  if(((x&0x70)>>4)==0) y=@0405;else if(((x&0x70)>>4)==1) y=@040a;else if(((x&0x70)>>4)==2) y=@040b;else y=@0103;
  $  174.实时卫星数量                      $    $          $    $  ANS024.BYTE011  $  y=(x&0x0F);
  $  175.SIM卡ICCID                        $    $          $    $  ANS025.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  176.信息呼叫回拨时间                  $    $  H       $    $  ANS026.BYTE004  $  y=x*0.1;
  $  177.IP地址1                           $    $          $    $  ANS027.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  178.IP地址2                           $    $          $    $  ANS028.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  179.防盗状态                          $    $          $    $  ANS029.BYTE004  $  if(x==0) y=@0408;else if(x==1) y=@0409;else y=@0103;
  $  180.防盗PIN码                         $    $          $    $  ANS030.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  181.采集数据间隔                      $    $  s       $    $  ANS031.BYTE004  $  y=x;
  $  182.采集数据数量                      $    $          $    $  ANS031.BYTE005  $  y=x;
  $  183.结束时间                          $    $  s       $    $  ANS031.BYTE006  $  y=x;
  $  184.蓝牙MAC地址                       $    $          $    $  ANS032.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  185.MPU软件版本                       $    $          $    $  ANS033.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  186.天线使用种类                      $    $          $    $  ANS034.BYTE004  $  if(((x&0xC0)>>6)==0) y=@033b;else if(((x&0xC0)>>6)==1) y=@03fe;else y=@0103;
  $  187.内置天线状态                      $    $          $    $  ANS034.BYTE004  $  if(((x&0x30)>>4)==0) y=@0339;else if(((x&0x30)>>4)==1) y=@0354;else y=@0103;
  $  188.副天线连接状态                    $    $          $    $  ANS034.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0339;else if(((x&0x0C)>>2)==1) y=@0354;else y=@0103;
  $  189.通讯主天线连接状态                $    $          $    $  ANS034.BYTE004  $  if((x&0x03)==0) y=@0339;else if((x&0x03)==1) y=@0354;else y=@0103;
  $  190.SIM卡IMEI                         $    $          $    $  ANS035.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  191.Modem硬件版本                     $    $          $    $  ANS036.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  192.Modem软件版本                     $    $          $    $  ANS037.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  193.移动国家代码                      $    $          $    $  ANS038.BYTE004  $  ASCII(X1,X2,X3);
  $  194.MNC                               $    $          $    $  ANS038.BYTE007  $  ASCII(X1,X2,X3);
  $  195.信号强度                          $    $          $    $  ANS039.BYTE004  $  y=(x1*256+x2)*0.1-150;
  $  196.使用SIM卡种类                     $    $          $    $  ANS039.BYTE006  $  if(((x&0x40)>>6)==0) y=@03fe;else if(((x&0x40)>>6)==1) y=@033b;else y=@0035;
  $  197.网络制式                          $    $          $    $  ANS039.BYTE006  $  if(((x&0x38)>>3)==0) y=@03e1;else if(((x&0x38)>>3)==1) y=@03e2;else if(((x&0x38)>>3)==2) y=@0400;else if(((x&0x38)>>3)==3) y=@03e4;else if(((x&0x38)>>3)==4) y=@03e5;else if(((x&0x38)>>3)==5) y=@03e6;else if(((x&0x38)>>3)==6) y=@03e7;else y=@0103;
  $  198.接收信号强度指示器                $    $          $    $  ANS039.BYTE006  $  y=(x&0x07);
  $  199.网络状态                          $    $          $    $  ANS039.BYTE007  $  if((x&0x07)==0) y=@0401;else if((x&0x07)==1) y=@0402;else if((x&0x07)==2) y=@0403;else if((x&0x07)==3) y=@03eb;else if((x&0x07)==4) y=@01e5;else if((x&0x07)==5) y=@03ec;else y=@0103;
  $  200.NAD调制解调器温度                 $    $          $    $  ANS040.BYTE004  $  y=x-127;
  $  201.分组数据协议连接成功次数          $    $          $    $  ANS041.BYTE004  $  y=(x1*256+x2);
  $  202.分组数据协议连接失败次数          $    $          $    $  ANS041.BYTE006  $  y=(x1*256+x2);
  $  203.分组数据协议断掉次数              $    $          $    $  ANS041.BYTE008  $  y=(x1*256+x2);
  $  204.识别无效的PIN时间                 $    $          $    $  ANS042.BYTE004  $  y=((x&0xF0)>>4);
  $  205.识别PIN锁定标志                   $    $          $    $  ANS042.BYTE004  $  if((x&0x01)==0) y=@0404;else if((x&0x01)==1) y=@0436;else y=@0035;
  $  206.PIN锁定时间剩余                   $    $  min     $    $  ANS042.BYTE005  $  y=(x1*256+x2);
  $  207.调制解调器唤醒                    $    $          $    $  ANS043.BYTE004  $  if(((x&0x04)>>2)==0) y=@040c;else if(((x&0x04)>>2)==1) y=@040d;else y=@0035;
  $  208.CAN2唤醒                          $    $          $    $  ANS043.BYTE004  $  if(((x&0x02)>>1)==0) y=@040c;else if(((x&0x02)>>1)==1) y=@040d;else y=@0035;
  $  209.CAN1唤醒                          $    $          $    $  ANS043.BYTE004  $  if((x&0x01)==0) y=@040c;else if((x&0x01)==1) y=@040d;else y=@0035;
  $  210.周期性唤醒                        $    $          $    $  ANS043.BYTE005  $  if((x&0x01)==0) y=@040c;else if((x&0x01)==1) y=@040d;else y=@0035;
  $  211.TBOX系统时间                      $    $  s       $    $  ANS044.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  212.TBOX通讯ID                        $    $          $    $  ANS045.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  213.使用ACC激活模式的时间(分钟)       $    $  min     $    $  ANS046.BYTE004  $  y=x;
  $  214.关闭模式所需时间(天)              $    $  d       $    $  ANS046.BYTE005  $  y=x;
  $  215.后台IP地址                        $    $          $    $  ANS047.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  216.后台IP端口                        $    $          $    $  ANS048.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6);
  $  217.短信服务号码                      $    $          $    $  ANS049.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  218.道路救援呼叫回拨时间              $    $  H       $    $  ANS050.BYTE004  $  y=x*0.1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:711 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
