
    车型ID：111e

    模拟：协议模拟-->111e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/1c000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 A0 00 00 00 00       $%  ANS000:7E9 03 22 F1 A0 00 00 00 00
  $%  REQ001:7E1 03 22 F1 83 00 00 00 00       $%  ANS001:7E9 03 22 F1 83 00 00 00 00
  $%  REQ002:7E1 03 22 F1 A1 00 00 00 00       $%  ANS002:7E9 03 22 F1 A1 00 00 00 00
  $%  REQ003:7E1 03 22 F1 91 00 00 00 00       $%  ANS003:7E9 03 22 F1 91 00 00 00 00
  $%  REQ004:7E1 03 22 F1 8B 00 00 00 00       $%  ANS004:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E1 03 22 F1 A2 00 00 00 00       $%  ANS005:7E9 03 22 F1 A2 00 00 00 00
  $%  REQ006:7E1 03 22 F1 87 00 00 00 00       $%  ANS006:7E9 03 22 F1 87 00 00 00 00
  $%  REQ007:7E1 03 22 F1 10 00 00 00 00       $%  ANS007:7E9 03 22 F1 10 00 00 00 00
  $%  REQ008:7E1 03 22 F1 92 00 00 00 00       $%  ANS008:7E9 03 22 F1 92 00 00 00 00
  $%  REQ009:7E1 03 22 F1 8C 00 00 00 00       $%  ANS009:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ010:7E1 03 22 F1 94 00 00 00 00       $%  ANS010:7E9 03 22 F1 94 00 00 00 00
  $%  REQ011:7E1 03 22 F1 8A 00 00 00 00       $%  ANS011:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ012:7E1 03 22 F1 90 00 00 00 00       $%  ANS012:7E9 03 22 F1 90 00 00 00 00
  $%  REQ013:7E1 03 22 F1 A8 00 00 00 00       $%  ANS013:7E9 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:年:                              $%    $%  ANS004.BYTE004  $%  HEX(X1);
  $%  005:月:                              $%    $%  ANS004.BYTE005  $%  HEX(X1);
  $%  006:日:                              $%    $%  ANS004.BYTE006  $%  HEX(X1);
  $%  007:电控单元网络参考号:              $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  009:电控单元零件号(上次):            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  010:测试工具参考号(上次):            $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  011:里程读数(上次):                  $%    $%  ANS007.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  012:供应商电控单元硬件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:供应商电控单元序列号:            $%    $%  ANS009.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  014:供应商电控单元软件参考号:        $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  015:系统供应商标识号:                $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  016:车辆识别代码:                    $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  017:车辆特征信息:                    $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流1
  $  00.数据流1
  $  REQ000:7E1 03 22 1C 97 00 00 00 00       $  ANS000:7E9 03 22 1C 97 00 00 00 00
  $  REQ001:7E1 03 22 1C 98 00 00 00 00       $  ANS001:7E9 03 22 1C 98 00 00 00 00
  $  REQ002:7E1 03 22 1C 99 00 00 00 00       $  ANS002:7E9 03 22 1C 99 00 00 00 00
  $  REQ003:7E1 03 22 1C 9A 00 00 00 00       $  ANS003:7E9 03 22 1C 9A 00 00 00 00
  $  REQ004:7E1 03 22 1C 9C 00 00 00 00       $  ANS004:7E9 03 22 1C 9C 00 00 00 00
  $  REQ005:7E1 03 22 1C 9D 00 00 00 00       $  ANS005:7E9 03 22 1C 9D 00 00 00 00
  $  REQ006:7E1 03 22 1E EE 00 00 00 00       $  ANS006:7E9 03 22 1E EE 00 00 00 00

  $  000.吻合点                               $    $         $    $  ANS000.BYTE004  $  y=(x1*256+x2);
  $  001.离合器关闭位置                       $    $         $    $  ANS000.BYTE006  $  y=(x1*256+x2);
  $  002.离合器磨损指数                       $    $         $    $  ANS000.BYTE008  $  y=(x1*256+x2);
  $  003.离合器在加热时间内                   $    $  s      $    $  ANS000.BYTE010  $  y=(x1*256+x2);
  $  004.掩码自学习                           $    $         $    $  ANS000.BYTE012  $  y=x;
  $  005.磨损指数计数器快速自我学习           $    $         $    $  ANS000.BYTE013  $  y=x;
  $  006.总换档计数器                         $    $         $    $  ANS001.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  007.泵开启计数器                         $    $         $    $  ANS001.BYTE008  $  HEX(X1,X2,X3,X4);
  $  008.泵错误计数器                         $    $         $    $  ANS001.BYTE012  $  y=x;
  $  009.压力误差计数器                       $    $         $    $  ANS001.BYTE013  $  y=x;
  $  010.解钩计数器                           $    $         $    $  ANS001.BYTE014  $  y=x;
  $  011.换档过程中离合器松开关闭计数器       $    $         $    $  ANS001.BYTE015  $  y=x;
  $  012.啮合失败计数器                       $    $         $    $  ANS001.BYTE016  $  y=x;
  $  013.换档失败计数器                       $    $         $    $  ANS001.BYTE017  $  y=x;
  $  014.排挡计数器                           $    $         $    $  ANS001.BYTE018  $  y=x;
  $  015.脱离故障计数器                       $    $         $    $  ANS001.BYTE019  $  y=x;
  $  016.离合器打开计数器故障                 $    $         $    $  ANS001.BYTE020  $  y=x;
  $  017.高泄漏计数器                         $    $         $    $  ANS001.BYTE021  $  y=x;
  $  018.接合计数器N                          $    $         $    $  ANS001.BYTE022  $  y=(x1*256+x2);
  $  019.接合计数器1                          $    $         $    $  ANS001.BYTE024  $  y=(x1*256+x2);
  $  020.接合计数器2                          $    $         $    $  ANS001.BYTE026  $  y=(x1*256+x2);
  $  021.接合计数器3                          $    $         $    $  ANS001.BYTE028  $  y=(x1*256+x2);
  $  022.接合计数器4                          $    $         $    $  ANS001.BYTE030  $  y=(x1*256+x2);
  $  023.接合计数器5                          $    $         $    $  ANS001.BYTE032  $  y=(x1*256+x2);
  $  024.接合计数器6                          $    $         $    $  ANS001.BYTE034  $  y=(x1*256+x2);
  $  025.接合计数器R                          $    $         $    $  ANS001.BYTE036  $  y=(x1*256+x2);
  $  026.N档的行驶距离                        $    $  km     $    $  ANS001.BYTE038  $  y=(x1*256+x2);
  $  027.1档的行驶距离                        $    $  km     $    $  ANS001.BYTE040  $  y=(x1*256+x2);
  $  028.2档的行驶距离                        $    $  km     $    $  ANS001.BYTE042  $  y=(x1*256+x2);
  $  029.3档的行驶距离                        $    $  km     $    $  ANS001.BYTE044  $  y=(x1*256+x2);
  $  030.4档的行驶距离                        $    $  km     $    $  ANS001.BYTE046  $  y=(x1*256+x2);
  $  031.5档的行驶距离                        $    $  km     $    $  ANS001.BYTE048  $  y=(x1*256+x2);
  $  032.C档的行驶距离                        $    $  km     $    $  ANS001.BYTE050  $  y=(x1*256+x2);
  $  033.R档的行驶距离                        $    $  km     $    $  ANS001.BYTE052  $  y=(x1*256+x2);
  $  034.泵加热时间                           $    $  s      $    $  ANS001.BYTE054  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  035.离合器超速计数器                     $    $         $    $  ANS001.BYTE058  $  y=x;
  $  036.挂错档计数器                         $    $         $    $  ANS001.BYTE059  $  y=x;
  $  037.离合器关闭计数器                     $    $         $    $  ANS001.BYTE060  $  y=x;
  $  038.N档重试计数器                        $    $         $    $  ANS001.BYTE061  $  y=x;
  $  039.1档重试计数器                        $    $         $    $  ANS001.BYTE062  $  y=x;
  $  040.2档重试计数器                        $    $         $    $  ANS001.BYTE063  $  y=x;
  $  041.3档重试计数器                        $    $         $    $  ANS001.BYTE064  $  y=x;
  $  042.4档重试计数器                        $    $         $    $  ANS001.BYTE065  $  y=x;
  $  043.5档重试计数器                        $    $         $    $  ANS001.BYTE066  $  y=x;
  $  044.C档重试计数器                        $    $         $    $  ANS001.BYTE067  $  y=x;
  $  045.R档重试计数器                        $    $         $    $  ANS001.BYTE068  $  y=x;
  $  046.N档换档挡块重试计数器                $    $         $    $  ANS001.BYTE069  $  y=x;
  $  047.1档换档挡块重试计数器                $    $         $    $  ANS001.BYTE070  $  y=x;
  $  048.2档换档挡块重试计数器                $    $         $    $  ANS001.BYTE071  $  y=x;
  $  049.3档换档挡块重试计数器                $    $         $    $  ANS001.BYTE072  $  y=x;
  $  050.4档换档挡块重试计数器                $    $         $    $  ANS001.BYTE073  $  y=x;
  $  051.5档换档挡块重试计数器                $    $         $    $  ANS001.BYTE074  $  y=x;
  $  052.C档换档挡块重试计数器                $    $         $    $  ANS001.BYTE075  $  y=x;
  $  053.R档换档挡块重试计数器                $    $         $    $  ANS001.BYTE076  $  y=x;
  $  054.N档换档失败重试计数器                $    $         $    $  ANS001.BYTE077  $  y=x;
  $  055.1档换档失败重试计数器                $    $         $    $  ANS001.BYTE078  $  y=x;
  $  056.2档换档失败重试计数器                $    $         $    $  ANS001.BYTE079  $  y=x;
  $  057.3档换档失败重试计数器                $    $         $    $  ANS001.BYTE080  $  y=x;
  $  058.4档换档失败重试计数器                $    $         $    $  ANS001.BYTE081  $  y=x;
  $  059.5档换档失败重试计数器                $    $         $    $  ANS001.BYTE082  $  y=x;
  $  060.C档换档失败重试计数器                $    $         $    $  ANS001.BYTE083  $  y=x;
  $  061.R档换档失败重试计数器                $    $         $    $  ANS001.BYTE084  $  y=x;
  $  062.泵过热计数器                         $    $         $    $  ANS001.BYTE085  $  y=x;
  $  063.系统误用对策                         $    $         $    $  ANS001.BYTE086  $  y=x;
  $  064.掩码自学习                           $    $         $    $  ANS001.BYTE087  $  y=x;
  $  065.网格自学习计数器成功执行             $    $         $    $  ANS001.BYTE088  $  y=x;
  $  066.总换档计数器                         $    $         $    $  ANS002.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  067.意外脱离计数器                       $    $         $    $  ANS002.BYTE008  $  y=x;
  $  068.啮合失败计数器                       $    $         $    $  ANS002.BYTE009  $  y=x;
  $  069.换档失败计数器                       $    $         $    $  ANS002.BYTE010  $  y=x;
  $  070.排挡计数器                           $    $         $    $  ANS002.BYTE011  $  y=x;
  $  071.脱离故障计数器                       $    $         $    $  ANS002.BYTE012  $  y=x;
  $  072.接合计数器N                          $    $         $    $  ANS002.BYTE013  $  y=(x1*256+x2);
  $  073.接合计数器1                          $    $         $    $  ANS002.BYTE015  $  y=(x1*256+x2);
  $  074.接合计数器2                          $    $         $    $  ANS002.BYTE017  $  y=(x1*256+x2);
  $  075.接合计数器3                          $    $         $    $  ANS002.BYTE019  $  y=(x1*256+x2);
  $  076.接合计数器4                          $    $         $    $  ANS002.BYTE021  $  y=(x1*256+x2);
  $  077.接合计数器5                          $    $         $    $  ANS002.BYTE023  $  y=(x1*256+x2);
  $  078.接合计数器6                          $    $         $    $  ANS002.BYTE025  $  y=(x1*256+x2);
  $  079.接合计数器R                          $    $         $    $  ANS002.BYTE027  $  y=(x1*256+x2);
  $  080.N档的行驶距离                        $    $  km     $    $  ANS002.BYTE029  $  y=(x1*256+x2);
  $  081.1档的行驶距离                        $    $  km     $    $  ANS002.BYTE031  $  y=(x1*256+x2);
  $  082.2档的行驶距离                        $    $  km     $    $  ANS002.BYTE032  $  y=(x1*256+x2);
  $  083.3档的行驶距离                        $    $  km     $    $  ANS002.BYTE035  $  y=(x1*256+x2);
  $  084.4档的行驶距离                        $    $  km     $    $  ANS002.BYTE037  $  y=(x1*256+x2);
  $  085.5档的行驶距离                        $    $  km     $    $  ANS002.BYTE039  $  y=(x1*256+x2);
  $  086.C档的行驶距离                        $    $  km     $    $  ANS002.BYTE041  $  y=(x1*256+x2);
  $  087.R档的行驶距离                        $    $  km     $    $  ANS002.BYTE043  $  y=(x1*256+x2);
  $  088.离合器超速计数器                     $    $         $    $  ANS002.BYTE045  $  y=x;
  $  089.挂错档计数器                         $    $         $    $  ANS002.BYTE046  $  y=x;
  $  090.N档重试计数器                        $    $         $    $  ANS002.BYTE047  $  y=x;
  $  091.1档重试计数器                        $    $         $    $  ANS002.BYTE048  $  y=x;
  $  092.2档重试计数器                        $    $         $    $  ANS002.BYTE049  $  y=x;
  $  093.3档重试计数器                        $    $         $    $  ANS002.BYTE050  $  y=x;
  $  094.4档重试计数器                        $    $         $    $  ANS002.BYTE051  $  y=x;
  $  095.5档重试计数器                        $    $         $    $  ANS002.BYTE052  $  y=x;
  $  096.C档重试计数器                        $    $         $    $  ANS002.BYTE053  $  y=x;
  $  097.R档重试计数器                        $    $         $    $  ANS002.BYTE054  $  y=x;
  $  098.N档换档挡块重试计数器                $    $         $    $  ANS002.BYTE055  $  y=x;
  $  099.1档换档挡块重试计数器                $    $         $    $  ANS002.BYTE056  $  y=x;
  $  100.2档换档挡块重试计数器                $    $         $    $  ANS002.BYTE057  $  y=x;
  $  101.3档换档挡块重试计数器                $    $         $    $  ANS002.BYTE058  $  y=x;
  $  102.4档换档挡块重试计数器                $    $         $    $  ANS002.BYTE059  $  y=x;
  $  103.5档换档挡块重试计数器                $    $         $    $  ANS002.BYTE060  $  y=x;
  $  104.C档换档挡块重试计数器                $    $         $    $  ANS002.BYTE061  $  y=x;
  $  105.R档换档挡块重试计数器                $    $         $    $  ANS002.BYTE062  $  y=x;
  $  106.N档换档失败重试计数器                $    $         $    $  ANS002.BYTE063  $  y=x;
  $  107.1档换档失败重试计数器                $    $         $    $  ANS002.BYTE064  $  y=x;
  $  108.2档换档失败重试计数器                $    $         $    $  ANS002.BYTE065  $  y=x;
  $  109.3档换档失败重试计数器                $    $         $    $  ANS002.BYTE066  $  y=x;
  $  110.4档换档失败重试计数器                $    $         $    $  ANS002.BYTE067  $  y=x;
  $  111.5档换档失败重试计数器                $    $         $    $  ANS002.BYTE068  $  y=x;
  $  112.C档换档失败重试计数器                $    $         $    $  ANS002.BYTE069  $  y=x;
  $  113.R档换档失败重试计数器                $    $         $    $  ANS002.BYTE070  $  y=x;
  $  114.掩码自学习                           $    $         $    $  ANS002.BYTE071  $  y=x;
  $  115.网格自学习计数器成功执行             $    $         $    $  ANS002.BYTE072  $  y=x;
  $  116.变速杆错误计数器                     $    $         $    $  ANS003.BYTE004  $  y=x;
  $  117.自动误差计数器*                      $    $         $    $  ANS003.BYTE005  $  y=x;
  $  118.ECO按钮错误计数器                    $    $         $    $  ANS003.BYTE006  $  y=x;
  $  119.泵开启计数器                         $    $         $    $  ANS004.BYTE004  $  HEX(X1,X2,X3,X4);
  $  120.泵故障计数器错误                     $    $         $    $  ANS004.BYTE008  $  y=x;
  $  121.压力低误差计数器                     $    $         $    $  ANS004.BYTE009  $  y=x;
  $  122.泵开启时间                           $    $  s      $    $  ANS004.BYTE010  $  HEX(X1,X2,X3,X4);
  $  123.泵过热计数器                         $    $         $    $  ANS004.BYTE014  $  y=x;
  $  124.系统误用对策                         $    $         $    $  ANS004.BYTE015  $  y=x;
  $  125.总换档计数器                         $    $         $    $  ANS005.BYTE004  $  HEX(X1,X2,X3,X4);
  $  126.泵开启计数器                         $    $         $    $  ANS005.BYTE008  $  HEX(X1,X2,X3,X4);
  $  127.接合计数器N                          $    $         $    $  ANS005.BYTE012  $  y=(x1*256+x2);
  $  128.接合计数器1                          $    $         $    $  ANS005.BYTE014  $  y=(x1*256+x2);
  $  129.接合计数器2                          $    $         $    $  ANS005.BYTE016  $  y=(x1*256+x2);
  $  130.接合计数器3                          $    $         $    $  ANS005.BYTE018  $  y=(x1*256+x2);
  $  131.接合计数器4                          $    $         $    $  ANS005.BYTE020  $  y=(x1*256+x2);
  $  132.接合计数器5                          $    $         $    $  ANS005.BYTE022  $  y=(x1*256+x2);
  $  133.接合C计数器                          $    $         $    $  ANS005.BYTE024  $  y=(x1*256+x2);
  $  134.接合计数器R                          $    $         $    $  ANS005.BYTE026  $  y=(x1*256+x2);
  $  135.N档的行驶距离                        $    $  km     $    $  ANS005.BYTE028  $  y=(x1*256+x2);
  $  136.1档的行驶距离                        $    $  km     $    $  ANS005.BYTE030  $  y=(x1*256+x2);
  $  137.2档的行驶距离                        $    $  km     $    $  ANS005.BYTE032  $  y=(x1*256+x2);
  $  138.3档的行驶距离                        $    $  km     $    $  ANS005.BYTE034  $  y=(x1*256+x2);
  $  139.4档的行驶距离                        $    $  km     $    $  ANS005.BYTE036  $  y=(x1*256+x2);
  $  140.5档的行驶距离                        $    $  km     $    $  ANS005.BYTE038  $  y=(x1*256+x2);
  $  141.C档的行驶距离                        $    $  km     $    $  ANS005.BYTE040  $  y=(x1*256+x2);
  $  142.R档的行驶距离                        $    $  km     $    $  ANS005.BYTE042  $  y=(x1*256+x2);
  $  143.开机总时间                           $    $  s      $    $  ANS005.BYTE044  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  144.TCU开启总时间                        $    $  s      $    $  ANS005.BYTE048  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  145.成功的变速箱自学习计数器             $    $         $    $  ANS005.BYTE052  $  y=x;
  $  146.总换档计数器                         $    $         $    $  ANS006.BYTE004  $  HEX(X1,X2,X3,X4);
  $  147.泵开启计数器                         $    $         $    $  ANS006.BYTE008  $  HEX(X1,X2,X3,X4);
  $  148.离合器在加热时间内                   $    $  s      $    $  ANS006.BYTE012  $  y=(x1*256+x2);
  $  149.泵故障计数器错误                     $    $         $    $  ANS006.BYTE014  $  y=x;
  $  150.压力低误差计数器                     $    $         $    $  ANS006.BYTE015  $  y=x;
  $  151.不需要的脱离计数器                   $    $         $    $  ANS006.BYTE016  $  y=x;
  $  152.换档时离合器关闭计数器               $    $         $    $  ANS006.BYTE017  $  y=x;
  $  153.啮合失败计数器                       $    $         $    $  ANS006.BYTE018  $  y=x;
  $  154.换档失败计数器                       $    $         $    $  ANS006.BYTE019  $  y=x;
  $  155.换档锁计数器                         $    $         $    $  ANS006.BYTE020  $  y=x;
  $  156.脱离故障计数器                       $    $         $    $  ANS006.BYTE021  $  y=x;
  $  157.离合器打开故障计数器                 $    $         $    $  ANS006.BYTE022  $  y=x;
  $  158.高泄漏计数器                         $    $         $    $  ANS006.BYTE023  $  y=x;
  $  159.每个档位的接合计数器                 $    $         $    $  ANS006.BYTE024  $  y=UINT64(x9,x10,x11,x12,x13,x14,x15,x16);
  $  160.各档传动距离                         $    $  km     $    $  ANS006.BYTE040  $  y=UINT64(x9,x10,x11,x12,x13,x14,x15,x16);
  $  161.总泵开启时间                         $    $         $    $  ANS006.BYTE056  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  162.离合器超速计数器                     $    $         $    $  ANS006.BYTE060  $  y=x;
  $  163.挂错档计数器                         $    $         $    $  ANS006.BYTE061  $  y=x;
  $  164.换档前离合器计数器打开               $    $         $    $  ANS006.BYTE062  $  y=x;
  $  165.每个档位的齿轮接合计数器重试         $    $         $    $  ANS006.BYTE063  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  166.每个档位的换档锁定重试计数器         $    $         $    $  ANS006.BYTE071  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  167.每个档位的换档失败计数器重试         $    $         $    $  ANS006.BYTE079  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  168.杠杆通道开关计数器常闭错误           $    $         $    $  ANS006.BYTE087  $  y=x;
  $  169.自动按钮计数器                       $    $         $    $  ANS006.BYTE088  $  y=x;
  $  170.泵超温计数器                         $    $         $    $  ANS006.BYTE089  $  y=x;
  $  171.系统误用对策                         $    $         $    $  ANS006.BYTE090  $  y=x;
  $  172.低电量计数器                         $    $         $    $  ANS006.BYTE091  $  y=x;
  $  173.泵继电器计数器卡滞错误               $    $         $    $  ANS006.BYTE092  $  y=x;
  $  174.ECO开关错误计数器                    $    $         $    $  ANS006.BYTE093  $  y=x;

  $)  01.数据流2
  $  01.数据流2
  $  REQ000:7E1 03 22 1C A5 00 00 00 00       $  ANS000:7E9 03 22 1C A5 00 00 00 00
  $  REQ001:7E1 03 22 1C 93 00 00 00 00       $  ANS001:7E9 03 22 1C 93 00 00 00 00
  $  REQ002:7E1 03 22 01 12 00 00 00 00       $  ANS002:7E9 03 22 01 12 00 00 00 00
  $  REQ003:7E1 03 22 1C 43 00 00 00 00       $  ANS003:7E9 03 22 1C 43 00 00 00 00
  $  REQ004:7E1 03 22 1C 50 00 00 00 00       $  ANS004:7E9 03 22 1C 50 00 00 00 00
  $  REQ005:7E1 03 22 1C 42 00 00 00 00       $  ANS005:7E9 03 22 1C 42 00 00 00 00
  $  REQ006:7E1 03 22 1C 5D 00 00 00 00       $  ANS006:7E9 03 22 1C 5D 00 00 00 00
  $  REQ007:7E1 03 22 1C 0B 00 00 00 00       $  ANS007:7E9 03 22 1C 0B 00 00 00 00
  $  REQ008:7E1 03 22 1C 60 00 00 00 00       $  ANS008:7E9 03 22 1C 60 00 00 00 00
  $  REQ009:7E1 03 22 1C 5F 00 00 00 00       $  ANS009:7E9 03 22 1C 5F 00 00 00 00
  $  REQ010:7E1 03 22 1C A1 00 00 00 00       $  ANS010:7E9 03 22 1C A1 00 00 00 00
  $  REQ011:7E1 03 22 1C 1C 00 00 00 00       $  ANS011:7E9 03 22 1C 1C 00 00 00 00
  $  REQ012:7E1 03 22 1C 1B 00 00 00 00       $  ANS012:7E9 03 22 1C 1B 00 00 00 00
  $  REQ013:7E1 03 22 1C 1D 00 00 00 00       $  ANS013:7E9 03 22 1C 1D 00 00 00 00
  $  REQ014:7E1 03 22 1C 18 00 00 00 00       $  ANS014:7E9 03 22 1C 18 00 00 00 00
  $  REQ015:7E1 03 22 1C 01 00 00 00 00       $  ANS015:7E9 03 22 1C 01 00 00 00 00
  $  REQ016:7E1 03 22 1C 0A 00 00 00 00       $  ANS016:7E9 03 22 1C 0A 00 00 00 00
  $  REQ017:7E1 03 22 1C A0 00 00 00 00       $  ANS017:7E9 03 22 1C A0 00 00 00 00
  $  REQ018:7E1 03 22 1C 13 00 00 00 00       $  ANS018:7E9 03 22 1C 13 00 00 00 00
  $  REQ019:7E1 03 22 1C 16 00 00 00 00       $  ANS019:7E9 03 22 1C 16 00 00 00 00
  $  REQ020:7E1 03 22 1C 62 00 00 00 00       $  ANS020:7E9 03 22 1C 62 00 00 00 00
  $  REQ021:7E1 03 22 1C A3 00 00 00 00       $  ANS021:7E9 03 22 1C A3 00 00 00 00
  $  REQ022:7E1 03 22 1C 51 00 00 00 00       $  ANS022:7E9 03 22 1C 51 00 00 00 00
  $  REQ023:7E1 03 22 D0 01 00 00 00 00       $  ANS023:7E9 03 22 D0 01 00 00 00 00
  $  REQ024:7E1 03 22 1C 12 00 00 00 00       $  ANS024:7E9 03 22 1C 12 00 00 00 00
  $  REQ025:7E1 03 22 E1 01 00 00 00 00       $  ANS025:7E9 03 22 E1 01 00 00 00 00
  $  REQ026:7E1 03 22 1C 14 00 00 00 00       $  ANS026:7E9 03 22 1C 14 00 00 00 00
  $  REQ027:7E1 03 22 1C 15 00 00 00 00       $  ANS027:7E9 03 22 1C 15 00 00 00 00
  $  REQ028:7E1 03 22 AF FC 00 00 00 00       $  ANS028:7E9 03 22 AF FC 00 00 00 00
  $  REQ029:7E1 03 22 1C 58 00 00 00 00       $  ANS029:7E9 03 22 1C 58 00 00 00 00
  $  REQ030:7E1 03 22 1C 59 00 00 00 00       $  ANS030:7E9 03 22 1C 59 00 00 00 00
  $  REQ031:7E1 03 22 F1 F2 00 00 00 00       $  ANS031:7E9 03 22 F1 F2 00 00 00 00
  $  REQ032:7E1 03 22 1C 02 00 00 00 00       $  ANS032:7E9 03 22 1C 02 00 00 00 00
  $  REQ033:7E1 03 22 1C 1E 00 00 00 00       $  ANS033:7E9 03 22 1C 1E 00 00 00 00
  $  REQ034:7E1 03 22 1C 1F 00 00 00 00       $  ANS034:7E9 03 22 1C 1F 00 00 00 00
  $  REQ035:7E1 03 22 1C 1A 00 00 00 00       $  ANS035:7E9 03 22 1C 1A 00 00 00 00
  $  REQ036:7E1 03 22 1C A4 00 00 00 00       $  ANS036:7E9 03 22 1C A4 00 00 00 00
  $  REQ037:7E1 03 22 AF FE 00 00 00 00       $  ANS037:7E9 03 22 AF FE 00 00 00 00
  $  REQ038:7E1 03 22 AF FD 00 00 00 00       $  ANS038:7E9 03 22 AF FD 00 00 00 00
  $  REQ039:7E1 03 22 AF FF 00 00 00 00       $  ANS039:7E9 03 22 AF FF 00 00 00 00
  $  REQ040:7E1 03 22 1C 52 00 00 00 00       $  ANS040:7E9 03 22 1C 52 00 00 00 00
  $  REQ041:7E1 03 22 1C 17 00 00 00 00       $  ANS041:7E9 03 22 1C 17 00 00 00 00
  $  REQ042:7E1 03 22 1C 5A 00 00 00 00       $  ANS042:7E9 03 22 1C 5A 00 00 00 00
  $  REQ043:7E1 03 22 1C 77 00 00 00 00       $  ANS043:7E9 03 22 1C 77 00 00 00 00
  $  REQ044:7E1 03 22 1C 0C 00 00 00 00       $  ANS044:7E9 03 22 1C 0C 00 00 00 00
  $  REQ045:7E1 03 22 1C 05 00 00 00 00       $  ANS045:7E9 03 22 1C 05 00 00 00 00
  $  REQ046:7E1 03 22 1C 41 00 00 00 00       $  ANS046:7E9 03 22 1C 41 00 00 00 00
  $  REQ047:7E1 03 22 1C 0E 00 00 00 00       $  ANS047:7E9 03 22 1C 0E 00 00 00 00
  $  REQ048:7E1 03 22 1C 0D 00 00 00 00       $  ANS048:7E9 03 22 1C 0D 00 00 00 00
  $  REQ049:7E1 03 22 1C 0F 00 00 00 00       $  ANS049:7E9 03 22 1C 0F 00 00 00 00
  $  REQ050:7E1 03 22 1C B1 00 00 00 00       $  ANS050:7E9 03 22 1C B1 00 00 00 00
  $  REQ051:7E1 03 22 1C 10 00 00 00 00       $  ANS051:7E9 03 22 1C 10 00 00 00 00
  $  REQ052:7E1 03 22 1C 03 00 00 00 00       $  ANS052:7E9 03 22 1C 03 00 00 00 00
  $  REQ053:7E1 03 22 1C 04 00 00 00 00       $  ANS053:7E9 03 22 1C 04 00 00 00 00
  $  REQ054:7E1 03 22 1C 5B 00 00 00 00       $  ANS054:7E9 03 22 1C 5B 00 00 00 00
  $  REQ055:7E1 03 22 1C 47 00 00 00 00       $  ANS055:7E9 03 22 1C 47 00 00 00 00
  $  REQ056:7E1 03 22 01 0C 00 00 00 00       $  ANS056:7E9 03 22 01 0C 00 00 00 00
  $  REQ057:7E1 03 22 1C 78 00 00 00 00       $  ANS057:7E9 03 22 1C 78 00 00 00 00
  $  REQ058:7E1 03 22 1C 44 00 00 00 00       $  ANS058:7E9 03 22 1C 44 00 00 00 00
  $  REQ059:7E1 03 22 1C 61 00 00 00 00       $  ANS059:7E9 03 22 1C 61 00 00 00 00
  $  REQ060:7E1 03 22 1C 8A 00 00 00 00       $  ANS060:7E9 03 22 1C 8A 00 00 00 00
  $  REQ061:7E1 03 22 1C 95 00 00 00 00       $  ANS061:7E9 03 22 1C 95 00 00 00 00
  $  REQ062:7E1 03 22 1C 06 00 00 00 00       $  ANS062:7E9 03 22 1C 06 00 00 00 00
  $  REQ063:7E1 03 22 1C 65 00 00 00 00       $  ANS063:7E9 03 22 1C 65 00 00 00 00
  $  REQ064:7E1 03 22 1C 64 00 00 00 00       $  ANS064:7E9 03 22 1C 64 00 00 00 00
  $  REQ065:7E1 03 22 1C 92 00 00 00 00       $  ANS065:7E9 03 22 1C 92 00 00 00 00
  $  REQ066:7E1 03 22 1C 8E 00 00 00 00       $  ANS066:7E9 03 22 1C 8E 00 00 00 00
  $  REQ067:7E1 03 22 1C 91 00 00 00 00       $  ANS067:7E9 03 22 1C 91 00 00 00 00
  $  REQ068:7E1 03 22 1C 94 00 00 00 00       $  ANS068:7E9 03 22 1C 94 00 00 00 00
  $  REQ069:7E1 03 22 1C 8F 00 00 00 00       $  ANS069:7E9 03 22 1C 8F 00 00 00 00
  $  REQ070:7E1 03 22 1C 90 00 00 00 00       $  ANS070:7E9 03 22 1C 90 00 00 00 00
  $  REQ071:7E1 03 22 1C 8D 00 00 00 00       $  ANS071:7E9 03 22 1C 8D 00 00 00 00
  $  REQ072:7E1 03 22 1C 79 00 00 00 00       $  ANS072:7E9 03 22 1C 79 00 00 00 00
  $  REQ073:7E1 03 22 1C 80 00 00 00 00       $  ANS073:7E9 03 22 1C 80 00 00 00 00
  $  REQ074:7E1 03 22 1C 8C 00 00 00 00       $  ANS074:7E9 03 22 1C 8C 00 00 00 00
  $  REQ075:7E1 03 22 1C 11 00 00 00 00       $  ANS075:7E9 03 22 1C 11 00 00 00 00
  $  REQ076:7E1 03 22 1C 5E 00 00 00 00       $  ANS076:7E9 03 22 1C 5E 00 00 00 00

  $  000.加速度计偏移量调整状态                 $    $           $    $  ANS000.BYTE004  $  if(x==0) y=@0281;else if(x==1) y=@0282;else y=@0035;
  $  001.电网影响                               $    $           $    $  ANS001.BYTE004  $  if(((x&0x80)>>7)==0) y=@0264;else if(((x&0x80)>>7)==1) y=@0265;else y=@0035;
  $  002.EV零点偏移完成                         $    $           $    $  ANS001.BYTE004  $  if(((x&0x20)>>5)==0) y=@0264;else if(((x&0x20)>>5)==1) y=@0265;else y=@0035;
  $  003.离合器零流量完成                       $    $           $    $  ANS001.BYTE004  $  if(((x&0x10)>>4)==0) y=@0264;else if(((x&0x10)>>4)==1) y=@0265;else y=@0035;
  $  004.磨损指数学习完成                       $    $           $    $  ANS001.BYTE004  $  if(((x&0x02)>>1)==0) y=@0264;else if(((x&0x02)>>1)==1) y=@0265;else y=@0035;
  $  005.吻合学习结束                           $    $           $    $  ANS001.BYTE004  $  if((x&0x01)==0) y=@0264;else if((x&0x01)==1) y=@0265;else y=@0035;
  $  006.电池电压                               $    $  V        $    $  ANS002.BYTE004  $  y=x*0.1;
  $  007.闭心电流电动汽车离合器自动设定         $    $  mA       $    $  ANS003.BYTE004  $  y=x;
  $  008.离合器错误打开计数器                   $    $           $    $  ANS004.BYTE004  $  y=x;
  $  009.离合器吻合点自动设置                   $    $  mm       $    $  ANS005.BYTE004  $  y=(x1*256+x2);
  $  010.离合器超速计数器                       $    $           $    $  ANS006.BYTE004  $  y=x;
  $  011.离合器转速                             $    $  rpm      $    $  ANS007.BYTE004  $  y=(x1*256+x2);
  $  012.换档时离合器不需要关闭计数器           $    $           $    $  ANS008.BYTE004  $  y=x;
  $  013.捡拾过程中离合器不需要关闭计数器       $    $           $    $  ANS009.BYTE004  $  y=x;
  $  014.当前故障                               $    $           $    $  ANS010.BYTE004  $  if(x16==0) y=@0197;else if(x16==1) y=@0266;else y=@0035;
  $  015.空档长跑                               $    $           $    $  ANS011.BYTE004  $  y=(x1*256+x2);
  $  016.1档长跑                                $    $           $    $  ANS011.BYTE006  $  y=(x1*256+x2);
  $  017.2档长跑                                $    $           $    $  ANS011.BYTE008  $  y=(x1*256+x2);
  $  018.3档长跑                                $    $           $    $  ANS011.BYTE010  $  y=(x1*256+x2);
  $  019.4档长跑                                $    $           $    $  ANS011.BYTE012  $  y=(x1*256+x2);
  $  020.5档长跑                                $    $           $    $  ANS011.BYTE014  $  y=(x1*256+x2);
  $  021.C档长跑                                $    $           $    $  ANS011.BYTE016  $  y=(x1*256+x2);
  $  022.R档长跑                                $    $           $    $  ANS011.BYTE018  $  y=(x1*256+x2);
  $  023.挂空档计数器                           $    $           $    $  ANS012.BYTE004  $  y=(x1*256+x2);
  $  024.接合1档的计数器                        $    $           $    $  ANS012.BYTE006  $  y=(x1*256+x2);
  $  025.接合2档的计数器                        $    $           $    $  ANS012.BYTE008  $  y=(x1*256+x2);
  $  026.接合3档的计数器                        $    $           $    $  ANS012.BYTE010  $  y=(x1*256+x2);
  $  027.接合4档的计数器                        $    $           $    $  ANS012.BYTE012  $  y=(x1*256+x2);
  $  028.接合5档的计数器                        $    $           $    $  ANS012.BYTE014  $  y=(x1*256+x2);
  $  029.接合C档的计数器                        $    $           $    $  ANS012.BYTE016  $  y=(x1*256+x2);
  $  030.接合R档的计数器                        $    $           $    $  ANS012.BYTE018  $  y=(x1*256+x2);
  $  031.挂空档重试计数器                       $    $           $    $  ANS013.BYTE004  $  y=x;
  $  032.接合1档的重试计数器                    $    $           $    $  ANS013.BYTE005  $  y=x;
  $  033.接合2档的重试计数器                    $    $           $    $  ANS013.BYTE006  $  y=x;
  $  034.接合3档的重试计数器                    $    $           $    $  ANS013.BYTE007  $  y=x;
  $  035.接合4档的重试计数器                    $    $           $    $  ANS013.BYTE008  $  y=x;
  $  036.接合5档的重试计数器                    $    $           $    $  ANS013.BYTE009  $  y=x;
  $  037.接合齿轮C的重试计数器                  $    $           $    $  ANS013.BYTE010  $  y=x;
  $  038.接合R档的重试计数器                    $    $           $    $  ANS013.BYTE011  $  y=x;
  $  039.N档阀接通阈值                          $    $           $    $  ANS014.BYTE004  $  y=(x1*256+x2);
  $  040.1档阀接通阈值                          $    $           $    $  ANS014.BYTE006  $  y=(x1*256+x2);
  $  041.2档阀接通阈值                          $    $           $    $  ANS014.BYTE008  $  y=(x1*256+x2);
  $  042.3档阀接通阈值                          $    $           $    $  ANS014.BYTE010  $  y=(x1*256+x2);
  $  043.4档阀接通阈值                          $    $           $    $  ANS014.BYTE012  $  y=(x1*256+x2);
  $  044.5档阀接通阈值                          $    $           $    $  ANS014.BYTE014  $  y=(x1*256+x2);
  $  045.C档气门接通阈值                        $    $           $    $  ANS014.BYTE016  $  y=(x1*256+x2);
  $  046.R档气门接通阈值                        $    $           $    $  ANS014.BYTE018  $  y=(x1*256+x2);
  $  047.接合拨叉位置                           $    $  mm       $    $  ANS015.BYTE004  $  y=(x1*256+x2);
  $  048.发动机转速                             $    $  rpm      $    $  ANS016.BYTE004  $  y=(x1*256+x2);
  $  049.换档模式                               $    $           $    $  ANS017.BYTE004  $  if(x16==0) y=@0255;else if(x16==1) y=@0253;else if(x16==4) y=@0267;else if(x16==5) y=@0136;else y=@0198;
  $  050.齿轮啮合                               $    $           $    $  ANS018.BYTE004  $  if(x==0) y=@0268;else if(x==1) y=@0269;else if(x==2) y=@026a;else if(x==3) y=@026b;else if(x==4) y=@026c;else if(x==5) y=@026d;else if(x==6) y=@026e;else if(x==7) y=@0002;else y=@0035;
  $  051.请求的档位                             $    $           $    $  ANS019.BYTE004  $  if(x==0) y=@0268;else if(x==1) y=@0269;else if(x==2) y=@026a;else if(x==3) y=@026b;else if(x==4) y=@026c;else if(x==5) y=@026d;else if(x==6) y=@026e;else if(x==7) y=@0002;else y=@0035;
  $  052.齿轮箱下线自整定错误代码               $    $           $    $  ANS020.BYTE004  $  if(x==0x00) y=@026f;else if(x==0x01) y=@0270;else if(x==0x02) y=@0271;else if(x==0x03) y=@0272;else if(x==0x04) y=@0273;else if(x==0x05) y=@0274;else if(x==0x06) y=@0275;else if(x==0x07) y=@0276;else if(x==0x08) y=@0277;else if(x==0x09) y=@0278;else if(x==0x0A) y=@0279;else if(x==0x0B) y=@027a;else if(x==0x0C) y=@027b;else if(x==0x0D) y=@027c;else if(x==0x0E) y=@027d;else if(x==0x0F) y=@027e;else y=@0198;
  $  053.通用故障                               $    $           $    $  ANS021.BYTE004  $  if(x==0) y=@027f;else if(x==1) y=@0280;else y=@0035;
  $  054.电网合理性正常                         $    $           $    $  ANS022.BYTE004  $  if((x&0x01)==0) y=@0264;else if((x&0x01)==1) y=@0265;else y=@0035;
  $  055.全局KL.50状态                          $    $           $    $  ANS023.BYTE004  $  if(((x&0x80)>>7)==0) y=@0264;else if(((x&0x80)>>7)==1) y=@0265;else y=@0035;
  $  056.全局发动机运行状态                     $    $           $    $  ANS023.BYTE004  $  if(((x&0x40)>>6)==0) y=@0264;else if(((x&0x40)>>6)==1) y=@0265;else y=@0035;
  $  057.全局KL15状态                           $    $           $    $  ANS023.BYTE004  $  if(((x&0x20)>>5)==0) y=@0264;else if(((x&0x20)>>5)==1) y=@0265;else y=@0035;
  $  058.全局KL.R状态                           $    $           $    $  ANS023.BYTE004  $  if(((x&0x10)>>4)==0) y=@0264;else if(((x&0x10)>>4)==1) y=@0265;else y=@0035;
  $  059.系统KL.50状态                          $    $           $    $  ANS023.BYTE004  $  if(((x&0x08)>>3)==0) y=@0264;else if(((x&0x08)>>3)==1) y=@0265;else y=@0035;
  $  060.系统发动机运行状态                     $    $           $    $  ANS023.BYTE004  $  if(((x&0x04)>>2)==0) y=@0264;else if(((x&0x04)>>2)==1) y=@0265;else y=@0035;
  $  061.系统KL.15状态                          $    $           $    $  ANS023.BYTE004  $  if(((x&0x02)>>1)==0) y=@0264;else if(((x&0x02)>>1)==1) y=@0265;else y=@0035;
  $  062.系统KL.R状态                           $    $           $    $  ANS023.BYTE004  $  if((x&0x01)==0) y=@0264;else if((x&0x01)==1) y=@0265;else y=@0035;
  $  063.操纵杆位置                             $    $           $    $  ANS024.BYTE004  $  if(x==243) y=@0283;else if(x==249) y=@0284;else if(x==250) y=@0285;else if(x==251) y=@0286;else if(x==252) y=@0287;else if(x==255) y=@0288;else y=@0198;
  $  064.里程表读数                             $    $  km       $    $  ANS025.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  065.模式开关                               $    $           $    $  ANS026.BYTE004  $  if(((x&0x20)>>5)==0) y=@0264;else if(((x&0x20)>>5)==1) y=@0265;else y=@0035;
  $  066.驾驶员车门打开                         $    $           $    $  ANS026.BYTE004  $  if(((x&0x08)>>3)==0) y=@0264;else if(((x&0x08)>>3)==1) y=@0265;else y=@0035;
  $  067.由CAN制动                              $    $           $    $  ANS026.BYTE004  $  if(((x&0x04)>>2)==0) y=@0264;else if(((x&0x04)>>2)==1) y=@0265;else y=@0035;
  $  068.K15                                    $    $           $    $  ANS026.BYTE004  $  if(((x&0x02)>>1)==0) y=@0264;else if(((x&0x02)>>1)==1) y=@0265;else y=@0035;
  $  069.K50                                    $    $           $    $  ANS026.BYTE004  $  if((x&0x01)==0) y=@0264;else if((x&0x01)==1) y=@0265;else y=@0035;
  $  070.曲柄继电器                             $    $           $    $  ANS027.BYTE004  $  if(((x&0x20)>>5)==0) y=@0264;else if(((x&0x20)>>5)==1) y=@0265;else y=@0035;
  $  071.泵继电器                               $    $           $    $  ANS027.BYTE004  $  if(((x&0x04)>>2)==0) y=@0264;else if(((x&0x04)>>2)==1) y=@0265;else y=@0035;
  $  072.编程计数                               $    $           $    $  ANS028.BYTE004  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  073.泵上计数器                             $    $           $    $  ANS029.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  074.泵接通时间                             $    $  min      $    $  ANS030.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  075.SMP软件版本                            $    $           $    $  ANS031.BYTE004  $  y=(x1*256+x2);
  $  076.选择栏位置                             $    $  mm       $    $  ANS032.BYTE004  $  y=(x1*256+x2);
  $  077.选择错误重试计数器在空档               $    $           $    $  ANS033.BYTE004  $  y=x;
  $  078.选择错误重试计数器在1档                $    $           $    $  ANS033.BYTE005  $  y=x;
  $  079.选择错误重试计数器在2档                $    $           $    $  ANS033.BYTE006  $  y=x;
  $  080.选择错误重试计数器在3档                $    $           $    $  ANS033.BYTE007  $  y=x;
  $  081.选择错误重试计数器在4档                $    $           $    $  ANS033.BYTE008  $  y=x;
  $  082.选择错误重试计数器在5档                $    $           $    $  ANS033.BYTE009  $  y=x;
  $  083.选择错误重试计数器在C档                $    $           $    $  ANS033.BYTE010  $  y=x;
  $  084.选择错误重试计数器在R档                $    $           $    $  ANS033.BYTE011  $  y=x;
  $  085.选择锁定重试计数器在空档               $    $           $    $  ANS034.BYTE004  $  y=x;
  $  086.选择锁定重试计数器在1档                $    $           $    $  ANS034.BYTE005  $  y=x;
  $  087.选择锁定重试计数器在2档                $    $           $    $  ANS034.BYTE006  $  y=x;
  $  088.选择锁定重试计数器在3档                $    $           $    $  ANS034.BYTE007  $  y=x;
  $  089.选择锁定重试计数器在4档                $    $           $    $  ANS034.BYTE008  $  y=x;
  $  090.选择锁定重试计数器在5档                $    $           $    $  ANS034.BYTE009  $  y=x;
  $  091.选择锁定重试计数器在C档                $    $           $    $  ANS034.BYTE010  $  y=x;
  $  092.选择锁定重试计数器在R档                $    $           $    $  ANS034.BYTE011  $  y=x;
  $  093.N档选挡位置区间                        $    $           $    $  ANS035.BYTE004  $  y=(x1*256+x2);
  $  094.1档选挡位置区间                        $    $           $    $  ANS035.BYTE006  $  y=(x1*256+x2);
  $  095.2档选挡位置区间                        $    $           $    $  ANS035.BYTE008  $  y=(x1*256+x2);
  $  096.3档选挡位置区间                        $    $           $    $  ANS035.BYTE010  $  y=(x1*256+x2);
  $  097.4档选挡位置区间                        $    $           $    $  ANS035.BYTE012  $  y=(x1*256+x2);
  $  098.5档选挡位置区间                        $    $           $    $  ANS035.BYTE014  $  y=(x1*256+x2);
  $  099.6档选挡位置区间                        $    $           $    $  ANS035.BYTE016  $  y=(x1*256+x2);
  $  100.R档选挡位置区间                        $    $           $    $  ANS035.BYTE018  $  y=(x1*256+x2);
  $  101.服务指示                               $    $           $    $  ANS036.BYTE004  $  if(x==0) y=@0289;else if(x==1) y=@028a;else y=@0035;
  $  102.软件兼容性状态                         $    $           $    $  ANS037.BYTE004  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  103.软件整合状态                           $    $           $    $  ANS038.BYTE004  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  104.软件有效性标志位                       $    $           $    $  ANS039.BYTE004  $  y=x;
  $  105.成功网格调整计数器                     $    $           $    $  ANS040.BYTE004  $  y=x;
  $  106.N档确定啮合阈值                        $    $           $    $  ANS041.BYTE004  $  y=(x1*256+x2);
  $  107.档位1的确定接合阈值                    $    $           $    $  ANS041.BYTE006  $  y=(x1*256+x2);
  $  108.档位2的确定接合阈值                    $    $           $    $  ANS041.BYTE008  $  y=(x1*256+x2);
  $  109.档位3的确定接合阈值                    $    $           $    $  ANS041.BYTE010  $  y=(x1*256+x2);
  $  110.档位4的确定接合阈值                    $    $           $    $  ANS041.BYTE012  $  y=(x1*256+x2);
  $  111.档位5的确定接合阈值                    $    $           $    $  ANS041.BYTE014  $  y=(x1*256+x2);
  $  112.C档确定接合阈值                        $    $           $    $  ANS041.BYTE016  $  y=(x1*256+x2);
  $  113.R档确定啮合阈值                        $    $           $    $  ANS041.BYTE018  $  y=(x1*256+x2);
  $  114.系统准时                               $    $  min      $    $  ANS042.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  115.总齿轮安装计数器                       $    $           $    $  ANS043.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  116.车速                                   $    $  km/h     $    $  ANS044.BYTE004  $  y=x-40;
  $  117.油门踏板位置                           $    $  %        $    $  ANS045.BYTE004  $  y=x;
  $  118.自动设置关闭离合器位置                 $    $  mm       $    $  ANS046.BYTE004  $  y=(x1*256+x2);
  $  119.电路驱动EV均流                         $    $  mA       $    $  ANS047.BYTE004  $  y=x;
  $  120.电路驱动EV奇数电流                     $    $  mA       $    $  ANS048.BYTE004  $  y=x;
  $  121.电路驱动EV离合器电流                   $    $  mA       $    $  ANS049.BYTE004  $  y=x;
  $  122.电路驱动电动汽车换档电流               $    $  mA       $    $  ANS050.BYTE004  $  y=x;
  $  123.发动机提供的净扭矩                     $    $  Nm       $    $  ANS051.BYTE004  $  y=(x1*256+x2)-32768;
  $  124.离合器执行器位置                       $    $  mm       $    $  ANS052.BYTE004  $  y=(x1*256+x2);
  $  125.离合器执行器位置参考                   $    $  mm       $    $  ANS053.BYTE004  $  y=(x1*256+x2);
  $  126.离合器在加热时间内                     $    $  s        $    $  ANS054.BYTE004  $  y=(x1*256+x2);
  $  127.离合器磨损指数                         $    $           $    $  ANS055.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000));
  $  128.发动机水温                             $    $           $    $  ANS056.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  129.错误啮合计数器                         $    $           $    $  ANS057.BYTE004  $  y=x;
  $  130.油温估计                               $    $           $    $  ANS058.BYTE004  $  y=x;
  $  131.失败的脱离计数器                       $    $           $    $  ANS059.BYTE004  $  y=x;
  $  132.换档杆卡住计数器                       $    $           $    $  ANS060.BYTE004  $  y=x;
  $  133.高泄漏阀计数器                         $    $           $    $  ANS061.BYTE004  $  y=x;
  $  134.液压回路压力                           $    $  bar      $    $  ANS062.BYTE004  $  y=x;
  $  135.EV离合器泄漏(阀门启动)                 $    $           $    $  ANS063.BYTE004  $  y=(x1*256+x2);
  $  136.阀门关闭时泄漏                         $    $           $    $  ANS064.BYTE004  $  y=(x1*256+x2);
  $  137.低电池电压计数器                       $    $           $    $  ANS065.BYTE004  $  y=x;
  $  138.低压误差计数器                         $    $           $    $  ANS066.BYTE004  $  y=x;
  $  139.误用错误计数器                         $    $           $    $  ANS067.BYTE004  $  y=x;
  $  140.不需要齿轮分离计数器                   $    $           $    $  ANS068.BYTE004  $  y=x;
  $  141.泵错误计数器                           $    $           $    $  ANS069.BYTE004  $  y=x;
  $  142.泵过热计数器                           $    $           $    $  ANS070.BYTE004  $  y=x;
  $  143.泵继电器卡住计数器                     $    $           $    $  ANS071.BYTE004  $  y=x;
  $  144.选择错误计数器                         $    $           $    $  ANS072.BYTE004  $  y=x;
  $  145.选择锁定错误计数器                     $    $           $    $  ANS073.BYTE004  $  y=x;
  $  146.运动开关卡住计数器                     $    $           $    $  ANS074.BYTE004  $  y=x;
  $  147.执行扭矩(参考发动机)                   $    $  Nm       $    $  ANS075.BYTE004  $  y=(x1*256+x2)-32768;
  $  148.挂错档计数器(SFT2)                     $    $           $    $  ANS076.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
