
    车型ID：1120

    模拟：协议模拟-->1120

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/1e000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 98 00 00 00 00       $%  ANS000:7E9 03 22 F1 98 00 00 00 00
  $%  REQ001:7E1 03 22 F1 A0 00 00 00 00       $%  ANS001:7E9 03 22 F1 A0 00 00 00 00
  $%  REQ002:7E1 03 22 F1 83 00 00 00 00       $%  ANS002:7E9 03 22 F1 83 00 00 00 00
  $%  REQ003:7E1 03 22 F1 A1 00 00 00 00       $%  ANS003:7E9 03 22 F1 A1 00 00 00 00
  $%  REQ004:7E1 03 22 F1 A9 00 00 00 00       $%  ANS004:7E9 03 22 F1 A9 00 00 00 00
  $%  REQ005:7E1 03 22 F1 91 00 00 00 00       $%  ANS005:7E9 03 22 F1 91 00 00 00 00
  $%  REQ006:7E1 03 22 F1 A5 00 00 00 00       $%  ANS006:7E9 03 22 F1 A5 00 00 00 00
  $%  REQ007:7E1 03 22 F1 8B 00 00 00 00       $%  ANS007:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ008:7E1 03 22 F1 A2 00 00 00 00       $%  ANS008:7E9 03 22 F1 A2 00 00 00 00
  $%  REQ009:7E1 03 22 F1 87 00 00 00 00       $%  ANS009:7E9 03 22 F1 87 00 00 00 00
  $%  REQ010:7E1 03 22 F1 AA 00 00 00 00       $%  ANS010:7E9 03 22 F1 AA 00 00 00 00
  $%  REQ011:7E1 03 22 F1 10 00 00 00 00       $%  ANS011:7E9 03 22 F1 10 00 00 00 00
  $%  REQ012:7E1 03 22 F1 B0 00 00 00 00       $%  ANS012:7E9 03 22 F1 B0 00 00 00 00
  $%  REQ013:7E1 03 22 F1 BA 00 00 00 00       $%  ANS013:7E9 03 22 F1 BA 00 00 00 00
  $%  REQ014:7E1 03 22 F1 B5 00 00 00 00       $%  ANS014:7E9 03 22 F1 B5 00 00 00 00
  $%  REQ015:7E1 03 22 F1 92 00 00 00 00       $%  ANS015:7E9 03 22 F1 92 00 00 00 00
  $%  REQ016:7E1 03 22 F1 8C 00 00 00 00       $%  ANS016:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ017:7E1 03 22 F1 94 00 00 00 00       $%  ANS017:7E9 03 22 F1 94 00 00 00 00
  $%  REQ018:7E1 03 22 F1 8A 00 00 00 00       $%  ANS018:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ019:7E1 03 22 F1 90 00 00 00 00       $%  ANS019:7E9 03 22 F1 90 00 00 00 00
  $%  REQ020:7E1 03 22 F1 A8 00 00 00 00       $%  ANS020:7E9 03 22 F1 A8 00 00 00 00

  $%  000:配置可跟踪性区域:                $%    $%  ANS000.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11);
  $%  001:电控单元应用软件号:              $%    $%  ANS001.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  002:电控单元刷写软件参考号:          $%    $%  ANS002.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  003:电控单元标定软件号:              $%    $%  ANS003.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  004:电控单元配置文件号:              $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  005:电控单元硬件号:                  $%    $%  ANS005.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  006:电控单元索引信息:                $%    $%  ANS006.BYTE004  $%  HEX(X1,X2,X3);
  $%  007:电控单元制造日期:                $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3);
  $%  008:电控单元网络文件参考号:          $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  009:电控单元零件号:                  $%    $%  ANS009.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  010:电控单元编程过程文件号:          $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  011:电控单元零件号（上次）:          $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  012:测试工具参考号（上次）:          $%    $%  ANS011.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  013:里程读数（上次）:                $%    $%  ANS011.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  014:辅助刷写软件参考号:              $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  015:辅助校验软件号:                  $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  016:辅助应用软件号:                  $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  017:供应商电控单元硬件参考号:        $%    $%  ANS015.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  018:供应商电控单元序列号:            $%    $%  ANS016.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  019:供应商电控单元软件参考号:        $%    $%  ANS017.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  020:系统供应商标识号:                $%    $%  ANS018.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  021:车辆识别代码:                    $%    $%  ANS019.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  022:车辆特征信息:                    $%    $%  ANS020.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 28 10 00 00 00 00       $  ANS000:7E9 03 22 28 10 00 00 00 00
  $  REQ001:7E1 03 22 28 CC 00 00 00 00       $  ANS001:7E9 03 22 28 CC 00 00 00 00
  $  REQ002:7E1 03 22 3D 35 00 00 00 00       $  ANS002:7E9 03 22 3D 35 00 00 00 00
  $  REQ003:7E1 03 22 28 B9 00 00 00 00       $  ANS003:7E9 03 22 28 B9 00 00 00 00
  $  REQ004:7E1 03 22 28 E7 00 00 00 00       $  ANS004:7E9 03 22 28 E7 00 00 00 00
  $  REQ005:7E1 03 22 28 BF 00 00 00 00       $  ANS005:7E9 03 22 28 BF 00 00 00 00
  $  REQ006:7E1 03 22 11 24 00 00 00 00       $  ANS006:7E9 03 22 11 24 00 00 00 00
  $  REQ007:7E1 03 22 23 C9 00 00 00 00       $  ANS007:7E9 03 22 23 C9 00 00 00 00
  $  REQ008:7E1 03 22 3D 30 00 00 00 00       $  ANS008:7E9 03 22 3D 30 00 00 00 00
  $  REQ009:7E1 03 22 3D 45 00 00 00 00       $  ANS009:7E9 03 22 3D 45 00 00 00 00
  $  REQ010:7E1 03 22 3D 4D 00 00 00 00       $  ANS010:7E9 03 22 3D 4D 00 00 00 00
  $  REQ011:7E1 03 22 23 F9 00 00 00 00       $  ANS011:7E9 03 22 23 F9 00 00 00 00
  $  REQ012:7E1 03 22 23 F8 00 00 00 00       $  ANS012:7E9 03 22 23 F8 00 00 00 00
  $  REQ013:7E1 03 22 36 32 00 00 00 00       $  ANS013:7E9 03 22 36 32 00 00 00 00
  $  REQ014:7E1 03 22 23 C6 00 00 00 00       $  ANS014:7E9 03 22 23 C6 00 00 00 00
  $  REQ015:7E1 03 22 F1 3D 00 00 00 00       $  ANS015:7E9 03 22 F1 3D 00 00 00 00
  $  REQ016:7E1 03 22 F1 3A 00 00 00 00       $  ANS016:7E9 03 22 F1 3A 00 00 00 00
  $  REQ017:7E1 03 22 33 CE 00 00 00 00       $  ANS017:7E9 03 22 33 CE 00 00 00 00
  $  REQ018:7E1 03 22 33 BB 00 00 00 00       $  ANS018:7E9 03 22 33 BB 00 00 00 00
  $  REQ019:7E1 03 22 3D 4A 00 00 00 00       $  ANS019:7E9 03 22 3D 4A 00 00 00 00
  $  REQ020:7E1 03 22 23 AE 00 00 00 00       $  ANS020:7E9 03 22 23 AE 00 00 00 00
  $  REQ021:7E1 03 22 23 AB 00 00 00 00       $  ANS021:7E9 03 22 23 AB 00 00 00 00
  $  REQ022:7E1 03 22 1A 2D 00 00 00 00       $  ANS022:7E9 03 22 1A 2D 00 00 00 00
  $  REQ023:7E1 03 22 D2 99 00 00 00 00       $  ANS023:7E9 03 22 D2 99 00 00 00 00
  $  REQ024:7E1 03 22 D2 9A 00 00 00 00       $  ANS024:7E9 03 22 D2 9A 00 00 00 00
  $  REQ025:7E1 03 22 D2 9B 00 00 00 00       $  ANS025:7E9 03 22 D2 9B 00 00 00 00
  $  REQ026:7E1 03 22 23 C8 00 00 00 00       $  ANS026:7E9 03 22 23 C8 00 00 00 00
  $  REQ027:7E1 03 22 D2 C9 00 00 00 00       $  ANS027:7E9 03 22 D2 C9 00 00 00 00
  $  REQ028:7E1 03 22 01 0C 00 00 00 00       $  ANS028:7E9 03 22 01 0C 00 00 00 00
  $  REQ029:7E1 03 22 E1 01 00 00 00 00       $  ANS029:7E9 03 22 E1 01 00 00 00 00
  $  REQ030:7E1 03 22 20 33 00 00 00 00       $  ANS030:7E9 03 22 20 33 00 00 00 00
  $  REQ031:7E1 03 22 D2 92 00 00 00 00       $  ANS031:7E9 03 22 D2 92 00 00 00 00
  $  REQ032:7E1 03 22 D2 93 00 00 00 00       $  ANS032:7E9 03 22 D2 93 00 00 00 00
  $  REQ033:7E1 03 22 D2 94 00 00 00 00       $  ANS033:7E9 03 22 D2 94 00 00 00 00
  $  REQ034:7E1 03 22 23 C7 00 00 00 00       $  ANS034:7E9 03 22 23 C7 00 00 00 00
  $  REQ035:7E1 03 22 D0 01 00 00 00 00       $  ANS035:7E9 03 22 D0 01 00 00 00 00
  $  REQ036:7E1 03 22 20 D0 00 00 00 00       $  ANS036:7E9 03 22 20 D0 00 00 00 00
  $  REQ037:7E1 03 22 23 EC 00 00 00 00       $  ANS037:7E9 03 22 23 EC 00 00 00 00
  $  REQ038:7E1 03 22 20 35 00 00 00 00       $  ANS038:7E9 03 22 20 35 00 00 00 00
  $  REQ039:7E1 03 22 23 24 00 00 00 00       $  ANS039:7E9 03 22 23 24 00 00 00 00
  $  REQ040:7E1 03 22 23 26 00 00 00 00       $  ANS040:7E9 03 22 23 26 00 00 00 00
  $  REQ041:7E1 03 22 23 25 00 00 00 00       $  ANS041:7E9 03 22 23 25 00 00 00 00
  $  REQ042:7E1 03 22 23 28 00 00 00 00       $  ANS042:7E9 03 22 23 28 00 00 00 00
  $  REQ043:7E1 03 22 23 27 00 00 00 00       $  ANS043:7E9 03 22 23 27 00 00 00 00
  $  REQ044:7E1 03 22 36 31 00 00 00 00       $  ANS044:7E9 03 22 36 31 00 00 00 00
  $  REQ045:7E1 03 22 29 31 00 00 00 00       $  ANS045:7E9 03 22 29 31 00 00 00 00
  $  REQ046:7E1 03 22 29 32 00 00 00 00       $  ANS046:7E9 03 22 29 32 00 00 00 00
  $  REQ047:7E1 03 22 D2 A6 00 00 00 00       $  ANS047:7E9 03 22 D2 A6 00 00 00 00
  $  REQ048:7E1 03 22 11 41 00 00 00 00       $  ANS048:7E9 03 22 11 41 00 00 00 00
  $  REQ049:7E1 03 22 20 7E 00 00 00 00       $  ANS049:7E9 03 22 20 7E 00 00 00 00
  $  REQ050:7E1 03 22 01 12 00 00 00 00       $  ANS050:7E9 03 22 01 12 00 00 00 00
  $  REQ051:7E1 03 22 D8 EB 00 00 00 00       $  ANS051:7E9 03 22 D8 EB 00 00 00 00
  $  REQ052:7E1 03 22 D8 E8 00 00 00 00       $  ANS052:7E9 03 22 D8 E8 00 00 00 00
  $  REQ053:7E1 03 22 D8 EA 00 00 00 00       $  ANS053:7E9 03 22 D8 EA 00 00 00 00
  $  REQ054:7E1 03 22 F1 3F 00 00 00 00       $  ANS054:7E9 03 22 F1 3F 00 00 00 00
  $  REQ055:7E1 03 22 27 FE 00 00 00 00       $  ANS055:7E9 03 22 27 FE 00 00 00 00
  $  REQ056:7E1 03 22 27 FF 00 00 00 00       $  ANS056:7E9 03 22 27 FF 00 00 00 00
  $  REQ057:7E1 03 22 29 34 00 00 00 00       $  ANS057:7E9 03 22 29 34 00 00 00 00
  $  REQ058:7E1 03 22 36 30 00 00 00 00       $  ANS058:7E9 03 22 36 30 00 00 00 00
  $  REQ059:7E1 03 22 28 0F 00 00 00 00       $  ANS059:7E9 03 22 28 0F 00 00 00 00
  $  REQ060:7E1 03 22 1A 1F 00 00 00 00       $  ANS060:7E9 03 22 1A 1F 00 00 00 00
  $  REQ061:7E1 03 22 19 9A 00 00 00 00       $  ANS061:7E9 03 22 19 9A 00 00 00 00
  $  REQ062:7E1 03 22 28 23 00 00 00 00       $  ANS062:7E9 03 22 28 23 00 00 00 00
  $  REQ063:7E1 03 22 33 B2 00 00 00 00       $  ANS063:7E9 03 22 33 B2 00 00 00 00
  $  REQ064:7E1 03 22 D2 01 00 00 00 00       $  ANS064:7E9 03 22 D2 01 00 00 00 00
  $  REQ065:7E1 03 22 D2 04 00 00 00 00       $  ANS065:7E9 03 22 D2 04 00 00 00 00
  $  REQ066:7E1 03 22 D8 B2 00 00 00 00       $  ANS066:7E9 03 22 D8 B2 00 00 00 00
  $  REQ067:7E1 03 22 D9 57 00 00 00 00       $  ANS067:7E9 03 22 D9 57 00 00 00 00
  $  REQ068:7E1 03 22 D9 56 00 00 00 00       $  ANS068:7E9 03 22 D9 56 00 00 00 00
  $  REQ069:7E1 03 22 D8 B1 00 00 00 00       $  ANS069:7E9 03 22 D8 B1 00 00 00 00
  $  REQ070:7E1 03 22 19 40 00 00 00 00       $  ANS070:7E9 03 22 19 40 00 00 00 00
  $  REQ071:7E1 03 22 23 C2 00 00 00 00       $  ANS071:7E9 03 22 23 C2 00 00 00 00
  $  REQ072:7E1 03 22 19 42 00 00 00 00       $  ANS072:7E9 03 22 19 42 00 00 00 00
  $  REQ073:7E1 03 22 D8 B4 00 00 00 00       $  ANS073:7E9 03 22 D8 B4 00 00 00 00
  $  REQ074:7E1 03 22 D8 B3 00 00 00 00       $  ANS074:7E9 03 22 D8 B3 00 00 00 00
  $  REQ075:7E1 03 22 D9 55 00 00 00 00       $  ANS075:7E9 03 22 D9 55 00 00 00 00
  $  REQ076:7E1 03 22 D9 54 00 00 00 00       $  ANS076:7E9 03 22 D9 54 00 00 00 00
  $  REQ077:7E1 03 22 19 4F 00 00 00 00       $  ANS077:7E9 03 22 19 4F 00 00 00 00
  $  REQ078:7E1 03 22 D9 A5 00 00 00 00       $  ANS078:7E9 03 22 D9 A5 00 00 00 00
  $  REQ079:7E1 03 22 D9 A4 00 00 00 00       $  ANS079:7E9 03 22 D9 A4 00 00 00 00
  $  REQ080:7E1 03 22 D9 A7 00 00 00 00       $  ANS080:7E9 03 22 D9 A7 00 00 00 00
  $  REQ081:7E1 03 22 D9 A6 00 00 00 00       $  ANS081:7E9 03 22 D9 A6 00 00 00 00
  $  REQ082:7E1 03 22 28 88 00 00 00 00       $  ANS082:7E9 03 22 28 88 00 00 00 00
  $  REQ083:7E1 03 22 19 7E 00 00 00 00       $  ANS083:7E9 03 22 19 7E 00 00 00 00
  $  REQ084:7E1 03 22 28 61 00 00 00 00       $  ANS084:7E9 03 22 28 61 00 00 00 00
  $  REQ085:7E1 03 22 28 89 00 00 00 00       $  ANS085:7E9 03 22 28 89 00 00 00 00

  $  000.加速器有效位置                                                 $    $  %       $    $  ANS000.BYTE004  $  y=x*0.390625;
  $  001.辅助传动液泵马达IGBT模块温度1                                  $    $          $    $  ANS001.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  002.辅助变速箱油泵电机转速                                         $    $  rpm     $    $  ANS002.BYTE004  $  y=(x1*256+x2)*3-30000;
  $  003.辅助传动液泵电机转速实际                                       $    $  rpm     $    $  ANS003.BYTE004  $  y=(x1*256+x2)*3-30000;
  $  004.辅助传动液泵马达速度指令                                       $    $  rpm     $    $  ANS004.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*3-30000;
  $  005.辅助传动液泵电机温度                                           $    $          $    $  ANS005.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  006.主动制动踏板                                                   $    $          $    $  ANS006.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  007.V9B1信号超出范围                                               $    $          $    $  ANS007.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  008.V9B2信号超出范围                                               $    $          $    $  ANS007.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  009.变速器齿轮                                                     $    $          $    $  ANS008.BYTE004  $  if(x==0) y=@023f;else if(x==2) y=@0001;else if(x==22) y=@029b;else if(x==23) y=@02b4;else if(x==26) y=@02b5;else if(x==27) y=@02b6;else if(x==28) y=@02b7;else if(x==29) y=@02b8;else if(x==30) y=@02b9;else if(x==31) y=@02ba;else if(x==32) y=@0035;else y=@0035;
  $  010.传输高端驱动器1                                                $    $          $    $  ANS008.BYTE005  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  011.传输高端驱动器2                                                $    $          $    $  ANS008.BYTE005  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  012.DCT离合器扭矩接合位置（咬合点）学习状态                        $    $          $    $  ANS008.BYTE005  $  if(((x&0x20)>>5)==0) y=@028e;else if(((x&0x20)>>5)==1) y=@02cf;else y=@0035;
  $  013.传输EOL与服务快速学习状态                                      $    $          $    $  ANS008.BYTE006  $  if(x==0x00) y=@02e0;else if(x==0x01) y=@02e1;else if(x==0x02) y=@02e2;else if(x==0x03) y=@02e3;else if(x==0x04) y=@02e4;else if(x==0x05) y=@02e5;else if(x==0x06) y=@02e6;else if(x==0x07) y=@02e7;else if(x==0x08) y=@02e8;else if(x==0x09) y=@02e9;else if(x==0x0A) y=@02ea;else if(x==0x0B) y=@02eb;else if(x==0x0C) y=@02ec;else if(x==0x0D) y=@02ed;else if(x==0x0E) y=@02ee;else if(x==0x0F) y=@02ef;else if(x==0x10) y=@02f0;else if(x==0x11) y=@02f1;else if(x==0x12) y=@02f2;else if(x==0x13) y=@02f3;else if(x==0x14) y=@02f4;else if(x==0x15) y=@02f5;else if(x==0x16) y=@02f6;else if(x==0x17) y=@02f7;else if(x==0x18) y=@02f8;else if(x==0x19) y=@02f9;else if(x==0x1A) y=@02fa;else if(x==0x1B) y=@02fb;else if(x==0x1C) y=@02fc;else if(x==0x1D) y=@02fd;else if(x==0x1E) y=@02fe;else if(x==0x1F) y=@02ff;else if(x==0x20) y=@0300;else if(x==0x21) y=@0301;else if(x==0x22) y=@0302;else if(x==0x23) y=@0303;else if(x==0x24) y=@0304;else if(x==0x25) y=@0305;else if(x==0x26) y=@0306;else if(x==0x27) y=@0307;else y=@0035;
  $  014.DCT离合器1扭矩                                                 $    $          $    $  ANS009.BYTE004  $  y=(x1*256+x2)*0.25;
  $  015.DCT离合器2扭矩                                                 $    $          $    $  ANS009.BYTE006  $  y=(x1*256+x2)*0.25;
  $  016.DCT温度柱状图数据重置触发器                                    $    $          $    $  ANS009.BYTE008  $  if(((x&0x80)>>7)==0) y=@000f;else y=@0028;
  $  017.变速箱温度计数器复位触发器                                     $    $          $    $  ANS009.BYTE008  $  if(((x&0x20)>>5)==0) y=@000f;else y=@0028;
  $  018.变速器蓄能器压力恢复触发器                                     $    $          $    $  ANS009.BYTE008  $  if(((x&0x10)>>4)==0) y=@000f;else y=@0028;
  $  019.变速器空气净化状态                                             $    $          $    $  ANS009.BYTE008  $  if(((x&0x0C)>>2)==0) y=@02ce;else if(((x&0x0C)>>2)==1) y=@00b2;else if(((x&0x0C)>>2)==2) y=@02cf;else y=@002e;
  $  020.变速箱蓄能器泄压状态                                           $    $          $    $  ANS009.BYTE008  $  if((x&0x03)==0) y=@02ce;else if((x&0x03)==1) y=@00b2;else if((x&0x03)==2) y=@02cf;else y=@002e;
  $  021.DCT离合器1位置                                                 $    $  mm      $    $  ANS010.BYTE004  $  y=x*0.0784;
  $  022.DCT离合器2位置                                                 $    $  mm      $    $  ANS010.BYTE005  $  y=x*0.0784;
  $  023.蓄电池接触器状态                                               $    $          $    $  ANS010.BYTE006  $  if(((x&0xC0)>>6)==0) y=@0028;else if(((x&0xC0)>>6)==1) y=@0308;else if(((x&0xC0)>>6)==2) y=@000f;else y=@023f;
  $  024.DCT离合器1实际状态                                             $    $          $    $  ANS010.BYTE007  $  if(x==0) y=@0319;else if(x==1) y=@031a;else if(x==2) y=@031b;else if(x==3) y=@01e9;else if(x==4) y=@02b2;else y=@0035;
  $  025.DCT离合器2实际状态                                             $    $          $    $  ANS010.BYTE008  $  if(x==0) y=@0319;else if(x==1) y=@031a;else if(x==2) y=@031b;else if(x==3) y=@01e9;else if(x==4) y=@02b2;else y=@0035;
  $  026.DCT离合器扭矩接合位置（咬合点）学习抑制原因                    $    $          $    $  ANS011.BYTE004  $  if(x==0x00) y=@031c;else if(x==0x01) y=@031d;else if(x==0x02) y=@031e;else if(x==0x03) y=@031f;else if(x==0x04) y=@0320;else if(x==0x05) y=@0321;else if(x==0x06) y=@0322;else if(x==0x07) y=@0323;else if(x==0x08) y=@0324;else if(x==0x09) y=@0325;else y=@0035;
  $  027.DCT离合器扭矩接合位置（咬合点）学习状态                        $    $          $    $  ANS012.BYTE004  $  if(x==0x00)y=@028e;else if(x==0x01)y=@03ce;else if(x==0x02)y=@03cf;else if(x==0x03)y=@03d0;else if(x==0x04)y=@03d1;else if(x==0x05)y=@03d2;else if(x==0x06)y=@03d3;else if(x==0x07)y=@03d4;else if(x==0x08)y=@03d5;else if(x==0x09)y=@03d6;else y=@01a9;
  $  028.蓄电池泵电机继电器触点状态                                     $    $          $    $  ANS013.BYTE004  $  if(((x&0xC0)>>6)==0) y=@0028;else if(((x&0xC0)>>6)==1) y=@0308;else if(((x&0xC0)>>6)==3) y=@000f;else y=@0035;
  $  029.启用条件中止原因                                               $    $          $    $  ANS014.BYTE004  $  if(((x&0xF0)>>4)==0x00) y=@0309;else if(((x&0xF0)>>4)==0x01) y=@0326;else if(((x&0xF0)>>4)==0x02) y=@0327;else if(((x&0xF0)>>4)==0x03) y=@0328;else if(((x&0xF0)>>4)==0x04) y=@0329;else if(((x&0xF0)>>4)==0x05) y=@032a;else if(((x&0xF0)>>4)==0x06) y=@032b;else if(((x&0xF0)>>4)==0x07) y=@032c;else if(((x&0xF0)>>4)==0x08) y=@032d;else if(((x&0xF0)>>4)==0x09) y=@032e;else y=@0035;
  $  030.换档叉中立和占线位置学习中止原因                               $    $          $    $  ANS014.BYTE004  $  if((x&0x0F)==0) y=@0309;else if((x&0x0F)==1) y=@032f;else if((x&0x0F)==2) y=@0330;else if((x&0x0F)==3) y=@0331;else if((x&0x0F)==4) y=@0332;else y=@0035;
  $  031.离合器不换档时，拨叉不在中间学习中止原因                       $    $          $    $  ANS014.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0309;else if(((x&0xF0)>>4)==1) y=@0333;else y=@0035;
  $  032.离合器脱开位置学习中止原因                                     $    $          $    $  ANS014.BYTE005  $  if((x&0x0F)==0) y=@0309;else if((x&0x0F)==1) y=@0334;else y=@0035;
  $  033.离合器零点学习中止原因                                         $    $          $    $  ANS014.BYTE006  $  if(((x&0xF0)>>4)==0) y=@0309;else if(((x&0xF0)>>4)==1) y=@0335;else if(((x&0xF0)>>4)==2) y=@0336;else if(((x&0xF0)>>4)==3) y=@0337;else if(((x&0xF0)>>4)==4) y=@0338;else y=@0035;
  $  034.离合器初始施加位置（吻合点）和换档叉同步位置学习中止原因       $    $          $    $  ANS014.BYTE006  $  if((x&0x0F)==0) y=@0309;else if((x&0x0F)==1) y=@030a;else if((x&0x0F)==2) y=@030b;else if((x&0x0F)==3) y=@030c;else if((x&0x0F)==4) y=@030d;else if((x&0x0F)==5) y=@030e;else y=@0035;
  $  035.离合器流点学习中止原因                                         $    $          $    $  ANS014.BYTE007  $  if(((x&0xF0)>>4)==0) y=@0309;else if(((x&0xF0)>>4)==1) y=@030f;else if(((x&0xF0)>>4)==2) y=@0310;else if(((x&0xF0)>>4)==3) y=@0311;else y=@0035;
  $  036.蓄能器预充压力学习中止原因                                     $    $          $    $  ANS014.BYTE007  $  if((x&0x0F)==0) y=@0309;else if((x&0x0F)==1) y=@0312;else if((x&0x0F)==2) y=@0313;else if((x&0x0F)==3) y=@0314;else y=@0035;
  $  037.蓄能器预充电压力学习结果                                       $    $          $    $  ANS015.BYTE004  $  if(((x&0xC0)>>6)==0) y=@0315;else if(((x&0xC0)>>6)==1) y=@02cf;else if(((x&0xC0)>>6)==3) y=@002e;else y=@0035;
  $  038.DCT EOL和服务快速学习结果-累加器预充电压力                     $    $  kPa     $    $  ANS015.BYTE005  $  y=(x1*256+x2)*0.137;
  $  039.拨叉中立和占线位置学习结果                                     $    $          $    $  ANS016.BYTE004  $  if(((x&0xC0)>>6)==0) y=@0315;else if(((x&0xC0)>>6)==1) y=@02cf;else if(((x&0xC0)>>6)==3) y=@002e;else y=@0035;
  $  040.拨叉同步位置学习结果                                           $    $          $    $  ANS016.BYTE004  $  if(((x&0x30)>>4)==0) y=@0315;else if(((x&0x30)>>4)==1) y=@02cf;else if(((x&0x30)>>4)==3) y=@002e;else y=@0035;
  $  041.拨叉1前啮合位置                                                $    $  mm      $    $  ANS016.BYTE005  $  y=x*0.09375-12;
  $  042.换档拨叉1向前同步位置                                          $    $  mm      $    $  ANS016.BYTE006  $  y=x*0.09375-12;
  $  043.换档拨叉1中立位置                                              $    $  mm      $    $  ANS016.BYTE007  $  y=x*0.09375-12;
  $  044.换档拨叉1向后同步位置                                          $    $  mm      $    $  ANS016.BYTE008  $  y=x*0.09375-12;
  $  045.换档拨叉1向后接合位置                                          $    $  mm      $    $  ANS016.BYTE009  $  y=x*0.09375-12;
  $  046.拨叉2前啮合位置                                                $    $  mm      $    $  ANS016.BYTE010  $  y=x*0.09375-12;
  $  047.换档拨叉2向前同步位置                                          $    $  mm      $    $  ANS016.BYTE011  $  y=x*0.09375-12;
  $  048.换档拨叉2中立位置                                              $    $  mm      $    $  ANS016.BYTE012  $  y=x*0.09375-12;
  $  049.换档拨叉2向后同步位置                                          $    $  mm      $    $  ANS016.BYTE013  $  y=x*0.09375-12;
  $  050.换档拨叉2向后接合位置                                          $    $  mm      $    $  ANS016.BYTE014  $  y=x*0.09375-12;
  $  051.拨叉3前啮合位置                                                $    $  mm      $    $  ANS016.BYTE015  $  y=x*0.09375-12;
  $  052.换档拨叉3向前同步位置                                          $    $  mm      $    $  ANS016.BYTE016  $  y=x*0.09375-12;
  $  053.换档拨叉3中立位置                                              $    $  mm      $    $  ANS016.BYTE017  $  y=x*0.09375-12;
  $  054.换档拨叉3向后同步位置                                          $    $  mm      $    $  ANS016.BYTE018  $  y=x*0.09375-12;
  $  055.换档拨叉3向后接合位置                                          $    $  mm      $    $  ANS016.BYTE019  $  y=x*0.09375-12;
  $  056.拨叉4前啮合位置                                                $    $  mm      $    $  ANS016.BYTE020  $  y=x*0.09375-12;
  $  057.换档拨叉4向前同步位置                                          $    $  mm      $    $  ANS016.BYTE021  $  y=x*0.09375-12;
  $  058.换档拨叉4中立位置                                              $    $  mm      $    $  ANS016.BYTE022  $  y=x*0.09375-12;
  $  059.换档拨叉4向后同步位置                                          $    $  mm      $    $  ANS016.BYTE023  $  y=x*0.09375-12;
  $  060.换档拨叉4向后接合位置                                          $    $  mm      $    $  ANS016.BYTE024  $  y=x*0.09375-12;
  $  061.DCT估算离合器1温度                                             $    $          $    $  ANS017.BYTE004  $  y=x*4-40;
  $  062.DCT估算离合器2温度                                             $    $          $    $  ANS018.BYTE004  $  y=((x&0x7F)-(x&0x80))*4-40;
  $  063.换档拨叉1位置传感器状态                                        $    $          $    $  ANS019.BYTE004  $  if(x==0) y=@02ad;else if(x==1) y=@0316;else if(x==2) y=@0001;else if(x==3) y=@0317;else if(x==4) y=@02ae;else if(x==5) y=@01e9;else if(x==6) y=@0318;else y=@0035;
  $  064.换档拨叉2位置传感器状态                                        $    $          $    $  ANS019.BYTE005  $  if(x==0) y=@02ad;else if(x==1) y=@0316;else if(x==2) y=@0001;else if(x==3) y=@0317;else if(x==4) y=@02ae;else if(x==5) y=@01e9;else if(x==6) y=@0318;else y=@0035;
  $  065.换档拨叉3位置传感器状态                                        $    $          $    $  ANS019.BYTE006  $  if(x==0) y=@02ad;else if(x==1) y=@0316;else if(x==2) y=@0001;else if(x==3) y=@0317;else if(x==4) y=@02ae;else if(x==5) y=@01e9;else if(x==6) y=@0318;else y=@0035;
  $  066.换档拨叉4位置传感器状态                                        $    $          $    $  ANS019.BYTE007  $  if(x==0) y=@02ad;else if(x==1) y=@0316;else if(x==2) y=@0001;else if(x==3) y=@0317;else if(x==4) y=@02ae;else if(x==5) y=@01e9;else if(x==6) y=@0318;else y=@0035;
  $  067.换档1命令状态                                                  $    $          $    $  ANS020.BYTE004  $  if(((x&0xC0)>>6)==0) y=@02ac;else if(((x&0xC0)>>6)==1) y=@02ad;else if(((x&0xC0)>>6)==2) y=@0001;else if(((x&0xC0)>>6)==3) y=@02ae;else y=@0035;
  $  068.换档2命令状态                                                  $    $          $    $  ANS020.BYTE004  $  if(((x&0x30)>>4)==0) y=@02ac;else if(((x&0x30)>>4)==1) y=@02ad;else if(((x&0x30)>>4)==2) y=@0001;else if(((x&0x30)>>4)==3) y=@02ae;else y=@0035;
  $  069.换档3命令状态                                                  $    $          $    $  ANS020.BYTE004  $  if(((x&0x0C)>>2)==0) y=@02ac;else if(((x&0x0C)>>2)==1) y=@02ad;else if(((x&0x0C)>>2)==2) y=@0001;else if(((x&0x0C)>>2)==3) y=@02ae;else y=@0035;
  $  070.换档4命令状态                                                  $    $          $    $  ANS020.BYTE004  $  if((x&0x03)==0) y=@02ac;else if((x&0x03)==1) y=@02ad;else if((x&0x03)==2) y=@0001;else if((x&0x03)==3) y=@02ae;else y=@0035;
  $  071.主离合器控制                                                   $    $          $    $  ANS021.BYTE004  $  if(x==0) y=@02af;else if(x==1) y=@02b0;else if(x==2) y=@02b1;else y=@0035;
  $  072.发动机实际稳态转矩                                             $    $  Nm      $    $  ANS022.BYTE004  $  y=(x1*256+x2)*0.25;
  $  073.偶数离合器滑动误差FOM计数器                                    $    $          $    $  ANS023.BYTE004  $  y=(x1*256+x2);
  $  074.偶数离合器滑差故障速度                                         $    $  rpm     $    $  ANS024.BYTE004  $  y=(x1*256+x2)*0.125;
  $  075.偶数离合器滑差故障定时器                                       $    $  s       $    $  ANS025.BYTE004  $  y=(x1*256+x2)*0.125;
  $  076.偶数速度传感器原始感测内部速度（RPM）                          $    $  rpm     $    $  ANS026.BYTE004  $  y=(x1*256+x2)*0.125;
  $  077.液压回路压力最大累计时间的FOM                                  $    $  s       $    $  ANS027.BYTE004  $  y=x*0.05;
  $  078.全局发动机冷却液温度                                           $    $          $    $  ANS028.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  079.全局里程计读数                                                 $    $  km      $    $  ANS029.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  080.静态NVM读取状态                                                $    $          $    $  ANS030.BYTE004  $  if(((x&0xC0)>>6)==0) y=@002e;else if(((x&0xC0)>>6)==1) y=@02b2;else if(((x&0xC0)>>6)==3) y=@02b3;else y=@0035;
  $  081.累积NVM读取状态                                                $    $          $    $  ANS030.BYTE004  $  if(((x&0x30)>>4)==0) y=@002e;else if(((x&0x30)>>4)==1) y=@02b2;else if(((x&0x30)>>4)==3) y=@02b3;else y=@0035;
  $  082.自适应NVM读状态                                                $    $          $    $  ANS030.BYTE004  $  if(((x&0x0C)>>2)==0) y=@002e;else if(((x&0x0C)>>2)==1) y=@02b2;else if(((x&0x0C)>>2)==3) y=@02b3;else y=@0035;
  $  083.静态NVM校验和状态                                              $    $          $    $  ANS030.BYTE004  $  if((x&0x03)==0) y=@002e;else if((x&0x03)==1) y=@02b2;else if((x&0x03)==3) y=@02b3;else y=@0035;
  $  084.累积NVM校验和状态                                              $    $          $    $  ANS030.BYTE005  $  if(((x&0xC0)>>6)==0) y=@002e;else if(((x&0xC0)>>6)==1) y=@02b2;else if(((x&0xC0)>>6)==3) y=@02b3;else y=@0035;
  $  085.自适应NVM校验和状态                                            $    $          $    $  ANS030.BYTE005  $  if(((x&0x30)>>4)==0) y=@002e;else if(((x&0x30)>>4)==1) y=@02b2;else if(((x&0x30)>>4)==3) y=@02b3;else y=@0035;
  $  086.奇数离合器滑差故障计数器                                       $    $          $    $  ANS031.BYTE004  $  y=(x1*256+x2)*0.00625;
  $  087.故障转速奇数离合器滑差                                         $    $  rpm     $    $  ANS032.BYTE004  $  y=(x1*256+x2)*0.125;
  $  088.奇数离合器滑差故障定时器                                       $    $  rpm     $    $  ANS033.BYTE004  $  y=(x1*256+x2)*0.0125;
  $  089.奇数速度传感器原始感测内部速度（RPM）                          $    $  rpm     $    $  ANS034.BYTE004  $  y=(x1*256+x2)*0.125;
  $  090.全局KL50状态                                                   $    $          $    $  ANS035.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  091.全局发动机运行状态                                             $    $          $    $  ANS035.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  092.全局KL15状态                                                   $    $          $    $  ANS035.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  093.全局KL状态                                                     $    $          $    $  ANS035.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  094.系统KL.50状态                                                  $    $          $    $  ANS035.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  095.系统发动机状态                                                 $    $          $    $  ANS035.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  096.系统KL.15状态                                                  $    $          $    $  ANS035.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  097.系统KL.R状态                                                   $    $          $    $  ANS035.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  098.附件输入激活                                                   $    $          $    $  ANS036.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  099.运行/曲柄输入活动                                              $    $          $    $  ANS036.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  100.压力控制螺线管1命令压力                                        $    $  kPa     $    $  ANS037.BYTE004  $  y=(x1*256+x2)*0.125;
  $  101.处理器ROM故障源                                                $    $          $    $  ANS038.BYTE004  $  if((x>=0x00)&&(x<=0xDF))y=@02a9;else if(x==0xFE) y=@02aa;else if(x==0xFF) y=@02ab;else y=@0035;
  $  102.写保护RAM故障                                                  $    $          $    $  ANS039.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  103.双存储随机存取存储器故障                                       $    $          $    $  ANS039.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  104.二级处理器RAM故障                                              $    $          $    $  ANS039.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  105.微代码RAM故障                                                  $    $          $    $  ANS039.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  106.高速缓存RAM故障                                                $    $          $    $  ANS039.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  107.系统内存故障                                                   $    $          $    $  ANS039.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  108.内存故障地址                                                   $    $          $    $  ANS040.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  109.内存故障指令地址                                               $    $          $    $  ANS041.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  110.ROM失效原因                                                    $    $          $    $  ANS042.BYTE004  $  if(x==0) y=@02cb;else if(x==2) y=@02cc;else y=@0035;
  $  111.内存故障指令地址                                               $    $          $    $  ANS043.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  112.原始变速器发动机转速                                           $    $  rpm     $    $  ANS044.BYTE004  $  y=(x1*256+x2)*0.125;
  $  113.原始传输输入速度                                               $    $  rpm     $    $  ANS045.BYTE004  $  y=(x1*256+x2)*0.125;
  $  114.原始传输输出速度                                               $    $  rpm     $    $  ANS046.BYTE004  $  y=(x1*256+x2)*0.125;
  $  115.倒档啮合超时故障计数器                                         $    $          $    $  ANS047.BYTE004  $  y=(x1*256+x2);
  $  116.运行/曲柄电压                                                  $    $  V       $    $  ANS048.BYTE004  $  y=x*0.1;
  $  117.系统电源模式                                                   $    $          $    $  ANS049.BYTE004  $  if(x==0) y=@0264;else if(x==1) y=@0010;else if(x==2) y=@0011;else if(x==3) y=@02cd;else y=@0035;
  $  118.系统供电电压                                                   $    $  V       $    $  ANS050.BYTE004  $  y=x*0.1;
  $  119.启用故障计数器                                                 $    $          $    $  ANS051.BYTE004  $  y=x;
  $  120.无效电压故障定时器                                             $    $  s       $    $  ANS052.BYTE004  $  y=(x1*256+x2)*0.05;
  $  121.未能启用故障计数器                                             $    $          $    $  ANS053.BYTE004  $  y=x;
  $  122.轮胎尺寸                                                       $    $  cm      $    $  ANS054.BYTE004  $  y=x+100;
  $  123.变速箱蓄能器泄压过程状态                                       $    $          $    $  ANS055.BYTE004  $  if(x==0x00) y=@02ce;else if(x==0x01) y=@00b2;else if(x==0x02) y=@02cf;else if(x==0x03) y=@002e;else y=@0035;
  $  124.变速箱蓄能器压力                                               $    $  kPa     $    $  ANS056.BYTE004  $  y=(x1*256+x2)*0.111;
  $  125.变速器蓄能器压力恢复过程状态                                   $    $          $    $  ANS057.BYTE004  $  if(x==0) y=@02d0;else if(x==1) y=@02d1;else y=@0035;
  $  126.变速器空气净化状态                                             $    $          $    $  ANS058.BYTE008  $  if(((x&0x0C)>>2)==0) y=@02ce;else if(((x&0x0C)>>2)==1) y=@00b2;else if(((x&0x0C)>>2)==2) y=@02cf;else y=@002e;
  $  127.基本传输模式                                                   $    $          $    $  ANS059.BYTE004  $  if(x==0x00) y=@02d2;else if(x==0x01) y=@02d3;else if(x==0x02) y=@02d4;else if(x==0x03) y=@02d5;else if(x==0x04) y=@02d6;else if(x==0x05) y=@02d7;else if(x==0x06) y=@02d8;else if(x==0x07) y=@02d9;else if(x==0x08) y=@02da;else if(x==0x09) y=@02db;else if(x==0x0A) y=@02dc;else if(x==0x0B) y=@0198;else if(x==0x0C) y=@0035;else if(x==0x0D) y=@02dd;else if(x==0x0E) y=@02de;else if(x==0x0F) y=@02df;else y=@0035;
  $  128.变速器离合器滑移                                               $    $  rpm     $    $  ANS060.BYTE004  $  y=(x1*256+x2)*0.125;
  $  129.变速箱指令挡位                                                 $    $          $    $  ANS061.BYTE004  $  if(((x&0xE0)>>5)==0) y=@0035;else if(((x&0xE0)>>5)==1) y=@02b4;else if(((x&0xE0)>>5)==2) y=@02b5;else if(((x&0xE0)>>5)==3) y=@02b6;else if(((x&0xE0)>>5)==4) y=@02b7;else if(((x&0xE0)>>5)==5) y=@02b8;else if(((x&0xE0)>>5)==6) y=@02b9;else y=@02ba;
  $  130.传输EOL与服务快速学习状态                                      $    $          $    $  ANS062.BYTE006  $  if(x==0x00) y=@02e0;else if(x==0x01) y=@02e1;else if(x==0x02) y=@02e2;else if(x==0x03) y=@02e3;else if(x==0x04) y=@02e4;else if(x==0x05) y=@02e5;else if(x==0x06) y=@02e6;else if(x==0x07) y=@02e7;else if(x==0x08) y=@02e8;else if(x==0x09) y=@02e9;else if(x==0x0A) y=@02ea;else if(x==0x0B) y=@02eb;else if(x==0x0C) y=@02ec;else if(x==0x0D) y=@02ed;else if(x==0x0E) y=@02ee;else if(x==0x0F) y=@02ef;else if(x==0x10) y=@02f0;else if(x==0x11) y=@02f1;else if(x==0x12) y=@02f2;else if(x==0x13) y=@02f3;else if(x==0x14) y=@02f4;else if(x==0x15) y=@02f5;else if(x==0x16) y=@02f6;else if(x==0x17) y=@02f7;else if(x==0x18) y=@02f8;else if(x==0x19) y=@02f9;else if(x==0x1A) y=@02fa;else if(x==0x1B) y=@02fb;else if(x==0x1C) y=@02fc;else if(x==0x1D) y=@02fd;else if(x==0x1E) y=@02fe;else if(x==0x1F) y=@02ff;else if(x==0x20) y=@0300;else if(x==0x21) y=@0301;else if(x==0x22) y=@0302;else if(x==0x23) y=@0303;else if(x==0x24) y=@0304;else if(x==0x25) y=@0305;else if(x==0x26) y=@0306;else if(x==0x27) y=@0307;else y=@0035;
  $  131.变速箱液压A/D                                                  $    $  %       $    $  ANS063.BYTE004  $  y=x*0.0039;
  $  132.冷起动故障时变速器流体与逆变器温差                             $    $          $    $  ANS064.BYTE004  $  y=(x1*256+x2)*0.0078125;
  $  133.暖机循环故障时变速器流体温度升高                               $    $          $    $  ANS065.BYTE004  $  y=(x1*256+x2)*0.0078125;
  $  134.变速箱输入转速传感器电路低电压                                 $    $          $    $  ANS066.BYTE004  $  y=x*0.05;
  $  135.传输输入速度传感器电路短路高                                   $    $  s       $    $  ANS067.BYTE004  $  y=(x1*256+x2)*0.05;
  $  136.传输输入速度传感器电路短路低                                   $    $  s       $    $  ANS068.BYTE004  $  y=(x1*256+x2)*0.05;
  $  137.变速箱输入转速传感器性能                                       $    $  s       $    $  ANS069.BYTE004  $  y=(x1*256+x2)*0.00625;
  $  138.变速箱油温                                                     $    $          $    $  ANS070.BYTE004  $  y=x-40;
  $  139.热三级计数器上的传动油温度                                     $    $          $    $  ANS071.BYTE004  $  y=(x1*256+x2);
  $  140.变速器输出速度                                                 $    $  rpm     $    $  ANS072.BYTE004  $  y=(x1*256+x2)*0.125;
  $  141.间歇式变速器输出转速传感器电路                                 $    $  s       $    $  ANS073.BYTE004  $  y=(x1*256+x2)*0.05;
  $  142.变速箱输出转速传感器电路低电压                                 $    $          $    $  ANS074.BYTE004  $  y=x*0.05;
  $  143.传输输出速度传感器电路短路高                                   $    $  s       $    $  ANS075.BYTE004  $  y=(x1*256+x2)*0.05;
  $  144.传输输出速度传感器电路短路低                                   $    $  s       $    $  ANS076.BYTE004  $  y=(x1*256+x2)*0.05;
  $  145.传输PRNDL范围                                                  $    $          $    $  ANS077.BYTE004  $  if(x==0x00) y=@02bb;else if(x==0x01) y=@0003;else if(x==0x02) y=@029b;else if(x==0x04) y=@0001;else if(x==0x06) y=@02bc;else if(x==0x08) y=@02bd;else if(x==0x10) y=@02be;else if(x==0x20) y=@02bf;else if(x==0x40) y=@02c0;else if(x==0x80) y=@02c1;else if(x==0x81) y=@02c2;else if(x==0xFF) y=@01a9;else y=@0035;
  $  146.变速器轴转速传感器短路短路                                     $    $  s       $    $  ANS078.BYTE004  $  y=(x1*256+x2)*0.05;
  $  147.传动轴:速度传感器电路短路低                                    $    $  s       $    $  ANS079.BYTE004  $  y=(x1*256+x2)*0.05;
  $  148.传动轴B转速传感器短路短路高                                    $    $  s       $    $  ANS080.BYTE004  $  y=(x1*256+x2)*0.05;
  $  149.传动轴B速度传感器电路短路低                                    $    $  s       $    $  ANS081.BYTE004  $  y=(x1*256+x2)*0.05;
  $  150.传输符号滤波输出速度                                           $    $  rpm     $    $  ANS082.BYTE004  $  y=(x1*256+x2)*0.25;
  $  151.变速器上下开关失效                                             $    $          $    $  ANS083.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  152.变速器驱动变速控制                                             $    $          $    $  ANS083.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  153.选择目前电子传输范围                                           $    $          $    $  ANS083.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  154.传输电子范围选择有效                                           $    $          $    $  ANS083.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  155.传输分接开关有效                                               $    $          $    $  ANS083.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  156.有源开关                                                       $    $          $    $  ANS083.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  157.变速器主动变速控制                                             $    $          $    $  ANS083.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  158.传输抽头/下行开关2无效                                         $    $          $    $  ANS084.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  159.2有源开关                                                      $    $          $    $  ANS084.BYTE004  $  if(((x&0x06)>>1)==0) y=@000f;else if(((x&0x06)>>1)==1) y=@0028;else y=@0035;
  $  160.有源开关2                                                      $    $          $    $  ANS084.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  161.验证（命令）传输范围状态                                       $    $          $    $  ANS085.BYTE004  $  if(x==0x00) y=@02c1;else if(x==0x01) y=@02c0;else if(x==0x02) y=@02bf;else if(x==0x03) y=@02be;else if(x==0x04) y=@02bd;else if(x==0x05) y=@02bc;else if(x==0x06) y=@0001;else if(x==0x08) y=@0003;else if(x==0x09) y=@02c3;else if(x==0x0A) y=@02c4;else if(x==0x0B) y=@02c5;else if(x==0x0C) y=@02c6;else if(x==0x0D) y=@02c7;else if(x==0x0E) y=@02c8;else if(x==0x0F) y=@02c9;else if(x==0x10) y=@02ca;else if(x==0x11) y=@02c2;else y=@0035;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
