
    车型ID：1122

    模拟：协议模拟-->1122

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/20000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 D0 00 00 00 00       $%  ANS000:7E9 03 22 F1 D0 00 00 00 00
  $%  REQ001:7E1 03 22 29 36 00 00 00 00       $%  ANS001:7E9 03 22 29 36 00 00 00 00
  $%  REQ002:7E1 03 22 00 02 00 00 00 00       $%  ANS002:7E9 03 22 00 02 00 00 00 00
  $%  REQ003:7E1 03 22 F1 A0 00 00 00 00       $%  ANS003:7E9 03 22 F1 A0 00 00 00 00
  $%  REQ004:7E1 03 22 F1 83 00 00 00 00       $%  ANS004:7E9 03 22 F1 83 00 00 00 00
  $%  REQ005:7E1 03 22 F1 A1 00 00 00 00       $%  ANS005:7E9 03 22 F1 A1 00 00 00 00
  $%  REQ006:7E1 03 22 F1 91 00 00 00 00       $%  ANS006:7E9 03 22 F1 91 00 00 00 00
  $%  REQ007:7E1 03 22 F1 A2 00 00 00 00       $%  ANS007:7E9 03 22 F1 A2 00 00 00 00
  $%  REQ008:7E1 03 22 F1 87 00 00 00 00       $%  ANS008:7E9 03 22 F1 87 00 00 00 00
  $%  REQ009:7E1 03 22 20 4B 00 00 00 00       $%  ANS009:7E9 03 22 20 4B 00 00 00 00
  $%  REQ010:7E1 03 22 20 34 00 00 00 00       $%  ANS010:7E9 03 22 20 34 00 00 00 00
  $%  REQ011:7E1 03 22 12 E7 00 00 00 00       $%  ANS011:7E9 03 22 12 E7 00 00 00 00
  $%  REQ012:7E1 03 22 20 4A 00 00 00 00       $%  ANS012:7E9 03 22 20 4A 00 00 00 00
  $%  REQ013:7E1 03 22 F1 10 00 00 00 00       $%  ANS013:7E9 03 22 F1 10 00 00 00 00
  $%  REQ014:7E1 03 22 29 35 00 00 00 00       $%  ANS014:7E9 03 22 29 35 00 00 00 00
  $%  REQ015:7E1 03 22 20 39 00 00 00 00       $%  ANS015:7E9 03 22 20 39 00 00 00 00
  $%  REQ016:7E1 03 22 20 35 00 00 00 00       $%  ANS016:7E9 03 22 20 35 00 00 00 00
  $%  REQ017:7E1 03 22 20 3A 00 00 00 00       $%  ANS017:7E9 03 22 20 3A 00 00 00 00
  $%  REQ018:7E1 03 22 F1 D1 00 00 00 00       $%  ANS018:7E9 03 22 F1 D1 00 00 00 00
  $%  REQ019:7E1 03 22 F1 D2 00 00 00 00       $%  ANS019:7E9 03 22 F1 D2 00 00 00 00
  $%  REQ020:7E1 03 22 F1 D3 00 00 00 00       $%  ANS020:7E9 03 22 F1 D3 00 00 00 00
  $%  REQ021:7E1 03 22 F1 D4 00 00 00 00       $%  ANS021:7E9 03 22 F1 D4 00 00 00 00
  $%  REQ022:7E1 03 22 F1 92 00 00 00 00       $%  ANS022:7E9 03 22 F1 92 00 00 00 00
  $%  REQ023:7E1 03 22 F1 8C 00 00 00 00       $%  ANS023:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ024:7E1 03 22 F1 94 00 00 00 00       $%  ANS024:7E9 03 22 F1 94 00 00 00 00
  $%  REQ025:7E1 03 22 F1 8A 00 00 00 00       $%  ANS025:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ026:7E1 03 22 F1 90 00 00 00 00       $%  ANS026:7E9 03 22 F1 90 00 00 00 00
  $%  REQ027:7E1 03 22 F1 A8 00 00 00 00       $%  ANS027:7E9 03 22 F1 A8 00 00 00 00
  $%  REQ028:7E1 03 22 F1 8B 00 00 00 00       $%  ANS028:7E9 03 22 F1 8B 00 00 00 00

  $%  000:刷写软件零件号代码:                            $%    $%  ANS000.BYTE004  $%  ASCII(X1,X2);
  $%  001:指令换挡:                                      $%    $%  ANS001.BYTE004  $%  HEX(X1);
  $%  002:DTC所需的冻结帧存储:                           $%    $%  ANS002.BYTE004  $%  HEX(X1,X2);
  $%  003:电控单元应用软件号:                            $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元刷写软件参考号:                        $%    $%  ANS004.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  005:ECU校准软件编号:                               $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元硬件号:                                $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元网络参考号:                            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号:                                $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  009:主处理器之间的最大运行复位上电复位:            $%    $%  ANS009.BYTE004  $%  HEX(X1,X2);
  $%  010:主处理器内存故障源地址:                        $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  011:主处理器运行复位源地址历史1:                   $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  012:主处理器运行重置:                              $%    $%  ANS012.BYTE004  $%  HEX(X1,X2);
  $%  013:电控单元零件号(上次):                          $%    $%  ANS013.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  014:测试参考号（上次）:                            $%    $%  ANS013.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  015:里程读数（上次）KM:                            $%    $%  ANS013.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  016:上次换挡类型:                                  $%    $%  ANS014.BYTE004  $%  HEX(X1);
  $%  017:当前处理器的完整性故障原因代码（1-32）:        $%    $%  ANS015.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  018:处理器ROM故障源:                               $%    $%  ANS016.BYTE004  $%  HEX(X1);
  $%  019:当前处理器安全故障原因:                        $%    $%  ANS017.BYTE004  $%  HEX(X1,X2);
  $%  020:软件模块标识符代码01:                          $%    $%  ANS018.BYTE004  $%  ASCII(X1,X2);
  $%  021:软件模块标识符代码02:                          $%    $%  ANS019.BYTE004  $%  ASCII(X1,X2);
  $%  022:软件模块标识符代码03:                          $%    $%  ANS020.BYTE004  $%  ASCII(X1,X2);
  $%  023:软件模块标识符代码04:                          $%    $%  ANS021.BYTE004  $%  ASCII(X1,X2);
  $%  024:供应商电控单元硬件参考号:                      $%    $%  ANS022.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  025:供应商电控单元序列号:                          $%    $%  ANS023.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  026:供应商电控单元软件参考号:                      $%    $%  ANS024.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  027:系统供应商识别号:                              $%    $%  ANS025.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  028:VIN:                                           $%    $%  ANS026.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  029:车辆特征信息:                                  $%    $%  ANS027.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  030:电控单元制造日期:                              $%    $%  ANS028.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 28 10 00 00 00 00       $  ANS000:7E9 03 22 28 10 00 00 00 00
  $  REQ001:7E1 03 22 29 38 00 00 00 00       $  ANS001:7E9 03 22 29 38 00 00 00 00
  $  REQ002:7E1 03 22 F1 86 00 00 00 00       $  ANS002:7E9 03 22 F1 86 00 00 00 00
  $  REQ003:7E1 03 22 00 1E 00 00 00 00       $  ANS003:7E9 03 22 00 1E 00 00 00 00
  $  REQ004:7E1 03 22 F1 C0 00 00 00 00       $  ANS004:7E9 03 22 F1 C0 00 00 00 00
  $  REQ005:7E1 03 22 11 24 00 00 00 00       $  ANS005:7E9 03 22 11 24 00 00 00 00
  $  REQ006:7E1 03 22 28 62 00 00 00 00       $  ANS006:7E9 03 22 28 62 00 00 00 00
  $  REQ007:7E1 03 22 00 42 00 00 00 00       $  ANS007:7E9 03 22 00 42 00 00 00 00
  $  REQ008:7E1 03 22 3D 28 00 00 00 00       $  ANS008:7E9 03 22 3D 28 00 00 00 00
  $  REQ009:7E1 03 22 1A 01 00 00 00 00       $  ANS009:7E9 03 22 1A 01 00 00 00 00
  $  REQ010:7E1 03 22 1A 2D 00 00 00 00       $  ANS010:7E9 03 22 1A 2D 00 00 00 00
  $  REQ011:7E1 03 22 00 21 00 00 00 00       $  ANS011:7E9 03 22 00 21 00 00 00 00
  $  REQ012:7E1 03 22 00 31 00 00 00 00       $  ANS012:7E9 03 22 00 31 00 00 00 00
  $  REQ013:7E1 03 22 00 05 00 00 00 00       $  ANS013:7E9 03 22 00 05 00 00 00 00
  $  REQ014:7E1 03 22 00 0C 00 00 00 00       $  ANS014:7E9 03 22 00 0C 00 00 00 00
  $  REQ015:7E1 03 22 19 A1 00 00 00 00       $  ANS015:7E9 03 22 19 A1 00 00 00 00
  $  REQ016:7E1 03 22 11 41 00 00 00 00       $  ANS016:7E9 03 22 11 41 00 00 00 00
  $  REQ017:7E1 03 22 12 41 00 00 00 00       $  ANS017:7E9 03 22 12 41 00 00 00 00
  $  REQ018:7E1 03 22 F1 AA 00 00 00 00       $  ANS018:7E9 03 22 F1 AA 00 00 00 00
  $  REQ019:7E1 03 22 F2 45 00 00 00 00       $  ANS019:7E9 03 22 F2 45 00 00 00 00
  $  REQ020:7E1 03 22 00 0F 00 00 00 00       $  ANS020:7E9 03 22 00 0F 00 00 00 00
  $  REQ021:7E1 03 22 F1 E2 00 00 00 00       $  ANS021:7E9 03 22 F1 E2 00 00 00 00
  $  REQ022:7E1 03 22 20 33 00 00 00 00       $  ANS022:7E9 03 22 20 33 00 00 00 00
  $  REQ023:7E1 03 22 12 DE 00 00 00 00       $  ANS023:7E9 03 22 12 DE 00 00 00 00
  $  REQ024:7E1 03 22 C0 01 00 00 00 00       $  ANS024:7E9 03 22 C0 01 00 00 00 00
  $  REQ025:7E1 03 22 00 30 00 00 00 00       $  ANS025:7E9 03 22 00 30 00 00 00 00
  $  REQ026:7E1 03 22 F1 AB 00 00 00 00       $  ANS026:7E9 03 22 F1 AB 00 00 00 00
  $  REQ027:7E1 03 22 00 1C 00 00 00 00       $  ANS027:7E9 03 22 00 1C 00 00 00 00
  $  REQ028:7E1 03 22 12 40 00 00 00 00       $  ANS028:7E9 03 22 12 40 00 00 00 00
  $  REQ029:7E1 03 22 28 17 00 00 00 00       $  ANS029:7E9 03 22 28 17 00 00 00 00
  $  REQ030:7E1 03 22 28 18 00 00 00 00       $  ANS030:7E9 03 22 28 18 00 00 00 00
  $  REQ031:7E1 03 22 28 19 00 00 00 00       $  ANS031:7E9 03 22 28 19 00 00 00 00
  $  REQ032:7E1 03 22 28 1A 00 00 00 00       $  ANS032:7E9 03 22 28 1A 00 00 00 00
  $  REQ033:7E1 03 22 28 1B 00 00 00 00       $  ANS033:7E9 03 22 28 1B 00 00 00 00
  $  REQ034:7E1 03 22 28 11 00 00 00 00       $  ANS034:7E9 03 22 28 11 00 00 00 00
  $  REQ035:7E1 03 22 28 12 00 00 00 00       $  ANS035:7E9 03 22 28 12 00 00 00 00
  $  REQ036:7E1 03 22 28 13 00 00 00 00       $  ANS036:7E9 03 22 28 13 00 00 00 00
  $  REQ037:7E1 03 22 28 14 00 00 00 00       $  ANS037:7E9 03 22 28 14 00 00 00 00
  $  REQ038:7E1 03 22 28 15 00 00 00 00       $  ANS038:7E9 03 22 28 15 00 00 00 00
  $  REQ039:7E1 03 22 19 4F 00 00 00 00       $  ANS039:7E9 03 22 19 4F 00 00 00 00
  $  REQ040:7E1 03 22 AF FC 00 00 00 00       $  ANS040:7E9 03 22 AF FC 00 00 00 00
  $  REQ041:7E1 03 22 28 04 00 00 00 00       $  ANS041:7E9 03 22 28 04 00 00 00 00
  $  REQ042:7E1 03 22 28 1E 00 00 00 00       $  ANS042:7E9 03 22 28 1E 00 00 00 00
  $  REQ043:7E1 03 22 28 1F 00 00 00 00       $  ANS043:7E9 03 22 28 1F 00 00 00 00
  $  REQ044:7E1 03 22 F1 C1 00 00 00 00       $  ANS044:7E9 03 22 F1 C1 00 00 00 00
  $  REQ045:7E1 03 22 F1 C2 00 00 00 00       $  ANS045:7E9 03 22 F1 C2 00 00 00 00
  $  REQ046:7E1 03 22 F1 C3 00 00 00 00       $  ANS046:7E9 03 22 F1 C3 00 00 00 00
  $  REQ047:7E1 03 22 F1 C4 00 00 00 00       $  ANS047:7E9 03 22 F1 C4 00 00 00 00
  $  REQ048:7E1 03 22 AF FE 00 00 00 00       $  ANS048:7E9 03 22 AF FE 00 00 00 00
  $  REQ049:7E1 03 22 AF FD 00 00 00 00       $  ANS049:7E9 03 22 AF FD 00 00 00 00
  $  REQ050:7E1 03 22 AF FF 00 00 00 00       $  ANS050:7E9 03 22 AF FF 00 00 00 00
  $  REQ051:7E1 03 22 29 37 00 00 00 00       $  ANS051:7E9 03 22 29 37 00 00 00 00
  $  REQ052:7E1 03 22 28 16 00 00 00 00       $  ANS052:7E9 03 22 28 16 00 00 00 00
  $  REQ053:7E1 03 22 19 92 00 00 00 00       $  ANS053:7E9 03 22 19 92 00 00 00 00
  $  REQ054:7E1 03 22 00 1F 00 00 00 00       $  ANS054:7E9 03 22 00 1F 00 00 00 00
  $  REQ055:7E1 03 22 29 34 00 00 00 00       $  ANS055:7E9 03 22 29 34 00 00 00 00
  $  REQ056:7E1 03 22 29 33 00 00 00 00       $  ANS056:7E9 03 22 29 33 00 00 00 00
  $  REQ057:7E1 03 22 1A 18 00 00 00 00       $  ANS057:7E9 03 22 1A 18 00 00 00 00
  $  REQ058:7E1 03 22 28 1C 00 00 00 00       $  ANS058:7E9 03 22 28 1C 00 00 00 00
  $  REQ059:7E1 03 22 28 09 00 00 00 00       $  ANS059:7E9 03 22 28 09 00 00 00 00
  $  REQ060:7E1 03 22 19 91 00 00 00 00       $  ANS060:7E9 03 22 19 91 00 00 00 00
  $  REQ061:7E1 03 22 1A 26 00 00 00 00       $  ANS061:7E9 03 22 1A 26 00 00 00 00
  $  REQ062:7E1 03 22 28 0C 00 00 00 00       $  ANS062:7E9 03 22 28 0C 00 00 00 00
  $  REQ063:7E1 03 22 3D 30 00 00 00 00       $  ANS063:7E9 03 22 3D 30 00 00 00 00
  $  REQ064:7E1 03 22 19 5D 00 00 00 00       $  ANS064:7E9 03 22 19 5D 00 00 00 00
  $  REQ065:7E1 03 22 28 0F 00 00 00 00       $  ANS065:7E9 03 22 28 0F 00 00 00 00
  $  REQ066:7E1 03 22 1A 1F 00 00 00 00       $  ANS066:7E9 03 22 1A 1F 00 00 00 00
  $  REQ067:7E1 03 22 19 9A 00 00 00 00       $  ANS067:7E9 03 22 19 9A 00 00 00 00
  $  REQ068:7E1 03 22 28 0D 00 00 00 00       $  ANS068:7E9 03 22 28 0D 00 00 00 00
  $  REQ069:7E1 03 22 28 1D 00 00 00 00       $  ANS069:7E9 03 22 28 1D 00 00 00 00
  $  REQ070:7E1 03 22 28 21 00 00 00 00       $  ANS070:7E9 03 22 28 21 00 00 00 00
  $  REQ071:7E1 03 22 19 41 00 00 00 00       $  ANS071:7E9 03 22 19 41 00 00 00 00
  $  REQ072:7E1 03 22 19 40 00 00 00 00       $  ANS072:7E9 03 22 19 40 00 00 00 00
  $  REQ073:7E1 03 22 19 42 00 00 00 00       $  ANS073:7E9 03 22 19 42 00 00 00 00
  $  REQ074:7E1 03 22 28 20 00 00 00 00       $  ANS074:7E9 03 22 28 20 00 00 00 00
  $  REQ075:7E1 03 22 19 51 00 00 00 00       $  ANS075:7E9 03 22 19 51 00 00 00 00
  $  REQ076:7E1 03 22 19 7E 00 00 00 00       $  ANS076:7E9 03 22 19 7E 00 00 00 00
  $  REQ077:7E1 03 22 19 D4 00 00 00 00       $  ANS077:7E9 03 22 19 D4 00 00 00 00
  $  REQ078:7E1 03 22 00 0D 00 00 00 00       $  ANS078:7E9 03 22 00 0D 00 00 00 00

  $  000.加速器有效位置                                               $    $  %        $    $  ANS000.BYTE004  $  y=x*0.390625;
  $  001.蓄能器压力                                                   $    $  kPa      $    $  ANS001.BYTE004  $  y=((x1*256+x2)&0x7FFF)*0.0625;
  $  002.当前诊断模式                                                 $    $           $    $  ANS002.BYTE004  $  if((x&0x03)==1) y=@00ae;else if((x&0x03)==2) y=@00af;else if((x&0x03)==3) y=@00b0;else y=@0004;
  $  003.辅助输入状态-动力输出状态                                    $    $           $    $  ANS003.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00b2;else y=@0004;
  $  004.刷写软件零件号                                               $    $           $    $  ANS004.BYTE004  $  y=(x1*256+x2);
  $  005.制动踏板状态                                                 $    $           $    $  ANS005.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00b2;else y=@0004;
  $  006.计算传输线压力                                               $    $  kPa      $    $  ANS006.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  007.控制模块电压                                                 $    $  V        $    $  ANS007.BYTE004  $  y=(x1*256+x2)*0.001;
  $  008.控制器关闭触发器-打开开关                                    $    $           $    $  ANS008.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00b2;else y=@0004;
  $  009.控制器关闭触发器-立即                                        $    $           $    $  ANS008.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00b2;else y=@0004;
  $  010.液力变矩器变矩比                                             $    $           $    $  ANS009.BYTE004  $  y=(x1*256+x2)*0.00012207;
  $  011.输出发动机扭矩                                               $    $  Nm       $    $  ANS010.BYTE004  $  y=(x1*256+x2)*0.25;
  $  012.MIL激活时的行驶距离                                          $    $  km       $    $  ANS011.BYTE004  $  y=(x1*256+x2);
  $  013.清除故障码后行驶的距离                                       $    $  km       $    $  ANS012.BYTE004  $  y=(x1*256+x2);
  $  014.发动机制冷剂温度                                             $    $           $    $  ANS013.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  015.发动机转速                                                   $    $  rpm      $    $  ANS014.BYTE004  $  y=(x1*256+x2)*0.25;
  $  016.齿轮箱速比                                                   $    $           $    $  ANS015.BYTE004  $  y=x*0.01563;
  $  017.点火电压                                                     $    $  V        $    $  ANS016.BYTE004  $  y=x*0.1;
  $  018.点火状态                                                     $    $           $    $  ANS017.BYTE004  $  if((x&0x07)==0) y=@000f;else if((x&0x07)==1) y=@0010;else if((x&0x07)==2) y=@009d;else if((x&0x07)==3) y=@009e;else y=@0004;
  $  019.表示是否接收到排放相关功能模式#04并积极处理该点火循环       $    $           $    $  ANS018.BYTE004  $  if(x==1) y=@009f;else if(x==2) y=@00a0;else y=@0004;
  $  020.标识符输入输出控制-返回代码                                  $    $           $    $  ANS019.BYTE004  $  if(((x1*256+x2)&0x7FFF)==10241) y=@00a1;else if(((x1*256+x2)&0x7FFF)==10242) y=@00a2;else if(((x1*256+x2)&0x7FFF)==10243) y=@00a3;else if(((x1*256+x2)&0x7FFF)==10244) y=@00a4;else if(((x1*256+x2)&0x7FFF)==10245) y=@00a5;else if(((x1*256+x2)&0x7FFF)==1030) y=@00a6;else if(((x1*256+x2)&0x7FFF)==10499) y=@00a7;else if(((x1*256+x2)&0x7FFF)==10500) y=@00a8;else if(((x1*256+x2)&0x7FFF)==10501) y=@00a9;else if(((x1*256+x2)&0x7FFF)==15618) y=@00aa;else if(((x1*256+x2)&0x7FFF)==16386) y=@00ab;else y=@0004;
  $  021.进气温度                                                     $    $           $    $  ANS020.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  022.写MEC-制造商使能计数器                                       $    $           $    $  ANS021.BYTE004  $  y=x;
  $  023.主处理器Nvm(非易失性存储器)故障状态-静止状态                 $    $           $    $  ANS022.BYTE004  $  if(((x&0xC0)>>6)==1) y=@00ac;else if(((x&0xC0)>>6)==3) y=@00ad;else y=@0004;
  $  024.主处理器Nvm(非易失性存储器)故障状态-累积状态                 $    $           $    $  ANS022.BYTE004  $  if(((x&0x30)>>4)==1) y=@00ac;else if(((x&0x30)>>4)==3) y=@00ad;else y=@0004;
  $  025.主处理器Nvm(非易失性存储器)故障状态-可适应状态               $    $           $    $  ANS022.BYTE004  $  if(((x&0x0C)>>2)==1) y=@00ac;else if(((x&0x0C)>>2)==3) y=@00ad;else y=@0004;
  $  026.主处理器Nvm(非易失性存储器)故障状态-静态最初校核状态         $    $           $    $  ANS022.BYTE004  $  if((x&0x03)==1) y=@00ac;else if((x&0x03)==3) y=@00ad;else y=@0004;
  $  027.主处理器Nvm(非易失性存储器)故障状态-累积最初校核状态         $    $           $    $  ANS022.BYTE005  $  if(((x&0xC0)>>6)==1) y=@00ac;else if(((x&0xC0)>>6)==3) y=@00ad;else y=@0004;
  $  028.主处理器Nvm(非易失性存储器)故障状态-可适应最初校核状态       $    $           $    $  ANS022.BYTE005  $  if(((x&0x30)>>4)==1) y=@00ac;else if(((x&0x30)>>4)==3) y=@00ad;else y=@0004;
  $  029.主处理器复位来源                                             $    $           $    $  ANS023.BYTE004  $  if(x==0) y=@00bc;else if(x==2) y=@00bd;else if(x==3) y=@00be;else if(x==4) y=@00bf;else y=@0004;
  $  030.网络配置-ABS                                                 $    $           $    $  ANS024.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00b2;else y=@0004;
  $  031.网络配置-ATS                                                 $    $           $    $  ANS024.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00b2;else y=@0004;
  $  032.网络配置-TCCM                                                $    $           $    $  ANS024.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00b2;else y=@0004;
  $  033.清除故障码后暖机次数                                         $    $           $    $  ANS025.BYTE004  $  y=x;
  $  034.达到控制器关闭逻辑结束的次数                                 $    $           $    $  ANS026.BYTE004  $  y=(x1*256+x2);
  $  035.OBD要求的车辆或发动机的认证                                  $    $           $    $  ANS027.BYTE004  $  if(x==0x01) y=@00c0;else if(x==0x02) y=@00c1;else if(x==0x03) y=@00c2;else if(x==0x04) y=@00c3;else if(x==0x05) y=@00c4;else if(x==0x06) y=@00c5;else if(x==0x07) y=@00c6;else if(x==0x08) y=@00c7;else if(x==0x09) y=@00c8;else y=@0004;
  $  036.里程表                                                       $    $  km       $    $  ANS028.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.01562;
  $  037.压力控制电磁阀1指令压力                                      $    $  kPa      $    $  ANS029.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  038.压力控制电磁阀2指令压力                                      $    $  kPa      $    $  ANS030.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  039.压力控制电磁阀3指令压力                                      $    $  kPa      $    $  ANS031.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  040.压力控制电磁阀4指令压力                                      $    $  kPa      $    $  ANS032.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  041.压力控制电磁阀5指令压力                                      $    $  kPa      $    $  ANS033.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  042.压力电磁阀1：卡滞在低状态                                    $    $           $    $  ANS034.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  043.压力电磁阀1：卡滞在高状态                                    $    $           $    $  ANS034.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  044.压力电磁阀1：合理状态                                        $    $           $    $  ANS034.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  045.压力电磁阀2：卡滞在低状态                                    $    $           $    $  ANS035.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  046.压力电磁阀2：卡滞在高状态                                    $    $           $    $  ANS035.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  047.压力电磁阀2：合理状态                                        $    $           $    $  ANS035.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  048.压力电磁阀3：卡滞在低状态                                    $    $           $    $  ANS036.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  049.压力电磁阀3：卡滞在高状态                                    $    $           $    $  ANS036.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  050.压力电磁阀3：合理状态                                        $    $           $    $  ANS036.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  051.压力电磁阀4：卡滞在低状态                                    $    $           $    $  ANS037.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  052.压力电磁阀4：卡滞在高状态                                    $    $           $    $  ANS037.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  053.压力电磁阀4：合理状态                                        $    $           $    $  ANS037.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  054.压力电磁阀5：卡滞在低状态                                    $    $           $    $  ANS038.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  055.压力电磁阀5：卡滞在高状态                                    $    $           $    $  ANS038.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  056.压力电磁阀5：合理状态                                        $    $           $    $  ANS038.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  057.换挡杆位置                                                   $    $           $    $  ANS039.BYTE004  $  if(x==0) y=@0004;else if(x==1) y=@00b4;else if(x==2) y=@00b5;else if(x==4) y=@0001;else if(x==6) y=@00b6;else y=@0004;
  $  058.刷写次数                                                     $    $           $    $  ANS040.BYTE004  $  y=(x1*256+x2);
  $  059.共享高侧驱动1控制电路：高测驱动                              $    $           $    $  ANS041.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00b2;else y=@0004;
  $  060.共享高侧驱动1控制电路：预留                                  $    $           $    $  ANS041.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00b2;else y=@0004;
  $  061.共享高侧驱动1控制电路：对地短路                              $    $           $    $  ANS041.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00b2;else y=@0004;
  $  062.共享高侧驱动1控制电路：开路                                  $    $           $    $  ANS041.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00b2;else y=@0004;
  $  063.共享高侧驱动1控制电路：对电源短路                            $    $           $    $  ANS041.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00b2;else y=@0004;
  $  064.换挡电磁阀1：卡滞在低状态                                    $    $           $    $  ANS042.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  065.换挡电磁阀1：卡滞在高状态                                    $    $           $    $  ANS042.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  066.换挡电磁阀1：合理状态                                        $    $           $    $  ANS042.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  067.换挡电磁阀2：卡滞在低状态                                    $    $           $    $  ANS043.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  068.换挡电磁阀2：卡滞在高状态                                    $    $           $    $  ANS043.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  069.换挡电磁阀2：合理状态                                        $    $           $    $  ANS043.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  070.软件模块标识符01                                             $    $           $    $  ANS044.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  071.软件模块标识符02                                             $    $           $    $  ANS045.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  072.软件模块标识符03                                             $    $           $    $  ANS046.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  073.软件模块标识符04                                             $    $           $    $  ANS047.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  074.软件兼容性状态-标定应用兼容                                  $    $           $    $  ANS048.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b7;else if(((x&0x02)>>1)==1) y=@00b8;else y=@0004;
  $  075.软件兼容性状态-应用底层兼容                                  $    $           $    $  ANS048.BYTE004  $  if((x&0x01)==0) y=@00b7;else if((x&0x01)==1) y=@00b8;else y=@0004;
  $  076.软件完整性状态-标定存在状态                                  $    $           $    $  ANS049.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b9;else if(((x&0x02)>>1)==1) y=@00ba;else y=@0004;
  $  077.软件完整性状态-程序存在状态                                  $    $           $    $  ANS049.BYTE004  $  if((x&0x01)==0) y=@00b9;else if((x&0x01)==1) y=@00ba;else y=@0004;
  $  078.软件有效性标记                                               $    $           $    $  ANS050.BYTE004  $  if((x&0x01)==0) y=@00b3;else if((x&0x01)==1) y=@00bb;else y=@0004;
  $  079.发动机状态                                                   $    $           $    $  ANS051.BYTE004  $  if(x==0) y=@0077;else if(x==1) y=@0078;else if(x==2) y=@0079;else if(x==3) y=@007a;else if(x==4) y=@007b;else if(x==5) y=@007c;else if(x==6) y=@007d;else y=@0004;
  $  080.蓄能器电磁阀状态                                             $    $           $    $  ANS051.BYTE005  $  if(x==0) y=@007e;else if(x==1) y=@007f;else if(x==2) y=@0080;else y=@0004;
  $  081.变速器电磁阀打开请求                                         $    $           $    $  ANS051.BYTE006  $  if(x==0) y=@0081;else if(x==1) y=@0082;else y=@0004;
  $  082.变速器启动准备                                               $    $           $    $  ANS051.BYTE007  $  if(x==0) y=@0083;else if(x==1) y=@0084;else y=@0004;
  $  083.变速器当前状态                                               $    $           $    $  ANS051.BYTE008  $  if(x==0) y=@0004;else if(x==1) y=@0085;else if(x==2) y=@0086;else if(x==3) y=@0087;else if(x==4) y=@0088;else if(x==5) y=@0089;else if(x==6) y=@008a;else if(x==7) y=@008b;else y=@0004;
  $  084.蓄能器值                                                     $    $           $    $  ANS051.BYTE009  $  if(x==0) y=@008c;else if(x==1) y=@008d;else if(x==2) y=@008e;else y=@0004;
  $  085.当前激活错误                                                 $    $           $    $  ANS051.BYTE010  $  if(x==0) y=@0004;else if(x==1) y=@008f;else if(x==2) y=@0090;else if(x==3) y=@0091;else if(x==4) y=@0092;else if(x==5) y=@0093;else if(x==6) y=@0094;else if(x==7) y=@0095;else if(x==8) y=@0096;else y=@0004;
  $  086.TCC压力控制电磁阀输出状态：卡滞在低状态                      $    $           $    $  ANS052.BYTE004  $  if(((x&0x30)>>4)==0) y=@0096;else if(((x&0x30)>>4)==1) y=@00b3;else if(((x&0x30)>>4)==2) y=@00ac;else y=@0004;
  $  087.TCC压力控制电磁阀输出状态：卡滞在高状态                      $    $           $    $  ANS052.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0096;else if(((x&0x0C)>>2)==1) y=@00b3;else if(((x&0x0C)>>2)==2) y=@00ac;else y=@0004;
  $  088.TCC压力控制电磁阀输出状态：合理状态                          $    $           $    $  ANS052.BYTE004  $  if((x&0x03)==0) y=@0096;else if((x&0x03)==1) y=@00b3;else if((x&0x03)==2) y=@00ac;else y=@0004;
  $  089.最新升档时间                                                 $    $  s        $    $  ANS053.BYTE004  $  y=x*0.025;
  $  090.发动机起动后的时间                                           $    $  s        $    $  ANS054.BYTE004  $  y=(x1*256+x2);
  $  091.换挡时间                                                     $    $  s        $    $  ANS055.BYTE004  $  y=(x1*256+x2)*0.00625;
  $  092.换挡完成时间                                                 $    $  s        $    $  ANS056.BYTE004  $  y=(x1*256+x2)*0.00625;
  $  093.液力变矩器离合器压力                                         $    $  kPa      $    $  ANS057.BYTE004  $  y=(x1*256+x2)*4;
  $  094.液力变矩器离合器压力控制电磁阀控制压力                       $    $  kPa      $    $  ANS058.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  095.液力变矩器离合器参照滑膜                                     $    $  rpm      $    $  ANS059.BYTE004  $  y=(x1*256+x2)*0.125;
  $  096.液力变扭器离合器滑膜                                         $    $  rpm      $    $  ANS060.BYTE004  $  y=(x1*256+x2)*0.125;
  $  097.液力变扭器离合器滑膜故障                                     $    $  rpm      $    $  ANS061.BYTE004  $  y=(x1*256+x2)*0.125;
  $  098.液力变矩器离合器状态                                         $    $           $    $  ANS062.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00b2;else y=@0004;
  $  099.液力变矩器离合器系统，齿轮及适应-变速器的传动齿轮            $    $           $    $  ANS063.BYTE004  $  if(((x&0xE0)>>5)==0) y=@0004;else if(((x&0xE0)>>5)==1) y=@0058;else if(((x&0xE0)>>5)==2) y=@0059;else if(((x&0xE0)>>5)==3) y=@005a;else if(((x&0xE0)>>5)==4) y=@005b;else if(((x&0xE0)>>5)==5) y=@005c;else if(((x&0xE0)>>5)==6) y=@005d;else y=@0004;
  $  100.液力变矩器离合器系统，齿轮及适应-变矩器离合器控制            $    $           $    $  ANS063.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00b2;else y=@0004;
  $  101.液力变矩器离合器系统，齿轮及适应-复位调节                    $    $           $    $  ANS063.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00b2;else y=@0004;
  $  102.传输比                                                       $    $           $    $  ANS064.BYTE004  $  y=(x1*256+x2)*0.000244241;
  $  103.变速器基本模式                                               $    $           $    $  ANS065.BYTE004  $  if(x==0x00) y=@005e;else if(x==0x01) y=@005f;else if(x==0x02) y=@0060;else if(x==0x03) y=@0061;else if(x==0x04) y=@0062;else if(x==0x05) y=@0063;else if(x==0x06) y=@0064;else if(x==0x07) y=@0065;else if(x==0x08) y=@0066;else if(x==0x09) y=@0067;else if(x==0x0A) y=@0068;else if(x==0x0B) y=@0069;else if(x==0x0C) y=@006a;else if(x==0x0D) y=@006b;else if(x==0x0E) y=@006c;else if(x==0x0F) y=@006d;else if(x==0x10) y=@006e;else y=@0004;
  $  104.变速器内部离合器滑膜                                         $    $  kPa      $    $  ANS066.BYTE004  $  y=(x1*256+x2)*0.125;
  $  105.变速箱档位                                                   $    $           $    $  ANS067.BYTE004  $  if(x==1) y=@006f;else if(x==2) y=@0070;else if(x==3) y=@0071;else if(x==4) y=@0072;else if(x==5) y=@0073;else y=@0074;
  $  106.变速器控制模块温度                                           $    $           $    $  ANS068.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  107.变速箱液压开关状态-开关1                                     $    $           $    $  ANS069.BYTE004  $  if(((x&0x80)>>7)==0) y=@0075;else if(((x&0x80)>>7)==1) y=@0076;else y=@0004;
  $  108.变速箱液压开关状态-开关2                                     $    $           $    $  ANS069.BYTE004  $  if(((x&0x40)>>6)==0) y=@0075;else if(((x&0x40)>>6)==1) y=@0076;else y=@0004;
  $  109.变速箱液压开关状态-开关3                                     $    $           $    $  ANS069.BYTE004  $  if(((x&0x20)>>5)==0) y=@0075;else if(((x&0x20)>>5)==1) y=@0076;else y=@0004;
  $  110.变速箱液压开关状态-开关4                                     $    $           $    $  ANS069.BYTE004  $  if(((x&0x10)>>4)==0) y=@0075;else if(((x&0x10)>>4)==1) y=@0076;else y=@0004;
  $  111.变速器满油压力                                               $    $  kPa      $    $  ANS070.BYTE004  $  y=(x1*256+x2)*0.125;
  $  112.变速器输入转速                                               $    $  rpm      $    $  ANS071.BYTE004  $  y=(x1*256+x2)*0.125;
  $  113.变速器油温度                                                 $    $           $    $  ANS072.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  114.变速器输出转速                                               $    $  rpm      $    $  ANS073.BYTE004  $  y=(x1*256+x2)*0.125;
  $  115.变速器即将选择的离合器                                       $    $           $    $  ANS074.BYTE004  $  if(x==1) y=@0097;else if(x==2) y=@0098;else if(x==3) y=@0099;else if(x==4) y=@009a;else if(x==5) y=@009b;else if(x==6) y=@009c;else y=@0004;
  $  116.变速器范围：档位位置PRNDL 非法                               $    $           $    $  ANS075.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00b2;else y=@0004;
  $  117.变速器范围：PRNDL P                                          $    $           $    $  ANS075.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00b2;else y=@0004;
  $  118.变速器范围：PRNDL C                                          $    $           $    $  ANS075.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00b2;else y=@0004;
  $  119.变速器范围：PRNDL B                                          $    $           $    $  ANS075.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00b2;else y=@0004;
  $  120.变速器范围：PRNDL A                                          $    $           $    $  ANS075.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00b2;else y=@0004;
  $  121.变速器范围：PSM压力开关歧管 C                                $    $           $    $  ANS075.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00b2;else y=@0004;
  $  122.变速器范围：PSM压力开关歧管 B                                $    $           $    $  ANS075.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00b2;else y=@0004;
  $  123.变速器范围：PSM压力开关歧管 A                                $    $           $    $  ANS075.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00b2;else y=@0004;
  $  124.变速器手动模式升档/降档 非正常切换状态                       $    $           $    $  ANS076.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00b2;else y=@0004;
  $  125.变速器手动模式升档/降档 驱动换挡控制（DSC）模式状态          $    $           $    $  ANS076.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00b2;else y=@0004;
  $  126.变速器手动模式升档/降档 电子选换挡操作状态                   $    $           $    $  ANS076.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00b2;else y=@0004;
  $  127.变速器手动模式升档/降档 倒档状态                             $    $           $    $  ANS076.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00b2;else y=@0004;
  $  128.变速器手动模式升档/降档 手动加减档操作状态                   $    $           $    $  ANS076.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00b2;else y=@0004;
  $  129.变速器手动模式升档/降档 档位递减状态                         $    $           $    $  ANS076.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00b2;else y=@0004;
  $  130.变速器杆上升/下降状态-增加开关                               $    $           $    $  ANS076.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00b2;else y=@0004;
  $  131.变速器手动模式升档/降档 加减档模式切换状态                   $    $           $    $  ANS076.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00b2;else y=@0004;
  $  132.涡轮转速                                                     $    $  rpm      $    $  ANS077.BYTE004  $  y=(x1*256+x2)*0.125;
  $  133.车速                                                         $    $  km/h     $    $  ANS078.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
