
    车型ID：1123

    模拟：协议模拟-->1123

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:7A0 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 80 00 00 00 00 00       $!  ANS000:7A0 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:7A0 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/21000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:7A0 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 A0 00 00 00 00       $%  ANS000:7A0 03 22 F1 A0 00 00 00 00
  $%  REQ001:720 03 22 F1 83 00 00 00 00       $%  ANS001:7A0 03 22 F1 83 00 00 00 00
  $%  REQ002:720 03 22 F1 A1 00 00 00 00       $%  ANS002:7A0 03 22 F1 A1 00 00 00 00
  $%  REQ003:720 03 22 F1 91 00 00 00 00       $%  ANS003:7A0 03 22 F1 91 00 00 00 00
  $%  REQ004:720 03 22 F1 8B 00 00 00 00       $%  ANS004:7A0 03 22 F1 8B 00 00 00 00
  $%  REQ005:720 03 22 F1 A2 00 00 00 00       $%  ANS005:7A0 03 22 F1 A2 00 00 00 00
  $%  REQ006:720 03 22 F1 87 00 00 00 00       $%  ANS006:7A0 03 22 F1 87 00 00 00 00
  $%  REQ007:720 03 22 F1 10 00 00 00 00       $%  ANS007:7A0 03 22 F1 10 00 00 00 00
  $%  REQ008:720 03 22 DA DA 00 00 00 00       $%  ANS008:7A0 03 22 DA DA 00 00 00 00
  $%  REQ009:720 03 22 F1 92 00 00 00 00       $%  ANS009:7A0 03 22 F1 92 00 00 00 00
  $%  REQ010:720 03 22 F1 8C 00 00 00 00       $%  ANS010:7A0 03 22 F1 8C 00 00 00 00
  $%  REQ011:720 03 22 F1 94 00 00 00 00       $%  ANS011:7A0 03 22 F1 94 00 00 00 00
  $%  REQ012:720 03 22 F1 8A 00 00 00 00       $%  ANS012:7A0 03 22 F1 8A 00 00 00 00
  $%  REQ013:720 03 22 F0 1D 00 00 00 00       $%  ANS013:7A0 03 22 F0 1D 00 00 00 00
  $%  REQ014:720 03 22 F1 90 00 00 00 00       $%  ANS014:7A0 03 22 F1 90 00 00 00 00
  $%  REQ015:720 03 22 F1 A8 00 00 00 00       $%  ANS015:7A0 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元校准软件编号1:           $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元校准软件编号3:           $%    $%  ANS002.BYTE010  $%  ASCII(X1,X2);
  $%  004:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元制造日期:                $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3);
  $%  006:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次):                  $%    $%  ANS007.BYTE015  $%  HEX(X1,X2,X3);
  $%  011:软件释放日期:                    $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  012:供应商电控单元硬件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  013:产品序列号:                      $%    $%  ANS010.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  014:产品线号:                        $%    $%  ANS010.BYTE009  $%  ASCII(X1,X2);
  $%  015:年:                              $%    $%  ANS010.BYTE011  $%  HEX(X1,X2,X3);
  $%  016:供应商电控单元软件参考号:        $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  017:系统供应商标识号:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  018:UAES电子标签1:                   $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6);
  $%  019:UAES电子标签2:                   $%    $%  ANS013.BYTE010  $%  HEX(X1,X2,X3,X4,X5);
  $%  020:UAES电子标签3:                   $%    $%  ANS013.BYTE015  $%  ASCII(X1,X2,X3,X4,X5);
  $%  021:UAES电子标签4:                   $%    $%  ANS013.BYTE020  $%  HEX(X1,X2,X3,X4);
  $%  022:车辆识别代码:                    $%    $%  ANS014.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  023:车辆特征信息:                    $%    $%  ANS015.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:720 03 22 D1 01 00 00 00 00       $  ANS000:7A0 03 22 D1 01 00 00 00 00
  $  REQ001:720 03 22 D1 02 00 00 00 00       $  ANS001:7A0 03 22 D1 02 00 00 00 00
  $  REQ002:720 03 22 D1 11 00 00 00 00       $  ANS002:7A0 03 22 D1 11 00 00 00 00
  $  REQ003:720 03 22 E1 01 00 00 00 00       $  ANS003:7A0 03 22 E1 01 00 00 00 00
  $  REQ004:720 03 22 E1 02 00 00 00 00       $  ANS004:7A0 03 22 E1 02 00 00 00 00
  $  REQ005:720 03 22 D1 12 00 00 00 00       $  ANS005:7A0 03 22 D1 12 00 00 00 00
  $  REQ006:720 03 22 E1 11 00 00 00 00       $  ANS006:7A0 03 22 E1 11 00 00 00 00
  $  REQ007:720 03 22 E1 12 00 00 00 00       $  ANS007:7A0 03 22 E1 12 00 00 00 00
  $  REQ008:720 03 22 C1 00 00 00 00 00       $  ANS008:7A0 03 22 C1 00 00 00 00 00
  $  REQ009:720 03 22 C1 01 00 00 00 00       $  ANS009:7A0 03 22 C1 01 00 00 00 00
  $  REQ010:720 03 22 C1 02 00 00 00 00       $  ANS010:7A0 03 22 C1 02 00 00 00 00
  $  REQ011:720 03 22 C1 22 00 00 00 00       $  ANS011:7A0 03 22 C1 22 00 00 00 00
  $  REQ012:720 03 22 C1 23 00 00 00 00       $  ANS012:7A0 03 22 C1 23 00 00 00 00
  $  REQ013:720 03 22 C1 24 00 00 00 00       $  ANS013:7A0 03 22 C1 24 00 00 00 00

  $  000.尾门后背板开关                             $    $        $    $  ANS000.BYTE004  $  if(((x&0x80)>>7)==0) y=@0264;else if(((x&0x80)>>7)==1) y=@0265;else y=@0035;
  $  001.尾门开度模式选择开关                       $    $        $    $  ANS000.BYTE004  $  if(((x&0x40)>>6)==0) y=@0044;else if(((x&0x40)>>6)==1) y=@0045;else y=@0035;
  $  002.驾驶舱尾门操作开关                         $    $        $    $  ANS000.BYTE004  $  if(((x&0x20)>>5)==0) y=@0264;else if(((x&0x20)>>5)==1) y=@0265;else y=@0035;
  $  003.基本锁锁体的门微开开关                     $    $        $    $  ANS001.BYTE004  $  if(((x&0x80)>>7)==0) y=@0264;else if(((x&0x80)>>7)==1) y=@0265;else y=@0035;
  $  004.基本锁锁体的棘爪开关                       $    $        $    $  ANS001.BYTE004  $  if(((x&0x40)>>6)==0) y=@0264;else if(((x&0x40)>>6)==1) y=@0265;else y=@0035;
  $  005.自吸锁的释放开关                           $    $        $    $  ANS001.BYTE004  $  if(((x&0x20)>>5)==0) y=@0264;else if(((x&0x20)>>5)==1) y=@0265;else y=@0035;
  $  006.自吸锁的吸合开关                           $    $        $    $  ANS001.BYTE004  $  if(((x&0x10)>>4)==0) y=@0264;else if(((x&0x10)>>4)==1) y=@0265;else y=@0035;
  $  007.自吸锁端子A继电器驱动输出                  $    $        $    $  ANS002.BYTE004  $  if(((x&0x80)>>7)==0) y=@0046;else if(((x&0x80)>>7)==1) y=@0047;else y=@0035;
  $  008.自吸锁端子B继电器驱动输出                  $    $        $    $  ANS002.BYTE004  $  if(((x&0x40)>>6)==0) y=@0046;else if(((x&0x40)>>6)==1) y=@0047;else y=@0035;
  $  009.基本锁继电器驱动输出                       $    $        $    $  ANS002.BYTE004  $  if(((x&0x20)>>5)==0) y=@0046;else if(((x&0x20)>>5)==1) y=@0047;else y=@0035;
  $  010.左侧防夹条分压AD值                         $    $        $    $  ANS003.BYTE004  $  y=(x1*256+x2)/64;
  $  011.右侧防夹条分压AD值                         $    $        $    $  ANS003.BYTE006  $  y=(x1*256+x2)/64;
  $  012.左侧霍尔主信号100ms内脉冲数                $    $        $    $  ANS004.BYTE004  $  y=x;
  $  013.左侧霍尔传感器信号方向                     $    $        $    $  ANS004.BYTE005  $  y=x;
  $  014.右侧霍尔主信号100ms内脉冲数                $    $        $    $  ANS004.BYTE006  $  y=x;
  $  015.右侧霍尔传感器信号方向                     $    $        $    $  ANS004.BYTE007  $  y=x;
  $  016.左侧霍尔副信号高低值                       $    $        $    $  ANS004.BYTE008  $  y=x;
  $  017.右侧霍尔副信号高低值                       $    $        $    $  ANS004.BYTE009  $  y=x;
  $  018.给电撑杆供电的KL30继电器控制               $    $        $    $  ANS005.BYTE004  $  if(((x&0x80)>>7)==0) y=@0046;else if(((x&0x80)>>7)==1) y=@0047;else y=@0035;
  $  019.Break继电器的控制                          $    $        $    $  ANS005.BYTE004  $  if(((x&0x40)>>6)==0) y=@0048;else if(((x&0x40)>>6)==1) y=@0049;else y=@0035;
  $  020.分流控制                                   $    $        $    $  ANS005.BYTE004  $  if(((x&0x20)>>5)==0) y=@0036;else if(((x&0x20)>>5)==1) y=@0037;else y=@0035;
  $  021.左侧电撑杆PWM占空比                        $    $  %     $    $  ANS006.BYTE004  $  y=x;
  $  022.左侧撑杆端子A继电器驱动输出                $    $        $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0) y=@0038;else y=@0039;
  $  023.左侧撑杆端子B继电器驱动输出                $    $        $    $  ANS006.BYTE005  $  if(((x&0x40)>>6)==0) y=@0039;else y=@0038;
  $  024.右侧电撑杆PWM占空比                        $    $  %     $    $  ANS007.BYTE004  $  y=x;
  $  025.右侧撑杆端子A继电器驱动输出                $    $        $    $  ANS007.BYTE005  $  if(((x&0x80)>>7)==0) y=@0038;else y=@0039;
  $  026.右侧撑杆端子B继电器驱动输出                $    $        $    $  ANS007.BYTE005  $  if(((x&0x40)>>6)==0) y=@0039;else y=@0038;
  $  027.变速器配置                                 $    $        $    $  ANS008.BYTE004  $  if(((x&0x20)>>5)==0) y=@003a;else if(((x&0x20)>>5)==1) y=@003b;else y=@0035;
  $  028.PEPS配置                                   $    $        $    $  ANS008.BYTE004  $  if(((x&0x10)>>4)==0) y=@003c;else if(((x&0x10)>>4)==1) y=@003d;else y=@0035;
  $  029.随动关门使能                               $    $        $    $  ANS008.BYTE004  $  if((x&0x01)==0) y=@003e;else if((x&0x01)==1) y=@003f;else y=@0035;
  $  030.无网络环境配置                             $    $        $    $  ANS009.BYTE004  $  if(((x&0x80)>>7)==0) y=@0040;else if(((x&0x80)>>7)==1) y=@0041;else y=@0035;
  $  031.调试报文配置                               $    $        $    $  ANS009.BYTE004  $  if(((x&0x40)>>6)==0) y=@0042;else if(((x&0x40)>>6)==1) y=@0043;else y=@0035;
  $  032.禁止电撑杆热保护                           $    $        $    $  ANS009.BYTE004  $  if(((x&0x20)>>5)==0) y=@003f;else if(((x&0x20)>>5)==1) y=@003e;else y=@0035;
  $  033.禁止自吸锁热保护                           $    $        $    $  ANS009.BYTE004  $  if(((x&0x10)>>4)==0) y=@003f;else if(((x&0x10)>>4)==1) y=@003e;else y=@0035;
  $  034.手动/电动（主开关）使能                    $    $        $    $  ANS009.BYTE004  $  if(((x&0x02)>>1)==0) y=@003e;else if(((x&0x02)>>1)==1) y=@003f;else y=@0035;
  $  035.B1611TGC功率低的DTC配置                    $    $        $    $  ANS010.BYTE004  $  if(((x&0x80)>>7)==0) y=@003e;else if(((x&0x80)>>7)==1) y=@003f;else y=@0035;
  $  036.B1612 TGC功率高的DTC配置                   $    $        $    $  ANS010.BYTE004  $  if(((x&0x40)>>6)==0) y=@003e;else if(((x&0x40)>>6)==1) y=@003f;else y=@0035;
  $  037.U1021 TGC CAN总线关闭的DTC配置             $    $        $    $  ANS010.BYTE004  $  if(((x&0x20)>>5)==0) y=@003e;else if(((x&0x20)>>5)==1) y=@003f;else y=@0035;
  $  038.UB122从BCM丢失消息的DTC配置                $    $        $    $  ANS010.BYTE004  $  if(((x&0x10)>>4)==0) y=@003e;else if(((x&0x10)>>4)==1) y=@003f;else y=@0035;
  $  039.UP123从PEPS丢失消息的DTC配置               $    $        $    $  ANS010.BYTE004  $  if(((x&0x08)>>3)==0) y=@003e;else if(((x&0x08)>>3)==1) y=@003f;else y=@0035;
  $  040.U1124从GW_ABS_ESP中丢失消息的DTC配置       $    $        $    $  ANS010.BYTE004  $  if(((x&0x04)>>2)==0) y=@003e;else if(((x&0x04)>>2)==1) y=@003f;else y=@0035;
  $  041.U1125从GW_TCU中丢失消息的DTC配置           $    $        $    $  ANS010.BYTE004  $  if(((x&0x02)>>1)==0) y=@003e;else if(((x&0x02)>>1)==1) y=@003f;else y=@0035;
  $  042.U1126从HVAC丢失消息的DTC配置               $    $        $    $  ANS010.BYTE004  $  if((x&0x01)==0) y=@003e;else if((x&0x01)==1) y=@003f;else y=@0035;
  $  043.U1127从GW_IPK丢失消息的DTC配置             $    $        $    $  ANS010.BYTE005  $  if(((x&0x80)>>7)==0) y=@003e;else if(((x&0x80)>>7)==1) y=@003f;else y=@0035;
  $  044.B1631主轴电机电池短路的DTC配置             $    $        $    $  ANS010.BYTE005  $  if(((x&0x40)>>6)==0) y=@003e;else if(((x&0x40)>>6)==1) y=@003f;else y=@0035;
  $  045.B1632主轴电机短接地面的DTC配置             $    $        $    $  ANS010.BYTE005  $  if(((x&0x20)>>5)==0) y=@003e;else if(((x&0x20)>>5)==1) y=@003f;else y=@0035;
  $  046.B1633主轴电机开负荷的DTC配置               $    $        $    $  ANS010.BYTE005  $  if(((x&0x10)>>4)==0) y=@003e;else if(((x&0x10)>>4)==1) y=@003f;else y=@0035;
  $  047.B1641型电机电池短路的DTC配置               $    $        $    $  ANS010.BYTE005  $  if(((x&0x08)>>3)==0) y=@003e;else if(((x&0x08)>>3)==1) y=@003f;else y=@0035;
  $  048.B1647基本锁存解锁失败的DTC配置             $    $        $    $  ANS010.BYTE005  $  if(((x&0x04)>>2)==0) y=@003e;else if(((x&0x04)>>2)==1) y=@003f;else y=@0035;
  $  049.B1648自吸锁锁紧失败的DTC配置               $    $        $    $  ANS010.BYTE005  $  if(((x&0x02)>>1)==0) y=@003e;else if(((x&0x02)>>1)==1) y=@003f;else y=@0035;
  $  050.B1649冲击器释放故障的DTC配置               $    $        $    $  ANS010.BYTE005  $  if((x&0x01)==0) y=@003e;else if((x&0x01)==1) y=@003f;else y=@0035;
  $  051.B164A冲击器释放故障的DTC配置               $    $        $    $  ANS010.BYTE006  $  if(((x&0x80)>>7)==0) y=@003e;else if(((x&0x80)>>7)==1) y=@003f;else y=@0035;
  $  052.B164B锁微型开关误组合的DTC配置             $    $        $    $  ANS010.BYTE006  $  if(((x&0x40)>>6)==0) y=@003e;else if(((x&0x40)>>6)==1) y=@003f;else y=@0035;
  $  053.B1651防箍带信号误差的DTC配置（左）         $    $        $    $  ANS010.BYTE006  $  if(((x&0x20)>>5)==0) y=@003e;else if(((x&0x20)>>5)==1) y=@003f;else y=@0035;
  $  054.B1652防箍带挤压的DTC配置（左）             $    $        $    $  ANS010.BYTE006  $  if(((x&0x10)>>4)==0) y=@003e;else if(((x&0x10)>>4)==1) y=@003f;else y=@0035;
  $  055.B1653防箍带信号误差的DTC配置（右）         $    $        $    $  ANS010.BYTE006  $  if(((x&0x08)>>3)==0) y=@003e;else if(((x&0x08)>>3)==1) y=@003f;else y=@0035;
  $  056.B1654防箍带挤压的DTC配置（右）             $    $        $    $  ANS010.BYTE006  $  if(((x&0x04)>>2)==0) y=@003e;else if(((x&0x04)>>2)==1) y=@003f;else y=@0035;
  $  057.B1655防箍带开放负载的DTC配置（左）         $    $        $    $  ANS010.BYTE006  $  if(((x&0x02)>>1)==0) y=@003e;else if(((x&0x02)>>1)==1) y=@003f;else y=@0035;
  $  058.B1655防箍带开放负载的DTC配置（右）         $    $        $    $  ANS010.BYTE006  $  if((x&0x01)==0) y=@003e;else if((x&0x01)==1) y=@003f;else y=@0035;
  $  059.B1661左霍尔信号1对电池短路的DTC配置        $    $        $    $  ANS010.BYTE007  $  if(((x&0x80)>>7)==0) y=@003e;else if(((x&0x80)>>7)==1) y=@003f;else y=@0035;
  $  060.B1662左霍尔信号2对电池短路的DTC配置        $    $        $    $  ANS010.BYTE007  $  if(((x&0x40)>>6)==0) y=@003e;else if(((x&0x40)>>6)==1) y=@003f;else y=@0035;
  $  061.B1663左霍尔信号1对地短路的DTC配置          $    $        $    $  ANS010.BYTE007  $  if(((x&0x20)>>5)==0) y=@003e;else if(((x&0x20)>>5)==1) y=@003f;else y=@0035;
  $  062.B1664左霍尔信号2对地短路的DTC配置          $    $        $    $  ANS010.BYTE007  $  if(((x&0x10)>>4)==0) y=@003e;else if(((x&0x10)>>4)==1) y=@003f;else y=@0035;
  $  063.B1665左霍尔信号1开路的DTC配置              $    $        $    $  ANS010.BYTE007  $  if(((x&0x08)>>3)==0) y=@003e;else if(((x&0x08)>>3)==1) y=@003f;else y=@0035;
  $  064.B1666左霍尔信号2开路的DTC配置              $    $        $    $  ANS010.BYTE007  $  if(((x&0x04)>>2)==0) y=@003e;else if(((x&0x04)>>2)==1) y=@003f;else y=@0035;
  $  065.标定完成标识                               $    $        $    $  ANS011.BYTE004  $  if(((x&0x80)>>7)==0) y=@004a;else if(((x&0x80)>>7)==1) y=@004b;else y=@0035;
  $  066.自学习完成标识                             $    $        $    $  ANS011.BYTE004  $  if(((x&0x40)>>6)==0) y=@004c;else if(((x&0x40)>>6)==1) y=@004d;else y=@0035;
  $  067.手动学习零点完成标识                       $    $        $    $  ANS011.BYTE004  $  if(((x&0x20)>>5)==0) y=@004c;else if(((x&0x20)>>5)==1) y=@004d;else y=@0035;
  $  068.手动学习最大开度完成标识                   $    $        $    $  ANS011.BYTE004  $  if(((x&0x10)>>4)==0) y=@004c;else if(((x&0x10)>>4)==1) y=@004d;else y=@0035;
  $  069.车库模式学习标识                           $    $        $    $  ANS011.BYTE004  $  if(((x&0x08)>>3)==0) y=@004c;else if(((x&0x08)>>3)==1) y=@004d;else y=@0035;
  $  070.尾门当前状态                               $    $        $    $  ANS011.BYTE005  $  if(x==0) y=@004e;else if(x==1) y=@004f;else if(x==2) y=@0050;else if(x==3) y=@0028;else if(x==4) y=@000f;else if(x==5) y=@0051;else y=@0035;
  $  071.锁当前状态                                 $    $        $    $  ANS011.BYTE006  $  if(x==0) y=@004e;else if(x==1) y=@0052;else if(x==2) y=@0053;else if(x==3) y=@0054;else if(x==4) y=@0055;else if(x==5) y=@0056;else if(x==6) y=@0057;else y=@0035;
  $  072.当前系统滥用及保护状态                     $    $        $    $  ANS011.BYTE007  $  if(x==0) y=@0030;else if(x==1) y=@0031;else if(x==2) y=@0032;else if(x==3) y=@0033;else if(x==4) y=@0034;else y=@0035;
  $  073.尾门自学习后的最大开度                     $    $        $    $  ANS012.BYTE004  $  y=(x1*256+x2);
  $  074.当前设定的车库模式最大开度                 $    $        $    $  ANS012.BYTE006  $  y=(x1*256+x2);
  $  075.当前尾门开度                               $    $        $    $  ANS013.BYTE004  $  y=(x1*256+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
