
    车型ID：100c

    模拟：协议模拟-->100c

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:700 02 10 01 00 00 00 00 00       $~  ANS000:780 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:700 02 3E 80 00 00 00 00 00       $!  ANS000:780 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:700 03 19 02 09 00 00 00 00       $#  ANS000:780 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/0c000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:700 04 14 FF FF FF 00 00 00       $$  ANS000:780 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:700 03 22 F1 A0 00 00 00 00       $%  ANS000:780 03 22 F1 A0 00 00 00 00
  $%  REQ001:700 03 22 F1 83 00 00 00 00       $%  ANS001:780 03 22 F1 83 00 00 00 00
  $%  REQ002:700 03 22 F1 A1 00 00 00 00       $%  ANS002:780 03 22 F1 A1 00 00 00 00
  $%  REQ003:700 03 22 F1 91 00 00 00 00       $%  ANS003:780 03 22 F1 91 00 00 00 00
  $%  REQ004:700 03 22 F1 87 00 00 00 00       $%  ANS004:780 03 22 F1 87 00 00 00 00
  $%  REQ005:700 03 22 F1 10 00 00 00 00       $%  ANS005:780 03 22 F1 10 00 00 00 00
  $%  REQ006:700 03 22 F1 92 00 00 00 00       $%  ANS006:780 03 22 F1 92 00 00 00 00
  $%  REQ007:700 03 22 F1 8C 00 00 00 00       $%  ANS007:780 03 22 F1 8C 00 00 00 00
  $%  REQ008:700 03 22 F1 8A 00 00 00 00       $%  ANS008:780 03 22 F1 8A 00 00 00 00
  $%  REQ009:700 03 22 F1 90 00 00 00 00       $%  ANS009:780 03 22 F1 90 00 00 00 00
  $%  REQ010:700 03 22 F1 A8 00 00 00 00       $%  ANS010:780 03 22 F1 A8 00 00 00 00
  $%  REQ011:700 03 22 F1 8B 00 00 00 00       $%  ANS011:780 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:EcU内部软件数:                   $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X],X1,X2,X3);
  $%  006:电控单元零件号(上次):            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):            $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                $%    $%  ANS005.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6,X7,X8);
  $%  011:系统供应商识别码:                $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:VIN码:                           $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  013:车辆特征信息:                    $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  014:电控单元制造日期:                $%    $%  ANS011.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:700 03 22 D4 01 00 00 00 00       $  ANS000:780 03 22 D4 01 00 00 00 00
  $  REQ001:700 03 22 D4 03 00 00 00 00       $  ANS001:780 03 22 D4 03 00 00 00 00
  $  REQ002:700 03 22 D1 1B 00 00 00 00       $  ANS002:780 03 22 D1 1B 00 00 00 00
  $  REQ003:700 03 22 D1 1C 00 00 00 00       $  ANS003:780 03 22 D1 1C 00 00 00 00
  $  REQ004:700 03 22 D1 1D 00 00 00 00       $  ANS004:780 03 22 D1 1D 00 00 00 00
  $  REQ005:700 03 22 B1 01 00 00 00 00       $  ANS005:780 03 22 B1 01 00 00 00 00
  $  REQ006:700 03 22 B1 02 00 00 00 00       $  ANS006:780 03 22 B1 02 00 00 00 00
  $  REQ007:700 03 22 B1 03 00 00 00 00       $  ANS007:780 03 22 B1 03 00 00 00 00
  $  REQ008:700 03 22 B1 04 00 00 00 00       $  ANS008:780 03 22 B1 04 00 00 00 00
  $  REQ009:700 03 22 B1 05 00 00 00 00       $  ANS009:780 03 22 B1 05 00 00 00 00
  $  REQ010:700 03 22 B1 06 00 00 00 00       $  ANS010:780 03 22 B1 06 00 00 00 00
  $  REQ011:700 03 22 B1 08 00 00 00 00       $  ANS011:780 03 22 B1 08 00 00 00 00
  $  REQ012:700 03 22 B1 09 00 00 00 00       $  ANS012:780 03 22 B1 09 00 00 00 00
  $  REQ013:700 03 22 B1 10 00 00 00 00       $  ANS013:780 03 22 B1 10 00 00 00 00
  $  REQ014:700 03 22 B1 13 00 00 00 00       $  ANS014:780 03 22 B1 13 00 00 00 00
  $  REQ015:700 03 22 B1 11 00 00 00 00       $  ANS015:780 03 22 B1 11 00 00 00 00
  $  REQ016:700 03 22 B1 12 00 00 00 00       $  ANS016:780 03 22 B1 12 00 00 00 00
  $  REQ017:700 03 22 E1 03 00 00 00 00       $  ANS017:780 03 22 E1 03 00 00 00 00
  $  REQ018:700 03 22 B1 07 00 00 00 00       $  ANS018:780 03 22 B1 07 00 00 00 00
  $  REQ019:700 03 22 E1 01 00 00 00 00       $  ANS019:780 03 22 E1 01 00 00 00 00
  $  REQ020:700 03 22 E1 04 00 00 00 00       $  ANS020:780 03 22 E1 04 00 00 00 00
  $  REQ021:700 03 22 C1 11 00 00 00 00       $  ANS021:780 03 22 C1 11 00 00 00 00
  $  REQ022:700 03 22 C1 12 00 00 00 00       $  ANS022:780 03 22 C1 12 00 00 00 00
  $  REQ023:700 03 22 E1 02 00 00 00 00       $  ANS023:780 03 22 E1 02 00 00 00 00

  $  000.档位                                                    $    $               $    $  ANS000.BYTE004  $  if((x&0x1E)==0x00)y=@075a;else if((x&0x1E)==0x02)y=@04d3;else if((x&0x1E)==0x04)y=@0169;else if((x&0x1E)==0x06)y=@016a;else if((x&0x1E)==0x08)y=@016b;else if((x&0x1E)==0x0A)y=@054a;else if((x&0x1E)==0x0C)y=@054b;else if((x&0x1E)==0x10)y=@0263;else if((x&0x1E)==0x12)y=@0262;else if((x&0x1E)==0x14)y=@0261;else y=@01a9;
  $  001.变速器类型                                              $    $               $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@003b;else y=@003a;
  $  002.TCCU 显示                                               $    $               $    $  ANS000.BYTE005  $  if((x&0x06)==0x00)y=@075a;else if((x&0x06)==0x02)y=@075b;else if((x&0x06)==0x04)y=@075c;else if((x&0x06)==0x06)y=@075d;else y=@01a9;
  $  003.TCCU 模式                                               $    $               $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@075e;else y=@05dc;
  $  004.关点火钥匙未拔                                          $    $               $    $  ANS001.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  005.4驱失效警告                                             $    $               $    $  ANS001.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  006.车道偏离(用于高配仪表)                                  $    $               $    $  ANS001.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  007.驾驶时间提醒                                            $    $               $    $  ANS001.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  008.疲劳提醒                                                $    $               $    $  ANS001.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  009.门未关提示音                                            $    $               $    $  ANS001.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  010.后排安全带未系报警(用于高配仪表)                        $    $               $    $  ANS001.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  011.前排安全带未系报警                                      $    $               $    $  ANS001.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  012.左右转向提示音                                          $    $               $    $  ANS001.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  013.危险警告报警(双闪)                                      $    $               $    $  ANS001.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  014.保养里程警告(高配保养里程警告同LCD警告界面提示音)       $    $               $    $  ANS001.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  015.位置灯未提醒                                            $    $               $    $  ANS001.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  016.手刹未释放警告                                          $    $               $    $  ANS001.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  017.倒挡提醒                                                $    $               $    $  ANS001.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  018.超速报警                                                $    $               $    $  ANS001.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  019.安全气囊警告灯                                          $    $               $    $  ANS002.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  020.远光灯状态                                              $    $               $    $  ANS002.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  021.后雾灯状态                                              $    $               $    $  ANS002.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  022.前雾灯状态                                              $    $               $    $  ANS002.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  023.ABS故障灯状态                                           $    $               $    $  ANS002.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  024.位置灯状态                                              $    $               $    $  ANS002.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  025.右转向灯状态                                            $    $               $    $  ANS002.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  026.左转向灯状态                                            $    $               $    $  ANS002.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  027.燃油积水警告灯                                          $    $               $    $  ANS002.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  028.预热指示灯                                              $    $               $    $  ANS002.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  029.ESP OFF指示灯状态                                       $    $               $    $  ANS002.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  030.四驱故障警告灯                                          $    $               $    $  ANS002.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  031.排放故障指示灯                                          $    $               $    $  ANS002.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  032.EPB故障指示灯状态                                       $    $               $    $  ANS002.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  033.自适应前大灯调节故障警告灯                              $    $               $    $  ANS002.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  034.低燃油警告灯                                            $    $               $    $  ANS002.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  035.驾驶员安全带报警灯                                      $    $               $    $  ANS003.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  036.蓄电池充放电指示灯                                      $    $               $    $  ANS003.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  037.制动系统故障/驻车制动灯                                 $    $               $    $  ANS003.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  038.冷却水温过高警告灯                                      $    $               $    $  ANS003.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  039.副驾驶员安全带报警灯                                    $    $               $    $  ANS003.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  040.发动机故障指示灯                                        $    $               $    $  ANS003.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  041.机油压力低报警灯                                        $    $               $    $  ANS003.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  042.AFS左右调节关闭提醒灯                                   $    $               $    $  ANS003.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  043.巡航灯                                                  $    $               $    $  ANS004.BYTE004  $  if((x&0xC0)==0x00)y=@074d;else if((x&0xC0)==0x40)y=@074e;else if((x&0xC0)==0x80)y=@074f;else y=@0750;
  $  044.缓坡急降                                                $    $               $    $  ANS004.BYTE004  $  if((x&0x30)==0x00)y=@000f;else if((x&0x30)==0x10)y=@0751;else if((x&0x30)==0x20)y=@0028;else y=@0752;
  $  045.胎压监控系统报警灯(用于高配仪表)                        $    $               $    $  ANS004.BYTE004  $  if((x&0x0C)==0x00)y=@000f;else if((x&0x0C)==0x04)y=@0298;else if((x&0x0C)==0x08)y=@0028;else y=@0752;
  $  046.ESP警告灯                                               $    $               $    $  ANS004.BYTE004  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@0751;else if((x&0x02)==0x02)y=@0028;else y=@0752;
  $  047.车道偏离指示灯(用于高配仪表)                            $    $               $    $  ANS004.BYTE005  $  if((x&0x0C)==0x00)y=@074d;else if((x&0x0C)==0x04)y=@0756;else if((x&0x0C)==0x08)y=@0757;else y=@074d;
  $  048.发动机防盗指示灯                                        $    $               $    $  ANS004.BYTE005  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@0758;else if((x&0x02)==0x02)y=@0759;else y=@0028;
  $  049.实际里程数                                              $    $  km           $    $  ANS005.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  050.仪表蓄电池电压                                          $    $  V            $    $  ANS006.BYTE004  $  y=x*0.1;
  $  051.油量百分比                                              $    $  %            $    $  ANS007.BYTE004  $  y=x;
  $  052.发动机冷却液温度                                        $    $  degree C     $    $  ANS008.BYTE004  $  y=x-40;
  $  053.表盘照明等级                                            $    $  %            $    $  ANS009.BYTE004  $  y=x;
  $  054.车速                                                    $    $  km/h         $    $  ANS010.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  055.超速值配置                                              $    $  km/h         $    $  ANS011.BYTE004  $  y=x;
  $  056.燃油消耗                                                $    $               $    $  ANS012.BYTE004  $  y=x1*256+x2;
  $  057.左前轮胎压力(来自CAN)(用于高配仪表)                     $    $  kPa          $    $  ANS013.BYTE004  $  y=(x1*256+x2)*2.75;
  $  058.左后轮胎压力(来自CAN)(用于高配仪表)                     $    $  kPa          $    $  ANS014.BYTE004  $  y=(x1*256+x2)*2.75;
  $  059.右前轮胎压力(来自CAN)(用于高配仪表)                     $    $  kPa          $    $  ANS015.BYTE004  $  y=(x1*256+x2)*2.75;
  $  060.右后轮胎压力(来自CAN)(用于高配仪表)                     $    $  kPa          $    $  ANS016.BYTE004  $  y=(x1*256+x2)*2.75;
  $  061.发动机冷却液温度(来自仪表)                              $    $  degree C     $    $  ANS017.BYTE004  $  y=x-40;
  $  062.发动机转速                                              $    $  rpm          $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.25;
  $  063.发动机转速(来自仪表)                                    $    $  rpm          $    $  ANS019.BYTE004  $  y=x1*256+x2;
  $  064.燃油液位(来自仪表)                                      $    $  %            $    $  ANS020.BYTE004  $  y=x;
  $  065.GCC 法规设置                                            $    $               $    $  ANS021.BYTE004  $  if((x&0x40)==0x40)y=@075f;else y=@0760;
  $  066.TCCU 模块配置                                           $    $               $    $  ANS021.BYTE004  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  067.档位模式设置                                            $    $               $    $  ANS021.BYTE004  $  if((x&0x10)==0x10)y=@003b;else y=@003a;
  $  068.左舵或右舵                                              $    $               $    $  ANS021.BYTE005  $  if((x&0x10)==0x10)y=@048a;else y=@048b;
  $  069.门开显示的位置设置                                      $    $               $    $  ANS021.BYTE005  $  if((x&0x03)==0x00)y=@0753;else if((x&0x03)==0x01)y=@0754;else if((x&0x02)==0x02)y=@0755;else y=@01a9;
  $  070.PEPS配置(用于高配仪表)                                  $    $               $    $  ANS021.BYTE006  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  071.后安全带配置(用于高配仪表)                              $    $               $    $  ANS021.BYTE006  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  072.尿素量配置(用于高配仪表)                                $    $               $    $  ANS021.BYTE006  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  073.疲劳驾驶配置                                            $    $               $    $  ANS021.BYTE006  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  074.雨量传感器配置(用于高配仪表)                            $    $               $    $  ANS021.BYTE006  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  075.定速巡航配置                                            $    $               $    $  ANS021.BYTE006  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  076.ESP配置                                                 $    $               $    $  ANS021.BYTE006  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  077.TPMS配置(用于高配仪表)                                  $    $               $    $  ANS021.BYTE006  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  078.保养里程配置                                            $    $               $    $  ANS021.BYTE007  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  079.自适应大灯调节设置                                      $    $               $    $  ANS021.BYTE007  $  if((x&0x60)==0x00)y=@000f;else if((x&0x60)==0x20)y=@0746;else if((x&0x60)==0x40)y=@0747;else y=@0035;
  $  080.安全气囊报警配置                                        $    $               $    $  ANS021.BYTE007  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  081.车道偏离指示灯(用于高配仪表)                            $    $               $    $  ANS021.BYTE007  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  082.发动机防盗指示灯                                        $    $               $    $  ANS021.BYTE007  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  083.拖车模块配置                                            $    $               $    $  ANS021.BYTE007  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  084.前雾灯配置                                              $    $               $    $  ANS021.BYTE007  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  085.模式控制配置                                            $    $               $    $  ANS021.BYTE008  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  086.自动灯光开启关闭配置                                    $    $               $    $  ANS021.BYTE008  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  087.娱乐系统配置                                            $    $               $    $  ANS021.BYTE008  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  088.盲点监测系统配置(用于高配仪表)                          $    $               $    $  ANS021.BYTE008  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  089.后雾灯配置                                              $    $               $    $  ANS021.BYTE008  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  090.副驾驶安全带报警配置                                    $    $               $    $  ANS021.BYTE008  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  091.超速配置                                                $    $               $    $  ANS021.BYTE008  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  092.超速警告速度配置                                        $    $  km/h         $    $  ANS021.BYTE009  $  y=x;
  $  093.语言设置(用于高配仪表)                                  $    $               $    $  ANS021.BYTE010  $  if(x==0x00)y=@074a;else if(x==0x01)y=@074b;else if(x==0x02)y=@074c;else y=@01a9;
  $  094.保养间隔里程数                                          $    $  km           $    $  ANS022.BYTE004  $  y=x1*256+x2;
  $  095.上一次重置保养里程时当时仪表里程数                      $    $  km           $    $  ANS022.BYTE006  $  y=x1*256*256+x2*256+x3;
  $  096.车速(来自仪表)                                          $    $  km/h         $    $  ANS023.BYTE004  $  y=x1*256+x2;
  $  097.安全带逻辑配置                                          $    $               $    $  ANS021.BYTE008  $  if((x&0x04)==0x04)y=@0761;else y=@0762;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:700 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
