
    车型ID：100f

    模拟：协议模拟-->100f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:711 02 10 01 00 00 00 00 00       $~  ANS000:719 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:711 02 3E 80 00 00 00 00 00       $!  ANS000:719 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:711 03 19 02 09 00 00 00 00       $#  ANS000:719 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/0f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:711 04 14 FF FF FF 00 00 00       $$  ANS000:719 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:711 03 22 F1 A0 00 00 00 00       $%  ANS000:719 03 22 F1 A0 00 00 00 00
  $%  REQ001:711 03 22 F1 83 00 00 00 00       $%  ANS001:719 03 22 F1 83 00 00 00 00
  $%  REQ002:711 03 22 F1 A1 00 00 00 00       $%  ANS002:719 03 22 F1 A1 00 00 00 00
  $%  REQ003:711 03 22 F1 91 00 00 00 00       $%  ANS003:719 03 22 F1 91 00 00 00 00
  $%  REQ004:711 03 22 F1 A2 00 00 00 00       $%  ANS004:719 03 22 F1 A2 00 00 00 00
  $%  REQ005:711 03 22 F1 87 00 00 00 00       $%  ANS005:719 03 22 F1 87 00 00 00 00
  $%  REQ006:711 03 22 F1 10 00 00 00 00       $%  ANS006:719 03 22 F1 10 00 00 00 00
  $%  REQ007:711 03 22 F1 92 00 00 00 00       $%  ANS007:719 03 22 F1 92 00 00 00 00
  $%  REQ008:711 03 22 F1 8C 00 00 00 00       $%  ANS008:719 03 22 F1 8C 00 00 00 00
  $%  REQ009:711 03 22 F1 94 00 00 00 00       $%  ANS009:719 03 22 F1 94 00 00 00 00
  $%  REQ010:711 03 22 F1 8A 00 00 00 00       $%  ANS010:719 03 22 F1 8A 00 00 00 00
  $%  REQ011:711 03 22 F1 90 00 00 00 00       $%  ANS011:719 03 22 F1 90 00 00 00 00
  $%  REQ012:711 03 22 F1 A8 00 00 00 00       $%  ANS012:719 03 22 F1 A8 00 00 00 00
  $%  REQ013:711 03 22 F1 8B 00 00 00 00       $%  ANS013:719 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商识别码:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:VIN码:                           $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  015:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:711 03 22 C0 01 00 00 00 00       $  ANS000:719 03 22 C0 01 00 00 00 00
  $  REQ001:711 03 22 C0 04 00 00 00 00       $  ANS001:719 03 22 C0 04 00 00 00 00
  $  REQ002:711 03 22 C0 03 00 00 00 00       $  ANS002:719 03 22 C0 03 00 00 00 00
  $  REQ003:711 03 22 C0 06 00 00 00 00       $  ANS003:719 03 22 C0 06 00 00 00 00
  $  REQ004:711 03 22 C0 02 00 00 00 00       $  ANS004:719 03 22 C0 02 00 00 00 00
  $  REQ005:711 03 22 C0 05 00 00 00 00       $  ANS005:719 03 22 C0 05 00 00 00 00
  $  REQ006:711 03 22 B2 00 00 00 00 00       $  ANS006:719 03 22 B2 00 00 00 00 00
  $  REQ007:711 03 22 B2 50 00 00 00 00       $  ANS007:719 03 22 B2 50 00 00 00 00
  $  REQ008:711 03 22 B0 03 00 00 00 00       $  ANS008:719 03 22 B0 03 00 00 00 00
  $  REQ009:711 03 22 B2 10 00 00 00 00       $  ANS009:719 03 22 B2 10 00 00 00 00
  $  REQ010:711 03 22 CA 01 00 00 00 00       $  ANS010:719 03 22 CA 01 00 00 00 00
  $  REQ011:711 03 22 CA 0A 00 00 00 00       $  ANS011:719 03 22 CA 0A 00 00 00 00
  $  REQ012:711 03 22 CA 02 00 00 00 00       $  ANS012:719 03 22 CA 02 00 00 00 00
  $  REQ013:711 03 22 CA 03 00 00 00 00       $  ANS013:719 03 22 CA 03 00 00 00 00
  $  REQ014:711 03 22 CA 04 00 00 00 00       $  ANS014:719 03 22 CA 04 00 00 00 00
  $  REQ015:711 03 22 CA 05 00 00 00 00       $  ANS015:719 03 22 CA 05 00 00 00 00
  $  REQ016:711 03 22 CA 06 00 00 00 00       $  ANS016:719 03 22 CA 06 00 00 00 00
  $  REQ017:711 03 22 CA 07 00 00 00 00       $  ANS017:719 03 22 CA 07 00 00 00 00
  $  REQ018:711 03 22 CA 08 00 00 00 00       $  ANS018:719 03 22 CA 08 00 00 00 00
  $  REQ019:711 03 22 CA 09 00 00 00 00       $  ANS019:719 03 22 CA 09 00 00 00 00
  $  REQ020:711 03 22 CA 81 00 00 00 00       $  ANS020:719 03 22 CA 81 00 00 00 00
  $  REQ021:711 03 22 CF 01 00 00 00 00       $  ANS021:719 03 22 CF 01 00 00 00 00
  $  REQ022:711 03 22 B1 00 00 00 00 00       $  ANS022:719 03 22 B1 00 00 00 00 00
  $  REQ023:711 03 22 B1 01 00 00 00 00       $  ANS023:719 03 22 B1 01 00 00 00 00
  $  REQ024:711 03 22 B1 02 00 00 00 00       $  ANS024:719 03 22 B1 02 00 00 00 00
  $  REQ025:711 03 22 B0 86 00 00 00 00       $  ANS025:719 03 22 B0 86 00 00 00 00
  $  REQ026:711 03 22 B0 01 00 00 00 00       $  ANS026:719 03 22 B0 01 00 00 00 00
  $  REQ027:711 03 22 CA 12 00 00 00 00       $  ANS027:719 03 22 CA 12 00 00 00 00
  $  REQ028:711 03 22 B1 82 00 00 00 00       $  ANS028:719 03 22 B1 82 00 00 00 00
  $  REQ029:711 03 22 B1 83 00 00 00 00       $  ANS029:719 03 22 B1 83 00 00 00 00
  $  REQ030:711 03 22 B2 15 00 00 00 00       $  ANS030:719 03 22 B2 15 00 00 00 00
  $  REQ031:711 03 22 CF 10 00 00 00 00       $  ANS031:719 03 22 CF 10 00 00 00 00
  $  REQ032:711 03 22 CA 80 00 00 00 00       $  ANS032:719 03 22 CA 80 00 00 00 00
  $  REQ033:711 03 22 B0 08 00 00 00 00       $  ANS033:719 03 22 B0 08 00 00 00 00
  $  REQ034:711 03 22 B0 00 00 00 00 00       $  ANS034:719 03 22 B0 00 00 00 00 00
  $  REQ035:711 03 22 B1 84 00 00 00 00       $  ANS035:719 03 22 B1 84 00 00 00 00
  $  REQ036:711 03 22 B0 04 00 00 00 00       $  ANS036:719 03 22 B0 04 00 00 00 00
  $  REQ037:711 03 22 B0 06 00 00 00 00       $  ANS037:719 03 22 B0 06 00 00 00 00
  $  REQ038:711 03 22 B0 05 00 00 00 00       $  ANS038:719 03 22 B0 05 00 00 00 00
  $  REQ039:711 03 22 B1 80 00 00 00 00       $  ANS039:719 03 22 B1 80 00 00 00 00
  $  REQ040:711 03 22 B1 81 00 00 00 00       $  ANS040:719 03 22 B1 81 00 00 00 00
  $  REQ041:711 03 22 B1 85 00 00 00 00       $  ANS041:719 03 22 B1 85 00 00 00 00
  $  REQ042:711 03 22 B0 84 00 00 00 00       $  ANS042:719 03 22 B0 84 00 00 00 00
  $  REQ043:711 03 22 B1 90 00 00 00 00       $  ANS043:719 03 22 B1 90 00 00 00 00
  $  REQ044:711 03 22 B0 83 00 00 00 00       $  ANS044:719 03 22 B0 83 00 00 00 00
  $  REQ045:711 03 22 B0 82 00 00 00 00       $  ANS045:719 03 22 B0 82 00 00 00 00
  $  REQ046:711 03 22 B0 07 00 00 00 00       $  ANS046:719 03 22 B0 07 00 00 00 00
  $  REQ047:711 03 22 C1 06 00 00 00 00       $  ANS047:719 03 22 C1 06 00 00 00 00
  $  REQ048:711 03 22 B0 81 00 00 00 00       $  ANS048:719 03 22 B0 81 00 00 00 00
  $  REQ049:711 03 22 C0 07 00 00 00 00       $  ANS049:719 03 22 C0 07 00 00 00 00
  $  REQ050:711 03 22 C0 09 00 00 00 00       $  ANS050:719 03 22 C0 09 00 00 00 00
  $  REQ051:711 03 22 C0 08 00 00 00 00       $  ANS051:719 03 22 C0 08 00 00 00 00
  $  REQ052:711 03 22 CA 22 00 00 00 00       $  ANS052:719 03 22 CA 22 00 00 00 00

  $  000.APN(接入点名称)1名称                 $    $               $    $  ANS000.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40,x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60,x61,x62,x63,x64);
  $  001.APN(接入点名称)2名称                 $    $               $    $  ANS001.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32,x33,x34,x35,x36,x37,x38,x39,x40,x41,x42,x43,x44,x45,x46,x47,x48,x49,x50,x51,x52,x53,x54,x55,x56,x57,x58,x59,x60,x61,x62,x63,x64);
  $  002.APN(接入点名称)1密码                 $    $               $    $  ANS002.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  003.APN(接入点名称)2密码                 $    $               $    $  ANS003.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  004.APN(接入点名称)1用户名               $    $               $    $  ANS004.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  005.APN(接入点名称)2用户名               $    $               $    $  ANS005.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  006.APP激活状态                          $    $               $    $  ANS006.BYTE004  $  if((x&0x03)==0x00)y=@0004;else if((x&0x03)==0x01)y=@034d;else if((x&0x03)==0x02)y=@034e;else y=@0561;
  $  007.Ecall功能                            $    $               $    $  ANS006.BYTE005  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  008.Bcall功能                            $    $               $    $  ANS006.BYTE005  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  009.Icall功能                            $    $               $    $  ANS006.BYTE005  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  010.车辆状态功能开关                     $    $               $    $  ANS006.BYTE005  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  011.行程日志功能开关                     $    $               $    $  ANS006.BYTE005  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  012.在线娱乐功能开关                     $    $               $    $  ANS006.BYTE005  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  013.车辆被盗追踪功能开关                 $    $               $    $  ANS006.BYTE005  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  014.远程控制状态                         $    $               $    $  ANS006.BYTE005  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  015.蓝牙功能开关                         $    $               $    $  ANS006.BYTE006  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  016.远程故障码检测功能开关               $    $               $    $  ANS006.BYTE006  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  017.数据采集功能开关                     $    $               $    $  ANS006.BYTE006  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  018.当前保存钥匙总数(包括备用钥匙)       $    $               $    $  ANS007.BYTE004  $  y=x;
  $  019.当前使用的钥匙预定值                 $    $               $    $  ANS007.BYTE005  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  020.当前使用的钥匙开始时间               $    $  s            $    $  ANS007.BYTE009  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  021.当前使用的钥匙结束时间               $    $  s            $    $  ANS007.BYTE013  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  022.蓝牙模块软件版本                     $    $               $    $  ANS008.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  023.秘钥交换反馈                         $    $               $    $  ANS009.BYTE004  $  if((x&0xFE)==0x00)y=@033c;else if((x&0xFE)==0x02) y=@03ed;else if((x&0xFE)==0x04) y=@055e;else if((x&0xFE)==0x06) y=@055f;else if((x&0xFE)==0x08) y=@0340;else if((x&0xFE)==0x0A) y=@0560;else if((x&0xFE)==0x0C) y=@03f1;else if((x&0xFE)==0x0E) y=@002f;else y=@01a9;
  $  024.秘钥交换完成状态                     $    $               $    $  ANS009.BYTE004  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  025.配置检查状态                         $    $               $    $  ANS009.BYTE005  $  if((x&0x01)==0x01)y=@03ed;else y=@0412;
  $  026.MCC1移动国家码1                      $    $               $    $  ANS010.BYTE004  $  ASCII(X1,X2,X3);
  $  027.MNC1移动网络码1                      $    $               $    $  ANS010.BYTE007  $  ASCII(X1,X2,X3);
  $  028.默认电话号码                         $    $               $    $  ANS010.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  029.默认公共服务号码                     $    $               $    $  ANS010.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  030.Call类型                             $    $               $    $  ANS010.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  031.是否云端获取号码                     $    $               $    $  ANS010.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  032.MCC10移动国家码10                    $    $               $    $  ANS011.BYTE004  $  ASCII(X1,X2,X3);
  $  033.MNC10移动网络码10                    $    $               $    $  ANS011.BYTE007  $  ASCII(X1,X2,X3);
  $  034.默认电话号码10                       $    $               $    $  ANS011.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  035.默认公共服务号码10                   $    $               $    $  ANS011.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  036.Call类型10                           $    $               $    $  ANS011.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  037.是否获取云端号码10                   $    $               $    $  ANS011.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  038.MCC2移动国家码2                      $    $               $    $  ANS012.BYTE004  $  ASCII(X1,X2,X3);
  $  039.MNC2移动网络码2                      $    $               $    $  ANS012.BYTE007  $  ASCII(X1,X2,X3);
  $  040.默认电话号码2                        $    $               $    $  ANS012.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  041.默认公共服务号码2                    $    $               $    $  ANS012.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  042.Call类型2                            $    $               $    $  ANS012.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  043.是否云端获取号码2                    $    $               $    $  ANS012.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  044.MCC3移动国家码3                      $    $               $    $  ANS013.BYTE004  $  ASCII(X1,X2,X3);
  $  045.MNC3移动网络码3                      $    $               $    $  ANS013.BYTE007  $  ASCII(X1,X2,X3);
  $  046.默认电话号码3                        $    $               $    $  ANS013.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  047.默认公共服务号码3                    $    $               $    $  ANS013.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  048.Call类型3                            $    $               $    $  ANS013.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  049.是否云端获取号码3                    $    $               $    $  ANS013.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  050.MCC4移动国家码4                      $    $               $    $  ANS014.BYTE004  $  ASCII(X1,X2,X3);
  $  051.MNC4移动网络码4                      $    $               $    $  ANS014.BYTE007  $  ASCII(X1,X2,X3);
  $  052.默认电话号码4                        $    $               $    $  ANS014.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  053.默认公共服务号码4                    $    $               $    $  ANS014.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  054.Call类型4                            $    $               $    $  ANS014.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  055.是否云端获取号码4                    $    $               $    $  ANS014.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  056.MCC5移动国家码5                      $    $               $    $  ANS015.BYTE004  $  ASCII(X1,X2,X3);
  $  057.MNC5移动网络码5                      $    $               $    $  ANS015.BYTE007  $  ASCII(X1,X2,X3);
  $  058.默认电话号码5                        $    $               $    $  ANS015.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  059.默认公共服务号码5                    $    $               $    $  ANS015.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  060.Call类型5                            $    $               $    $  ANS015.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  061.是否云端获取号码5                    $    $               $    $  ANS015.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  062.MCC6移动国家码6                      $    $               $    $  ANS016.BYTE004  $  ASCII(X1,X2,X3);
  $  063.MNC6移动网络码6                      $    $               $    $  ANS016.BYTE007  $  ASCII(X1,X2,X3);
  $  064.默认电话号码6                        $    $               $    $  ANS016.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  065.默认公共服务号码6                    $    $               $    $  ANS016.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  066.Call类型6                            $    $               $    $  ANS016.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  067.是否云端获取号码6                    $    $               $    $  ANS016.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  068.MCC7移动国家码7                      $    $               $    $  ANS017.BYTE004  $  ASCII(X1,X2,X3);
  $  069.MNC7移动网络码7                      $    $               $    $  ANS017.BYTE007  $  ASCII(X1,X2,X3);
  $  070.默认电话号码7                        $    $               $    $  ANS017.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  071.默认公共服务号码7                    $    $               $    $  ANS017.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  072.Call类型7                            $    $               $    $  ANS017.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  073.是否云端获取号码7                    $    $               $    $  ANS017.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  074.MCC8移动国家码8                      $    $               $    $  ANS018.BYTE004  $  ASCII(X1,X2,X3);
  $  075.MNC8移动网络码8                      $    $               $    $  ANS018.BYTE007  $  ASCII(X1,X2,X3);
  $  076.默认电话号码8                        $    $               $    $  ANS018.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  077.默认公共服务号码8                    $    $               $    $  ANS018.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  078.Call类型8                            $    $               $    $  ANS018.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  079.是否云端获取号码8                    $    $               $    $  ANS018.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  080.MCC9移动国家码9                      $    $               $    $  ANS019.BYTE004  $  ASCII(X1,X2,X3);
  $  081.MNC9移动网络码9                      $    $               $    $  ANS019.BYTE007  $  ASCII(X1,X2,X3);
  $  082.默认电话号码9                        $    $               $    $  ANS019.BYTE010  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  083.默认公共服务号码9                    $    $               $    $  ANS019.BYTE025  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $  084.Call类型9                            $    $               $    $  ANS019.BYTE040  $  if((x&0x30)==0x00)y=@0563;else if((x&0x30)==0x10)y=@0564;else if((x&0x30)==0x20)y=@0565;else y=@0004;
  $  085.是否云端获取号码9                    $    $               $    $  ANS019.BYTE040  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  086.大数据通道8                          $    $               $    $  ANS020.BYTE004  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  087.大数据通道7                          $    $               $    $  ANS020.BYTE004  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  088.大数据通道6                          $    $               $    $  ANS020.BYTE004  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  089.大数据通道5                          $    $               $    $  ANS020.BYTE004  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  090.大数据通道4                          $    $               $    $  ANS020.BYTE004  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  091.大数据通道3                          $    $               $    $  ANS020.BYTE004  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  092.大数据通道2                          $    $               $    $  ANS020.BYTE004  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  093.大数据通道1                          $    $               $    $  ANS020.BYTE004  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  094.大数据通道16                         $    $               $    $  ANS020.BYTE005  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  095.大数据通道15                         $    $               $    $  ANS020.BYTE005  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  096.大数据通道14                         $    $               $    $  ANS020.BYTE005  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  097.大数据通道13                         $    $               $    $  ANS020.BYTE005  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  098.大数据通道12                         $    $               $    $  ANS020.BYTE005  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  099.大数据通道11                         $    $               $    $  ANS020.BYTE005  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  100.大数据通道10                         $    $               $    $  ANS020.BYTE005  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  101.大数据通道9                          $    $               $    $  ANS020.BYTE005  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  102.大数据通道24                         $    $               $    $  ANS020.BYTE006  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  103.大数据通道23                         $    $               $    $  ANS020.BYTE006  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  104.大数据通道22                         $    $               $    $  ANS020.BYTE006  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  105.大数据通道21                         $    $               $    $  ANS020.BYTE006  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  106.大数据通道20                         $    $               $    $  ANS020.BYTE006  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  107.大数据通道19                         $    $               $    $  ANS020.BYTE006  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  108.大数据通道18                         $    $               $    $  ANS020.BYTE006  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  109.大数据通道17                         $    $               $    $  ANS020.BYTE006  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  110.大数据通道32                         $    $               $    $  ANS020.BYTE007  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  111.大数据通道31                         $    $               $    $  ANS020.BYTE007  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  112.大数据通道30                         $    $               $    $  ANS020.BYTE007  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  113.大数据通道29                         $    $               $    $  ANS020.BYTE007  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  114.大数据通道28                         $    $               $    $  ANS020.BYTE007  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  115.大数据通道27                         $    $               $    $  ANS020.BYTE007  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  116.大数据通道26                         $    $               $    $  ANS020.BYTE007  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  117.大数据通道25                         $    $               $    $  ANS020.BYTE007  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  118.大数据通道40                         $    $               $    $  ANS020.BYTE008  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  119.大数据通道39                         $    $               $    $  ANS020.BYTE008  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  120.大数据通道38                         $    $               $    $  ANS020.BYTE008  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  121.大数据通道37                         $    $               $    $  ANS020.BYTE008  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  122.大数据通道36                         $    $               $    $  ANS020.BYTE008  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  123.大数据通道35                         $    $               $    $  ANS020.BYTE008  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  124.大数据通道34                         $    $               $    $  ANS020.BYTE008  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  125.大数据通道33                         $    $               $    $  ANS020.BYTE008  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  126.触发事件8                            $    $               $    $  ANS021.BYTE004  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  127.触发事件7                            $    $               $    $  ANS021.BYTE004  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  128.触发事件6                            $    $               $    $  ANS021.BYTE004  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  129.触发事件5                            $    $               $    $  ANS021.BYTE004  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  130.触发事件4                            $    $               $    $  ANS021.BYTE004  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  131.触发事件3                            $    $               $    $  ANS021.BYTE004  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  132.触发事件2                            $    $               $    $  ANS021.BYTE004  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  133.触发事件1                            $    $               $    $  ANS021.BYTE004  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  134.触发事件16                           $    $               $    $  ANS021.BYTE005  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  135.触发事件15                           $    $               $    $  ANS021.BYTE005  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  136.触发事件14                           $    $               $    $  ANS021.BYTE005  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  137.触发事件13                           $    $               $    $  ANS021.BYTE005  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  138.触发事件12                           $    $               $    $  ANS021.BYTE005  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  139.触发事件11                           $    $               $    $  ANS021.BYTE005  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  140.触发事件10                           $    $               $    $  ANS021.BYTE005  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  141.触发事件9                            $    $               $    $  ANS021.BYTE005  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  142.触发事件24                           $    $               $    $  ANS021.BYTE006  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  143.触发事件23                           $    $               $    $  ANS021.BYTE006  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  144.触发事件22                           $    $               $    $  ANS021.BYTE006  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  145.触发事件21                           $    $               $    $  ANS021.BYTE006  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  146.触发事件20                           $    $               $    $  ANS021.BYTE006  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  147.触发事件19                           $    $               $    $  ANS021.BYTE006  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  148.触发事件18                           $    $               $    $  ANS021.BYTE006  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  149.触发事件17                           $    $               $    $  ANS021.BYTE006  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  150.触发事件32                           $    $               $    $  ANS021.BYTE007  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  151.触发事件31                           $    $               $    $  ANS021.BYTE007  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  152.触发事件30                           $    $               $    $  ANS021.BYTE007  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  153.触发事件29                           $    $               $    $  ANS021.BYTE007  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  154.触发事件28                           $    $               $    $  ANS021.BYTE007  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  155.触发事件27                           $    $               $    $  ANS021.BYTE007  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  156.触发事件26                           $    $               $    $  ANS021.BYTE007  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  157.触发事件25                           $    $               $    $  ANS021.BYTE007  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  158.触发事件40                           $    $               $    $  ANS021.BYTE008  $  if((x&0x80)==0x80)y=@00dc;else y=@00db;
  $  159.触发事件39                           $    $               $    $  ANS021.BYTE008  $  if((x&0x40)==0x40)y=@00dc;else y=@00db;
  $  160.触发事件38                           $    $               $    $  ANS021.BYTE008  $  if((x&0x20)==0x20)y=@00dc;else y=@00db;
  $  161.触发事件37                           $    $               $    $  ANS021.BYTE008  $  if((x&0x10)==0x10)y=@00dc;else y=@00db;
  $  162.触发事件36                           $    $               $    $  ANS021.BYTE008  $  if((x&0x08)==0x08)y=@00dc;else y=@00db;
  $  163.触发事件35                           $    $               $    $  ANS021.BYTE008  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  164.触发事件34                           $    $               $    $  ANS021.BYTE008  $  if((x&0x02)==0x02)y=@00dc;else y=@00db;
  $  165.触发事件33                           $    $               $    $  ANS021.BYTE008  $  if((x&0x01)==0x01)y=@00dc;else y=@00db;
  $  166.GPS天线状态                          $    $               $    $  ANS022.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  167.经度                                 $    $               $    $  ANS023.BYTE004  $  y=(x1*256+x2)*0.065535;
  $  168.纬度                                 $    $               $    $  ANS023.BYTE008  $  y=(x1*256*256+x2*256+x3)*0.0256;
  $  169.GPS时间                              $    $               $    $  ANS024.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  170.GPS精度                              $    $               $    $  ANS024.BYTE008  $  y=x*0.1;
  $  171.GPS速度                              $    $               $    $  ANS024.BYTE009  $  y=x;
  $  172.GPS方向                              $    $               $    $  ANS024.BYTE010  $  y=x*2;
  $  173.GPS状态                              $    $               $    $  ANS024.BYTE011  $  if((x&0x70)==0x00)y=@034a;else if((x&0x70)==0x10)y=@0566;else if((x&0x70)==0x20)y=@0567;else y=@01a9;
  $  174.GPS搜星个数                          $    $               $    $  ANS024.BYTE011  $  y=x&0x0F;
  $  175.Gsensor X值                          $    $  g            $    $  ANS025.BYTE004  $  y=(x1*256+x2)*0.001;
  $  176.Gsensor Y值                          $    $  g            $    $  ANS025.BYTE006  $  y=(x1*256+x2)*0.001;
  $  177.Gsensor Z值                          $    $  g            $    $  ANS025.BYTE008  $  y=(x1*256+x2)*0.001;
  $  178.SIM卡ICCID(IC卡识别码)               $    $               $    $  ANS026.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  179.Icall回拨时间                        $    $  H            $    $  ANS027.BYTE004  $  y=x*0.1;
  $  180.APN(接入点名称)1 IP地址              $    $               $    $  ANS028.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  181.APN(接入点名称)2 IP地址              $    $               $    $  ANS029.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  182.防盗状态                             $    $               $    $  ANS030.BYTE004  $  if(x==0x00)y=@03f4;else if(x==0x01)y=@03f5;else y=@01a9;
  $  183.防盗PIN码                            $    $               $    $  ANS031.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  184.采集数据间隔                         $    $  s            $    $  ANS032.BYTE004  $  y=x;
  $  185.采集数据数量                         $    $               $    $  ANS032.BYTE005  $  y=x;
  $  186.采集数据结束时间                     $    $               $    $  ANS032.BYTE006  $  y=x;
  $  187.蓝牙MAC地址                          $    $               $    $  ANS033.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  188.MPU软件版本                          $    $               $    $  ANS034.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  189.天线使用种类                         $    $               $    $  ANS035.BYTE004  $  if((x&0xC0)==0x00)y=@03fe;else if((x&0xC0)==0x40)y=@033b;else y=@01a9;
  $  190.内置天线状态                         $    $               $    $  ANS035.BYTE004  $  if((x&0x30)==0x00)y=@0339;else if((x&0x30)==0x10)y=@033a;else y=@01a9;
  $  191.副天线连接状态                       $    $               $    $  ANS035.BYTE004  $  if((x&0x0C)==0x00)y=@0339;else if((x&0x0C)==0x04)y=@033a;else y=@01a9;
  $  192.通讯主天线连接状态                   $    $               $    $  ANS035.BYTE004  $  if((x&0x03)==0x00)y=@0339;else if((x&0x03)==0x01)y=@033a;else y=@01a9;
  $  193.SIM卡IMEI                            $    $               $    $  ANS036.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  194.Modem硬件版本                        $    $               $    $  ANS037.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  195.Modem软件版本                        $    $               $    $  ANS038.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  196.SIM卡MCC移动国家码                   $    $               $    $  ANS039.BYTE004  $  ASCII(X1,X2,X3);
  $  197.MNC移动网络码                        $    $               $    $  ANS039.BYTE007  $  ASCII(X1,X2,X3);
  $  198.信号强度                             $    $               $    $  ANS040.BYTE004  $  y=(x1*256+x2)*0.1-150;
  $  199.使用SIM卡种类                        $    $               $    $  ANS040.BYTE006  $  if((x&0xC0)==0x00)y=@03fe;else if((x&0xC0)==0x40)y=@033b;else y=@01a9;
  $  200.网络制式                             $    $               $    $  ANS040.BYTE006  $  if((x&0x38)==0x08)y=@03e2;else if((x&0x38)==0x10)y=@0400;else if((x&0x38)==0x18)y=@03e4;else if((x&0x38)==0x20)y=@03e5;else if((x&0x38)==0x28)y=@0562;else if((x&0x38)==0x30)y=@03e7;else y=@03e1;
  $  201.接收到的信号强度显示                 $    $               $    $  ANS040.BYTE006  $  y=x1&0x07;
  $  202.网络状态                             $    $               $    $  ANS040.BYTE007  $  if(x==0x00)y=@03e8;else if(x==0x01)y=@03e9;else if(x==0x02)y=@03ea;else if(x==0x03)y=@055d;else if(x==0x04)y=@01e5;else if(x==0x05)y=@03ec;else y=@01a9;
  $  203.Modem温度                            $    $  degree C     $    $  ANS041.BYTE004  $  y=x-127;
  $  204.PDP连接成功次数                      $    $               $    $  ANS042.BYTE004  $  y=x1*256+x2;
  $  205.PDP连接失败次数                      $    $               $    $  ANS042.BYTE006  $  y=x1*256+x2;
  $  206.PDP断掉次数                          $    $               $    $  ANS042.BYTE008  $  y=x1*256+x2;
  $  207.无效时间                             $    $               $    $  ANS043.BYTE004  $  y=(x&0xF0)/16;
  $  208.PIN码锁定状态                        $    $               $    $  ANS043.BYTE004  $  if((x&0x01)==0x01)y=@0055;else y=@0404;
  $  209.PIN码剩余锁定时间                    $    $  min          $    $  ANS043.BYTE005  $  y=x1*256+x2;
  $  210.Modem唤醒                            $    $               $    $  ANS044.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  211.CAN2唤醒                             $    $               $    $  ANS044.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  212.CAN1唤醒                             $    $               $    $  ANS044.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  213.周期性唤醒                           $    $               $    $  ANS044.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  214.TBOX系统时间                         $    $  s            $    $  ANS045.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  215.TBOX通讯ID                           $    $               $    $  ANS046.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  216.进入休眠模式时间                     $    $  d            $    $  ANS047.BYTE004  $  y=x;
  $  217.允许周期唤醒时间                     $    $  d            $    $  ANS047.BYTE005  $  y=x;
  $  218.允许周期唤醒时间                     $    $  min          $    $  ANS047.BYTE006  $  y=x*10;
  $  219.TBOX温度                             $    $  degree C     $    $  ANS048.BYTE004  $  y=x-127;
  $  220.后台IP地址                           $    $               $    $  ANS049.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  221.后台IP端口                           $    $               $    $  ANS050.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6);
  $  222.短信服务号码                         $    $               $    $  ANS051.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20,x21,x22,x23,x24,x25,x26,x27,x28,x29,x30,x31,x32);
  $  223.Bcall回拨时间                        $    $  H            $    $  ANS052.BYTE004  $  y=x*0.1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:711 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
