
    车型ID：1015

    模拟：协议模拟-->1015

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/15000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 A2 00 00 00 00       $%  ANS004:769 03 22 F1 A2 00 00 00 00
  $%  REQ005:761 03 22 F1 87 00 00 00 00       $%  ANS005:769 03 22 F1 87 00 00 00 00
  $%  REQ006:761 03 22 F1 10 00 00 00 00       $%  ANS006:769 03 22 F1 10 00 00 00 00
  $%  REQ007:761 03 22 F1 92 00 00 00 00       $%  ANS007:769 03 22 F1 92 00 00 00 00
  $%  REQ008:761 03 22 F1 8C 00 00 00 00       $%  ANS008:769 03 22 F1 8C 00 00 00 00
  $%  REQ009:761 03 22 F1 94 00 00 00 00       $%  ANS009:769 03 22 F1 94 00 00 00 00
  $%  REQ010:761 03 22 F1 8A 00 00 00 00       $%  ANS010:769 03 22 F1 8A 00 00 00 00
  $%  REQ011:761 03 22 F1 90 00 00 00 00       $%  ANS011:769 03 22 F1 90 00 00 00 00
  $%  REQ012:761 03 22 F1 A8 00 00 00 00       $%  ANS012:769 03 22 F1 A8 00 00 00 00
  $%  REQ013:761 03 22 F1 8B 00 00 00 00       $%  ANS013:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  012:系统供应商识别码:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:VIN码:                           $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  015:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 D0 07 00 00 00 00       $  ANS000:769 03 22 D0 07 00 00 00 00
  $  REQ001:761 03 22 E0 0C 00 00 00 00       $  ANS001:769 03 22 E0 0C 00 00 00 00
  $  REQ002:761 03 22 E0 0D 00 00 00 00       $  ANS002:769 03 22 E0 0D 00 00 00 00
  $  REQ003:761 03 22 E0 03 00 00 00 00       $  ANS003:769 03 22 E0 03 00 00 00 00
  $  REQ004:761 03 22 E0 13 00 00 00 00       $  ANS004:769 03 22 E0 13 00 00 00 00
  $  REQ005:761 03 22 E0 12 00 00 00 00       $  ANS005:769 03 22 E0 12 00 00 00 00
  $  REQ006:761 03 22 E0 21 00 00 00 00       $  ANS006:769 03 22 E0 21 00 00 00 00
  $  REQ007:761 03 22 E0 20 00 00 00 00       $  ANS007:769 03 22 E0 20 00 00 00 00
  $  REQ008:761 03 22 E0 11 00 00 00 00       $  ANS008:769 03 22 E0 11 00 00 00 00
  $  REQ009:761 03 22 E0 0F 00 00 00 00       $  ANS009:769 03 22 E0 0F 00 00 00 00
  $  REQ010:761 03 22 E0 1D 00 00 00 00       $  ANS010:769 03 22 E0 1D 00 00 00 00
  $  REQ011:761 03 22 E0 26 00 00 00 00       $  ANS011:769 03 22 E0 26 00 00 00 00
  $  REQ012:761 03 22 E0 27 00 00 00 00       $  ANS012:769 03 22 E0 27 00 00 00 00
  $  REQ013:761 03 22 E0 25 00 00 00 00       $  ANS013:769 03 22 E0 25 00 00 00 00
  $  REQ014:761 03 22 E0 10 00 00 00 00       $  ANS014:769 03 22 E0 10 00 00 00 00
  $  REQ015:761 03 22 E0 0E 00 00 00 00       $  ANS015:769 03 22 E0 0E 00 00 00 00
  $  REQ016:761 03 22 D0 08 00 00 00 00       $  ANS016:769 03 22 D0 08 00 00 00 00
  $  REQ017:761 03 22 D0 04 00 00 00 00       $  ANS017:769 03 22 D0 04 00 00 00 00
  $  REQ018:761 03 22 D0 03 00 00 00 00       $  ANS018:769 03 22 D0 03 00 00 00 00
  $  REQ019:761 03 22 D0 06 00 00 00 00       $  ANS019:769 03 22 D0 06 00 00 00 00
  $  REQ020:761 03 22 D0 05 00 00 00 00       $  ANS020:769 03 22 D0 05 00 00 00 00
  $  REQ021:761 03 22 E0 1C 00 00 00 00       $  ANS021:769 03 22 E0 1C 00 00 00 00
  $  REQ022:761 03 22 E0 1E 00 00 00 00       $  ANS022:769 03 22 E0 1E 00 00 00 00
  $  REQ023:761 03 22 E0 1B 00 00 00 00       $  ANS023:769 03 22 E0 1B 00 00 00 00
  $  REQ024:761 03 22 E0 22 00 00 00 00       $  ANS024:769 03 22 E0 22 00 00 00 00
  $  REQ025:761 03 22 E0 09 00 00 00 00       $  ANS025:769 03 22 E0 09 00 00 00 00
  $  REQ026:761 03 22 E0 0A 00 00 00 00       $  ANS026:769 03 22 E0 0A 00 00 00 00
  $  REQ027:761 03 22 E0 0B 00 00 00 00       $  ANS027:769 03 22 E0 0B 00 00 00 00
  $  REQ028:761 03 22 E0 08 00 00 00 00       $  ANS028:769 03 22 E0 08 00 00 00 00
  $  REQ029:761 03 22 D0 02 00 00 00 00       $  ANS029:769 03 22 D0 02 00 00 00 00
  $  REQ030:761 03 22 D0 01 00 00 00 00       $  ANS030:769 03 22 D0 01 00 00 00 00
  $  REQ031:761 03 22 E0 16 00 00 00 00       $  ANS031:769 03 22 E0 16 00 00 00 00
  $  REQ032:761 03 22 E0 19 00 00 00 00       $  ANS032:769 03 22 E0 19 00 00 00 00
  $  REQ033:761 03 22 D0 00 00 00 00 00       $  ANS033:769 03 22 D0 00 00 00 00 00
  $  REQ034:761 03 22 E0 23 00 00 00 00       $  ANS034:769 03 22 E0 23 00 00 00 00
  $  REQ035:761 03 22 E0 06 00 00 00 00       $  ANS035:769 03 22 E0 06 00 00 00 00
  $  REQ036:761 03 22 C0 10 00 00 00 00       $  ANS036:769 03 22 C0 10 00 00 00 00
  $  REQ037:761 03 22 C0 11 00 00 00 00       $  ANS037:769 03 22 C0 11 00 00 00 00
  $  REQ038:761 03 22 C0 12 00 00 00 00       $  ANS038:769 03 22 C0 12 00 00 00 00
  $  REQ039:761 03 22 C0 13 00 00 00 00       $  ANS039:769 03 22 C0 13 00 00 00 00
  $  REQ040:761 03 22 C0 14 00 00 00 00       $  ANS040:769 03 22 C0 14 00 00 00 00
  $  REQ041:761 03 22 E0 17 00 00 00 00       $  ANS041:769 03 22 E0 17 00 00 00 00
  $  REQ042:761 03 22 E0 18 00 00 00 00       $  ANS042:769 03 22 E0 18 00 00 00 00
  $  REQ043:761 03 22 E0 07 00 00 00 00       $  ANS043:769 03 22 E0 07 00 00 00 00
  $  REQ044:761 03 22 E0 24 00 00 00 00       $  ANS044:769 03 22 E0 24 00 00 00 00
  $  REQ045:761 03 22 E0 04 00 00 00 00       $  ANS045:769 03 22 E0 04 00 00 00 00
  $  REQ046:761 03 22 E0 05 00 00 00 00       $  ANS046:769 03 22 E0 05 00 00 00 00
  $  REQ047:761 03 22 E0 00 00 00 00 00       $  ANS047:769 03 22 E0 00 00 00 00 00
  $  REQ048:761 03 22 E0 01 00 00 00 00       $  ANS048:769 03 22 E0 01 00 00 00 00
  $  REQ049:761 03 22 E0 1A 00 00 00 00       $  ANS049:769 03 22 E0 1A 00 00 00 00
  $  REQ050:761 03 22 E0 15 00 00 00 00       $  ANS050:769 03 22 E0 15 00 00 00 00
  $  REQ051:761 03 22 C0 01 00 00 00 00       $  ANS051:769 03 22 C0 01 00 00 00 00
  $  REQ052:761 03 22 C0 02 00 00 00 00       $  ANS052:769 03 22 C0 02 00 00 00 00
  $  REQ053:761 03 22 C0 03 00 00 00 00       $  ANS053:769 03 22 C0 03 00 00 00 00
  $  REQ054:761 03 22 C0 04 00 00 00 00       $  ANS054:769 03 22 C0 04 00 00 00 00
  $  REQ055:761 03 22 C0 05 00 00 00 00       $  ANS055:769 03 22 C0 05 00 00 00 00
  $  REQ056:761 03 22 C0 06 00 00 00 00       $  ANS056:769 03 22 C0 06 00 00 00 00
  $  REQ057:761 03 22 C0 07 00 00 00 00       $  ANS057:769 03 22 C0 07 00 00 00 00
  $  REQ058:761 03 22 C0 08 00 00 00 00       $  ANS058:769 03 22 C0 08 00 00 00 00
  $  REQ059:761 03 22 C0 09 00 00 00 00       $  ANS059:769 03 22 C0 09 00 00 00 00
  $  REQ060:761 03 22 C0 0A 00 00 00 00       $  ANS060:769 03 22 C0 0A 00 00 00 00
  $  REQ061:761 03 22 C0 0B 00 00 00 00       $  ANS061:769 03 22 C0 0B 00 00 00 00
  $  REQ062:761 03 22 C0 0C 00 00 00 00       $  ANS062:769 03 22 C0 0C 00 00 00 00
  $  REQ063:761 03 22 C0 0D 00 00 00 00       $  ANS063:769 03 22 C0 0D 00 00 00 00
  $  REQ064:761 03 22 C0 0E 00 00 00 00       $  ANS064:769 03 22 C0 0E 00 00 00 00
  $  REQ065:761 03 22 C0 0F 00 00 00 00       $  ANS065:769 03 22 C0 0F 00 00 00 00
  $  REQ066:761 03 22 E0 02 00 00 00 00       $  ANS066:769 03 22 E0 02 00 00 00 00

  $  000.FICM恢复出厂默认请求                                                  $    $               $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  001.FICM时间有效性                                                        $    $               $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@0136;else y=@00bb;
  $  002.FICM DDD疲劳提醒功能状态                                              $    $               $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@08cb;else y=@08cc;
  $  003.BSD开关状态有效性                                                     $    $               $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@0136;else y=@00bb;
  $  004.FICM LDW精度                                                          $    $               $    $  ANS000.BYTE004  $  if((x&0x0C)==0x00)y=@08cd;else if((x&0x0C)==0x04)y=@06c7;else if((x&0x0C)==0x08)y=@06cb;else y=@0004;
  $  005.FICM车辆保养状态                                                      $    $               $    $  ANS000.BYTE004  $  if((x&0x03)==0x00)y=@061c;else if((x&0x03)==0x01)y=@061d;else if((x&0x03)==0x02)y=@064e;else y=@0004;
  $  006.FICM娱乐系统设置超速值有效性                                          $    $               $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@0136;else y=@00bb;
  $  007.盲点检测开关状态                                                      $    $               $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@08a5;else y=@08a6;
  $  008.时间显示格式调整                                                      $    $               $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@08a7;else y=@08a8;
  $  009.日历调整请求激活                                                      $    $               $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  010.日历月份调整                                                          $    $               $    $  ANS000.BYTE004  $  if((x&0xF)==0x00)y=@01a9;else if((x&0xF0)==0x01)y=@08a9;else if((x&0xF0)==0x02)y=@08aa;else if((x&0xF0)==0x03)y=@08ab;else if((x&0xF0)==0x04)y=@08ac;else if((x&0xF0)==0x05)y=@08ad;else if((x&0xF0)==0x06)y=@08ae;else if((x&0xF0)==0x07)y=@08af;else if((x&0xF0)==0x08)y=@08b0;else if((x&0xF0)==0x09)y=@08b1;else if((x&0xF0)==0x0A)y=@08b2;else if((x&0xF0)==0x0B)y=@08b3;else if((x&0xF0)==0x0C)y=@08b4;else y=@0004;
  $  011.语言设置调整请求激活                                                  $    $               $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  012.语言设置                                                              $    $               $    $  ANS000.BYTE004  $  if(x==0x00)y=@074a;else if(x==0x01)y=@074b;else if(x==0x02)y=@074c;else if(x==0x03)y=@08b5;else if(x==0x04)y=@08b6;else if(x==0x05)y=@08b7;else if(x==0x06)y=@08b8;else if(x==0x07)y=@08b9;else if(x==0x08)y=@08ba;else if(x==0x09)y=@08bb;else if(x==0x0A)y=@08bc;else if(x==0x0B)y=@08bd;else if(x==0x0C)y=@08be;else if(x==0x0D)y=@08bf;else if(x==0x0E)y=@08c0;else if(x==0x0F)y=@08c1;else if(x==0x10)y=@08c2;else if(x==0x11)y=@08c3;else if(x==0x12)y=@08c4;else if(x==0x13)y=@08c5;else if(x==0x14)y=@08c6;else if(x==0x15)y=@08c7;else if(x==0x16)y=@08c8;else if(x==0x17)y=@08c9;else if(x==0x18)y=@08ca;else y=@01a9;
  $  013.加速踏板位置                                                          $    $  %            $    $  ANS001.BYTE004  $  y=x*0.4;
  $  014.加速器有效位置                                                        $    $  %            $    $  ANS002.BYTE004  $  y=x*0.4;
  $  015.加速器X                                                               $    $  m/s^2        $    $  ANS003.BYTE004  $  y=(x1*256+x2)*7/256.0-22.0;
  $  016.背光高度                                                              $    $  %            $    $  ANS004.BYTE004  $  y=x*0.4;
  $  017.大气压力绝对值                                                        $    $  kPa          $    $  ANS005.BYTE004  $  y=x*0.5;
  $  018.日历日期调整                                                          $    $               $    $  ANS006.BYTE004  $  y=x;
  $  019.日历年份调整                                                          $    $               $    $  ANS007.BYTE004  $  y=2000+x;
  $  020.巡航控制驾驶员设置的速度                                              $    $  km/h         $    $  ANS008.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  021.发动机转速                                                            $    $  rpm          $    $  ANS009.BYTE004  $  y=(x1*256+x2)*0.25;
  $  022.蒸发箱温度                                                            $    $  degree C     $    $  ANS010.BYTE004  $  y=x-40;
  $  023.FICM娱乐系统小时时间                                                  $    $               $    $  ANS011.BYTE004  $  y=x;
  $  024.FICM分钟                                                              $    $               $    $  ANS012.BYTE004  $  y=x;
  $  025.FICM娱乐系统超速值设置                                                $    $  km/h         $    $  ANS013.BYTE004  $  y=x;
  $  026.燃油消耗                                                              $    $  km/L         $    $  ANS014.BYTE004  $  y=(x1*256+x2)*0.0425144;
  $  027.燃油液位                                                              $    $  %            $    $  ANS015.BYTE004  $  y=x*0.4;
  $  028.变速箱换挡杆                                                          $    $               $    $  ANS016.BYTE004  $  if((x&0xF0)==0x00)y=@0514;else if((x&0xF0)==0x10)y=@00b4;else if((x&0xF0)==0x20)y=@0388;else if((x&0xF0)==0x30)y=@0515;else if((x&0xF0)==0x40)y=@0516;else if((x&0xF0)==0x50)y=@0517;else if((x&0xF0)==0x60)y=@0518;else if((x&0xF0)==0x70)y=@0519;else if((x&0xF0)==0x80)y=@051a;else if((x&0xF0)==0x90)y=@051b;else if((x&0xF0)==0xA0)y=@051c;else if((x&0xF0)==0xB0)y=@051d;else if((x&0xF0)==0xF0)y=@051e;else y=@01a9;
  $  029.变速箱换挡杆位置有效性                                                $    $               $    $  ANS016.BYTE004  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  030.SAS校准状态                                                           $    $               $    $  ANS016.BYTE004  $  if((x&0x04)==0x04)y=@06f4;else y=@06f5;
  $  031.Ax输出状态                                                            $    $               $    $  ANS016.BYTE004  $  if((x&0x02)==0x02)y=@0136;else y=@00bb;
  $  032.车速状态                                                              $    $               $    $  ANS016.BYTE004  $  if((x&0x01)==0x01)y=@0136;else y=@00bb;
  $  033.日间行车灯状态                                                        $    $               $    $  ANS017.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  034.背光灯状态                                                            $    $               $    $  ANS017.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  035.背光亮度有效性                                                        $    $               $    $  ANS017.BYTE004  $  if((x&0x01)==0x01)y=@0136;else y=@00bb;
  $  036.自动灯光控制                                                          $    $               $    $  ANS017.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  037.尾门开关状态                                                          $    $               $    $  ANS017.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  038.左后侧门开关状态                                                      $    $               $    $  ANS017.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  039.右后侧门开关状态                                                      $    $               $    $  ANS017.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  040.前排乘务员门开关状态                                                  $    $               $    $  ANS017.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  041.驾驶员门开关状态                                                      $    $               $    $  ANS017.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  042.后雾灯状态                                                            $    $               $    $  ANS017.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  043.前雾灯状态                                                            $    $               $    $  ANS017.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  044.远光灯状态                                                            $    $               $    $  ANS017.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  045.近光灯状态                                                            $    $               $    $  ANS017.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  046.位置灯状态                                                            $    $               $    $  ANS017.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  047.遥控汽车起动状态                                                      $    $               $    $  ANS017.BYTE004  $  if((x&0x10)==0x10)y=@00b2;else y=@0136;
  $  048.前舱开关状态有效性                                                    $    $               $    $  ANS017.BYTE004  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  049.前舱开关状态                                                          $    $               $    $  ANS017.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  050.乘客车门锁定状态                                                      $    $               $    $  ANS017.BYTE004  $  if((x&0x03)==0x00)y=@0404;else if((x&0x03)==0x01)y=@0055;else if((x&0x03)==0x02)y=@0004;else y=@0136;
  $  051.驾驶员侧车门锁定状态                                                  $    $               $    $  ANS017.BYTE004  $  if((x&0xC0)==0x00)y=@0404;else if((x&0xC0)==0x40)y=@0055;else if((x&0xC0)==0x80)y=@0004;else y=@0136;
  $  052.倒挡                                                                  $    $               $    $  ANS017.BYTE004  $  if((x&0x20)==0x20)y=@0388;else y=@0669;
  $  053.右转向灯状态                                                          $    $               $    $  ANS017.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  054.左转向灯状态                                                          $    $               $    $  ANS017.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  055.系统电源模式有效性                                                    $    $               $    $  ANS017.BYTE004  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  056.系统电源模式                                                          $    $               $    $  ANS017.BYTE004  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@089b;else if((x&0x03)==0x02)y=@009d;else y=@05d2;
  $  057.绝对大气压力的有效性                                                  $    $               $    $  ANS018.BYTE004  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  058.燃油液位百分比有效性                                                  $    $               $    $  ANS018.BYTE004  $  if((x&0x03)==0x00)y=@04dc;else if((x&0x03)==0x01)y=@089c;else if((x&0x03)==0x02)y=@089d;else y=@04dc;
  $  059.冷却风扇级别反馈                                                      $    $               $    $  ANS018.BYTE004  $  if((x&0xF0)==0x00)y=@0659;else if((x&0xF0)==0x10)y=@04f8;else if((x&0xF0)==0x20)y=@04f7;else if((x&0xF0)==0x30)y=@04f6;else if((x&0xF0)==0x40)y=@04f5;else if((x&0xF0)==0x50)y=@04f4;else if((x&0xF0)==0x60)y=@065a;else if((x&0xF0)==0x70)y=@065b;else if((x&0xF0)==0x80)y=@065c;else if((x&0xF0)==0x90)y=@065d;else if((x&0xF0)==0xA0)y=@065e;else if((x&0xF0)==0xB0)y=@065f;else if((x&0xF0)==0xC0)y=@0660;else if((x&0xF0)==0xD0)y=@0661;else if((x&0xF0)==0xE0)y=@0662;else y=@0663;
  $  060.加速器有效位置有效性                                                  $    $               $    $  ANS018.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  061.油门踏板位置有效性                                                    $    $               $    $  ANS018.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  062.巡航控制激活                                                          $    $               $    $  ANS018.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  063.发动机运行激活                                                        $    $               $    $  ANS018.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  064.HVAC双显示指令                                                        $    $               $    $  ANS019.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  065.右前座椅加热级别                                                      $    $               $    $  ANS019.BYTE004  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@06c7;else if((x&0x03)==0x02)y=@06c9;else y=@06cb;
  $  066.HVAC自动显示指令                                                      $    $               $    $  ANS019.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  067.左前座椅加热状态                                                      $    $               $    $  ANS019.BYTE004  $  if((x&0x60)==0x00)y=@000f;else if((x&0x60)==0x20)y=@06c7;else if((x&0x60)==0x40)y=@06c9;else y=@06cb;
  $  068.HVAC采暖通风和空调系统环境温度掩码                                    $    $               $    $  ANS019.BYTE004  $  if((x&0x10)==0x10)y=@060e;else y=@0892;
  $  069.HVAC空气净化指示灯状态有效性                                          $    $               $    $  ANS019.BYTE004  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  070.HVAC空气净化指示灯状态                                                $    $               $    $  ANS019.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  071.HVAC采暖通风和空调系统自动显示状态有效性                              $    $               $    $  ANS019.BYTE004  $  if((x&0x02)==0x02)y=@0136;else y=@00bb;
  $  072.HVAC采暖通风和空调系统自动模式指示灯状态                              $    $               $    $  ANS019.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  073.HVAC采暖通风和空调系统后除霜状态有效性                                $    $               $    $  ANS019.BYTE004  $  if((x&0x80)==0x80)y=@0136;else y=@00bb;
  $  074.HVAC采暖通风和空调系统后除霜状态                                      $    $               $    $  ANS019.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  075.HVAC采暖通风和空调系统前除霜状态有效性                                $    $               $    $  ANS019.BYTE004  $  if((x&0x20)==0x20)y=@0136;else y=@00bb;
  $  076.HVAC采暖通风和空调系统前除霜状态                                      $    $               $    $  ANS019.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  077.HVAC采暖通风和空调系统状态有效性                                      $    $               $    $  ANS019.BYTE004  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  078.HVAC采暖通风和空调系统状态                                            $    $               $    $  ANS019.BYTE004  $  if((x&0x04)==0x04)y=@0893;else y=@0894;
  $  079.HVAC采暖通风和空调系统循环模式                                        $    $               $    $  ANS019.BYTE004  $  if((x&0x03)==0x00)y=@012b;else if((x&0x03)==0x01)y=@0895;else if((x&0x03)==0x02)y=@0896;else y=@0136;
  $  080.HVAC采暖通风和空调系统模式                                            $    $               $    $  ANS019.BYTE004  $  if((x&0xF0)==0x00)y=@012b;else if((x&0xF0)==0x10)y=@0897;else if((x&0xF0)==0x30)y=@0898;else if((x&0xF0)==0x40)y=@0899;else if((x&0xF0)==0x50)y=@089a;else if((x&0xF0)==0xF0)y=@0136;else y=@0004;
  $  081.HVAC风量                                                              $    $               $    $  ANS019.BYTE004  $  if((x&0x0F)==0x00)y=@04d4;else if((x&0x0F)==0x01)y=@04d3;else if((x&0x0F)==0x02)y=@0169;else if((x&0x0F)==0x03)y=@016a;else if((x&0x0F)==0x04)y=@016b;else if((x&0x0F)==0x05)y=@054a;else if((x&0x0F)==0x06)y=@054b;else if((x&0x0F)==0x07)y=@054c;else if((x&0x0F)==0x08)y=@054d;else if((x&0x0F)==0x0F)y=@0136;else y=@0004;
  $  082.轮胎检测系统灯状态                                                    $    $               $    $  ANS020.BYTE004  $  if((x&0x10)==0x10)y=@046c;else y=@046a;
  $  083.轮胎位置                                                              $    $               $    $  ANS020.BYTE004  $  if((x&0x07)==0x00)y=@06fa;else if((x&0x07)==0x01)y=@06fb;else if((x&0x07)==0x02)y=@06fc;else if((x&0x07)==0x03)y=@06fd;else if((x&0x07)==0x04)y=@06fe;else if((x&0x07)==0x07)y=@0136;else y=@0004;
  $  084.胎压检测系统信号状态                                                  $    $               $    $  ANS020.BYTE004  $  if((x&0x80)==0x80)y=@08a4;else y=@0701;
  $  085.胎压检测系统温度警告                                                  $    $               $    $  ANS020.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  086.左后胎压力警告                                                        $    $               $    $  ANS020.BYTE004  $  if((x&0x38)==0x00)y=@05c2;else if((x&0x38)==0x08)y=@05c4;else if((x&0x38)==0x10)y=@05c5;else if((x&0x38)==0x18)y=@05c6;else if((x&0x38)==0x20)y=@05c7;else if((x&0x38)==0x28)y=@05c8;else if((x&0x38)==0x30)y=@05c9;else y=@05ca;
  $  087.右后胎压力警告                                                        $    $               $    $  ANS020.BYTE004  $  if((x&0x07)==0x00)y=@05c2;else if((x&0x07)==0x01)y=@05c4;else if((x&0x07)==0x02)y=@05c5;else if((x&0x07)==0x03)y=@05c6;else if((x&0x07)==0x04)y=@05c7;else if((x&0x07)==0x05)y=@05c8;else if((x&0x07)==0x06)y=@05c9;else y=@05ca;
  $  088.胎压检测系统状态                                                      $    $               $    $  ANS020.BYTE004  $  if((x&0xC0)==0x00)y=@05c3;else if((x&0xC0)==0x40)y=@00d3;else if((x&0xC0)==0x80)y=@00d4;else y=@0004;
  $  089.右前胎压力警告                                                        $    $               $    $  ANS020.BYTE004  $  if((x&0x38)==0x00)y=@05c2;else if((x&0x38)==0x08)y=@05c4;else if((x&0x38)==0x10)y=@05c5;else if((x&0x38)==0x18)y=@05c6;else if((x&0x38)==0x20)y=@05c7;else if((x&0x38)==0x28)y=@05c8;else if((x&0x38)==0x30)y=@05c9;else y=@05ca;
  $  090.左前胎压力警告                                                        $    $               $    $  ANS020.BYTE004  $  if((x&0x07)==0x00)y=@05c2;else if((x&0x07)==0x01)y=@05c4;else if((x&0x07)==0x02)y=@05c5;else if((x&0x07)==0x03)y=@05c6;else if((x&0x07)==0x04)y=@05c7;else if((x&0x07)==0x05)y=@05c8;else if((x&0x07)==0x06)y=@05c9;else y=@05ca;
  $  091.HVAC采暖通风和空调环境温度                                            $    $  degree C     $    $  ANS021.BYTE004  $  y=x*0.5-30;
  $  092.汽车当前温度                                                          $    $  degree C     $    $  ANS022.BYTE004  $  y=x*0.5-30;
  $  093.HVAC设定温度                                                          $    $  degree C     $    $  ANS023.BYTE004  $  y=x-40;
  $  094.小时调整                                                              $    $               $    $  ANS024.BYTE004  $  y=x;
  $  095.仪表显示平均油耗                                                      $    $  L/100km      $    $  ANS025.BYTE004  $  y=x;
  $  096.仪表显示瞬时油耗                                                      $    $  L/100km      $    $  ANS026.BYTE004  $  y=x*0.1;
  $  097.仪表显示的车速                                                        $    $  km/h         $    $  ANS027.BYTE004  $  y=x;
  $  098.仪表显示剩余驾驶距离                                                  $    $  km           $    $  ANS028.BYTE004  $  y=x1*256+x2;
  $  099.仪表显示TPMS警告                                                      $    $               $    $  ANS029.BYTE004  $  if((x&0x04)==0x04)y=@0135;else y=@05c2;
  $  100.仪表显示清洗器流速低警告                                              $    $               $    $  ANS029.BYTE004  $  if((x&0x02)==0x02)y=@0135;else y=@05c2;
  $  101.仪表显示安全秘钥电池低警告                                            $    $               $    $  ANS029.BYTE004  $  if((x&0x01)==0x01)y=@0135;else y=@05c2;
  $  102.仪表显示冷却液温度警告                                                $    $               $    $  ANS029.BYTE004  $  if((x&0x80)==0x80)y=@0135;else y=@05c2;
  $  103.仪表显示AFS系统警告                                                   $    $               $    $  ANS029.BYTE004  $  if((x&0x40)==0x40)y=@0135;else y=@05c2;
  $  104.仪表显示油压低警告                                                    $    $               $    $  ANS029.BYTE004  $  if((x&0x20)==0x20)y=@0135;else y=@05c2;
  $  105.仪表显示发电机警告                                                    $    $               $    $  ANS029.BYTE004  $  if((x&0x10)==0x10)y=@0135;else y=@05c2;
  $  106.仪表显示TCU警告                                                       $    $               $    $  ANS029.BYTE004  $  if((x&0x80)==0x80)y=@0135;else y=@05c2;
  $  107.仪表显示燃油警告                                                      $    $               $    $  ANS029.BYTE004  $  if((x&0x40)==0x40)y=@0135;else y=@05c2;
  $  108.仪表显示的信息掩码                                                    $    $               $    $  ANS029.BYTE004  $  if((x&0x20)==0x20)y=@060e;else y=@060f;
  $  109.仪表显示TCCU警告                                                      $    $               $    $  ANS029.BYTE004  $  if((x&0x10)==0x10)y=@0135;else y=@05c2;
  $  110.仪表显示MIL(发动机故障灯)警告                                         $    $               $    $  ANS029.BYTE004  $  if((x&0x08)==0x08)y=@0135;else y=@05c2;
  $  111.仪表显示SRS警告                                                       $    $               $    $  ANS029.BYTE004  $  if((x&0x04)==0x04)y=@0135;else y=@05c2;
  $  112.仪表显示制动系统警告                                                  $    $               $    $  ANS029.BYTE004  $  if((x&0x02)==0x02)y=@0135;else y=@05c2;
  $  113.仪表显示ESP警告                                                       $    $               $    $  ANS029.BYTE004  $  if((x&0x01)==0x01)y=@0135;else y=@05c2;
  $  114.仪表显示EBD警告                                                       $    $               $    $  ANS029.BYTE004  $  if((x&0x80)==0x80)y=@0135;else y=@05c2;
  $  115.仪表显示ABS警告                                                       $    $               $    $  ANS029.BYTE004  $  if((x&0x40)==0x40)y=@0135;else y=@05c2;
  $  116.仪表上平均油耗有效性                                                  $    $               $    $  ANS029.BYTE004  $  if((x&0x20)==0x20)y=@0136;else y=@00bb;
  $  117.仪表上驾驶员安全带警告                                                $    $               $    $  ANS029.BYTE004  $  if((x&0x10)==0x10)y=@0135;else y=@05c2;
  $  118.系统备份电源模式有效性                                                $    $               $    $  ANS029.BYTE004  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  119.系统备用电源模式已启用                                                $    $               $    $  ANS029.BYTE004  $  if((x&0x04)==0x04)y=@00dc;else y=@000f;
  $  120.系统备用电源模式状态                                                  $    $               $    $  ANS029.BYTE004  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@089b;else if((x&0x03)==0x02)y=@009d;else y=@05d2;
  $  121.全局KL.50状态                                                         $    $               $    $  ANS030.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  122.全局发动机运行状态                                                    $    $               $    $  ANS030.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  123.全局KL.15状态                                                         $    $               $    $  ANS030.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  124.全局KL.R状态                                                          $    $               $    $  ANS030.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  125.系统KL.50状态                                                         $    $               $    $  ANS030.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  126.系统发动机运行状态                                                    $    $               $    $  ANS030.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  127.系统KL.15状态                                                         $    $               $    $  ANS030.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  128.系统KL.R状态                                                          $    $               $    $  ANS030.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  129.左前轮胎压力                                                          $    $  kPa          $    $  ANS031.BYTE004  $  y=x*2.75;
  $  130.左后轮胎压力                                                          $    $  kPa          $    $  ANS032.BYTE004  $  y=x*2.75;
  $  131.TFT LVDS液晶屏的视频信号接口锁定状态(当锁定的TFT显示屏正在工作)       $    $               $    $  ANS033.BYTE004  $  if((x&0x08)==0x08)y=@0055;else y=@0404;
  $  132.触摸中断                                                              $    $               $    $  ANS033.BYTE004  $  if((x&0x04)==0x04)y=@089e;else y=@089f;
  $  133.通信状态                                                              $    $               $    $  ANS033.BYTE004  $  if((x&0x02)==0x02)y=@0339;else y=@0354;
  $  134.电源状态                                                              $    $               $    $  ANS033.BYTE004  $  if((x&0x01)==0x01)y=@0474;else y=@00e5;
  $  135.分钟调整                                                              $    $               $    $  ANS034.BYTE004  $  y=x;
  $  136.仪表总里程                                                            $    $  km           $    $  ANS035.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  137.LDW车道偏离预警系统敏感度配置                                         $    $               $    $  ANS036.BYTE006  $  if(x==0x00)y=@06c7;else if(x==0x01)y=@08ce;else if(x==0x02)y=@06cb;else y=@01a9;
  $  138.BSD盲点检测系统配置                                                   $    $               $    $  ANS037.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  139.DDD疲劳提醒警报配置                                                   $    $               $    $  ANS037.BYTE005  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  140.亮灯时间                                                              $    $               $    $  ANS038.BYTE004  $  if((x&0x30)==0x00)y=@0491;else if((x&0x30)==0x10)y=@0492;else if((x&0x30)==0x20)y=@0493;else y=@01a9;
  $  141.FMH伴我回家照明灯(寻车灯)开关配置                                     $    $               $    $  ANS038.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  142.寻车反馈配置                                                          $    $               $    $  ANS038.BYTE005  $  if(x==0x00)y=@0506;else if(x==0x01)y=@08ee;else y=@01a9;
  $  143.无钥匙解锁配置                                                        $    $               $    $  ANS038.BYTE006  $  if((x&0x20)==0x20)y=@08a0;else y=@08a1;
  $  144.钥匙解锁配置                                                          $    $               $    $  ANS038.BYTE006  $  if((x&0x10)==0x10)y=@08a0;else y=@08a1;
  $  145.上锁反馈配置                                                          $    $               $    $  ANS038.BYTE006  $  if((x&0x0C)==0x00)y=@01a9;else if((x&0x0C)==0x04)y=@0505;else if((x&0x0C)==0x08)y=@0506;else y=@0504;
  $  146.熄火自动解锁                                                          $    $               $    $  ANS038.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  147.行车自动锁定                                                          $    $               $    $  ANS038.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  148.方向盘自定义配置                                                      $    $               $    $  ANS039.BYTE004  $  if(x==0x00)y=@08ef;else if(x==0x01)y=@08f0;else y=@01a9;
  $  149.语言配置                                                              $    $               $    $  ANS040.BYTE004  $  if(x==0x00)y=@074a;else if(x==0x01)y=@0901;else if(x==0x02)y=@08bf;else if(x==0x03)y=@08ca;else if(x==0x04)y=@08b7;else y=@01a9;
  $  150.右前轮胎压力                                                          $    $  kPa          $    $  ANS041.BYTE004  $  y=x*2.75;
  $  151.右后轮胎压力                                                          $    $  kPa          $    $  ANS042.BYTE004  $  y=x*2.75;
  $  152.仪表保养间隔里程数                                                    $    $  km           $    $  ANS043.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  153.秒调整                                                                $    $               $    $  ANS044.BYTE004  $  y=x;
  $  154.转向角                                                                $    $  rad          $    $  ANS045.BYTE004  $  y=(x1*256+x2)*0.1-780;
  $  155.转向速度                                                              $    $  rad/s        $    $  ANS046.BYTE004  $  y=x*4;
  $  156.供电电压                                                              $    $  V            $    $  ANS047.BYTE004  $  y=x*0.1;
  $  157.TFT显示屏启用                                                         $    $               $    $  ANS048.BYTE004  $  if(x==0x01)y=@08a2;else if(x==0x02)y=@08a3;else y=@01a9;
  $  158.轮胎温度                                                              $    $  degree C     $    $  ANS049.BYTE004  $  y=x-40;
  $  159.BCM的VIN码                                                            $    $               $    $  ANS050.BYTE004  $  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $  160.车身颜色类型配置                                                      $    $               $    $  ANS051.BYTE004  $  if(x==0x00)y=@08f1;else if(x==0x01)y=@06e3;else if(x==0x02)y=@06e4;else if(x==0x03)y=@06e5;else if(x==0x04)y=@06e6;else if(x==0x05)y=@06e7;else if(x==0x06)y=@06e8;else if(x==0x07)y=@06e9;else if(x==0x08)y=@08f2;else if(x==0x09)y=@06eb;else if(x==0x0A)y=@06ec;else if(x==0x0B)y=@06ed;else y=@01a9;
  $  161.空调类型配置                                                          $    $               $    $  ANS051.BYTE005  $  if(x==0x00)y=@08f3;else if(x==0x01)y=@08f4;else if(x==0x02)y=@08f5;else if(x==0x03)y=@08f6;else if(x==0x04)y=@08f7;else y=@01a9;
  $  162.座椅加热类型配置                                                      $    $               $    $  ANS051.BYTE006  $  if(x==0x00)y=@08f8;else if(x==0x01)y=@08f9;else if(x==0x02)y=@08fa;else y=@01a9;
  $  163.胎压监测系统类型配置                                                  $    $               $    $  ANS051.BYTE007  $  if(x==0x00)y=@06f1;else if(x==0x01)y=@06f2;else if(x==0x02)y=@06f3;else y=@01a9;
  $  164.LDW车道偏离预警系统配置                                               $    $               $    $  ANS052.BYTE004  $  if(x==0x00)y=@0902;else if(x==0x01)y=@0903;else y=@01a9;
  $  165.自动紧急制动配置                                                      $    $               $    $  ANS052.BYTE005  $  if(x==0x00)y=@0904;else if(x==0x01)y=@0692;else y=@01a9;
  $  166.360度视野类型配置                                                     $    $               $    $  ANS052.BYTE006  $  if(x==0x00)y=@0721;else if(x==0x01)y=@0722;else if(x==0x02)y=@0692;else y=@01a9;
  $  167.车载显示器类型配置                                                    $    $               $    $  ANS052.BYTE007  $  if(x==0x00)y=@0723;else if(x==0x01)y=@0724;else if(x==0x02)y=@0725;else if(x==0x03)y=@0726;else y=@01a9;
  $  168.后排乘客区电动玻璃                                                    $    $               $    $  ANS053.BYTE004  $  if((x&0x80)==0x80)y=@0445;else y=@0112;
  $  169.后排乘客区电动玻璃一键自动下                                          $    $               $    $  ANS053.BYTE004  $  if((x&0x40)==0x40)y=@0445;else y=@0112;
  $  170.副驾驶员电动玻璃                                                      $    $               $    $  ANS053.BYTE004  $  if((x&0x20)==0x20)y=@0445;else y=@0112;
  $  171.副驾驶员电动玻璃一键自动下                                            $    $               $    $  ANS053.BYTE004  $  if((x&0x10)==0x10)y=@0445;else y=@0112;
  $  172.副驾驶员电动玻璃一键自动上下(带防夹)                                  $    $               $    $  ANS053.BYTE004  $  if((x&0x08)==0x08)y=@0445;else y=@0112;
  $  173.驾驶员电动玻璃                                                        $    $               $    $  ANS053.BYTE004  $  if((x&0x04)==0x04)y=@0445;else y=@0112;
  $  174.驾驶员电动玻璃一键自动下                                              $    $               $    $  ANS053.BYTE004  $  if((x&0x02)==0x02)y=@0445;else y=@0112;
  $  175.驾驶员电动玻璃一键自动上下(带防夹)                                    $    $               $    $  ANS053.BYTE004  $  if((x&0x01)==0x01)y=@0445;else y=@0112;
  $  176.远程信息处理系统类型配置                                              $    $               $    $  ANS053.BYTE005  $  if(x==0x00)y=@08fb;else if(x==0x01)y=@08fc;else if(x==0x02)y=@08fd;else if(x==0x03)y=@08fe;else if(x==0x04)y=@08ff;else if(x==0x05)y=@0900;else y=@01a9;
  $  177.汽车导航配置                                                          $    $               $    $  ANS053.BYTE006  $  if(x==0x00)y=@05aa;else if(x==0x01)y=@0739;else y=@01a9;
  $  178.免提配置                                                              $    $               $    $  ANS053.BYTE007  $  if(x==0x00)y=@073a;else if(x==0x01)y=@073b;else y=@01a9;
  $  179.车载信息娱乐显示级别类型配置                                          $    $               $    $  ANS054.BYTE004  $  if(x==0x00)y=@073c;else if(x==0x01)y=@08dd;else if(x==0x02)y=@08de;else if(x==0x03)y=@08df;else if(x==0x04)y=@073e;else if(x==0x05)y=@073f;else if(x==0x06)y=@08e0;else if(x==0x07)y=@08e1;else y=@01a9;
  $  180.DAB数字音频广播配置                                                   $    $               $    $  ANS054.BYTE005  $  if(x==0x00)y=@0740;else if(x==0x01)y=@0692;else y=@01a9;
  $  181.停车辅助系统类型配置                                                  $    $               $    $  ANS054.BYTE006  $  if(x==0x00)y=@0702;else if(x==0x01)y=@0703;else if(x==0x02)y=@0704;else if(x==0x03)y=@0705;else if(x==0x04)y=@0706;else if(x==0x05)y=@0707;else y=@01a9;
  $  182.右后下摄像头类型配置                                                  $    $               $    $  ANS054.BYTE007  $  if(x==0x00)y=@08e2;else if(x==0x01)y=@08e3;else if(x==0x02)y=@070a;else if(x==0x03)y=@070b;else if(x==0x04)y=@0710;else y=@01a9;
  $  183.方向盘带音量调节配置                                                  $    $               $    $  ANS055.BYTE004  $  if(x==0x00)y=@08e4;else if(x==0x01)y=@0712;else y=@01a9;
  $  184.汽车音频类型配置                                                      $    $               $    $  ANS055.BYTE005  $  if(x==0x00)y=@0714;else if(x==0x01)y=@0715;else if(x==0x02)y=@0716;else if(x==0x03)y=@0717;else y=@01a9;
  $  185.AUX端口配置                                                           $    $               $    $  ANS055.BYTE006  $  if(x==0x00)y=@0718;else if(x==0x01)y=@0719;else y=@01a9;
  $  186.视频输入功能配置                                                      $    $               $    $  ANS055.BYTE007  $  if(x==0x00)y=@071a;else if(x==0x01)y=@071b;else y=@01a9;
  $  187.USB端口类型配置                                                       $    $               $    $  ANS056.BYTE004  $  if(x==0x00)y=@071c;else if(x==0x01)y=@071d;else if(x==0x02)y=@071e;else y=@01a9;
  $  188.收音机频率配置                                                        $    $               $    $  ANS056.BYTE005  $  if(x1==0x01)y=@0696;else if(x1==0x02)y=@0697;else if(x2==0x01)y=@0699;else y=@01a9;
  $  189.扬声器类型配置                                                        $    $               $    $  ANS056.BYTE007  $  if(x==0x00)y=@069d;else if(x==0x01)y=@069e;else if(x==0x02)y=@069f;else if(x==0x03)y=@06a0;else if(x==0x04)y=@06a1;else y=@01a9;
  $  190.IPOD配置                                                              $    $               $    $  ANS057.BYTE004  $  if(x==0x00)y=@06a2;else if(x==0x01)y=@0692;else y=@01a9;
  $  191.汽车车型年份配置                                                      $    $               $    $  ANS057.BYTE005  $  if(x==0x00)y=@06a3;else if(x==0x01)y=@06a4;else if(x==0x02)y=@06a5;else if(x==0x03)y=@06a6;else if(x==0x04)y=@06a7;else if(x==0x05)y=@06a8;else if(x==0x06)y=@06a9;else if(x==0x07)y=@06aa;else if(x==0x08)y=@06ab;else y=@01a9;
  $  192.车型系列配置                                                          $    $               $    $  ANS057.BYTE006  $  if(x==0x00)y=@058f;else if(x==0x01)y=@08da;else if(x==0x02)y=@0590;else if(x==0x03)y=@08db;else if(x==0x04)y=@0591;else if(x==0x05)y=@08dc;else y=@01a9;
  $  193.车身类型配置                                                          $    $               $    $  ANS057.BYTE007  $  if(x==0x00)y=@06ac;else if(x==0x01)y=@06ad;else if(x==0x02)y=@06ae;else if(x==0x03)y=@06af;else if(x==0x04)y=@06b0;else if(x==0x05)y=@06b1;else if(x==0x06)y=@06b2;else if(x==0x07)y=@06b3;else if(x==0x08)y=@00f3;else if(x==0x09)y=@06b4;else if(x==0x0A)y=@06b5;else y=@01a9;
  $  194.汽车品牌配置                                                          $    $               $    $  ANS058.BYTE004  $  if(x==0x00)y=@066a;else if(x==0x01)y=@066b;else if(x==0x02)y=@066c;else y=@01a9;
  $  195.汽车国家码配置                                                        $    $               $    $  ANS058.BYTE005  $  if(x==0x00)y=@00d8;else if(x==0x01)y=@066d;else if(x==0x02)y=@066e;else if(x==0x03)y=@066f;else if(x==0x04)y=@0670;else if(x==0x05)y=@0671;else if(x==0x06)y=@0672;else if(x==0x07)y=@0673;else if(x==0x08)y=@0674;else if(x==0x09)y=@0675;else if(x==0x0A)y=@0676;else if(x==0x0B)y=@0677;else if(x==0x0C)y=@0678;else if(x==0x0D)y=@0679;else if(x==0x0E)y=@067a;else if(x==0x0F)y=@067b;else if(x==0x10)y=@067c;else y=@01a9;
  $  196.汽车驾驶方向类型配置                                                  $    $               $    $  ANS058.BYTE006  $  if(x==0x00)y=@067d;else if(x==0x01)y=@067e;else y=@01a9;
  $  197.汽车发动机类型配置                                                    $    $               $    $  ANS058.BYTE007  $  if(x==0x00)y=@067f;else if(x==0x01)y=@0680;else if(x==0x02)y=@0681;else if(x==0x03)y=@0682;else y=@01a9;
  $  198.变速箱类型配置                                                        $    $               $    $  ANS059.BYTE004  $  if(x==0x00)y=@0687;else if(x==0x01)y=@0688;else if(x==0x02)y=@0689;else if(x==0x03)y=@068a;else if(x==0x04)y=@068b;else y=@01a9;
  $  199.汽车尾门操作类型配置                                                  $    $               $    $  ANS059.BYTE005  $  if(x==0x00)y=@0166;else if(x==0x01)y=@0167;else if(x==0x02)y=@0690;else y=@01a9;
  $  200.盲点信息系统配置                                                      $    $               $    $  ANS059.BYTE006  $  if(x==0x00)y=@08eb;else if(x==0x01)y=@0692;else y=@01a9;
  $  201.行人警告系统配置                                                      $    $               $    $  ANS059.BYTE007  $  if(x==0x00)y=@08ec;else if(x==0x01)y=@0692;else y=@01a9;
  $  202.车速报警系统配置                                                      $    $               $    $  ANS060.BYTE004  $  if(x==0x00)y=@08ed;else if(x==0x01)y=@0692;else y=@01a9;
  $  203.自动紧急呼叫配置                                                      $    $               $    $  ANS060.BYTE005  $  if(x==0x00)y=@043b;else if(x==0x01)y=@0692;else y=@01a9;
  $  204.汽车天窗类型配置                                                      $    $               $    $  ANS060.BYTE006  $  if(x==0x00)y=@0693;else if(x==0x01)y=@0694;else if(x==0x02)y=@0695;else y=@01a9;
  $  205.混合动力类型配置                                                      $    $               $    $  ANS060.BYTE007  $  if(x==0x00)y=@06cc;else if(x==0x01)y=@06cd;else if(x==0x02)y=@06ce;else if(x==0x03)y=@06cf;else y=@01a9;
  $  206.ECO主动经济驾驶模式配置                                               $    $               $    $  ANS061.BYTE004  $  if(x==0x00)y=@00b2;else if(x==0x01)y=@00b1;else y=@01a9;
  $  207.FCW正面碰撞警告配置                                                   $    $               $    $  ANS061.BYTE005  $  if(x==0x00)y=@08e5;else if(x==0x01)y=@08e6;else y=@01a9;
  $  208.MIC麦克风类型配置                                                     $    $               $    $  ANS061.BYTE006  $  if(x==0x00)y=@06d0;else if(x==0x01)y=@06d1;else if(x==0x02)y=@06d2;else y=@01a9;
  $  209.光传感器配置                                                          $    $               $    $  ANS061.BYTE007  $  if(x==0x00)y=@06d3;else if(x==0x01)y=@06d4;else y=@01a9;
  $  210.车载空气净化系统类型配置                                              $    $               $    $  ANS062.BYTE004  $  if(x==0x00)y=@08e7;else if(x==0x01)y=@08e8;else if(x==0x02)y=@08e9;else if(x==0x03)y=@08ea;else y=@01a9;
  $  211.车型配置                                                              $    $               $    $  ANS062.BYTE005  $  if(x==0x7F)y=@06d5;else if(x==0x80)y=@058e;else y=@01a9;
  $  212.变量配置                                                              $    $               $    $  ANS062.BYTE006  $  if(x==0x98)y=@06d6;else if(x==0x99)y=@06d7;else y=@01a9;
  $  213.GPS芯片配置                                                           $    $               $    $  ANS062.BYTE007  $  if(x==0x00)y=@06d8;else if(x==0x01)y=@06d9;else y=@01a9;
  $  214.语音识别配置                                                          $    $               $    $  ANS063.BYTE004  $  if(x==0x00)y=@05b0;else if(x==0x01)y=@06da;else y=@01a9;
  $  215.ESP/ABS节点配置                                                       $    $               $    $  ANS063.BYTE005  $  if(x==0x00)y=@06b6;else if(x==0x01)y=@06b7;else if(x==0x02)y=@06b8;else y=@01a9;
  $  216.SAS配置                                                               $    $               $    $  ANS063.BYTE006  $  if(x==0x00)y=@06b9;else if(x==0x01)y=@06ba;else y=@01a9;
  $  217.PEPS配置                                                              $    $               $    $  ANS063.BYTE007  $  if(x==0x00)y=@06bb;else if(x==0x01)y=@003d;else y=@01a9;
  $  218.WIFI配置                                                              $    $               $    $  ANS064.BYTE004  $  if(x==0x00)y=@06bc;else if(x==0x01)y=@06bd;else y=@01a9;
  $  219.轴距配置                                                              $    $               $    $  ANS064.BYTE005  $  if(x==0x00)y=@06be;else if(x==0x01)y=@06bf;else y=@01a9;
  $  220.底盘高度配置                                                          $    $               $    $  ANS064.BYTE006  $  if(x==0x00)y=@06c0;else if(x==0x01)y=@06c1;else y=@01a9;
  $  221.车速限制功能配置                                                      $    $               $    $  ANS064.BYTE007  $  if(x==0x00)y=@0905;else if(x==0x01)y=@0906;else if(x==0x02)y=@0907;else y=@01a9;
  $  222.门类型配置                                                            $    $               $    $  ANS065.BYTE004  $  if(x==0x00)y=@06c2;else if(x==0x01)y=@06c3;else y=@01a9;
  $  223.车速                                                                  $    $               $    $  ANS066.BYTE004  $  y=(x1*256+x2)*0.05625;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
