
    车型ID：101e

    模拟：协议模拟-->101e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E0 02 10 01 00 00 00 00 00       $~  ANS000:7E8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E0 02 3E 80 00 00 00 00 00       $!  ANS000:7E8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E0 03 19 02 08 00 00 00 00       $#  ANS000:7E8 03 19 02 08 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/1e000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00       $$  ANS000:7E8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 A0 00 00 00 00       $%  ANS000:7E8 03 22 F1 A0 00 00 00 00
  $%  REQ001:7E0 03 22 F1 83 00 00 00 00       $%  ANS001:7E8 03 22 F1 83 00 00 00 00
  $%  REQ002:7E0 03 22 F1 A1 00 00 00 00       $%  ANS002:7E8 03 22 F1 A1 00 00 00 00
  $%  REQ003:7E0 03 22 F1 91 00 00 00 00       $%  ANS003:7E8 03 22 F1 91 00 00 00 00
  $%  REQ004:7E0 03 22 F1 8B 00 00 00 00       $%  ANS004:7E8 03 22 F1 8B 00 00 00 00
  $%  REQ005:7E0 03 22 F1 87 00 00 00 00       $%  ANS005:7E8 03 22 F1 87 00 00 00 00
  $%  REQ006:7E0 03 22 F1 10 00 00 00 00       $%  ANS006:7E8 03 22 F1 10 00 00 00 00
  $%  REQ007:7E0 03 22 F1 92 00 00 00 00       $%  ANS007:7E8 03 22 F1 92 00 00 00 00
  $%  REQ008:7E0 03 22 F1 8C 00 00 00 00       $%  ANS008:7E8 03 22 F1 8C 00 00 00 00
  $%  REQ009:7E0 03 22 F1 94 00 00 00 00       $%  ANS009:7E8 03 22 F1 94 00 00 00 00
  $%  REQ010:7E0 03 22 F1 8A 00 00 00 00       $%  ANS010:7E8 03 22 F1 8A 00 00 00 00
  $%  REQ011:7E0 03 22 F1 90 00 00 00 00       $%  ANS011:7E8 03 22 F1 90 00 00 00 00
  $%  REQ012:7E0 03 22 F1 A8 00 00 00 00       $%  ANS012:7E8 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元制造日期:                $%    $%  ANS004.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:客户代码:                        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2);
  $%  011:位置代码:                        $%    $%  ANS008.BYTE010  $%  ASCII(X);
  $%  012:制造代码:                        $%    $%  ANS008.BYTE011  $%  ASCII(X);
  $%  013:年:                              $%    $%  ANS008.BYTE012  $%  ASCII(X);
  $%  014:日:                              $%    $%  ANS008.BYTE013  $%  ASCII(X1,X2,X3);
  $%  015:序列号:                          $%    $%  ANS008.BYTE016  $%  ASCII(X1,X2,X3);
  $%  016:序列号2:                         $%    $%  ANS008.BYTE018  $%  ASCII(X1,X2,X3,X4);
  $%  017:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  018:系统供应商识别码:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  019:VIN码:                           $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  020:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E0 03 22 14 69 00 00 00 00       $  ANS000:7E8 03 22 14 69 00 00 00 00
  $  REQ001:7E0 03 22 11 44 00 00 00 00       $  ANS001:7E8 03 22 11 44 00 00 00 00
  $  REQ002:7E0 03 22 13 3A 00 00 00 00       $  ANS002:7E8 03 22 13 3A 00 00 00 00
  $  REQ003:7E0 03 22 00 43 00 00 00 00       $  ANS003:7E8 03 22 00 43 00 00 00 00
  $  REQ004:7E0 03 22 11 9E 00 00 00 00       $  ANS004:7E8 03 22 11 9E 00 00 00 00
  $  REQ005:7E0 03 22 11 9D 00 00 00 00       $  ANS005:7E8 03 22 11 9D 00 00 00 00
  $  REQ006:7E0 03 22 00 33 00 00 00 00       $  ANS006:7E8 03 22 00 33 00 00 00 00
  $  REQ007:7E0 03 22 11 AC 00 00 00 00       $  ANS007:7E8 03 22 11 AC 00 00 00 00
  $  REQ008:7E0 03 22 11 A3 00 00 00 00       $  ANS008:7E8 03 22 11 A3 00 00 00 00
  $  REQ009:7E0 03 22 11 5E 00 00 00 00       $  ANS009:7E8 03 22 11 5E 00 00 00 00
  $  REQ010:7E0 03 22 00 3C 00 00 00 00       $  ANS010:7E8 03 22 00 3C 00 00 00 00
  $  REQ011:7E0 03 22 00 01 00 00 00 00       $  ANS011:7E8 03 22 00 01 00 00 00 00
  $  REQ012:7E0 03 22 00 13 00 00 00 00       $  ANS012:7E8 03 22 00 13 00 00 00 00
  $  REQ013:7E0 03 22 00 14 00 00 00 00       $  ANS013:7E8 03 22 00 14 00 00 00 00
  $  REQ014:7E0 03 22 00 15 00 00 00 00       $  ANS014:7E8 03 22 00 15 00 00 00 00
  $  REQ015:7E0 03 22 11 00 00 00 00 00       $  ANS015:7E8 03 22 11 00 00 00 00 00
  $  REQ016:7E0 03 22 11 01 00 00 00 00       $  ANS016:7E8 03 22 11 01 00 00 00 00
  $  REQ017:7E0 03 22 11 02 00 00 00 00       $  ANS017:7E8 03 22 11 02 00 00 00 00
  $  REQ018:7E0 03 22 11 03 00 00 00 00       $  ANS018:7E8 03 22 11 03 00 00 00 00
  $  REQ019:7E0 03 22 11 04 00 00 00 00       $  ANS019:7E8 03 22 11 04 00 00 00 00
  $  REQ020:7E0 03 22 11 7C 00 00 00 00       $  ANS020:7E8 03 22 11 7C 00 00 00 00
  $  REQ021:7E0 03 22 12 F0 00 00 00 00       $  ANS021:7E8 03 22 12 F0 00 00 00 00
  $  REQ022:7E0 03 22 13 C0 00 00 00 00       $  ANS022:7E8 03 22 13 C0 00 00 00 00
  $  REQ023:7E0 03 22 13 C1 00 00 00 00       $  ANS023:7E8 03 22 13 C1 00 00 00 00
  $  REQ024:7E0 03 22 15 04 00 00 00 00       $  ANS024:7E8 03 22 15 04 00 00 00 00
  $  REQ025:7E0 03 22 00 44 00 00 00 00       $  ANS025:7E8 03 22 00 44 00 00 00 00
  $  REQ026:7E0 03 22 00 2E 00 00 00 00       $  ANS026:7E8 03 22 00 2E 00 00 00 00
  $  REQ027:7E0 03 22 00 42 00 00 00 00       $  ANS027:7E8 03 22 00 42 00 00 00 00
  $  REQ028:7E0 03 22 11 6F 00 00 00 00       $  ANS028:7E8 03 22 11 6F 00 00 00 00
  $  REQ029:7E0 03 22 01 0A 00 00 00 00       $  ANS029:7E8 03 22 01 0A 00 00 00 00
  $  REQ030:7E0 03 22 01 0B 00 00 00 00       $  ANS030:7E8 03 22 01 0B 00 00 00 00
  $  REQ031:7E0 03 22 00 04 00 00 00 00       $  ANS031:7E8 03 22 00 04 00 00 00 00
  $  REQ032:7E0 03 22 00 0E 00 00 00 00       $  ANS032:7E8 03 22 00 0E 00 00 00 00
  $  REQ033:7E0 03 22 00 03 00 00 00 00       $  ANS033:7E8 03 22 00 03 00 00 00 00
  $  REQ034:7E0 03 22 00 07 00 00 00 00       $  ANS034:7E8 03 22 00 07 00 00 00 00
  $  REQ035:7E0 03 22 00 06 00 00 00 00       $  ANS035:7E8 03 22 00 06 00 00 00 00
  $  REQ036:7E0 03 22 00 11 00 00 00 00       $  ANS036:7E8 03 22 00 11 00 00 00 00
  $  REQ037:7E0 03 22 00 05 00 00 00 00       $  ANS037:7E8 03 22 00 05 00 00 00 00
  $  REQ038:7E0 03 22 00 0C 00 00 00 00       $  ANS038:7E8 03 22 00 0C 00 00 00 00
  $  REQ039:7E0 03 22 00 0F 00 00 00 00       $  ANS039:7E8 03 22 00 0F 00 00 00 00
  $  REQ040:7E0 03 22 00 0B 00 00 00 00       $  ANS040:7E8 03 22 00 0B 00 00 00 00
  $  REQ041:7E0 03 22 00 0D 00 00 00 00       $  ANS041:7E8 03 22 00 0D 00 00 00 00
  $  REQ042:7E0 03 22 11 E4 00 00 00 00       $  ANS042:7E8 03 22 11 E4 00 00 00 00
  $  REQ043:7E0 03 22 00 02 00 00 00 00       $  ANS043:7E8 03 22 00 02 00 00 00 00
  $  REQ044:7E0 03 22 11 93 00 00 00 00       $  ANS044:7E8 03 22 11 93 00 00 00 00
  $  REQ045:7E0 03 22 11 92 00 00 00 00       $  ANS045:7E8 03 22 11 92 00 00 00 00
  $  REQ046:7E0 03 22 12 21 00 00 00 00       $  ANS046:7E8 03 22 12 21 00 00 00 00
  $  REQ047:7E0 03 22 00 31 00 00 00 00       $  ANS047:7E8 03 22 00 31 00 00 00 00
  $  REQ048:7E0 03 22 12 1E 00 00 00 00       $  ANS048:7E8 03 22 12 1E 00 00 00 00
  $  REQ049:7E0 03 22 12 A1 00 00 00 00       $  ANS049:7E8 03 22 12 A1 00 00 00 00
  $  REQ050:7E0 03 22 11 70 00 00 00 00       $  ANS050:7E8 03 22 11 70 00 00 00 00
  $  REQ051:7E0 03 22 12 39 00 00 00 00       $  ANS051:7E8 03 22 12 39 00 00 00 00
  $  REQ052:7E0 03 22 12 37 00 00 00 00       $  ANS052:7E8 03 22 12 37 00 00 00 00
  $  REQ053:7E0 03 22 12 38 00 00 00 00       $  ANS053:7E8 03 22 12 38 00 00 00 00
  $  REQ054:7E0 03 22 12 35 00 00 00 00       $  ANS054:7E8 03 22 12 35 00 00 00 00
  $  REQ055:7E0 03 22 00 2F 00 00 00 00       $  ANS055:7E8 03 22 00 2F 00 00 00 00
  $  REQ056:7E0 03 22 12 C5 00 00 00 00       $  ANS056:7E8 03 22 12 C5 00 00 00 00
  $  REQ057:7E0 03 22 11 55 00 00 00 00       $  ANS057:7E8 03 22 11 55 00 00 00 00
  $  REQ058:7E0 03 22 11 90 00 00 00 00       $  ANS058:7E8 03 22 11 90 00 00 00 00
  $  REQ059:7E0 03 22 12 ED 00 00 00 00       $  ANS059:7E8 03 22 12 ED 00 00 00 00
  $  REQ060:7E0 03 22 11 76 00 00 00 00       $  ANS060:7E8 03 22 11 76 00 00 00 00
  $  REQ061:7E0 03 22 11 72 00 00 00 00       $  ANS061:7E8 03 22 11 72 00 00 00 00
  $  REQ062:7E0 03 22 14 4B 00 00 00 00       $  ANS062:7E8 03 22 14 4B 00 00 00 00
  $  REQ063:7E0 03 22 14 4C 00 00 00 00       $  ANS063:7E8 03 22 14 4C 00 00 00 00
  $  REQ064:7E0 03 22 15 05 00 00 00 00       $  ANS064:7E8 03 22 15 05 00 00 00 00
  $  REQ065:7E0 03 22 15 06 00 00 00 00       $  ANS065:7E8 03 22 15 06 00 00 00 00
  $  REQ066:7E0 03 22 15 0B 00 00 00 00       $  ANS066:7E8 03 22 15 0B 00 00 00 00
  $  REQ067:7E0 03 22 15 09 00 00 00 00       $  ANS067:7E8 03 22 15 09 00 00 00 00
  $  REQ068:7E0 03 22 12 92 00 00 00 00       $  ANS068:7E8 03 22 12 92 00 00 00 00
  $  REQ069:7E0 03 22 11 41 00 00 00 00       $  ANS069:7E8 03 22 11 41 00 00 00 00
  $  REQ070:7E0 03 22 11 A6 00 00 00 00       $  ANS070:7E8 03 22 11 A6 00 00 00 00
  $  REQ071:7E0 03 22 12 36 00 00 00 00       $  ANS071:7E8 03 22 12 36 00 00 00 00
  $  REQ072:7E0 03 22 A0 FF 00 00 00 00       $  ANS072:7E8 03 22 A0 FF 00 00 00 00
  $  REQ073:7E0 03 22 00 21 00 00 00 00       $  ANS073:7E8 03 22 00 21 00 00 00 00
  $  REQ074:7E0 03 22 15 01 00 00 00 00       $  ANS074:7E8 03 22 15 01 00 00 00 00
  $  REQ075:7E0 03 22 12 06 00 00 00 00       $  ANS075:7E8 03 22 12 06 00 00 00 00
  $  REQ076:7E0 03 22 12 05 00 00 00 00       $  ANS076:7E8 03 22 12 05 00 00 00 00
  $  REQ077:7E0 03 22 12 07 00 00 00 00       $  ANS077:7E8 03 22 12 07 00 00 00 00
  $  REQ078:7E0 03 22 12 08 00 00 00 00       $  ANS078:7E8 03 22 12 08 00 00 00 00
  $  REQ079:7E0 03 22 11 E8 00 00 00 00       $  ANS079:7E8 03 22 11 E8 00 00 00 00
  $  REQ080:7E0 03 22 12 27 00 00 00 00       $  ANS080:7E8 03 22 12 27 00 00 00 00
  $  REQ081:7E0 03 22 12 01 00 00 00 00       $  ANS081:7E8 03 22 12 01 00 00 00 00
  $  REQ082:7E0 03 22 12 02 00 00 00 00       $  ANS082:7E8 03 22 12 02 00 00 00 00
  $  REQ083:7E0 03 22 12 03 00 00 00 00       $  ANS083:7E8 03 22 12 03 00 00 00 00
  $  REQ084:7E0 03 22 12 04 00 00 00 00       $  ANS084:7E8 03 22 12 04 00 00 00 00
  $  REQ085:7E0 03 22 12 28 00 00 00 00       $  ANS085:7E8 03 22 12 28 00 00 00 00
  $  REQ086:7E0 03 22 00 30 00 00 00 00       $  ANS086:7E8 03 22 00 30 00 00 00 00
  $  REQ087:7E0 03 22 11 D7 00 00 00 00       $  ANS087:7E8 03 22 11 D7 00 00 00 00
  $  REQ088:7E0 03 22 12 D4 00 00 00 00       $  ANS088:7E8 03 22 12 D4 00 00 00 00
  $  REQ089:7E0 03 22 12 1A 00 00 00 00       $  ANS089:7E8 03 22 12 1A 00 00 00 00
  $  REQ090:7E0 03 22 12 12 00 00 00 00       $  ANS090:7E8 03 22 12 12 00 00 00 00
  $  REQ091:7E0 03 22 12 3F 00 00 00 00       $  ANS091:7E8 03 22 12 3F 00 00 00 00
  $  REQ092:7E0 03 22 12 41 00 00 00 00       $  ANS092:7E8 03 22 12 41 00 00 00 00
  $  REQ093:7E0 03 22 11 45 00 00 00 00       $  ANS093:7E8 03 22 11 45 00 00 00 00
  $  REQ094:7E0 03 22 11 46 00 00 00 00       $  ANS094:7E8 03 22 11 46 00 00 00 00
  $  REQ095:7E0 03 22 00 1C 00 00 00 00       $  ANS095:7E8 03 22 00 1C 00 00 00 00
  $  REQ096:7E0 03 22 00 45 00 00 00 00       $  ANS096:7E8 03 22 00 45 00 00 00 00
  $  REQ097:7E0 03 22 11 E6 00 00 00 00       $  ANS097:7E8 03 22 11 E6 00 00 00 00
  $  REQ098:7E0 03 22 12 E2 00 00 00 00       $  ANS098:7E8 03 22 12 E2 00 00 00 00
  $  REQ099:7E0 03 22 12 EF 00 00 00 00       $  ANS099:7E8 03 22 12 EF 00 00 00 00
  $  REQ100:7E0 03 22 13 3C 00 00 00 00       $  ANS100:7E8 03 22 13 3C 00 00 00 00
  $  REQ101:7E0 03 22 13 3D 00 00 00 00       $  ANS101:7E8 03 22 13 3D 00 00 00 00
  $  REQ102:7E0 03 22 13 3E 00 00 00 00       $  ANS102:7E8 03 22 13 3E 00 00 00 00
  $  REQ103:7E0 03 22 13 3F 00 00 00 00       $  ANS103:7E8 03 22 13 3F 00 00 00 00
  $  REQ104:7E0 03 22 11 43 00 00 00 00       $  ANS104:7E8 03 22 11 43 00 00 00 00
  $  REQ105:7E0 03 22 00 1F 00 00 00 00       $  ANS105:7E8 03 22 00 1F 00 00 00 00
  $  REQ106:7E0 03 22 00 4D 00 00 00 00       $  ANS106:7E8 03 22 00 4D 00 00 00 00
  $  REQ107:7E0 03 22 12 00 00 00 00 00       $  ANS107:7E8 03 22 12 00 00 00 00 00
  $  REQ108:7E0 03 22 12 A7 00 00 00 00       $  ANS108:7E8 03 22 12 A7 00 00 00 00
  $  REQ109:7E0 03 22 11 64 00 00 00 00       $  ANS109:7E8 03 22 11 64 00 00 00 00

  $  000.空调压力                                                     $    $  kPa          $    $  ANS000.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.125-4096;
  $  001.空调压力A/D                                                  $    $  V            $    $  ANS001.BYTE004  $  y=x*5/255.0;
  $  002.ABS不平路面                                                  $    $               $    $  ANS002.BYTE004  $  if(x==0xFF)y=@0769;else if(x==0xFE)y=@076a;else y=@076b;
  $  003.绝对负载值                                                   $    $  %            $    $  ANS003.BYTE004  $  y=(x1*256+x2)*100/255.0;
  $  004.燃油占空比                                                   $    $  rad          $    $  ANS004.BYTE004  $  y=x*0.1;
  $  005.大气压力                                                     $    $  kPa          $    $  ANS005.BYTE004  $  y=x*0.36900367+10.332104;
  $  006.大气压力                                                     $    $  kPa          $    $  ANS006.BYTE004  $  y=x;
  $  007.计算流量-速度密度                                            $    $  g/s          $    $  ANS007.BYTE004  $  y=(x1*256+x2)/256*2;
  $  008.计算温度转换器                                               $    $  degree C     $    $  ANS008.BYTE004  $  y=x*3+300;
  $  009.凸轮轴事件活跃次数                                           $    $               $    $  ANS009.BYTE004  $  y=x;
  $  010.催化剂温度模块1传感器1                                       $    $  degree C     $    $  ANS010.BYTE004  $  y=(((x&0x7F)-(x&0x80))*0.1)-40;
  $  011.故障灯状态                                                   $    $               $    $  ANS011.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  012.排放故障数                                                   $    $               $    $  ANS011.BYTE004  $  y=x&0x7F;
  $  013.综合部件监测                                                 $    $               $    $  ANS011.BYTE005  $  if((x&0x40)==0x40)y=@028e;else y=@028d;
  $  014.燃油系统监测                                                 $    $               $    $  ANS011.BYTE005  $  if((x&0x20)==0x20)y=@028e;else y=@028d;
  $  015.失火监测完成                                                 $    $               $    $  ANS011.BYTE005  $  if((x&0x10)==0x10)y=@028e;else y=@028d;
  $  016.综合部件监测                                                 $    $               $    $  ANS011.BYTE005  $  if((x&0x04)==0x04)y=@028d;else y=@028e;
  $  017.燃油系统监测                                                 $    $               $    $  ANS011.BYTE005  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  018.失火监测                                                     $    $               $    $  ANS011.BYTE005  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  019.EGR(废气再循环)系统                                          $    $               $    $  ANS011.BYTE006  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  020.氧传感器加热器                                               $    $               $    $  ANS011.BYTE006  $  if((x&0x40)==0x40)y=@028d;else y=@028e;
  $  021.氧传感器                                                     $    $               $    $  ANS011.BYTE006  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  022.空调系统制冷剂                                               $    $               $    $  ANS011.BYTE006  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  023.二次空气系统                                                 $    $               $    $  ANS011.BYTE006  $  if((x&0x08)==0x08)y=@028d;else y=@028e;
  $  024.调整后的净化系统                                             $    $               $    $  ANS011.BYTE006  $  if((x&0x04)==0x04)y=@028d;else y=@028e;
  $  025.加热催化器                                                   $    $               $    $  ANS011.BYTE006  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  026.催化器                                                       $    $               $    $  ANS011.BYTE006  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  027.EGR(废气再循环)系统测试完成                                  $    $               $    $  ANS011.BYTE007  $  if((x&0x80)==0x80)y=@028d;else y=@028e;
  $  028.氧气传感器加热测试完成                                       $    $               $    $  ANS011.BYTE007  $  if((x&0x40)==0x40)y=@028d;else y=@028e;
  $  029.氧传感器测试完成                                             $    $               $    $  ANS011.BYTE007  $  if((x&0x20)==0x20)y=@028d;else y=@028e;
  $  030.空调系统制冷剂测试完成                                       $    $               $    $  ANS011.BYTE007  $  if((x&0x10)==0x10)y=@028d;else y=@028e;
  $  031.二次空气系统测试完成                                         $    $               $    $  ANS011.BYTE007  $  if((x&0x08)==0x08)y=@028d;else y=@028e;
  $  032.调整后的净化系统测试完成                                     $    $               $    $  ANS011.BYTE007  $  if((x&0x04)==0x04)y=@028d;else y=@028e;
  $  033.加热催化器测试完成                                           $    $               $    $  ANS011.BYTE007  $  if((x&0x02)==0x02)y=@028d;else y=@028e;
  $  034.催化器测试完成                                               $    $               $    $  ANS011.BYTE007  $  if((x&0x01)==0x01)y=@028d;else y=@028e;
  $  035.制造商装备氧传感器位置(模块2-传感器4)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x80)==0x80)y=@00ba;else y=@00b9;
  $  036.制造商装备氧传感器位置(模块2-传感器3)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x40)==0x40)y=@00ba;else y=@00b9;
  $  037.制造商装备氧传感器位置(模块2-传感器2)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x20)==0x20)y=@00ba;else y=@00b9;
  $  038.制造商装备氧传感器位置(模块2-传感器1)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x10)==0x10)y=@00ba;else y=@00b9;
  $  039.制造商装备氧传感器位置(模块1-传感器4)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x08)==0x08)y=@00ba;else y=@00b9;
  $  040.制造商装备氧传感器位置(模块1-传感器3)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x04)==0x04)y=@00ba;else y=@00b9;
  $  041.制造商装备氧传感器位置(模块1-传感器2)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x02)==0x02)y=@00ba;else y=@00b9;
  $  042.制造商装备氧传感器位置(模块1-传感器1)                        $    $               $    $  ANS012.BYTE004  $  if((x&0x01)==0x01)y=@00ba;else y=@00b9;
  $  043.(B1-S1)氧传感器电压                                          $    $  V            $    $  ANS013.BYTE004  $  y=x*0.005;
  $  044.(B1-S1)短期燃油修正                                          $    $  %            $    $  ANS013.BYTE005  $  y=x*0.78125-100;
  $  045.(B1-S2)氧传感器电压                                          $    $  V            $    $  ANS014.BYTE004  $  y=x*0.005;
  $  046.(B1-S2)短期燃油修正                                          $    $  %            $    $  ANS014.BYTE005  $  y=x*0.78125-100;
  $  047.燃油泵打开                                                   $    $               $    $  ANS015.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  048.催化剂保护模式                                               $    $               $    $  ANS015.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  049.空调离合器                                                   $    $               $    $  ANS015.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  050.空调请求                                                     $    $               $    $  ANS015.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  051.动力转向                                                     $    $               $    $  ANS015.BYTE004  $  if((x&0x08)==0x08)y=@0767;else y=@02ac;
  $  052.气节门怠速                                                   $    $               $    $  ANS015.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  053.减速燃油停止输送激活                                         $    $               $    $  ANS016.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  054.可变进气歧管阀门                                             $    $               $    $  ANS016.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  055.低燃油灯(可选装)                                             $    $               $    $  ANS016.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  056.维修灯                                                       $    $               $    $  ANS016.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  057.故障灯                                                       $    $               $    $  ANS016.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  058.混合气空燃比浓/稀                                            $    $               $    $  ANS017.BYTE004  $  if((x&0x40)==0x40)y=@07a6;else y=@07a7;
  $  059.爆震存在                                                     $    $               $    $  ANS017.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  060.功率加浓                                                     $    $               $    $  ANS017.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  061.燃油修正学习允许                                             $    $               $    $  ANS017.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  062.车辆防盗                                                     $    $               $    $  ANS017.BYTE004  $  if((x&0x04)==0x04)y=@00dc;else y=@00db;
  $  063.氧传感器就绪，B1-S1                                          $    $               $    $  ANS017.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  064.闭环                                                         $    $               $    $  ANS017.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  065.ETC(Electronic Throttle Control)降低发动机功率模式           $    $               $    $  ANS018.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  066.驻车/空挡                                                    $    $               $    $  ANS018.BYTE004  $  if((x&0x10)==0x10)y=@07a8;else y=@07a9;
  $  067.高速风扇                                                     $    $               $    $  ANS018.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  068.低速风扇                                                     $    $               $    $  ANS018.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  069.允许EGR(废气再循环)流量测试                                  $    $               $    $  ANS019.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  070.怠速测试启用                                                 $    $               $    $  ANS019.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  071.EGR(废气再循环)阀门关闭位置错误                              $    $               $    $  ANS019.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  072.EEVAP排气电磁阀                                              $    $               $    $  ANS019.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  073.凸轮轴粘性测试电流失效                                       $    $               $    $  ANS019.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  074.颠簸路面检测                                                 $    $               $    $  ANS019.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  075.氧传感器(B1-S1)主要阶段测试完成                              $    $               $    $  ANS020.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  076.氧传感器(B1-S1)主要阶段数据搜集                              $    $               $    $  ANS020.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  077.钥匙-开学习错误                                              $    $               $    $  ANS021.BYTE004  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  078.测试进行中                                                   $    $               $    $  ANS021.BYTE004  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  079.催化器损坏失火                                               $    $               $    $  ANS021.BYTE004  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  080.学习激活标准                                                 $    $               $    $  ANS021.BYTE004  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  081.因素超出范围                                                 $    $               $    $  ANS021.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  082.反作用元素超出范围                                           $    $               $    $  ANS021.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  083.总数超出范围                                                 $    $               $    $  ANS021.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  084.曲柄脉冲计数错误锁存                                         $    $               $    $  ANS021.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  085.爆震传感器1故障计数                                          $    $               $    $  ANS022.BYTE004  $  y=x;
  $  086.爆震传感器1样本计数                                          $    $               $    $  ANS022.BYTE005  $  y=x;
  $  087.爆震系统故障高计数                                           $    $               $    $  ANS023.BYTE004  $  y=x;
  $  088.爆震系统故障低计数                                           $    $               $    $  ANS023.BYTE005  $  y=x;
  $  089.爆震系统样本低计数                                           $    $               $    $  ANS023.BYTE006  $  y=x;
  $  090.填充字节                                                     $    $               $    $  ANS023.BYTE007  $  y=x;
  $  091.No User3                                                     $    $               $    $  ANS023.BYTE008  $  HEX(X);
  $  092.Nouserd4                                                     $    $               $    $  ANS023.BYTE009  $  HEX(X);
  $  093.怠速催化器请求的测试完成                                     $    $               $    $  ANS024.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  094.怠速催化器测试中断                                           $    $               $    $  ANS024.BYTE004  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  095.怠速催化器测试运行(启用条件满足)                             $    $               $    $  ANS024.BYTE004  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  096.怠速催化器不能进行测试                                       $    $               $    $  ANS024.BYTE004  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  097.当量比                                                       $    $  %            $    $  ANS025.BYTE004  $  y=(x1*256+x2)*2/256.0;
  $  098.蒸发清除指令                                                 $    $  %            $    $  ANS026.BYTE004  $  y=x*100/255;
  $  099.控制模块电压                                                 $    $  V            $    $  ANS027.BYTE004  $  y=(x1*256+x2)*0.001;
  $  100.冷却液温度(启动)                                             $    $  degree C     $    $  ANS028.BYTE004  $  y=x-40;
  $  101.曲轴自适应气缸                                               $    $               $    $  ANS029.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  102.曲轴自适应采样计数                                           $    $               $    $  ANS030.BYTE004  $  HEX(X);
  $  103.当前负载值                                                   $    $  %            $    $  ANS031.BYTE004  $  y=x*100/255;
  $  104.点火正值提前角 气缸1                                         $    $  rad          $    $  ANS032.BYTE004  $  y=x*0.5-64;
  $  105.通用燃料系统状态1                                            $    $               $    $  ANS033.BYTE004  $  if(x==0x01)y=@07c7;else if(x==0x02)y=@07c8;else if(x==0x03)y=@07c9;else y=@01a9;
  $  106.长期燃油修正                                                 $    $  %            $    $  ANS034.BYTE004  $  y=x*0.78125-100;
  $  107.短期燃油修正                                                 $    $  %            $    $  ANS035.BYTE004  $  y=x*0.78125-100;
  $  108.节气门位置A                                                  $    $  %            $    $  ANS036.BYTE004  $  y=x*100/255;
  $  109.冷却液温度                                                   $    $  degree C     $    $  ANS037.BYTE004  $  y=x-40;
  $  110.发动机转速                                                   $    $  rpm          $    $  ANS038.BYTE004  $  y=(x1*256+x2)*0.25;
  $  111.进气温度                                                     $    $  degree C     $    $  ANS039.BYTE004  $  y=x-40;
  $  112.歧管绝对压力                                                 $    $  kPa          $    $  ANS040.BYTE004  $  y=x;
  $  113.当前车辆速度                                                 $    $  m/s          $    $  ANS041.BYTE004  $  y=x*0.2776646;
  $  114.缸模式失火指数                                               $    $               $    $  ANS042.BYTE004  $  y=x1*256+x2;
  $  115.DTC所需的冻结帧存储                                          $    $               $    $  ANS043.BYTE004  $  HEX(X1,X2);
  $  116.提供的基本喷油脉宽                                           $    $  ms           $    $  ANS044.BYTE004  $  y=(x1*256+x2)*1000/65535;
  $  117.期望怠速                                                     $    $  rpm          $    $  ANS045.BYTE004  $  y=x*0.08;
  $  118.控制器装置及响应情况                                         $    $               $    $  ANS046.BYTE004  $  y=@01a9;
  $  119.清除故障码后行驶距离                                         $    $  km           $    $  ANS047.BYTE004  $  y=x;
  $  120.发动机里程                                                   $    $  km           $    $  ANS048.BYTE004  $  y=(x1*256+x2)*10;
  $  121.发动机运行时间                                               $    $  s            $    $  ANS049.BYTE004  $  y=x1*256+x2;
  $  122.碳罐电池阀占空比                                             $    $  %            $    $  ANS050.BYTE004  $  y=x*100/255.0;
  $  123.故障情况下的没有运行计数(点火周期中没有运行诊断的次数)       $    $               $    $  ANS051.BYTE004  $  y=x;
  $  124.故障情况下的故障计数(点火周期的故障次数)                     $    $               $    $  ANS052.BYTE004  $  y=x;
  $  125.故障情况下的通过计数(诊断通过的次数)                         $    $               $    $  ANS053.BYTE004  $  y=x;
  $  126.第一次的里程                                                 $    $  km           $    $  ANS054.BYTE004  $  y=(x1*256+x2)*5;
  $  127.输入燃油水平                                                 $    $  %            $    $  ANS055.BYTE004  $  y=(x*100)/255.0;
  $  128.燃油油位输出                                                 $    $  %            $    $  ANS056.BYTE004  $  y=(x*100)/255.0;
  $  129.燃油有位传感器                                               $    $  V            $    $  ANS057.BYTE004  $  y=(x*5)/255.0;
  $  130.燃油修正单元                                                 $    $               $    $  ANS058.BYTE004  $  y=x;
  $  131.G传感器唤醒                                                  $    $  V            $    $  ANS059.BYTE004  $  y=((x&0x7F)-(x&0x80))*0.0625-8;
  $  132.IAC怠速步进电机位置基础位置                                  $    $               $    $  ANS060.BYTE004  $  y=x;
  $  133.IAC怠速步进电机位置                                          $    $               $    $  ANS061.BYTE004  $  y=x;
  $  134.怠速催化剂监控氧气存储EWNA值                                 $    $  s            $    $  ANS062.BYTE004  $  y=(x1*256+x2)*1024/65536;
  $  135.怠速催化剂监控氧气存储超出阈值                               $    $  s            $    $  ANS063.BYTE004  $  y=(x1*256+x2)*1024/65536;
  $  136.怠速催化剂监控器授权的拒绝原因                               $    $               $    $  ANS064.BYTE004  $  if(x==0x00)y=@076e;else if(x==0x01)y=@076f;else if(x==0x02)y=@0770;else if(x==0x03)y=@0771;else if(x==0x04)y=@0772;else if(x==0x05)y=@0773;else if(x==0x06)y=@0774;else if(x==0x07)y=@0775;else if(x==0x08)y=@0776;else if(x==0x09)y=@0777;else if(x==0x0A)y=@0778;else if(x==0x0B)y=@0779;else if(x==0x0C)y=@077a;else if(x==0x0D)y=@077b;else if(x==0x0E)y=@077c;else if(x==0x0F)y=@077d;else if(x==0x10)y=@077e;else if(x==0x11)y=@077f;else if(x==0x12)y=@0780;else if(x==0x13)y=@0632;else if(x==0x14)y=@0781;else if(x==0x15)y=@0782;else if(x==0x16)y=@0783;else if(x==0x17)y=@0784;else y=@01a9;
  $  137.怠速催化器测试中断原因                                       $    $               $    $  ANS065.BYTE004  $  if(x==0x00)y=@0785;else if(x==0x01)y=@0786;else if(x==0x02)y=@0787;else if(x==0x03)y=@0788;else if(x==0x04)y=@0789;else if(x==0x05)y=@0788;else if(x==0x06)y=@078a;else if(x==0x07)y=@078b;else if(x==0x08)y=@078c;else if(x==0x09)y=@078d;else if(x==0x0A)y=@078e;else if(x==0x0B)y=@078f;else if(x==0x0C)y=@0790;else if(x==0x0D)y=@0791;else if(x==0x0E)y=@0792;else y=@01a9;
  $  138.怠速催化器监控器状态计时器                                   $    $  s            $    $  ANS066.BYTE004  $  y=(x1*256+x2)*1024/65536;
  $  139.怠速催化器监控器时间-最后测试结果                            $    $  s            $    $  ANS067.BYTE004  $  y=(x1*256+x2)*1024/65536;
  $  140.怠速转速误差                                                 $    $  rpm          $    $  ANS068.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*4096/32768-4096;
  $  141.点火电压                                                     $    $  V            $    $  ANS069.BYTE004  $  y=x*0.1;
  $  142.爆震延迟                                                     $    $  rad          $    $  ANS070.BYTE004  $  y=x*22.5/255;
  $  143.最后的里程                                                   $    $  km           $    $  ANS071.BYTE004  $  y=(x1*256+x2)*5;
  $  144.ECM处于工厂生产状态次数                                      $    $               $    $  ANS072.BYTE004  $  HEX(X);
  $  145.MIL(发动机故障灯)灯点亮时里程                                $    $  km           $    $  ANS073.BYTE004  $  y=x;
  $  146.ICMD授权的最大的催化器温度                                   $    $  degree C     $    $  ANS074.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*2048/32768-2048;
  $  147.ICMD授权的最小的催化器温度                                   $    $  degree C     $    $  ANS074.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*2048/32768-2048;
  $  148.气缸1当前失火数                                              $    $               $    $  ANS075.BYTE004  $  y=x;
  $  149.气缸2当前失火数                                              $    $               $    $  ANS076.BYTE004  $  y=x;
  $  150.气缸3当前失火数                                              $    $               $    $  ANS077.BYTE004  $  y=x;
  $  151.气缸4当前失火数                                              $    $               $    $  ANS078.BYTE004  $  y=x;
  $  152.失火周期延迟计数                                             $    $               $    $  ANS079.BYTE004  $  y=x;
  $  153.从第一次失效开始的失火故障                                   $    $               $    $  ANS080.BYTE004  $  y=x1*256+x2;
  $  154.气缸1历史失火数                                              $    $               $    $  ANS081.BYTE004  $  y=x1*256+x2;
  $  155.气缸2历史失火数                                              $    $               $    $  ANS082.BYTE004  $  y=x1*256+x2;
  $  156.气缸3历史失火数                                              $    $               $    $  ANS083.BYTE004  $  y=x1*256+x2;
  $  157.气缸4历史失火数                                              $    $               $    $  ANS084.BYTE004  $  y=x1*256+x2;
  $  158.从第一次失效开始的失火通过                                   $    $               $    $  ANS085.BYTE004  $  y=x1*256+x2;
  $  159.故障码清除后的OBD暖机起动次数                                $    $               $    $  ANS086.BYTE004  $  y=x;
  $  160.氧传感器响应诊断从稀到浓的翻转次数                           $    $               $    $  ANS087.BYTE004  $  y=x1*256+x2;
  $  161.氧传感器响应浓到稀平均时间                                   $    $  ms           $    $  ANS088.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  162.氧传感器浓道喜响应转换                                       $    $               $    $  ANS089.BYTE004  $  y=x1*256+x2;
  $  163.氧传感器响应-稀到浓的平均时间                                $    $  ms           $    $  ANS090.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  164.氧传感器响应-稀到浓的总时间                                  $    $  ms           $    $  ANS091.BYTE004  $  y=(x1*256+x2)*7.81;
  $  165.氧传感器响应-浓到稀总时间                                    $    $  ms           $    $  ANS092.BYTE004  $  y=(x1*256+x2)*7.81;
  $  166.氧传感器浓/稀到稀/浓响应比率                                 $    $  rad          $    $  ANS090.BYTE004  $  y=(x1*256+x2)*128/65536.0;
  $  167.氧传感器电压(B1-S1)                                          $    $  mV           $    $  ANS093.BYTE004  $  y=x*4.34027771;
  $  168.氧传感器电压(B1-S2)                                          $    $  mV           $    $  ANS094.BYTE004  $  y=x*4.34027771;
  $  169.车载诊断系统类型                                             $    $               $    $  ANS095.BYTE004  $  if(x==0x01)y=@062d;else if(x==0x02)y=@062e;else if(x==0x03)y=@00c2;else if(x==0x04)y=@00c3;else if(x==0x05)y=@079f;else if(x==0x06)y=@07a0;else if(x==0x07)y=@00c6;else if(x==0x08)y=@00c7;else if(x==0x09)y=@07a1;else if(x==0x0A)y=@07a2;else if(x==0x0B)y=@07a3;else if(x==0x0C)y=@07a4;else if(x==0x0D)y=@07a5;else y=@01a9;
  $  170.相对节气门位置                                               $    $  %            $    $  ANS096.BYTE004  $  y=x*100/255;
  $  171.转速模式失火指数                                             $    $               $    $  ANS097.BYTE004  $  y=x1*256+x2;
  $  172.启动IAT                                                      $    $  degree C     $    $  ANS098.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  173.TEC(半导体致冷器)产线学齿测试次数                            $    $               $    $  ANS099.BYTE004  $  y=x;
  $  174.TEC(半导体致冷器)学习数据 气缸1                              $    $               $    $  ANS100.BYTE004  $  y=x1*256+x2;
  $  175.TEC(半导体致冷器)学习数据 气缸2                              $    $               $    $  ANS101.BYTE004  $  y=x1*256+x2;
  $  176.TEC(半导体致冷器)学习数据 气缸3                              $    $               $    $  ANS102.BYTE004  $  y=x1*256+x2;
  $  177.TEC(半导体致冷器)学习数据 气缸4                              $    $               $    $  ANS103.BYTE004  $  y=x1*256+x2;
  $  178.节气门位置A/D                                                $    $  V            $    $  ANS104.BYTE004  $  y=x*5/255.0;
  $  179.发动机起动后的时间                                           $    $  s            $    $  ANS105.BYTE004  $  y=x;
  $  180.故障灯激活发动运行时间                                       $    $               $    $  ANS106.BYTE004  $  y=x1*256+x2;
  $  181.当前失火总数                                                 $    $               $    $  ANS107.BYTE004  $  y=x1*256+x2;
  $  182.弱缸                                                         $    $               $    $  ANS108.BYTE004  $  if(x==0x00)y=@079d;else if(x<=0x08)y=@079e;else y=@01a9;
  $  183.车轮/车辆速度输入                                            $    $  kPa          $    $  ANS109.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E0 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
