
    车型ID：1022

    模拟：协议模拟-->1022

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:701 02 10 01 00 00 00 00 00       $~  ANS000:781 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:701 02 3E 80 00 00 00 00 00       $!  ANS000:781 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:701 03 19 02 09 00 00 00 00       $#  ANS000:781 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/22000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:701 04 14 FF FF FF 00 00 00       $$  ANS000:781 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:701 03 22 F1 A0 00 00 00 00       $%  ANS000:781 03 22 F1 A0 00 00 00 00
  $%  REQ001:701 03 22 F1 83 00 00 00 00       $%  ANS001:781 03 22 F1 83 00 00 00 00
  $%  REQ002:701 03 22 F1 91 00 00 00 00       $%  ANS002:781 03 22 F1 91 00 00 00 00
  $%  REQ003:701 03 22 F1 A2 00 00 00 00       $%  ANS003:781 03 22 F1 A2 00 00 00 00
  $%  REQ004:701 03 22 F1 87 00 00 00 00       $%  ANS004:781 03 22 F1 87 00 00 00 00
  $%  REQ005:701 03 22 F1 10 00 00 00 00       $%  ANS005:781 03 22 F1 10 00 00 00 00
  $%  REQ006:701 03 22 F1 92 00 00 00 00       $%  ANS006:781 03 22 F1 92 00 00 00 00
  $%  REQ007:701 03 22 F1 8C 00 00 00 00       $%  ANS007:781 03 22 F1 8C 00 00 00 00
  $%  REQ008:701 03 22 F1 94 00 00 00 00       $%  ANS008:781 03 22 F1 94 00 00 00 00
  $%  REQ009:701 03 22 F1 8A 00 00 00 00       $%  ANS009:781 03 22 F1 8A 00 00 00 00
  $%  REQ010:701 03 22 F1 90 00 00 00 00       $%  ANS010:781 03 22 F1 90 00 00 00 00
  $%  REQ011:701 03 22 F1 A8 00 00 00 00       $%  ANS011:781 03 22 F1 A8 00 00 00 00
  $%  REQ012:701 03 22 F1 8B 00 00 00 00       $%  ANS012:781 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元网络文件参考号:          $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号(上次):            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  006:测试工具参考号(上次):            $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  007:里程读数(上次)KM:                $%    $%  ANS005.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  008:供应商电控单元硬件参考号:        $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  009:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:系统供应商识别码:                $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:VIN码:                           $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  013:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  014:电控单元制造日期:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:701 03 22 C1 04 00 00 00 00       $  ANS000:781 03 22 C1 04 00 00 00 00
  $  REQ001:701 03 22 C1 01 00 00 00 00       $  ANS001:781 03 22 C1 01 00 00 00 00
  $  REQ002:701 03 22 E0 1B 00 00 00 00       $  ANS002:781 03 22 E0 1B 00 00 00 00
  $  REQ003:701 03 22 E0 1C 00 00 00 00       $  ANS003:781 03 22 E0 1C 00 00 00 00
  $  REQ004:701 03 22 E0 0C 00 00 00 00       $  ANS004:781 03 22 E0 0C 00 00 00 00
  $  REQ005:701 03 22 D3 02 00 00 00 00       $  ANS005:781 03 22 D3 02 00 00 00 00
  $  REQ006:701 03 22 C0 02 00 00 00 00       $  ANS006:781 03 22 C0 02 00 00 00 00
  $  REQ007:701 03 22 E0 1A 00 00 00 00       $  ANS007:781 03 22 E0 1A 00 00 00 00
  $  REQ008:701 03 22 D1 01 00 00 00 00       $  ANS008:781 03 22 D1 01 00 00 00 00
  $  REQ009:701 03 22 D1 02 00 00 00 00       $  ANS009:781 03 22 D1 02 00 00 00 00
  $  REQ010:701 03 22 D1 03 00 00 00 00       $  ANS010:781 03 22 D1 03 00 00 00 00
  $  REQ011:701 03 22 D1 04 00 00 00 00       $  ANS011:781 03 22 D1 04 00 00 00 00
  $  REQ012:701 03 22 D1 05 00 00 00 00       $  ANS012:781 03 22 D1 05 00 00 00 00
  $  REQ013:701 03 22 D1 06 00 00 00 00       $  ANS013:781 03 22 D1 06 00 00 00 00
  $  REQ014:701 03 22 D1 16 00 00 00 00       $  ANS014:781 03 22 D1 16 00 00 00 00
  $  REQ015:701 03 22 D1 17 00 00 00 00       $  ANS015:781 03 22 D1 17 00 00 00 00
  $  REQ016:701 03 22 E0 18 00 00 00 00       $  ANS016:781 03 22 E0 18 00 00 00 00
  $  REQ017:701 03 22 E0 02 00 00 00 00       $  ANS017:781 03 22 E0 02 00 00 00 00
  $  REQ018:701 03 22 D3 01 00 00 00 00       $  ANS018:781 03 22 D3 01 00 00 00 00
  $  REQ019:701 03 22 C1 02 00 00 00 00       $  ANS019:781 03 22 C1 02 00 00 00 00
  $  REQ020:701 03 22 C1 05 00 00 00 00       $  ANS020:781 03 22 C1 05 00 00 00 00
  $  REQ021:701 03 22 E0 16 00 00 00 00       $  ANS021:781 03 22 E0 16 00 00 00 00
  $  REQ022:701 03 22 E0 15 00 00 00 00       $  ANS022:781 03 22 E0 15 00 00 00 00
  $  REQ023:701 03 22 D1 31 00 00 00 00       $  ANS023:781 03 22 D1 31 00 00 00 00
  $  REQ024:701 03 22 E0 17 00 00 00 00       $  ANS024:781 03 22 E0 17 00 00 00 00
  $  REQ025:701 03 22 D1 30 00 00 00 00       $  ANS025:781 03 22 D1 30 00 00 00 00
  $  REQ026:701 03 22 C0 03 00 00 00 00       $  ANS026:781 03 22 C0 03 00 00 00 00

  $  000.左滑门                           $    $           $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  001.后风窗和后视镜加热               $    $           $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  002.右滑门                           $    $           $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  003.行车自动上锁                     $    $           $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  004.锁电机热保护                     $    $  s        $    $  ANS000.BYTE006  $  y=x;
  $  005.可学习遥控钥匙数量               $    $           $    $  ANS001.BYTE004  $  if((x&0x70)==0x10)y=@04d3;else if((x&0x70)==0x20)y=@0169;else if((x&0x70)==0x30)y=@016b;else if((x&0x70)==0x40)y=@0523;else y=@01a9;
  $  006.负载模式管理                     $    $           $    $  ANS001.BYTE004  $  if((x&0x0C)==0x00)y=@00e5;else if((x&0x0C)==0x04)y=@0524;else if((x&0x0C)==0x08)y=@0525;else y=@01a9;
  $  007.生产运行周期                     $    $           $    $  ANS001.BYTE004  $  if((x&0x03)==0x00)y=@050b;else if((x&0x03)==0x01)y=@050c;else if((x&0x03)==0x02)y=@050d;else if((x&0x03)==0x03)y=@050e;else y=@01a9;
  $  008.TCU配置                          $    $           $    $  ANS001.BYTE005  $  if((x&0x80)==0x80)y=@050a;else y=@0112;
  $  009.PEPS配置                         $    $           $    $  ANS001.BYTE005  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  010.防盗配置                         $    $           $    $  ANS001.BYTE005  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  011.左舵或右舵                       $    $           $    $  ANS001.BYTE005  $  if((x&0x10)==0x10)y=@050f;else y=@0510;
  $  012.PTG电动尾门配置                  $    $           $    $  ANS001.BYTE005  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  013.左电动滑移门配置                 $    $           $    $  ANS001.BYTE005  $  if((x&0x04)==0x04)y=@050a;else y=@0112;
  $  014.右电动滑移门配置                 $    $           $    $  ANS001.BYTE005  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  015.V79电动车配置                    $    $           $    $  ANS001.BYTE005  $  if((x&0x01)==0x01)y=@0533;else y=@0534;
  $  016.后视镜折叠驱动时间               $    $           $    $  ANS001.BYTE006  $  if((x&0xC0)==0x00)y=@0535;else if((x&0xC0)==0x40)y=@0536;else if((x&0xC0)==0x80)y=@0537;else y=@0538;
  $  017.转向变道开关滤波时间             $    $           $    $  ANS001.BYTE006  $  if((x&0x30)==0x00)y=@0539;else if((x&0x30)==0x10)y=@053a;else if((x&0x30)==0x20)y=@053b;else y=@053c;
  $  018.行驶里程备份                     $    $  km       $    $  ANS002.BYTE004  $  y=(x1*256*256)+(x2*256)+x3;
  $  019.保养里程备份                     $    $  km       $    $  ANS003.BYTE004  $  y=(x1*256*256)+(x2*256)+x3;
  $  020.碰撞信号                         $    $           $    $  ANS004.BYTE004  $  y=x;
  $  021.变速箱挡位信号                   $    $           $    $  ANS005.BYTE004  $  if((x&0x0F)==0x00)y=@0514;else if((x&0x0F)==0x01)y=@00b4;else if((x&0x0F)==0x02)y=@0388;else if((x&0x0F)==0x03)y=@0515;else if((x&0x0F)==0x04)y=@0516;else if((x&0x0F)==0x05)y=@0517;else if((x&0x0F)==0x06)y=@0518;else if((x&0x0F)==0x07)y=@0519;else if((x&0x0F)==0x08)y=@051a;else if((x&0x0F)==0x09)y=@051b;else if((x&0x0F)==0x0A)y=@051c;else if((x&0x0F)==0x0B)y=@051d;else if((x&0x0F)==0x0F)y=@051e;else y=@01a9;
  $  022.当前IDE                          $    $           $    $  ANS006.BYTE004  $  HEX(X1,X2,X3,X4);
  $  023.当前已学习遥控钥匙数量           $    $           $    $  ANS007.BYTE004  $  y=x;
  $  024.近光灯开关                       $    $           $    $  ANS008.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  025.驾驶门开关                       $    $           $    $  ANS008.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  026.右前门开关状态输入               $    $           $    $  ANS008.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  027.尾门开关状态                     $    $           $    $  ANS008.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  028.远光灯开关输入                   $    $           $    $  ANS008.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  029.前雨刮归位信号开关               $    $           $    $  ANS008.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  030.危险警报开关                     $    $           $    $  ANS008.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  031.位置灯开关                       $    $           $    $  ANS008.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  032.后窗和后视镜加热开关输入         $    $           $    $  ANS009.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  033.后雾灯开关                       $    $           $    $  ANS009.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  034.驾驶员门门锁解锁反馈开关         $    $           $    $  ANS009.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  035.副驾驶员门门锁解锁反馈开关       $    $           $    $  ANS009.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  036.乘客侧门解锁反馈开关             $    $           $    $  ANS009.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  037.右转向灯开关                     $    $           $    $  ANS009.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  038.内顶灯自动挡开关                 $    $           $    $  ANS009.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  039.前雨刮中速开关                   $    $           $    $  ANS009.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  040.前雨刮低速开关                   $    $           $    $  ANS010.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  041.驾驶员门门锁闭锁反馈开关         $    $           $    $  ANS010.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  042.左后门开关状态输入               $    $           $    $  ANS010.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  043.右后门开关状态输入               $    $           $    $  ANS010.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  044.前雾灯使能开关                   $    $           $    $  ANS010.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  045.钥匙插入信号输入                 $    $           $    $  ANS010.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  046.油箱盖开关输入                   $    $           $    $  ANS010.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  047.前雨刮高速开关                   $    $           $    $  ANS010.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  048.前雨刷器间歇开关                 $    $           $    $  ANS011.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  049.内顶灯常关挡开关                 $    $           $    $  ANS011.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  050.前雨刷开关                       $    $           $    $  ANS011.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  051.后雨刮停止挡                     $    $           $    $  ANS011.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  052.KL.R开关                         $    $           $    $  ANS012.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  053.KL.15点火开关                    $    $           $    $  ANS012.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  054.KL.50启动开关                    $    $           $    $  ANS012.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  055.倒车灯开关                       $    $           $    $  ANS012.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  056.洗涤液位过低信号                 $    $           $    $  ANS012.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  057.后雨刮开关                       $    $           $    $  ANS012.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  058.ECO开关输入                      $    $           $    $  ANS012.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  059.SPORT开关输入                    $    $           $    $  ANS012.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  060.中控闭锁开关输入                 $    $           $    $  ANS013.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  061.后清洗器开关                     $    $           $    $  ANS013.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  062.刹车灯开关                       $    $           $    $  ANS013.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  063.远光灯开关                       $    $           $    $  ANS013.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  064.左转向灯开关                     $    $           $    $  ANS013.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  065.自动灯光开关                     $    $           $    $  ANS013.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  066.内顶灯常开挡开关                 $    $           $    $  ANS013.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  067.中控解锁开关输入                 $    $           $    $  ANS013.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  068.中控闭锁输出                     $    $           $    $  ANS014.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  069.油箱盖                           $    $           $    $  ANS014.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  070.中控解锁输出                     $    $           $    $  ANS014.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  071.后清洗器                         $    $           $    $  ANS014.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  072.后雨刮                           $    $           $    $  ANS014.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  073.近光灯继电器                     $    $           $    $  ANS014.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  074.远光灯继电器                     $    $           $    $  ANS014.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  075.前雾灯继电器                     $    $           $    $  ANS014.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  076.后窗和后视镜加热继电器           $    $           $    $  ANS014.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  077.喇叭继电器                       $    $           $    $  ANS014.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  078.前雨刮低速继电器驱动输出         $    $           $    $  ANS014.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  079.前雨刮高速继电器驱动输出         $    $           $    $  ANS014.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  080.大灯清洗继电器                   $    $           $    $  ANS014.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  081.倒挡灯                           $    $           $    $  ANS015.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  082.电动车窗使能继电器驱动输出       $    $           $    $  ANS015.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  083.日间行车灯输出                   $    $           $    $  ANS015.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  084.刹车灯                           $    $           $    $  ANS015.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  085.尾门灯                           $    $           $    $  ANS015.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  086.位置灯                           $    $           $    $  ANS015.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  087.后雾灯输出                       $    $           $    $  ANS015.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  088.左转向灯                         $    $           $    $  ANS015.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  089.右转向灯                         $    $           $    $  ANS015.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  090.车身防盗状态指示灯               $    $           $    $  ANS015.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  091.发动机运行状态                   $    $           $    $  ANS016.BYTE004  $  if(x==0x00)y=@018e;else if(x==0x01)y=@0011;else y=@01a9;
  $  092.前雨刮间歇挡位                   $    $           $    $  ANS017.BYTE004  $  y=x1*256+x2;
  $  093.IMMO(防盗系统)锁定状态           $    $           $    $  ANS018.BYTE004  $  if((x&0x80)==0x80)y=@0055;else y=@0404;
  $  094.钥匙数量                         $    $           $    $  ANS018.BYTE004  $  y=(x&0x0F);
  $  095.远光灯点亮方式                   $    $           $    $  ANS019.BYTE004  $  if((x&0x80)==0x80)y=@052e;else y=@052f;
  $  096.前雾灯                           $    $           $    $  ANS019.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  097.自动灯光和前雨刮                 $    $           $    $  ANS019.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  098.尾门灯                           $    $           $    $  ANS019.BYTE004  $  if((x&0x10)==0x10)y=@050a;else y=@0112;
  $  099.日间行车灯                       $    $           $    $  ANS019.BYTE004  $  if((x&0x08)==0x08)y=@050a;else y=@0112;
  $  100.尾门灯点亮方式                   $    $           $    $  ANS019.BYTE004  $  if((x&0x04)==0x04)y=@0530;else y=@0501;
  $  101.后雾灯                           $    $           $    $  ANS019.BYTE004  $  if((x&0x02)==0x02)y=@050a;else y=@0112;
  $  102.照我回家功能外延时灯             $    $           $    $  ANS020.BYTE004  $  if((x&0xE0)==0x00)y=@000f;else if((x&0xE0)==0x20)y=@0531;else if((x&0xE0)==0x40)y=@04fd;else if((x&0xE0)==0x60)y=@0502;else if((x&0xE0)==0x80)y=@0503;else y=@01a9;
  $  103.解防设防反馈方式                 $    $           $    $  ANS020.BYTE004  $  if((x&0x18)==0x00)y=@000f;else if((x&0x18)==0x08)y=@0497;else if((x&0x18)==0x10)y=@0498;else y=@01a9;
  $  104.熄火解锁触发方式                 $    $           $    $  ANS020.BYTE004  $  if((x&0x06)==0x00)y=@0187;else if((x&0x06)==0x02)y=@0532;else if((x&0x06)==0x04)y=@0055;else y=@01a9;
  $  105.内顶灯门碰输出                   $    $           $    $  ANS021.BYTE004  $  y=x;
  $  106.内顶阅读灯输出                   $    $           $    $  ANS022.BYTE004  $  y=x;
  $  107.自动灯光控制                     $    $           $    $  ANS023.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  108.光雨量传感器状态                 $    $           $    $  ANS023.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  109.车速                             $    $  km/h     $    $  ANS024.BYTE004  $  y=(x1*256+x2)*0.05625;
  $  110.车速状态                         $    $           $    $  ANS024.BYTE006  $  if(x==0x00)y=@00bb;else if(x==0x01)y=@0136;else y=@01a9;
  $  111.洗涤液位警告                     $    $           $    $  ANS025.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  112.后雨刮                           $    $           $    $  ANS026.BYTE004  $  if((x&0x40)==0x40)y=@050a;else y=@0112;
  $  113.头灯清洗器                       $    $           $    $  ANS026.BYTE004  $  if((x&0x20)==0x20)y=@050a;else y=@0112;
  $  114.雨刮堵转判断时间                 $    $  s        $    $  ANS026.BYTE006  $  y=x;
  $  115.头灯清洗输出时间                 $    $  s        $    $  ANS026.BYTE007  $  y=x*0.1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:701 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
