
    车型ID：1031

    模拟：协议模拟-->1031

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/31000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 A2 00 00 00 00       $%  ANS004:769 03 22 F1 A2 00 00 00 00
  $%  REQ005:761 03 22 F1 87 00 00 00 00       $%  ANS005:769 03 22 F1 87 00 00 00 00
  $%  REQ006:761 03 22 F1 10 00 00 00 00       $%  ANS006:769 03 22 F1 10 00 00 00 00
  $%  REQ007:761 03 22 F1 92 00 00 00 00       $%  ANS007:769 03 22 F1 92 00 00 00 00
  $%  REQ008:761 03 22 F1 8C 00 00 00 00       $%  ANS008:769 03 22 F1 8C 00 00 00 00
  $%  REQ009:761 03 22 F1 94 00 00 00 00       $%  ANS009:769 03 22 F1 94 00 00 00 00
  $%  REQ010:761 03 22 F1 8A 00 00 00 00       $%  ANS010:769 03 22 F1 8A 00 00 00 00
  $%  REQ011:761 03 22 F1 90 00 00 00 00       $%  ANS011:769 03 22 F1 90 00 00 00 00
  $%  REQ012:761 03 22 F1 A8 00 00 00 00       $%  ANS012:769 03 22 F1 A8 00 00 00 00
  $%  REQ013:761 03 22 F1 8B 00 00 00 00       $%  ANS013:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:控制器单元名:                    $%    $%  ANS001.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  002:发布时间:                        $%    $%  ANS001.BYTE008  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);
  $%  003:RFD版本:                         $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  004:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次)KM:                $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:车辆零件识别号:                  $%    $%  ANS008.BYTE005  $%  ASCII(X1,X2);
  $%  013:供应商代码:                      $%    $%  ANS008.BYTE007  $%  ASCII(X1,X2,X3,X4);
  $%  014:年:                              $%    $%  ANS008.BYTE011  $%  ASCII(X1);
  $%  015:月:                              $%    $%  ANS008.BYTE012  $%  ASCII(X1);
  $%  016:日:                              $%    $%  ANS008.BYTE013  $%  ASCII(X1);
  $%  017:序列号:                          $%    $%  ANS008.BYTE016  $%  ASCII(X1,X2,X3,X4);
  $%  018:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  019:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  020:系统供应商识别码:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  021:VIN码:                           $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  022:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  023:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 B0 07 00 00 00 00       $  ANS000:769 03 22 B0 07 00 00 00 00
  $  REQ001:761 03 22 B0 02 00 00 00 00       $  ANS001:769 03 22 B0 02 00 00 00 00
  $  REQ002:761 03 22 B0 03 00 00 00 00       $  ANS002:769 03 22 B0 03 00 00 00 00
  $  REQ003:761 03 22 B0 04 00 00 00 00       $  ANS003:769 03 22 B0 04 00 00 00 00
  $  REQ004:761 03 22 E0 04 00 00 00 00       $  ANS004:769 03 22 E0 04 00 00 00 00
  $  REQ005:761 03 22 E0 06 00 00 00 00       $  ANS005:769 03 22 E0 06 00 00 00 00
  $  REQ006:761 03 22 B1 0A 00 00 00 00       $  ANS006:769 03 22 B1 0A 00 00 00 00
  $  REQ007:761 03 22 B1 06 00 00 00 00       $  ANS007:769 03 22 B1 06 00 00 00 00
  $  REQ008:761 03 22 B0 0B 00 00 00 00       $  ANS008:769 03 22 B0 0B 00 00 00 00
  $  REQ009:761 03 22 E0 05 00 00 00 00       $  ANS009:769 03 22 E0 05 00 00 00 00
  $  REQ010:761 03 22 B0 09 00 00 00 00       $  ANS010:769 03 22 B0 09 00 00 00 00
  $  REQ011:761 03 22 E0 07 00 00 00 00       $  ANS011:769 03 22 E0 07 00 00 00 00
  $  REQ012:761 03 22 B1 04 00 00 00 00       $  ANS012:769 03 22 B1 04 00 00 00 00
  $  REQ013:761 03 22 E0 08 00 00 00 00       $  ANS013:769 03 22 E0 08 00 00 00 00
  $  REQ014:761 03 22 E0 02 00 00 00 00       $  ANS014:769 03 22 E0 02 00 00 00 00
  $  REQ015:761 03 22 B0 0A 00 00 00 00       $  ANS015:769 03 22 B0 0A 00 00 00 00
  $  REQ016:761 03 22 B0 01 00 00 00 00       $  ANS016:769 03 22 B0 01 00 00 00 00
  $  REQ017:761 03 22 E0 03 00 00 00 00       $  ANS017:769 03 22 E0 03 00 00 00 00
  $  REQ018:761 03 22 D0 01 00 00 00 00       $  ANS018:769 03 22 D0 01 00 00 00 00
  $  REQ019:761 03 22 B0 08 00 00 00 00       $  ANS019:769 03 22 B0 08 00 00 00 00
  $  REQ020:761 03 22 D1 02 00 00 00 00       $  ANS020:769 03 22 D1 02 00 00 00 00
  $  REQ021:761 03 22 B0 06 00 00 00 00       $  ANS021:769 03 22 B0 06 00 00 00 00
  $  REQ022:761 03 22 B0 05 00 00 00 00       $  ANS022:769 03 22 B0 05 00 00 00 00
  $  REQ023:761 03 22 C0 20 00 00 00 00       $  ANS023:769 03 22 C0 20 00 00 00 00
  $  REQ024:761 03 22 C0 23 00 00 00 00       $  ANS024:769 03 22 C0 23 00 00 00 00
  $  REQ025:761 03 22 C0 01 00 00 00 00       $  ANS025:769 03 22 C0 01 00 00 00 00
  $  REQ026:761 03 22 C0 02 00 00 00 00       $  ANS026:769 03 22 C0 02 00 00 00 00
  $  REQ027:761 03 22 C0 03 00 00 00 00       $  ANS027:769 03 22 C0 03 00 00 00 00
  $  REQ028:761 03 22 C0 04 00 00 00 00       $  ANS028:769 03 22 C0 04 00 00 00 00
  $  REQ029:761 03 22 C0 05 00 00 00 00       $  ANS029:769 03 22 C0 05 00 00 00 00
  $  REQ030:761 03 22 C0 06 00 00 00 00       $  ANS030:769 03 22 C0 06 00 00 00 00
  $  REQ031:761 03 22 C0 07 00 00 00 00       $  ANS031:769 03 22 C0 07 00 00 00 00
  $  REQ032:761 03 22 C0 08 00 00 00 00       $  ANS032:769 03 22 C0 08 00 00 00 00
  $  REQ033:761 03 22 C0 09 00 00 00 00       $  ANS033:769 03 22 C0 09 00 00 00 00
  $  REQ034:761 03 22 C0 0A 00 00 00 00       $  ANS034:769 03 22 C0 0A 00 00 00 00
  $  REQ035:761 03 22 C0 0B 00 00 00 00       $  ANS035:769 03 22 C0 0B 00 00 00 00
  $  REQ036:761 03 22 C0 0C 00 00 00 00       $  ANS036:769 03 22 C0 0C 00 00 00 00
  $  REQ037:761 03 22 C0 0D 00 00 00 00       $  ANS037:769 03 22 C0 0D 00 00 00 00
  $  REQ038:761 03 22 C0 0E 00 00 00 00       $  ANS038:769 03 22 C0 0E 00 00 00 00
  $  REQ039:761 03 22 C0 0F 00 00 00 00       $  ANS039:769 03 22 C0 0F 00 00 00 00
  $  REQ040:761 03 22 E0 09 00 00 00 00       $  ANS040:769 03 22 E0 09 00 00 00 00

  $  000.车辆速度                               $    $  km/h         $    $  ANS000.BYTE004  $  y=(x1*256+x2)/256*1.8;
  $  001.车速状态                               $    $               $    $  ANS000.BYTE005  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  002.左转向灯状态                           $    $               $    $  ANS001.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  003.右转向灯状态                           $    $               $    $  ANS001.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  004.倒挡                                   $    $               $    $  ANS001.BYTE004  $  if((x&0x20)==0x20)y=@0388;else y=@0669;
  $  005.系统电源模式                           $    $               $    $  ANS001.BYTE004  $  if((x&0x18)==0x00)y=@000f;else if((x&0x18)==0x08)y=@0010;else if((x&0x18)==0x10)y=@0011;else y=@05d2;
  $  006.系统电源模式有效性                     $    $               $    $  ANS001.BYTE004  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  007.位置灯状态                             $    $               $    $  ANS001.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  008.近光灯状态                             $    $               $    $  ANS001.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  009.远光灯状态                             $    $               $    $  ANS001.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  010.驾驶员门开关状态                       $    $               $    $  ANS001.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  011.前排乘员门开关状态                     $    $               $    $  ANS001.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  012.驾驶员侧车门锁定状态                   $    $               $    $  ANS001.BYTE006  $  if((x&0xC0)==0x00)y=@0052;else if((x&0xC0)==0x40)y=@0055;else if((x&0xC0)==0x80)y=@01a9;else y=@0136;
  $  013.乘客门锁定状态                         $    $               $    $  ANS001.BYTE006  $  if((x&0x30)==0x00)y=@0052;else if((x&0x30)==0x10)y=@0055;else if((x&0x30)==0x20)y=@01a9;else y=@0136;
  $  014.前舱开关状态                           $    $               $    $  ANS001.BYTE006  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  015.前舱开关状态有效性                     $    $               $    $  ANS001.BYTE006  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  016.前雾灯状态                             $    $               $    $  ANS001.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  017.后雾灯状态                             $    $               $    $  ANS001.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  018.右后门开关状态                         $    $               $    $  ANS001.BYTE007  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  019.左后侧门开关状态                       $    $               $    $  ANS001.BYTE007  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  020.尾门开关状态                           $    $               $    $  ANS001.BYTE007  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  021.自动灯关控制                           $    $               $    $  ANS001.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  022.日间行车灯状态                         $    $               $    $  ANS001.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  023.方向指示灯状态                         $    $               $    $  ANS001.BYTE007  $  if((x&0x06)==0x00)y=@000f;else if((x&0x06)==0x02)y=@0667;else if((x&0x06)==0x04)y=@0668;else y=@01a9;
  $  024.BCM中VIN码(字节0)                      $    $               $    $  ANS002.BYTE004  $  HEX(X);
  $  025.BCM中VIN码(字节1)                      $    $               $    $  ANS002.BYTE005  $  HEX(X);
  $  026.BCM中VIN码(字节2)                      $    $               $    $  ANS002.BYTE006  $  HEX(X);
  $  027.BCM中VIN码(字节3)                      $    $               $    $  ANS002.BYTE007  $  HEX(X);
  $  028.BCM中VIN码(字节4)                      $    $               $    $  ANS002.BYTE008  $  HEX(X);
  $  029.BCM中VIN码(字节5)                      $    $               $    $  ANS002.BYTE009  $  HEX(X);
  $  030.BCM中VIN码(字节6)                      $    $               $    $  ANS002.BYTE010  $  HEX(X);
  $  031.BCM中VIN码(字节7)                      $    $               $    $  ANS002.BYTE011  $  HEX(X);
  $  032.车身控制模块配置状态                   $    $               $    $  ANS003.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $  033.平衡值                                 $    $               $    $  ANS004.BYTE004  $  y=(x&0x7F)-(x&0x80);
  $  034.当前音效                               $    $               $    $  ANS005.BYTE004  $  if(x==0x00)y=@064f;else if(x==0x01)y=@0650;else if(x==0x02)y=@0651;else if(x==0x03)y=@0652;else if(x==0x04)y=@0653;else if(x==0x05)y=@0654;else y=@01a9;
  $  035.FICM下线配置版本                       $    $               $    $  ANS006.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  036.电器电瓶电压                           $    $  V            $    $  ANS007.BYTE004  $  y=x*0.1;
  $  037.当前MIC电压                            $    $  V            $    $  ANS007.BYTE005  $  y=x*0.1;
  $  038.当前左转向轮控制器电压                 $    $  V            $    $  ANS007.BYTE006  $  y=x*0.1;
  $  039.当前右转向轮控制器电压                 $    $  V            $    $  ANS007.BYTE007  $  y=x*0.1;
  $  040.当前调谐器天线电压                     $    $  V            $    $  ANS007.BYTE008  $  y=x*0.1;
  $  041.环境温度                               $    $  degree C     $    $  ANS008.BYTE004  $  y=(x1*256+x2)*0.1-40;
  $  042.环境温度有效性                         $    $               $    $  ANS008.BYTE006  $  if((x&0x80)==0x80)y=@0136;else y=@00bb;
  $  043.动力模式                               $    $               $    $  ANS008.BYTE006  $  if((x&0x70)==0x00)y=@0137;else if((x&0x70)==0x10)y=@0011;else if((x&0x70)==0x20)y=@064d;else if((x&0x70)==0x30)y=@0474;else if((x&0x70)==0x40)y=@0655;else if((x&0x70)==0x50)y=@0656;else if((x&0x70)==0x60)y=@0657;else y=@0525;
  $  044.ACC                                    $    $               $    $  ANS008.BYTE006  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  045.背光                                   $    $               $    $  ANS008.BYTE006  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  046.网络                                   $    $               $    $  ANS008.BYTE006  $  if((x&0x02)==0x02)y=@00bb;else y=@064d;
  $  047.反向                                   $    $               $    $  ANS008.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  048.渐变值                                 $    $               $    $  ANS009.BYTE004  $  y=(x&0x7F)-(x&0x80);
  $  049.仪表总里程                             $    $  km           $    $  ANS010.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  050.燃油箱液位                             $    $               $    $  ANS010.BYTE007  $  y=(x&0xFE)/2;
  $  051.操作杠                                 $    $               $    $  ANS010.BYTE007  $  if((x&0x01)==0x01)y=@000f;else y=@05b9;
  $  052.仪表驾驶员座椅安全带警告               $    $               $    $  ANS010.BYTE008  $  if((x&0x80)==0x80)y=@0135;else y=@05c2;
  $  053.车辆维修状态                           $    $               $    $  ANS010.BYTE008  $  if((x&0x60)==0x00)y=@061c;else if((x&0x60)==0x20)y=@061d;else if((x&0x60)==0x40)y=@064e;else y=@01a9;
  $  054.仪表SIA(服务区间公告)里程表            $    $               $    $  ANS010.BYTE009  $  y=x1*256*256+x2*256+x3;
  $  055.仪表显示平均油耗                       $    $  L/km         $    $  ANS010.BYTE012  $  y=x*0.1;
  $  056.仪表显示瞬时油耗                       $    $               $    $  ANS010.BYTE013  $  y=x*0.1;
  $  057.仪表显示剩余驾驶距离                   $    $  km           $    $  ANS010.BYTE014  $  y=((x1*256)+(x2&0xF0))/16;
  $  058.仪表上瞬时油耗有效性                   $    $               $    $  ANS010.BYTE015  $  if((x&0x08)==0x08)y=@0136;else y=@00bb;
  $  059.仪表上平均油耗有效性                   $    $               $    $  ANS010.BYTE015  $  if((x&0x04)==0x04)y=@0136;else y=@00bb;
  $  060.LCD亮度                                $    $               $    $  ANS011.BYTE004  $  y=x;
  $  061.IFP软件版本                            $    $               $    $  ANS012.BYTE006  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  062.响度补偿开关                           $    $               $    $  ANS013.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@016d;else y=@000f;
  $  063.导航系统音量                           $    $               $    $  ANS014.BYTE004  $  y=x;
  $  064.PEPS钥匙状态                           $    $               $    $  ANS015.BYTE004  $  if((x&0xE0)==0x00)y=@000f;else if((x&0xE0)==0x20)y=@0463;else if((x&0xE0)==0x40)y=@0666;else if((x&0xE0)==0x60)y=@009e;else if((x&0xE0)==0xE0)y=@0136;else y=@01a9;
  $  065.变速箱换挡杠位置                       $    $               $    $  ANS015.BYTE004  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  066.加速踏板位置                           $    $  %            $    $  ANS016.BYTE004  $  y=(x*100)/255.0;
  $  067.加速器有效位置                         $    $  %            $    $  ANS016.BYTE005  $  y=(x*100)/255.0;
  $  068.油门踏板位置有效性                     $    $               $    $  ANS016.BYTE006  $  if((x&0x80)==0x80)y=@0136;else y=@00bb;
  $  069.加速器有效位置有效性                   $    $               $    $  ANS016.BYTE006  $  if((x&0x40)==0x40)y=@0136;else y=@00bb;
  $  070.发动机转速                             $    $  rpm          $    $  ANS016.BYTE007  $  y=(x1*256+x2)*0.25;
  $  071.自动巡航控制                           $    $               $    $  ANS016.BYTE009  $  if((x&0x80)==0x80)y=@00bb;else y=@0136;
  $  072.发动机运行                             $    $               $    $  ANS016.BYTE009  $  if((x&0x40)==0x40)y=@0078;else y=@0658;
  $  073.燃油消耗                               $    $  mL           $    $  ANS016.BYTE010  $  y=x1*256+x2;
  $  074.冷却风扇级别反馈                       $    $               $    $  ANS016.BYTE012  $  if((x&0xF0)==0x00)y=@0659;else if((x&0xF0)==0x10)y=@04f8;else if((x&0xF0)==0x020)y=@04f7;else if((x&0xF0)==0x30)y=@04f6;else if((x&0xF0)==0x40)y=@04f5;else if((x&0xF0)==0x50)y=@04f4;else if((x&0xF0)==0x60)y=@065a;else if((x&0xF0)==0x70)y=@065b;else if((x&0xF0)==0x80)y=@065c;else if((x&0xF0)==0x90)y=@065d;else if((x&0xF0)==0xA0)y=@065e;else if((x&0xF0)==0xB0)y=@065f;else if((x&0xF0)==0xC0)y=@0660;else if((x&0xF0)==0xD0)y=@0661;else if((x&0xF0)==0xE0)y=@0662;else y=@0663;
  $  075.巡航控制驾驶员设置的速度               $    $               $    $  ANS016.BYTE012  $  y=((x1&0x0F)*256+x2)*0.0625;
  $  076.大气压力                               $    $  hPa          $    $  ANS016.BYTE014  $  y=x*5;
  $  077.手机音量                               $    $               $    $  ANS017.BYTE004  $  y=x;
  $  078.全局KL.50状态                          $    $               $    $  ANS018.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  079.全局发动机运行状态                     $    $               $    $  ANS018.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  080.全局KL.15状态                          $    $               $    $  ANS018.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  081.全局KL.R状态                           $    $               $    $  ANS018.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  082.系统KL.50状态                          $    $               $    $  ANS018.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  083.系统发动机运行状态                     $    $               $    $  ANS018.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  084.系统KL.15状态                          $    $               $    $  ANS018.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  085.系统KL.R状态                           $    $               $    $  ANS018.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  086.方向盘转角                             $    $  rad          $    $  ANS019.BYTE004  $  y=(x1*256+x2)*0.1;
  $  087.方向盘转速                             $    $  rad/s        $    $  ANS019.BYTE006  $  y=x*4;
  $  088.SAS(方向盘转向角传感器)失败状态        $    $               $    $  ANS019.BYTE007  $  if((x&0x80)==0x80)y=@0664;else y=@0665;
  $  089.SAS(方向盘转向角传感器)校准状态        $    $               $    $  ANS019.BYTE007  $  if((x&0x40)==0x40)y=@06f4;else y=@06f5;
  $  090.方向盘控制_音量升                      $    $               $    $  ANS020.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  091.方向盘控制_音量降                      $    $               $    $  ANS020.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  092.方向盘控制向上搜索                     $    $               $    $  ANS020.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  093.方向盘控制向下搜索                     $    $               $    $  ANS020.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  094.方向盘控制_静音                        $    $               $    $  ANS020.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  095.方向盘控制_呼叫拒绝                    $    $               $    $  ANS020.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  096.方向盘控制源                           $    $               $    $  ANS020.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  097.*按键                                  $    $               $    $  ANS020.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  098.语音控制                               $    $               $    $  ANS020.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  099.MUSIC/CAMERA按键                       $    $               $    $  ANS020.BYTE006  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  100.CAR按键                                $    $               $    $  ANS020.BYTE006  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  101.HOME按键                               $    $               $    $  ANS020.BYTE006  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  102.音量+按键                              $    $               $    $  ANS020.BYTE006  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  103.音量-按键                              $    $               $    $  ANS020.BYTE006  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  104.变速杠位置                             $    $               $    $  ANS021.BYTE004  $  if(x==0x31)y=@0204;else if(x==0x32)y=@0205;else if(x==0x33)y=@0071;else if(x==0x34)y=@0072;else if(x==0x35)y=@0206;else if(x==0x34)y=@0072;else if(x==0x46)y=@06f6;else if(x==0x34)y=@0072;else if(x==0x4E)y=@06f7;else if(x==0x50)y=@06f8;else if(x==0x52)y=@06f9;else y=@01a9;
  $  105.左前轮胎压力                           $    $  kPa          $    $  ANS022.BYTE004  $  y=x*2.75;
  $  106.右前轮胎压力                           $    $  kPa          $    $  ANS022.BYTE005  $  y=x*2.75;
  $  107.右后轮胎压力                           $    $  kPa          $    $  ANS022.BYTE006  $  y=x*2.75;
  $  108.左后轮胎压力                           $    $  kPa          $    $  ANS022.BYTE007  $  y=x*2.75;
  $  109.轮胎温度                               $    $  degree C     $    $  ANS022.BYTE008  $  y=x-60;
  $  110.轮胎位置                               $    $               $    $  ANS022.BYTE009  $  if((x&0xE0)==0x00)y=@06fa;else if((x&0xE0)==0x20)y=@06fb;else if((x&0xE0)==0x40)y=@06fc;else if((x&0xE0)==0x60)y=@06fd;else if((x&0xE0)==0x80)y=@06fe;else y=@0035;
  $  111.胎压管理系统等状态                     $    $               $    $  ANS022.BYTE009  $  if((x&0x18)==0x00)y=@046a;else if((x&0x18)==0x08)y=@06ff;else if((x&0x18)==0x10)y=@046c;else y=@01a9;
  $  112.对这帧信息新获得或保留的最后时间       $    $               $    $  ANS022.BYTE009  $  if((x&0x04)==0x04)y=@0700;else y=@0701;
  $  113.系统状态                               $    $               $    $  ANS022.BYTE010  $  if((x&0xE0)==0x00)y=@05c2;else if((x&0xE0)==0x20)y=@05c4;else if((x&0xE0)==0x40)y=@05c5;else if((x&0xE0)==0x60)y=@05c6;else if((x&0xE0)==0x80)y=@05c7;else if((x&0xE0)==0xA0)y=@05c8;else if((x&0xE0)==0xC0)y=@05c9;else y=@05ca;
  $  114.左前轮胎压力报警状态                   $    $               $    $  ANS022.BYTE009  $  if((x&0xE0)==0x00)y=@05c2;else if((x&0xE0)==0x20)y=@05c4;else if((x&0xE0)==0x40)y=@05c5;else if((x&0xE0)==0x60)y=@05c6;else if((x&0xE0)==0x80)y=@05c7;else if((x&0xE0)==0xA0)y=@05c8;else if((x&0xE0)==0xC0)y=@05c9;else y=@05ca;
  $  115.右前轮胎压力报警状态                   $    $               $    $  ANS022.BYTE009  $  if((x&0x1C)==0x00)y=@05c2;else if((x&0x1C)==0x04)y=@05c4;else if((x&0x1C)==0x08)y=@05c5;else if((x&0x1C)==0x0C)y=@05c6;else if((x&0x1C)==0x10)y=@05c7;else if((x&0x1C)==0x14)y=@05c8;else if((x&0x1C)==0x18)y=@05c9;else y=@05ca;
  $  116.温度报警                               $    $               $    $  ANS022.BYTE010  $  if((x&0x02)==0x02)y=@06db;else y=@06dc;
  $  117.右后轮胎压力报警状态                   $    $               $    $  ANS022.BYTE009  $  if((x&0x03)==0x00)y=@05c3;else if((x&0x03)==0x01)y=@00d3;else if((x&0x03)==0x02)y=@00d4;else y=@0004;
  $  118.左后轮胎压力报警状态                   $    $               $    $  ANS022.BYTE010  $  if((x&0x1C)==0x00)y=@05c2;else if((x&0x1C)==0x04)y=@05c4;else if((x&0x1C)==0x08)y=@05c5;else if((x&0x1C)==0x0C)y=@05c6;else if((x&0x1C)==0x10)y=@05c7;else if((x&0x1C)==0x14)y=@05c8;else if((x&0x1C)==0x18)y=@05c9;else y=@05ca;
  $  119.驾驶模式                               $    $               $    $  ANS023.BYTE004  $  if(x==0x00)y=@02ac;else if(x==0x01)y=@0627;else y=@01a9;
  $  120.发动机启停功能                         $    $               $    $  ANS023.BYTE005  $  if(x==0x00)y=@02ac;else if(x==0x01)y=@0627;else y=@01a9;
  $  121.电动后视镜配置                         $    $               $    $  ANS023.BYTE006  $  if(x==0x00)y=@06dd;else if(x==0x01)y=@06de;else if(x==0x02)y=@06df;else y=@01a9;
  $  122.车顶的DVD显示                          $    $               $    $  ANS023.BYTE007  $  if(x==0x00)y=@02ac;else if(x==0x01)y=@0627;else y=@01a9;
  $  123.车联网                                 $    $               $    $  ANS024.BYTE004  $  if(x==0x00)y=@06e0;else if(x==0x01)y=@06e1;else if(x==0x02)y=@048e;else if(x==0x03)y=@048c;else y=@01a9;
  $  124.手机互联网                             $    $               $    $  ANS024.BYTE005  $  if(x==0x00)y=@02ac;else if(x==0x01)y=@0627;else y=@01a9;
  $  125.迎宾灯                                 $    $               $    $  ANS024.BYTE006  $  if(x==0x00)y=@02ac;else if(x==0x01)y=@0627;else y=@01a9;
  $  126.氛围灯                                 $    $               $    $  ANS024.BYTE007  $  if(x==0x00)y=@02ac;else if(x==0x01)y=@0627;else y=@01a9;
  $  127.车身颜色类型配置                       $    $               $    $  ANS025.BYTE004  $  if(x==0x00)y=@06e2;else if(x==0x01)y=@06e3;else if(x==0x02)y=@06e4;else if(x==0x03)y=@06e5;else if(x==0x04)y=@06e6;else if(x==0x05)y=@06e7;else if(x==0x06)y=@06e8;else if(x==0x07)y=@06e9;else if(x==0x08)y=@06ea;else if(x==0x09)y=@06eb;else if(x==0x0A)y=@06ec;else if(x==0x0B)y=@06ed;else if(x==0x0C)y=@06ee;else if(x==0x0D)y=@06ef;else if(x==0x0E)y=@06f0;else y=@01a9;
  $  128.胎压监测系统类型配置                   $    $               $    $  ANS025.BYTE007  $  if(x==0x00)y=@06f1;else if(x==0x01)y=@06f2;else if(x==0x02)y=@06f3;else y=@01a9;
  $  129.360度视野类型配置                      $    $               $    $  ANS026.BYTE006  $  if(x==0x00)y=@0721;else if(x==0x01)y=@0722;else if(x==0x02)y=@0692;else y=@01a9;
  $  130.车载显示器类型配置                     $    $               $    $  ANS026.BYTE007  $  if(x==0x10)y=@0723;else if(x==0x11)y=@0724;else if(x==0x02)y=@0725;else if(x==0x03)y=@0726;else if(x==0x15)y=@0727;else if(x==0x14)y=@0728;else y=@01a9;
  $  131.驾驶员窗操作类型                       $    $               $    $  ANS027.BYTE004  $  if(x==0x01)y=@0729;else if(x==0x02)y=@072a;else if(x==0x04)y=@072b;else if(x==0x08)y=@072c;else if(x==0x10)y=@072d;else if(x==0x20)y=@072e;else if(x==0x40)y=@072f;else if(x==0x80)y=@0730;else y=@01a9;
  $  132.远程信息处理系统类型配置               $    $               $    $  ANS027.BYTE005  $  if(x==0x00)y=@0731;else if(x==0x01)y=@0732;else if(x==0x02)y=@0733;else if(x==0x03)y=@0734;else if(x==0x04)y=@0735;else if(x==0x05)y=@0736;else if(x==0x06)y=@0737;else if(x==0x07)y=@0738;else y=@01a9;
  $  133.汽车导航配置                           $    $               $    $  ANS027.BYTE006  $  if(x==0x00)y=@05aa;else if(x==0x01)y=@0739;else y=@01a9;
  $  134.免提配置                               $    $               $    $  ANS027.BYTE007  $  if(x==0x00)y=@073a;else if(x==0x01)y=@073b;else y=@01a9;
  $  135.车载信息娱乐显示级别类型配置           $    $               $    $  ANS028.BYTE004  $  if(x==0x00)y=@073c;else if(x==0x03)y=@073d;else if(x==0x04)y=@073e;else if(x==0x05)y=@073f;else y=@01a9;
  $  136.DAB数字音频广播配置                    $    $               $    $  ANS028.BYTE005  $  if(x==0x00)y=@0740;else if(x==0x01)y=@0692;else y=@01a9;
  $  137.停车辅助系统类型配置                   $    $               $    $  ANS028.BYTE006  $  if(x==0x00)y=@0702;else if(x==0x01)y=@0703;else if(x==0x02)y=@0704;else if(x==0x03)y=@0705;else if(x==0x04)y=@0706;else if(x==0x05)y=@0707;else y=@01a9;
  $  138.右后下摄像头类型配置                   $    $               $    $  ANS028.BYTE007  $  if(x==0x00)y=@0708;else if(x==0x01)y=@0709;else if(x==0x02)y=@070a;else if(x==0x03)y=@070b;else if(x==0x04)y=@070c;else if(x==0x05)y=@070d;else if(x==0x06)y=@070e;else if(x==0x07)y=@070f;else if(x==0x08)y=@0710;else y=@01a9;
  $  139.方向盘带音量调节配置                   $    $               $    $  ANS029.BYTE004  $  if(x==0x00)y=@0711;else if(x==0x01)y=@0712;else if(x==0x02)y=@0713;else y=@01a9;
  $  140.汽车音频类型配置                       $    $               $    $  ANS029.BYTE005  $  if(x==0x00)y=@0714;else if(x==0x01)y=@0715;else if(x==0x02)y=@0716;else if(x==0x03)y=@0717;else y=@01a9;
  $  141.AUX端口配置                            $    $               $    $  ANS029.BYTE006  $  if(x==0x00)y=@0718;else if(x==0x01)y=@0719;else y=@01a9;
  $  142.视频输入功能配置                       $    $               $    $  ANS029.BYTE007  $  if(x==0x00)y=@071a;else if(x==0x01)y=@071b;else y=@01a9;
  $  143.USB端口类型配置                        $    $               $    $  ANS030.BYTE004  $  if(x==0x00)y=@071c;else if(x==0x01)y=@071d;else if(x==0x02)y=@071e;else y=@01a9;
  $  144.收音机频率配置(FM)                     $    $               $    $  ANS030.BYTE005  $  if(x==0x10)y=@071f;else if(x==0x20)y=@0720;else y=@01a9;
  $  145.收音机频率配置(AM)                     $    $               $    $  ANS030.BYTE005  $  if(x==0x01)y=@0696;else if(x==0x02)y=@0697;else y=@01a9;
  $  146.无线电频率范围(FM)                     $    $               $    $  ANS030.BYTE006  $  if(x==0x10)y=@0698;else y=@01a9;
  $  147.无线电频率范围(AM)                     $    $               $    $  ANS030.BYTE006  $  if(x==0x01)y=@0699;else if(x==0x02)y=@069a;else if(x==0x04)y=@069b;else if(x==0x08)y=@069c;else y=@01a9;
  $  148.扬声器类型配置                         $    $               $    $  ANS030.BYTE007  $  if(x==0x00)y=@069d;else if(x==0x01)y=@069e;else if(x==0x02)y=@069f;else if(x==0x03)y=@06a0;else if(x==0x04)y=@06a1;else y=@01a9;
  $  149.IPOD配置                               $    $               $    $  ANS031.BYTE004  $  if(x==0x00)y=@06a2;else if(x==0x01)y=@0692;else y=@01a9;
  $  150.汽车车型年份配置                       $    $               $    $  ANS031.BYTE005  $  if(x==0x00)y=@06a3;else if(x==0x01)y=@06a4;else if(x==0x02)y=@06a5;else if(x==0x03)y=@06a6;else if(x==0x04)y=@06a7;else if(x==0x05)y=@06a8;else if(x==0x06)y=@06a9;else if(x==0x07)y=@06aa;else if(x==0x08)y=@06ab;else y=@01a9;
  $  151.车型系列配置                           $    $               $    $  ANS031.BYTE006  $  if(x==0x07)y=@0162;else y=@01a9;
  $  152.车身类型配置                           $    $               $    $  ANS031.BYTE007  $  if(x==0x00)y=@06ac;else if(x==0x01)y=@06ad;else if(x==0x02)y=@06ae;else if(x==0x03)y=@06af;else if(x==0x04)y=@06b0;else if(x==0x05)y=@06b1;else if(x==0x06)y=@06b2;else if(x==0x07)y=@06b3;else if(x==0x08)y=@00f3;else if(x==0x09)y=@06b4;else if(x==0x0A)y=@06b5;else y=@01a9;
  $  153.汽车品牌配置                           $    $               $    $  ANS032.BYTE004  $  if(x==0x00)y=@066a;else if(x==0x01)y=@066b;else if(x==0x02)y=@066c;else y=@01a9;
  $  154.汽车国家码配置                         $    $               $    $  ANS032.BYTE005  $  if(x==0x00)y=@00d8;else if(x==0x01)y=@066d;else if(x==0x02)y=@066e;else if(x==0x03)y=@066f;else if(x==0x04)y=@0670;else if(x==0x05)y=@0671;else if(x==0x06)y=@0672;else if(x==0x07)y=@0673;else if(x==0x08)y=@0674;else if(x==0x09)y=@0675;else if(x==0x0A)y=@0676;else if(x==0x0B)y=@0677;else if(x==0x0C)y=@0678;else if(x==0x0D)y=@0679;else if(x==0x0E)y=@067a;else if(x==0x0F)y=@067b;else if(x==0x10)y=@067c;else y=@01a9;
  $  155.汽车驾驶方向类型配置                   $    $               $    $  ANS032.BYTE006  $  if(x==0x00)y=@067d;else if(x==0x01)y=@067e;else y=@01a9;
  $  156.汽车发动机类型配置                     $    $               $    $  ANS032.BYTE007  $  if(x==0x00)y=@067f;else if(x==0x01)y=@0680;else if(x==0x02)y=@0681;else if(x==0x03)y=@0682;else if(x==0x04)y=@0683;else if(x==0x05)y=@0684;else if(x==0x06)y=@0685;else if(x==0x07)y=@0686;else y=@01a9;
  $  157.变速箱类型配置                         $    $               $    $  ANS033.BYTE004  $  if(x==0x00)y=@0687;else if(x==0x01)y=@0688;else if(x==0x02)y=@0689;else if(x==0x03)y=@068a;else if(x==0x04)y=@068b;else if(x==0x05)y=@068c;else if(x==0x06)y=@068d;else if(x==0x07)y=@068e;else if(x==0x08)y=@068f;else y=@01a9;
  $  158.汽车尾门操作类型配置                   $    $               $    $  ANS033.BYTE005  $  if(x==0x00)y=@0166;else if(x==0x01)y=@0167;else if(x==0x02)y=@0690;else if(x==0x03)y=@0691;else y=@01a9;
  $  159.自动紧急呼叫配置                       $    $               $    $  ANS034.BYTE005  $  if(x==0x00)y=@043b;else if(x==0x01)y=@0692;else y=@01a9;
  $  160.汽车天窗类型配置                       $    $               $    $  ANS034.BYTE006  $  if(x==0x00)y=@0693;else if(x==0x01)y=@0694;else if(x==0x02)y=@0695;else y=@01a9;
  $  161.混合动力类型配置                       $    $               $    $  ANS034.BYTE007  $  if(x==0x00)y=@06cc;else if(x==0x01)y=@06cd;else if(x==0x02)y=@06ce;else if(x==0x03)y=@06cf;else y=@01a9;
  $  162.ECO主动经济驾驶模式配置                $    $               $    $  ANS035.BYTE004  $  if(x==0x00)y=@00b2;else if(x==0x01)y=@00b1;else y=@01a9;
  $  163.MIC麦克风类型配置                      $    $               $    $  ANS035.BYTE006  $  if(x==0x00)y=@06d0;else if(x==0x01)y=@06d1;else if(x==0x02)y=@06d2;else y=@01a9;
  $  164.光传感器配置                           $    $               $    $  ANS035.BYTE007  $  if(x==0x00)y=@06d3;else if(x==0x01)y=@06d4;else y=@01a9;
  $  165.车型配置                               $    $               $    $  ANS036.BYTE005  $  if(x==0x7F)y=@06d5;else if(x==0x80)y=@058e;else if(x==0x81)y=@0162;else y=@01a9;
  $  166.变量配置                               $    $               $    $  ANS036.BYTE006  $  if(x==0x98)y=@06d6;else if(x==0x99)y=@06d7;else y=@01a9;
  $  167.GPS芯片配置                            $    $               $    $  ANS036.BYTE007  $  if(x==0x00)y=@06d8;else if(x==0x01)y=@06d9;else y=@01a9;
  $  168.语音识别配置                           $    $               $    $  ANS037.BYTE004  $  if(x==0x00)y=@05b0;else if(x==0x01)y=@06da;else y=@01a9;
  $  169.ESP/ABS节点配置                        $    $               $    $  ANS037.BYTE005  $  if(x==0x00)y=@06b6;else if(x==0x01)y=@06b7;else if(x==0x02)y=@06b8;else y=@01a9;
  $  170.SAS配置                                $    $               $    $  ANS037.BYTE006  $  if(x==0x00)y=@06b9;else if(x==0x01)y=@06ba;else y=@01a9;
  $  171.PEPS配置                               $    $               $    $  ANS037.BYTE007  $  if(x==0x00)y=@06bb;else if(x==0x01)y=@003d;else y=@01a9;
  $  172.WIFI配置                               $    $               $    $  ANS038.BYTE004  $  if(x==0x00)y=@06bc;else if(x==0x01)y=@06bd;else y=@01a9;
  $  173.轴距配置                               $    $               $    $  ANS038.BYTE005  $  if(x==0x00)y=@06be;else if(x==0x01)y=@06bf;else y=@01a9;
  $  174.底盘高度配置                           $    $               $    $  ANS038.BYTE006  $  if(x==0x00)y=@06c0;else if(x==0x01)y=@06c1;else y=@01a9;
  $  175.门类型配置                             $    $               $    $  ANS039.BYTE004  $  if(x==0x00)y=@06c2;else if(x==0x01)y=@06c3;else if(x==0x02)y=@06c4;else if(x==0x03)y=@06c5;else if(x==0x04)y=@06c6;else y=@01a9;
  $  176.音速补偿级别控制                       $    $               $    $  ANS040.BYTE004  $  if(x==0x00)y=@06c7;else if(x==0x01)y=@06c8;else if(x==0x02)y=@06c9;else if(x==0x03)y=@06ca;else if(x==0x04)y=@06cb;else y=@01a9;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
