
    车型ID：103a

    模拟：协议模拟-->103a

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:700 02 10 01 00 00 00 00 00       $~  ANS000:780 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:700 02 3E 80 00 00 00 00 00       $!  ANS000:780 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:700 03 19 02 09 00 00 00 00       $#  ANS000:780 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/3a000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:700 04 14 FF FF FF 00 00 00       $$  ANS000:780 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:700 03 22 F1 A0 00 00 00 00       $%  ANS000:780 03 22 F1 A0 00 00 00 00
  $%  REQ001:700 03 22 F1 83 00 00 00 00       $%  ANS001:780 03 22 F1 83 00 00 00 00
  $%  REQ002:700 03 22 F1 A1 00 00 00 00       $%  ANS002:780 03 22 F1 A1 00 00 00 00
  $%  REQ003:700 03 22 F1 91 00 00 00 00       $%  ANS003:780 03 22 F1 91 00 00 00 00
  $%  REQ004:700 03 22 F1 87 00 00 00 00       $%  ANS004:780 03 22 F1 87 00 00 00 00
  $%  REQ005:700 03 22 F1 10 00 00 00 00       $%  ANS005:780 03 22 F1 10 00 00 00 00
  $%  REQ006:700 03 22 F1 92 00 00 00 00       $%  ANS006:780 03 22 F1 92 00 00 00 00
  $%  REQ007:700 03 22 F1 8C 00 00 00 00       $%  ANS007:780 03 22 F1 8C 00 00 00 00
  $%  REQ008:700 03 22 F1 94 00 00 00 00       $%  ANS008:780 03 22 F1 94 00 00 00 00
  $%  REQ009:700 03 22 F1 8A 00 00 00 00       $%  ANS009:780 03 22 F1 8A 00 00 00 00
  $%  REQ010:700 03 22 F1 90 00 00 00 00       $%  ANS010:780 03 22 F1 90 00 00 00 00
  $%  REQ011:700 03 22 F1 A8 00 00 00 00       $%  ANS011:780 03 22 F1 A8 00 00 00 00
  $%  REQ012:700 03 22 F1 8B 00 00 00 00       $%  ANS012:780 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:                $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:            $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:                $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                    $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                    $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:EcU内部软件数:                     $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X],X1,X2,X3);
  $%  006:电控单元零件号(上次):              $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):              $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                  $%    $%  ANS005.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:              $%    $%  ANS007.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  011:供应商电控单元产线号:              $%    $%  ANS007.BYTE009  $%  ASCII(X1,X2);
  $%  012:年 月 日:                          $%    $%  ANS007.BYTE011  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);
  $%  013:供应商应用软件参考号(版本):        $%    $%  ANS008.BYTE004  $%  HEX(X1,X2);
  $%  014:供应商应用软件参考号(日期):        $%    $%  ANS008.BYTE006  $%  HEX(X1,X2,X3,X4);
  $%  015:系统供应商识别码:                  $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  016:VIN码:                             $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  017:车辆特征信息:                      $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  018:电控单元制造日期:                  $%    $%  ANS012.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:700 03 22 E0 29 00 00 00 00       $  ANS000:780 03 22 E0 29 00 00 00 00
  $  REQ001:700 03 22 E0 25 00 00 00 00       $  ANS001:780 03 22 E0 25 00 00 00 00
  $  REQ002:700 03 22 E0 17 00 00 00 00       $  ANS002:780 03 22 E0 17 00 00 00 00
  $  REQ003:700 03 22 E0 1C 00 00 00 00       $  ANS003:780 03 22 E0 1C 00 00 00 00
  $  REQ004:700 03 22 E0 1D 00 00 00 00       $  ANS004:780 03 22 E0 1D 00 00 00 00
  $  REQ005:700 03 22 E0 20 00 00 00 00       $  ANS005:780 03 22 E0 20 00 00 00 00
  $  REQ006:700 03 22 E0 30 00 00 00 00       $  ANS006:780 03 22 E0 30 00 00 00 00
  $  REQ007:700 03 22 E0 31 00 00 00 00       $  ANS007:780 03 22 E0 31 00 00 00 00
  $  REQ008:700 03 22 E0 1F 00 00 00 00       $  ANS008:780 03 22 E0 1F 00 00 00 00
  $  REQ009:700 03 22 E0 21 00 00 00 00       $  ANS009:780 03 22 E0 21 00 00 00 00
  $  REQ010:700 03 22 E0 28 00 00 00 00       $  ANS010:780 03 22 E0 28 00 00 00 00
  $  REQ011:700 03 22 E0 22 00 00 00 00       $  ANS011:780 03 22 E0 22 00 00 00 00
  $  REQ012:700 03 22 E0 1E 00 00 00 00       $  ANS012:780 03 22 E0 1E 00 00 00 00
  $  REQ013:700 03 22 C0 10 00 00 00 00       $  ANS013:780 03 22 C0 10 00 00 00 00
  $  REQ014:700 03 22 E0 27 00 00 00 00       $  ANS014:780 03 22 E0 27 00 00 00 00
  $  REQ015:700 03 22 E0 16 00 00 00 00       $  ANS015:780 03 22 E0 16 00 00 00 00
  $  REQ016:700 03 22 E0 15 00 00 00 00       $  ANS016:780 03 22 E0 15 00 00 00 00
  $  REQ017:700 03 22 C0 11 00 00 00 00       $  ANS017:780 03 22 C0 11 00 00 00 00
  $  REQ018:700 03 22 C0 12 00 00 00 00       $  ANS018:780 03 22 C0 12 00 00 00 00
  $  REQ019:700 03 22 E0 26 00 00 00 00       $  ANS019:780 03 22 E0 26 00 00 00 00
  $  REQ020:700 03 22 E0 23 00 00 00 00       $  ANS020:780 03 22 E0 23 00 00 00 00
  $  REQ021:700 03 22 E0 10 00 00 00 00       $  ANS021:780 03 22 E0 10 00 00 00 00
  $  REQ022:700 03 22 E0 24 00 00 00 00       $  ANS022:780 03 22 E0 24 00 00 00 00
  $  REQ023:700 03 22 D0 10 00 00 00 00       $  ANS023:780 03 22 D0 10 00 00 00 00
  $  REQ024:700 03 22 D0 11 00 00 00 00       $  ANS024:780 03 22 D0 11 00 00 00 00
  $  REQ025:700 03 22 D0 12 00 00 00 00       $  ANS025:780 03 22 D0 12 00 00 00 00
  $  REQ026:700 03 22 D0 13 00 00 00 00       $  ANS026:780 03 22 D0 13 00 00 00 00
  $  REQ027:700 03 22 D0 14 00 00 00 00       $  ANS027:780 03 22 D0 14 00 00 00 00
  $  REQ028:700 03 22 D0 15 00 00 00 00       $  ANS028:780 03 22 D0 15 00 00 00 00
  $  REQ029:700 03 22 D0 16 00 00 00 00       $  ANS029:780 03 22 D0 16 00 00 00 00
  $  REQ030:700 03 22 D0 17 00 00 00 00       $  ANS030:780 03 22 D0 17 00 00 00 00
  $  REQ031:700 03 22 D0 18 00 00 00 00       $  ANS031:780 03 22 D0 18 00 00 00 00
  $  REQ032:700 03 22 D0 19 00 00 00 00       $  ANS032:780 03 22 D0 19 00 00 00 00
  $  REQ033:700 03 22 D0 20 00 00 00 00       $  ANS033:780 03 22 D0 20 00 00 00 00
  $  REQ034:700 03 22 D0 21 00 00 00 00       $  ANS034:780 03 22 D0 21 00 00 00 00

  $  000.自动泊车请求信息显示                                 $    $               $    $  ANS000.BYTE004  $  y=x1*256+x2;
  $  001.背光设置值                                           $    $               $    $  ANS001.BYTE004  $  y=x*100/255;
  $  002.制动液液位                                           $    $               $    $  ANS002.BYTE004  $  if(x==0x00)y=@05e3;else if(x==0x01)y=@05e4;else y=@05e5;
  $  003.报警音的周期                                         $    $               $    $  ANS003.BYTE004  $  y=x*10;
  $  004.报警音占空比                                         $    $               $    $  ANS004.BYTE004  $  y=x*100/255.0;
  $  005.巡航目标速度                                         $    $  km/h         $    $  ANS005.BYTE004  $  y=x;
  $  006.线控主动转向ACC设置速度                              $    $  km/h         $    $  ANS006.BYTE004  $  y=x;
  $  007.线控主动转向限速信息                                 $    $               $    $  ANS007.BYTE004  $  y=x;
  $  008.发动机冷却液温度                                     $    $  degree C     $    $  ANS008.BYTE004  $  y=x-40;
  $  009.发动机转速                                           $    $  rpm          $    $  ANS009.BYTE004  $  y=(x1*256+x2)*64/256;
  $  010.FICM(娱乐系统大屏导航)超速限值                       $    $  km/h         $    $  ANS010.BYTE004  $  y=x;
  $  011.燃料消耗量(微升)                                     $    $  uL           $    $  ANS011.BYTE004  $  y=x1*256+x2;
  $  012.燃油液位                                             $    $               $    $  ANS012.BYTE004  $  y=x*100/255.0;
  $  013.运动_节能                                            $    $               $    $  ANS013.BYTE004  $  if((x&0x80)==0x80)y=@00ba;else y=@00b9;
  $  014.安全带提示                                           $    $               $    $  ANS013.BYTE004  $  if((x&0x60)==0x00)y=@00b9;else if((x&0x60)==0x20)y=@05d7;else if((x&0x60)==0x40)y=@05d8;else y=@05d9;
  $  015.驱动类型                                             $    $               $    $  ANS013.BYTE004  $  if((x&0x18)==0x00)y=@05da;else if((x&0x18)==0x08)y=@05db;else if((x&0x18)==0x10)y=@05dc;else y=@05dd;
  $  016.变速器类型                                           $    $               $    $  ANS013.BYTE004  $  if((x&0x06)==0x00)y=@003b;else if((x&0x06)==0x02)y=@003a;else if((x&0x06)==0x04)y=@05de;else y=@05df;
  $  017.发动机类型                                           $    $               $    $  ANS013.BYTE004  $  if((x&0x01)==0x01)y=@05e0;else y=@05e1;
  $  018.前雾灯                                               $    $               $    $  ANS013.BYTE005  $  if((x&0x80)==0x80)y=@05e2;else y=@01f4;
  $  019.自动灯光                                             $    $               $    $  ANS013.BYTE005  $  if((x&0x40)==0x40)y=@05e2;else y=@01f4;
  $  020.安全气囊系统                                         $    $               $    $  ANS013.BYTE005  $  if((x&0x20)==0x20)y=@05e2;else y=@01f4;
  $  021.胎压监控系统                                         $    $               $    $  ANS013.BYTE005  $  if((x&0x10)==0x10)y=@05e2;else y=@01f4;
  $  022.尾门类型                                             $    $               $    $  ANS013.BYTE005  $  if((x&0x0C)==0x00)y=@0166;else if((x&0x0C)==0x04)y=@0167;else if((x&0x0C)==0x08)y=@05de;else y=@05df;
  $  023.驻车类型                                             $    $               $    $  ANS013.BYTE005  $  if((x&0x03)==0x00)y=@05ee;else if((x&0x03)==0x01)y=@01b6;else if((x&0x03)==0x02)y=@05de;else y=@05df;
  $  024.直流转直流模块                                       $    $               $    $  ANS013.BYTE006  $  if((x&0x80)==0x80)y=@05e2;else y=@01f4;
  $  025.电池电压                                             $    $               $    $  ANS013.BYTE006  $  if((x&0x40)==0x40)y=@00ba;else y=@00b9;
  $  026.TBOX(远程监控模块)                                   $    $               $    $  ANS013.BYTE006  $  if((x&0x20)==0x20)y=@05e2;else y=@01f4;
  $  027.ESP(电子稳定系统)                                    $    $               $    $  ANS013.BYTE006  $  if((x&0x10)==0x10)y=@05e2;else y=@01f4;
  $  028.启停系统                                             $    $               $    $  ANS013.BYTE006  $  if((x&0x08)==0x08)y=@05e2;else y=@01f4;
  $  029.巡航控制                                             $    $               $    $  ANS013.BYTE006  $  if((x&0x06)==0x00)y=@01f4;else if((x&0x06)==0x02)y=@05ef;else if((x&0x06)==0x04)y=@05f0;else y=@0004;
  $  030.PEPS(无钥匙控制无钥匙启动系统)                       $    $               $    $  ANS013.BYTE006  $  if((x&0x01)==0x01)y=@05e2;else y=@01f4;
  $  031.座位布局                                             $    $               $    $  ANS013.BYTE007  $  if((x&0xF0)==0x00)y=@05f1;else if((x&0xF0)==0x10)y=@05f2;else if((x&0xF0)==0x20)y=@05f3;else if((x&0xF0)==0x30)y=@05f4;else if((x&0xF0)==0x40)y=@05f5;else if((x&0xF0)==0x50)y=@05f6;else if((x&0xF0)==0x60)y=@05f7;else if((x&0xF0)==0x70)y=@05f8;else if((x&0xF0)==0x80)y=@05f9;else y=@01a9;
  $  032.超速报警                                             $    $               $    $  ANS013.BYTE007  $  if((x&0x0C)==0x00)y=@00b9;else if((x&0x0C)==0x04)y=@05fa;else if((x&0x0C)==0x08)y=@05fb;else y=@0004;
  $  033.AFS(自适应前大灯调节系统)                            $    $               $    $  ANS013.BYTE007  $  if((x&0x02)==0x02)y=@05e2;else y=@01f4;
  $  034.自动制动系统                                         $    $               $    $  ANS013.BYTE007  $  if((x&0x01)==0x01)y=@05e2;else y=@01f4;
  $  035.车道保持辅助系统                                     $    $               $    $  ANS013.BYTE008  $  if((x&0x80)==0x80)y=@05e2;else y=@01f4;
  $  036.EPS(电动助力转向)                                    $    $               $    $  ANS013.BYTE008  $  if((x&0x40)==0x40)y=@05e2;else y=@01f4;
  $  037.盲点监测系统                                         $    $               $    $  ANS013.BYTE008  $  if((x&0x20)==0x20)y=@05e2;else y=@01f4;
  $  038.自动泊车辅助系统                                     $    $               $    $  ANS013.BYTE008  $  if((x&0x10)==0x10)y=@05e2;else y=@01f4;
  $  039.前方碰撞预防辅助制动系统                             $    $               $    $  ANS013.BYTE008  $  if((x&0x08)==0x08)y=@05e2;else y=@01f4;
  $  040.车道偏离预警                                         $    $               $    $  ANS013.BYTE008  $  if((x&0x04)==0x04)y=@05e2;else y=@01f4;
  $  041.电动记忆座椅模块                                     $    $               $    $  ANS013.BYTE008  $  if((x&0x02)==0x02)y=@05e2;else y=@01f4;
  $  042.疲劳驾驶                                             $    $               $    $  ANS013.BYTE008  $  if((x&0x01)==0x01)y=@05e2;else y=@01f4;
  $  043.音量                                                 $    $               $    $  ANS013.BYTE009  $  if((x&0xC0)==0x00)y=@05e6;else if((x&0xC0)==0x40)y=@05e7;else if((x&0xC0)==0x80)y=@05e8;else y=@0004;
  $  044.导航                                                 $    $               $    $  ANS013.BYTE009  $  if((x&0x20)==0x20)y=@05e2;else y=@01f4;
  $  045.收音机                                               $    $               $    $  ANS013.BYTE009  $  if((x&0x18)==0x00)y=@01f4;else if((x&0x18)==0x08)y=@05e9;else if((x&0x18)==0x10)y=@05de;else y=@05df;
  $  046.多媒体                                               $    $               $    $  ANS013.BYTE009  $  if((x&0x04)==0x04)y=@05e2;else y=@01f4;
  $  047.通讯                                                 $    $               $    $  ANS013.BYTE009  $  if((x&0x02)==0x02)y=@05e2;else y=@01f4;
  $  048.限速信息                                             $    $               $    $  ANS013.BYTE009  $  if((x&0x01)==0x01)y=@05e2;else y=@01f4;
  $  049.差速锁                                               $    $               $    $  ANS013.BYTE010  $  if((x&0x20)==0x20)y=@05e2;else y=@01f4;
  $  050.天窗                                                 $    $               $    $  ANS013.BYTE010  $  if((x&0x18)==0x00)y=@01f4;else if((x&0x18)==0x08)y=@05ea;else if((x&0x18)==0x10)y=@05eb;else y=@05df;
  $  051.驾驶位置                                             $    $               $    $  ANS013.BYTE010  $  if((x&0x04)==0x04)y=@050f;else y=@0510;
  $  052.自动雨量监控                                         $    $               $    $  ANS013.BYTE010  $  if((x&0x02)==0x02)y=@05e2;else y=@01f4;
  $  053.ANCAP(新车安全评测)                                  $    $               $    $  ANS013.BYTE010  $  if((x&0x01)==0x01)y=@05e2;else y=@01f4;
  $  054.时间格式                                             $    $               $    $  ANS013.BYTE011  $  if((x&0x10)==0x10)y=@05ec;else y=@05ed;
  $  055.语言                                                 $    $               $    $  ANS013.BYTE011  $  if((x&0x0F)==0x00)y=@0487;else if((x&0x0F)==0x01)y=@0486;else y=@01a9;
  $  056.超速值                                               $    $  km/h         $    $  ANS013.BYTE012  $  y=x;
  $  057.HVAC(自动空调)环境温度                               $    $  degree C     $    $  ANS014.BYTE004  $  y=x*0.5-40;
  $  058.手制动状态                                           $    $               $    $  ANS015.BYTE004  $  if(x==0x00)y=@05e3;else if(x==0x01)y=@05e4;else y=@05e5;
  $  059.信息按钮                                             $    $               $    $  ANS016.BYTE004  $  if(x==0x00)y=@05b5;else if(x==0x01)y=@05b6;else if(x==0x02)y=@05b7;else if(x==0x03)y=@01ce;else if(x==0x04)y=@01cf;else if(x==0x05)y=@05b8;else y=@01a9;
  $  060.保养间隔                                             $    $  km           $    $  ANS017.BYTE004  $  y=x1*256+x2;
  $  061.保养里程                                             $    $  km           $    $  ANS018.BYTE004  $  y=x1*256*256+x2*256+x3;
  $  062.天窗位置                                             $    $               $    $  ANS019.BYTE004  $  y=x;
  $  063.来自车身控制管理系统的里程数                         $    $  km           $    $  ANS020.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  064.电源电压                                             $    $  V            $    $  ANS021.BYTE004  $  y=x*0.1;
  $  065.通过BCM保养计数复位                                  $    $  km           $    $  ANS022.BYTE004  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  066.降档告警                                             $    $               $    $  ANS023.BYTE004  $  if((x&0x80)==0x80)y=@000f;else y=@0028;
  $  067.降档提示                                             $    $               $    $  ANS023.BYTE004  $  if((x&0x40)==0x40)y=@000f;else y=@0028;
  $  068.升档提示                                             $    $               $    $  ANS023.BYTE004  $  if((x&0x20)==0x20)y=@000f;else y=@0028;
  $  069.手刹                                                 $    $               $    $  ANS023.BYTE004  $  if((x&0x10)==0x10)y=@000f;else y=@05b9;
  $  070.自动驾驶模式显示                                     $    $               $    $  ANS023.BYTE004  $  if((x&0x0F)==0x00)y=@05b4;else if((x&0x0F)==0x01)y=@0267;else if((x&0x0F)==0x02)y=@0295;else if((x&0x0F)==0x03)y=@05ba;else if((x&0x0F)==0x04)y=@05bb;else if((x&0x0F)==0x05)y=@05bc;else if((x&0x0F)==0x06)y=@05bd;else if((x&0x0F)==0x07)y=@0296;else if((x&0x0F)==0x08)y=@00b3;else y=@0004;
  $  071.变速器换挡杆位置                                     $    $               $    $  ANS023.BYTE005  $  if((x&0xF0)==0x00)y=@0514;else if((x&0xF0)==0x10)y=@00b4;else if((x&0xF0)==0x20)y=@0388;else if((x&0xF0)==0x30)y=@0515;else if((x&0xF0)==0x40)y=@0516;else if((x&0xF0)==0x50)y=@0517;else if((x&0xF0)==0x60)y=@0518;else if((x&0xF0)==0x70)y=@0519;else if((x&0xF0)==0x80)y=@051a;else if((x&0xF0)==0x90)y=@051b;else if((x&0xF0)==0xA0)y=@051c;else if((x&0xF0)==0xB0)y=@051d;else y=@05be;
  $  072.驾驶员换挡控制目标齿轮                               $    $               $    $  ANS023.BYTE005  $  if((x&0x0F)==0x00)y=@02b4;else if((x&0x0F)==0x01)y=@02b5;else if((x&0x0F)==0x02)y=@02b6;else if((x&0x0F)==0x03)y=@02b7;else if((x&0x0F)==0x04)y=@02b8;else if((x&0x0F)==0x05)y=@02b9;else y=@0004;
  $  073.仪表盘“向上”按键状态                               $    $               $    $  ANS024.BYTE004  $  if((x&0xC0)==0x00)y=@05a6;else if((x&0xC0)==0x40)y=@05a7;else if((x&0xC0)==0x80)y=@05a8;else y=@0004;
  $  074.仪表盘“确认”按键状态                               $    $               $    $  ANS024.BYTE004  $  if((x&0x30)==0x00)y=@05a6;else if((x&0x30)==0x10)y=@05a7;else if((x&0x30)==0x20)y=@05a8;else y=@0004;
  $  075.仪表盘“Tab”按键状态                                $    $               $    $  ANS024.BYTE004  $  if((x&0x0F)==0x00)y=@05a9;else if((x&0x0F)==0x01)y=@05aa;else if((x&0x0F)==0x02)y=@05ab;else if((x&0x0F)==0x03)y=@05ac;else if((x&0x0F)==0x04)y=@05ad;else if((x&0x0F)==0x05)y=@05ae;else if((x&0x0F)==0x06)y=@05af;else if((x&0x0F)==0x07)y=@05b0;else y=@0004;
  $  076.离合器底部开关                                       $    $               $    $  ANS024.BYTE005  $  if((x&0xC0)==0x00)y=@05b1;else if((x&0xC0)==0x40)y=@05b2;else if((x&0xC0)==0x80)y=@05b3;else y=@0004;
  $  077.仪表盘“右键”状态                                   $    $               $    $  ANS024.BYTE005  $  if((x&0x30)==0x00)y=@05a6;else if((x&0x30)==0x10)y=@05a7;else if((x&0x30)==0x20)y=@05a8;else y=@0004;
  $  078.仪表盘“左键”状态                                   $    $               $    $  ANS024.BYTE005  $  if((x&0x0C)==0x00)y=@05a6;else if((x&0x0C)==0x04)y=@05a7;else if((x&0x0C)==0x08)y=@05a8;else y=@0004;
  $  079.仪表盘“向下”按键状态                               $    $               $    $  ANS024.BYTE005  $  if((x&0x03)==0x00)y=@05a6;else if((x&0x03)==0x01)y=@05a7;else if((x&0x03)==0x02)y=@05a8;else y=@0004;
  $  080.钥匙进入警告                                         $    $               $    $  ANS025.BYTE004  $  if((x&0x80)==0x80)y=@000f;else y=@0028;
  $  081.驱动模式                                             $    $               $    $  ANS025.BYTE004  $  if((x&0x70)==0x00)y=@05b4;else if((x&0x70)==0x10)y=@0295;else if((x&0x70)==0x20)y=@0296;else if((x&0x70)==0x30)y=@00b3;else y=@0004;
  $  082.报警音频类型                                         $    $               $    $  ANS025.BYTE004  $  if((x&0x0F)==0x00)y=@05cc;else if((x&0x0F)==0x01)y=@05cd;else if((x&0x0F)==0x02)y=@05ce;else if((x&0x0F)==0x03)y=@05cf;else if((x&0x0F)==0x04)y=@05d0;else if((x&0x0F)==0x05)y=@05d1;else y=@01a9;
  $  083.位置灯没有关闭警报                                   $    $               $    $  ANS025.BYTE005  $  if((x&0x80)==0x80)y=@000f;else y=@0028;
  $  084.尾门打开状态                                         $    $               $    $  ANS025.BYTE005  $  if((x&0x40)==0x40)y=@000f;else y=@0028;
  $  085.左后侧门开关状态                                     $    $               $    $  ANS025.BYTE005  $  if((x&0x20)==0x20)y=@000f;else y=@0028;
  $  086.右后侧门开关状态                                     $    $               $    $  ANS025.BYTE005  $  if((x&0x10)==0x10)y=@000f;else y=@05b9;
  $  087.前排成员门开关状态                                   $    $               $    $  ANS025.BYTE005  $  if((x&0x08)==0x08)y=@000f;else y=@0028;
  $  088.驾驶员门开关状态                                     $    $               $    $  ANS025.BYTE005  $  if((x&0x04)==0x04)y=@000f;else y=@0028;
  $  089.系统电源模式                                         $    $               $    $  ANS025.BYTE005  $  if((x&0x03)==0x00)y=@000f;else if((x&0x03)==0x01)y=@0010;else if((x&0x03)==0x02)y=@009d;else y=@05d2;
  $  090.DDD(疲劳驾驶检测)驱动器时间警告                      $    $               $    $  ANS026.BYTE004  $  if((x&0x80)==0x80)y=@05d3;else y=@05d4;
  $  091.DDD(疲劳驾驶检测)迟滞警告                            $    $               $    $  ANS026.BYTE004  $  if((x&0x60)==0x00)y=@05c2;else if((x&0x60)==0x20)y=@05d5;else if((x&0x60)==0x40)y=@05d6;else y=@0004;
  $  092.背光照明状态                                         $    $               $    $  ANS026.BYTE004  $  if((x&0x10)==0x10)y=@000f;else y=@05b9;
  $  093.灯光自动控制                                         $    $               $    $  ANS026.BYTE004  $  if((x&0x08)==0x08)y=@000f;else y=@0028;
  $  094.雨量传感器状态                                       $    $               $    $  ANS026.BYTE004  $  if((x&0x04)==0x04)y=@000f;else y=@0028;
  $  095.第二排右侧安全带警告                                 $    $               $    $  ANS026.BYTE005  $  if((x&0xC0)==0x00)y=@05bf;else if((x&0xC0)==0x40)y=@05c0;else if((x&0xC0)==0x80)y=@05c1;else y=@04ec;
  $  096.第二排中间安全带警告                                 $    $               $    $  ANS026.BYTE005  $  if((x&0x30)==0x00)y=@05bf;else if((x&0x30)==0x10)y=@05c0;else if((x&0x30)==0x20)y=@05c1;else y=@04ec;
  $  097.第二排左侧安全带警告                                 $    $               $    $  ANS026.BYTE005  $  if((x&0x0C)==0x00)y=@05bf;else if((x&0x0C)==0x04)y=@05c0;else if((x&0x0C)==0x08)y=@05c1;else y=@04ec;
  $  098.驾驶员安全带警告                                     $    $               $    $  ANS026.BYTE005  $  if((x&0x02)==0x02)y=@0135;else y=@05c2;
  $  099.乘员座椅安全带状态                                   $    $               $    $  ANS026.BYTE005  $  if((x&0x01)==0x01)y=@0135;else y=@05c2;
  $  100.第三排右侧安全带警告                                 $    $               $    $  ANS027.BYTE004  $  if((x&0x30)==0x00)y=@05bf;else if((x&0x30)==0x10)y=@05c0;else if((x&0x30)==0x20)y=@05c1;else y=@04ec;
  $  101.第三排中间安全带警告                                 $    $               $    $  ANS027.BYTE004  $  if((x&0x0C)==0x00)y=@05bf;else if((x&0x0C)==0x04)y=@05c0;else if((x&0x0C)==0x08)y=@05c1;else y=@04ec;
  $  102.第三排左侧安全带警告                                 $    $               $    $  ANS027.BYTE004  $  if((x&0x03)==0x00)y=@05bf;else if((x&0x03)==0x01)y=@05c0;else if((x&0x03)==0x02)y=@05c1;else y=@04ec;
  $  103.系统状态                                             $    $               $    $  ANS027.BYTE005  $  if((x&0xC0)==0x00)y=@05c3;else if((x&0xC0)==0x40)y=@00d3;else if((x&0xC0)==0x80)y=@00d4;else y=@0004;
  $  104.右后压力警告                                         $    $               $    $  ANS027.BYTE005  $  if((x&0x38)==0x00)y=@05c2;else if((x&0x38)==0x08)y=@05c4;else if((x&0x38)==0x10)y=@05c5;else if((x&0x38)==0x18)y=@05c6;else if((x&0x38)==0x20)y=@05c7;else if((x&0x38)==0x28)y=@05c8;;else if((x&0x38)==0x30)y=@05c9;else y=@05ca;
  $  105.右前压力警告                                         $    $               $    $  ANS027.BYTE005  $  if((x&0x07)==0x00)y=@05c2;else if((x&0x07)==0x01)y=@05c4;else if((x&0x07)==0x02)y=@05c5;else if((x&0x07)==0x03)y=@05c6;else if((x&0x07)==0x04)y=@05c7;else if((x&0x07)==0x05)y=@05c8;;else if((x&0x07)==0x06)y=@05c9;else y=@05ca;
  $  106.自动泊车辅助系统状态                                 $    $               $    $  ANS028.BYTE004  $  if((x&0x70)==0x00)y=@00db;else if((x&0x70)==0x10)y=@05cb;else if((x&0x70)==0x20)y=@00f0;else if((x&0x70)==0x30)y=@00bb;else if((x&0x70)==0x40)y=@002e;else y=@01a9;
  $  107.HVAC采暖通风和空调系统环境温度掩码                   $    $               $    $  ANS028.BYTE004  $  if((x&0x08)==0x08)y=@060e;else y=@060f;
  $  108.左后压力警告                                         $    $               $    $  ANS028.BYTE004  $  if((x&0x07)==0x00)y=@05c2;else if((x&0x07)==0x01)y=@05c4;else if((x&0x07)==0x02)y=@05c5;else if((x&0x07)==0x03)y=@05c6;else if((x&0x07)==0x04)y=@05c7;else if((x&0x07)==0x05)y=@05c8;;else if((x&0x07)==0x06)y=@05c9;else y=@05ca;
  $  109.时间显示格式请求激活                                 $    $               $    $  ANS028.BYTE005  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  110.FICM超速限值激活                                     $    $               $    $  ANS028.BYTE005  $  if((x&0x40)==0x40)y=@00bb;else y=@0136;
  $  111.FICM超速开关请求                                     $    $               $    $  ANS028.BYTE005  $  if((x&0x20)==0x20)y=@000f;else y=@0028;
  $  112.时间显示格式请求                                     $    $               $    $  ANS028.BYTE005  $  if((x&0x10)==0x10)y=@05ec;else y=@05ed;
  $  113.自动泊车辅助系统铃声                                 $    $               $    $  ANS028.BYTE005  $  if((x&0x0F)==0x00)y=@0610;else if((x&0x0F)==0x01)y=@0611;else if((x&0x0F)==0x02)y=@0612;else if((x&0x0F)==0x03)y=@0613;else if((x&0x0F)==0x04)y=@0614;else if((x&0x0F)==0x05)y=@0615;else if((x&0x0F)==0x06)y=@0616;else if((x&0x0F)==0x07)y=@0617;else if((x&0x0F)==0x08)y=@0618;else if((x&0x0F)==0x09)y=@0619;else if((x&0x0F)==0x0A)y=@061a;else if((x&0x0F)==0x0B)y=@061b;else y=@01a9;
  $  114.FICM(娱乐系统大屏导航)车辆维护状态                   $    $               $    $  ANS029.BYTE004  $  if((x&0x03)==0x00)y=@061c;else if((x&0x03)==0x01)y=@061d;else if((x&0x03)==0x02)y=@061e;else y=@0004;
  $  115.多媒体交互准备                                       $    $               $    $  ANS029.BYTE005  $  if((x&0x80)==0x80)y=@0007;else y=@061f;
  $  116.FICM(娱乐系统大屏导航)恢复出厂默认值请求             $    $               $    $  ANS029.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  117.FICM(娱乐系统大屏导航)娱乐系统可用状态               $    $               $    $  ANS029.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  118.分钟小时调整                                         $    $               $    $  ANS029.BYTE004  $  y=x&0xFC;
  $  119.时间调整                                             $    $               $    $  ANS029.BYTE005  $  y=x&0x1F;
  $  120.LVDS(低电压查分信号)电话就绪                         $    $               $    $  ANS030.BYTE004  $  if((x&0x80)==0x80)y=@0007;else y=@061f;
  $  121.LVDS(低电压查分信号)导航准备就绪                     $    $               $    $  ANS030.BYTE004  $  if((x&0x40)==0x40)y=@0007;else y=@061f;
  $  122.DAS(智能驾驶辅助系统)电源驱动取消                    $    $               $    $  ANS030.BYTE005  $  if((x&0x80)==0x80)y=@05fc;else y=@02ce;
  $  123.请轻踩油门或按Resume键                               $    $               $    $  ANS030.BYTE005  $  if((x&0x40)==0x40)y=@05fc;else y=@02ce;
  $  124.DSM(座椅记忆模块)蜂鸣器请求                          $    $               $    $  ANS030.BYTE005  $  if((x&0x38)==0x00)y=@00b1;else if((x&0x38)==0x08)y=@05fd;else if((x&0x38)==0x10)y=@05fe;else y=@0004;
  $  125.通话状态                                             $    $               $    $  ANS030.BYTE005  $  if((x&0x06)==0x00)y=@05ff;else if((x&0x06)==0x02)y=@0600;else y=@0004;
  $  126.报警音反馈                                           $    $               $    $  ANS030.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  127.分钟小时调整                                         $    $               $    $  ANS030.BYTE004  $  y=x&0x3F;
  $  128.DCDC循环码                                           $    $               $    $  ANS031.BYTE004  $  if((x&0xF0)==0x00)y=@0437;else if((x&0xF0)==0x10)y=@0601;else if((x&0xF0)==0x20)y=@0602;else if((x&0xF0)==0x30)y=@0603;else y=@01a9;
  $  129.DAS(智能驾驶辅助系统)电源接收指示灯                  $    $               $    $  ANS031.BYTE004  $  if((x&0x08)==0x08)y=@05fc;else y=@02ce;
  $  130.DMS(座椅智能驾驶辅助系统)显示到仪表                  $    $               $    $  ANS031.BYTE004  $  if((x&0x07)==0x00)y=@00b1;else if((x&0x07)==0x01)y=@0604;else if((x&0x07)==0x02)y=@0605;else if((x&0x07)==0x03)y=@0606;else if((x&0x07)==0x04)y=@0607;else y=@01a9;
  $  131.DAS(智能驾驶辅助系统)CIPV实际间隔时间                $    $               $    $  ANS031.BYTE005  $  if((x&0xE0)==0x00)y=@0608;else if((x&0xE0)==0x20)y=@0609;else if((x&0xE0)==0x40)y=@060a;else if((x&0xE0)==0x60)y=@060b;else if((x&0xE0)==0x80)y=@060c;else if((x&0xE0)==0xE0)y=@060d;else y=@0004;
  $  132.DAS(智能驾驶辅助系统)电源设置间隔时间                $    $               $    $  ANS031.BYTE005  $  if((x&0x1C)==0x00)y=@0608;else if((x&0x1C)==0x04)y=@0609;else if((x&0x1C)==0x08)y=@060a;else if((x&0x1C)==0x0E)y=@060b;else if((x&0x1C)==0x1C)y=@060d;else y=@0004;
  $  133.DAS(智能驾驶辅助系统)电源指示灯                      $    $               $    $  ANS031.BYTE005  $  if((x&0x02)==0x02)y=@05fc;else y=@02ce;
  $  134.DAS(智能驾驶辅助系统)CIPV指示灯                      $    $               $    $  ANS031.BYTE005  $  if((x&0x01)==0x01)y=@05fc;else y=@02ce;
  $  135.DAS(智能驾驶辅助系统)LDW(车道偏离预警系统)状态       $    $               $    $  ANS032.BYTE004  $  if((x&0xF0)==0x00)y=@0620;else if((x&0xF0)==0x10)y=@000f;else if((x&0xF0)==0x20)y=@0137;else if((x&0xF0)==0x30)y=@0621;else y=@01a9;
  $  136.DAS(智能驾驶辅助系统)LDW(车道偏离预警系统)警告       $    $               $    $  ANS032.BYTE004  $  if((x&0x0C)==0x00)y=@05c2;else if((x&0x0C)==0x04)y=@0622;else if((x&0x0C)==0x08)y=@0623;else y=@01a9;
  $  137.DAS(智能驾驶辅助系统)传感器故障                      $    $               $    $  ANS032.BYTE004  $  if((x&0x03)==0x00)y=@012a;else if((x&0x03)==0x01)y=@0624;else if((x&0x03)==0x02)y=@0625;else y=@0626;
  $  138.安全带警告灯                                         $    $               $    $  ANS033.BYTE004  $  if((x&0x80)==0x80)y=@000f;else y=@0028;
  $  139.AFS(自适应前大灯调节系统)故障指示灯                  $    $               $    $  ANS033.BYTE004  $  if((x&0x40)==0x40)y=@000f;else y=@0028;
  $  140.停车灯                                               $    $               $    $  ANS033.BYTE004  $  if((x&0x20)==0x20)y=@000f;else y=@0028;
  $  141.后雾灯                                               $    $               $    $  ANS033.BYTE004  $  if((x&0x10)==0x10)y=@000f;else y=@0028;
  $  142.前雾灯                                               $    $               $    $  ANS033.BYTE004  $  if((x&0x08)==0x08)y=@000f;else y=@0028;
  $  143.远光灯                                               $    $               $    $  ANS033.BYTE004  $  if((x&0x04)==0x04)y=@000f;else y=@0028;
  $  144.右转向灯                                             $    $               $    $  ANS033.BYTE004  $  if((x&0x02)==0x02)y=@000f;else y=@0028;
  $  145.左转向灯                                             $    $               $    $  ANS033.BYTE004  $  if((x&0x01)==0x01)y=@000f;else y=@0028;
  $  146.充电灯                                               $    $               $    $  ANS033.BYTE005  $  if((x&0x80)==0x80)y=@000f;else y=@0028;
  $  147.低油压灯                                             $    $               $    $  ANS033.BYTE005  $  if((x&0x40)==0x40)y=@000f;else y=@0028;
  $  148.OBD灯                                                $    $               $    $  ANS033.BYTE005  $  if((x&0x20)==0x20)y=@000f;else y=@0028;
  $  149.发动机故障灯                                         $    $               $    $  ANS033.BYTE005  $  if((x&0x10)==0x10)y=@000f;else y=@0028;
  $  150.高温灯                                               $    $               $    $  ANS033.BYTE005  $  if((x&0x08)==0x08)y=@000f;else y=@0028;
  $  151.燃油位低灯                                           $    $               $    $  ANS033.BYTE005  $  if((x&0x04)==0x04)y=@000f;else y=@0028;
  $  152.胎压监控故障灯                                       $    $               $    $  ANS033.BYTE005  $  if((x&0x02)==0x02)y=@000f;else y=@0028;
  $  153.防盗系统                                             $    $               $    $  ANS033.BYTE005  $  if((x&0x01)==0x01)y=@000f;else y=@0028;
  $  154.HDC(陡坡缓降)灯(绿色)                                $    $               $    $  ANS034.BYTE004  $  if((x&0x80)==0x80)y=@000f;else y=@0028;
  $  155.HDC(陡坡缓降)灯(黄色)                                $    $               $    $  ANS034.BYTE004  $  if((x&0x40)==0x40)y=@000f;else y=@0028;
  $  156.ESP(电子稳定系统)灯                                  $    $               $    $  ANS034.BYTE004  $  if((x&0x20)==0x20)y=@000f;else y=@0028;
  $  157.ESP(电子稳定系统)关灯                                $    $               $    $  ANS034.BYTE004  $  if((x&0x10)==0x10)y=@000f;else y=@0028;
  $  158.启停系统(黄色)                                       $    $               $    $  ANS034.BYTE004  $  if((x&0x08)==0x08)y=@000f;else y=@0028;
  $  159.启停系统(绿色)                                       $    $               $    $  ANS034.BYTE004  $  if((x&0x04)==0x04)y=@000f;else y=@0028;
  $  160.启停系统(白色)                                       $    $               $    $  ANS034.BYTE004  $  if((x&0x02)==0x02)y=@000f;else y=@0028;
  $  161.差速锁                                               $    $               $    $  ANS034.BYTE004  $  if((x&0x01)==0x01)y=@000f;else y=@0028;
  $  162.安全气囊故障灯                                       $    $               $    $  ANS034.BYTE005  $  if((x&0x80)==0x80)y=@000f;else y=@0028;
  $  163.EPS(电动助力转向)灯                                  $    $               $    $  ANS034.BYTE005  $  if((x&0x40)==0x40)y=@000f;else y=@0028;
  $  164.EPB(电子手刹)故障灯                                  $    $               $    $  ANS034.BYTE005  $  if((x&0x20)==0x20)y=@000f;else y=@0028;
  $  165.EPB(电子手刹)灯                                      $    $               $    $  ANS034.BYTE005  $  if((x&0x10)==0x10)y=@000f;else y=@0028;
  $  166.手刹车灯                                             $    $               $    $  ANS034.BYTE005  $  if((x&0x08)==0x08)y=@000f;else y=@0028;
  $  167.自动驻车灯(绿色)                                     $    $               $    $  ANS034.BYTE005  $  if((x&0x04)==0x04)y=@000f;else y=@0028;
  $  168.自动驻车灯(黄色)                                     $    $               $    $  ANS034.BYTE005  $  if((x&0x02)==0x02)y=@000f;else y=@0028;
  $  169.PALA灯                                               $    $               $    $  ANS034.BYTE005  $  if((x&0x01)==0x01)y=@000f;else y=@0028;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:700 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
