
    车型ID：103e

    模拟：协议模拟-->103e

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:7A0 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 80 00 00 00 00 00       $!  ANS000:7A0 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:7A0 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/3e000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:7A0 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 A0 00 00 00 00       $%  ANS000:7A0 03 22 F1 A0 00 00 00 00
  $%  REQ001:720 03 22 F1 83 00 00 00 00       $%  ANS001:7A0 03 22 F1 83 00 00 00 00
  $%  REQ002:720 03 22 F1 A1 00 00 00 00       $%  ANS002:7A0 03 22 F1 A1 00 00 00 00
  $%  REQ003:720 03 22 F1 91 00 00 00 00       $%  ANS003:7A0 03 22 F1 91 00 00 00 00
  $%  REQ004:720 03 22 F1 A2 00 00 00 00       $%  ANS004:7A0 03 22 F1 A2 00 00 00 00
  $%  REQ005:720 03 22 F1 87 00 00 00 00       $%  ANS005:7A0 03 22 F1 87 00 00 00 00
  $%  REQ006:720 03 22 F1 10 00 00 00 00       $%  ANS006:7A0 03 22 F1 10 00 00 00 00
  $%  REQ007:720 03 22 F1 92 00 00 00 00       $%  ANS007:7A0 03 22 F1 92 00 00 00 00
  $%  REQ008:720 03 22 F1 8C 00 00 00 00       $%  ANS008:7A0 03 22 F1 8C 00 00 00 00
  $%  REQ009:720 03 22 F1 94 00 00 00 00       $%  ANS009:7A0 03 22 F1 94 00 00 00 00
  $%  REQ010:720 03 22 F1 8A 00 00 00 00       $%  ANS010:7A0 03 22 F1 8A 00 00 00 00
  $%  REQ011:720 03 22 FD 10 00 00 00 00       $%  ANS011:7A0 03 22 FD 10 00 00 00 00
  $%  REQ012:720 03 22 F1 90 00 00 00 00       $%  ANS012:7A0 03 22 F1 90 00 00 00 00
  $%  REQ013:720 03 22 F1 A8 00 00 00 00       $%  ANS013:7A0 03 22 F1 A8 00 00 00 00
  $%  REQ014:720 03 22 F1 8B 00 00 00 00       $%  ANS014:7A0 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数(上次)KM:                $%    $%  ANS006.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商识别码:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:UAES电子标签:                    $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%c%c%c%c%c%02X%02X%02X%02X%2X%2X%c%c%c%c%c%c%2X%2X%2X%2X],X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22);
  $%  014:VIN码:                           $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  015:车辆特征信息:                    $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  016:电控单元制造日期:                $%    $%  ANS014.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:720 03 22 C1 02 00 00 00 00       $  ANS000:7A0 03 22 C1 02 00 00 00 00
  $  REQ001:720 03 22 C1 03 00 00 00 00       $  ANS001:7A0 03 22 C1 03 00 00 00 00
  $  REQ002:720 03 22 D1 11 00 00 00 00       $  ANS002:7A0 03 22 D1 11 00 00 00 00
  $  REQ003:720 03 22 D1 01 00 00 00 00       $  ANS003:7A0 03 22 D1 01 00 00 00 00
  $  REQ004:720 03 22 D1 02 00 00 00 00       $  ANS004:7A0 03 22 D1 02 00 00 00 00
  $  REQ005:720 03 22 E1 01 00 00 00 00       $  ANS005:7A0 03 22 E1 01 00 00 00 00
  $  REQ006:720 03 22 E1 02 00 00 00 00       $  ANS006:7A0 03 22 E1 02 00 00 00 00
  $  REQ007:720 03 22 C1 22 00 00 00 00       $  ANS007:7A0 03 22 C1 22 00 00 00 00
  $  REQ008:720 03 22 C1 23 00 00 00 00       $  ANS008:7A0 03 22 C1 23 00 00 00 00
  $  REQ009:720 03 22 C1 24 00 00 00 00       $  ANS009:7A0 03 22 C1 24 00 00 00 00
  $  REQ010:720 03 22 D1 12 00 00 00 00       $  ANS010:7A0 03 22 D1 12 00 00 00 00
  $  REQ011:720 03 22 E1 11 00 00 00 00       $  ANS011:7A0 03 22 E1 11 00 00 00 00
  $  REQ012:720 03 22 E1 12 00 00 00 00       $  ANS012:7A0 03 22 E1 12 00 00 00 00
  $  REQ013:720 03 22 C1 00 00 00 00 00       $  ANS013:7A0 03 22 C1 00 00 00 00 00
  $  REQ014:720 03 22 C1 01 00 00 00 00       $  ANS014:7A0 03 22 C1 01 00 00 00 00

  $  000.故障码配置 B1611:电动尾门控制器电压低                 $    $        $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@055b;else y=@055c;
  $  001.故障码配置 B1612:电动尾门控制器电压高                 $    $        $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@055b;else y=@055c;
  $  002.故障码配置 U1021:电动尾门控制器总线关闭               $    $        $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@055b;else y=@055c;
  $  003.故障码配置 U1122:与BCM通讯丢失                        $    $        $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@055b;else y=@055c;
  $  004.故障码配置 U1123:与PEPS通讯丢失                       $    $        $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@055b;else y=@055c;
  $  005.故障码配置 U1124:与GW_ABS_ESP通讯丢失                 $    $        $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@055b;else y=@055c;
  $  006.故障码配置 U1125:与GW_TCU通讯丢失(仅适用AT车型)       $    $        $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@055b;else y=@055c;
  $  007.故障码配置 U1126:与HVAC通讯丢失                       $    $        $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@055b;else y=@055c;
  $  008.故障码配置 B1631:撑杆电机对电源短路                   $    $        $    $  ANS000.BYTE005  $  if((x&0x80)==0x80)y=@055b;else y=@055c;
  $  009.故障码配置 B1635:撑杆电机对地短路                     $    $        $    $  ANS000.BYTE005  $  if((x&0x40)==0x40)y=@055b;else y=@055c;
  $  010.故障码配置 B1633:撑杆电机开路                         $    $        $    $  ANS000.BYTE005  $  if((x&0x20)==0x20)y=@055b;else y=@055c;
  $  011.故障码配置 B1641:自吸锁对电源短路                     $    $        $    $  ANS000.BYTE005  $  if((x&0x02)==0x02)y=@055b;else y=@055c;
  $  012.故障码配置 B1647:基本锁解锁失败                       $    $        $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@055b;else y=@055c;
  $  013.故障码配置 B1648:基本锁上锁失败                       $    $        $    $  ANS000.BYTE006  $  if((x&0x80)==0x80)y=@055b;else y=@055c;
  $  014.故障码配置 B1649:自吸锁锁紧失败                       $    $        $    $  ANS000.BYTE006  $  if((x&0x40)==0x40)y=@055b;else y=@055c;
  $  015.故障码配置 B164A:自吸锁释放失败                       $    $        $    $  ANS000.BYTE006  $  if((x&0x20)==0x20)y=@055b;else y=@055c;
  $  016.故障码配置 B164B:锁微开错误组合                       $    $        $    $  ANS000.BYTE006  $  if((x&0x10)==0x10)y=@055b;else y=@055c;
  $  017.故障码配置 B1651:防夹条信号错误(左侧)                 $    $        $    $  ANS000.BYTE006  $  if((x&0x08)==0x08)y=@055b;else y=@055c;
  $  018.故障码配置 B1652:防夹条挤压(左侧)                     $    $        $    $  ANS000.BYTE006  $  if((x&0x04)==0x04)y=@055b;else y=@055c;
  $  019.故障码配置 B1653:防夹条信号错误(右侧)                 $    $        $    $  ANS000.BYTE006  $  if((x&0x02)==0x02)y=@055b;else y=@055c;
  $  020.故障码配置 B1654;防夹条挤压(右侧)                     $    $        $    $  ANS000.BYTE006  $  if((x&0x01)==0x01)y=@055b;else y=@055c;
  $  021.故障码配置 B1661:霍尔信号对电源短路(霍尔1)            $    $        $    $  ANS000.BYTE007  $  if((x&0x80)==0x80)y=@055b;else y=@055c;
  $  022.故障码配置 B1662:霍尔信号对电源短路(霍尔2)            $    $        $    $  ANS000.BYTE007  $  if((x&0x40)==0x40)y=@055b;else y=@055c;
  $  023.故障码配置 B1663:霍尔信号对地短路(霍尔1)              $    $        $    $  ANS000.BYTE007  $  if((x&0x20)==0x20)y=@055b;else y=@055c;
  $  024.故障码配置 B1664:霍尔信号对地短路(霍尔2)              $    $        $    $  ANS000.BYTE007  $  if((x&0x10)==0x10)y=@055b;else y=@055c;
  $  025.故障码配置 B1665:霍尔信号开路(霍尔1)                  $    $        $    $  ANS000.BYTE007  $  if((x&0x08)==0x08)y=@055b;else y=@055c;
  $  026.故障码配置 B1666:霍尔信号开路(霍尔2)                  $    $        $    $  ANS000.BYTE007  $  if((x&0x04)==0x04)y=@055b;else y=@055c;
  $  027.故障码配置 B1655:防夹条开启负载(左侧)                 $    $        $    $  ANS001.BYTE005  $  if((x&0x80)==0x80)y=@055b;else y=@055c;
  $  028.故障码配置 B1656:防夹条开启负载(右侧)                 $    $        $    $  ANS001.BYTE005  $  if((x&0x40)==0x40)y=@055b;else y=@055c;
  $  029.自吸锁端子A继电器驱动输出                             $    $        $    $  ANS002.BYTE004  $  if((x&0x80)==0x80)y=@0569;else y=@00e6;
  $  030.自吸锁端子B继电器驱动输出                             $    $        $    $  ANS002.BYTE004  $  if((x&0x40)==0x40)y=@0569;else y=@00e6;
  $  031.基本锁继电器驱动输出                                  $    $        $    $  ANS002.BYTE004  $  if((x&0x20)==0x20)y=@0569;else y=@00e6;
  $  032.尾门后背板开关                                        $    $        $    $  ANS003.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  033.尾门开度模式选择开关                                  $    $        $    $  ANS003.BYTE004  $  if((x&0x40)==0x40)y=@056a;else y=@01d1;
  $  034.驾驶舱尾门操作开关                                    $    $        $    $  ANS003.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  035.基本锁锁体的门微开开关                                $    $        $    $  ANS004.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  036.基本锁锁体的棘爪开关                                  $    $        $    $  ANS004.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  037.自吸锁的释放开关                                      $    $        $    $  ANS004.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  038.自吸锁的吸合开关                                      $    $        $    $  ANS004.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  039.左侧防夹条分压AD值                                    $    $        $    $  ANS005.BYTE004  $  y=((x1&0x03)*256)+x2;
  $  040.右侧防夹条分压AD值                                    $    $        $    $  ANS005.BYTE006  $  y=((x1&0x03)*256)+x2;
  $  041.左侧霍尔主信号100ms内脉冲数                           $    $        $    $  ANS006.BYTE004  $  y=x;
  $  042.左侧霍尔传感器信号方向                                $    $        $    $  ANS006.BYTE005  $  y=x&0x03;
  $  043.右侧霍尔主信号100ms内脉冲数                           $    $        $    $  ANS006.BYTE006  $  y=x;
  $  044.右侧霍尔传感器信号方向                                $    $        $    $  ANS006.BYTE007  $  y=x&0x03;
  $  045.左侧霍尔副信号高低值                                  $    $        $    $  ANS006.BYTE008  $  y=x&0x01;
  $  046.右侧霍尔副信号高低值                                  $    $        $    $  ANS006.BYTE009  $  y=x&0x01;
  $  047.标定完成标识                                          $    $        $    $  ANS007.BYTE004  $  if((x&0x80)==0x80)y=@00e7;else y=@004a;
  $  048.自学习完成标识                                        $    $        $    $  ANS007.BYTE004  $  if((x&0x40)==0x40)y=@004d;else y=@004c;
  $  049.手动学习零点完成标识                                  $    $        $    $  ANS007.BYTE004  $  if((x&0x20)==0x20)y=@004d;else y=@004c;
  $  050.手动学习最大开度完成标识                              $    $        $    $  ANS007.BYTE004  $  if((x&0x10)==0x10)y=@004d;else y=@004c;
  $  051.车库模式学习标识                                      $    $        $    $  ANS007.BYTE004  $  if((x&0x08)==0x08)y=@004d;else y=@004c;
  $  052.尾门当前状态                                          $    $        $    $  ANS007.BYTE005  $  if(x==0x00)y=@004e;else if(x==0x01)y=@0568;else if(x==0x02)y=@00e8;else if(x==0x03)y=@00e9;else if(x==0x04)y=@00ea;else if(x==0x05)y=@0051;else y=@01a9;
  $  053.锁当前状态                                            $    $        $    $  ANS007.BYTE006  $  if(x==0x00)y=@004e;else if(x==0x01)y=@0052;else if(x==0x02)y=@00ec;else if(x==0x03)y=@00ed;else if(x==0x04)y=@000f;else if(x==0x05)y=@00ee;else if(x==0x06)y=@00ef;else y=@01a9;
  $  054.当前系统滥用及保护状态                                $    $        $    $  ANS007.BYTE007  $  if(x==0x00)y=@0030;else if(x==0x01)y=@056e;else if(x==0x02)y=@056f;else if(x==0x03)y=@0570;else if(x==0x04)y=@0571;else y=@01a9;
  $  055.尾门自学习后的最大开度                                $    $        $    $  ANS008.BYTE004  $  y=x1*256+x2;
  $  056.当前设定的车库模式最大开度                            $    $        $    $  ANS008.BYTE006  $  y=x1*256+x2;
  $  057.当前尾门开度                                          $    $        $    $  ANS009.BYTE004  $  y=x1*256+x2;
  $  058.给电撑杆供电的KL30继电器控制                          $    $        $    $  ANS010.BYTE004  $  if((x&0x80)==0x80)y=@0569;else y=@00e6;
  $  059.Break继电器的控制                                     $    $        $    $  ANS010.BYTE004  $  if((x&0x40)==0x40)y=@0049;else y=@00df;
  $  060.分流CNTRL(控制)                                       $    $        $    $  ANS010.BYTE004  $  if((x&0x20)==0x20)y=@0037;else y=@0036;
  $  061.左侧电撑杆PWM(脉宽调制)占空比                         $    $  %     $    $  ANS011.BYTE004  $  y=x;
  $  062.左侧撑电撑杆端子A继电器驱动输出                       $    $        $    $  ANS011.BYTE005  $  if((x&0x80)==0x80)y=@0572;else y=@00e1;
  $  063.左侧撑电撑杆端子B继电器驱动输出                       $    $        $    $  ANS011.BYTE005  $  if((x&0x40)==0x40)y=@00e1;else y=@0572;
  $  064.右侧电撑杆PWM(脉宽调制)占空比                         $    $  %     $    $  ANS012.BYTE004  $  y=x;
  $  065.右侧撑电撑杆端子A继电器驱动输出                       $    $        $    $  ANS012.BYTE005  $  if((x&0x80)==0x80)y=@0572;else y=@00e1;
  $  066.右侧撑电撑杆端子B继电器驱动输出                       $    $        $    $  ANS012.BYTE005  $  if((x&0x40)==0x40)y=@00e1;else y=@0572;
  $  067.变速器配置                                            $    $        $    $  ANS013.BYTE004  $  if((x&0x20)==0x20)y=@003b;else y=@003a;
  $  068.PEPS配置                                              $    $        $    $  ANS013.BYTE004  $  if((x&0x10)==0x10)y=@0573;else y=@00e4;
  $  069.随动关门使能                                          $    $        $    $  ANS013.BYTE004  $  if((x&0x01)==0x01)y=@00f0;else y=@00f1;
  $  070.无网络环境配置                                        $    $        $    $  ANS014.BYTE004  $  if((x&0x80)==0x80)y=@056b;else y=@0268;
  $  071.调试报文配置                                          $    $        $    $  ANS014.BYTE004  $  if((x&0x40)==0x40)y=@056c;else y=@056d;
  $  072.禁止电撑杆热保护                                      $    $        $    $  ANS014.BYTE004  $  if((x&0x20)==0x20)y=@00f1;else y=@00f0;
  $  073.禁止自吸锁热保护                                      $    $        $    $  ANS014.BYTE004  $  if((x&0x10)==0x10)y=@00f1;else y=@00f0;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
