
    车型ID：1047

    模拟：协议模拟-->1047

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:704 02 10 01 00 00 00 00 00       $~  ANS000:784 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:704 02 3E 80 00 00 00 00 00       $!  ANS000:784 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:704 03 19 02 09 00 00 00 00       $#  ANS000:784 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/47000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:704 04 14 FF FF FF 00 00 00       $$  ANS000:784 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:704 03 22 F1 A0 00 00 00 00       $%  ANS000:784 03 22 F1 A0 00 00 00 00
  $%  REQ001:704 03 22 F1 83 00 00 00 00       $%  ANS001:784 03 22 F1 83 00 00 00 00
  $%  REQ002:704 03 22 F1 A1 00 00 00 00       $%  ANS002:784 03 22 F1 A1 00 00 00 00
  $%  REQ003:704 03 22 F1 91 00 00 00 00       $%  ANS003:784 03 22 F1 91 00 00 00 00
  $%  REQ004:704 03 22 F1 8B 00 00 00 00       $%  ANS004:784 03 22 F1 8B 00 00 00 00
  $%  REQ005:704 03 22 F1 A2 00 00 00 00       $%  ANS005:784 03 22 F1 A2 00 00 00 00
  $%  REQ006:704 03 22 F1 87 00 00 00 00       $%  ANS006:784 03 22 F1 87 00 00 00 00
  $%  REQ007:704 03 22 F1 10 00 00 00 00       $%  ANS007:784 03 22 F1 10 00 00 00 00
  $%  REQ008:704 03 22 F1 92 00 00 00 00       $%  ANS008:784 03 22 F1 92 00 00 00 00
  $%  REQ009:704 03 22 F1 8C 00 00 00 00       $%  ANS009:784 03 22 F1 8C 00 00 00 00
  $%  REQ010:704 03 22 F1 94 00 00 00 00       $%  ANS010:784 03 22 F1 94 00 00 00 00
  $%  REQ011:704 03 22 F1 8A 00 00 00 00       $%  ANS011:784 03 22 F1 8A 00 00 00 00
  $%  REQ012:704 03 22 F1 90 00 00 00 00       $%  ANS012:784 03 22 F1 90 00 00 00 00
  $%  REQ013:704 03 22 F1 A8 00 00 00 00       $%  ANS013:784 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:            $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:项目名称:                      $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%c%c512197],X1,X2,X3);
  $%  002:产品名称:                      $%    $%  ANS001.BYTE007  $%  y=SPRINTF([%c%c4534],X1,X2);
  $%  003:刷写引导软件:                  $%    $%  ANS001.BYTE009  $%  ASCII(X1,X2);
  $%  004:大版本:                        $%    $%  ANS001.BYTE011  $%  ASCII(X1);
  $%  005:小版本:                        $%    $%  ANS001.BYTE012  $%  ASCII(X1,X2);
  $%  006:电控单元标定软件号:            $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元硬件号:                $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元制造日期:              $%    $%  ANS004.BYTE013  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);
  $%  009:电控单元网络文件参考号:        $%    $%  ANS005.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:电控单元零件号:                $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  011:电控单元零件号(上次):          $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  012:测试工具参考号(上次):          $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  013:里程读数(上次)KM:              $%    $%  ANS007.BYTE015  $%  y=(x1*256*256+x2*256+x3);
  $%  014:产品衍生:                      $%    $%  ANS008.BYTE009  $%  y=SPRINTF([%c%c9],X1,X2);
  $%  015:版本号:                        $%    $%  ANS008.BYTE006  $%  ASCII(X1,X2,X3);
  $%  016:供应商电控单元序列号:          $%    $%  ANS009.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  017:供应商电控单元产线号:          $%    $%  ANS009.BYTE009  $%  ASCII(X1,X2);
  $%  018:年:                            $%    $%  ANS009.BYTE011  $%  HEX(X1);
  $%  019:月:                            $%    $%  ANS009.BYTE012  $%  HEX(X1);
  $%  020:日:                            $%    $%  ANS009.BYTE013  $%  HEX(X1);
  $%  021:软件阶段:                      $%    $%  ANS010.BYTE010  $%  ASCII(X1);
  $%  022:软件大版本:                    $%    $%  ANS010.BYTE011  $%  ASCII(X1,X2);
  $%  023:软件小版本:                    $%    $%  ANS010.BYTE013  $%  ASCII(X1);
  $%  024:系统供应商识别码:              $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  025:VIN码:                         $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  026:车辆特征信息:                  $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:704 03 22 D1 01 00 00 00 00       $  ANS000:784 03 22 D1 01 00 00 00 00
  $  REQ001:704 03 22 01 00 00 00 00 00       $  ANS001:784 03 22 01 00 00 00 00 00
  $  REQ002:704 03 22 C0 01 00 00 00 00       $  ANS002:784 03 22 C0 01 00 00 00 00
  $  REQ003:704 03 22 E2 15 00 00 00 00       $  ANS003:784 03 22 E2 15 00 00 00 00
  $  REQ004:704 03 22 E2 16 00 00 00 00       $  ANS004:784 03 22 E2 16 00 00 00 00
  $  REQ005:704 03 22 C2 16 00 00 00 00       $  ANS005:784 03 22 C2 16 00 00 00 00
  $  REQ006:704 03 22 C2 1C 00 00 00 00       $  ANS006:784 03 22 C2 1C 00 00 00 00
  $  REQ007:704 03 22 E2 04 00 00 00 00       $  ANS007:784 03 22 E2 04 00 00 00 00
  $  REQ008:704 03 22 E2 05 00 00 00 00       $  ANS008:784 03 22 E2 05 00 00 00 00
  $  REQ009:704 03 22 E2 06 00 00 00 00       $  ANS009:784 03 22 E2 06 00 00 00 00
  $  REQ010:704 03 22 E3 01 00 00 00 00       $  ANS010:784 03 22 E3 01 00 00 00 00
  $  REQ011:704 03 22 E0 68 00 00 00 00       $  ANS011:784 03 22 E0 68 00 00 00 00
  $  REQ012:704 03 22 E0 66 00 00 00 00       $  ANS012:784 03 22 E0 66 00 00 00 00
  $  REQ013:704 03 22 E0 67 00 00 00 00       $  ANS013:784 03 22 E0 67 00 00 00 00
  $  REQ014:704 03 22 E0 65 00 00 00 00       $  ANS014:784 03 22 E0 65 00 00 00 00
  $  REQ015:704 03 22 C2 0D 00 00 00 00       $  ANS015:784 03 22 C2 0D 00 00 00 00
  $  REQ016:704 03 22 C2 17 00 00 00 00       $  ANS016:784 03 22 C2 17 00 00 00 00
  $  REQ017:704 03 22 E2 01 00 00 00 00       $  ANS017:784 03 22 E2 01 00 00 00 00
  $  REQ018:704 03 22 E0 62 00 00 00 00       $  ANS018:784 03 22 E0 62 00 00 00 00
  $  REQ019:704 03 22 E2 11 00 00 00 00       $  ANS019:784 03 22 E2 11 00 00 00 00
  $  REQ020:704 03 22 E2 12 00 00 00 00       $  ANS020:784 03 22 E2 12 00 00 00 00
  $  REQ021:704 03 22 E2 10 00 00 00 00       $  ANS021:784 03 22 E2 10 00 00 00 00
  $  REQ022:704 03 22 E2 03 00 00 00 00       $  ANS022:784 03 22 E2 03 00 00 00 00
  $  REQ023:704 03 22 E2 02 00 00 00 00       $  ANS023:784 03 22 E2 02 00 00 00 00
  $  REQ024:704 03 22 E0 64 00 00 00 00       $  ANS024:784 03 22 E0 64 00 00 00 00
  $  REQ025:704 03 22 E0 61 00 00 00 00       $  ANS025:784 03 22 E0 61 00 00 00 00
  $  REQ026:704 03 22 E0 63 00 00 00 00       $  ANS026:784 03 22 E0 63 00 00 00 00
  $  REQ027:704 03 22 C2 0A 00 00 00 00       $  ANS027:784 03 22 C2 0A 00 00 00 00
  $  REQ028:704 03 22 E1 10 00 00 00 00       $  ANS028:784 03 22 E1 10 00 00 00 00
  $  REQ029:704 03 22 C1 1C 00 00 00 00       $  ANS029:784 03 22 C1 1C 00 00 00 00
  $  REQ030:704 03 22 C1 1D 00 00 00 00       $  ANS030:784 03 22 C1 1D 00 00 00 00
  $  REQ031:704 03 22 C1 1A 00 00 00 00       $  ANS031:784 03 22 C1 1A 00 00 00 00
  $  REQ032:704 03 22 C1 1B 00 00 00 00       $  ANS032:784 03 22 C1 1B 00 00 00 00
  $  REQ033:704 03 22 C2 0B 00 00 00 00       $  ANS033:784 03 22 C2 0B 00 00 00 00
  $  REQ034:704 03 22 C2 19 00 00 00 00       $  ANS034:784 03 22 C2 19 00 00 00 00

  $  000.躺椅落后按钮状态                            $    $        $    $  ANS000.BYTE004  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  001.躺椅前进按钮状态                            $    $        $    $  ANS000.BYTE004  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  002.翻转机停机按钮状态                          $    $        $    $  ANS000.BYTE004  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  003.翻转机按钮状态                              $    $        $    $  ANS000.BYTE004  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  004.举升机停机按钮状态                          $    $        $    $  ANS000.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  005.升降器按钮状态                              $    $        $    $  ANS000.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  006.滑块向后按钮状态                            $    $        $    $  ANS000.BYTE004  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  007.滑块向前按钮状态                            $    $        $    $  ANS000.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  008.躺椅电机反向控制                            $    $        $    $  ANS000.BYTE005  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  009.躺椅电机控制                                $    $        $    $  ANS000.BYTE005  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  010.翻转机电机控制下来                          $    $        $    $  ANS000.BYTE005  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  011.翻转机电机控制                              $    $        $    $  ANS000.BYTE005  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  012.升降器电机控制下来                          $    $        $    $  ANS000.BYTE005  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  013.升降器电机控制                              $    $        $    $  ANS000.BYTE005  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  014.滑块电机反向控制                            $    $        $    $  ANS000.BYTE005  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  015.滑块电机控制                                $    $        $    $  ANS000.BYTE005  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  016.躺椅电机诊断反馈                            $    $        $    $  ANS000.BYTE006  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  017.翻转机电机诊断反馈                          $    $        $    $  ANS000.BYTE006  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  018.升降器电机诊断反馈                          $    $        $    $  ANS000.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  019.滑块电机诊断反馈                            $    $        $    $  ANS000.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  020.故障码设定                                  $    $        $    $  ANS001.BYTE004  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  021.镜像自动翻转下来功能配置                    $    $        $    $  ANS002.BYTE004  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  022.关键识别功能配置                            $    $        $    $  ANS002.BYTE004  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  023.欢迎功能配置                                $    $        $    $  ANS002.BYTE004  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  024.钥匙存储器1状态                             $    $        $    $  ANS003.BYTE004  $  if(x==0x01)y=@0a18;else if(x==0x02)y=@01a9;else y=@01a9;
  $  025.钥匙存储器1升降位置                         $    $        $    $  ANS003.BYTE005  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  026.钥匙存储器1滑块位置                         $    $        $    $  ANS003.BYTE007  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  027.钥匙存储器1倾翻位置                         $    $        $    $  ANS003.BYTE009  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  028.钥匙存储器1斜倚位置                         $    $        $    $  ANS003.BYTE011  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  029.座位记忆1左镜水平位置                       $    $        $    $  ANS003.BYTE013  $  y=x1*256+x2;
  $  030.座位记忆1左镜垂直位置                       $    $        $    $  ANS003.BYTE015  $  y=x1*256+x2;
  $  031.座位记忆1右镜水平位置                       $    $        $    $  ANS003.BYTE017  $  y=x1*256+x2;
  $  032.座位记忆1右镜垂直位置                       $    $        $    $  ANS003.BYTE019  $  y=x1*256+x2;
  $  033.钥匙存储器2状态                             $    $        $    $  ANS004.BYTE004  $  if(x==0x01)y=@0a18;else if(x==0x02)y=@01a9;else y=@01a9;
  $  034.钥匙存储器2升降位置                         $    $        $    $  ANS004.BYTE005  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  035.钥匙存储器2滑块位置                         $    $        $    $  ANS004.BYTE007  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  036.钥匙存储器2倾翻位置                         $    $        $    $  ANS004.BYTE009  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  037.钥匙存储器2斜倚位置                         $    $        $    $  ANS004.BYTE011  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  038.座位记忆2左镜水平位置                       $    $        $    $  ANS004.BYTE013  $  y=x1*256+x2;
  $  039.座位记忆2左镜垂直位置                       $    $        $    $  ANS004.BYTE015  $  y=x1*256+x2;
  $  040.座位记忆2右镜水平位置                       $    $        $    $  ANS004.BYTE017  $  y=x1*256+x2;
  $  041.座位记忆2右镜垂直位置                       $    $        $    $  ANS004.BYTE019  $  y=x1*256+x2;
  $  042.下移位置左边的后视镜自动翻转                $    $        $    $  ANS005.BYTE004  $  y=x1*256+x2;
  $  043.升降器电机位置误差范围                      $    $        $    $  ANS006.BYTE004  $  y=x1*256+x2;
  $  044.镜像选择关键状态                            $    $        $    $  ANS007.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a6e;else if(x==0x02)y=@0a6f;else if(x==0x03)y=@0a70;else y=@01a9;
  $  045.镜子调整关键状态                            $    $        $    $  ANS007.BYTE004  $  if(x==0x00)y=@0515;else if(x==0x01)y=@0a71;else if(x==0x02)y=@0a72;else if(x==0x04)y=@0a73;else y=@01a9;
  $  046.左镜卧式电机驱动程序状态                    $    $        $    $  ANS008.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a65;else if(x==0x02)y=@0a66;else y=@01a9;
  $  047.左镜立式电机驱动程序状态                    $    $        $    $  ANS008.BYTE005  $  if(x==0x00)y=@0036;else if(x==0x01)y=@05b6;else if(x==0x02)y=@05b7;else y=@01a9;
  $  048.右镜卧式电机驱动程序状态                    $    $        $    $  ANS008.BYTE006  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a65;else if(x==0x02)y=@0a66;else y=@01a9;
  $  049.右镜立式电机驱动程序状态                    $    $        $    $  ANS008.BYTE007  $  if(x==0x00)y=@0036;else if(x==0x01)y=@05b6;else if(x==0x02)y=@05b7;else y=@01a9;
  $  050.左镜水平位置状态                            $    $  V     $    $  ANS009.BYTE004  $  y=(x1*256+x2)*0.1;
  $  051.左镜垂直位置状态                            $    $  V     $    $  ANS009.BYTE005  $  y=(x1*256+x2)*0.1;
  $  052.右镜水平位置状态                            $    $  V     $    $  ANS009.BYTE007  $  y=(x1*256+x2)*0.1;
  $  053.右镜垂直位置状态                            $    $  V     $    $  ANS009.BYTE009  $  y=(x1*256+x2)*0.1;
  $  054.滑块电机电流                                $    $  A     $    $  ANS010.BYTE004  $  y=x*0.1;
  $  055.升降器电机电流                              $    $  A     $    $  ANS010.BYTE005  $  y=x*0.1;
  $  056.翻转机电机电流                              $    $  A     $    $  ANS010.BYTE006  $  y=x*0.1;
  $  057.躺椅电机电流                                $    $  A     $    $  ANS010.BYTE007  $  y=x*0.1;
  $  058.OVRM右垂直移动的距离                        $    $        $    $  ANS011.BYTE004  $  y=x1*256+x2;
  $  059.驱动器右镜调整垂直                          $    $        $    $  ANS011.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a67;else if(x==0x02)y=@0a68;else y=@01a9;
  $  060.OVRM右垂直移动的距离                        $    $        $    $  ANS011.BYTE005  $  y=x1*256+x2;
  $  061.驱动器右镜调整水平                          $    $        $    $  ANS012.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a67;else if(x==0x02)y=@0a68;else y=@01a9;
  $  062.OVRM右水平移动的距离                        $    $        $    $  ANS012.BYTE005  $  y=x1*256+x2;
  $  063.OVRM右水平移动的距离                        $    $        $    $  ANS012.BYTE004  $  y=x1*256+x2;
  $  064.OVRM左垂直移动的距离                        $    $        $    $  ANS013.BYTE004  $  y=x1*256+x2;
  $  065.驱动器左镜调整垂直                          $    $        $    $  ANS013.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a67;else if(x==0x02)y=@0a68;else y=@01a9;
  $  066.OVRM左垂直移动的距离                        $    $        $    $  ANS013.BYTE005  $  y=x1*256+x2;
  $  067.驱动器左镜调整水平                          $    $        $    $  ANS014.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a67;else if(x==0x02)y=@0a68;else y=@01a9;
  $  068.OVRM左水平移动的距离                        $    $        $    $  ANS014.BYTE005  $  y=x1*256+x2;
  $  069.OVRM左水平移动的距离                        $    $        $    $  ANS014.BYTE004  $  y=x1*256+x2;
  $  070.躺椅电机位置误差范围                        $    $        $    $  ANS015.BYTE004  $  y=x1*256+x2;
  $  071.下移位置右边后视镜自动翻转                  $    $        $    $  ANS016.BYTE004  $  y=x1*256+x2;
  $  072.滑块按钮状态                                $    $        $    $  ANS017.BYTE004  $  if(x==0x00)y=@0515;else if(x==0x01)y=@00df;else if(x==0x02)y=@0240;else if(x==0x03)y=@04ec;else y=@01a9;
  $  073.升降器按钮状态                              $    $        $    $  ANS017.BYTE005  $  if(x==0x00)y=@0515;else if(x==0x01)y=@00df;else if(x==0x02)y=@0240;else if(x==0x03)y=@04ec;else y=@01a9;
  $  074.翻转机按钮状态                              $    $        $    $  ANS017.BYTE006  $  if(x==0x00)y=@0515;else if(x==0x01)y=@00df;else if(x==0x02)y=@0240;else if(x==0x03)y=@04ec;else y=@01a9;
  $  075.躺椅按钮状态                                $    $        $    $  ANS017.BYTE007  $  if(x==0x00)y=@0515;else if(x==0x01)y=@00df;else if(x==0x02)y=@0240;else if(x==0x03)y=@04ec;else y=@01a9;
  $  076.驱动器升降移动向上/向下                     $    $        $    $  ANS018.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a69;else if(x==0x02)y=@0a6a;else y=@01a9;
  $  077.升降器移动的距离                            $    $        $    $  ANS018.BYTE005  $  y=x1*256+x2;
  $  078.升降器移动的距离                            $    $        $    $  ANS018.BYTE004  $  y=x1*256+x2;
  $  079.座位记忆1状态                               $    $        $    $  ANS019.BYTE004  $  if(x==0x01)y=@0a18;else if(x==0x02)y=@01a9;else y=@01a9;
  $  080.座位记忆1升降机位置                         $    $        $    $  ANS019.BYTE005  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  081.座椅记忆1座滑块位置                         $    $        $    $  ANS019.BYTE007  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  082.座位记忆1倾翻位置                           $    $        $    $  ANS019.BYTE009  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  083.座位记忆1躺椅位置                           $    $        $    $  ANS019.BYTE011  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  084.座位记忆1左镜水平位置                       $    $        $    $  ANS019.BYTE013  $  y=x1*256+x2;
  $  085.座位记忆1左镜垂直位置                       $    $        $    $  ANS019.BYTE015  $  y=x1*256+x2;
  $  086.座位记忆1右镜水平位置                       $    $        $    $  ANS019.BYTE017  $  y=x1*256+x2;
  $  087.座位记忆1右镜垂直位置                       $    $        $    $  ANS019.BYTE019  $  y=x1*256+x2;
  $  088.座位记忆2状态                               $    $        $    $  ANS020.BYTE004  $  if(x==0x01)y=@0a18;else if(x==0x02)y=@01a9;else y=@01a9;
  $  089.座位记忆2升降机位置                         $    $        $    $  ANS020.BYTE005  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  090.座椅记忆2座滑块位置                         $    $        $    $  ANS020.BYTE007  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  091.座位记忆2倾翻位置                           $    $        $    $  ANS020.BYTE009  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  092.座位记忆2躺椅位置                           $    $        $    $  ANS020.BYTE011  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  093.座位记忆2左镜水平位置                       $    $        $    $  ANS020.BYTE013  $  y=x1*256+x2;
  $  094.座位记忆2左镜垂直位置                       $    $        $    $  ANS020.BYTE015  $  y=x1*256+x2;
  $  095.座位记忆2右镜水平位置                       $    $        $    $  ANS020.BYTE017  $  y=x1*256+x2;
  $  096.座位记忆2右镜垂直位置                       $    $        $    $  ANS020.BYTE019  $  y=x1*256+x2;
  $  097.座位存储器SET按钮状态                       $    $        $    $  ANS021.BYTE004  $  if(x==0x00)y=@000f;else if(x==0x01)y=@0028;else y=@01a9;
  $  098.座位存储器1/2按钮状态                       $    $        $    $  ANS021.BYTE005  $  if(x==0x00)y=@0a6b;else if(x==0x01)y=@0a6c;else if(x==0x02)y=@0a6d;else y=@01a9;
  $  099.座椅内存电压1/2按钮                         $    $  V     $    $  ANS021.BYTE006  $  y=x*0.1;
  $  100.滑块电机位置                                $    $        $    $  ANS022.BYTE004  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  101.提升机电机的位置                            $    $        $    $  ANS022.BYTE005  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  102.所电机的位置                                $    $        $    $  ANS022.BYTE006  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  103.躺椅电机的位置                              $    $        $    $  ANS022.BYTE008  $  y=((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000);
  $  104.滑块电机驱动程序状态                        $    $        $    $  ANS023.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@00df;else if(x==0x02)y=@0240;else y=@01a9;
  $  105.升降器电机驱动程序状态                      $    $        $    $  ANS023.BYTE005  $  if(x==0x00)y=@0036;else if(x==0x01)y=@05b6;else if(x==0x02)y=@05b7;else y=@01a9;
  $  106.所电机驱动程序状态                          $    $        $    $  ANS023.BYTE006  $  if(x==0x00)y=@0036;else if(x==0x01)y=@05b6;else if(x==0x02)y=@05b7;else y=@01a9;
  $  107.躺椅电机驱动程序状态                        $    $        $    $  ANS023.BYTE007  $  if(x==0x00)y=@0036;else if(x==0x01)y=@00df;else if(x==0x02)y=@0240;else y=@01a9;
  $  108.躺椅上移动的距离                            $    $        $    $  ANS024.BYTE004  $  y=x1*256+x2;
  $  109.驱动器的躺椅上，向前或向后移动              $    $        $    $  ANS024.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a74;else if(x==0x02)y=@0a75;else y=@01a9;
  $  110.躺椅上移动的距离                            $    $        $    $  ANS024.BYTE005  $  y=x1*256+x2;
  $  111.驱动滑块，来回移动                          $    $        $    $  ANS025.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a74;else if(x==0x02)y=@0a75;else y=@01a9;
  $  112.滑块移动距离                                $    $        $    $  ANS025.BYTE005  $  y=x1*256+x2;
  $  113.Tilterr移动的距离                           $    $        $    $  ANS026.BYTE004  $  y=x1*256+x2;
  $  114.驱动器(前升降器)来移动向上/向下翻转机       $    $        $    $  ANS026.BYTE004  $  if(x==0x00)y=@0036;else if(x==0x01)y=@0a69;else if(x==0x02)y=@0a6a;else y=@01a9;
  $  115.Tilterr移动的距离                           $    $        $    $  ANS026.BYTE005  $  y=x1*256+x2;
  $  116.滑块电机位置误差范围                        $    $        $    $  ANS027.BYTE004  $  y=x1*256+x2;
  $  117.DSM缓慢模式                                 $    $        $    $  ANS028.BYTE004  $  if(x==0x55)y=@0a76;else y=@01a9;
  $  118.阈值的当前锁定的升降电机                    $    $  A     $    $  ANS029.BYTE004  $  y=x*0.1;
  $  119.阈值的当前锁定的reliner电机                 $    $  A     $    $  ANS030.BYTE004  $  y=x*0.1;
  $  120.阈值的当前锁定的滑块电机                    $    $  A     $    $  ANS031.BYTE004  $  y=x*0.1;
  $  121.锁定的所电机过电流的阈值                    $    $  A     $    $  ANS032.BYTE004  $  y=x*0.1;
  $  122.翻转机电机的位置误差范围                    $    $        $    $  ANS033.BYTE004  $  y=x1*256+x2;
  $  123.滑块电机欢迎回距离                          $    $        $    $  ANS034.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:704 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
