
    车型ID：1089

    模拟：协议模拟-->1089

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 10 F1 81 03       $~  ANS000:81 10 F1 81 03
  $~  REQ001:82 10 F1 10 FA 8D       $~  ANS001:82 10 F1 10 FA 8D

空闲命令:

  $!  REQ000:81 10 F1 3E C0       $!  ANS000:81 10 F1 3E C0

退出命令:

  $@  REQ000:81 10 F1 82 04       $@  ANS000:81 10 F1 82 04


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 10 F1 18 00 FF 00 9C       $#  ANS000:84 10 F1 18 00 FF 00 9C

  帧长控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/89000000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 10 F1 14 FF 00 97       $$  ANS000:83 10 F1 14 FF 00 97

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 10 F1 1A 99 36       $%  ANS000:82 10 F1 1A 99 36
  $%  REQ001:82 10 F1 1A 98 35       $%  ANS001:82 10 F1 1A 98 35
  $%  REQ002:82 10 F1 1A 95 32       $%  ANS002:82 10 F1 1A 95 32
  $%  REQ003:82 10 F1 1A 94 31       $%  ANS003:82 10 F1 1A 94 31
  $%  REQ004:82 10 F1 1A 92 2F       $%  ANS004:82 10 F1 1A 92 2F
  $%  REQ005:82 10 F1 1A 93 30       $%  ANS005:82 10 F1 1A 93 30
  $%  REQ006:82 10 F1 1A 90 2D       $%  ANS006:82 10 F1 1A 90 2D
  $%  REQ007:82 10 F1 1A 91 2E       $%  ANS007:82 10 F1 1A 91 2E
  $%  REQ008:82 10 F1 1A 97 34       $%  ANS008:82 10 F1 1A 97 34

  $%  000:编程日期:                            $%    $%  ANS000.BYTE005  $%  HEX(X1,X2,X3,X4);
  $%  001:维修站代码或测试设备序列号:          $%    $%  ANS001.BYTE005  $%  HEX(X1,X2,X3);
  $%  002:电控单元系统供应商数据集标识:        $%    $%  ANS002.BYTE005  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  003:系统供应商电控单元软件号:            $%    $%  ANS003.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:供应商系统硬件号:                    $%    $%  ANS004.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:系统供应商硬件版本号:                $%    $%  ANS005.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  006:VIN码:                               $%    $%  ANS006.BYTE005  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  007:控制器总成号:                        $%    $%  ANS007.BYTE005  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13);
  $%  008:系统名或发动机类型:                  $%    $%  ANS008.BYTE005  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 10 F1 21 04 A8       $  ANS000:82 10 F1 21 04 A8
  $  REQ001:82 10 F1 21 B4 58       $  ANS001:82 10 F1 21 B4 58
  $  REQ002:82 10 F1 21 16 BA       $  ANS002:82 10 F1 21 16 BA
  $  REQ003:82 10 F1 21 14 B8       $  ANS003:82 10 F1 21 14 B8
  $  REQ004:82 10 F1 21 15 B9       $  ANS004:82 10 F1 21 15 B9
  $  REQ005:82 10 F1 21 9A 3E       $  ANS005:82 10 F1 21 9A 3E
  $  REQ006:82 10 F1 21 B6 5A       $  ANS006:82 10 F1 21 B6 5A
  $  REQ007:82 10 F1 21 22 C6       $  ANS007:82 10 F1 21 22 C6
  $  REQ008:82 10 F1 21 B5 59       $  ANS008:82 10 F1 21 B5 59
  $  REQ009:82 10 F1 21 1D C1       $  ANS009:82 10 F1 21 1D C1
  $  REQ010:82 10 F1 21 68 0C       $  ANS010:82 10 F1 21 68 0C
  $  REQ011:82 10 F1 21 08 AC       $  ANS011:82 10 F1 21 08 AC
  $  REQ012:82 10 F1 21 9F 43       $  ANS012:82 10 F1 21 9F 43
  $  REQ013:82 10 F1 21 8A 2E       $  ANS013:82 10 F1 21 8A 2E
  $  REQ014:82 10 F1 21 B7 5B       $  ANS014:82 10 F1 21 B7 5B
  $  REQ015:82 10 F1 21 B8 5C       $  ANS015:82 10 F1 21 B8 5C
  $  REQ016:82 10 F1 21 B9 5D       $  ANS016:82 10 F1 21 B9 5D
  $  REQ017:82 10 F1 21 BA 5E       $  ANS017:82 10 F1 21 BA 5E
  $  REQ018:82 10 F1 21 BD 61       $  ANS018:82 10 F1 21 BD 61
  $  REQ019:82 10 F1 21 BE 62       $  ANS019:82 10 F1 21 BE 62
  $  REQ020:82 10 F1 21 BF 63       $  ANS020:82 10 F1 21 BF 63
  $  REQ021:82 10 F1 21 C0 64       $  ANS021:82 10 F1 21 C0 64
  $  REQ022:82 10 F1 21 C3 67       $  ANS022:82 10 F1 21 C3 67
  $  REQ023:82 10 F1 21 C4 68       $  ANS023:82 10 F1 21 C4 68
  $  REQ024:82 10 F1 21 C5 69       $  ANS024:82 10 F1 21 C5 69
  $  REQ025:82 10 F1 21 C6 6A       $  ANS025:82 10 F1 21 C6 6A
  $  REQ026:82 10 F1 21 C9 6D       $  ANS026:82 10 F1 21 C9 6D
  $  REQ027:82 10 F1 21 CA 6E       $  ANS027:82 10 F1 21 CA 6E
  $  REQ028:82 10 F1 21 CB 6F       $  ANS028:82 10 F1 21 CB 6F
  $  REQ029:82 10 F1 21 CC 70       $  ANS029:82 10 F1 21 CC 70
  $  REQ030:82 10 F1 21 CF 73       $  ANS030:82 10 F1 21 CF 73
  $  REQ031:82 10 F1 21 D0 74       $  ANS031:82 10 F1 21 D0 74
  $  REQ032:82 10 F1 21 D1 75       $  ANS032:82 10 F1 21 D1 75
  $  REQ033:82 10 F1 21 D2 76       $  ANS033:82 10 F1 21 D2 76
  $  REQ034:82 10 F1 21 D9 7D       $  ANS034:82 10 F1 21 D9 7D
  $  REQ035:82 10 F1 21 1C C0       $  ANS035:82 10 F1 21 1C C0
  $  REQ036:82 10 F1 21 B3 57       $  ANS036:82 10 F1 21 B3 57
  $  REQ037:82 10 F1 21 8E 32       $  ANS037:82 10 F1 21 8E 32
  $  REQ038:82 10 F1 21 8F 33       $  ANS038:82 10 F1 21 8F 33
  $  REQ039:82 10 F1 21 5C 00       $  ANS039:82 10 F1 21 5C 00
  $  REQ040:82 10 F1 21 01 A5       $  ANS040:82 10 F1 21 01 A5
  $  REQ041:82 10 F1 21 6A 0E       $  ANS041:82 10 F1 21 6A 0E
  $  REQ042:82 10 F1 21 18 BC       $  ANS042:82 10 F1 21 18 BC
  $  REQ043:82 10 F1 21 17 BB       $  ANS043:82 10 F1 21 17 BB
  $  REQ044:82 10 F1 21 8D 31       $  ANS044:82 10 F1 21 8D 31
  $  REQ045:82 10 F1 21 85 29       $  ANS045:82 10 F1 21 85 29
  $  REQ046:82 10 F1 21 0D B1       $  ANS046:82 10 F1 21 0D B1
  $  REQ047:82 10 F1 21 34 D8       $  ANS047:82 10 F1 21 34 D8
  $  REQ048:82 10 F1 21 99 3D       $  ANS048:82 10 F1 21 99 3D
  $  REQ049:82 10 F1 21 07 AB       $  ANS049:82 10 F1 21 07 AB
  $  REQ050:82 10 F1 21 D5 79       $  ANS050:82 10 F1 21 D5 79
  $  REQ051:82 10 F1 21 D6 7A       $  ANS051:82 10 F1 21 D6 7A
  $  REQ052:82 10 F1 21 D7 7B       $  ANS052:82 10 F1 21 D7 7B
  $  REQ053:82 10 F1 21 D8 7C       $  ANS053:82 10 F1 21 D8 7C
  $  REQ054:82 10 F1 21 0B AF       $  ANS054:82 10 F1 21 0B AF
  $  REQ055:82 10 F1 21 AA 4E       $  ANS055:82 10 F1 21 AA 4E
  $  REQ056:82 10 F1 21 1E C2       $  ANS056:82 10 F1 21 1E C2
  $  REQ057:82 10 F1 21 58 FC       $  ANS057:82 10 F1 21 58 FC
  $  REQ058:82 10 F1 21 5D 01       $  ANS058:82 10 F1 21 5D 01
  $  REQ059:82 10 F1 21 B0 54       $  ANS059:82 10 F1 21 B0 54
  $  REQ060:82 10 F1 21 3C E0       $  ANS060:82 10 F1 21 3C E0
  $  REQ061:82 10 F1 21 11 B5       $  ANS061:82 10 F1 21 11 B5
  $  REQ062:82 10 F1 21 0A AE       $  ANS062:82 10 F1 21 0A AE
  $  REQ063:82 10 F1 21 67 0B       $  ANS063:82 10 F1 21 67 0B
  $  REQ064:82 10 F1 21 21 C5       $  ANS064:82 10 F1 21 21 C5
  $  REQ065:82 10 F1 21 1B BF       $  ANS065:82 10 F1 21 1B BF
  $  REQ066:82 10 F1 21 5A FE       $  ANS066:82 10 F1 21 5A FE
  $  REQ067:82 10 F1 21 1A BE       $  ANS067:82 10 F1 21 1A BE
  $  REQ068:82 10 F1 21 20 C4       $  ANS068:82 10 F1 21 20 C4
  $  REQ069:82 10 F1 21 AD 51       $  ANS069:82 10 F1 21 AD 51
  $  REQ070:82 10 F1 21 6B 0F       $  ANS070:82 10 F1 21 6B 0F
  $  REQ071:82 10 F1 21 80 24       $  ANS071:82 10 F1 21 80 24
  $  REQ072:82 10 F1 21 FE A2       $  ANS072:82 10 F1 21 FE A2
  $  REQ073:82 10 F1 21 86 2A       $  ANS073:82 10 F1 21 86 2A
  $  REQ074:82 10 F1 21 12 B6       $  ANS074:82 10 F1 21 12 B6
  $  REQ075:82 10 F1 21 9C 40       $  ANS075:82 10 F1 21 9C 40
  $  REQ076:82 10 F1 21 10 B4       $  ANS076:82 10 F1 21 10 B4
  $  REQ077:82 10 F1 21 B2 56       $  ANS077:82 10 F1 21 B2 56
  $  REQ078:82 10 F1 21 81 25       $  ANS078:82 10 F1 21 81 25
  $  REQ079:82 10 F1 21 23 C7       $  ANS079:82 10 F1 21 23 C7
  $  REQ080:82 10 F1 21 1F C3       $  ANS080:82 10 F1 21 1F C3
  $  REQ081:82 10 F1 21 90 34       $  ANS081:82 10 F1 21 90 34
  $  REQ082:82 10 F1 21 41 E5       $  ANS082:82 10 F1 21 41 E5
  $  REQ083:82 10 F1 21 47 EB       $  ANS083:82 10 F1 21 47 EB
  $  REQ084:82 10 F1 21 4D F1       $  ANS084:82 10 F1 21 4D F1
  $  REQ085:82 10 F1 21 43 E7       $  ANS085:82 10 F1 21 43 E7
  $  REQ086:82 10 F1 21 49 ED       $  ANS086:82 10 F1 21 49 ED
  $  REQ087:82 10 F1 21 4F F3       $  ANS087:82 10 F1 21 4F F3
  $  REQ088:82 10 F1 21 44 E8       $  ANS088:82 10 F1 21 44 E8
  $  REQ089:82 10 F1 21 4A EE       $  ANS089:82 10 F1 21 4A EE
  $  REQ090:82 10 F1 21 50 F4       $  ANS090:82 10 F1 21 50 F4
  $  REQ091:82 10 F1 21 45 E9       $  ANS091:82 10 F1 21 45 E9
  $  REQ092:82 10 F1 21 4B EF       $  ANS092:82 10 F1 21 4B EF
  $  REQ093:82 10 F1 21 51 F5       $  ANS093:82 10 F1 21 51 F5
  $  REQ094:82 10 F1 21 46 EA       $  ANS094:82 10 F1 21 46 EA
  $  REQ095:82 10 F1 21 4C F0       $  ANS095:82 10 F1 21 4C F0
  $  REQ096:82 10 F1 21 52 F6       $  ANS096:82 10 F1 21 52 F6
  $  REQ097:82 10 F1 21 42 E6       $  ANS097:82 10 F1 21 42 E6
  $  REQ098:82 10 F1 21 48 EC       $  ANS098:82 10 F1 21 48 EC
  $  REQ099:82 10 F1 21 4E F2       $  ANS099:82 10 F1 21 4E F2
  $  REQ100:82 10 F1 21 54 F8       $  ANS100:82 10 F1 21 54 F8
  $  REQ101:82 10 F1 21 53 F7       $  ANS101:82 10 F1 21 53 F7
  $  REQ102:82 10 F1 21 3E E2       $  ANS102:82 10 F1 21 3E E2
  $  REQ103:82 10 F1 21 3F E3       $  ANS103:82 10 F1 21 3F E3
  $  REQ104:82 10 F1 21 40 E4       $  ANS104:82 10 F1 21 40 E4
  $  REQ105:82 10 F1 21 3D E1       $  ANS105:82 10 F1 21 3D E1
  $  REQ106:82 10 F1 21 9E 42       $  ANS106:82 10 F1 21 9E 42
  $  REQ107:82 10 F1 21 02 A6       $  ANS107:82 10 F1 21 02 A6
  $  REQ108:82 10 F1 21 A0 44       $  ANS108:82 10 F1 21 A0 44
  $  REQ109:82 10 F1 21 8C 30       $  ANS109:82 10 F1 21 8C 30
  $  REQ110:82 10 F1 21 72 16       $  ANS110:82 10 F1 21 72 16
  $  REQ111:82 10 F1 21 73 17       $  ANS111:82 10 F1 21 73 17
  $  REQ112:82 10 F1 21 74 18       $  ANS112:82 10 F1 21 74 18
  $  REQ113:82 10 F1 21 75 19       $  ANS113:82 10 F1 21 75 19
  $  REQ114:82 10 F1 21 6C 10       $  ANS114:82 10 F1 21 6C 10
  $  REQ115:82 10 F1 21 6D 11       $  ANS115:82 10 F1 21 6D 11
  $  REQ116:82 10 F1 21 6E 12       $  ANS116:82 10 F1 21 6E 12
  $  REQ117:82 10 F1 21 6F 13       $  ANS117:82 10 F1 21 6F 13
  $  REQ118:82 10 F1 21 8B 2F       $  ANS118:82 10 F1 21 8B 2F
  $  REQ119:82 10 F1 21 60 04       $  ANS119:82 10 F1 21 60 04
  $  REQ120:82 10 F1 21 2A CE       $  ANS120:82 10 F1 21 2A CE
  $  REQ121:82 10 F1 21 2B CF       $  ANS121:82 10 F1 21 2B CF
  $  REQ122:82 10 F1 21 2C D0       $  ANS122:82 10 F1 21 2C D0
  $  REQ123:82 10 F1 21 2D D1       $  ANS123:82 10 F1 21 2D D1
  $  REQ124:82 10 F1 21 24 C8       $  ANS124:82 10 F1 21 24 C8
  $  REQ125:82 10 F1 21 25 C9       $  ANS125:82 10 F1 21 25 C9
  $  REQ126:82 10 F1 21 26 CA       $  ANS126:82 10 F1 21 26 CA
  $  REQ127:82 10 F1 21 27 CB       $  ANS127:82 10 F1 21 27 CB
  $  REQ128:82 10 F1 21 3A DE       $  ANS128:82 10 F1 21 3A DE
  $  REQ129:82 10 F1 21 7E 22       $  ANS129:82 10 F1 21 7E 22
  $  REQ130:82 10 F1 21 7B 1F       $  ANS130:82 10 F1 21 7B 1F
  $  REQ131:82 10 F1 21 7D 21       $  ANS131:82 10 F1 21 7D 21
  $  REQ132:82 10 F1 21 7C 20       $  ANS132:82 10 F1 21 7C 20
  $  REQ133:82 10 F1 21 87 2B       $  ANS133:82 10 F1 21 87 2B
  $  REQ134:82 10 F1 21 97 3B       $  ANS134:82 10 F1 21 97 3B
  $  REQ135:82 10 F1 21 98 3C       $  ANS135:82 10 F1 21 98 3C
  $  REQ136:82 10 F1 21 13 B7       $  ANS136:82 10 F1 21 13 B7
  $  REQ137:82 10 F1 21 5F 03       $  ANS137:82 10 F1 21 5F 03
  $  REQ138:82 10 F1 21 3B DF       $  ANS138:82 10 F1 21 3B DF
  $  REQ139:82 10 F1 21 E0 84       $  ANS139:82 10 F1 21 E0 84
  $  REQ140:82 10 F1 21 03 A7       $  ANS140:82 10 F1 21 03 A7
  $  REQ141:82 10 F1 21 62 06       $  ANS141:82 10 F1 21 62 06
  $  REQ142:82 10 F1 21 66 0A       $  ANS142:82 10 F1 21 66 0A
  $  REQ143:82 10 F1 21 0E B2       $  ANS143:82 10 F1 21 0E B2
  $  REQ144:82 10 F1 21 0F B3       $  ANS144:82 10 F1 21 0F B3
  $  REQ145:82 10 F1 21 64 08       $  ANS145:82 10 F1 21 64 08
  $  REQ146:82 10 F1 21 63 07       $  ANS146:82 10 F1 21 63 07
  $  REQ147:82 10 F1 21 84 28       $  ANS147:82 10 F1 21 84 28
  $  REQ148:82 10 F1 21 56 FA       $  ANS148:82 10 F1 21 56 FA
  $  REQ149:82 10 F1 21 59 FD       $  ANS149:82 10 F1 21 59 FD
  $  REQ150:82 10 F1 21 78 1C       $  ANS150:82 10 F1 21 78 1C
  $  REQ151:82 10 F1 21 35 D9       $  ANS151:82 10 F1 21 35 D9
  $  REQ152:82 10 F1 21 30 D4       $  ANS152:82 10 F1 21 30 D4
  $  REQ153:82 10 F1 21 31 D5       $  ANS153:82 10 F1 21 31 D5
  $  REQ154:82 10 F1 21 89 2D       $  ANS154:82 10 F1 21 89 2D
  $  REQ155:82 10 F1 21 32 D6       $  ANS155:82 10 F1 21 32 D6
  $  REQ156:82 10 F1 21 33 D7       $  ANS156:82 10 F1 21 33 D7
  $  REQ157:82 10 F1 21 65 09       $  ANS157:82 10 F1 21 65 09
  $  REQ158:82 10 F1 21 7A 1E       $  ANS158:82 10 F1 21 7A 1E
  $  REQ159:82 10 F1 21 79 1D       $  ANS159:82 10 F1 21 79 1D
  $  REQ160:82 10 F1 21 69 0D       $  ANS160:82 10 F1 21 69 0D

  $  000.空调压缩机状态                                                        $    $               $    $  ANS000.BYTE005  $  if(x==0x00) y=@000f;else if(x==0x01) y=@016d;else y=@01a9;
  $  001.发动机运行时间                                                        $    $  s            $    $  ANS001.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  002.加速踏板位置未过滤值                                                  $    $  %            $    $  ANS002.BYTE005  $  y=x*0.3922;
  $  003.加速踏板1电压信号                                                     $    $  mV           $    $  ANS003.BYTE005  $  y=x*137.248199;
  $  004.加速踏板2电压信号                                                     $    $  mV           $    $  ANS004.BYTE005  $  y=x*137.248199;
  $  005.加速踏板轮边扭矩请求                                                  $    $  Nm           $    $  ANS005.BYTE005  $  y=(x1*256+x2)*3500/65535.0-500.0;
  $  006.进气温度                                                              $    $  degree C     $    $  ANS006.BYTE005  $  y=x-40;
  $  007.增压中冷却下游温度                                                    $    $  degree C     $    $  ANS007.BYTE005  $  y=x-40;
  $  008.车辆行驶里程                                                          $    $  m            $    $  ANS008.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  009.电瓶电压                                                              $    $  mV           $    $  ANS009.BYTE005  $  y=x*137.797806;
  $  010.主刹车状态信号                                                        $    $               $    $  ANS010.BYTE005  $  if(x==0x00) y=@07dc;else if(x==0x01) y=@07dd;else y=@01a9;
  $  011.进气量偏差                                                            $    $  mH           $    $  ANS011.BYTE005  $  y=x*3000/255.0-1000;
  $  012.增压压力控制器输出                                                    $    $  %            $    $  ANS012.BYTE005  $  y=x*0.3922;
  $  013.当前曲轴扭矩                                                          $    $  Nm           $    $  ANS013.BYTE005  $  y=x*3000/255.0;
  $  014.发火顺序1缸预喷1设定油量                                              $    $  mg/Hub       $    $  ANS014.BYTE005  $  y=x;
  $  015.发火顺序2缸预喷1设定油量                                              $    $  mg/Hub       $    $  ANS015.BYTE005  $  y=x;
  $  016.发火顺序3缸预喷1设定油量                                              $    $  mg/Hub       $    $  ANS016.BYTE005  $  y=x;
  $  017.发火顺序4缸预喷1设定油量                                              $    $  mg/Hub       $    $  ANS017.BYTE005  $  y=x;
  $  018.发火顺序1缸预喷2设定油量                                              $    $  mg/Hub       $    $  ANS018.BYTE005  $  y=x;
  $  019.发火顺序2缸预喷2设定油量                                              $    $  mg/Hub       $    $  ANS019.BYTE005  $  y=x;
  $  020.发火顺序3缸预喷2设定油量                                              $    $  mg/Hub       $    $  ANS020.BYTE005  $  y=x;
  $  021.发火顺序4缸预喷2设定油量                                              $    $  mg/Hub       $    $  ANS021.BYTE005  $  y=x;
  $  022.发火顺序1缸预喷3设定油量                                              $    $  mg/Hub       $    $  ANS022.BYTE005  $  y=x;
  $  023.发火顺序2缸预喷3设定油量                                              $    $  mg/Hub       $    $  ANS023.BYTE005  $  y=x;
  $  024.发火顺序3缸预喷3设定油量                                              $    $  mg/Hub       $    $  ANS024.BYTE005  $  y=x;
  $  025.发火顺序4缸预喷3设定油量                                              $    $  mg/Hub       $    $  ANS025.BYTE005  $  y=x;
  $  026.发火顺序1缸后喷1设定油量                                              $    $  mg/Hub       $    $  ANS026.BYTE005  $  y=x;
  $  027.发火顺序2缸后喷1设定油量                                              $    $  mg/Hub       $    $  ANS027.BYTE005  $  y=x;
  $  028.发火顺序4缸后喷1设定油量                                              $    $  mg/Hub       $    $  ANS028.BYTE005  $  y=x;
  $  029.发火顺序4缸后喷1设定油量                                              $    $  mg/Hub       $    $  ANS029.BYTE005  $  y=x;
  $  030.发火顺序1缸后喷2设定油量                                              $    $  mg/Hub       $    $  ANS030.BYTE005  $  y=x;
  $  031.发火顺序2缸后喷2设定油量                                              $    $  mg/Hub       $    $  ANS031.BYTE005  $  y=x;
  $  032.发火顺序3缸后喷2设定油量                                              $    $  mg/Hub       $    $  ANS032.BYTE005  $  y=x;
  $  033.发火顺序4缸后喷2设定油量                                              $    $  mg/Hub       $    $  ANS033.BYTE005  $  y=x;
  $  034.主喷设定油量                                                          $    $  mg/Hub       $    $  ANS034.BYTE005  $  y=x;
  $  035.发动机冷却水温                                                        $    $  degree C     $    $  ANS035.BYTE005  $  y=x-40;
  $  036.节流阀占空比                                                          $    $  %            $    $  ANS036.BYTE005  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.3921;
  $  037.废气再循环位置                                                        $    $  %            $    $  ANS037.BYTE005  $  y=x*0.3922;
  $  038.废气再循环位置传感器电压                                              $    $  mV           $    $  ANS038.BYTE005  $  y=x*137.248199;
  $  039.喷油量设定值                                                          $    $  us           $    $  ANS039.BYTE005  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.999;
  $  040.发动机转速                                                            $    $  rpm          $    $  ANS040.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  041.发动机启动扭矩                                                        $    $  Nm           $    $  ANS041.BYTE005  $  y=x*0.1;
  $  042.环境压力传感器电压                                                    $    $  mV           $    $  ANS042.BYTE005  $  y=x*137.248199;
  $  043.环境压力(AMT/新hex的MT车型)                                           $    $  hPa          $    $  ANS043.BYTE005  $  y=(x1*256+x2)*19.6098-2000.20105;
  $  044.环境压力(老hex的MT车型)                                               $    $  hPa          $    $  ANS043.BYTE005  $  y=(x1*256+x2)*19.6098;
  $  045.环境压力(AMT车型)                                                     $    $  hPa          $    $  ANS043.BYTE005  $  y=(x1*256+x2)*19.6098-2000.20105;
  $  046.环境压力(非AMT车型)                                                   $    $  hPa          $    $  ANS043.BYTE005  $  y=(x1*256+x2)*19.6098;
  $  047.环境温度                                                              $    $  degree C     $    $  ANS044.BYTE005  $  y=x-40;
  $  048.增压中冷器下游压力(AMT/新hex的MT车型)                                 $    $  hPa          $    $  ANS045.BYTE005  $  y=x*5000/255.0-2000.0;
  $  049.增压中冷器下游压力(老hex的MT车型)                                     $    $  hPa          $    $  ANS045.BYTE005  $  y=x*5000/255.0;
  $  050.燃油温度                                                              $    $  degree C     $    $  ANS046.BYTE005  $  y=x-40;
  $  051.高压测试条件检查-发动机水温过低                                       $    $               $    $  ANS047.BYTE005  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  052.高压测试条件检查-发动机处于非怠速状态                                 $    $               $    $  ANS047.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  053.高压测试条件检查-轨压处于非闭环控制状态                               $    $               $    $  ANS047.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  054.高压测试条件检查-油门踏板被踩下                                       $    $               $    $  ANS047.BYTE005  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  055.高压测试条件检查-刹车信号不为0                                        $    $               $    $  ANS047.BYTE005  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  056.高压测试条件检查-车速不为0                                            $    $               $    $  ANS047.BYTE005  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  057.高压测试条件检查-离合器信号异常                                       $    $               $    $  ANS047.BYTE005  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  058.高压测试条件检查-存在系统故障                                         $    $               $    $  ANS047.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  059.高压测试条件检查-扭矩需求过大(超出电子元器件扭矩小号限定值)           $    $               $    $  ANS047.BYTE006  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  060.高压测试条件检查-空调压缩机处于工作状态                               $    $               $    $  ANS047.BYTE006  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  061.高压测试条件检查-测试中轨压波动(偏小)                                 $    $               $    $  ANS047.BYTE006  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  062.高压测试条件检查-测试中轨压波动(偏大)                                 $    $               $    $  ANS047.BYTE006  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  063.高压测试条件检查-测试中转速异常                                       $    $               $    $  ANS047.BYTE006  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  064.高压测试条件检查-测试中喷油量异常                                     $    $               $    $  ANS047.BYTE006  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  065.高压测试条件检查-再生功能不应被激活                                   $    $               $    $  ANS047.BYTE006  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  066.变速箱增加扭矩请求                                                    $    $  Nm           $    $  ANS048.BYTE005  $  y=x*11.7659;
  $  067.当前喷油量                                                            $    $  mg/Hub       $    $  ANS049.BYTE005  $  y=x;
  $  068.发火顺序1缸释放状态-预喷3                                             $    $               $    $  ANS050.BYTE005  $  if((x&0x40)==0x40)y=@00b2;else y=@000f;
  $  069.发火顺序1缸释放状态-预喷2                                             $    $               $    $  ANS050.BYTE005  $  if((x&0x20)==0x20)y=@00b2;else y=@000f;
  $  070.发火顺序1缸释放状态-预喷1                                             $    $               $    $  ANS050.BYTE005  $  if((x&0x10)==0x10)y=@00b2;else y=@000f;
  $  071.发火顺序1缸释放状态-主喷1                                             $    $               $    $  ANS050.BYTE005  $  if((x&0x08)==0x08)y=@00b2;else y=@000f;
  $  072.发火顺序1缸释放状态-后喷3                                             $    $               $    $  ANS050.BYTE005  $  if((x&0x04)==0x04)y=@00b2;else y=@000f;
  $  073.发火顺序1缸释放状态-后喷2                                             $    $               $    $  ANS050.BYTE005  $  if((x&0x02)==0x02)y=@00b2;else y=@000f;
  $  074.发火顺序1缸释放状态-后喷1                                             $    $               $    $  ANS050.BYTE005  $  if((x&0x01)==0x01)y=@00b2;else y=@000f;
  $  075.发火顺序2缸释放状态-预喷3                                             $    $               $    $  ANS051.BYTE005  $  if((x&0x40)==0x40)y=@00b2;else y=@000f;
  $  076.发火顺序2缸释放状态-预喷2                                             $    $               $    $  ANS051.BYTE005  $  if((x&0x20)==0x20)y=@00b2;else y=@000f;
  $  077.发火顺序2缸释放状态-预喷1                                             $    $               $    $  ANS051.BYTE005  $  if((x&0x10)==0x10)y=@00b2;else y=@000f;
  $  078.发火顺序2缸释放状态-主喷1                                             $    $               $    $  ANS051.BYTE005  $  if((x&0x08)==0x08)y=@00b2;else y=@000f;
  $  079.发火顺序2缸释放状态-后喷3                                             $    $               $    $  ANS051.BYTE005  $  if((x&0x04)==0x04)y=@00b2;else y=@000f;
  $  080.发火顺序2缸释放状态-后喷2                                             $    $               $    $  ANS051.BYTE005  $  if((x&0x02)==0x02)y=@00b2;else y=@000f;
  $  081.发火顺序2缸释放状态-后喷1                                             $    $               $    $  ANS051.BYTE005  $  if((x&0x01)==0x01)y=@00b2;else y=@000f;
  $  082.发火顺序3缸释放状态-预喷3                                             $    $               $    $  ANS052.BYTE005  $  if((x&0x40)==0x40)y=@00b2;else y=@000f;
  $  083.发火顺序3缸释放状态-预喷2                                             $    $               $    $  ANS052.BYTE005  $  if((x&0x20)==0x20)y=@00b2;else y=@000f;
  $  084.发火顺序3缸释放状态-预喷1                                             $    $               $    $  ANS052.BYTE005  $  if((x&0x10)==0x10)y=@00b2;else y=@000f;
  $  085.发火顺序3缸释放状态-主喷1                                             $    $               $    $  ANS052.BYTE005  $  if((x&0x08)==0x08)y=@00b2;else y=@000f;
  $  086.发火顺序3缸释放状态-后喷3                                             $    $               $    $  ANS052.BYTE005  $  if((x&0x04)==0x04)y=@00b2;else y=@000f;
  $  087.发火顺序3缸释放状态-后喷2                                             $    $               $    $  ANS052.BYTE005  $  if((x&0x02)==0x02)y=@00b2;else y=@000f;
  $  088.发火顺序3缸释放状态-后喷1                                             $    $               $    $  ANS052.BYTE005  $  if((x&0x01)==0x01)y=@00b2;else y=@000f;
  $  089.发火顺序4缸释放状态-预喷3                                             $    $               $    $  ANS053.BYTE005  $  if((x&0x40)==0x40)y=@00b2;else y=@000f;
  $  090.发火顺序4缸释放状态-预喷2                                             $    $               $    $  ANS053.BYTE005  $  if((x&0x20)==0x20)y=@00b2;else y=@000f;
  $  091.发火顺序4缸释放状态-预喷1                                             $    $               $    $  ANS053.BYTE005  $  if((x&0x10)==0x10)y=@00b2;else y=@000f;
  $  092.发火顺序4缸释放状态-主喷1                                             $    $               $    $  ANS053.BYTE005  $  if((x&0x08)==0x08)y=@00b2;else y=@000f;
  $  093.发火顺序4缸释放状态-后喷3                                             $    $               $    $  ANS053.BYTE005  $  if((x&0x04)==0x04)y=@00b2;else y=@000f;
  $  094.发火顺序4缸释放状态-后喷2                                             $    $               $    $  ANS053.BYTE005  $  if((x&0x02)==0x02)y=@00b2;else y=@000f;
  $  095.发火顺序4缸释放状态-后喷1                                             $    $               $    $  ANS053.BYTE005  $  if((x&0x01)==0x01)y=@00b2;else y=@000f;
  $  096.增压器执行器位置                                                      $    $  %            $    $  ANS054.BYTE005  $  y=x*0.3922;
  $  097.最大车速极限值                                                        $    $  km/h         $    $  ANS055.BYTE005  $  y=(x1*256+x2)*0.01;
  $  098.低怠速设定值                                                          $    $  rpm          $    $  ANS056.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  099.增压执行器占空比                                                      $    $  %            $    $  ANS057.BYTE005  $  y=x*0.3921;
  $  100.涡流阀执行器占空比                                                    $    $  %            $    $  ANS058.BYTE005  $  y=x*0.3921;
  $  101.增压系统监控状态                                                      $    $               $    $  ANS059.BYTE005  $  if(x==0x00) y=@080b;else if(x==0x01) y=@0f41;else if(x==0x02) y=@0f42;else if(x==0x03) y=@080e;else if(x==0x04) y=@0853;else if(x==0x05) y=@00d3;else if(x==0x06) y=@0f3d;else if(x==0x07) y=@0811;else if(x==0x08) y=@085f;else y=@01a9;
  $  102.滤波后的调节单元实际电流值                                            $    $  mA           $    $  ANS060.BYTE005  $  y=(x1*256+x2);
  $  103.预供泵激活状态                                                        $    $               $    $  ANS061.BYTE005  $  if((x1*256+x2)==0x00) y=@0028;else if((x1*256+x2)==0x01) y=@000f;else y=@01a9;
  $  104.涡流阀位置                                                            $    $  %            $    $  ANS062.BYTE005  $  y=x*0.3921;
  $  105.轨压传感器电压                                                        $    $  mV           $    $  ANS063.BYTE005  $  y=(x1*256+x2)*0.2;
  $  106.增压中冷器下游温度传感器电压                                          $    $  mV           $    $  ANS064.BYTE005  $  y=x*137.248199;
  $  107.水温传感器电压                                                        $    $  mV           $    $  ANS065.BYTE005  $  y=x*137.248199;
  $  108.燃油温度传感器电压                                                    $    $  mV           $    $  ANS066.BYTE005  $  y=x*137.248199;
  $  109.初始化低位信息                                                        $    $               $    $  ANS067.BYTE005  $  y=x;
  $  110.喷油量设定值                                                          $    $  mg/Hub       $    $  ANS068.BYTE005  $  y=x;
  $  111.维修站代码                                                            $    $               $    $  ANS069.BYTE005  $  HEX(X1,X2,X3);
  $  112.编程日期                                                              $    $               $    $  ANS069.BYTE008  $  HEX(X1,X2,X3,X4);
  $  113.发动机起动时故障信息-启动机状态                                       $    $               $    $  ANS070.BYTE005  $  if((x&0x20)==0x20)y=@083b;else y=@05b8;
  $  114.发动机起动时故障信息-关闭请求                                         $    $               $    $  ANS070.BYTE005  $  if((x&0x08)==0x08)y=@083b;else y=@05b8;
  $  115.发动机起动时故障信息-发动机同步                                       $    $               $    $  ANS070.BYTE005  $  if((x&0x04)==0x04)y=@083b;else y=@05b8;
  $  116.发动机起动时故障信息-发动机转速足够启动发动机                         $    $               $    $  ANS070.BYTE005  $  if((x&0x02)==0x02)y=@083b;else y=@05b8;
  $  117.发动机起动时故障信息-轨压足够启动发动机                               $    $               $    $  ANS070.BYTE005  $  if((x&0x01)==0x01)y=@083b;else y=@05b8;
  $  118.ADC(数模转换)监控状态-不可擦除故障已经发生                            $    $               $    $  ANS071.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  119.ADC(数模转换)监控状态-比例修正系数监控期间不可擦除故障                $    $               $    $  ANS071.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  120.ADC(数模转换)监控状态-电压检测是不可擦除错误                          $    $               $    $  ANS071.BYTE005  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  121.ADC(数模转换)监控状态-NTP释放                                         $    $               $    $  ANS071.BYTE005  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  122.ADC(数模转换)监控状态-NTP激活                                         $    $               $    $  ANS071.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  123.离合器踏板自学习状态                                                  $    $               $    $  ANS072.BYTE005  $  if(x==0x00) y=@07ec;else if(x==0x01) y=@0f3a;else y=@01a9;
  $  124.刹车状态                                                              $    $               $    $  ANS073.BYTE005  $  if(x==0x00) y=@0949;else if(x==0x01) y=@0f3b;else y=@01a9;
  $  125.预热灯状态                                                            $    $               $    $  ANS074.BYTE005  $  if(x==0x00) y=@0028;else if(x==0x01) y=@000f;else y=@01a9;
  $  126.主继电器状态                                                          $    $               $    $  ANS075.BYTE005  $  if(x==0x00) y=@081a;else if(x==0x01) y=@000f;else y=@01a9;
  $  127.T15状态信号                                                           $    $               $    $  ANS076.BYTE005  $  if(x==0x00) y=@00c9;else if(x==0x01) y=@00ca;else y=@01a9;
  $  128.点火开关状态信号(Dec Value)                                           $    $               $    $  ANS077.BYTE005  $  if(x==0x00) y=@0f3c;else if(x==0x01) y=@09f6;else y=@01a9;
  $  129.空气流量信号原始值(AMT车型)                                           $    $  us           $    $  ANS078.BYTE005  $  y=(x1*256*256*25.6+x2*256*25.6+x3*25.6+x4*0.1)*0.5;
  $  130.空气流量信号原始值(非AMT车型)                                         $    $  ms           $    $  ANS078.BYTE005  $  y=(x1*256*256*25.6+x2*256*25.6+x3*25.6+x4*0.1)*0.0196078;
  $  131.增压中冷器下游压力传感器电压                                          $    $  mV           $    $  ANS079.BYTE005  $  y=x*137.248199;
  $  132.车速                                                                  $    $  km/h         $    $  ANS080.BYTE005  $  y=x;
  $  133.油水传感器状态(Dec Value)                                             $    $               $    $  ANS081.BYTE005  $  if(x==0x00) y=@07ca;else if(x==0x01) y=@07cb;else y=@01a9;
  $  134.在轨压设定点1，点火顺序1缸对应的小油量加电时间偏差                    $    $               $    $  ANS082.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  135.在轨压设定点2，点火顺序1缸对应的小油量加电时间偏差                    $    $               $    $  ANS083.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  136.在轨压设定点3，点火顺序1缸对应的小油量加电时间偏差                    $    $               $    $  ANS084.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  137.在轨压设定点1，点火顺序3缸对应的小油量加电时间偏差                    $    $               $    $  ANS085.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  138.在轨压设定点2，点火顺序3缸对应的小油量加电时间偏差                    $    $               $    $  ANS086.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  139.在轨压设定点3，点火顺序3缸对应的小油量加电时间偏差                    $    $               $    $  ANS087.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  140.在轨压设定点1，点火顺序4缸对应的小油量加电时间偏差                    $    $               $    $  ANS088.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  141.在轨压设定点2，点火顺序4缸对应的小油量加电时间偏差                    $    $               $    $  ANS089.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  142.在轨压设定点3，点火顺序4缸对应的小油量加电时间偏差                    $    $               $    $  ANS090.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  143.在轨压设定点1，点火顺序5缸对应的小油量加电时间偏差                    $    $               $    $  ANS091.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  144.在轨压设定点2，点火顺序5缸对应的小油量加电时间偏差                    $    $               $    $  ANS092.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  145.在轨压设定点3，点火顺序5缸对应的小油量加电时间偏差                    $    $               $    $  ANS093.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  146.在轨压设定点1，点火顺序6缸对应的小油量加电时间偏差                    $    $               $    $  ANS094.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  147.在轨压设定点2，点火顺序6缸对应的小油量加电时间偏差                    $    $               $    $  ANS095.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  148.在轨压设定点3，点火顺序6缸对应的小油量加电时间偏差                    $    $               $    $  ANS096.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  149.在轨压设定点1，点火顺序2缸对应的小油量加电时间偏差                    $    $               $    $  ANS097.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  150.在轨压设定点2，点火顺序2缸对应的小油量加电时间偏差                    $    $               $    $  ANS098.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  151.在轨压设定点3，点火顺序2缸对应的小油量加电时间偏差                    $    $               $    $  ANS099.BYTE005  $  y=(x1*256+x2)*0.0153;
  $  152.ZFC(零喷油量标定)加电时间标定修正释放状态                             $    $               $    $  ANS100.BYTE005  $  y=x;
  $  153.ZFC(零喷油量标定)加电时间标定修正状态                                 $    $               $    $  ANS101.BYTE005  $  y=x;
  $  154.在轨压设定点1，小油量加电时间学习次数                                 $    $               $    $  ANS102.BYTE005  $  y=(x1*256+x2);
  $  155.在轨压设定点2，小油量加电时间学习次数                                 $    $               $    $  ANS103.BYTE005  $  y=(x1*256+x2);
  $  156.在轨压设定点3，小油量加电时间学习次数                                 $    $               $    $  ANS104.BYTE005  $  y=(x1*256+x2);
  $  157.调节单元输入模拟电压值                                                $    $  mV           $    $  ANS105.BYTE005  $  y=x*137.248199;
  $  158.增压压力目标值(AMT车型)                                               $    $  hPa          $    $  ANS106.BYTE005  $  y=(x1*256+x2)*19.6098-2000.20105;
  $  159.增压压力目标值(非AMT车型)                                             $    $  hPa          $    $  ANS106.BYTE005  $  y=(x1*256+x2)*19.6098;
  $  160.增压中冷器下游压力来自传感器(AMT/新hex的MT车型)                       $    $  hPa          $    $  ANS107.BYTE005  $  y=x*5000/255.0-2000.0;
  $  161.增压中冷器下游压力来自传感器(老hex的MT车型)                           $    $  hPa          $    $  ANS107.BYTE005  $  y=x*5000/255.0;
  $  162.增压压力传感器(非AMT车型)                                             $    $  hPa          $    $  ANS107.BYTE005  $  y=x*5000/255.0;
  $  163.增压压力传感器(AMT车型)                                               $    $  hPa          $    $  ANS107.BYTE005  $  y=x*5000/255.0-2000.0;
  $  164.增压控制偏差值(AMT车型)                                               $    $  hPa          $    $  ANS108.BYTE005  $  y=(x1*256+x2)*19.6098-2000.20105;
  $  165.增压控制偏差值(非AMT车型)                                             $    $  hPa          $    $  ANS108.BYTE005  $  y=(x1*256+x2)*19.6098;
  $  166.增压压力(AMT车型)                                                     $    $  hPa          $    $  ANS045.BYTE005  $  y=((x&0x7F)-(x&0x80))*5000/255.0-2000.0;
  $  167.增压压力(非AMT车型)                                                   $    $  hPa          $    $  ANS045.BYTE005  $  y=((x&0x7F)-(x&0x80))*5000/255.0;
  $  168.当前实际扭矩比当前最大扭矩比                                          $    $  %            $    $  ANS109.BYTE005  $  y=x*0.3922;
  $  169.发火顺序1缸上止点后膨胀时间                                           $    $  us           $    $  ANS110.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  170.发火顺序2缸上止点后膨胀时间                                           $    $  us           $    $  ANS111.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  171.发火顺序3缸上止点后膨胀时间                                           $    $  us           $    $  ANS112.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  172.发火顺序4缸上止点后膨胀时间                                           $    $  us           $    $  ANS113.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  173.发火顺序1缸上止点前压缩时间                                           $    $  us           $    $  ANS114.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  174.发火顺序2缸上止点前压缩时间                                           $    $  us           $    $  ANS115.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  175.发火顺序3缸上止点前压缩时间                                           $    $  us           $    $  ANS116.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  176.发火顺序4缸上止点前压缩时间                                           $    $  us           $    $  ANS117.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  177.离合器状态                                                            $    $               $    $  ANS118.BYTE005  $  if(x==0x00) y=@0804;else if(x==0x01) y=@0805;else y=@01a9;
  $  178.油量计量单元压力调节预定值                                            $    $               $    $  ANS119.BYTE005  $  y=(x1*256+x2);
  $  179.发火顺序1缸对应的FBC修正油量(AMT/新hex的MT车型)                       $    $  mg/Hub       $    $  ANS120.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  180.发火顺序1缸对应的FBC修正油量(老hex的MT车型)                           $    $  mg/Hub       $    $  ANS120.BYTE005  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.01-327.67;
  $  181.发火顺序2缸对应的FBC修正油量(AMT/新hex的MT车型)                       $    $  mg/Hub       $    $  ANS121.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  182.发火顺序2缸对应的FBC修正油量(老hex的MT车型)                           $    $  mg/Hub       $    $  ANS121.BYTE005  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.01-327.67;
  $  183.发火顺序3缸对应的FBC修正油量(AMT/新hex的MT车型)                       $    $  mg/Hub       $    $  ANS122.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  184.发火顺序3缸对应的FBC修正油量(老hex的MT车型)                           $    $  mg/Hub       $    $  ANS122.BYTE005  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.01-327.67;
  $  185.发火顺序4缸对应的FBC修正油量(AMT/新hex的MT车型)                       $    $  mg/Hub       $    $  ANS123.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  186.发火顺序4缸对应的FBC修正油量(老hex的MT车型)                           $    $  mg/Hub       $    $  ANS123.BYTE005  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.01-327.67;
  $  187.发火顺序1缸对应的发动机转速                                           $    $  rpm          $    $  ANS124.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  188.发火顺序2缸对应的发动机转速                                           $    $  rpm          $    $  ANS125.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  189.发火顺序3缸对应的发动机转速                                           $    $  rpm          $    $  ANS126.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  190.发火顺序4缸对应的发动机转速                                           $    $  rpm          $    $  ANS127.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  191.调节单元电流设定值                                                    $    $  mA           $    $  ANS128.BYTE005  $  y=(x1*256+x2);
  $  192.减速阶段末尾发动机转速                                                $    $  rpm          $    $  ANS129.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  193.加速阶段起始发动机转速                                                $    $  rpm          $    $  ANS130.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  194.减速阶段起始发动机转速                                                $    $  rpm          $    $  ANS131.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  195.加速阶段末尾发动机转速                                                $    $  rpm          $    $  ANS132.BYTE005  $  y=(x1*256+x2)*6003/65535;
  $  196.发动机状态                                                            $    $               $    $  ANS133.BYTE005  $  if(x==0x00) y=@07f5;else if(x==0x01) y=@07f6;else if(x==0x02) y=@07f7;else if(x==0x03) y=@07f8;else if(x==0x04) y=@07f9;else if(x==0x05) y=@07f5;else y=@01a9;
  $  197.燃油温度(来自传感器)                                                  $    $  degree C     $    $  ANS134.BYTE005  $  y=x-40;
  $  198.当前档位                                                              $    $               $    $  ANS135.BYTE005  $  y=x&0x0F;
  $  199.预热塞激活状态                                                        $    $               $    $  ANS136.BYTE005  $  if(x==0x00) y=@0803;else if(x==0x01) y=@0802;else y=@01a9;
  $  200.轨压偏差                                                              $    $  hPa          $    $  ANS137.BYTE005  $  y=(x1*256+x2)*38.1449-499965.0;
  $  201.MeUn占空比                                                            $    $  %            $    $  ANS138.BYTE005  $  y=x*0.3921;
  $  202.压力控制阀修正系数                                                    $    $               $    $  ANS139.BYTE005  $  y=(x1*256+x2)*0.0001-2.0;
  $  203.轨压                                                                  $    $  hPa          $    $  ANS140.BYTE005  $  y=(x1*256+x2)*38.1449-499965.0;
  $  204.轨压控制器体积流量设定值                                              $    $               $    $  ANS141.BYTE005  $  y=(x1*256+x2);
  $  205.轨压传感器电压                                                        $    $  hPa          $    $  ANS142.BYTE005  $  y=(x1*256+x2)*38.1449-499965.0;
  $  206.副刹车状态信号(Dec Value)                                             $    $               $    $  ANS143.BYTE005  $  if(x==0x00) y=@07dc;else if(x==0x01) y=@07dd;else y=@01a9;
  $  207.离合器状态信号                                                        $    $               $    $  ANS144.BYTE005  $  if(x==0x00) y=@07dc;else if(x==0x01) y=@07dd;else y=@01a9;
  $  208.轨压设定值                                                            $    $  hPa          $    $  ANS145.BYTE005  $  y=(x1*256+x2)*38.1449-499965.0;
  $  209.压力控制阀设定值                                                      $    $  hPa          $    $  ANS146.BYTE005  $  y=(x1*256+x2)*38.1449-499965.0;
  $  210.空气量控制状态                                                        $    $               $    $  ANS147.BYTE005  $  if(x==0x00)y=@084e;else if(x==0x01)y=@084f;else if(x==0x02)y=@0f3d;else if(x==0x03)y=@0850;else if(x==0x04)y=@080d;else if(x==0x05)y=@0f3e;else if(x==0x06)y=@00d3;else if(x==0x07)y=@0852;else if(x==0x08)y=@0847;else if(x==0x09)y=@0f3f;else if(x==0x10)y=@0854;else if(x==0x11)y=@0855;else if(x==0x12)y=@0f40;else if(x==0x13)y=@0857;else if(x==0x14)y=@0858;else if(x==0x15)y=@0859;else if(x==0x16)y=@085a;else if(x==0x17)y=@080e;else if(x==0x18)y=@085c;else if(x==0x19)y=@085d;else if(x==0x20)y=@085e;else if(x==0x21)y=@085f;else y=@01a9;
  $  211.退出关闭测试的具体原因-发动机转速大于测试最大允许转速                 $    $               $    $  ANS148.BYTE006  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  212.退出关闭测试的具体原因-刹车信号不为零，处于刹车状态                   $    $               $    $  ANS148.BYTE006  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  213.退出关闭测试的具体原因-车速不为零                                     $    $               $    $  ANS148.BYTE006  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  214.退出关闭测试的具体原因-手动挡车辆离合器接合或自动挡离合器未接合       $    $               $    $  ANS148.BYTE006  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  215.退出关闭测试的具体原因-Fid_InjCrvShOffTst_mp被调用                    $    $               $    $  ANS148.BYTE006  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  216.发动机同步状态                                                        $    $               $    $  ANS149.BYTE005  $  y=x;
  $  217.压缩测试条件检查-测试中电压过低                                       $    $               $    $  ANS150.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  218.压缩测试条件检查-测试超时                                             $    $               $    $  ANS150.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  219.压缩测试条件检查-发动机转速不等于0                                    $    $               $    $  ANS150.BYTE005  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  220.压缩测试条件检查-车速不为0                                            $    $               $    $  ANS150.BYTE005  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  221.压缩测试条件检查-系统故障存在                                         $    $               $    $  ANS150.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  222.加速测试条件检查-起动时再生激活                                       $    $               $    $  ANS151.BYTE005  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  223.加速测试条件检查-测试参数错误                                         $    $               $    $  ANS151.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  224.加速测试条件检查-测试运行超时                                         $    $               $    $  ANS151.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  225.加速测试条件检查-油门踏板被踩下                                       $    $               $    $  ANS151.BYTE005  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  226.加速测试条件检查-刹车信号不为0                                        $    $               $    $  ANS151.BYTE005  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  227.加速测试条件检查-车速不为0                                            $    $               $    $  ANS151.BYTE005  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  228.加速测试条件检查-离合器信号异常                                       $    $               $    $  ANS151.BYTE005  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  229.加速测试条件检查-系统故障存在                                         $    $               $    $  ANS151.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  230.加速测试条件检查-扭矩需求过大(超过电子元器件消耗限定值)               $    $               $    $  ANS151.BYTE006  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  231.加速测试条件检查-测试过程中同步信号异常                               $    $               $    $  ANS151.BYTE006  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  232.高压测试中轨压建立状态(Dec)                                           $    $               $    $  ANS152.BYTE005  $  if(x==0x00)y=@083e;else if(x==0x01)y=@028d;else if(x==0x02)y=@0004;else if(x==0x03)y=@0004;else y=@01a9;
  $  233.高压测试中第一次泄压状态(Dec)                                         $    $               $    $  ANS153.BYTE005  $  if(x==0x00)y=@028d;else if(x==0x01)y=@0a24;else if(x==0x02)y=@083e;else if(x==0x03)y=@0004;else if(x==0x04)y=@0004;else y=@01a9;
  $  234.驱动模块诊断释放状态-电池电压校正系数不等于1                          $    $               $    $  ANS154.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  235.驱动模块诊断释放状态-禁止powerstage And Powerstage诊断功能            $    $               $    $  ANS154.BYTE005  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  236.驱动模块诊断释放状态-电池电压过高                                     $    $               $    $  ANS154.BYTE005  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  237.驱动模块诊断释放状态-电池电压过低                                     $    $               $    $  ANS154.BYTE005  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  238.驱动模块诊断释放状态-ECU处于POS TDRIVE状态                            $    $               $    $  ANS154.BYTE005  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  239.驱动模块诊断释放状态-ECU处于PREDRIVE状态                              $    $               $    $  ANS154.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  240.驱动模块诊断释放状态-MoCSop激活                                       $    $               $    $  ANS154.BYTE006  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  241.高压测试中第2次泄压状态(No Explain)                                   $    $               $    $  ANS155.BYTE005  $  if(x==0x00)y=@083e;else if(x==0x01)y=@028d;else if(x==0x02)y=@0004;else if(x==0x03)y=@0004;else y=@01a9;
  $  242.高压测试中第3次泄压状态(Dec)                                          $    $               $    $  ANS156.BYTE005  $  if(x==0x00)y=@083e;else if(x==0x01)y=@043a;else if(x==0x02)y=@0004;else if(x==0x03)y=@0004;else y=@01a9;
  $  243.轨压控制偏差                                                          $    $               $    $  ANS157.BYTE005  $  y=x;
  $  244.加速测试中减速阶段时间                                                $    $               $    $  ANS158.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  245.加速测试中加速阶段时间                                                $    $  us           $    $  ANS159.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  246.来源于传感器的车速                                                    $    $  km/h         $    $  ANS160.BYTE005  $  y=x;

;******************************************************************************************************************************************************

