
    车型ID：108f

    模拟：协议模拟-->108f

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 40 F1 81 33       $~  ANS000:81 40 F1 81 33
  $~  REQ001:82 40 F1 10 83 46       $~  ANS001:82 40 F1 10 83 46

空闲命令:

  $!  REQ000:81 40 F1 3E F0       $!  ANS000:81 40 F1 3E F0

退出命令:

  $@  REQ000:81 40 F1 82 34       $@  ANS000:81 40 F1 82 34


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 40 F1 18 00 FF 00 CC       $#  ANS000:84 40 F1 18 00 FF 00 CC

  帧长控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/50000000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 40 F1 14 FF 00 C7       $$  ANS000:83 40 F1 14 FF 00 C7

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 40 F1 1A 80 4D       $%  ANS000:82 40 F1 1A 80 4D

  $%  000:产品总成号后6位:        $%    $%  ANS000.BYTE005  $%  HEX(X1,X2,X3);
  $%  001:二维追溯码:             $%    $%  ANS000.BYTE008  $%  HEX(X1,X2,X3,X4,X5);
  $%  002:软件号码:               $%    $%  ANS000.BYTE013  $%  HEX(X1,X2,X3,X4,X5);
  $%  003:电控单元硬件号:         $%    $%  ANS000.BYTE018  $%  HEX(X1);
  $%  004:软件版本号:             $%    $%  ANS000.BYTE019  $%  HEX(X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:83 40 F1 30 02 01 E7       $  ANS000:83 40 F1 30 02 01 E7
  $  REQ001:83 40 F1 30 08 01 ED       $  ANS001:83 40 F1 30 08 01 ED
  $  REQ002:82 40 F1 21 40 14       $  ANS002:82 40 F1 21 40 14
  $  REQ003:82 40 F1 21 31 05       $  ANS003:82 40 F1 21 31 05
  $  REQ004:82 40 F1 21 33 07       $  ANS004:82 40 F1 21 33 07
  $  REQ005:82 40 F1 21 32 06       $  ANS005:82 40 F1 21 32 06
  $  REQ006:82 40 F1 21 0A DE       $  ANS006:82 40 F1 21 0A DE
  $  REQ007:82 40 F1 21 36 0A       $  ANS007:82 40 F1 21 36 0A
  $  REQ008:82 40 F1 21 39 0D       $  ANS008:82 40 F1 21 39 0D
  $  REQ009:83 40 F1 30 0C 01 F1       $  ANS009:83 40 F1 30 0C 01 F1
  $  REQ010:82 40 F1 21 0B DF       $  ANS010:82 40 F1 21 0B DF
  $  REQ011:82 40 F1 21 06 DA       $  ANS011:82 40 F1 21 06 DA
  $  REQ012:82 40 F1 21 11 E5       $  ANS012:82 40 F1 21 11 E5
  $  REQ013:82 40 F1 21 12 E6       $  ANS013:82 40 F1 21 12 E6
  $  REQ014:83 40 F1 30 04 01 E9       $  ANS014:83 40 F1 30 04 01 E9
  $  REQ015:83 40 F1 30 06 01 EB       $  ANS015:83 40 F1 30 06 01 EB
  $  REQ016:82 40 F1 21 21 F5       $  ANS016:82 40 F1 21 21 F5
  $  REQ017:82 40 F1 21 26 FA       $  ANS017:82 40 F1 21 26 FA
  $  REQ018:82 40 F1 21 25 F9       $  ANS018:82 40 F1 21 25 F9
  $  REQ019:82 40 F1 21 24 F8       $  ANS019:82 40 F1 21 24 F8
  $  REQ020:82 40 F1 21 23 F7       $  ANS020:82 40 F1 21 23 F7
  $  REQ021:82 40 F1 21 05 D9       $  ANS021:82 40 F1 21 05 D9
  $  REQ022:82 40 F1 21 37 0B       $  ANS022:82 40 F1 21 37 0B
  $  REQ023:83 40 F1 30 05 01 EA       $  ANS023:83 40 F1 30 05 01 EA
  $  REQ024:83 40 F1 30 09 01 EE       $  ANS024:83 40 F1 30 09 01 EE
  $  REQ025:82 40 F1 21 02 D6       $  ANS025:82 40 F1 21 02 D6
  $  REQ026:82 40 F1 21 01 D5       $  ANS026:82 40 F1 21 01 D5
  $  REQ027:83 40 F1 30 0E 01 F3       $  ANS027:83 40 F1 30 0E 01 F3
  $  REQ028:82 40 F1 21 38 0C       $  ANS028:82 40 F1 21 38 0C
  $  REQ029:82 40 F1 21 35 09       $  ANS029:82 40 F1 21 35 09
  $  REQ030:82 40 F1 21 34 08       $  ANS030:82 40 F1 21 34 08
  $  REQ031:82 40 F1 21 41 15       $  ANS031:82 40 F1 21 41 15
  $  REQ032:82 40 F1 21 0C E0       $  ANS032:82 40 F1 21 0C E0
  $  REQ033:82 40 F1 21 09 DD       $  ANS033:82 40 F1 21 09 DD
  $  REQ034:82 40 F1 21 04 D8       $  ANS034:82 40 F1 21 04 D8
  $  REQ035:82 40 F1 21 03 D7       $  ANS035:82 40 F1 21 03 D7
  $  REQ036:82 40 F1 21 90 64       $  ANS036:82 40 F1 21 90 64
  $  REQ037:82 40 F1 21 07 DB       $  ANS037:82 40 F1 21 07 DB
  $  REQ038:83 40 F1 30 0A 01 EF       $  ANS038:83 40 F1 30 0A 01 EF
  $  REQ039:82 40 F1 21 22 F6       $  ANS039:82 40 F1 21 22 F6
  $  REQ040:83 40 F1 30 0D 01 F2       $  ANS040:83 40 F1 30 0D 01 F2
  $  REQ041:83 40 F1 30 03 01 E8       $  ANS041:83 40 F1 30 03 01 E8

  $  000.驾驶门钥匙解锁                   $    $           $    $  ANS000.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  001.尾门开关                         $    $           $    $  ANS000.BYTE007  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  002.左滑门状态                       $    $           $    $  ANS000.BYTE007  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  003.中控锁解锁开关                   $    $           $    $  ANS000.BYTE007  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  004.驾驶员门钥匙锁止                 $    $           $    $  ANS000.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  005.驾驶员门开关                     $    $           $    $  ANS000.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  006.前乘员门开关                     $    $           $    $  ANS000.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  007.右滑门状态                       $    $           $    $  ANS000.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  008.中控锁闭锁开关                   $    $           $    $  ANS000.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  009.车门解锁继电器输出               $    $           $    $  ANS001.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  010.车门上锁继电器输出               $    $           $    $  ANS001.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  011.尾门锁闭锁继电器输出             $    $           $    $  ANS001.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  012.尾门锁解锁继电器输出             $    $           $    $  ANS001.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  013.使能车辆行驶自动落锁配置         $    $           $    $  ANS002.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@00db;else y=@01a9;
  $  014.日间行车灯配置(出口)             $    $           $    $  ANS003.BYTE005  $  if(x==0x00)y=@00db;else if(x==0x01)y=@0be3;else if(x==0x02)y=@0be4;else y=@01a9;
  $  015.紧急灯(校车)                     $    $           $    $  ANS004.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@00db;else y=@01a9;
  $  016.尾门开报警配置(校车)             $    $           $    $  ANS005.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@00db;else y=@01a9;
  $  017.除霜加热配置                     $    $           $    $  ANS006.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@00db;else y=@01a9;
  $  018.后顶棚阅读配置                   $    $           $    $  ANS007.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@00db;else y=@01a9;
  $  019.使能滑门开启警告配置             $    $           $    $  ANS008.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@00db;else y=@01a9;
  $  020.发动机/电机状态(来自CAN)         $    $  Hz       $    $  ANS009.BYTE006  $  y=(x1*256+x2);
  $  021.前雾灯配置                       $    $           $    $  ANS010.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@00db;else y=@01a9;
  $  022.除霜加热器最大工作时间           $    $  min      $    $  ANS011.BYTE005  $  y=x+5;
  $  023.防盗锁定或未锁定                 $    $           $    $  ANS012.BYTE005  $  if((x&0x80)==0x80)y=@0055;else y=@0404;
  $  024.PIN码是否写入                    $    $           $    $  ANS012.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@02ac;
  $  025.SK是否写入                       $    $           $    $  ANS012.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@02ac;
  $  026.钥匙识别8                        $    $           $    $  ANS013.BYTE005  $  if((x&0x80)==0x80)y=@00ca;else y=@00c9;
  $  027.钥匙识别7                        $    $           $    $  ANS013.BYTE005  $  if((x&0x40)==0x40)y=@00ca;else y=@00c9;
  $  028.钥匙识别6                        $    $           $    $  ANS013.BYTE005  $  if((x&0x20)==0x20)y=@00ca;else y=@00c9;
  $  029.钥匙识别5                        $    $           $    $  ANS013.BYTE005  $  if((x&0x10)==0x10)y=@00ca;else y=@00c9;
  $  030.钥匙识别4                        $    $           $    $  ANS013.BYTE005  $  if((x&0x08)==0x08)y=@00ca;else y=@00c9;
  $  031.钥匙识别3                        $    $           $    $  ANS013.BYTE005  $  if((x&0x04)==0x04)y=@00ca;else y=@00c9;
  $  032.钥匙识别2                        $    $           $    $  ANS013.BYTE005  $  if((x&0x02)==0x02)y=@00ca;else y=@00c9;
  $  033.钥匙识别1                        $    $           $    $  ANS013.BYTE005  $  if((x&0x01)==0x01)y=@00ca;else y=@00c9;
  $  034.紧急灯开关(校车)                 $    $           $    $  ANS014.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  035.左转向灯开关                     $    $           $    $  ANS014.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  036.紧急警告灯开关                   $    $           $    $  ANS014.BYTE007  $  if((x&0x80)==0x80)y=@0028;else y=@000f;
  $  037.后雾灯开关                       $    $           $    $  ANS014.BYTE007  $  if((x&0x40)==0x40)y=@0028;else y=@000f;
  $  038.近光灯开关                       $    $           $    $  ANS014.BYTE007  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  039.位置灯开关                       $    $           $    $  ANS014.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  040.右转向灯开关                     $    $           $    $  ANS014.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  041.远光灯开关                       $    $           $    $  ANS014.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  042.前雾灯开关                       $    $           $    $  ANS014.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  043.后车内灯开关                     $    $           $    $  ANS014.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  044.日间行驶灯继电器线圈(出口)       $    $           $    $  ANS015.BYTE006  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  045.前雾灯继电器线圈                 $    $           $    $  ANS015.BYTE006  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  046.远光灯继电器线圈                 $    $           $    $  ANS015.BYTE006  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  047.防盗指示灯                       $    $           $    $  ANS015.BYTE006  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  048.位置灯继电器线圈                 $    $           $    $  ANS015.BYTE006  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  049.车门状态指示灯                   $    $           $    $  ANS015.BYTE006  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  050.后车厢灯继电器输出               $    $           $    $  ANS015.BYTE007  $  if((x&0x20)==0x20)y=@0028;else y=@000f;
  $  051.车厢灯输出                       $    $           $    $  ANS015.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  052.左转向灯输出                     $    $           $    $  ANS015.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  053.近光灯继电器输出                 $    $           $    $  ANS015.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  054.后雾灯输出                       $    $           $    $  ANS015.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  055.右转向灯输出                     $    $           $    $  ANS015.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  056.灯泡故障次数                     $    $           $    $  ANS016.BYTE005  $  y=x;
  $  057.出厂模式运行时间                 $    $  s        $    $  ANS017.BYTE005  $  y=x*5;
  $  058.车身控制器状态                   $    $           $    $  ANS018.BYTE005  $  if(x==0x00)y=@023f;else if(x==0x01)y=@0be5;else if(x==0x02)y=@01d2;else if(x==0x03)y=@094c;else y=@01a9;
  $  059.尾门锁马达作用时间               $    $  ms       $    $  ANS019.BYTE005  $  y=x*5+100;
  $  060.门锁马达作用时间                 $    $  ms       $    $  ANS020.BYTE005  $  y=x*5+100;
  $  061.转向灯闪烁频率                   $    $  ms       $    $  ANS021.BYTE005  $  y=x*25+100;
  $  062.尾门配置                         $    $           $    $  ANS022.BYTE005  $  if(x==0x00)y=@00dc;else if(x==0x01)y=@0bdd;else y=@01a9;
  $  063.碰撞信号                         $    $           $    $  ANS023.BYTE006  $  if((x&0x01)==0x01)y=@0125;else y=@000f;
  $  064.后窗/后视镜加热开关              $    $           $    $  ANS023.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  065.点火开关                         $    $           $    $  ANS023.BYTE007  $  if((x&0x08)==0x08)y=@0028;else y=@000f;
  $  066.ACC开关输入                      $    $           $    $  ANS023.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  067.钥匙插入信号                     $    $           $    $  ANS023.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  068.启动开关输入                     $    $           $    $  ANS023.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  069.蜂鸣器报警                       $    $           $    $  ANS024.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  070.报警喇叭控制继电器线圈           $    $           $    $  ANS024.BYTE007  $  if((x&0x04)==0x04)y=@0028;else y=@000f;
  $  071.后窗/后视镜加热继电器线圈        $    $           $    $  ANS024.BYTE007  $  if((x&0x02)==0x02)y=@0028;else y=@000f;
  $  072.前雨刮使能继电器线圈             $    $           $    $  ANS024.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;
  $  073.电压过高阀值                     $    $  V        $    $  ANS025.BYTE005  $  y=x*0.1;
  $  074.判断电压过高的阀值               $    $  V        $    $  ANS026.BYTE005  $  y=x*0.1+16;
  $  075.电源电压                         $    $  V        $    $  ANS027.BYTE006  $  y=(x1*256+x2)*0.0236;
  $  076.遥控钥匙上的按钮数量             $    $           $    $  ANS028.BYTE005  $  if(x==0x00)y=@0bde;else if(x==0x01)y=@0bdf;else y=@01a9;
  $  077.当前遥控器数量                   $    $           $    $  ANS029.BYTE005  $  y=x;
  $  078.匹配的遥控钥匙数量               $    $           $    $  ANS030.BYTE005  $  y=x;
  $  079.后雾灯配置                       $    $           $    $  ANS031.BYTE005  $  if(x==0x00)y=@0be0;else if(x==0x01)y=@0be1;else if(x==0x02)y=@0be2;else y=@01a9;
  $  080.IMMO(防盗系统)功能配置           $    $           $    $  ANS032.BYTE005  $  if((x&0x02)==0x02)y=@00db;else y=@00dc;
  $  081.遥控钥匙功能配置                 $    $           $    $  ANS032.BYTE005  $  if((x&0x01)==0x01)y=@00db;else y=@00dc;
  $  082.车身侧门配置                     $    $           $    $  ANS033.BYTE005  $  if(x==0x00)y=@0be6;else if(x==0x01)y=@0be7;else if(x==0x02)y=@0be8;else if(x==0x03)y=@0be9;else y=@01a9;
  $  083.电压过低阀值                     $    $  V        $    $  ANS034.BYTE005  $  y=x*0.1;
  $  084.判断电压过低的阀值               $    $  V        $    $  ANS035.BYTE005  $  y=x*0.1+9.5;
  $  085.VIN码                            $    $           $    $  ANS036.BYTE005  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $  086.车辆移动阀值                     $    $  min      $    $  ANS037.BYTE005  $  y=x+5;
  $  087.车速                             $    $  km/h     $    $  ANS038.BYTE006  $  y=(x1*256+x2);
  $  088.雨刷开启时间                     $    $  ms       $    $  ANS039.BYTE005  $  y=x*10;
  $  089.雨刮暂停电压                     $    $  V        $    $  ANS040.BYTE006  $  y=(x1*256+x2)*0.0236;
  $  090.前喷水开关输入                   $    $           $    $  ANS041.BYTE007  $  if((x&0x10)==0x10)y=@0028;else y=@000f;
  $  091.前雨刮模式选择开关               $    $           $    $  ANS041.BYTE007  $  if((x&0x01)==0x01)y=@0028;else y=@000f;

;******************************************************************************************************************************************************

