
    车型ID：109b

    模拟：协议模拟-->109b

;******************************************************************************************************************************************************

    通讯线: $~07$~07$~10400

进入命令:

  $~  REQ000:81 11 F1 81 04       $~  ANS000:81 11 F1 81 04

空闲命令:

  $!  REQ000:81 11 F1 3E C1       $!  ANS000:81 11 F1 3E C1

退出命令:

  $@  REQ000:81 11 F1 82 05       $@  ANS000:81 11 F1 82 05


;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:84 11 F1 18 00 FF 00 9D       $#  ANS000:84 11 F1 18 00 FF 00 9D

  帧长控制故障码个数，从$#ANS000.BYTE5$#开始每$#3$#个字节表示一个故障码，前$#2$#表示码号。

  码库:

  $*$*DTC/9a000000_2BYTE


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:83 11 F1 14 FF 00 98       $$  ANS000:83 11 F1 14 FF 00 98

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:82 11 F1 1A 90 2E       $%  ANS000:82 11 F1 1A 90 2E
  $%  REQ001:82 11 F1 1A 91 2F       $%  ANS001:82 11 F1 1A 91 2F
  $%  REQ002:82 11 F1 1A 92 30       $%  ANS002:82 11 F1 1A 92 30
  $%  REQ003:82 11 F1 1A 93 31       $%  ANS003:82 11 F1 1A 93 31
  $%  REQ004:82 11 F1 1A 94 32       $%  ANS004:82 11 F1 1A 94 32
  $%  REQ005:82 11 F1 1A 95 33       $%  ANS005:82 11 F1 1A 95 33
  $%  REQ006:82 11 F1 1A 97 35       $%  ANS006:82 11 F1 1A 97 35
  $%  REQ007:82 11 F1 1A 98 36       $%  ANS007:82 11 F1 1A 98 36
  $%  REQ008:82 11 F1 1A 99 37       $%  ANS008:82 11 F1 1A 99 37

  $%  000:车架号:                $%    $%  ANS000.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17);
  $%  001:控制器总成号:          $%    $%  ANS001.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13);
  $%  002:系统硬件号:            $%    $%  ANS002.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  003:系统硬件版本号:        $%    $%  ANS003.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  004:系统软件版本号:        $%    $%  ANS004.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8);
  $%  005:控制器识别号:          $%    $%  ANS005.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
  $%  006:发动机类型:            $%    $%  ANS006.BYTE005  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15);
  $%  007:维修站代码:            $%    $%  ANS007.BYTE005  $%  ASCII(x1,x2,x3);
  $%  008:服务日期:              $%    $%  ANS008.BYTE005  $%  HEX(x1,x2,x3,x4);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:82 11 F1 21 04 A9       $  ANS000:82 11 F1 21 04 A9
  $  REQ001:82 11 F1 21 81 26       $  ANS001:82 11 F1 21 81 26
  $  REQ002:82 11 F1 21 16 BB       $  ANS002:82 11 F1 21 16 BB
  $  REQ003:82 11 F1 21 14 B9       $  ANS003:82 11 F1 21 14 B9
  $  REQ004:82 11 F1 21 15 BA       $  ANS004:82 11 F1 21 15 BA
  $  REQ005:82 11 F1 21 9A 3F       $  ANS005:82 11 F1 21 9A 3F
  $  REQ006:82 11 F1 21 8A 2F       $  ANS006:82 11 F1 21 8A 2F
  $  REQ007:82 11 F1 21 08 AD       $  ANS007:82 11 F1 21 08 AD
  $  REQ008:82 11 F1 21 84 29       $  ANS008:82 11 F1 21 84 29
  $  REQ009:82 11 F1 21 85 2A       $  ANS009:82 11 F1 21 85 2A
  $  REQ010:82 11 F1 21 02 A7       $  ANS010:82 11 F1 21 02 A7
  $  REQ011:82 11 F1 21 B6 5B       $  ANS011:82 11 F1 21 B6 5B
  $  REQ012:82 11 F1 21 22 C7       $  ANS012:82 11 F1 21 22 C7
  $  REQ013:82 11 F1 21 23 C8       $  ANS013:82 11 F1 21 23 C8
  $  REQ014:82 11 F1 21 21 C6       $  ANS014:82 11 F1 21 21 C6
  $  REQ015:82 11 F1 21 1D C2       $  ANS015:82 11 F1 21 1D C2
  $  REQ016:82 11 F1 21 86 2B       $  ANS016:82 11 F1 21 86 2B
  $  REQ017:82 11 F1 21 68 0D       $  ANS017:82 11 F1 21 68 0D
  $  REQ018:82 11 F1 21 0E B3       $  ANS018:82 11 F1 21 0E B3
  $  REQ019:82 11 F1 21 1C C1       $  ANS019:82 11 F1 21 1C C1
  $  REQ020:82 11 F1 21 1B C0       $  ANS020:82 11 F1 21 1B C0
  $  REQ021:82 11 F1 21 8B 30       $  ANS021:82 11 F1 21 8B 30
  $  REQ022:82 11 F1 21 0F B4       $  ANS022:82 11 F1 21 0F B4
  $  REQ023:82 11 F1 21 8C 31       $  ANS023:82 11 F1 21 8C 31
  $  REQ024:82 11 F1 21 87 2C       $  ANS024:82 11 F1 21 87 2C
  $  REQ025:82 11 F1 21 8E 33       $  ANS025:82 11 F1 21 8E 33
  $  REQ026:82 11 F1 21 8F 34       $  ANS026:82 11 F1 21 8F 34
  $  REQ027:82 11 F1 21 89 2E       $  ANS027:82 11 F1 21 89 2E
  $  REQ028:82 11 F1 21 3E E3       $  ANS028:82 11 F1 21 3E E3
  $  REQ029:82 11 F1 21 3F E4       $  ANS029:82 11 F1 21 3F E4
  $  REQ030:82 11 F1 21 40 E5       $  ANS030:82 11 F1 21 40 E5
  $  REQ031:82 11 F1 21 41 E6       $  ANS031:82 11 F1 21 41 E6
  $  REQ032:82 11 F1 21 42 E7       $  ANS032:82 11 F1 21 42 E7
  $  REQ033:82 11 F1 21 43 E8       $  ANS033:82 11 F1 21 43 E8
  $  REQ034:82 11 F1 21 44 E9       $  ANS034:82 11 F1 21 44 E9
  $  REQ035:82 11 F1 21 45 EA       $  ANS035:82 11 F1 21 45 EA
  $  REQ036:82 11 F1 21 46 EB       $  ANS036:82 11 F1 21 46 EB
  $  REQ037:82 11 F1 21 47 EC       $  ANS037:82 11 F1 21 47 EC
  $  REQ038:82 11 F1 21 48 ED       $  ANS038:82 11 F1 21 48 ED
  $  REQ039:82 11 F1 21 49 EE       $  ANS039:82 11 F1 21 49 EE
  $  REQ040:82 11 F1 21 4A EF       $  ANS040:82 11 F1 21 4A EF
  $  REQ041:82 11 F1 21 4B F0       $  ANS041:82 11 F1 21 4B F0
  $  REQ042:82 11 F1 21 4C F1       $  ANS042:82 11 F1 21 4C F1
  $  REQ043:82 11 F1 21 4D F2       $  ANS043:82 11 F1 21 4D F2
  $  REQ044:82 11 F1 21 4E F3       $  ANS044:82 11 F1 21 4E F3
  $  REQ045:82 11 F1 21 4F F4       $  ANS045:82 11 F1 21 4F F4
  $  REQ046:82 11 F1 21 50 F5       $  ANS046:82 11 F1 21 50 F5
  $  REQ047:82 11 F1 21 51 F6       $  ANS047:82 11 F1 21 51 F6
  $  REQ048:82 11 F1 21 52 F7       $  ANS048:82 11 F1 21 52 F7
  $  REQ049:82 11 F1 21 53 F8       $  ANS049:82 11 F1 21 53 F8
  $  REQ050:82 11 F1 21 54 F9       $  ANS050:82 11 F1 21 54 F9
  $  REQ051:82 11 F1 21 B4 59       $  ANS051:82 11 F1 21 B4 59
  $  REQ052:82 11 F1 21 17 BC       $  ANS052:82 11 F1 21 17 BC
  $  REQ053:82 11 F1 21 18 BD       $  ANS053:82 11 F1 21 18 BD
  $  REQ054:82 11 F1 21 8D 32       $  ANS054:82 11 F1 21 8D 32
  $  REQ055:82 11 F1 21 01 A6       $  ANS055:82 11 F1 21 01 A6
  $  REQ056:82 11 F1 21 59 FE       $  ANS056:82 11 F1 21 59 FE
  $  REQ057:82 11 F1 21 90 35       $  ANS057:82 11 F1 21 90 35
  $  REQ058:82 11 F1 21 0D B2       $  ANS058:82 11 F1 21 0D B2
  $  REQ059:82 11 F1 21 97 3C       $  ANS059:82 11 F1 21 97 3C
  $  REQ060:82 11 F1 21 5A FF       $  ANS060:82 11 F1 21 5A FF
  $  REQ061:82 11 F1 21 B5 5A       $  ANS061:82 11 F1 21 B5 5A
  $  REQ062:82 11 F1 21 12 B7       $  ANS062:82 11 F1 21 12 B7
  $  REQ063:82 11 F1 21 13 B8       $  ANS063:82 11 F1 21 13 B8
  $  REQ064:82 11 F1 21 1E C3       $  ANS064:82 11 F1 21 1E C3
  $  REQ065:82 11 F1 21 24 C9       $  ANS065:82 11 F1 21 24 C9
  $  REQ066:82 11 F1 21 25 CA       $  ANS066:82 11 F1 21 25 CA
  $  REQ067:82 11 F1 21 26 CB       $  ANS067:82 11 F1 21 26 CB
  $  REQ068:82 11 F1 21 27 CC       $  ANS068:82 11 F1 21 27 CC
  $  REQ069:82 11 F1 21 7E 23       $  ANS069:82 11 F1 21 7E 23
  $  REQ070:82 11 F1 21 7C 21       $  ANS070:82 11 F1 21 7C 21
  $  REQ071:82 11 F1 21 7D 22       $  ANS071:82 11 F1 21 7D 22
  $  REQ072:82 11 F1 21 7B 20       $  ANS072:82 11 F1 21 7B 20
  $  REQ073:82 11 F1 21 2A CF       $  ANS073:82 11 F1 21 2A CF
  $  REQ074:82 11 F1 21 2B D0       $  ANS074:82 11 F1 21 2B D0
  $  REQ075:82 11 F1 21 2C D1       $  ANS075:82 11 F1 21 2C D1
  $  REQ076:82 11 F1 21 2D D2       $  ANS076:82 11 F1 21 2D D2
  $  REQ077:82 11 F1 21 78 1D       $  ANS077:82 11 F1 21 78 1D
  $  REQ078:82 11 F1 21 35 DA       $  ANS078:82 11 F1 21 35 DA
  $  REQ079:82 11 F1 21 7A 1F       $  ANS079:82 11 F1 21 7A 1F
  $  REQ080:82 11 F1 21 6C 11       $  ANS080:82 11 F1 21 6C 11
  $  REQ081:82 11 F1 21 6D 12       $  ANS081:82 11 F1 21 6D 12
  $  REQ082:82 11 F1 21 6E 13       $  ANS082:82 11 F1 21 6E 13
  $  REQ083:82 11 F1 21 6F 14       $  ANS083:82 11 F1 21 6F 14
  $  REQ084:82 11 F1 21 72 17       $  ANS084:82 11 F1 21 72 17
  $  REQ085:82 11 F1 21 73 18       $  ANS085:82 11 F1 21 73 18
  $  REQ086:82 11 F1 21 74 19       $  ANS086:82 11 F1 21 74 19
  $  REQ087:82 11 F1 21 75 1A       $  ANS087:82 11 F1 21 75 1A
  $  REQ088:82 11 F1 21 79 1E       $  ANS088:82 11 F1 21 79 1E
  $  REQ089:82 11 F1 21 D9 7E       $  ANS089:82 11 F1 21 D9 7E
  $  REQ090:82 11 F1 21 B7 5C       $  ANS090:82 11 F1 21 B7 5C
  $  REQ091:82 11 F1 21 B8 5D       $  ANS091:82 11 F1 21 B8 5D
  $  REQ092:82 11 F1 21 B9 5E       $  ANS092:82 11 F1 21 B9 5E
  $  REQ093:82 11 F1 21 BA 5F       $  ANS093:82 11 F1 21 BA 5F
  $  REQ094:82 11 F1 21 BD 62       $  ANS094:82 11 F1 21 BD 62
  $  REQ095:82 11 F1 21 BE 63       $  ANS095:82 11 F1 21 BE 63
  $  REQ096:82 11 F1 21 BF 64       $  ANS096:82 11 F1 21 BF 64
  $  REQ097:82 11 F1 21 C0 65       $  ANS097:82 11 F1 21 C0 65
  $  REQ098:82 11 F1 21 C3 68       $  ANS098:82 11 F1 21 C3 68
  $  REQ099:82 11 F1 21 C4 69       $  ANS099:82 11 F1 21 C4 69
  $  REQ100:82 11 F1 21 C5 6A       $  ANS100:82 11 F1 21 C5 6A
  $  REQ101:82 11 F1 21 C6 6B       $  ANS101:82 11 F1 21 C6 6B
  $  REQ102:82 11 F1 21 C9 6E       $  ANS102:82 11 F1 21 C9 6E
  $  REQ103:82 11 F1 21 CA 6F       $  ANS103:82 11 F1 21 CA 6F
  $  REQ104:82 11 F1 21 CB 70       $  ANS104:82 11 F1 21 CB 70
  $  REQ105:82 11 F1 21 CC 71       $  ANS105:82 11 F1 21 CC 71
  $  REQ106:82 11 F1 21 CF 74       $  ANS106:82 11 F1 21 CF 74
  $  REQ107:82 11 F1 21 D0 75       $  ANS107:82 11 F1 21 D0 75
  $  REQ108:82 11 F1 21 D1 76       $  ANS108:82 11 F1 21 D1 76
  $  REQ109:82 11 F1 21 D2 77       $  ANS109:82 11 F1 21 D2 77
  $  REQ110:82 11 F1 21 D5 7A       $  ANS110:82 11 F1 21 D5 7A
  $  REQ111:82 11 F1 21 D6 7B       $  ANS111:82 11 F1 21 D6 7B
  $  REQ112:82 11 F1 21 D7 7C       $  ANS112:82 11 F1 21 D7 7C
  $  REQ113:82 11 F1 21 D8 7D       $  ANS113:82 11 F1 21 D8 7D
  $  REQ114:82 11 F1 21 56 FB       $  ANS114:82 11 F1 21 56 FB
  $  REQ115:82 11 F1 21 5C 01       $  ANS115:82 11 F1 21 5C 01
  $  REQ116:82 11 F1 21 07 AC       $  ANS116:82 11 F1 21 07 AC
  $  REQ117:82 11 F1 21 20 C5       $  ANS117:82 11 F1 21 20 C5
  $  REQ118:82 11 F1 21 6B 10       $  ANS118:82 11 F1 21 6B 10
  $  REQ119:82 11 F1 21 9C 41       $  ANS119:82 11 F1 21 9C 41
  $  REQ120:82 11 F1 21 62 07       $  ANS120:82 11 F1 21 62 07
  $  REQ121:82 11 F1 21 3C E1       $  ANS121:82 11 F1 21 3C E1
  $  REQ122:82 11 F1 21 3A DF       $  ANS122:82 11 F1 21 3A DF
  $  REQ123:82 11 F1 21 3B E0       $  ANS123:82 11 F1 21 3B E0
  $  REQ124:82 11 F1 21 3D E2       $  ANS124:82 11 F1 21 3D E2
  $  REQ125:82 11 F1 21 80 25       $  ANS125:82 11 F1 21 80 25
  $  REQ126:82 11 F1 21 9E 43       $  ANS126:82 11 F1 21 9E 43
  $  REQ127:82 11 F1 21 A0 45       $  ANS127:82 11 F1 21 A0 45
  $  REQ128:82 11 F1 21 9F 44       $  ANS128:82 11 F1 21 9F 44
  $  REQ129:82 11 F1 21 B0 55       $  ANS129:82 11 F1 21 B0 55
  $  REQ130:82 11 F1 21 E0 85       $  ANS130:82 11 F1 21 E0 85
  $  REQ131:82 11 F1 21 63 08       $  ANS131:82 11 F1 21 63 08
  $  REQ132:82 11 F1 21 11 B6       $  ANS132:82 11 F1 21 11 B6
  $  REQ133:82 11 F1 21 66 0B       $  ANS133:82 11 F1 21 66 0B
  $  REQ134:82 11 F1 21 03 A8       $  ANS134:82 11 F1 21 03 A8
  $  REQ135:82 11 F1 21 67 0C       $  ANS135:82 11 F1 21 67 0C
  $  REQ136:82 11 F1 21 60 05       $  ANS136:82 11 F1 21 60 05
  $  REQ137:82 11 F1 21 5F 04       $  ANS137:82 11 F1 21 5F 04
  $  REQ138:82 11 F1 21 64 09       $  ANS138:82 11 F1 21 64 09
  $  REQ139:82 11 F1 21 65 0A       $  ANS139:82 11 F1 21 65 0A
  $  REQ140:82 11 F1 21 31 D6       $  ANS140:82 11 F1 21 31 D6
  $  REQ141:82 11 F1 21 32 D7       $  ANS141:82 11 F1 21 32 D7
  $  REQ142:82 11 F1 21 33 D8       $  ANS142:82 11 F1 21 33 D8
  $  REQ143:82 11 F1 21 34 D9       $  ANS143:82 11 F1 21 34 D9
  $  REQ144:82 11 F1 21 30 D5       $  ANS144:82 11 F1 21 30 D5
  $  REQ145:82 11 F1 21 1A BF       $  ANS145:82 11 F1 21 1A BF
  $  REQ146:82 11 F1 21 6A 0F       $  ANS146:82 11 F1 21 6A 0F
  $  REQ147:82 11 F1 21 B2 57       $  ANS147:82 11 F1 21 B2 57
  $  REQ148:82 11 F1 21 10 B5       $  ANS148:82 11 F1 21 10 B5
  $  REQ149:82 11 F1 21 B3 58       $  ANS149:82 11 F1 21 B3 58
  $  REQ150:82 11 F1 21 98 3D       $  ANS150:82 11 F1 21 98 3D
  $  REQ151:82 11 F1 21 99 3E       $  ANS151:82 11 F1 21 99 3E
  $  REQ152:82 11 F1 21 0B B0       $  ANS152:82 11 F1 21 0B B0
  $  REQ153:82 11 F1 21 58 FD       $  ANS153:82 11 F1 21 58 FD
  $  REQ154:82 11 F1 21 0A AF       $  ANS154:82 11 F1 21 0A AF
  $  REQ155:82 11 F1 21 5D 02       $  ANS155:82 11 F1 21 5D 02
  $  REQ156:82 11 F1 21 1F C4       $  ANS156:82 11 F1 21 1F C4
  $  REQ157:82 11 F1 21 69 0E       $  ANS157:82 11 F1 21 69 0E

  $  000.空调压缩机状态                                                          $    $                  $    $  ANS000.BYTE005  $  if((x1&0xFF)==0x00) y=@0fba; else if((x1&0xFF)==0x01) y=@0fbb; else y=@075a;
  $  001.空气流量信号原始值（非AMT车型）                                         $    $                  $    $  ANS001.BYTE005  $  if(x1<0x80) y=(x1*256*256*256+x2*256*256+x3*256+x4)*1.96078;else y=(x1*256*256*256+x2*256*256+x3*256+x4-256*256*256*256)*1.96078;
  $  002.空气流量信号原始值（AMT车型）                                           $    $                  $    $  ANS001.BYTE005  $  if(x1<0x80) y=(x1*256*256*256+x2*256*256+x3*256+x4)*1.96078;else y=(x1*256*256*256+x2*256*256+x3*256+x4-256*256*256*256)*1.96078;
  $  003.加速踏板位置未过滤值                                                    $    $  %               $    $  ANS002.BYTE005  $  y=x1*0.3922;
  $  004.加速踏板1电压信号                                                       $    $  mV              $    $  ANS003.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  005.加速踏板2电压信号                                                       $    $  mV              $    $  ANS004.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  006.加速踏板轮边扭矩请求                                                    $    $  N.m             $    $  ANS005.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0534-500.0228;else y=(x1*256+x2-65536)*0.0534-500.0228;
  $  007.当前曲轴扭矩                                                            $    $  N.m             $    $  ANS006.BYTE005  $  if(x1<0x80) y=x1*11.7659;else y=(x1-256)*11.7659;
  $  008.进气量偏差 空气量控制状态                                               $    $  nH              $    $  ANS007.BYTE005  $  if(x1<0x80) y=x1*11.7659-1000.1005;else y=(x1-256)*11.7659-1000.1005;
  $  009.空气量控制状态                                                          $    $                  $    $  ANS008.BYTE005  $  if((x1&0xFF)==0x00) y=@084e; else if((x1&0xFF)==0x01) y=@0fbd; else if((x1&0xFF)==0x02) y=@0f3d; else if((x1&0xFF)==0x03) y=@0850; else if((x1&0xFF)==0x04) y=@080d; else if((x1&0xFF)==0x05) y=@0fbe; else if((x1&0xFF)==0x06) y=@0fb9; else if((x1&0xFF)==0x07) y=@0fbf; else if((x1&0xFF)==0x08) y=@0847; else if((x1&0xFF)==0x09) y=@0853; else if((x1&0xFF)==0x0A) y=@0854; else if((x1&0xFF)==0x0B) y=@0855; else if((x1&0xFF)==0x0C) y=@0fc0; else if((x1&0xFF)==0x0D) y=@0857; else if((x1&0xFF)==0x0E) y=@0858; else if((x1&0xFF)==0x0F) y=@0859; else if((x1&0xFF)==0x10) y=@085a; else if((x1&0xFF)==0x11) y=@085b; else if((x1&0xFF)==0x12) y=@085c; else if((x1&0xFF)==0x13) y=@085d; else if((x1&0xFF)==0x14) y=@085e; else if((x1&0xFF)==0x15) y=@0fc1; else if((x1&0xFF)==0x16) y=@0860; else if((x1&0xFF)==0x17) y=@0861; else y=@075a;
  $  010.增压压力（非AMT车型）                                                   $    $  hPa             $    $  ANS009.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  011.增压压力（AMT车型）                                                     $    $  hPa             $    $  ANS009.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  012.增压中冷器下游压力（老hex的MT车型）                                     $    $  hPa             $    $  ANS009.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  013.增压中冷器下游压力（AMT/新hex的MT车型）                                 $    $  hPa             $    $  ANS009.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  014.增压压力传感器（非AMT车型）                                             $    $  hPa             $    $  ANS010.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  015.增压压力传感器（AMT车型）                                               $    $  hPa             $    $  ANS010.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  016.增压中冷器下游压力来自传感器（老hex的MT车型）                           $    $  hPa             $    $  ANS010.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  017.增压中冷器下游压力来自传感器（AMT/新hex的MT车型）                       $    $  hPa             $    $  ANS010.BYTE005  $  if(x1<0x80) y=x1*19.6098;else y=(x1-256)*19.6098;
  $  018.进气温度                                                                $    $  degree C        $    $  ANS011.BYTE005  $  if(x1<0x80) y=x1*0.9999-40.1542;else y=(x1-256)*0.9999-40.1542;
  $  019.增压中冷器下游温度                                                      $    $  degree C        $    $  ANS012.BYTE005  $  if(x1<0x80) y=x1*0.9999-40.1542;else y=(x1-256)*0.9999-40.1542;
  $  020.增压中冷器下游压力传感器电压                                            $    $  mV              $    $  ANS013.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  021.增压中冷器下游温度传感器电压                                            $    $  mV              $    $  ANS014.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  022.电池电压                                                                $    $  mV              $    $  ANS015.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.5341;else y=(x1*256+x2-65536)*0.5341;
  $  023.主刹车开关状态                                                          $    $                  $    $  ANS016.BYTE005  $  if((x1&0xFF)==0x00) y=@0949; else if((x1&0xFF)==0x01) y=@0f3b; else y=@075a;
  $  024.主刹车状态信号                                                          $    $                  $    $  ANS017.BYTE005  $  if((x1&0xFF)==0x00) y=@0fc2; else if((x1&0xFF)==0x01) y=@0fc3; else y=@075a;
  $  025.副刹车状态信号                                                          $    $                  $    $  ANS018.BYTE005  $  if((x1&0xFF)==0x00) y=@0fc4; else if((x1&0xFF)==0x01) y=@0fc5; else y=@075a;
  $  026.冷却水温度                                                              $    $  degree C        $    $  ANS019.BYTE005  $  if(x1<0x80) y=x1*0.9999-40.1542;else y=(x1-256)*0.9999-40.1542;
  $  027.冷却水温度传感器电压                                                    $    $  mV              $    $  ANS020.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  028.离合器状态信号                                                          $    $                  $    $  ANS021.BYTE005  $  if((x1&0xFF)==0x00) y=@0fbc; else if((x1&0xFF)==0x01) y=@0805; else y=@075a;
  $  029.离合器状态信号                                                          $    $                  $    $  ANS022.BYTE005  $  if((x1&0xFF)==0x00) y=@0fc2; else if((x1&0xFF)==0x01) y=@0fc3; else y=@075a;
  $  030.当前实际扭矩比当前最大扭矩比                                            $    $  %               $    $  ANS023.BYTE005  $  y=x1*0.3922;
  $  031.发动机状态                                                              $    $                  $    $  ANS024.BYTE005  $  if((x1&0xFF)==0x00) y=@07f5; else if((x1&0xFF)==0x01) y=@07f6; else if((x1&0xFF)==0x02) y=@07f7; else if((x1&0xFF)==0x03) y=@07f8; else if((x1&0xFF)==0x04) y=@07f9; else if((x1&0xFF)==0x05) y=@07f5; else y=@075a;
  $  032.废气再循环阀位置                                                        $    $                  $    $  ANS025.BYTE005  $  y=x1*0.3922;
  $  033.废气再循环阀位置传感器电压                                              $    $                  $    $  ANS026.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  034.驱动模块诊断释放状态:电池电压校正系数不等于1                            $    $                  $    $  ANS027.BYTE005  $  if((x1&0x20)==0x00) y=@00c9; else y=@00ca;
  $  035.驱动模块诊断释放状态:禁止功率级及功率级诊断                             $    $                  $    $  ANS027.BYTE005  $  if((x1&0x10)==0x00) y=@00c9; else y=@00ca;
  $  036.驱动模块诊断释放状态: 电池出现高电压                                    $    $                  $    $  ANS027.BYTE005  $  if((x1&0x08)==0x00) y=@00c9; else y=@00ca;
  $  037.驱动模块诊断释放状态:电池出现低电压                                     $    $                  $    $  ANS027.BYTE005  $  if((x1&0x04)==0x00) y=@00c9; else y=@00ca;
  $  038.驱动模块诊断释放状态:ecu处于后驱动状态                                  $    $                  $    $  ANS027.BYTE005  $  if((x1&0x02)==0x00) y=@00c9; else y=@00ca;
  $  039.驱动模块诊断释放状态:ecu处于预驱动状态                                  $    $                  $    $  ANS027.BYTE005  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  040.驱动模块诊断释放状态:MoCSop 被激活                                      $    $                  $    $  ANS027.BYTE006  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  041.在轨压设定点1,小油量加电时间学习次数                                    $    $                  $    $  ANS028.BYTE005  $  y=(x1*256+x2);
  $  042.在轨压设定点2,小油量加电时间学习次数                                    $    $                  $    $  ANS029.BYTE005  $  y=(x1*256+x2);
  $  043.在轨压设定点3,小油量加电时间学习次数                                    $    $                  $    $  ANS030.BYTE005  $  y=(x1*256+x2);
  $  044.在轨压设定点1,发火顺序1缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS031.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  045.在轨压设定点1,发火顺序2缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS032.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  046.在轨压设定点1,发火顺序3缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS033.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  047.在轨压设定点1,发火顺序4缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS034.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  048.在轨压设定点1,发火顺序5缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS035.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  049.在轨压设定点1,发火顺序6缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS036.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  050.在轨压设定点2,发火顺序1缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS037.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  051.在轨压设定点2,发火顺序2缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS038.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  052.在轨压设定点2,发火顺序3缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS039.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  053.在轨压设定点2,发火顺序4缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS040.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  054.在轨压设定点2,发火顺序5缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS041.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  055.在轨压设定点2,发火顺序6缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS042.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  056.在轨压设定点3,发火顺序1缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS043.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  057.在轨压设定点3,发火顺序2缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS044.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  058.在轨压设定点3,发火顺序3缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS045.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  059.在轨压设定点3,发火顺序4缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS046.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  060.在轨压设定点3,发火顺序5缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS047.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  061.在轨压设定点3,发火顺序6缸对应的小油量加电时间偏差                       $    $  微秒            $    $  ANS048.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0153;else y=(x1*256+x2-65536)*0.0153;
  $  062.ZFC加电时间标定修正状态                                                 $    $                  $    $  ANS049.BYTE005  $  y=x1;
  $  063.ZFC加电时间标定修正释放状态                                             $    $                  $    $  ANS050.BYTE005  $  y=x1;
  $  064.发动机运行时间                                                          $    $  秒              $    $  ANS051.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  065.环境压力（非AMT车型）                                                   $    $  hPa             $    $  ANS052.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  066.环境压力（AMT车型）                                                     $    $  hPa             $    $  ANS052.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  067.环境压力（老hex的MT车型）                                               $    $  hPa             $    $  ANS052.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  068.环境压力（AMT/新hex的MT车型）                                           $    $  hPa             $    $  ANS052.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  069.环境压力传感器电压                                                      $    $  mV              $    $  ANS053.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  070.环境温度                                                                $    $  degree C        $    $  ANS054.BYTE005  $  if(x1<0x80) y=x1*0.9999-40.1542;else y=(x1-256)*0.9999-40.1542;
  $  071.发动机转速                                                              $    $  rpm             $    $  ANS055.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  072.发动机同步状态                                                          $    $                  $    $  ANS056.BYTE005  $  y=x1;
  $  073.油水传感器状态                                                          $    $                  $    $  ANS057.BYTE005  $  if((x1&0xFF)==0x00) y=@0fb5; else if((x1&0xFF)==0x01) y=@0fb6; else y=@075a;
  $  074.燃油温度                                                                $    $  degree C        $    $  ANS058.BYTE005  $  if(x1<0x80) y=x1*0.9999-40.1542;else y=(x1-256)*0.9999-40.1542;
  $  075.燃油温度（来自传感器）                                                  $    $  degree C        $    $  ANS059.BYTE005  $  if(x1<0x80) y=x1*0.9999-40.1542;else y=(x1-256)*0.9999-40.1542;
  $  076.燃油温度传感器电压                                                      $    $  mV              $    $  ANS060.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  077.车辆行驶里程                                                            $    $  m               $    $  ANS061.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  078.预热灯状态                                                              $    $                  $    $  ANS062.BYTE005  $  if((x1&0xFF)==0x00) y=@0265; else if((x1&0xFF)==0x01) y=@0264; else y=@075a;
  $  079.预热塞激活状态                                                          $    $                  $    $  ANS063.BYTE005  $  if((x1&0xFF)==0x00) y=@0803; else if((x1&0xFF)==0x01) y=@0802; else y=@075a;
  $  080.低怠速设定值                                                            $    $  rpm             $    $  ANS064.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  081.发火顺序1缸对应的发动机转速                                             $    $  rpm             $    $  ANS065.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  082.发火顺序2缸对应的发动机转速                                             $    $  rpm             $    $  ANS066.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  083.发火顺序3缸对应的发动机转速                                             $    $  rpm             $    $  ANS067.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  084.发火顺序4缸对应的发动机转速                                             $    $  rpm             $    $  ANS068.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  085.减速阶段末尾发动机转速                                                  $    $  rpm             $    $  ANS069.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  086.加速阶段末尾发动机转速                                                  $    $  rpm             $    $  ANS070.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  087.减速阶段起始发动机转速                                                  $    $  rpm             $    $  ANS071.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  088.加速阶段起始发动机转速                                                  $    $  rpm             $    $  ANS072.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.0916;else y=(x1*256+x2-65536)*0.0916;
  $  089.发火顺序1缸对应的FBC修正油量（老hex的MT车型）                           $    $  毫克/每冲程     $    $  ANS073.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  090.发火顺序2缸对应的FBC修正油量（老hex的MT车型）                           $    $  毫克/每冲程     $    $  ANS074.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  091.发火顺序3缸对应的FBC修正油量（老hex的MT车型）                           $    $  毫克/每冲程     $    $  ANS075.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  092.发火顺序4缸对应的FBC修正油量（老hex的MT车型）                           $    $  毫克/每冲程     $    $  ANS076.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  093.停止压缩测试状态:电源电压小于压缩测试最小要求 电压                      $    $                  $    $  ANS077.BYTE005  $  if((x1&0x40)==0x00) y=@00c9; else y=@00ca;
  $  094.停止压缩测试状态:压缩测试时间超过最大允许持续 时间                      $    $                  $    $  ANS077.BYTE005  $  if((x1&0x20)==0x00) y=@00c9; else y=@00ca;
  $  095.停止压缩测试状态:发动机转速不为零                                       $    $                  $    $  ANS077.BYTE005  $  if((x1&0x10)==0x00) y=@00c9; else y=@00ca;
  $  096.停止压缩测试状态:车速不为零                                             $    $                  $    $  ANS077.BYTE005  $  if((x1&0x04)==0x00) y=@00c9; else y=@00ca;
  $  097.停止压缩测试状态:Fid_ComprTst_mp 被调用                                 $    $                  $    $  ANS077.BYTE005  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  098.加速测试条件检查 - 催化器再生不应被激活                                 $    $                  $    $  ANS078.BYTE005  $  if((x1&0x80)==0x00) y=@00c9; else y=@00ca;
  $  099.加速测试条件检查 - 测试参数错误                                         $    $                  $    $  ANS078.BYTE005  $  if((x1&0x40)==0x00) y=@00c9; else y=@00ca;
  $  100.加速测试条件检查 - 测试运行超时                                         $    $                  $    $  ANS078.BYTE005  $  if((x1&0x20)==0x00) y=@00c9; else y=@00ca;
  $  101.加速测试条件检查 - 油门踏板被踩下                                       $    $                  $    $  ANS078.BYTE005  $  if((x1&0x10)==0x00) y=@00c9; else y=@00ca;
  $  102.加速测试条件检查 - 刹车信号不为0                                        $    $                  $    $  ANS078.BYTE005  $  if((x1&0x08)==0x00) y=@00c9; else y=@00ca;
  $  103.加速测试条件检查 - 车速不为0                                            $    $                  $    $  ANS078.BYTE005  $  if((x1&0x04)==0x00) y=@00c9; else y=@00ca;
  $  104.加速测试条件检查 - 离合器信号异常                                       $    $                  $    $  ANS078.BYTE005  $  if((x1&0x02)==0x00) y=@00c9; else y=@00ca;
  $  105.加速测试条件检查 - 系统故障存在                                         $    $                  $    $  ANS078.BYTE005  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  106.加速测试条件检查 - 运行时冷却液温度小于最小允许 温度                    $    $                  $    $  ANS078.BYTE006  $  if((x1&0x02)==0x00) y=@00c9; else y=@00ca;
  $  107.加速测试条件检查 - 运行时同步信号丢失的数目大于5                        $    $                  $    $  ANS078.BYTE006  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  108.加速测试中减速阶段时间                                                  $    $                  $    $  ANS079.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  109.发火顺序1缸上止点前压缩时间                                             $    $  微秒            $    $  ANS080.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  110.发火顺序2缸上止点前压缩时间                                             $    $  微秒            $    $  ANS081.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  111.发火顺序3缸上止点前压缩时间                                             $    $  微秒            $    $  ANS082.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  112.发火顺序4缸上止点前压缩时间                                             $    $  微秒            $    $  ANS083.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  113.发火顺序1缸上止点后膨胀时间                                             $    $  微秒            $    $  ANS084.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  114.发火顺序2缸上止点后膨胀时间                                             $    $  微秒            $    $  ANS085.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  115.发火顺序3缸上止点后膨胀时间                                             $    $  微秒            $    $  ANS086.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  116.发火顺序4缸上止点后膨胀时间                                             $    $  微秒            $    $  ANS087.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  117.加速测试中加速阶段时间                                                  $    $  微秒            $    $  ANS088.BYTE005  $  y=UINT(x1*0x1000000+x2*0x10000+x3*0x100+x4);
  $  118.主喷设定油量                                                            $    $  毫克/每冲程     $    $  ANS089.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  119.发火顺序1缸预喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS090.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  120.发火顺序2缸预喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS091.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  121.发火顺序3缸预喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS092.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  122.发火顺序4缸预喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS093.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  123.发火顺序1缸预喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS094.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  124.发火顺序2缸预喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS095.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  125.发火顺序3缸预喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS096.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  126.发火顺序4缸预喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS097.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  127.发火顺序1缸预喷3设定油                                                  $    $  毫克/每冲程     $    $  ANS098.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  128.发火顺序2缸预喷3设定油                                                  $    $  毫克/每冲程     $    $  ANS099.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  129.发火顺序3缸预喷3设定油                                                  $    $  毫克/每冲程     $    $  ANS100.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  130.发火顺序4缸预喷3设定油                                                  $    $  毫克/每冲程     $    $  ANS101.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  131.发火顺序1缸预喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS102.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  132.发火顺序2缸后喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS103.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  133.发火顺序3缸后喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS104.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  134.发火顺序4缸后喷1设定油量                                                $    $  毫克/每冲程     $    $  ANS105.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  135.发火顺序1缸后喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS106.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  136.发火顺序2缸后喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS107.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  137.发火顺序3缸后喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS108.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  138.发火顺序4缸后喷2设定油量                                                $    $  毫克/每冲程     $    $  ANS109.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  139.发火顺序1缸喷射释放状态 - 预喷3                                         $    $                  $    $  ANS110.BYTE005  $  if((x1&0x40)==0x00) y=@0f8d; else y=@0fb4;
  $  140.发火顺序1缸喷射释放状态 - 预喷2                                         $    $                  $    $  ANS110.BYTE005  $  if((x1&0x20)==0x00) y=@0f8d; else y=@0fb4;
  $  141.发火顺序1缸喷射释放状态 - 预喷1                                         $    $                  $    $  ANS110.BYTE005  $  if((x1&0x10)==0x00) y=@0f8d; else y=@0fb4;
  $  142.发火顺序1缸喷射释放状态 - 主喷1                                         $    $                  $    $  ANS110.BYTE005  $  if((x1&0x08)==0x00) y=@0f8d; else y=@0fb4;
  $  143.发火顺序1缸喷射释放状态 - 后喷3                                         $    $                  $    $  ANS110.BYTE005  $  if((x1&0x04)==0x00) y=@0f8d; else y=@0fb4;
  $  144.发火顺序1缸喷射释放状态 - 后喷2                                         $    $                  $    $  ANS110.BYTE005  $  if((x1&0x02)==0x00) y=@0f8d; else y=@0fb4;
  $  145.发火顺序1缸喷射释放状态 - 后喷1                                         $    $                  $    $  ANS110.BYTE005  $  if((x1&0x01)==0x00) y=@0f8d; else y=@0fb4;
  $  146.发火顺序2缸喷射释放状态 - 预喷3                                         $    $                  $    $  ANS111.BYTE005  $  if((x1&0x40)==0x00) y=@0f8d; else y=@0fb4;
  $  147.发火顺序2缸喷射释放状态 - 预喷2                                         $    $                  $    $  ANS111.BYTE005  $  if((x1&0x20)==0x00) y=@0f8d; else y=@0fb4;
  $  148.发火顺序2缸喷射释放状态 - 预喷1                                         $    $                  $    $  ANS111.BYTE005  $  if((x1&0x10)==0x00) y=@0f8d; else y=@0fb4;
  $  149.发火顺序2缸喷射释放状态 - 主喷1                                         $    $                  $    $  ANS111.BYTE005  $  if((x1&0x08)==0x00) y=@0f8d; else y=@0fb4;
  $  150.发火顺序2缸喷射释放状态 - 后喷3                                         $    $                  $    $  ANS111.BYTE005  $  if((x1&0x04)==0x00) y=@0f8d; else y=@0fb4;
  $  151.发火顺序2缸喷射释放状态 - 后喷2                                         $    $                  $    $  ANS111.BYTE005  $  if((x1&0x02)==0x00) y=@0f8d; else y=@0fb4;
  $  152.发火顺序2缸喷射释放状态 - 后喷1                                         $    $                  $    $  ANS111.BYTE005  $  if((x1&0x01)==0x00) y=@0f8d; else y=@0fb4;
  $  153.发火顺序3缸喷射释放状态 - 预喷3                                         $    $                  $    $  ANS112.BYTE005  $  if((x1&0x40)==0x00) y=@0f8d; else y=@0fb4;
  $  154.发火顺序3缸喷射释放状态 - 预喷2                                         $    $                  $    $  ANS112.BYTE005  $  if((x1&0x20)==0x00) y=@0f8d; else y=@0fb4;
  $  155.发火顺序3缸喷射释放状态 - 预喷1                                         $    $                  $    $  ANS112.BYTE005  $  if((x1&0x10)==0x00) y=@0f8d; else y=@0fb4;
  $  156.发火顺序3缸喷射释放状态 - 主喷1                                         $    $                  $    $  ANS112.BYTE005  $  if((x1&0x08)==0x00) y=@0f8d; else y=@0fb4;
  $  157.发火顺序3缸喷射释放状态 - 后喷3                                         $    $                  $    $  ANS112.BYTE005  $  if((x1&0x04)==0x00) y=@0f8d; else y=@0fb4;
  $  158.发火顺序3缸喷射释放状态 - 后喷2                                         $    $                  $    $  ANS112.BYTE005  $  if((x1&0x02)==0x00) y=@0f8d; else y=@0fb4;
  $  159.发火顺序3缸喷射释放状态 - 后喷1                                         $    $                  $    $  ANS112.BYTE005  $  if((x1&0x01)==0x00) y=@0f8d; else y=@0fb4;
  $  160.发火顺序4缸喷射释放状态 - 预喷3                                         $    $                  $    $  ANS113.BYTE005  $  if((x1&0x40)==0x00) y=@0f8d; else y=@0fb4;
  $  161.发火顺序4缸喷射释放状态 - 预喷2                                         $    $                  $    $  ANS113.BYTE005  $  if((x1&0x20)==0x00) y=@0f8d; else y=@0fb4;
  $  162.发火顺序4缸喷射释放状态 - 预喷1                                         $    $                  $    $  ANS113.BYTE005  $  if((x1&0x10)==0x00) y=@0f8d; else y=@0fb4;
  $  163.发火顺序4缸喷射释放状态 - 主喷1                                         $    $                  $    $  ANS113.BYTE005  $  if((x1&0x08)==0x00) y=@0f8d; else y=@0fb4;
  $  164.发火顺序4缸喷射释放状态 - 后喷3                                         $    $                  $    $  ANS113.BYTE005  $  if((x1&0x04)==0x00) y=@0f8d; else y=@0fb4;
  $  165.发火顺序4缸喷射释放状态 - 后喷2                                         $    $                  $    $  ANS113.BYTE005  $  if((x1&0x02)==0x00) y=@0f8d; else y=@0fb4;
  $  166.发火顺序4缸喷射释放状态 - 后喷1                                         $    $                  $    $  ANS113.BYTE005  $  if((x1&0x01)==0x00) y=@0f8d; else y=@0fb4;
  $  167.退出关闭测试的具体原因-发动机转速大于测试最大允许 转速                  $    $                  $    $  ANS114.BYTE005  $  if((x1&0x10)==0x00) y=@00c9; else y=@00ca;
  $  168.退出关闭测试的具体原因-刹车信号不为零,处于刹车状态                      $    $                  $    $  ANS114.BYTE005  $  if((x1&0x08)==0x00) y=@00c9; else y=@00ca;
  $  169.退出关闭测试的具体原因-车速不为零                                       $    $                  $    $  ANS114.BYTE005  $  if((x1&0x04)==0x00) y=@00c9; else y=@00ca;
  $  170.退出关闭测试的具体原因 - 手动档车辆离合器接合或自动档离合器未接合       $    $                  $    $  ANS114.BYTE005  $  if((x1&0x02)==0x00) y=@00c9; else y=@00ca;
  $  171.退出关闭测试的具体原因-Fid_InjCrvShOffTst_mp 被调用                     $    $                  $    $  ANS114.BYTE005  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  172.喷油量设定值                                                            $    $  微秒            $    $  ANS115.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.999;else y=(x1*256+x2-65536)*0.999;
  $  173.当前喷油量                                                              $    $  毫克/每冲程     $    $  ANS116.BYTE005  $  if(x1<0x80) y=x1;else y=x1-256;
  $  174.喷油量设定值                                                            $    $  毫克/每冲程     $    $  ANS117.BYTE005  $  if(x1<0x80) y=x1;else y=x1-256;
  $  175.发动机起动时故障信息- 启动机状态                                        $    $                  $    $  ANS118.BYTE005  $  if((x1&0x20)==0x00) y=@0fb7; else y=@0fb8;
  $  176.发动机起动时故障信息-关闭请求                                           $    $                  $    $  ANS118.BYTE005  $  if((x1&0x08)==0x00) y=@0fb7; else y=@0fb8;
  $  177.发动机起动时故障信息- 发动机同步                                        $    $                  $    $  ANS118.BYTE005  $  if((x1&0x04)==0x00) y=@0fb7; else y=@0fb8;
  $  178.发动机起动时故障信息- 发动机转速足够启动发动机                          $    $                  $    $  ANS118.BYTE005  $  if((x1&0x02)==0x00) y=@0fb7; else y=@0fb8;
  $  179.发动机起动时故障信息- 轨压足够启动发动机                                $    $                  $    $  ANS118.BYTE005  $  if((x1&0x01)==0x00) y=@0fb7; else y=@0fb8;
  $  180.主继电器状态                                                            $    $                  $    $  ANS119.BYTE005  $  if((x1&0xFF)==0x00) y=@0f3c; else if((x1&0xFF)==0x01) y=@09f6; else y=@075a;
  $  181.轨压控制器体积流量设定值                                                $    $                  $    $  ANS120.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  182.滤波后的MeUn实际电流值                                                  $    $  mA              $    $  ANS121.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  183.MeUn电流设定值                                                          $    $  mA              $    $  ANS122.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  184.MeUn占空比                                                              $    $  %               $    $  ANS123.BYTE005  $  if(x1<0x80) y=x1*0.3921;else y=(x1-256)*0.3921;
  $  185.MeUn输入模拟电压值                                                      $    $  mV              $    $  ANS124.BYTE005  $  if(x1<0x80) y=x1*137.2482;else y=(x1-256)*137.2482;
  $  186.模数转换监控状态-不可擦除故障已经发生                                   $    $                  $    $  ANS125.BYTE005  $  if((x1&0x80)==0x00) y=@00c9; else y=@00ca;
  $  187.模数转换监控状态-零负荷测试脉冲过程中的不可擦 除故 障                   $    $                  $    $  ANS125.BYTE005  $  if((x1&0x40)==0x00) y=@00c9; else y=@00ca;
  $  188.模数转换监控状态-比例修正系数监控期间不可擦除 故障                      $    $                  $    $  ANS125.BYTE005  $  if((x1&0x20)==0x00) y=@00c9; else y=@00ca;
  $  189.模数转换监控状态-电压测试检查期间的不可擦除 故障                        $    $                  $    $  ANS125.BYTE005  $  if((x1&0x04)==0x00) y=@00c9; else y=@00ca;
  $  190.模数转换监控状态-NTP 释放                                               $    $                  $    $  ANS125.BYTE005  $  if((x1&0x02)==0x00) y=@00c9; else y=@00ca;
  $  191.模数转换监控状态-NTP 激活                                               $    $                  $    $  ANS125.BYTE005  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  192.增压压力目标值（非AMT车型）                                             $    $  hPa             $    $  ANS126.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  193.增压压力目标值（AMT车型）                                               $    $  hPa             $    $  ANS126.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  194.增压控制偏差值（非AMT车型）                                             $    $  hPa             $    $  ANS127.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  195.增压控制偏差值（AMT车型）                                               $    $  hPa             $    $  ANS127.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*19.6098;else y=(x1*256+x2-65536)*19.6098;
  $  196.增压压力控制器输出                                                      $    $  %               $    $  ANS128.BYTE005  $  if(x1<0x80) y=x1*0.3922;else y=(x1-256)*0.3922;
  $  197.增压系统监控状态                                                        $    $                  $    $  ANS129.BYTE005  $  if((x1&0xFF)==0x00) y=@080b; else if((x1&0xFF)==0x01) y=@0f41; else if((x1&0xFF)==0x02) y=@080d; else if((x1&0xFF)==0x03) y=@085b; else if((x1&0xFF)==0x04) y=@080f; else if((x1&0xFF)==0x05) y=@0fb9; else if((x1&0xFF)==0x06) y=@0f3d; else if((x1&0xFF)==0x07) y=@0811; else if((x1&0xFF)==0x08) y=@085f; else y=@075a;
  $  198.压力控制阀修正系数                                                      $    $                  $    $  ANS130.BYTE005  $  y=(x1*256+x2)*0.0001-2;
  $  199.压力控制阀设定压力                                                      $    $  hPa             $    $  ANS131.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*38.1449-499965.2822;else y=(x1*256+x2-65536)*38.1449-499965.2822;
  $  200.预供泵激活状态                                                          $    $                  $    $  ANS132.BYTE005  $  if((x1&0xFF)==0x01) y=@0265; else if((x1&0xFF)==0x00) y=@0264; else y=@075a;
  $  201.10ms内的最大轨压                                                        $    $  hPa             $    $  ANS133.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*38.1449-499965.2822;else y=(x1*256+x2-65536)*38.1449-499965.2822;
  $  202.轨压                                                                    $    $  hPa             $    $  ANS134.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*38.1449-499965.2822;else y=(x1*256+x2-65536)*38.1449-499965.2822;
  $  203.轨压传感器电压                                                          $    $  mV              $    $  ANS135.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*0.2;else y=(x1*256+x2-65536)*0.2;
  $  204.MeUn压力调节预定值                                                      $    $                  $    $  ANS136.BYTE005  $  if(x1<0x80) y=(x1*256+x2);else y=(x1*256+x2-65536);
  $  205.轨压偏差                                                                $    $  hPa             $    $  ANS137.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*38.1449-499965.2822;else y=(x1*256+x2-65536)*38.1449-499965.2822;
  $  206.轨压设定值                                                              $    $  hPa             $    $  ANS138.BYTE005  $  if(x1<0x80) y=(x1*256+x2)*38.1449-499965.2822;else y=(x1*256+x2-65536)*38.1449-499965.2822;
  $  207.轨压偏差控制状态                                                        $    $                  $    $  ANS139.BYTE005  $  y=x1;
  $  208.高压测试中第1次泄压状态                                                 $    $                  $    $  ANS140.BYTE005  $  if((x1&0xFF)==0x00) y=@043a; else if((x1&0xFF)==0x01) y=@0873; else if((x1&0xFF)==0x02) y=@083e; else y=@075a;
  $  209.高压测试中第2次泄压状态                                                 $    $                  $    $  ANS141.BYTE005  $  if((x1&0xFF)==0x00) y=@083e; else if((x1&0xFF)==0x01) y=@043a; else y=@075a;
  $  210.高压测试中第3次泄压状态                                                 $    $                  $    $  ANS142.BYTE005  $  if((x1&0xFF)==0x02) y=@0fc6; else if((x1&0xFF)==0x04) y=@0fc7; else y=@075a;
  $  211.高压测试条件检查 - 发动机水温过低                                       $    $                  $    $  ANS143.BYTE005  $  if((x1&0x80)==0x00) y=@00c9; else y=@00ca;
  $  212.高压测试条件检查 - 发动机处于非怠速状态                                 $    $                  $    $  ANS143.BYTE005  $  if((x1&0x40)==0x00) y=@00c9; else y=@00ca;
  $  213.高压测试条件检查 - 轨压处于非闭环控制状态                               $    $                  $    $  ANS143.BYTE005  $  if((x1&0x20)==0x00) y=@00c9; else y=@00ca;
  $  214.高压测试条件检查 - 油门踏板被踩下                                       $    $                  $    $  ANS143.BYTE005  $  if((x1&0x10)==0x00) y=@00c9; else y=@00ca;
  $  215.高压测试条件检查 - 刹车信号不为0                                        $    $                  $    $  ANS143.BYTE005  $  if((x1&0x08)==0x00) y=@00c9; else y=@00ca;
  $  216.高压测试条件检查 - 车速不为0                                            $    $                  $    $  ANS143.BYTE005  $  if((x1&0x04)==0x00) y=@00c9; else y=@00ca;
  $  217.高压测试条件检查 - 离合器信号异常                                       $    $                  $    $  ANS143.BYTE005  $  if((x1&0x02)==0x00) y=@00c9; else y=@00ca;
  $  218.高压测试条件检查 - 存在系统故障                                         $    $                  $    $  ANS143.BYTE005  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  219.高压测试条件检查 - 扭矩需求过大（超过电子元器件扭矩消耗限定值）         $    $                  $    $  ANS143.BYTE006  $  if((x1&0x40)==0x00) y=@00c9; else y=@00ca;
  $  220.高压测试条件检查 - 空调压缩机处于工作状态                               $    $                  $    $  ANS143.BYTE006  $  if((x1&0x20)==0x00) y=@00c9; else y=@00ca;
  $  221.高压测试条件检查 - 测试中轨压波动（偏小）                               $    $                  $    $  ANS143.BYTE006  $  if((x1&0x10)==0x00) y=@00c9; else y=@00ca;
  $  222.高压测试条件检查 - 测试中轨压波动（偏大）                               $    $                  $    $  ANS143.BYTE006  $  if((x1&0x08)==0x00) y=@00c9; else y=@00ca;
  $  223.高压测试条件检查 - 测试中转速异常                                       $    $                  $    $  ANS143.BYTE006  $  if((x1&0x04)==0x00) y=@00c9; else y=@00ca;
  $  224.高压测试条件检查 - 测试中喷油量异常                                     $    $                  $    $  ANS143.BYTE006  $  if((x1&0x02)==0x00) y=@00c9; else y=@00ca;
  $  225.高压测试条件检查 - 再生功能不应被激活                                   $    $                  $    $  ANS143.BYTE006  $  if((x1&0x01)==0x00) y=@00c9; else y=@00ca;
  $  226.高压测试中轨压建立状态                                                  $    $                  $    $  ANS144.BYTE005  $  if((x1&0xFF)==0x00) y=@0fc8; else if((x1&0xFF)==0x01) y=@0fc9; else y=@075a;
  $  227.初始化低位信息: 最近一次复位原因ID低字节                                $    $                  $    $  ANS145.BYTE005  $  y=x1;
  $  228.发动机启动扭矩                                                          $    $  N.m             $    $  ANS146.BYTE005  $  y=x1*0.1;
  $  229.点火开关状态信号                                                        $    $                  $    $  ANS147.BYTE005  $  if((x1&0xFF)==0x00) y=@0f46; else if((x1&0xFF)==0x01) y=@0f47; else y=@075a;
  $  230.T15状态                                                                 $    $                  $    $  ANS148.BYTE005  $  if((x1&0xFF)==0x00) y=@0119; else if((x1&0xFF)==0x01) y=@011f; else y=@075a;
  $  231.节流阀占空比                                                            $    $  %               $    $  ANS149.BYTE005  $  y=x1*0.3921;
  $  232.当前挡位                                                                $    $                  $    $  ANS150.BYTE005  $  y=x1;
  $  233.变速箱增加扭矩请求                                                      $    $  N.m             $    $  ANS151.BYTE005  $  if(x1<0x80) y=x1*11.7659;else y=(x1-256)*11.7659;
  $  234.增压器执行器位置                                                        $    $  %               $    $  ANS152.BYTE005  $  if(x1<0x80) y=x1*0.3922;else y=(x1-256)*0.3922;
  $  235.增压执行器占空比                                                        $    $  %               $    $  ANS153.BYTE005  $  if(x1<0x80) y=x1*0.3921;else y=(x1-256)*0.3921;
  $  236.涡流阀位置                                                              $    $  %               $    $  ANS154.BYTE005  $  if(x1<0x80) y=x1*0.3921;else y=(x1-256)*0.3921;
  $  237.涡流阀执行器占空比                                                      $    $  %               $    $  ANS155.BYTE005  $  if(x1<0x80) y=x1*0.3921;else y=(x1-256)*0.3921;
  $  238.车速                                                                    $    $  km/h            $    $  ANS156.BYTE005  $  y=x1;
  $  239.车速（来自传感器）                                                      $    $  km/h            $    $  ANS157.BYTE005  $  y=x1;
  $  240.发火顺序1缸对应的FBC修正油量（AMT/新hex的MT车型）                       $    $  毫克/每冲程     $    $  ANS073.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  241.发火顺序2缸对应的FBC修正油量（AMT/新hex的MT车型）                       $    $  毫克/每冲程     $    $  ANS074.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  242.发火顺序3缸对应的FBC修正油量（AMT/新hex的MT车型）                       $    $  毫克/每冲程     $    $  ANS075.BYTE005  $  y=(x1*256+x2)*0.01-327.67;
  $  243.发火顺序4缸对应的FBC修正油量（AMT/新hex的MT车型）                       $    $  毫克/每冲程     $    $  ANS076.BYTE005  $  y=(x1*256+x2)*0.01-327.67;

;******************************************************************************************************************************************************

