
    车型ID：10b4

    模拟：协议模拟-->10b4

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:748 02 10 01 00 00 00 00 00       $~  ANS000:7C8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:748 02 3E 80 00 00 00 00 00       $!  ANS000:7C8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:748 03 19 02 09 00 00 00 00       $#  ANS000:7C8 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b1000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:748 04 14 FF FF FF 00 00 00       $$  ANS000:7C8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:748 03 22 F1 A0 00 00 00 00       $%  ANS000:7C8 03 22 F1 A0 00 00 00 00
  $%  REQ001:748 03 22 F1 A1 00 00 00 00       $%  ANS001:7C8 03 22 F1 A1 00 00 00 00
  $%  REQ002:748 03 22 F1 91 00 00 00 00       $%  ANS002:7C8 03 22 F1 91 00 00 00 00
  $%  REQ003:748 03 22 F1 87 00 00 00 00       $%  ANS003:7C8 03 22 F1 87 00 00 00 00
  $%  REQ004:748 03 22 F1 10 00 00 00 00       $%  ANS004:7C8 03 22 F1 10 00 00 00 00
  $%  REQ005:748 03 22 F1 8A 00 00 00 00       $%  ANS005:7C8 03 22 F1 8A 00 00 00 00
  $%  REQ006:748 03 22 F1 90 00 00 00 00       $%  ANS006:7C8 03 22 F1 90 00 00 00 00
  $%  REQ007:748 03 22 F1 A8 00 00 00 00       $%  ANS007:7C8 03 22 F1 A8 00 00 00 00
  $%  REQ008:748 03 22 F1 8B 00 00 00 00       $%  ANS008:7C8 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:            $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元标定软件号:            $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  002:电控单元硬件号:                $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元零件号:                $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号（上次）:        $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  005:测试工具参考号（上次）:        $%    $%  ANS004.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  006:里程读数（上次）:              $%    $%  ANS004.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  007:系统供应商标识号:              $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:车辆识别代码:                  $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  009:车辆特征信息:                  $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  010:电控单元生产日期:              $%    $%  ANS008.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:748 03 22 B1 28 00 00 00 00       $  ANS000:7C8 03 22 B1 28 00 00 00 00
  $  REQ001:748 03 22 B1 25 00 00 00 00       $  ANS001:7C8 03 22 B1 25 00 00 00 00
  $  REQ002:748 03 22 B1 3E 00 00 00 00       $  ANS002:7C8 03 22 B1 3E 00 00 00 00
  $  REQ003:748 03 22 B1 1C 00 00 00 00       $  ANS003:7C8 03 22 B1 1C 00 00 00 00
  $  REQ004:748 03 22 B1 08 00 00 00 00       $  ANS004:7C8 03 22 B1 08 00 00 00 00
  $  REQ005:748 03 22 B1 09 00 00 00 00       $  ANS005:7C8 03 22 B1 09 00 00 00 00
  $  REQ006:748 03 22 B1 26 00 00 00 00       $  ANS006:7C8 03 22 B1 26 00 00 00 00
  $  REQ007:748 03 22 B1 05 00 00 00 00       $  ANS007:7C8 03 22 B1 05 00 00 00 00
  $  REQ008:748 03 22 B1 1E 00 00 00 00       $  ANS008:7C8 03 22 B1 1E 00 00 00 00
  $  REQ009:748 03 22 B1 44 00 00 00 00       $  ANS009:7C8 03 22 B1 44 00 00 00 00
  $  REQ010:748 03 22 B1 1A 00 00 00 00       $  ANS010:7C8 03 22 B1 1A 00 00 00 00
  $  REQ011:748 03 22 B1 30 00 00 00 00       $  ANS011:7C8 03 22 B1 30 00 00 00 00
  $  REQ012:748 03 22 B1 14 00 00 00 00       $  ANS012:7C8 03 22 B1 14 00 00 00 00
  $  REQ013:748 03 22 B1 40 00 00 00 00       $  ANS013:7C8 03 22 B1 40 00 00 00 00
  $  REQ014:748 03 22 B1 1D 00 00 00 00       $  ANS014:7C8 03 22 B1 1D 00 00 00 00
  $  REQ015:748 03 22 B1 27 00 00 00 00       $  ANS015:7C8 03 22 B1 27 00 00 00 00
  $  REQ016:748 03 22 B1 43 00 00 00 00       $  ANS016:7C8 03 22 B1 43 00 00 00 00
  $  REQ017:748 03 22 B1 42 00 00 00 00       $  ANS017:7C8 03 22 B1 42 00 00 00 00
  $  REQ018:748 03 22 01 0C 00 00 00 00       $  ANS018:7C8 03 22 01 0C 00 00 00 00
  $  REQ019:748 03 22 B1 0C 00 00 00 00       $  ANS019:7C8 03 22 B1 0C 00 00 00 00
  $  REQ020:748 03 22 B1 0F 00 00 00 00       $  ANS020:7C8 03 22 B1 0F 00 00 00 00
  $  REQ021:748 03 22 B1 0A 00 00 00 00       $  ANS021:7C8 03 22 B1 0A 00 00 00 00
  $  REQ022:748 03 22 B1 45 00 00 00 00       $  ANS022:7C8 03 22 B1 45 00 00 00 00
  $  REQ023:748 03 22 B1 06 00 00 00 00       $  ANS023:7C8 03 22 B1 06 00 00 00 00
  $  REQ024:748 03 22 B1 1B 00 00 00 00       $  ANS024:7C8 03 22 B1 1B 00 00 00 00
  $  REQ025:748 03 22 B1 2A 00 00 00 00       $  ANS025:7C8 03 22 B1 2A 00 00 00 00
  $  REQ026:748 03 22 B1 24 00 00 00 00       $  ANS026:7C8 03 22 B1 24 00 00 00 00
  $  REQ027:748 03 22 B1 29 00 00 00 00       $  ANS027:7C8 03 22 B1 29 00 00 00 00
  $  REQ028:748 03 22 B1 19 00 00 00 00       $  ANS028:7C8 03 22 B1 19 00 00 00 00
  $  REQ029:748 03 22 B1 13 00 00 00 00       $  ANS029:7C8 03 22 B1 13 00 00 00 00
  $  REQ030:748 03 22 B1 33 00 00 00 00       $  ANS030:7C8 03 22 B1 33 00 00 00 00
  $  REQ031:748 03 22 B1 36 00 00 00 00       $  ANS031:7C8 03 22 B1 36 00 00 00 00
  $  REQ032:748 03 22 20 60 00 00 00 00       $  ANS032:7C8 03 22 20 60 00 00 00 00
  $  REQ033:748 03 22 B1 21 00 00 00 00       $  ANS033:7C8 03 22 B1 21 00 00 00 00
  $  REQ034:748 03 22 B1 0B 00 00 00 00       $  ANS034:7C8 03 22 B1 0B 00 00 00 00
  $  REQ035:748 03 22 B1 20 00 00 00 00       $  ANS035:7C8 03 22 B1 20 00 00 00 00
  $  REQ036:748 03 22 D0 01 00 00 00 00       $  ANS036:7C8 03 22 D0 01 00 00 00 00
  $  REQ037:748 03 22 D1 13 00 00 00 00       $  ANS037:7C8 03 22 D1 13 00 00 00 00
  $  REQ038:748 03 22 B1 22 00 00 00 00       $  ANS038:7C8 03 22 B1 22 00 00 00 00
  $  REQ039:748 03 22 D1 10 00 00 00 00       $  ANS039:7C8 03 22 D1 10 00 00 00 00
  $  REQ040:748 03 22 B1 35 00 00 00 00       $  ANS040:7C8 03 22 B1 35 00 00 00 00
  $  REQ041:748 03 22 B1 2D 00 00 00 00       $  ANS041:7C8 03 22 B1 2D 00 00 00 00
  $  REQ042:748 03 22 B1 1F 00 00 00 00       $  ANS042:7C8 03 22 B1 1F 00 00 00 00
  $  REQ043:748 03 22 B1 16 00 00 00 00       $  ANS043:7C8 03 22 B1 16 00 00 00 00
  $  REQ044:748 03 22 B1 18 00 00 00 00       $  ANS044:7C8 03 22 B1 18 00 00 00 00
  $  REQ045:748 03 22 B1 17 00 00 00 00       $  ANS045:7C8 03 22 B1 17 00 00 00 00
  $  REQ046:748 03 22 B1 11 00 00 00 00       $  ANS046:7C8 03 22 B1 11 00 00 00 00
  $  REQ047:748 03 22 B1 10 00 00 00 00       $  ANS047:7C8 03 22 B1 10 00 00 00 00
  $  REQ048:748 03 22 B1 3C 00 00 00 00       $  ANS048:7C8 03 22 B1 3C 00 00 00 00
  $  REQ049:748 03 22 B1 3D 00 00 00 00       $  ANS049:7C8 03 22 B1 3D 00 00 00 00
  $  REQ050:748 03 22 B1 2B 00 00 00 00       $  ANS050:7C8 03 22 B1 2B 00 00 00 00
  $  REQ051:748 03 22 B1 2C 00 00 00 00       $  ANS051:7C8 03 22 B1 2C 00 00 00 00
  $  REQ052:748 03 22 B1 3A 00 00 00 00       $  ANS052:7C8 03 22 B1 3A 00 00 00 00
  $  REQ053:748 03 22 D1 17 00 00 00 00       $  ANS053:7C8 03 22 D1 17 00 00 00 00
  $  REQ054:748 03 22 B1 32 00 00 00 00       $  ANS054:7C8 03 22 B1 32 00 00 00 00
  $  REQ055:748 03 22 B1 34 00 00 00 00       $  ANS055:7C8 03 22 B1 34 00 00 00 00
  $  REQ056:748 03 22 01 12 00 00 00 00       $  ANS056:7C8 03 22 01 12 00 00 00 00
  $  REQ057:748 03 22 B1 31 00 00 00 00       $  ANS057:7C8 03 22 B1 31 00 00 00 00
  $  REQ058:748 03 22 B1 38 00 00 00 00       $  ANS058:7C8 03 22 B1 38 00 00 00 00
  $  REQ059:748 03 22 B1 39 00 00 00 00       $  ANS059:7C8 03 22 B1 39 00 00 00 00
  $  REQ060:748 03 22 B1 41 00 00 00 00       $  ANS060:7C8 03 22 B1 41 00 00 00 00
  $  REQ061:748 03 22 B1 3F 00 00 00 00       $  ANS061:7C8 03 22 B1 3F 00 00 00 00
  $  REQ062:748 03 22 E1 01 00 00 00 00       $  ANS062:7C8 03 22 E1 01 00 00 00 00
  $  REQ063:748 03 22 B1 02 00 00 00 00       $  ANS063:7C8 03 22 B1 02 00 00 00 00
  $  REQ064:748 03 22 B1 2F 00 00 00 00       $  ANS064:7C8 03 22 B1 2F 00 00 00 00

  $  000.芯片内部温度有效性                       $    $           $    $  ANS000.BYTE004  $  y=UINT48(x1,x2,x3,x4,x5,x6);
  $  001.交流插座温度1                            $    $           $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  002.平均温度                                 $    $           $    $  ANS002.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  003.PCB温度1raw                              $    $           $    $  ANS003.BYTE004  $  y=(x1*256+x2);
  $  004.均衡回路开路故障CMC号                    $    $           $    $  ANS004.BYTE004  $  y=x;
  $  005.均衡回路开路故障Cell号                   $    $           $    $  ANS004.BYTE005  $  y=x;
  $  006.均衡回路短路故障CMC号                    $    $           $    $  ANS005.BYTE004  $  y=x;
  $  007.均衡回路短路故障Cell号                   $    $           $    $  ANS005.BYTE005  $  y=x;
  $  008.均衡温度有效性                           $    $           $    $  ANS006.BYTE004  $  y=(x1*256+x2);
  $  009.总线电流                                 $    $  A        $    $  ANS007.BYTE004  $  y=(x1*256+x2)*0.1-3276.8;
  $  010.主正内侧对主负内外侧电压                 $    $  V        $    $  ANS008.BYTE004  $  y=(x1*256+x2)*0.1;
  $  011.电池对主负外电压                         $    $  V        $    $  ANS008.BYTE006  $  y=(x1*256+x2)*0.1;
  $  012.CAB采样电流1                             $    $           $    $  ANS009.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  013.DC枪连接状态                             $    $           $    $  ANS010.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@0c41;else if(((x&0x02)>>1)==0x01) y=@0c40;else y=@0103;
  $  014.DC充电模式标志                           $    $           $    $  ANS010.BYTE004  $  if((x&0x01)==0x00) y=@0319;else if((x&0x01)==0x01) y=@0354;else y=@0103;
  $  015.AC充电模式标志                           $    $           $    $  ANS011.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@0c41;else if(((x&0x04)>>2)==0x01) y=@0c40;else y=@0103;
  $  016.AC枪连接状态                             $    $           $    $  ANS011.BYTE004  $  if((x&0x03)==0x00) y=@0319;else if((x&0x03)==0x01) y=@0354;else if((x&0x03)==0x02) y=@0e99;else if((x&0x03)==0x03) y=@0103;else y=@0035;
  $  017.最大电芯电压                             $    $           $    $  ANS012.BYTE004  $  y=(x1*256+x2);
  $  018.最小电芯电压                             $    $           $    $  ANS012.BYTE006  $  y=(x1*256+x2);
  $  019.平均电芯电压                             $    $           $    $  ANS012.BYTE008  $  y=(x1*256+x2);
  $  020.每一个电芯电压的有效性                   $    $           $    $  ANS013.BYTE004  $  y=x;
  $  021.Ch1高边电压值                            $    $  mV       $    $  ANS014.BYTE004  $  y=(x1*256+x2);
  $  022.Ch1低边电压值                            $    $  mV       $    $  ANS014.BYTE006  $  y=(x1*256+x2);
  $  023.最大芯片内部温度                         $    $           $    $  ANS015.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  024.电芯电压累加和                           $    $  V        $    $  ANS016.BYTE004  $  y=(x1*256+x2)*0.1;
  $  025.详细电芯电压                             $    $  mV       $    $  ANS017.BYTE204  $  y=UINT64(x1,x2,x3,x4,x5,x6,x7,x8);
  $  026.全局里程表读数                           $    $  km       $    $  ANS018.BYTE004  $  y=x;
  $  027.碰撞硬件PWM信号占空比                    $    $           $    $  ANS019.BYTE004  $  y=(x1*256+x2)*0.01;
  $  028.主负继电器状态                           $    $           $    $  ANS020.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@0028;else if(((x&0x04)>>2)==0x01) y=@0264;else y=@0103;
  $  029.主正继电器状态                           $    $           $    $  ANS020.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@0028;else if(((x&0x02)>>1)==0x01) y=@0264;else y=@0103;
  $  030.预充继电器状态                           $    $           $    $  ANS020.BYTE004  $  if((x&0x01)==0x00) y=@0028;else if((x&0x01)==0x01) y=@0264;else y=@0103;
  $  031.CRASH硬线电压值                          $    $  mA       $    $  ANS021.BYTE004  $  y=(x1*256+x2);
  $  032.关于CSU COP看门狗的状态                  $    $           $    $  ANS022.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@0c31;else if(((x&0x80)>>7)==0x01) y=@0119;else y=@0103;
  $  033.关于CSU OSC时钟的状态                    $    $           $    $  ANS022.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@0c31;else if(((x&0x40)>>6)==0x01) y=@0119;else y=@0103;
  $  034.关于PLL时钟的状态                        $    $           $    $  ANS022.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@0c31;else if(((x&0x20)>>5)==0x01) y=@0119;else y=@0103;
  $  035.指出CSU温度超过                          $    $           $    $  ANS022.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@0c31;else if(((x&0x08)>>3)==0x01) y=@0119;else y=@0103;
  $  036.CSU分流器的故障前标志打开                $    $           $    $  ANS022.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@0c31;else if(((x&0x04)>>2)==0x01) y=@0119;else y=@0103;
  $  037.CSU电源电压的故障前标志异常              $    $           $    $  ANS022.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@0c31;else if(((x&0x02)>>1)==0x01) y=@0119;else y=@0103;
  $  038.当前相关的错误标志                       $    $           $    $  ANS022.BYTE004  $  if((x&0x01)==0x00) y=@0c31;else if((x&0x01)==0x01) y=@0119;else y=@0103;
  $  039.电流有效分支                             $    $           $    $  ANS023.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@0136;else if(((x&0x04)>>2)==0x01) y=@00bb;else y=@0103;
  $  040.电流相关标志位                           $    $           $    $  ANS023.BYTE004  $  if((x&0x01)==0x00) y=@0136;else if((x&0x01)==0x01) y=@00bb;else y=@0103;
  $  041.DCCC电压raw                              $    $           $    $  ANS024.BYTE004  $  y=(x1*256+x2);
  $  042.CC2采样电压                              $    $  mV       $    $  ANS025.BYTE004  $  y=(x1*256+x2);
  $  043.直流插座温度1                            $    $           $    $  ANS026.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  044.直流插座温度2                            $    $           $    $  ANS026.BYTE006  $  y=(x1*256+x2)*0.5-50;
  $  045.BMU板温1                                 $    $           $    $  ANS027.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  046.BMU板温2                                 $    $           $    $  ANS027.BYTE006  $  y=(x1*256+x2)*0.5-50;
  $  047.快充停止原因                             $    $           $    $  ANS028.BYTE004  $  if(x==0x00) y=@0f15;else if(x==0x01) y=@0f16;else if(x==0x02) y=@0f17;else if(x==0x03) y=@0f18;else if(x==0x04) y=@0f19;else if(x==0x05) y=@0f1a;else if(x==0x06) y=@0f1b;else if(x==0x07) y=@0f1c;else if(x==0x09) y=@0f1d;else if(x==0x0A) y=@0f1e;else if(x==0x0B) y=@0f1f;else if(x==0x0C) y=@0f20;else if(x==0x0D) y=@0f21;else if(x==0x0E) y=@0f22;else if(x==0x0F) y=@0f23;else if(x==0x10) y=@0f24;else if(x==0x11) y=@0f25;else if(x==0x12) y=@0f26;else if(x==0x13) y=@0f27;else if(x==0x14) y=@0f28;else if(x==0x15) y=@0f29;else if(x==0x16) y=@0f2a;else if(x==0x17) y=@0f2b;else if(x==0x1A) y=@0f2c;else if(x==0x1B) y=@0f2d;else if(x==0x1C) y=@0f2e;else if(x==0x1D) y=@0f2f;else if(x==0x1E) y=@0f30;else if(x==0x1F) y=@0f31;else if(x==0x20) y=@0f32;else if(x==0x21) y=@0f33;else if(x==0x22) y=@0f34;else if(x==0x23) y=@0f35;else if(x==0x24) y=@0f36;else if(x==0x25) y=@0f37;else y=@0035;
  $  048.菊花链更新标志位                         $    $           $    $  ANS029.BYTE004  $  if((x&0x01)==0x00) y=@0f38;else if((x&0x01)==0x01) y=@0ec0;else y=@0103;
  $  049.放电电流查表值(short)                    $    $  A        $    $  ANS030.BYTE004  $  y=(x1*256+x2)*0.1;
  $  050.显示SOH                                  $    $  %        $    $  ANS031.BYTE004  $  y=(x1*256+x2)*0.0002;
  $  051.强制关闭绝缘检测命令                     $    $           $    $  ANS032.BYTE004  $  if(x==0x00) y=@0f10;else if(x==0x01) y=@0f11;else y=@0035;
  $  052.高压采样芯片G1芯片故障Err Mask           $    $           $    $  ANS033.BYTE004  $  y=(x1*256+x2);
  $  053.碰撞硬件PWM信号周期                      $    $           $    $  ANS034.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.01;
  $  054.加热继电器外侧对主负内侧电压             $    $  V        $    $  ANS035.BYTE004  $  y=(x1*256+x2)*0.1;
  $  055.全局KL.50状态                            $    $           $    $  ANS036.BYTE004  $  if(((x&0x80)>>7)==0x00) y=@000f;else if(((x&0x80)>>7)==0x01) y=@0028;else y=@0035;
  $  056.全局动力模块运行状态                     $    $           $    $  ANS036.BYTE004  $  if(((x&0x40)>>6)==0x00) y=@000f;else if(((x&0x40)>>6)==0x01) y=@0028;else y=@0035;
  $  057.全局 KL.15 状态                          $    $           $    $  ANS036.BYTE004  $  if(((x&0x20)>>5)==0x00) y=@000f;else if(((x&0x20)>>5)==0x01) y=@0028;else y=@0035;
  $  058.全局KL.R状态                             $    $           $    $  ANS036.BYTE004  $  if(((x&0x10)>>4)==0x00) y=@000f;else if(((x&0x10)>>4)==0x01) y=@0028;else y=@0035;
  $  059.系统KL.50状态                            $    $           $    $  ANS036.BYTE004  $  if(((x&0x08)>>3)==0x00) y=@000f;else if(((x&0x08)>>3)==0x01) y=@0028;else y=@0035;
  $  060.全局发动机运行状态                       $    $           $    $  ANS036.BYTE004  $  if(((x&0x04)>>2)==0x00) y=@000f;else if(((x&0x04)>>2)==0x01) y=@0028;else y=@0035;
  $  061.系统KL.15状态                            $    $           $    $  ANS036.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@000f;else if(((x&0x02)>>1)==0x01) y=@0028;else y=@0035;
  $  062.系统KL.R状态                             $    $           $    $  ANS036.BYTE004  $  if((x&0x01)==0x00) y=@000f;else if((x&0x01)==0x01) y=@0028;else y=@0035;
  $  063.正负极绝缘阻值(Kohm)                     $    $           $    $  ANS037.BYTE004  $  y=(x1*256+x2);
  $  064.负极绝缘阻值(Kohm)                       $    $           $    $  ANS037.BYTE006  $  y=(x1*256+x2);
  $  065.绝缘检测状态                             $    $           $    $  ANS038.BYTE004  $  if(x==0x00) y=@02b2;else if(x==0x01) y=@0044;else if(x==0x02) y=@0135;else if(x==0x03) y=@0119;else if(x==0x04) y=@0119;else if(x==0x05) y=@0136;else y=@0035;
  $  066.铅酸电池电压                             $    $  V        $    $  ANS039.BYTE004  $  y=x;
  $  067.历史SOH变更原因1                         $    $           $    $  ANS040.BYTE004  $  if(x==0x00) y=@0f12;else if(x==0x01) y=@0f13;else y=@0035;
  $  068.历史SOH变更原因2                         $    $           $    $  ANS040.BYTE005  $  if(x==0x00) y=@0f12;else if(x==0x01) y=@0f13;else y=@0035;
  $  069.历史SOH变更原因3                         $    $           $    $  ANS040.BYTE006  $  if(x==0x00) y=@0f12;else if(x==0x01) y=@0f13;else y=@0035;
  $  070.历史SOH变更原因4                         $    $           $    $  ANS040.BYTE007  $  if(x==0x00) y=@0f12;else if(x==0x01) y=@0f13;else y=@0035;
  $  071.历史SOH变更原因5                         $    $           $    $  ANS040.BYTE008  $  if(x==0x00) y=@0f12;else if(x==0x01) y=@0f13;else y=@0035;
  $  072.MainCnctrCannotClsReason1                $    $           $    $  ANS041.BYTE004  $  ASCII(X1);
  $  073.MainCnctrCannotClsReason2                $    $           $    $  ANS041.BYTE005  $  ASCII(X1);
  $  074.MainCnctrCannotClsReason3                $    $           $    $  ANS041.BYTE006  $  ASCII(X1);
  $  075.主正继电器外侧对主负内外侧电压           $    $  V        $    $  ANS042.BYTE004  $  y=(x1*256+x2)*0.1;
  $  076.继电器对主负外电压                       $    $  V        $    $  ANS042.BYTE006  $  y=(x1*256+x2)*0.1;
  $  077.最大单体电芯所在的CMC编号                $    $           $    $  ANS043.BYTE004  $  y=x;
  $  078.最大单体电芯所在的CMC中的位置编号        $    $           $    $  ANS043.BYTE005  $  y=x;
  $  079.最大单体电芯所在模组编号                 $    $           $    $  ANS043.BYTE006  $  y=x;
  $  080.最大单体电芯所在的模组中的位置编号       $    $           $    $  ANS043.BYTE007  $  y=x;
  $  081.最大单体电芯所在的Chip编号               $    $           $    $  ANS043.BYTE008  $  y=x;
  $  082.最小单体电芯所在的CMC编号                $    $           $    $  ANS043.BYTE009  $  y=x;
  $  083.最小单体电芯所在的CMC中的位置编号        $    $           $    $  ANS043.BYTE010  $  y=x;
  $  084.最小单体电芯所在模组编号                 $    $           $    $  ANS043.BYTE011  $  y=x;
  $  085.最小单体电芯所在的模组中的位置编号       $    $           $    $  ANS043.BYTE012  $  y=x;
  $  086.最小单体电芯所在的Chip编号               $    $           $    $  ANS043.BYTE013  $  y=x;
  $  087.最大电芯电压                             $    $  mV       $    $  ANS044.BYTE004  $  y=(x1*256+x2);
  $  088.最小电芯电压                             $    $  mV       $    $  ANS044.BYTE006  $  y=(x1*256+x2);
  $  089.最大电芯电压位置                         $    $           $    $  ANS045.BYTE004  $  y=x;
  $  090.最小电芯电压位置                         $    $           $    $  ANS045.BYTE005  $  y=x;
  $  091.在CMC的最大温度位置                      $    $           $    $  ANS046.BYTE004  $  y=x;
  $  092.最大模组温度CHIP位置                     $    $           $    $  ANS046.BYTE005  $  y=x;
  $  093.最大模组温度Module位置                   $    $           $    $  ANS046.BYTE006  $  y=x;
  $  094.模组上的模组最高温度位置                 $    $           $    $  ANS046.BYTE007  $  y=x;
  $  095.模组上的模组最小温度CMC位置              $    $           $    $  ANS046.BYTE008  $  y=x;
  $  096.模组上的模组最小温度CHIP位置             $    $           $    $  ANS046.BYTE009  $  y=x;
  $  097.模组上的模组最小温度Module位置           $    $           $    $  ANS046.BYTE010  $  y=x;
  $  098.模组上的模组最小温度位置                 $    $           $    $  ANS046.BYTE011  $  y=x;
  $  099.最大模组温度                             $    $           $    $  ANS047.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  100.最小模组温度                             $    $           $    $  ANS047.BYTE006  $  y=(x1*256+x2)*0.5-50;
  $  101.平均模组温度                             $    $           $    $  ANS047.BYTE008  $  y=(x1*256+x2)*0.5-50;
  $  102.最大模组温度                             $    $           $    $  ANS048.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  103.最小模组温度                             $    $           $    $  ANS049.BYTE004  $  y=(x1*256+x2)*0.5-50;
  $  104.CMC 复位错误                             $    $           $    $  ANS050.BYTE004  $  if(((x&0x02)>>1)==0x00) y=@0c31;else if(((x&0x02)>>1)==0x01) y=@0119;else y=@0103;
  $  105.模组温度菊花链更新标志位和复位故障       $    $           $    $  ANS050.BYTE004  $  if((x&0x01)==0x00) y=@0f14;else if((x&0x01)==0x01) y=@0ec0;else y=@0103;
  $  106.模组温度有效性                           $    $           $    $  ANS051.BYTE004  $  y=UINT40(x1,x2,x3,x4,x5);
  $  107.24位国标码                               $    $           $    $  ANS052.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  108.显示SOC                                  $    $  %        $    $  ANS053.BYTE004  $  y=(x1*256+x2)*0.1;
  $  109.回充电流查表值(long)                     $    $  A        $    $  ANS054.BYTE004  $  y=(x1*256+x2)*0.1;
  $  110.回充电流查表值(short)                    $    $  A        $    $  ANS055.BYTE004  $  y=(x1*256+x2)*0.1;
  $  111.系统供电电压                             $    $  V        $    $  ANS056.BYTE004  $  y=x*0.1;
  $  112.系统最大最小SOC                          $    $  %        $    $  ANS057.BYTE004  $  y=(x1*256+x2);
  $  113.系统最小SOC                              $    $  %        $    $  ANS057.BYTE006  $  y=(x1*256+x2);
  $  114.系统供应商ECU硬件版本号                  $    $           $    $  ANS058.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  115.系统供应商ECU软件版本号                  $    $           $    $  ANS059.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  116.RTC时间                                  $    $           $    $  ANS060.BYTE004  $  y=UINT56(x1,x2,x3,x4,x5,x6,x7);
  $  117.非预期下电故障判断标志                   $    $           $    $  ANS061.BYTE004  $  if(x==0x00) y=@0c31;else if(x==0x01) y=@0119;else y=@0103;
  $  118.里程                                     $    $  km       $    $  ANS062.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  119.车辆速度                                 $    $  km/h     $    $  ANS063.BYTE004  $  y=(x1*256+x2);
  $  120.慢充停止原因                             $    $           $    $  ANS064.BYTE004  $  if(x==0x00) y=@0f0a;else if(x==0x01) y=@0f0b;else if(x==0x02) y=@0f0c;else if(x==0x03) y=@0f0d;else if(x==0x04) y=@0f0e;else if(x==0x05) y=@0f0f;else y=@0103;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:748 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
