
    车型ID：10b6

    模拟：协议模拟-->10b6

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:748 02 10 01 00 00 00 00 00       $~  ANS000:7C8 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:748 02 3E 80 00 00 00 00 00       $!  ANS000:7C8 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:748 03 19 02 09 00 00 00 00       $#  ANS000:7C8 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/b3000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:748 04 14 FF FF FF 00 00 00       $$  ANS000:7C8 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:748 03 22 F1 A9 00 00 00 00       $%  ANS000:7C8 03 22 F1 A9 00 00 00 00
  $%  REQ001:748 03 22 F1 A0 00 00 00 00       $%  ANS001:7C8 03 22 F1 A0 00 00 00 00
  $%  REQ002:748 03 22 F1 83 00 00 00 00       $%  ANS002:7C8 03 22 F1 83 00 00 00 00
  $%  REQ003:748 03 22 F1 A1 00 00 00 00       $%  ANS003:7C8 03 22 F1 A1 00 00 00 00
  $%  REQ004:748 03 22 F1 91 00 00 00 00       $%  ANS004:7C8 03 22 F1 91 00 00 00 00
  $%  REQ005:748 03 22 F1 A2 00 00 00 00       $%  ANS005:7C8 03 22 F1 A2 00 00 00 00
  $%  REQ006:748 03 22 F1 87 00 00 00 00       $%  ANS006:7C8 03 22 F1 87 00 00 00 00
  $%  REQ007:748 03 22 F1 10 00 00 00 00       $%  ANS007:7C8 03 22 F1 10 00 00 00 00
  $%  REQ008:748 03 22 F1 92 00 00 00 00       $%  ANS008:7C8 03 22 F1 92 00 00 00 00
  $%  REQ009:748 03 22 F1 8C 00 00 00 00       $%  ANS009:7C8 03 22 F1 8C 00 00 00 00
  $%  REQ010:748 03 22 F1 94 00 00 00 00       $%  ANS010:7C8 03 22 F1 94 00 00 00 00
  $%  REQ011:748 03 22 F1 8A 00 00 00 00       $%  ANS011:7C8 03 22 F1 8A 00 00 00 00
  $%  REQ012:748 03 22 F1 90 00 00 00 00       $%  ANS012:7C8 03 22 F1 90 00 00 00 00
  $%  REQ013:748 03 22 F1 A8 00 00 00 00       $%  ANS013:7C8 03 22 F1 A8 00 00 00 00
  $%  REQ014:748 03 22 F1 8B 00 00 00 00       $%  ANS014:7C8 03 22 F1 8B 00 00 00 00

  $%  000:电池储存系统编码:                $%    $%  ANS000.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30);
  $%  001:电控单元应用软件号:              $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  002:电控单元刷写软件参考号:          $%    $%  ANS002.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  003:电控单元标定软件号:              $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元硬件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号（上次）:          $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  008:测试工具参考号（上次）:          $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  009:里程读数（上次）:                $%    $%  ANS007.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  010:供应商电控单元硬件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:产品序列号:                      $%    $%  ANS009.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  012:产品线号:                        $%    $%  ANS009.BYTE009  $%  ASCII(X1,X2);
  $%  013:年:                              $%    $%  ANS009.BYTE011  $%  HEX(X1);
  $%  014:月:                              $%    $%  ANS009.BYTE012  $%  HEX(X1);
  $%  015:日:                              $%    $%  ANS009.BYTE013  $%  HEX(X1);
  $%  016:供应商电控单元软件参考号:        $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  017:系统供应商标识号:                $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  018:车辆识别代码:                    $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  019:车辆特征信息:                    $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  020:电控单元制造日期:                $%    $%  ANS014.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $)  00.数据流1
  $  00.数据流1
  $  REQ000:748 03 22 E1 21 00 00 00 00       $  ANS000:7C8 03 22 E1 21 00 00 00 00
  $  REQ001:748 03 22 E0 89 00 00 00 00       $  ANS001:7C8 03 22 E0 89 00 00 00 00
  $  REQ002:748 03 22 E1 24 00 00 00 00       $  ANS002:7C8 03 22 E1 24 00 00 00 00
  $  REQ003:748 03 22 E1 32 00 00 00 00       $  ANS003:7C8 03 22 E1 32 00 00 00 00
  $  REQ004:748 03 22 E1 30 00 00 00 00       $  ANS004:7C8 03 22 E1 30 00 00 00 00
  $  REQ005:748 03 22 E1 28 00 00 00 00       $  ANS005:7C8 03 22 E1 28 00 00 00 00
  $  REQ006:748 03 22 E0 76 00 00 00 00       $  ANS006:7C8 03 22 E0 76 00 00 00 00
  $  REQ007:748 03 22 E0 75 00 00 00 00       $  ANS007:7C8 03 22 E0 75 00 00 00 00
  $  REQ008:748 03 22 E1 39 00 00 00 00       $  ANS008:7C8 03 22 E1 39 00 00 00 00
  $  REQ009:748 03 22 E0 91 00 00 00 00       $  ANS009:7C8 03 22 E0 91 00 00 00 00
  $  REQ010:748 03 22 E0 09 00 00 00 00       $  ANS010:7C8 03 22 E0 09 00 00 00 00
  $  REQ011:748 03 22 E0 61 00 00 00 00       $  ANS011:7C8 03 22 E0 61 00 00 00 00
  $  REQ012:748 03 22 E1 08 00 00 00 00       $  ANS012:7C8 03 22 E1 08 00 00 00 00
  $  REQ013:748 03 22 E1 09 00 00 00 00       $  ANS013:7C8 03 22 E1 09 00 00 00 00
  $  REQ014:748 03 22 E0 80 00 00 00 00       $  ANS014:7C8 03 22 E0 80 00 00 00 00
  $  REQ015:748 03 22 E1 27 00 00 00 00       $  ANS015:7C8 03 22 E1 27 00 00 00 00
  $  REQ016:748 03 22 E1 31 00 00 00 00       $  ANS016:7C8 03 22 E1 31 00 00 00 00
  $  REQ017:748 03 22 E0 24 00 00 00 00       $  ANS017:7C8 03 22 E0 24 00 00 00 00
  $  REQ018:748 03 22 E0 19 00 00 00 00       $  ANS018:7C8 03 22 E0 19 00 00 00 00
  $  REQ019:748 03 22 E0 35 00 00 00 00       $  ANS019:7C8 03 22 E0 35 00 00 00 00
  $  REQ020:748 03 22 E0 33 00 00 00 00       $  ANS020:7C8 03 22 E0 33 00 00 00 00
  $  REQ021:748 03 22 E1 22 00 00 00 00       $  ANS021:7C8 03 22 E1 22 00 00 00 00
  $  REQ022:748 03 22 E0 43 00 00 00 00       $  ANS022:7C8 03 22 E0 43 00 00 00 00
  $  REQ023:748 03 22 E0 50 00 00 00 00       $  ANS023:7C8 03 22 E0 50 00 00 00 00
  $  REQ024:748 03 22 E0 93 00 00 00 00       $  ANS024:7C8 03 22 E0 93 00 00 00 00
  $  REQ025:748 03 22 E1 33 00 00 00 00       $  ANS025:7C8 03 22 E1 33 00 00 00 00
  $  REQ026:748 03 22 E0 72 00 00 00 00       $  ANS026:7C8 03 22 E0 72 00 00 00 00
  $  REQ027:748 03 22 E0 51 00 00 00 00       $  ANS027:7C8 03 22 E0 51 00 00 00 00
  $  REQ028:748 03 22 E0 52 00 00 00 00       $  ANS028:7C8 03 22 E0 52 00 00 00 00
  $  REQ029:748 03 22 E1 36 00 00 00 00       $  ANS029:7C8 03 22 E1 36 00 00 00 00
  $  REQ030:748 03 22 E1 23 00 00 00 00       $  ANS030:7C8 03 22 E1 23 00 00 00 00
  $  REQ031:748 03 22 E1 63 00 00 00 00       $  ANS031:7C8 03 22 E1 63 00 00 00 00
  $  REQ032:748 03 22 E1 35 00 00 00 00       $  ANS032:7C8 03 22 E1 35 00 00 00 00
  $  REQ033:748 03 22 E1 15 00 00 00 00       $  ANS033:7C8 03 22 E1 15 00 00 00 00

  $  000.CHM中AC充电继电器闭合指令            $    $         $    $  ANS000.BYTE004  $  if(x==0) y=@0339;else if(x==1) y=@0354;else y=@0035;
  $  001.AC充电请求电流值                     $    $  A      $    $  ANS001.BYTE004  $  y=(x1*256+x2)*0.1;
  $  002.AC充电截止电压值                     $    $  mV     $    $  ANS002.BYTE004  $  y=(x1*256+x2);
  $  003.OBC充电报文更新标志位                $    $         $    $  ANS003.BYTE004  $  if(x==0) y=@0ebf;else if(x==1) y=@0ec0;else y=@0035;
  $  004.AC充电允许连接                       $    $         $    $  ANS004.BYTE004  $  if(x==0) y=@0ec1;else if(x==1) y=@0ec2;else y=@0035;
  $  005.AC充电枪最高温度                     $    $         $    $  ANS005.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  006.AC充电枪负极端温度对应电阻值         $    $         $    $  ANS006.BYTE004  $  if(x1<0x80) y=x1*256*256*256+x2*256*256+x3*256+x4;else y=(x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000;
  $  007.AC充电枪正极端温度对应电阻值         $    $         $    $  ANS007.BYTE004  $  if(x1<0x80) y=x1*256*256*256+x2*256*256+x3*256+x4;else y=(x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000;
  $  008.AC充电状态                           $    $         $    $  ANS008.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0ec3;else if(x==2) y=@0ebc;else if(x==3) y=@0ec4;else if(x==4) y=@0e96;else y=@0035;
  $  009.AC充电状态                           $    $         $    $  ANS009.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0ec3;else if(x==2) y=@0ebc;else if(x==3) y=@0ec4;else if(x==4) y=@0e96;else y=@0035;
  $  010.AC充电电压值                         $    $  V      $    $  ANS010.BYTE004  $  y=(x1*256+x2)*0.1;
  $  011.AC继电器驱动端电压值                 $    $  V      $    $  ANS011.BYTE004  $  y=x*0.1;
  $  012.AC电子锁控制指令                     $    $         $    $  ANS012.BYTE004  $  if(x==0) y=@0052;else if(x==1) y=@0055;else y=@0035;
  $  013.AC电子锁反馈信号状态                 $    $         $    $  ANS013.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  014.预留AD1电压值(电子锁反馈信号）       $    $  V      $    $  ANS014.BYTE004  $  y=x*0.1;
  $  015.AC充电加热继电器闭合指令             $    $         $    $  ANS015.BYTE004  $  if(x==0) y=@0339;else if(x==1) y=@0354;else y=@0035;
  $  016.OBC发出的最大允许充电电流            $    $  A      $    $  ANS016.BYTE004  $  y=(x1*256+x2)*0.1;
  $  017.单体平均温度                         $    $         $    $  ANS017.BYTE004  $  y=x-40;
  $  018.单体平均电压值                       $    $  mV     $    $  ANS018.BYTE004  $  y=(x1*256+x2);
  $  019.BMU供电状态                          $    $         $    $  ANS019.BYTE004  $  if(x==0) y=@00d2;else if(x==1) y=@06c7;else if(x==2) y=@06cb;else if(x==3) y=@0eaa;else if(x==4) y=@0eab;else y=@0035;
  $  020.BMU状态                              $    $         $    $  ANS020.BYTE004  $  if(x==0) y=@0bf5;else if(x==1) y=@0bf6;else if(x==2) y=@0eac;else if(x==3) y=@0ead;else y=@0035;
  $  021.BST报文发送标志位                    $    $         $    $  ANS021.BYTE004  $  if(x==0) y=@0eae;else if(x==1) y=@056c;else y=@0035;
  $  022.CC2电压                              $    $  V      $    $  ANS022.BYTE004  $  y=x*0.1;
  $  023.CC电阻                               $    $         $    $  ANS023.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000));
  $  024.CMU故障状态                          $    $         $    $  ANS024.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  025.PCB温度1                             $    $         $    $  ANS025.BYTE004  $  y=x-40;
  $  026.PCB温度2                             $    $         $    $  ANS025.BYTE005  $  y=x-40;
  $  027.PCB温度3                             $    $         $    $  ANS025.BYTE006  $  y=x-40;
  $  028.PCB温度4                             $    $         $    $  ANS025.BYTE007  $  y=x-40;
  $  029.PCB温度5                             $    $         $    $  ANS025.BYTE008  $  y=x-40;
  $  030.PCB温度6                             $    $         $    $  ANS025.BYTE009  $  y=x-40;
  $  031.PCB温度7                             $    $         $    $  ANS025.BYTE010  $  y=x-40;
  $  032.PCB温度8                             $    $         $    $  ANS025.BYTE011  $  y=x-40;
  $  033.PCB温度9                             $    $         $    $  ANS025.BYTE012  $  y=x-40;
  $  034.PCB温度10                            $    $         $    $  ANS025.BYTE013  $  y=x-40;
  $  035.PCB温度11                            $    $         $    $  ANS025.BYTE014  $  y=x-40;
  $  036.PCB温度12                            $    $         $    $  ANS025.BYTE015  $  y=x-40;
  $  037.PCB温度13                            $    $         $    $  ANS025.BYTE016  $  y=x-40;
  $  038.PCB温度14                            $    $         $    $  ANS025.BYTE017  $  y=x-40;
  $  039.PCB温度15                            $    $         $    $  ANS025.BYTE018  $  y=x-40;
  $  040.PCB温度16                            $    $         $    $  ANS025.BYTE019  $  y=x-40;
  $  041.CMU供电驱动诊断电压值                $    $  V      $    $  ANS026.BYTE004  $  y=x*0.1;
  $  042.CP占空比                             $    $  %      $    $  ANS027.BYTE004  $  y=x;
  $  043.CP频率                               $    $  Hz     $    $  ANS028.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000));
  $  044.CP电压                               $    $  V      $    $  ANS029.BYTE004  $  y=x*0.1;
  $  045.接收CTS报文更新标志位                $    $         $    $  ANS030.BYTE004  $  if(x==0) y=@0ebf;else if(x==1) y=@0ec0;else y=@0035;
  $  046.软件标定版本号1                      $    $         $    $  ANS031.BYTE004  $  y=x;
  $  047.软件标定版本号2                      $    $         $    $  ANS031.BYTE005  $  y=x;
  $  048.软件标定版本号3                      $    $         $    $  ANS031.BYTE006  $  y=x;
  $  049.软件标定版本号4                      $    $         $    $  ANS031.BYTE007  $  y=x;
  $  050.软件标定版本号5                      $    $         $    $  ANS031.BYTE008  $  y=x;
  $  051.软件标定版本号6                      $    $         $    $  ANS031.BYTE009  $  y=x;
  $  052.软件标定版本号7                      $    $         $    $  ANS031.BYTE010  $  y=x;
  $  053.软件标定版本号8                      $    $         $    $  ANS031.BYTE011  $  y=x;
  $  054.软件标定版本号9                      $    $         $    $  ANS031.BYTE012  $  y=x;
  $  055.软件标定版本号10                     $    $         $    $  ANS031.BYTE013  $  y=x;
  $  056.软件标定版本号11                     $    $         $    $  ANS031.BYTE014  $  y=x;
  $  057.软件标定版本号12                     $    $         $    $  ANS031.BYTE015  $  y=x;
  $  058.软件标定版本号13                     $    $         $    $  ANS031.BYTE016  $  y=x;
  $  059.软件标定版本号14                     $    $         $    $  ANS031.BYTE017  $  y=x;
  $  060.软件标定版本号15                     $    $         $    $  ANS031.BYTE018  $  y=x;
  $  061.均衡状态1                            $    $         $    $  ANS032.BYTE004  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  062.均衡状态2                            $    $         $    $  ANS032.BYTE005  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  063.均衡状态3                            $    $         $    $  ANS032.BYTE006  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  064.均衡状态4                            $    $         $    $  ANS032.BYTE007  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  065.均衡状态5                            $    $         $    $  ANS032.BYTE008  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  066.均衡状态6                            $    $         $    $  ANS032.BYTE009  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  067.均衡状态7                            $    $         $    $  ANS032.BYTE010  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  068.均衡状态8                            $    $         $    $  ANS032.BYTE011  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  069.均衡状态9                            $    $         $    $  ANS032.BYTE012  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  070.均衡状态10                           $    $         $    $  ANS032.BYTE013  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  071.均衡状态11                           $    $         $    $  ANS032.BYTE014  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  072.均衡状态12                           $    $         $    $  ANS032.BYTE015  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  073.均衡状态13                           $    $         $    $  ANS032.BYTE016  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  074.均衡状态14                           $    $         $    $  ANS032.BYTE017  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  075.均衡状态15                           $    $         $    $  ANS032.BYTE018  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  076.均衡状态16                           $    $         $    $  ANS032.BYTE019  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  077.均衡状态17                           $    $         $    $  ANS032.BYTE020  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  078.均衡状态18                           $    $         $    $  ANS032.BYTE021  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  079.均衡状态19                           $    $         $    $  ANS032.BYTE022  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  080.均衡状态20                           $    $         $    $  ANS032.BYTE023  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  081.均衡状态21                           $    $         $    $  ANS032.BYTE024  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  082.均衡状态22                           $    $         $    $  ANS032.BYTE025  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  083.均衡状态23                           $    $         $    $  ANS032.BYTE026  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  084.均衡状态24                           $    $         $    $  ANS032.BYTE027  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  085.均衡状态25                           $    $         $    $  ANS032.BYTE028  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  086.均衡状态26                           $    $         $    $  ANS032.BYTE029  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  087.均衡状态27                           $    $         $    $  ANS032.BYTE030  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  088.均衡状态28                           $    $         $    $  ANS032.BYTE031  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  089.均衡状态29                           $    $         $    $  ANS032.BYTE032  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  090.均衡状态30                           $    $         $    $  ANS032.BYTE033  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  091.均衡状态31                           $    $         $    $  ANS032.BYTE034  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  092.均衡状态32                           $    $         $    $  ANS032.BYTE035  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  093.均衡状态33                           $    $         $    $  ANS032.BYTE036  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  094.均衡状态34                           $    $         $    $  ANS032.BYTE037  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  095.均衡状态35                           $    $         $    $  ANS032.BYTE038  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  096.均衡状态36                           $    $         $    $  ANS032.BYTE039  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  097.均衡状态37                           $    $         $    $  ANS032.BYTE040  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  098.均衡状态38                           $    $         $    $  ANS032.BYTE041  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  099.均衡状态39                           $    $         $    $  ANS032.BYTE042  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  100.均衡状态40                           $    $         $    $  ANS032.BYTE043  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  101.均衡状态41                           $    $         $    $  ANS032.BYTE044  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  102.均衡状态42                           $    $         $    $  ANS032.BYTE045  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  103.均衡状态43                           $    $         $    $  ANS032.BYTE046  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  104.均衡状态44                           $    $         $    $  ANS032.BYTE047  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  105.均衡状态45                           $    $         $    $  ANS032.BYTE048  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  106.均衡状态46                           $    $         $    $  ANS032.BYTE049  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  107.均衡状态47                           $    $         $    $  ANS032.BYTE050  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  108.均衡状态48                           $    $         $    $  ANS032.BYTE051  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  109.均衡状态49                           $    $         $    $  ANS032.BYTE052  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  110.均衡状态50                           $    $         $    $  ANS032.BYTE053  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  111.均衡状态51                           $    $         $    $  ANS032.BYTE054  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  112.均衡状态52                           $    $         $    $  ANS032.BYTE055  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  113.均衡状态53                           $    $         $    $  ANS032.BYTE056  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  114.均衡状态54                           $    $         $    $  ANS032.BYTE057  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  115.均衡状态55                           $    $         $    $  ANS032.BYTE058  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  116.均衡状态56                           $    $         $    $  ANS032.BYTE059  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  117.均衡状态57                           $    $         $    $  ANS032.BYTE060  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  118.均衡状态58                           $    $         $    $  ANS032.BYTE061  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  119.均衡状态59                           $    $         $    $  ANS032.BYTE062  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  120.均衡状态60                           $    $         $    $  ANS032.BYTE063  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  121.均衡状态61                           $    $         $    $  ANS032.BYTE064  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  122.均衡状态62                           $    $         $    $  ANS032.BYTE065  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  123.均衡状态63                           $    $         $    $  ANS032.BYTE066  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  124.均衡状态64                           $    $         $    $  ANS032.BYTE067  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  125.均衡状态65                           $    $         $    $  ANS032.BYTE068  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  126.均衡状态66                           $    $         $    $  ANS032.BYTE069  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  127.均衡状态67                           $    $         $    $  ANS032.BYTE070  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  128.均衡状态68                           $    $         $    $  ANS032.BYTE071  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  129.均衡状态69                           $    $         $    $  ANS032.BYTE072  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  130.均衡状态70                           $    $         $    $  ANS032.BYTE073  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  131.均衡状态71                           $    $         $    $  ANS032.BYTE074  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  132.均衡状态72                           $    $         $    $  ANS032.BYTE075  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  133.均衡状态73                           $    $         $    $  ANS032.BYTE076  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  134.均衡状态74                           $    $         $    $  ANS032.BYTE077  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  135.均衡状态75                           $    $         $    $  ANS032.BYTE078  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  136.均衡状态76                           $    $         $    $  ANS032.BYTE079  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  137.均衡状态77                           $    $         $    $  ANS032.BYTE080  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  138.均衡状态78                           $    $         $    $  ANS032.BYTE081  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  139.均衡状态79                           $    $         $    $  ANS032.BYTE082  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  140.均衡状态80                           $    $         $    $  ANS032.BYTE083  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  141.均衡状态81                           $    $         $    $  ANS032.BYTE084  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  142.均衡状态82                           $    $         $    $  ANS032.BYTE085  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  143.均衡状态83                           $    $         $    $  ANS032.BYTE086  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  144.均衡状态84                           $    $         $    $  ANS032.BYTE087  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  145.均衡状态85                           $    $         $    $  ANS032.BYTE088  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  146.均衡状态86                           $    $         $    $  ANS032.BYTE089  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  147.均衡状态87                           $    $         $    $  ANS032.BYTE090  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  148.均衡状态88                           $    $         $    $  ANS032.BYTE091  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  149.均衡状态89                           $    $         $    $  ANS032.BYTE092  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  150.均衡状态90                           $    $         $    $  ANS032.BYTE093  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  151.均衡状态91                           $    $         $    $  ANS032.BYTE094  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  152.均衡状态92                           $    $         $    $  ANS032.BYTE095  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  153.均衡状态93                           $    $         $    $  ANS032.BYTE096  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  154.均衡状态94                           $    $         $    $  ANS032.BYTE097  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  155.均衡状态95                           $    $         $    $  ANS032.BYTE098  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  156.均衡状态96                           $    $         $    $  ANS032.BYTE099  $  if(x==0) y=@0eaf;else if(x==1) y=@0eb0;else y=@0035;
  $  157.允许CMU初始化指令                    $    $         $    $  ANS033.BYTE004  $  if(x==0) y=@0ec1;else if(x==1) y=@0ec2;else y=@0035;

  $)  01.数据流2
  $  01.数据流2
  $  REQ000:748 03 22 E1 14 00 00 00 00       $  ANS000:7C8 03 22 E1 14 00 00 00 00
  $  REQ001:748 03 22 E1 13 00 00 00 00       $  ANS001:7C8 03 22 E1 13 00 00 00 00
  $  REQ002:748 03 22 E1 04 00 00 00 00       $  ANS002:7C8 03 22 E1 04 00 00 00 00
  $  REQ003:748 03 22 E0 67 00 00 00 00       $  ANS003:7C8 03 22 E0 67 00 00 00 00
  $  REQ004:748 03 22 E1 01 00 00 00 00       $  ANS004:7C8 03 22 E1 01 00 00 00 00
  $  REQ005:748 03 22 E1 00 00 00 00 00       $  ANS005:7C8 03 22 E1 00 00 00 00 00
  $  REQ006:748 03 22 E1 02 00 00 00 00       $  ANS006:7C8 03 22 E1 02 00 00 00 00
  $  REQ007:748 03 22 E1 18 00 00 00 00       $  ANS007:7C8 03 22 E1 18 00 00 00 00
  $  REQ008:748 03 22 E0 45 00 00 00 00       $  ANS008:7C8 03 22 E0 45 00 00 00 00
  $  REQ009:748 03 22 E0 44 00 00 00 00       $  ANS009:7C8 03 22 E0 44 00 00 00 00
  $  REQ010:748 03 22 E0 37 00 00 00 00       $  ANS010:7C8 03 22 E0 37 00 00 00 00
  $  REQ011:748 03 22 E0 36 00 00 00 00       $  ANS011:7C8 03 22 E0 36 00 00 00 00
  $  REQ012:748 03 22 E0 92 00 00 00 00       $  ANS012:7C8 03 22 E0 92 00 00 00 00
  $  REQ013:748 03 22 E1 20 00 00 00 00       $  ANS013:7C8 03 22 E1 20 00 00 00 00
  $  REQ014:748 03 22 E0 88 00 00 00 00       $  ANS014:7C8 03 22 E0 88 00 00 00 00
  $  REQ015:748 03 22 E1 25 00 00 00 00       $  ANS015:7C8 03 22 E1 25 00 00 00 00
  $  REQ016:748 03 22 E1 29 00 00 00 00       $  ANS016:7C8 03 22 E1 29 00 00 00 00
  $  REQ017:748 03 22 E0 74 00 00 00 00       $  ANS017:7C8 03 22 E0 74 00 00 00 00
  $  REQ018:748 03 22 E0 73 00 00 00 00       $  ANS018:7C8 03 22 E0 73 00 00 00 00
  $  REQ019:748 03 22 E0 90 00 00 00 00       $  ANS019:7C8 03 22 E0 90 00 00 00 00
  $  REQ020:748 03 22 E0 07 00 00 00 00       $  ANS020:7C8 03 22 E0 07 00 00 00 00
  $  REQ021:748 03 22 E1 26 00 00 00 00       $  ANS021:7C8 03 22 E1 26 00 00 00 00
  $  REQ022:748 03 22 E0 39 00 00 00 00       $  ANS022:7C8 03 22 E0 39 00 00 00 00
  $  REQ023:748 03 22 E0 63 00 00 00 00       $  ANS023:7C8 03 22 E0 63 00 00 00 00
  $  REQ024:748 03 22 E0 60 00 00 00 00       $  ANS024:7C8 03 22 E0 60 00 00 00 00
  $  REQ025:748 03 22 E0 98 00 00 00 00       $  ANS025:7C8 03 22 E0 98 00 00 00 00
  $  REQ026:748 03 22 E0 97 00 00 00 00       $  ANS026:7C8 03 22 E0 97 00 00 00 00
  $  REQ027:748 03 22 E0 99 00 00 00 00       $  ANS027:7C8 03 22 E0 99 00 00 00 00
  $  REQ028:748 03 22 E0 14 00 00 00 00       $  ANS028:7C8 03 22 E0 14 00 00 00 00
  $  REQ029:748 03 22 E1 17 00 00 00 00       $  ANS029:7C8 03 22 E1 17 00 00 00 00
  $  REQ030:748 03 22 E0 66 00 00 00 00       $  ANS030:7C8 03 22 E0 66 00 00 00 00
  $  REQ031:748 03 22 E1 06 00 00 00 00       $  ANS031:7C8 03 22 E1 06 00 00 00 00
  $  REQ032:748 03 22 E1 07 00 00 00 00       $  ANS032:7C8 03 22 E1 07 00 00 00 00
  $  REQ033:748 03 22 E1 16 00 00 00 00       $  ANS033:7C8 03 22 E1 16 00 00 00 00
  $  REQ034:748 03 22 E1 61 00 00 00 00       $  ANS034:7C8 03 22 E1 61 00 00 00 00
  $  REQ035:748 03 22 E0 56 00 00 00 00       $  ANS035:7C8 03 22 E0 56 00 00 00 00
  $  REQ036:748 03 22 E0 57 00 00 00 00       $  ANS036:7C8 03 22 E0 57 00 00 00 00
  $  REQ037:748 03 22 E0 87 00 00 00 00       $  ANS037:7C8 03 22 E0 87 00 00 00 00
  $  REQ038:748 03 22 E0 86 00 00 00 00       $  ANS038:7C8 03 22 E0 86 00 00 00 00
  $  REQ039:748 03 22 E0 38 00 00 00 00       $  ANS039:7C8 03 22 E0 38 00 00 00 00
  $  REQ040:748 03 22 E1 62 00 00 00 00       $  ANS040:7C8 03 22 E1 62 00 00 00 00
  $  REQ041:748 03 22 E0 85 00 00 00 00       $  ANS041:7C8 03 22 E0 85 00 00 00 00
  $  REQ042:748 03 22 E0 03 00 00 00 00       $  ANS042:7C8 03 22 E0 03 00 00 00 00
  $  REQ043:748 03 22 E0 54 00 00 00 00       $  ANS043:7C8 03 22 E0 54 00 00 00 00
  $  REQ044:748 03 22 E0 53 00 00 00 00       $  ANS044:7C8 03 22 E0 53 00 00 00 00
  $  REQ045:748 03 22 E0 70 00 00 00 00       $  ANS045:7C8 03 22 E0 70 00 00 00 00
  $  REQ046:748 03 22 E0 69 00 00 00 00       $  ANS046:7C8 03 22 E0 69 00 00 00 00
  $  REQ047:748 03 22 E0 42 00 00 00 00       $  ANS047:7C8 03 22 E0 42 00 00 00 00
  $  REQ048:748 03 22 E0 41 00 00 00 00       $  ANS048:7C8 03 22 E0 41 00 00 00 00
  $  REQ049:748 03 22 E0 64 00 00 00 00       $  ANS049:7C8 03 22 E0 64 00 00 00 00
  $  REQ050:748 03 22 E1 37 00 00 00 00       $  ANS050:7C8 03 22 E1 37 00 00 00 00
  $  REQ051:748 03 22 E1 38 00 00 00 00       $  ANS051:7C8 03 22 E1 38 00 00 00 00
  $  REQ052:748 03 22 E0 47 00 00 00 00       $  ANS052:7C8 03 22 E0 47 00 00 00 00
  $  REQ053:748 03 22 E1 10 00 00 00 00       $  ANS053:7C8 03 22 E1 10 00 00 00 00
  $  REQ054:748 03 22 E0 29 00 00 00 00       $  ANS054:7C8 03 22 E0 29 00 00 00 00
  $  REQ055:748 03 22 E0 30 00 00 00 00       $  ANS055:7C8 03 22 E0 30 00 00 00 00
  $  REQ056:748 03 22 E0 12 00 00 00 00       $  ANS056:7C8 03 22 E0 12 00 00 00 00
  $  REQ057:748 03 22 E0 20 00 00 00 00       $  ANS057:7C8 03 22 E0 20 00 00 00 00
  $  REQ058:748 03 22 E0 16 00 00 00 00       $  ANS058:7C8 03 22 E0 16 00 00 00 00
  $  REQ059:748 03 22 E0 15 00 00 00 00       $  ANS059:7C8 03 22 E0 15 00 00 00 00
  $  REQ060:748 03 22 E0 21 00 00 00 00       $  ANS060:7C8 03 22 E0 21 00 00 00 00
  $  REQ061:748 03 22 E1 19 00 00 00 00       $  ANS061:7C8 03 22 E1 19 00 00 00 00
  $  REQ062:748 03 22 E0 25 00 00 00 00       $  ANS062:7C8 03 22 E0 25 00 00 00 00
  $  REQ063:748 03 22 E0 26 00 00 00 00       $  ANS063:7C8 03 22 E0 26 00 00 00 00
  $  REQ064:748 03 22 E0 31 00 00 00 00       $  ANS064:7C8 03 22 E0 31 00 00 00 00
  $  REQ065:748 03 22 E0 32 00 00 00 00       $  ANS065:7C8 03 22 E0 32 00 00 00 00
  $  REQ066:748 03 22 E0 13 00 00 00 00       $  ANS066:7C8 03 22 E0 13 00 00 00 00
  $  REQ067:748 03 22 E0 22 00 00 00 00       $  ANS067:7C8 03 22 E0 22 00 00 00 00
  $  REQ068:748 03 22 E0 23 00 00 00 00       $  ANS068:7C8 03 22 E0 23 00 00 00 00
  $  REQ069:748 03 22 E0 17 00 00 00 00       $  ANS069:7C8 03 22 E0 17 00 00 00 00
  $  REQ070:748 03 22 E0 18 00 00 00 00       $  ANS070:7C8 03 22 E0 18 00 00 00 00
  $  REQ071:748 03 22 E0 27 00 00 00 00       $  ANS071:7C8 03 22 E0 27 00 00 00 00
  $  REQ072:748 03 22 E0 28 00 00 00 00       $  ANS072:7C8 03 22 E0 28 00 00 00 00
  $  REQ073:748 03 22 E0 59 00 00 00 00       $  ANS073:7C8 03 22 E0 59 00 00 00 00
  $  REQ074:748 03 22 E0 48 00 00 00 00       $  ANS074:7C8 03 22 E0 48 00 00 00 00
  $  REQ075:748 03 22 E1 05 00 00 00 00       $  ANS075:7C8 03 22 E1 05 00 00 00 00
  $  REQ076:748 03 22 E0 68 00 00 00 00       $  ANS076:7C8 03 22 E0 68 00 00 00 00
  $  REQ077:748 03 22 E0 10 00 00 00 00       $  ANS077:7C8 03 22 E0 10 00 00 00 00
  $  REQ078:748 03 22 E0 96 00 00 00 00       $  ANS078:7C8 03 22 E0 96 00 00 00 00
  $  REQ079:748 03 22 E0 04 00 00 00 00       $  ANS079:7C8 03 22 E0 04 00 00 00 00
  $  REQ080:748 03 22 E0 58 00 00 00 00       $  ANS080:7C8 03 22 E0 58 00 00 00 00
  $  REQ081:748 03 22 E0 06 00 00 00 00       $  ANS081:7C8 03 22 E0 06 00 00 00 00
  $  REQ082:748 03 22 E0 05 00 00 00 00       $  ANS082:7C8 03 22 E0 05 00 00 00 00
  $  REQ083:748 03 22 E0 62 00 00 00 00       $  ANS083:7C8 03 22 E0 62 00 00 00 00
  $  REQ084:748 03 22 E0 49 00 00 00 00       $  ANS084:7C8 03 22 E0 49 00 00 00 00
  $  REQ085:748 03 22 E0 11 00 00 00 00       $  ANS085:7C8 03 22 E0 11 00 00 00 00
  $  REQ086:748 03 22 E0 81 00 00 00 00       $  ANS086:7C8 03 22 E0 81 00 00 00 00
  $  REQ087:748 03 22 E0 82 00 00 00 00       $  ANS087:7C8 03 22 E0 82 00 00 00 00
  $  REQ088:748 03 22 E0 83 00 00 00 00       $  ANS088:7C8 03 22 E0 83 00 00 00 00
  $  REQ089:748 03 22 E0 84 00 00 00 00       $  ANS089:7C8 03 22 E0 84 00 00 00 00
  $  REQ090:748 03 22 E0 94 00 00 00 00       $  ANS090:7C8 03 22 E0 94 00 00 00 00
  $  REQ091:748 03 22 E0 55 00 00 00 00       $  ANS091:7C8 03 22 E0 55 00 00 00 00
  $  REQ092:748 03 22 E1 03 00 00 00 00       $  ANS092:7C8 03 22 E1 03 00 00 00 00
  $  REQ093:748 03 22 E0 95 00 00 00 00       $  ANS093:7C8 03 22 E0 95 00 00 00 00
  $  REQ094:748 03 22 E0 77 00 00 00 00       $  ANS094:7C8 03 22 E0 77 00 00 00 00
  $  REQ095:748 03 22 E0 78 00 00 00 00       $  ANS095:7C8 03 22 E0 78 00 00 00 00
  $  REQ096:748 03 22 E0 79 00 00 00 00       $  ANS096:7C8 03 22 E0 79 00 00 00 00
  $  REQ097:748 03 22 E0 65 00 00 00 00       $  ANS097:7C8 03 22 E0 65 00 00 00 00
  $  REQ098:748 03 22 E1 34 00 00 00 00       $  ANS098:7C8 03 22 E1 34 00 00 00 00
  $  REQ099:748 03 22 E0 08 00 00 00 00       $  ANS099:7C8 03 22 E0 08 00 00 00 00
  $  REQ100:748 03 22 E1 11 00 00 00 00       $  ANS100:7C8 03 22 E1 11 00 00 00 00
  $  REQ101:748 03 22 E0 71 00 00 00 00       $  ANS101:7C8 03 22 E0 71 00 00 00 00
  $  REQ102:748 03 22 E0 46 00 00 00 00       $  ANS102:7C8 03 22 E0 46 00 00 00 00
  $  REQ103:748 03 22 E0 40 00 00 00 00       $  ANS103:7C8 03 22 E0 40 00 00 00 00
  $  REQ104:748 03 22 E0 34 00 00 00 00       $  ANS104:7C8 03 22 E0 34 00 00 00 00

  $  000.单体温度值1                        $    $           $    $  ANS000.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  001.单体温度值2                        $    $           $    $  ANS000.BYTE005  $  y=((x&0x7F)-(x&0x80))-40;
  $  002.单体温度值3                        $    $           $    $  ANS000.BYTE006  $  y=((x&0x7F)-(x&0x80))-40;
  $  003.单体温度值4                        $    $           $    $  ANS000.BYTE007  $  y=((x&0x7F)-(x&0x80))-40;
  $  004.单体温度值5                        $    $           $    $  ANS000.BYTE008  $  y=((x&0x7F)-(x&0x80))-40;
  $  005.单体温度值6                        $    $           $    $  ANS000.BYTE009  $  y=((x&0x7F)-(x&0x80))-40;
  $  006.单体温度值7                        $    $           $    $  ANS000.BYTE010  $  y=((x&0x7F)-(x&0x80))-40;
  $  007.单体温度值8                        $    $           $    $  ANS000.BYTE011  $  y=((x&0x7F)-(x&0x80))-40;
  $  008.单体温度值9                        $    $           $    $  ANS000.BYTE012  $  y=((x&0x7F)-(x&0x80))-40;
  $  009.单体温度值10                       $    $           $    $  ANS000.BYTE013  $  y=((x&0x7F)-(x&0x80))-40;
  $  010.单体温度值11                       $    $           $    $  ANS000.BYTE014  $  y=((x&0x7F)-(x&0x80))-40;
  $  011.单体温度值12                       $    $           $    $  ANS000.BYTE015  $  y=((x&0x7F)-(x&0x80))-40;
  $  012.单体温度值13                       $    $           $    $  ANS000.BYTE016  $  y=((x&0x7F)-(x&0x80))-40;
  $  013.单体温度值14                       $    $           $    $  ANS000.BYTE017  $  y=((x&0x7F)-(x&0x80))-40;
  $  014.单体温度值15                       $    $           $    $  ANS000.BYTE018  $  y=((x&0x7F)-(x&0x80))-40;
  $  015.单体温度值16                       $    $           $    $  ANS000.BYTE019  $  y=((x&0x7F)-(x&0x80))-40;
  $  016.单体温度值17                       $    $           $    $  ANS000.BYTE020  $  y=((x&0x7F)-(x&0x80))-40;
  $  017.单体温度值18                       $    $           $    $  ANS000.BYTE021  $  y=((x&0x7F)-(x&0x80))-40;
  $  018.单体温度值19                       $    $           $    $  ANS000.BYTE022  $  y=((x&0x7F)-(x&0x80))-40;
  $  019.单体温度值20                       $    $           $    $  ANS000.BYTE023  $  y=((x&0x7F)-(x&0x80))-40;
  $  020.单体温度值21                       $    $           $    $  ANS000.BYTE024  $  y=((x&0x7F)-(x&0x80))-40;
  $  021.单体温度值22                       $    $           $    $  ANS000.BYTE025  $  y=((x&0x7F)-(x&0x80))-40;
  $  022.单体温度值23                       $    $           $    $  ANS000.BYTE026  $  y=((x&0x7F)-(x&0x80))-40;
  $  023.单体温度值24                       $    $           $    $  ANS000.BYTE027  $  y=((x&0x7F)-(x&0x80))-40;
  $  024.单体温度值25                       $    $           $    $  ANS000.BYTE028  $  y=((x&0x7F)-(x&0x80))-40;
  $  025.单体温度值26                       $    $           $    $  ANS000.BYTE029  $  y=((x&0x7F)-(x&0x80))-40;
  $  026.单体温度值27                       $    $           $    $  ANS000.BYTE030  $  y=((x&0x7F)-(x&0x80))-40;
  $  027.单体温度值28                       $    $           $    $  ANS000.BYTE031  $  y=((x&0x7F)-(x&0x80))-40;
  $  028.单体温度值29                       $    $           $    $  ANS000.BYTE032  $  y=((x&0x7F)-(x&0x80))-40;
  $  029.单体温度值30                       $    $           $    $  ANS000.BYTE033  $  y=((x&0x7F)-(x&0x80))-40;
  $  030.单体温度值31                       $    $           $    $  ANS000.BYTE034  $  y=((x&0x7F)-(x&0x80))-40;
  $  031.单体温度值32                       $    $           $    $  ANS000.BYTE035  $  y=((x&0x7F)-(x&0x80))-40;
  $  032.单体温度值33                       $    $           $    $  ANS000.BYTE036  $  y=((x&0x7F)-(x&0x80))-40;
  $  033.单体温度值34                       $    $           $    $  ANS000.BYTE037  $  y=((x&0x7F)-(x&0x80))-40;
  $  034.单体温度值35                       $    $           $    $  ANS000.BYTE038  $  y=((x&0x7F)-(x&0x80))-40;
  $  035.单体温度值36                       $    $           $    $  ANS000.BYTE039  $  y=((x&0x7F)-(x&0x80))-40;
  $  036.单体温度值37                       $    $           $    $  ANS000.BYTE040  $  y=((x&0x7F)-(x&0x80))-40;
  $  037.单体温度值38                       $    $           $    $  ANS000.BYTE041  $  y=((x&0x7F)-(x&0x80))-40;
  $  038.单体温度值39                       $    $           $    $  ANS000.BYTE042  $  y=((x&0x7F)-(x&0x80))-40;
  $  039.单体温度值40                       $    $           $    $  ANS000.BYTE043  $  y=((x&0x7F)-(x&0x80))-40;
  $  040.单体电压值1                        $    $  mV       $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  041.单体电压值2                        $    $  mV       $    $  ANS001.BYTE006  $  y=(x1*256+x2);
  $  042.单体电压值3                        $    $  mV       $    $  ANS001.BYTE008  $  y=(x1*256+x2);
  $  043.单体电压值4                        $    $  mV       $    $  ANS001.BYTE010  $  y=(x1*256+x2);
  $  044.单体电压值5                        $    $  mV       $    $  ANS001.BYTE012  $  y=(x1*256+x2);
  $  045.单体电压值6                        $    $  mV       $    $  ANS001.BYTE014  $  y=(x1*256+x2);
  $  046.单体电压值7                        $    $  mV       $    $  ANS001.BYTE016  $  y=(x1*256+x2);
  $  047.单体电压值8                        $    $  mV       $    $  ANS001.BYTE018  $  y=(x1*256+x2);
  $  048.单体电压值9                        $    $  mV       $    $  ANS001.BYTE020  $  y=(x1*256+x2);
  $  049.单体电压值10                       $    $  mV       $    $  ANS001.BYTE022  $  y=(x1*256+x2);
  $  050.单体电压值11                       $    $  mV       $    $  ANS001.BYTE024  $  y=(x1*256+x2);
  $  051.单体电压值12                       $    $  mV       $    $  ANS001.BYTE026  $  y=(x1*256+x2);
  $  052.单体电压值13                       $    $  mV       $    $  ANS001.BYTE028  $  y=(x1*256+x2);
  $  053.单体电压值14                       $    $  mV       $    $  ANS001.BYTE030  $  y=(x1*256+x2);
  $  054.单体电压值15                       $    $  mV       $    $  ANS001.BYTE032  $  y=(x1*256+x2);
  $  055.单体电压值16                       $    $  mV       $    $  ANS001.BYTE034  $  y=(x1*256+x2);
  $  056.单体电压值17                       $    $  mV       $    $  ANS001.BYTE036  $  y=(x1*256+x2);
  $  057.单体电压值18                       $    $  mV       $    $  ANS001.BYTE038  $  y=(x1*256+x2);
  $  058.单体电压值19                       $    $  mV       $    $  ANS001.BYTE040  $  y=(x1*256+x2);
  $  059.单体电压值20                       $    $  mV       $    $  ANS001.BYTE042  $  y=(x1*256+x2);
  $  060.单体电压值21                       $    $  mV       $    $  ANS001.BYTE044  $  y=(x1*256+x2);
  $  061.单体电压值22                       $    $  mV       $    $  ANS001.BYTE046  $  y=(x1*256+x2);
  $  062.单体电压值23                       $    $  mV       $    $  ANS001.BYTE048  $  y=(x1*256+x2);
  $  063.单体电压值24                       $    $  mV       $    $  ANS001.BYTE050  $  y=(x1*256+x2);
  $  064.单体电压值25                       $    $  mV       $    $  ANS001.BYTE052  $  y=(x1*256+x2);
  $  065.单体电压值26                       $    $  mV       $    $  ANS001.BYTE054  $  y=(x1*256+x2);
  $  066.单体电压值27                       $    $  mV       $    $  ANS001.BYTE056  $  y=(x1*256+x2);
  $  067.单体电压值28                       $    $  mV       $    $  ANS001.BYTE058  $  y=(x1*256+x2);
  $  068.单体电压值29                       $    $  mV       $    $  ANS001.BYTE060  $  y=(x1*256+x2);
  $  069.单体电压值30                       $    $  mV       $    $  ANS001.BYTE062  $  y=(x1*256+x2);
  $  070.单体电压值31                       $    $  mV       $    $  ANS001.BYTE064  $  y=(x1*256+x2);
  $  071.单体电压值32                       $    $  mV       $    $  ANS001.BYTE066  $  y=(x1*256+x2);
  $  072.单体电压值33                       $    $  mV       $    $  ANS001.BYTE068  $  y=(x1*256+x2);
  $  073.单体电压值34                       $    $  mV       $    $  ANS001.BYTE070  $  y=(x1*256+x2);
  $  074.单体电压值35                       $    $  mV       $    $  ANS001.BYTE072  $  y=(x1*256+x2);
  $  075.单体电压值36                       $    $  mV       $    $  ANS001.BYTE074  $  y=(x1*256+x2);
  $  076.单体电压值37                       $    $  mV       $    $  ANS001.BYTE076  $  y=(x1*256+x2);
  $  077.单体电压值38                       $    $  mV       $    $  ANS001.BYTE078  $  y=(x1*256+x2);
  $  078.单体电压值39                       $    $  mV       $    $  ANS001.BYTE080  $  y=(x1*256+x2);
  $  079.单体电压值40                       $    $  mV       $    $  ANS001.BYTE082  $  y=(x1*256+x2);
  $  080.单体电压值41                       $    $  mV       $    $  ANS001.BYTE084  $  y=(x1*256+x2);
  $  081.单体电压值42                       $    $  mV       $    $  ANS001.BYTE086  $  y=(x1*256+x2);
  $  082.单体电压值43                       $    $  mV       $    $  ANS001.BYTE088  $  y=(x1*256+x2);
  $  083.单体电压值44                       $    $  mV       $    $  ANS001.BYTE090  $  y=(x1*256+x2);
  $  084.单体电压值45                       $    $  mV       $    $  ANS001.BYTE092  $  y=(x1*256+x2);
  $  085.单体电压值46                       $    $  mV       $    $  ANS001.BYTE094  $  y=(x1*256+x2);
  $  086.单体电压值47                       $    $  mV       $    $  ANS001.BYTE096  $  y=(x1*256+x2);
  $  087.单体电压值48                       $    $  mV       $    $  ANS001.BYTE098  $  y=(x1*256+x2);
  $  088.单体电压值49                       $    $  mV       $    $  ANS001.BYTE100  $  y=(x1*256+x2);
  $  089.单体电压值50                       $    $  mV       $    $  ANS001.BYTE102  $  y=(x1*256+x2);
  $  090.单体电压值51                       $    $  mV       $    $  ANS001.BYTE104  $  y=(x1*256+x2);
  $  091.单体电压值52                       $    $  mV       $    $  ANS001.BYTE106  $  y=(x1*256+x2);
  $  092.单体电压值53                       $    $  mV       $    $  ANS001.BYTE108  $  y=(x1*256+x2);
  $  093.单体电压值54                       $    $  mV       $    $  ANS001.BYTE110  $  y=(x1*256+x2);
  $  094.单体电压值55                       $    $  mV       $    $  ANS001.BYTE112  $  y=(x1*256+x2);
  $  095.单体电压值56                       $    $  mV       $    $  ANS001.BYTE114  $  y=(x1*256+x2);
  $  096.充电枪指示灯连接状态               $    $           $    $  ANS002.BYTE004  $  if(x==0) y=@0339;else if(x==1) y=@0354;else y=@0035;
  $  097.充电连接指示灯诊断电压             $    $  V        $    $  ANS003.BYTE004  $  y=x*0.1;
  $  098.充电持续功率                       $    $  kW       $    $  ANS004.BYTE004  $  y=(x1*256+x2)*0.1;
  $  099.充电峰值功率                       $    $  kW       $    $  ANS005.BYTE004  $  y=(x1*256+x2)*0.1;
  $  100.充电功率时间系数                   $    $  %        $    $  ANS006.BYTE004  $  y=(x1*256+x2);
  $  101.控制闭合S2开关信号                 $    $           $    $  ANS007.BYTE004  $  if(x==0) y=@0339;else if(x==1) y=@0354;else y=@0035;
  $  102.碰撞输入信号占空比                 $    $  %        $    $  ANS008.BYTE004  $  y=x;
  $  103.碰撞输入信号频率                   $    $  Hz       $    $  ANS009.BYTE004  $  y=(x1*256+x2);
  $  104.继电器连接状态                     $    $           $    $  ANS010.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0eb1;else if(x==2) y=@0eb2;else if(x==3) y=@0eb3;else if(x==4) y=@0eb4;else y=@0035;
  $  105.继电器控制状态                     $    $           $    $  ANS011.BYTE004  $  if(x==0) y=@0eb5;else if(x==1) y=@0354;else if(x==2) y=@0bfd;else if(x==3) y=@0eb6;else if(x==4) y=@000f;else if(x==5) y=@0eb7;else if(x==6) y=@0253;else if(x==7) y=@0eb8;else y=@0035;
  $  106.DCC状态                            $    $           $    $  ANS012.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0eb9;else if(x==2) y=@0eba;else if(x==3) y=@0ebb;else if(x==4) y=@0ebc;else if(x==5) y=@09f2;else if(x==6) y=@0ebd;else y=@0035;
  $  107.CHM中DC充电继电器闭合指令          $    $           $    $  ANS013.BYTE004  $  if(x==0) y=@0339;else if(x==1) y=@0354;else y=@0035;
  $  108.DC充电请求电流值                   $    $  A        $    $  ANS014.BYTE004  $  y=(x1*256+x2)*0.1;
  $  109.DC充电截止电压值                   $    $  mV       $    $  ANS015.BYTE004  $  y=(x1*256+x2);
  $  110.DC充电枪最高温度                   $    $           $    $  ANS016.BYTE004  $  y=((x&0x7F)-(x&0x80))-40;
  $  111.DC充电枪负极端温度对应电阻值       $    $           $    $  ANS017.BYTE004  $  if(x1<0x80) y=x1*256*256*256+x2*256*256+x3*256+x4;else y=(x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000;
  $  112.DC充电枪正极端温度对应电阻值       $    $           $    $  ANS018.BYTE004  $  if(x1<0x80) y=x1*256*256*256+x2*256*256+x3*256+x4;else y=(x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000;
  $  113.DC充电状态                         $    $           $    $  ANS019.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0e9f;else if(x==2) y=@0ebe;else if(x==3) y=@0a13;else if(x==4) y=@0036;else y=@0035;
  $  114.DC充电电压值                       $    $  V        $    $  ANS020.BYTE004  $  y=(x1*256+x2)*0.1;
  $  115.DC充电加热继电器闭合指令           $    $           $    $  ANS021.BYTE004  $  if(x==0) y=@0339;else if(x==1) y=@0354;else y=@0035;
  $  116.直流母线电压                       $    $  V        $    $  ANS022.BYTE004  $  y=(x1*256+x2)*0.1;
  $  117.DC负继电器驱动端电压               $    $  V        $    $  ANS023.BYTE004  $  y=x*0.1;
  $  118.DC继电器驱动端电压值               $    $  V        $    $  ANS024.BYTE004  $  y=x*0.1;
  $  119.放电持续功率                       $    $  kW       $    $  ANS025.BYTE004  $  y=(x1*256+x2)*0.1;
  $  120.放电峰值功率                       $    $  kW       $    $  ANS026.BYTE004  $  y=(x1*256+x2)*0.1;
  $  121.放电功率时间系数                   $    $  %        $    $  ANS027.BYTE004  $  y=(x1*256+x2);
  $  122.SOC显示值                          $    $  %        $    $  ANS028.BYTE004  $  y=(x1*256+x2)*0.01;
  $  123.整车上电指令                       $    $           $    $  ANS029.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0ec5;else if(x==2) y=@0ec6;else if(x==3) y=@0ec7;else y=@0035;
  $  124.电子锁驱动诊断电压                 $    $  V        $    $  ANS030.BYTE004  $  y=x*0.1;
  $  125.诊断通道选择                       $    $           $    $  ANS031.BYTE004  $  if(x==0) y=@0ec8;else if(x==1) y=@0ec9;else y=@0035;
  $  126.电子锁动作状态                     $    $           $    $  ANS032.BYTE004  $  if(x==0) y=@06c7;else if(x==1) y=@0052;else if(x==2) y=@0055;else if(x==3) y=@06cb;else y=@0035;
  $  127.禁止进入FBL标志位                  $    $           $    $  ANS033.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0eca;else y=@0035;
  $  128.风扇反馈输入的PWM占空比            $    $           $    $  ANS034.BYTE004  $  y=x;
  $  129.高边驱动电流对应诊断电压           $    $  V        $    $  ANS035.BYTE004  $  y=x*0.1;
  $  130.高边驱动端电压值                   $    $  V        $    $  ANS036.BYTE004  $  y=x*0.1;
  $  131.绝缘采样中主负侧采样电压值         $    $  V        $    $  ANS037.BYTE004  $  y=(x1*256+x2)*0.1;
  $  132.绝缘采样中主正侧采样电压值         $    $  V        $    $  ANS038.BYTE004  $  y=(x1*256+x2)*0.1;
  $  133.绝缘阻值                           $    $           $    $  ANS039.BYTE004  $  y=(x1*256+x2);
  $  134.MOS闭合时的HVL电压                 $    $  V        $    $  ANS040.BYTE004  $  y=x*0.1;
  $  135.霍尔电流传感器电源电压             $    $  V        $    $  ANS041.BYTE004  $  y=x*0.1;
  $  136.ODO里程                            $    $  km       $    $  ANS042.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  137.CMU Fault输入硬线PWM占空比         $    $  %        $    $  ANS043.BYTE004  $  y=x;
  $  138.CMU Fault输入硬线PWM频率           $    $  Hz       $    $  ANS044.BYTE004  $  y=((x&0x7F)-(x&0x80));
  $  139.冷却水泵反馈输入的PWM占空比        $    $  %        $    $  ANS045.BYTE004  $  y=x;
  $  140.冷却水泵反馈输入的PWM频率          $    $  Hz       $    $  ANS046.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000));
  $  141.HVIL输入占空比                     $    $  %        $    $  ANS047.BYTE004  $  y=x;
  $  142.HVIL输入频率                       $    $  Hz       $    $  ANS048.BYTE004  $  y=(x1*256+x2);
  $  143.K5的驱动电压                       $    $  V        $    $  ANS049.BYTE004  $  y=x*0.1;
  $  144.系统KL15供电电压                   $    $  V        $    $  ANS050.BYTE004  $  y=(x1*256+x2)*0.1;
  $  145.系统KL30供电电压                   $    $  V        $    $  ANS051.BYTE004  $  y=(x1*256+x2)*0.1;
  $  146.驱动电路供电电压                   $    $  V        $    $  ANS052.BYTE004  $  y=x*0.1;
  $  147.电子锁闭锁连续动作次数             $    $           $    $  ANS053.BYTE004  $  y=x;
  $  148.CMU PCB最高温度                    $    $           $    $  ANS054.BYTE004  $  y=x-40;
  $  149.CMU PCB最高温度编号                $    $           $    $  ANS055.BYTE004  $  y=x;
  $  150.单体最大SOC值                      $    $  %        $    $  ANS056.BYTE004  $  y=(x1*256+x2)*0.01;
  $  151.单体最高温度                       $    $           $    $  ANS057.BYTE004  $  y=x-40;
  $  152.最高温度单体编号                   $    $           $    $  ANS058.BYTE004  $  y=x;
  $  153.单体最大电压值                     $    $  mV       $    $  ANS059.BYTE004  $  y=(x1*256+x2);
  $  154.最大电压单体编号                   $    $           $    $  ANS060.BYTE004  $  y=x;
  $  155.电芯最大充电能力                   $    $  A        $    $  ANS061.BYTE004  $  y=(x1*256+x2)*0.1;
  $  156.加热膜最高温度                     $    $           $    $  ANS062.BYTE004  $  y=x-40;
  $  157.加热膜最高温度编号                 $    $           $    $  ANS063.BYTE004  $  y=x;
  $  158.CMU PCB最低温度                    $    $           $    $  ANS064.BYTE004  $  y=x-40;
  $  159.CMU PCB最低温度编号                $    $           $    $  ANS065.BYTE004  $  y=x;
  $  160.单体最小SOC值                      $    $  %        $    $  ANS066.BYTE004  $  y=(x1*256+x2)*0.01;
  $  161.单体最低温度                       $    $           $    $  ANS067.BYTE004  $  y=x-40;
  $  162.最低温度单体编号                   $    $           $    $  ANS068.BYTE004  $  y=x;
  $  163.单体最小电压值                     $    $  mV       $    $  ANS069.BYTE004  $  y=(x1*256+x2);
  $  164.最小电压单体编号                   $    $           $    $  ANS070.BYTE004  $  y=x;
  $  165.加热膜最低温度                     $    $           $    $  ANS071.BYTE004  $  y=x-40;
  $  166.加热膜最低温度编号                 $    $           $    $  ANS072.BYTE004  $  y=x;
  $  167.主负继电器驱动端电压值             $    $  V        $    $  ANS073.BYTE004  $  y=x*0.1;
  $  168.OBC故障码                          $    $           $    $  ANS074.BYTE004  $  y=x;
  $  169.正在充电指示灯状态                 $    $           $    $  ANS075.BYTE004  $  if(x==0) y=@0ecb;else if(x==1) y=@09f1;else y=@0035;
  $  170.正在充电指示灯诊断电压             $    $  V        $    $  ANS076.BYTE004  $  y=x*0.1;
  $  171.电池包电流值                       $    $  A        $    $  ANS077.BYTE004  $  y=(x1*256+x2)*0.1-500;
  $  172.电池包剩余电量                     $    $  %        $    $  ANS078.BYTE004  $  y=(x1*256+x2);
  $  173.电池包电压值                       $    $  V        $    $  ANS079.BYTE004  $  y=(x1*256+x2)*0.1;
  $  174.主正继电器驱动端电压值             $    $  V        $    $  ANS080.BYTE004  $  y=x*0.1;
  $  175.冗余预充电压值                     $    $  V        $    $  ANS081.BYTE004  $  y=(x1*256+x2)*0.1;
  $  176.预充电压值                         $    $  V        $    $  ANS082.BYTE004  $  y=(x1*256+x2)*0.1;
  $  177.预充继电器驱动端电压值             $    $  V        $    $  ANS083.BYTE004  $  y=x*0.1;
  $  178.上拉供电电压                       $    $  V        $    $  ANS084.BYTE004  $  y=x*0.1;
  $  179.冗余电池包电流值                   $    $  A        $    $  ANS085.BYTE004  $  y=(x1*256+x2)*0.1-500;
  $  180.预留AD2电压值                      $    $  V        $    $  ANS086.BYTE004  $  y=x*0.1;
  $  181.预留AD3电压值                      $    $  V        $    $  ANS087.BYTE004  $  y=x*0.1;
  $  182.预留AD4电压值                      $    $  V        $    $  ANS088.BYTE004  $  y=x*0.1;
  $  183.预留AD5电压值                      $    $  V        $    $  ANS089.BYTE004  $  y=x*0.1;
  $  184.SBC故障状态                        $    $           $    $  ANS090.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  185.SBC唤醒状态                        $    $           $    $  ANS091.BYTE004  $  y=x;
  $  186.BMU上次下电状态                    $    $           $    $  ANS092.BYTE004  $  if(x==1) y=@0ecc;else if(x==2) y=@064d;else if(x==3) y=@0ecd;else y=@0035;
  $  187.目标剩余电量                       $    $  %        $    $  ANS093.BYTE004  $  y=(x1*256+x2);
  $  188.BMU 温度5外接NTC阻值               $    $           $    $  ANS094.BYTE004  $  if(x1<0x80) y=x1*256*256*256+x2*256*256+x3*256+x4;else y=(x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000;
  $  189.BMU 温度6外接NTC阻值               $    $           $    $  ANS095.BYTE004  $  if(x1<0x80) y=x1*256*256*256+x2*256*256+x3*256+x4;else y=(x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000;
  $  190.BMU 温度7外接NTC阻值               $    $           $    $  ANS096.BYTE004  $  if(x1<0x80) y=x1*256*256*256+x2*256*256+x3*256+x4;else y=(x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000;
  $  191.加热继电器驱动端电压值             $    $  V        $    $  ANS097.BYTE004  $  y=x*0.1;
  $  192.加热膜温度1                        $    $           $    $  ANS098.BYTE004  $  y=x-40;
  $  193.加热膜温度2                        $    $           $    $  ANS098.BYTE005  $  y=x-40;
  $  194.加热膜温度3                        $    $           $    $  ANS098.BYTE006  $  y=x-40;
  $  195.加热膜温度4                        $    $           $    $  ANS098.BYTE007  $  y=x-40;
  $  196.加热膜温度5                        $    $           $    $  ANS098.BYTE008  $  y=x-40;
  $  197.加热膜温度6                        $    $           $    $  ANS098.BYTE009  $  y=x-40;
  $  198.加热膜温度7                        $    $           $    $  ANS098.BYTE010  $  y=x-40;
  $  199.加热膜温度8                        $    $           $    $  ANS098.BYTE011  $  y=x-40;
  $  200.加热膜温度9                        $    $           $    $  ANS098.BYTE012  $  y=x-40;
  $  201.加热膜温度10                       $    $           $    $  ANS098.BYTE013  $  y=x-40;
  $  202.加热膜温度11                       $    $           $    $  ANS098.BYTE014  $  y=x-40;
  $  203.加热膜温度12                       $    $           $    $  ANS098.BYTE015  $  y=x-40;
  $  204.加热膜温度13                       $    $           $    $  ANS098.BYTE016  $  y=x-40;
  $  205.加热膜温度14                       $    $           $    $  ANS098.BYTE017  $  y=x-40;
  $  206.加热膜温度15                       $    $           $    $  ANS098.BYTE018  $  y=x-40;
  $  207.加热膜温度16                       $    $           $    $  ANS098.BYTE019  $  y=x-40;
  $  208.加热膜电压值                       $    $  V        $    $  ANS099.BYTE004  $  y=(x1*256+x2)*0.1;
  $  209.电子锁解锁连续动作次数             $    $           $    $  ANS100.BYTE004  $  y=x;
  $  210.冷却阀控制驱动诊断电压值           $    $  V        $    $  ANS101.BYTE004  $  y=x*0.1;
  $  211.整车碰撞信号                       $    $           $    $  ANS102.BYTE004  $  if(x==0) y=@0ece;else if(x==1) y=@0125;else y=@0035;
  $  212.车辆行驶速度                       $    $  km/h     $    $  ANS103.BYTE004  $  y=(x1*256+x2)*0.01;
  $  213.唤醒源                             $    $           $    $  ANS104.BYTE004  $  if(x==0) y=@0198;else if(x==1) y=@0ecf;else if(x==2) y=@0ed0;else if(x==3) y=@0ed1;else if(x==4) y=@0ed2;else if(x==5) y=@0ed3;else if(x==6) y=@0ed4;else if(x==7) y=@0ed5;else if(x==8) y=@0ed6;else y=@0035;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:748 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
