
    车型ID：10cb

    模拟：协议模拟-->10cb

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:745 02 10 01 00 00 00 00 00       $~  ANS000:7C5 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:745 02 3E 80 00 00 00 00 00       $!  ANS000:7C5 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:745 03 19 02 09 00 00 00 00       $#  ANS000:7C5 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/c8000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:745 04 14 FF FF FF 00 00 00       $$  ANS000:7C5 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:745 03 22 F1 A0 00 00 00 00       $%  ANS000:7C5 03 22 F1 A0 00 00 00 00
  $%  REQ001:745 03 22 F1 83 00 00 00 00       $%  ANS001:7C5 03 22 F1 83 00 00 00 00
  $%  REQ002:745 03 22 F1 A1 00 00 00 00       $%  ANS002:7C5 03 22 F1 A1 00 00 00 00
  $%  REQ003:745 03 22 F1 91 00 00 00 00       $%  ANS003:7C5 03 22 F1 91 00 00 00 00
  $%  REQ004:745 03 22 F1 87 00 00 00 00       $%  ANS004:7C5 03 22 F1 87 00 00 00 00
  $%  REQ005:745 03 22 F1 10 00 00 00 00       $%  ANS005:7C5 03 22 F1 10 00 00 00 00
  $%  REQ006:745 03 22 F1 92 00 00 00 00       $%  ANS006:7C5 03 22 F1 92 00 00 00 00
  $%  REQ007:745 03 22 F1 8C 00 00 00 00       $%  ANS007:7C5 03 22 F1 8C 00 00 00 00
  $%  REQ008:745 03 22 F1 94 00 00 00 00       $%  ANS008:7C5 03 22 F1 94 00 00 00 00
  $%  REQ009:745 03 22 F1 8A 00 00 00 00       $%  ANS009:7C5 03 22 F1 8A 00 00 00 00
  $%  REQ010:745 03 22 F1 90 00 00 00 00       $%  ANS010:7C5 03 22 F1 90 00 00 00 00
  $%  REQ011:745 03 22 F1 A8 00 00 00 00       $%  ANS011:7C5 03 22 F1 A8 00 00 00 00
  $%  REQ012:745 03 22 F1 8B 00 00 00 00       $%  ANS012:7C5 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元零件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号(上次):            $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  006:测试工具参考号(上次):            $%    $%  ANS005.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  007:里程读数(上次):                  $%    $%  ANS005.BYTE015  $%  HEX(X1,X2,X3);
  $%  008:供应商电控单元硬件参考号:        $%    $%  ANS006.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  009:供应商电控单元序列号:            $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  010:供应商电控单元软件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  011:系统供应商标识号:                $%    $%  ANS009.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  012:车辆识别代码:                    $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  013:车辆特征信息:                    $%    $%  ANS011.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  014:电控单元制造日期:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:745 03 22 C2 01 00 00 00 00       $  ANS000:7C5 03 22 C2 01 00 00 00 00
  $  REQ001:745 03 22 B0 15 00 00 00 00       $  ANS001:7C5 03 22 B0 15 00 00 00 00
  $  REQ002:745 03 22 B0 16 00 00 00 00       $  ANS002:7C5 03 22 B0 16 00 00 00 00
  $  REQ003:745 03 22 B0 17 00 00 00 00       $  ANS003:7C5 03 22 B0 17 00 00 00 00
  $  REQ004:745 03 22 B0 00 00 00 00 00       $  ANS004:7C5 03 22 B0 00 00 00 00 00

  $  000.车道保持辅助系统       $    $       $    $  ANS000.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00b2;else y=@0035;
  $  001.自动泊车辅助系统       $    $       $    $  ANS000.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00b2;else y=@0035;
  $  002.调谐                   $    $       $    $  ANS000.BYTE004  $  if(((x&0x30)>>4)==0) y=@1113;else if(((x&0x30)>>4)==1) y=@1114;else if(((x&0x30)>>4)==2) y=@1115;else if(((x&0x30)>>4)==3) y=@1116;else y=@0035;
  $  003.启动/停止              $    $       $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00b2;else y=@0035;
  $  004.PDC斜坡补偿            $    $       $    $  ANS000.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00b2;else y=@0035;
  $  005.摆振                   $    $       $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00b2;else y=@0035;
  $  006.DTC号码1               $    $       $    $  ANS001.BYTE004  $  HEX(X1,X2,X3);
  $  007.DTC状态1               $    $       $    $  ANS001.BYTE007  $  HEX(X1);
  $  008.错误代码1              $    $       $    $  ANS001.BYTE008  $  HEX(X1,X2);
  $  009.错误类型1              $    $       $    $  ANS001.BYTE010  $  HEX(X1,X2);
  $  010.频率计数器1            $    $       $    $  ANS001.BYTE012  $  HEX(X1);
  $  011.后退计数器1            $    $       $    $  ANS001.BYTE013  $  HEX(X1);
  $  012.环境条件1              $    $       $    $  ANS001.BYTE014  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  013.DTC号码2               $    $       $    $  ANS001.BYTE034  $  HEX(X1,X2,X3);
  $  014.DTC状态2               $    $       $    $  ANS001.BYTE037  $  HEX(X1);
  $  015.错误代码2              $    $       $    $  ANS001.BYTE038  $  HEX(X1,X2);
  $  016.错误类型2              $    $       $    $  ANS001.BYTE040  $  HEX(X1,X2);
  $  017.频率计数器2            $    $       $    $  ANS001.BYTE042  $  HEX(X1);
  $  018.后退计数器2            $    $       $    $  ANS001.BYTE043  $  HEX(X1);
  $  019.环境条件2              $    $       $    $  ANS001.BYTE044  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  020.DTC号码3               $    $       $    $  ANS001.BYTE064  $  HEX(X1,X2,X3);
  $  021.DTC状态3               $    $       $    $  ANS001.BYTE067  $  HEX(X1);
  $  022.错误代码3              $    $       $    $  ANS001.BYTE068  $  HEX(X1,X2);
  $  023.错误类型3              $    $       $    $  ANS001.BYTE070  $  HEX(X1,X2);
  $  024.频率计数器3            $    $       $    $  ANS001.BYTE072  $  HEX(X1);
  $  025.后退计数器3            $    $       $    $  ANS001.BYTE073  $  HEX(X1);
  $  026.环境条件3              $    $       $    $  ANS001.BYTE074  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  027.DTC号码4               $    $       $    $  ANS001.BYTE094  $  HEX(X1,X2,X3);
  $  028.DTC状态4               $    $       $    $  ANS001.BYTE097  $  HEX(X1);
  $  029.错误代码4              $    $       $    $  ANS001.BYTE098  $  HEX(X1,X2);
  $  030.错误类型4              $    $       $    $  ANS001.BYTE100  $  HEX(X1,X2);
  $  031.频率计数器4            $    $       $    $  ANS001.BYTE102  $  HEX(X1);
  $  032.后退计数器4            $    $       $    $  ANS001.BYTE103  $  HEX(X1);
  $  033.环境条件4              $    $       $    $  ANS001.BYTE104  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  034.DTC号码5               $    $       $    $  ANS001.BYTE124  $  HEX(X1,X2,X3);
  $  035.DTC状态5               $    $       $    $  ANS001.BYTE127  $  HEX(X1);
  $  036.错误代码5              $    $       $    $  ANS001.BYTE128  $  HEX(X1,X2);
  $  037.错误类型5              $    $       $    $  ANS001.BYTE130  $  HEX(X1,X2);
  $  038.频率计数器5            $    $       $    $  ANS001.BYTE132  $  HEX(X1);
  $  039.后退计数器5            $    $       $    $  ANS001.BYTE133  $  HEX(X1);
  $  040.环境条件5              $    $       $    $  ANS001.BYTE134  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  041.DTC号码6               $    $       $    $  ANS001.BYTE154  $  HEX(X1,X2,X3);
  $  042.DTC状态6               $    $       $    $  ANS001.BYTE157  $  HEX(X1);
  $  043.错误代码6              $    $       $    $  ANS001.BYTE158  $  HEX(X1,X2);
  $  044.错误类型6              $    $       $    $  ANS001.BYTE160  $  HEX(X1,X2);
  $  045.频率计数器6            $    $       $    $  ANS001.BYTE162  $  HEX(X1);
  $  046.后退计数器6            $    $       $    $  ANS001.BYTE163  $  HEX(X1);
  $  047.环境条件6              $    $       $    $  ANS001.BYTE164  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  048.DTC号码7               $    $       $    $  ANS001.BYTE184  $  HEX(X1,X2,X3);
  $  049.DTC状态7               $    $       $    $  ANS001.BYTE187  $  HEX(X1);
  $  050.错误代码7              $    $       $    $  ANS001.BYTE188  $  HEX(X1,X2);
  $  051.错误类型7              $    $       $    $  ANS001.BYTE190  $  HEX(X1,X2);
  $  052.频率计数器7            $    $       $    $  ANS001.BYTE192  $  HEX(X1);
  $  053.后退计数器7            $    $       $    $  ANS001.BYTE193  $  HEX(X1);
  $  054.环境条件7              $    $       $    $  ANS001.BYTE194  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  055.DTC号码8               $    $       $    $  ANS001.BYTE214  $  HEX(X1,X2,X3);
  $  056.DTC状态8               $    $       $    $  ANS001.BYTE217  $  HEX(X1);
  $  057.错误代码8              $    $       $    $  ANS001.BYTE218  $  HEX(X1,X2);
  $  058.错误类型8              $    $       $    $  ANS001.BYTE220  $  HEX(X1,X2);
  $  059.频率计数器8            $    $       $    $  ANS001.BYTE222  $  HEX(X1);
  $  060.后退计数器8            $    $       $    $  ANS001.BYTE223  $  HEX(X1);
  $  061.环境条件8              $    $       $    $  ANS001.BYTE224  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $  062.DTC号码9               $    $       $    $  ANS001.BYTE234  $  HEX(X1,X2,X3);
  $  063.DTC状态9               $    $       $    $  ANS001.BYTE237  $  HEX(X1);
  $  064.错误代码9              $    $       $    $  ANS001.BYTE238  $  HEX(X1,X2);
  $  065.错误类型9              $    $       $    $  ANS001.BYTE240  $  HEX(X1,X2);
  $  066.频率计数器9            $    $       $    $  ANS001.BYTE242  $  HEX(X1);
  $  067.后退计数器9            $    $       $    $  ANS001.BYTE243  $  HEX(X1);
  $  068.环境条件9              $    $       $    $  ANS001.BYTE244  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  069.DTC号码10              $    $       $    $  ANS001.BYTE264  $  HEX(X1,X2,X3);
  $  070.DTC状态10              $    $       $    $  ANS001.BYTE267  $  HEX(X1);
  $  071.错误代码10             $    $       $    $  ANS001.BYTE268  $  HEX(X1,X2);
  $  072.错误类型10             $    $       $    $  ANS001.BYTE270  $  HEX(X1,X2);
  $  073.频率计数器10           $    $       $    $  ANS001.BYTE272  $  HEX(X1);
  $  074.后退计数器10           $    $       $    $  ANS001.BYTE273  $  HEX(X1);
  $  075.环境条件10             $    $       $    $  ANS001.BYTE274  $  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  076.转向角校准状态         $    $       $    $  ANS002.BYTE004  $  if(x==0) y=@0475;else if(x==1) y=@10db;else y=@0035;
  $  077.系统模式               $    $       $    $  ANS003.BYTE004  $  if(x==0) y=@0524;else if(x==1) y=@110b;else y=@0035;
  $  078.系统状态               $    $       $    $  ANS004.BYTE004  $  if(x==0x00) y=@023f;else if(x==0x01) y=@110c;else if(x==0x02) y=@110d;else if(x==0x03) y=@110e;else if(x==0x04) y=@110f;else if(x==0x05) y=@1110;else if(x==0x06) y=@1111;else if(x==0x07) y=@000f;else if(x==0x08) y=@0119;else if(x==0x09) y=@0298;else if(x==0x0A) y=@091e;else if(x==0x0B) y=@1112;else y=@0035;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:745 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
