
    车型ID：10d4

    模拟：协议模拟-->10d4

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d1000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 A2 00 00 00 00       $%  ANS004:769 03 22 F1 A2 00 00 00 00
  $%  REQ005:761 03 22 F1 87 00 00 00 00       $%  ANS005:769 03 22 F1 87 00 00 00 00
  $%  REQ006:761 03 22 F1 10 00 00 00 00       $%  ANS006:769 03 22 F1 10 00 00 00 00
  $%  REQ007:761 03 22 F1 92 00 00 00 00       $%  ANS007:769 03 22 F1 92 00 00 00 00
  $%  REQ008:761 03 22 F1 8C 00 00 00 00       $%  ANS008:769 03 22 F1 8C 00 00 00 00
  $%  REQ009:761 03 22 F1 94 00 00 00 00       $%  ANS009:769 03 22 F1 94 00 00 00 00
  $%  REQ010:761 03 22 F1 8A 00 00 00 00       $%  ANS010:769 03 22 F1 8A 00 00 00 00
  $%  REQ011:761 03 22 F1 90 00 00 00 00       $%  ANS011:769 03 22 F1 90 00 00 00 00
  $%  REQ012:761 03 22 F1 A8 00 00 00 00       $%  ANS012:769 03 22 F1 A8 00 00 00 00
  $%  REQ013:761 03 22 F1 8B 00 00 00 00       $%  ANS013:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元名称:                    $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  002:出厂日期:                        $%    $%  ANS001.BYTE008  $%  ASCII(X1,X2,X3);
  $%  003:射频识别版本:                    $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  004:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号（上次）:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号（上次）:          $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数（上次）:                $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:零部件标识码:                    $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5);
  $%  013:生产线编号:                      $%    $%  ANS008.BYTE009  $%  ASCII(X1,X2);
  $%  014:年份:                            $%    $%  ANS008.BYTE011  $%  HEX(X1);
  $%  015:月:                              $%    $%  ANS008.BYTE012  $%  HEX(X1);
  $%  016:日:                              $%    $%  ANS008.BYTE013  $%  HEX(X1);
  $%  017:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  018:系统供应商标识号:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  019:车辆识别代码:                    $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  020:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  021:电控单元生产日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 D0 02 00 00 00 00       $  ANS000:769 03 22 D0 02 00 00 00 00
  $  REQ001:761 03 22 E0 01 00 00 00 00       $  ANS001:769 03 22 E0 01 00 00 00 00
  $  REQ002:761 03 22 E0 00 00 00 00 00       $  ANS002:769 03 22 E0 00 00 00 00 00
  $  REQ003:761 03 22 D0 04 00 00 00 00       $  ANS003:769 03 22 D0 04 00 00 00 00
  $  REQ004:761 03 22 D0 01 00 00 00 00       $  ANS004:769 03 22 D0 01 00 00 00 00
  $  REQ005:761 03 22 E0 03 00 00 00 00       $  ANS005:769 03 22 E0 03 00 00 00 00
  $  REQ006:761 03 22 D0 03 00 00 00 00       $  ANS006:769 03 22 D0 03 00 00 00 00
  $  REQ007:761 03 22 C0 01 00 00 00 00       $  ANS007:769 03 22 C0 01 00 00 00 00
  $  REQ008:761 03 22 C0 10 00 00 00 00       $  ANS008:769 03 22 C0 10 00 00 00 00
  $  REQ009:761 03 22 C0 11 00 00 00 00       $  ANS009:769 03 22 C0 11 00 00 00 00
  $  REQ010:761 03 22 C0 12 00 00 00 00       $  ANS010:769 03 22 C0 12 00 00 00 00
  $  REQ011:761 03 22 C0 13 00 00 00 00       $  ANS011:769 03 22 C0 13 00 00 00 00
  $  REQ012:761 03 22 C0 14 00 00 00 00       $  ANS012:769 03 22 C0 14 00 00 00 00
  $  REQ013:761 03 22 C0 16 00 00 00 00       $  ANS013:769 03 22 C0 16 00 00 00 00
  $  REQ014:761 03 22 C0 17 00 00 00 00       $  ANS014:769 03 22 C0 17 00 00 00 00
  $  REQ015:761 03 22 C0 18 00 00 00 00       $  ANS015:769 03 22 C0 18 00 00 00 00
  $  REQ016:761 03 22 C0 02 00 00 00 00       $  ANS016:769 03 22 C0 02 00 00 00 00
  $  REQ017:761 03 22 C0 20 00 00 00 00       $  ANS017:769 03 22 C0 20 00 00 00 00
  $  REQ018:761 03 22 C0 21 00 00 00 00       $  ANS018:769 03 22 C0 21 00 00 00 00
  $  REQ019:761 03 22 C0 22 00 00 00 00       $  ANS019:769 03 22 C0 22 00 00 00 00
  $  REQ020:761 03 22 C0 23 00 00 00 00       $  ANS020:769 03 22 C0 23 00 00 00 00
  $  REQ021:761 03 22 C0 24 00 00 00 00       $  ANS021:769 03 22 C0 24 00 00 00 00
  $  REQ022:761 03 22 C0 25 00 00 00 00       $  ANS022:769 03 22 C0 25 00 00 00 00
  $  REQ023:761 03 22 C0 26 00 00 00 00       $  ANS023:769 03 22 C0 26 00 00 00 00
  $  REQ024:761 03 22 C0 27 00 00 00 00       $  ANS024:769 03 22 C0 27 00 00 00 00
  $  REQ025:761 03 22 C0 28 00 00 00 00       $  ANS025:769 03 22 C0 28 00 00 00 00
  $  REQ026:761 03 22 C0 03 00 00 00 00       $  ANS026:769 03 22 C0 03 00 00 00 00
  $  REQ027:761 03 22 C0 04 00 00 00 00       $  ANS027:769 03 22 C0 04 00 00 00 00
  $  REQ028:761 03 22 C0 05 00 00 00 00       $  ANS028:769 03 22 C0 05 00 00 00 00
  $  REQ029:761 03 22 C0 06 00 00 00 00       $  ANS029:769 03 22 C0 06 00 00 00 00
  $  REQ030:761 03 22 C0 07 00 00 00 00       $  ANS030:769 03 22 C0 07 00 00 00 00
  $  REQ031:761 03 22 C0 08 00 00 00 00       $  ANS031:769 03 22 C0 08 00 00 00 00
  $  REQ032:761 03 22 C0 09 00 00 00 00       $  ANS032:769 03 22 C0 09 00 00 00 00
  $  REQ033:761 03 22 C0 0A 00 00 00 00       $  ANS033:769 03 22 C0 0A 00 00 00 00
  $  REQ034:761 03 22 C0 0B 00 00 00 00       $  ANS034:769 03 22 C0 0B 00 00 00 00
  $  REQ035:761 03 22 C0 0D 00 00 00 00       $  ANS035:769 03 22 C0 0D 00 00 00 00
  $  REQ036:761 03 22 C0 0E 00 00 00 00       $  ANS036:769 03 22 C0 0E 00 00 00 00
  $  REQ037:761 03 22 C0 0F 00 00 00 00       $  ANS037:769 03 22 C0 0F 00 00 00 00
  $  REQ038:761 03 22 E0 02 00 00 00 00       $  ANS038:769 03 22 E0 02 00 00 00 00

  $  000.日间运行灯状态                                 $    $           $    $  ANS000.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  001.半开门尾门状态                                 $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  002.半开门左后方状态                               $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  003.半开门右后方状态                               $    $           $    $  ANS000.BYTE005  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  004.半开门乘客状况                                 $    $           $    $  ANS000.BYTE005  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  005.半开门驱动程序状态                             $    $           $    $  ANS000.BYTE005  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  006.后雾灯状态                                     $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  007.前雾灯状态                                     $    $           $    $  ANS000.BYTE005  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  008.主灯状态                                       $    $           $    $  ANS000.BYTE005  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  009.近光灯状态                                     $    $           $    $  ANS000.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  010.位置灯状态                                     $    $           $    $  ANS000.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  011.乘客门锁状态                                   $    $           $    $  ANS000.BYTE006  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@0028;else if(((x&0xC0)>>6)==2) y=@0035;else if(((x&0xC0)>>6)==3) y=@0136;else y=@0035;
  $  012.驾驶员车门锁状态                               $    $           $    $  ANS000.BYTE006  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0028;else if(((x&0x30)>>4)==2) y=@0035;else if(((x&0x30)>>4)==3) y=@0136;else y=@0035;
  $  013.开启右转灯状态                                 $    $           $    $  ANS000.BYTE006  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  014.开启左转灯状态                                 $    $           $    $  ANS000.BYTE006  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  015.系统电源模式                                   $    $           $    $  ANS000.BYTE006  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@089b;else if((x&0x03)==2) y=@0011;else if((x&0x03)==3) y=@02cd;else y=@0035;
  $  016.电池寿命                                       $    $  %        $    $  ANS001.BYTE004  $  y=x;
  $  017.电池电压                                       $    $  V        $    $  ANS002.BYTE004  $  y=x*0.1;
  $  018.IPK显示ADBlue等级状态                          $    $           $    $  ANS003.BYTE004  $  if(((x&0x60)>>5)==0) y=@13df;else if(((x&0x60)>>5)==1) y=@13e0;else if(((x&0x60)>>5)==2) y=@13e1;else if(((x&0x60)>>5)==3) y=@13e2;else y=@0035;
  $  019.IPK显示DPF状态                                 $    $           $    $  ANS003.BYTE004  $  if(((x&0x18)>>3)==0) y=@13e3;else if(((x&0x18)>>3)==1) y=@1315;else if(((x&0x18)>>3)==2) y=@13e4;else if(((x&0x18)>>3)==3) y=@0103;else y=@0035;
  $  020.IPK过速功能状态                                $    $           $    $  ANS003.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  021.系统备份电源模式                               $    $           $    $  ANS003.BYTE004  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@089b;else if((x&0x03)==2) y=@0011;else if((x&0x03)==3) y=@02cd;else y=@0035;
  $  022.全局KL.50状态                                  $    $           $    $  ANS004.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0035;
  $  023.全局动力模块运行状态                           $    $           $    $  ANS004.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0035;
  $  024.全局 KL.15 状态                                $    $           $    $  ANS004.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  025.全局KL.R状态                                   $    $           $    $  ANS004.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  026.系统KL.50状态                                  $    $           $    $  ANS004.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0035;
  $  027.全局发动机运行状态                             $    $           $    $  ANS004.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0035;
  $  028.系统KL.15状态                                  $    $           $    $  ANS004.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  029.系统KL.R状态                                   $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  030.剩余行驶距离                                   $    $  km       $    $  ANS005.BYTE004  $  y=(x1*256+x2);
  $  031.TPMS灯状态                                     $    $           $    $  ANS006.BYTE004  $  if(((x&0x18)>>3)==0) y=@13e5;else if(((x&0x18)>>3)==1) y=@13e6;else if(((x&0x18)>>3)==2) y=@131d;else if(((x&0x18)>>3)==3) y=@1318;else y=@0035;
  $  032.信号状态                                       $    $           $    $  ANS006.BYTE004  $  if(((x&0x04)>>2)==0) y=@13e7;else if(((x&0x04)>>2)==1) y=@13e8;else y=@0035;
  $  033.TPMS系统状态                                   $    $           $    $  ANS006.BYTE004  $  if((x&0x03)==0) y=@05c3;else if((x&0x03)==1) y=@00d3;else if((x&0x03)==2) y=@00d4;else if((x&0x03)==3) y=@0035;else y=@0035;
  $  034.车体颜色                                       $    $           $    $  ANS007.BYTE004  $  if(x==0x00) y=@06e2;else if(x==0x01) y=@06e3;else if(x==0x02) y=@06e4;else if(x==0x03) y=@0997;else if(x==0x04) y=@06e6;else if(x==0x05) y=@06e7;else if(x==0x06) y=@06e8;else if(x==0x07) y=@06e9;else if(x==0x08) y=@06ea;else if(x==0x09) y=@06eb;else if(x==0x0A) y=@06ec;else if(x==0x0B) y=@128c;else if(x==0x0C) y=@06ee;else if(x==0x0D) y=@06ef;else if(x==0x0E) y=@06f0;else if(x==0x0F) y=@0998;else if(x==0x10) y=@1246;else if(x==0x11) y=@1247;else y=@0103;
  $  035.胎压监测系统                                   $    $           $    $  ANS007.BYTE005  $  if(x==0) y=@06f1;else if(x==1) y=@06f2;else if(x==2) y=@06f3;else if(x==3) y=@09a3;else if(x==4) y=@130a;else y=@0103;
  $  036.第三排座椅通风                                 $    $           $    $  ANS007.BYTE006  $  if(((x&0x80)>>7)==0) y=@00c9;else if(((x&0x80)>>7)==1) y=@00ca;else y=@0035;
  $  037.第三排座椅加热                                 $    $           $    $  ANS007.BYTE006  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@00ca;else y=@0035;
  $  038.第二排座椅通风                                 $    $           $    $  ANS007.BYTE006  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@00ca;else y=@0035;
  $  039.第二排座椅加热                                 $    $           $    $  ANS007.BYTE006  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0035;
  $  040.副驾驶员座椅通风                               $    $           $    $  ANS007.BYTE006  $  if(((x&0x08)>>3)==0) y=@00c9;else if(((x&0x08)>>3)==1) y=@00ca;else y=@0035;
  $  041.副驾驶员座椅加热                               $    $           $    $  ANS007.BYTE006  $  if(((x&0x04)>>2)==0) y=@00c9;else if(((x&0x04)>>2)==1) y=@00ca;else y=@0035;
  $  042.驾驶员座椅通风                                 $    $           $    $  ANS007.BYTE006  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0035;
  $  043.驾驶员座椅加热                                 $    $           $    $  ANS007.BYTE006  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0035;
  $  044.空调区配置                                     $    $           $    $  ANS007.BYTE007  $  if(((x&0xC0)>>6)==0) y=@0112;else if(((x&0xC0)>>6)==1) y=@130b;else if(((x&0xC0)>>6)==2) y=@130c;else if(((x&0xC0)>>6)==3) y=@0035;else y=@0035;
  $  045.空调类型配置                                   $    $           $    $  ANS007.BYTE007  $  if(((x&0x30)>>4)==0) y=@0112;else if(((x&0x30)>>4)==1) y=@130d;else if(((x&0x30)>>4)==2) y=@130e;else if(((x&0x30)>>4)==3) y=@0035;else y=@0035;
  $  046.空调位置配置                                   $    $           $    $  ANS007.BYTE007  $  if(((x&0x0C)>>2)==0) y=@0112;else if(((x&0x0C)>>2)==1) y=@0999;else if(((x&0x0C)>>2)==2) y=@099a;else if(((x&0x0C)>>2)==3) y=@0035;else y=@0035;
  $  047.空调类型配置                                   $    $           $    $  ANS007.BYTE007  $  if((x&0x03)==0) y=@0112;else if((x&0x03)==1) y=@130f;else if((x&0x03)==2) y=@1310;else if((x&0x03)==3) y=@0035;else y=@0035;
  $  048.超速报警状态                                   $    $           $    $  ANS008.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  049.超速报警                                       $    $  km/h     $    $  ANS008.BYTE005  $  y=x;
  $  050.报警灵敏度                                     $    $           $    $  ANS008.BYTE007  $  if(((x&0xF0)>>4)==0) y=@06c7;else if(((x&0xF0)>>4)==1) y=@0ed8;else if(((x&0xF0)>>4)==2) y=@06cb;else y=@0103;
  $  051.车道保持系统                                   $    $           $    $  ANS008.BYTE007  $  if((x&0x0F)==0) y=@137b;else if((x&0x0F)==1) y=@137c;else if((x&0x0F)==2) y=@137d;else y=@0103;
  $  052.盲点监测报警                                   $    $           $    $  ANS009.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  053.疲劳提醒                                       $    $           $    $  ANS009.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  054.360全景泊车(速打转向灯)                        $    $           $    $  ANS009.BYTE006  $  if(((x&0xF0)>>4)==0) y=@000f;else if(((x&0xF0)>>4)==1) y=@0028;else y=@0103;
  $  055.360度全景停车(车辆启动)                        $    $           $    $  ANS009.BYTE006  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  056.前碰撞系统(报警灵敏度)                         $    $           $    $  ANS009.BYTE007  $  if(((x&0xF0)>>4)==0) y=@06c7;else if(((x&0xF0)>>4)==1) y=@0ed8;else if(((x&0xF0)>>4)==2) y=@06cb;else y=@0103;
  $  057.正面碰撞系统(前碰撞警告)                       $    $           $    $  ANS009.BYTE007  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else if((x&0x0F)==2) y=@1327;else y=@0103;
  $  058.伴我回家(让灯亮着)                             $    $           $    $  ANS010.BYTE004  $  if(((x&0xF0)>>4)==0) y=@1384;else if(((x&0xF0)>>4)==1) y=@1385;else if(((x&0xF0)>>4)==2) y=@1386;else y=@0103;
  $  059.伴我回家状态                                   $    $           $    $  ANS010.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0103;
  $  060.寻车反馈                                       $    $           $    $  ANS010.BYTE005  $  if(x==0) y=@0990;else if(x==1) y=@0991;else y=@0103;
  $  061.无钥匙解锁                                     $    $           $    $  ANS010.BYTE006  $  if(((x&0x20)>>5)==0) y=@131a;else if(((x&0x20)>>5)==1) y=@08a0;else y=@0035;
  $  062.钥匙解锁                                       $    $           $    $  ANS010.BYTE006  $  if(((x&0x10)>>4)==0) y=@131a;else if(((x&0x10)>>4)==1) y=@08a0;else y=@0035;
  $  063.车辆上锁反馈                                   $    $           $    $  ANS010.BYTE006  $  if(((x&0x0C)>>2)==1) y=@0991;else if(((x&0x0C)>>2)==2) y=@0990;else if(((x&0x0C)>>2)==3) y=@131e;else y=@0103;
  $  064.熄火自动解锁                                   $    $           $    $  ANS010.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0035;
  $  065.行车自动落锁                                   $    $           $    $  ANS010.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  066.自动座位呼叫                                   $    $           $    $  ANS010.BYTE007  $  if(((x&0xC0)>>6)==0) y=@0afb;else if(((x&0xC0)>>6)==1) y=@0afc;else y=@0103;
  $  067.清除所有记忆功能                               $    $           $    $  ANS010.BYTE007  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0035;
  $  068.后视镜及座椅钥匙记忆功能                       $    $           $    $  ANS010.BYTE007  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0035;
  $  069.自动倒车后视镜倾斜                             $    $           $    $  ANS010.BYTE007  $  if(((x&0x0E)>>1)==0) y=@0994;else if(((x&0x0E)>>1)==1) y=@0995;else if(((x&0x0E)>>1)==2) y=@0996;else if(((x&0x0E)>>1)==3) y=@1357;else y=@0103;
  $  070.自动折叠/展开                                  $    $           $    $  ANS010.BYTE007  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0035;
  $  071.方向盘自定义                                   $    $           $    $  ANS011.BYTE004  $  if(x==0) y=@064f;else if(x==1) y=@08f0;else y=@0103;
  $  072.语言                                           $    $           $    $  ANS012.BYTE004  $  if(x==0) y=@074a;else if(x==1) y=@0901;else if(x==2) y=@08bf;else if(x==3) y=@0ffe;else if(x==4) y=@09ac;else y=@0103;
  $  073.日期格式                                       $    $           $    $  ANS012.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0b11;else if(((x&0xF0)>>4)==1) y=@0b12;else if(((x&0xF0)>>4)==2) y=@13d8;else y=@0103;
  $  074.时间格式                                       $    $           $    $  ANS012.BYTE005  $  if((x&0x01)==0) y=@05ed;else if((x&0x01)==1) y=@05ec;else y=@0103;
  $  075.车速限制                                       $    $           $    $  ANS013.BYTE006  $  if(x==0) y=@12fb;else if(x==1) y=@128d;else if(x==2) y=@128e;else if(x==3) y=@128f;else y=@0103;
  $  076.前方停车距离控制                               $    $           $    $  ANS013.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  077.迎宾灯                                         $    $           $    $  ANS014.BYTE004  $  if(((x&0xF0)>>4)==0) y=@1384;else if(((x&0xF0)>>4)==1) y=@1385;else if(((x&0xF0)>>4)==2) y=@1386;else y=@0103;
  $  078.迎宾灯状态                                     $    $           $    $  ANS014.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0103;
  $  079.氛围灯                                         $    $           $    $  ANS014.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@0267;else if(x==2) y=@0028;else y=@0103;
  $  080.天窗                                           $    $           $    $  ANS014.BYTE006  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  081.ATS显示特效                                    $    $           $    $  ANS014.BYTE007  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  082.空气净化器                                     $    $           $    $  ANS015.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@0028;else y=@0103;
  $  083.车道偏离报警(LDW)                              $    $           $    $  ANS016.BYTE004  $  if(x==0) y=@125a;else if(x==1) y=@1259;else y=@0103;
  $  084.自动紧急刹车(AEB)                              $    $           $    $  ANS016.BYTE005  $  if(x==0) y=@1381;else if(x==1) y=@125b;else y=@0103;
  $  085.360 全景影像类型配置                           $    $           $    $  ANS016.BYTE006  $  if(x==0) y=@125c;else if(x==1) y=@12ff;else if(x==2) y=@09e6;else y=@0103;
  $  086.仪表显示                                       $    $           $    $  ANS016.BYTE007  $  if(x==0) y=@1261;else if(x==1) y=@1351;else if(x==2) y=@1352;else if(x==3) y=@1266;else if(x==4) y=@1264;else if(x==5) y=@1262;else if(x==6) y=@1263;else if(x==7) y=@1268;else if(x==8) y=@1269;else y=@0103;
  $  087.驾驶模式                                       $    $           $    $  ANS017.BYTE004  $  if(x==0) y=@1383;else if(x==1) y=@0b03;else y=@0103;
  $  088.发动机启停功能                                 $    $           $    $  ANS017.BYTE005  $  if(x==0) y=@0112;else if(x==1) y=@0445;else y=@0103;
  $  089.后视镜折叠                                     $    $           $    $  ANS017.BYTE006  $  if(x==0) y=@1353;else if(x==1) y=@1354;else y=@0103;
  $  090.后视镜下倾                                     $    $           $    $  ANS017.BYTE007  $  if(x==0) y=@1355;else if(x==1) y=@1356;else y=@0103;
  $  091.驾驶员座椅                                     $    $           $    $  ANS018.BYTE004  $  if(x==0) y=@1341;else if(x==1) y=@1342;else if(x==2) y=@1343;else y=@0103;
  $  092.副驾驶员座椅                                   $    $           $    $  ANS018.BYTE005  $  if(x==0) y=@1344;else if(x==1) y=@1345;else if(x==2) y=@1346;else y=@0103;
  $  093.第二排座椅                                     $    $           $    $  ANS018.BYTE006  $  if(x==0) y=@0b0c;else if(x==1) y=@1347;else if(x==2) y=@1348;else if(x==3) y=@1349;else if(x==4) y=@134a;else y=@0103;
  $  094.第三排座椅                                     $    $           $    $  ANS018.BYTE007  $  if(x==0) y=@13de;else if(x==1) y=@0b10;else y=@0103;
  $  095.副驾驶员安全气囊                               $    $           $    $  ANS019.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0112;else if(((x&0xF0)>>4)==1) y=@0445;else y=@0103;
  $  096.驾驶员安全气囊                                 $    $           $    $  ANS019.BYTE004  $  if((x&0x0F)==0) y=@0112;else if((x&0x0F)==1) y=@0445;else y=@0103;
  $  097.双侧安全气帘                                   $    $           $    $  ANS019.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0112;else if(((x&0xF0)>>4)==1) y=@0445;else y=@0103;
  $  098.主副驾侧气囊                                   $    $           $    $  ANS019.BYTE005  $  if((x&0x0F)==0) y=@0112;else if((x&0x0F)==1) y=@0445;else y=@0103;
  $  099.安全锁扣提醒                                   $    $           $    $  ANS019.BYTE006  $  if(x==0) y=@136b;else if(x==1) y=@0aed;else if(x==2) y=@0aee;else y=@0103;
  $  100.手机映射                                       $    $           $    $  ANS020.BYTE004  $  if(x==0) y=@095d;else if(x==1) y=@095c;else y=@0103;
  $  101.迎宾灯                                         $    $           $    $  ANS020.BYTE005  $  if(x==0) y=@095f;else if(x==1) y=@095e;else y=@0103;
  $  102.车道保持                                       $    $           $    $  ANS021.BYTE004  $  if(x==0) y=@136c;else if(x==1) y=@13d9;else y=@0103;
  $  103.自适应巡航                                     $    $           $    $  ANS021.BYTE005  $  if(x==0) y=@0010;else if(x==1) y=@13da;else y=@0103;
  $  104.拍照识别                                       $    $           $    $  ANS021.BYTE006  $  if(x==0) y=@136f;else if(x==1) y=@13db;else y=@0103;
  $  105.座椅记忆                                       $    $           $    $  ANS021.BYTE007  $  if(x==0) y=@1371;else if(x==1) y=@13dc;else y=@0103;
  $  106.疲劳提醒                                       $    $           $    $  ANS022.BYTE004  $  if(x==0) y=@12f4;else if(x==1) y=@133f;else y=@0103;
  $  107.氛围灯                                         $    $           $    $  ANS022.BYTE005  $  if(x==0) y=@1340;else if(x==1) y=@0960;else y=@0103;
  $  108.氛围灯颜色                                     $    $           $    $  ANS022.BYTE006  $  if(x==0) y=@13dd;else if(x==1) y=@11db;else if(x==2) y=@11dc;else if(x==3) y=@0963;else if(x==4) y=@0964;else if(x==5) y=@0965;else if(x==6) y=@0966;else y=@0103;
  $  109.氛围灯开关模式                                 $    $           $    $  ANS023.BYTE004  $  if(x==0) y=@1290;else if(x==1) y=@1291;else y=@0103;
  $  110.IP 区域                                        $    $           $    $  ANS023.BYTE005  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0103;
  $  111.顶棚区域                                       $    $           $    $  ANS023.BYTE006  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0103;
  $  112.前门                                           $    $           $    $  ANS023.BYTE007  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0103;
  $  113.后门                                           $    $           $    $  ANS023.BYTE008  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0103;
  $  114.尾门                                           $    $           $    $  ANS023.BYTE009  $  if(x==0) y=@134d;else if(x==1) y=@134e;else y=@0103;
  $  115.行车自动落锁                                   $    $           $    $  ANS024.BYTE004  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0103;
  $  116.熄火自动解锁                                   $    $           $    $  ANS024.BYTE005  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0103;
  $  117.车辆上锁反馈                                   $    $           $    $  ANS024.BYTE006  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0103;
  $  118.钥匙解锁                                       $    $           $    $  ANS024.BYTE007  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0103;
  $  119.HUD                                            $    $           $    $  ANS025.BYTE004  $  if(x==0) y=@1378;else if(x==1) y=@13ef;else y=@0103;
  $  120.顶高                                           $    $           $    $  ANS025.BYTE005  $  if(x==0) y=@09c4;else if(x==1) y=@09c2;else if(x==2) y=@0ed8;else y=@0103;
  $  121.后排乘客区电动玻璃                             $    $           $    $  ANS026.BYTE004  $  if(((x&0x80)>>7)==0) y=@0112;else if(((x&0x80)>>7)==1) y=@0445;else y=@0035;
  $  122.后排乘客区电动玻璃一键自动下                   $    $           $    $  ANS026.BYTE004  $  if(((x&0x40)>>6)==0) y=@0112;else if(((x&0x40)>>6)==1) y=@0445;else y=@0035;
  $  123.后排乘客区电动玻璃一键自动上下（带防夹）       $    $           $    $  ANS026.BYTE004  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0035;
  $  124.副驾驶员电动玻璃                               $    $           $    $  ANS026.BYTE004  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  125.副驾驶员电动玻璃一键自动下                     $    $           $    $  ANS026.BYTE004  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0035;
  $  126.后排乘客区电动玻璃一键自动上下（带防夹）       $    $           $    $  ANS026.BYTE004  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0035;
  $  127.驾驶员电动玻璃一键自动下                       $    $           $    $  ANS026.BYTE004  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  128.驾驶员电动玻璃一键自动上下（带防夹）           $    $           $    $  ANS026.BYTE004  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  129.车联网类型                                     $    $           $    $  ANS026.BYTE005  $  if(x==0) y=@12a4;else if(x==1) y=@1373;else if(x==2) y=@11ff;else if(x==3) y=@1200;else if(x==4) y=@1374;else if(x==5) y=@1375;else if(x==6) y=@1376;else if(x==7) y=@1204;else y=@0103;
  $  130.导航                                           $    $           $    $  ANS026.BYTE006  $  if(x==0) y=@05aa;else if(x==1) y=@0739;else y=@0103;
  $  131.蓝牙免提                                       $    $           $    $  ANS026.BYTE007  $  if(x==0) y=@073a;else if(x==1) y=@073b;else y=@0103;
  $  132.娱乐系统显示系统                               $    $           $    $  ANS027.BYTE004  $  if(x==0) y=@073c;else if(x==1) y=@1205;else if(x==2) y=@1206;else if(x==3) y=@1207;else if(x==4) y=@1208;else if(x==5) y=@1209;else y=@0103;
  $  133.数字收音机                                     $    $           $    $  ANS027.BYTE005  $  if(x==0) y=@12ec;else if(x==1) y=@13f0;else y=@0103;
  $  134.后驻车辅助系统                                 $    $           $    $  ANS027.BYTE006  $  if(((x&0xE0)>>5)==0) y=@12a6;else if(((x&0xE0)>>5)==1) y=@12a7;else if(((x&0xE0)>>5)==2) y=@12a8;else if(((x&0xE0)>>5)==3) y=@12a9;else if(((x&0xE0)>>5)==4) y=@12aa;else if(((x&0xE0)>>5)==5) y=@12ab;else if(((x&0xE0)>>5)==6) y=@12ac;else if(((x&0xE0)>>5)==7) y=@12ad;else y=@0035;
  $  135.前驻车辅助系统                                 $    $           $    $  ANS027.BYTE006  $  if(((x&0x1C)>>2)==0) y=@12ae;else if(((x&0x1C)>>2)==1) y=@12af;else if(((x&0x1C)>>2)==2) y=@12b0;else if(((x&0x1C)>>2)==3) y=@12b1;else if(((x&0x1C)>>2)==4) y=@12b2;else if(((x&0x1C)>>2)==5) y=@12b3;else if(((x&0x1C)>>2)==6) y=@12b4;else if(((x&0x1C)>>2)==7) y=@12b5;else y=@0035;
  $  136.后雷达                                         $    $           $    $  ANS027.BYTE006  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  137.前雷达                                         $    $           $    $  ANS027.BYTE006  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  138.后视影像                                       $    $           $    $  ANS027.BYTE007  $  if(x==0x00) y=@12b6;else if(x==0x01) y=@11f1;else if(x==0x02) y=@070d;else if(x==0x03) y=@0708;else if(x==0x04) y=@070f;else if(x==0x05) y=@12b7;else if(x==0x06) y=@12b8;else if(x==0x07) y=@12b9;else if(x==0x08) y=@12ba;else if(x==0x09) y=@12bb;else if(x==0x0A) y=@12bc;else if(x==0x0B) y=@12bd;else if(x==0x0C) y=@12be;else y=@0103;
  $  139.方向盘                                         $    $           $    $  ANS028.BYTE004  $  if(x==0) y=@0711;else if(x==1) y=@11f3;else if(x==2) y=@11f4;else y=@0103;
  $  140.音频                                           $    $           $    $  ANS028.BYTE005  $  if(x==0) y=@0714;else if(x==1) y=@138a;else if(x==2) y=@11f5;else if(x==3) y=@0717;else y=@0103;
  $  141.音频输入                                       $    $           $    $  ANS028.BYTE006  $  if(x==0) y=@0718;else if(x==1) y=@096c;else y=@0103;
  $  142.视频输入                                       $    $           $    $  ANS028.BYTE007  $  if(x==0) y=@071a;else if(x==1) y=@096d;else y=@0103;
  $  143.USB 输入                                       $    $           $    $  ANS029.BYTE004  $  if(x==0) y=@11f6;else if(x==1) y=@11f7;else if(x==2) y=@071c;else if(x==3) y=@138b;else y=@0103;
  $  144.FM 50kHZ                                       $    $           $    $  ANS029.BYTE005  $  if(((x&0x20)>>5)==0) y=@0112;else if(((x&0x20)>>5)==1) y=@0445;else y=@0035;
  $  145.FM 100kHZ                                      $    $           $    $  ANS029.BYTE005  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  146.AM 10kHZ                                       $    $           $    $  ANS029.BYTE005  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  147.AM 9kHZ                                        $    $           $    $  ANS029.BYTE005  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  148.FM 87.5~108MHZ                                 $    $           $    $  ANS029.BYTE006  $  if(((x&0x10)>>4)==0) y=@0112;else if(((x&0x10)>>4)==1) y=@0445;else y=@0035;
  $  149.531~1629KHZ                                    $    $           $    $  ANS029.BYTE006  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0035;
  $  150.AM 522~1710KHZ                                 $    $           $    $  ANS029.BYTE006  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0035;
  $  151.AM 530 ~1710KHZ                                $    $           $    $  ANS029.BYTE006  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0035;
  $  152.AM 531~1602KHZ                                 $    $           $    $  ANS029.BYTE006  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0035;
  $  153.扬声器                                         $    $           $    $  ANS029.BYTE007  $  if(x==0) y=@138c;else if(x==1) y=@138d;else if(x==2) y=@12bf;else if(x==3) y=@11f9;else if(x==4) y=@12c0;else if(x==5) y=@11fa;else y=@0103;
  $  154.IPOD 装配                                      $    $           $    $  ANS030.BYTE004  $  if(x==0) y=@0ac8;else if(x==1) y=@09e6;else y=@0103;
  $  155.车型年份                                       $    $           $    $  ANS030.BYTE005  $  if(x==0) y=@138e;else if(x==1) y=@138f;else if(x==2) y=@0974;else if(x==3) y=@0975;else if(x==4) y=@0976;else if(x==5) y=@0977;else if(x==6) y=@0978;else if(x==7) y=@1390;else if(x==8) y=@1391;else y=@0103;
  $  156.空气净化器系统                                 $    $           $    $  ANS030.BYTE006  $  if(x==0) y=@08e7;else if(x==1) y=@08e8;else if(x==2) y=@08e9;else if(x==3) y=@08ea;else y=@0103;
  $  157.车型                                           $    $           $    $  ANS030.BYTE007  $  if(x==0x00) y=@1279;else if(x==0x01) y=@06ad;else if(x==0x02) y=@06ae;else if(x==0x03) y=@06af;else if(x==0x04) y=@06b0;else if(x==0x05) y=@06b1;else if(x==0x06) y=@12c9;else if(x==0x07) y=@06b3;else if(x==0x08) y=@00f3;else if(x==0x09) y=@06b4;else if(x==0x0A) y=@06b5;else if(x==0x1B) y=@1334;else y=@0103;
  $  158.品牌名称                                       $    $           $    $  ANS031.BYTE004  $  if(x==0) y=@066a;else if(x==1) y=@066b;else if(x==2) y=@066c;else y=@0103;
  $  159.国家代码                                       $    $           $    $  ANS031.BYTE005  $  if(x==0x00) y=@00d8;else if(x==0x01) y=@066d;else if(x==0x02) y=@066e;else if(x==0x03) y=@1395;else if(x==0x04) y=@0670;else if(x==0x05) y=@0671;else if(x==0x06) y=@0672;else if(x==0x07) y=@0673;else if(x==0x08) y=@0674;else if(x==0x09) y=@0675;else if(x==0x0A) y=@0676;else if(x==0x0B) y=@0677;else if(x==0x0C) y=@0678;else if(x==0x0D) y=@0679;else if(x==0x0E) y=@067a;else if(x==0x0F) y=@067b;else if(x==0x10) y=@067c;else if(x==0x11) y=@1335;else if(x==0x12) y=@08c2;else if(x==0x13) y=@08b6;else if(x==0x14) y=@09ca;else if(x==0x15) y=@09cb;else if(x==0x16) y=@09cc;else if(x==0x17) y=@08b7;else y=@0103;
  $  160.汽车驾驶方向类型配置                           $    $           $    $  ANS031.BYTE006  $  if(x==0) y=@067d;else if(x==1) y=@067e;else y=@0103;
  $  161.发动机                                         $    $           $    $  ANS031.BYTE007  $  if(x==0) y=@1365;else if(x==1) y=@1366;else if(x==2) y=@1367;else if(x==3) y=@1368;else if(x==4) y=@1369;else if(x==5) y=@136a;else y=@0103;
  $  162.变速器                                         $    $           $    $  ANS032.BYTE004  $  if(x==0) y=@1297;else if(x==1) y=@1298;else if(x==2) y=@00fa;else if(x==3) y=@1299;else y=@0103;
  $  163.汽车尾门操作类型配置                           $    $           $    $  ANS032.BYTE005  $  if(x==0) y=@09cd;else if(x==1) y=@09ce;else if(x==2) y=@0690;else if(x==3) y=@0b14;else y=@0103;
  $  164.盲点信息系统配置                               $    $           $    $  ANS032.BYTE006  $  if(x==0) y=@129a;else if(x==1) y=@13ea;else y=@0103;
  $  165.行人警示                                       $    $           $    $  ANS032.BYTE007  $  if(x==0) y=@1271;else if(x==1) y=@1329;else y=@0103;
  $  166.速度警报系统                                   $    $           $    $  ANS033.BYTE004  $  if(x==0) y=@08ed;else if(x==1) y=@132b;else y=@0103;
  $  167.紧急呼叫                                       $    $           $    $  ANS033.BYTE005  $  if(x==0) y=@03de;else if(x==1) y=@13e9;else y=@0103;
  $  168.天窗                                           $    $           $    $  ANS033.BYTE006  $  if(x==0) y=@0693;else if(x==1) y=@1393;else if(x==2) y=@0695;else y=@0103;
  $  169.动力类型                                       $    $           $    $  ANS033.BYTE007  $  if(x==0) y=@09d0;else if(x==1) y=@06cd;else if(x==2) y=@06ce;else if(x==3) y=@06cf;else y=@0103;
  $  170.ECO主动经济驾驶模式配置                        $    $           $    $  ANS034.BYTE004  $  if(x==0) y=@1275;else if(x==1) y=@12c4;else y=@0103;
  $  171.FCW正面碰撞警告配置                            $    $           $    $  ANS034.BYTE005  $  if(x==0) y=@0950;else if(x==1) y=@094f;else y=@0103;
  $  172.麦克风                                         $    $           $    $  ANS034.BYTE006  $  if(x==0) y=@129b;else if(x==1) y=@129c;else if(x==2) y=@129d;else y=@0103;
  $  173.光线传感器                                     $    $           $    $  ANS034.BYTE007  $  if(x==0) y=@09c1;else if(x==1) y=@09c0;else y=@0103;
  $  174.有语音识别                                     $    $           $    $  ANS035.BYTE004  $  if(x==0) y=@1388;else if(x==1) y=@06da;else y=@0103;
  $  175.ESP & ABS                                      $    $           $    $  ANS035.BYTE005  $  if(x==0) y=@06b6;else if(x==1) y=@06b7;else if(x==2) y=@13eb;else y=@0103;
  $  176.方向盘转角信号                                 $    $           $    $  ANS035.BYTE006  $  if(x==0) y=@129e;else if(x==1) y=@13ec;else y=@0103;
  $  177.PEPS                                           $    $           $    $  ANS035.BYTE007  $  if(x==0) y=@06bb;else if(x==1) y=@13ed;else y=@0103;
  $  178.WIFI                                           $    $           $    $  ANS036.BYTE004  $  if(x==0) y=@06bc;else if(x==1) y=@13ee;else y=@0103;
  $  179.轮距                                           $    $           $    $  ANS036.BYTE005  $  if(x==0) y=@06be;else if(x==1) y=@06bf;else if(x==2) y=@1336;else if(x==3) y=@1337;else y=@0103;
  $  180.底盘接地间隙                                   $    $           $    $  ANS036.BYTE006  $  if(x==0) y=@06c0;else if(x==1) y=@06c1;else if(x==3) y=@135d;else y=@0103;
  $  181.驾驶类型                                       $    $           $    $  ANS036.BYTE007  $  if(x==0) y=@0883;else if(x==1) y=@1387;else if(x==2) y=@09d6;else if(x==3) y=@05dd;else y=@0103;
  $  182.门数                                           $    $           $    $  ANS037.BYTE004  $  if(x==0) y=@1358;else if(x==1) y=@1359;else y=@0103;
  $  183.超速报警                                       $    $           $    $  ANS037.BYTE005  $  if(x==0) y=@0445;else if(x==1) y=@0112;else y=@0103;
  $  184.车速限制                                       $    $           $    $  ANS037.BYTE006  $  if(x==0) y=@12fb;else if(x==1) y=@128d;else if(x==2) y=@128e;else if(x==3) y=@128f;else y=@0103;
  $  185.GPS                                            $    $           $    $  ANS037.BYTE007  $  if(x==0) y=@13bb;else if(x==1) y=@06d9;else y=@0103;
  $  186.里程                                           $    $  km       $    $  ANS038.BYTE004  $  y=(x1*256*256+x2*256+x3);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
