
    车型ID：10d8

    模拟：协议模拟-->10d8

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d5000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 8B 00 00 00 00       $%  ANS004:769 03 22 F1 8B 00 00 00 00
  $%  REQ005:761 03 22 F1 A2 00 00 00 00       $%  ANS005:769 03 22 F1 A2 00 00 00 00
  $%  REQ006:761 03 22 F1 87 00 00 00 00       $%  ANS006:769 03 22 F1 87 00 00 00 00
  $%  REQ007:761 03 22 F1 10 00 00 00 00       $%  ANS007:769 03 22 F1 10 00 00 00 00
  $%  REQ008:761 03 22 F1 92 00 00 00 00       $%  ANS008:769 03 22 F1 92 00 00 00 00
  $%  REQ009:761 03 22 F1 8C 00 00 00 00       $%  ANS009:769 03 22 F1 8C 00 00 00 00
  $%  REQ010:761 03 22 F1 94 00 00 00 00       $%  ANS010:769 03 22 F1 94 00 00 00 00
  $%  REQ011:761 03 22 F1 8A 00 00 00 00       $%  ANS011:769 03 22 F1 8A 00 00 00 00
  $%  REQ012:761 03 22 F1 90 00 00 00 00       $%  ANS012:769 03 22 F1 90 00 00 00 00
  $%  REQ013:761 03 22 F1 A8 00 00 00 00       $%  ANS013:769 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元制造日期:                $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3);
  $%  005:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号(上次):            $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  008:测试工具参考号(上次):            $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  009:里程读数(上次):                  $%    $%  ANS007.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  010:供应商电控单元硬件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:产品序列号:                      $%    $%  ANS009.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  012:生产线号码:                      $%    $%  ANS009.BYTE009  $%  ASCII(X1,X2);
  $%  013:年:                              $%    $%  ANS009.BYTE011  $%  y=x;
  $%  014:月 日:                           $%    $%  ANS009.BYTE012  $%  y=x1*256+x2;
  $%  015:供应商电控单元软件参考号:        $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  016:系统供应商标识号:                $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  017:车辆识别代码:                    $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  018:车辆特征信息:                    $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 D0 03 00 00 00 00       $  ANS000:769 03 22 D0 03 00 00 00 00
  $  REQ001:761 03 22 D0 02 00 00 00 00       $  ANS001:769 03 22 D0 02 00 00 00 00
  $  REQ002:761 03 22 E0 00 00 00 00 00       $  ANS002:769 03 22 E0 00 00 00 00 00
  $  REQ003:761 03 22 D0 01 00 00 00 00       $  ANS003:769 03 22 D0 01 00 00 00 00
  $  REQ004:761 03 22 C0 10 00 00 00 00       $  ANS004:769 03 22 C0 10 00 00 00 00
  $  REQ005:761 03 22 C0 11 00 00 00 00       $  ANS005:769 03 22 C0 11 00 00 00 00
  $  REQ006:761 03 22 C0 16 00 00 00 00       $  ANS006:769 03 22 C0 16 00 00 00 00
  $  REQ007:761 03 22 C0 12 00 00 00 00       $  ANS007:769 03 22 C0 12 00 00 00 00
  $  REQ008:761 03 22 C0 17 00 00 00 00       $  ANS008:769 03 22 C0 17 00 00 00 00
  $  REQ009:761 03 22 C0 18 00 00 00 00       $  ANS009:769 03 22 C0 18 00 00 00 00
  $  REQ010:761 03 22 C0 13 00 00 00 00       $  ANS010:769 03 22 C0 13 00 00 00 00
  $  REQ011:761 03 22 C0 14 00 00 00 00       $  ANS011:769 03 22 C0 14 00 00 00 00
  $  REQ012:761 03 22 E0 01 00 00 00 00       $  ANS012:769 03 22 E0 01 00 00 00 00
  $  REQ013:761 03 22 C0 01 00 00 00 00       $  ANS013:769 03 22 C0 01 00 00 00 00
  $  REQ014:761 03 22 C0 02 00 00 00 00       $  ANS014:769 03 22 C0 02 00 00 00 00
  $  REQ015:761 03 22 C0 20 00 00 00 00       $  ANS015:769 03 22 C0 20 00 00 00 00
  $  REQ016:761 03 22 C0 21 00 00 00 00       $  ANS016:769 03 22 C0 21 00 00 00 00
  $  REQ017:761 03 22 C0 22 00 00 00 00       $  ANS017:769 03 22 C0 22 00 00 00 00
  $  REQ018:761 03 22 C0 23 00 00 00 00       $  ANS018:769 03 22 C0 23 00 00 00 00
  $  REQ019:761 03 22 C0 24 00 00 00 00       $  ANS019:769 03 22 C0 24 00 00 00 00
  $  REQ020:761 03 22 C0 25 00 00 00 00       $  ANS020:769 03 22 C0 25 00 00 00 00
  $  REQ021:761 03 22 C0 03 00 00 00 00       $  ANS021:769 03 22 C0 03 00 00 00 00
  $  REQ022:761 03 22 C0 04 00 00 00 00       $  ANS022:769 03 22 C0 04 00 00 00 00
  $  REQ023:761 03 22 C0 05 00 00 00 00       $  ANS023:769 03 22 C0 05 00 00 00 00
  $  REQ024:761 03 22 C0 06 00 00 00 00       $  ANS024:769 03 22 C0 06 00 00 00 00
  $  REQ025:761 03 22 C0 07 00 00 00 00       $  ANS025:769 03 22 C0 07 00 00 00 00
  $  REQ026:761 03 22 C0 08 00 00 00 00       $  ANS026:769 03 22 C0 08 00 00 00 00
  $  REQ027:761 03 22 C0 09 00 00 00 00       $  ANS027:769 03 22 C0 09 00 00 00 00
  $  REQ028:761 03 22 C0 0A 00 00 00 00       $  ANS028:769 03 22 C0 0A 00 00 00 00
  $  REQ029:761 03 22 C0 0B 00 00 00 00       $  ANS029:769 03 22 C0 0B 00 00 00 00
  $  REQ030:761 03 22 C0 0C 00 00 00 00       $  ANS030:769 03 22 C0 0C 00 00 00 00
  $  REQ031:761 03 22 C0 0D 00 00 00 00       $  ANS031:769 03 22 C0 0D 00 00 00 00
  $  REQ032:761 03 22 C0 0E 00 00 00 00       $  ANS032:769 03 22 C0 0E 00 00 00 00
  $  REQ033:761 03 22 C0 0F 00 00 00 00       $  ANS033:769 03 22 C0 0F 00 00 00 00
  $  REQ034:761 03 22 E0 02 00 00 00 00       $  ANS034:769 03 22 E0 02 00 00 00 00

  $  000.APARearObjectStatus_11                     $    $           $    $  ANS000.BYTE004  $  if(((x&0xE0)>>5)==0) y=@13a1;else if(((x&0xE0)>>5)==1) y=@13a2;else if(((x&0xE0)>>5)==2) y=@13a3;else if(((x&0xE0)>>5)==3) y=@13a4;else if(((x&0xE0)>>5)==4) y=@13a5;else y=@0035;
  $  001.APARearObjectStatus_10                     $    $           $    $  ANS000.BYTE004  $  if(((x&0x1C)>>2)==0) y=@13a1;else if(((x&0x1C)>>2)==1) y=@13a2;else if(((x&0x1C)>>2)==2) y=@13a3;else if(((x&0x1C)>>2)==3) y=@13a4;else if(((x&0x1C)>>2)==4) y=@13a5;else y=@0035;
  $  002.APARearObjectStatus_9                      $    $           $    $  ANS000.BYTE004  $  if((((x1*256+x2)&0x380)>>7)==0) y=@13a1;else if((((x1*256+x2)&0x380)>>7)==1) y=@13a2;else if((((x1*256+x2)&0x380)>>7)==2) y=@13a3;else if((((x1*256+x2)&0x380)>>7)==3) y=@13a4;else if((((x1*256+x2)&0x380)>>7)==4) y=@13a5;else y=@0035;
  $  003.APARearObjectStatus_8                      $    $           $    $  ANS000.BYTE005  $  if(((x&0x70)>>4)==0) y=@13a1;else if(((x&0x70)>>4)==1) y=@13a2;else if(((x&0x70)>>4)==2) y=@13a3;else if(((x&0x70)>>4)==3) y=@13a4;else if(((x&0x70)>>4)==4) y=@13a5;else y=@0035;
  $  004.APAFrontObjectStatus_5                     $    $           $    $  ANS000.BYTE005  $  if(((x&0x0E)>>1)==0) y=@13a1;else if(((x&0x0E)>>1)==1) y=@13a2;else if(((x&0x0E)>>1)==2) y=@13a3;else if(((x&0x0E)>>1)==3) y=@13a4;else if(((x&0x0E)>>1)==4) y=@13a5;else y=@0035;
  $  005.APAFrontObjectStatus_4                     $    $           $    $  ANS000.BYTE005  $  if((((x1*256+x2)&0x1C0)>>6)==0) y=@13a1;else if((((x1*256+x2)&0x1C0)>>6)==1) y=@13a2;else if((((x1*256+x2)&0x1C0)>>6)==2) y=@13a3;else if((((x1*256+x2)&0x1C0)>>6)==3) y=@13a4;else if((((x1*256+x2)&0x1C0)>>6)==4) y=@13a5;else y=@0035;
  $  006.APAFrontObjectStatus_3                     $    $           $    $  ANS000.BYTE006  $  if(((x&0x38)>>3)==0) y=@13a1;else if(((x&0x38)>>3)==1) y=@13a2;else if(((x&0x38)>>3)==2) y=@13a3;else if(((x&0x38)>>3)==3) y=@13a4;else if(((x&0x38)>>3)==4) y=@13a5;else y=@0035;
  $  007.APAFrontObjectStatus_2                     $    $           $    $  ANS000.BYTE006  $  if((x&0x07)==0) y=@13a1;else if((x&0x07)==1) y=@13a2;else if((x&0x07)==2) y=@13a3;else if((x&0x07)==3) y=@13a4;else if((x&0x07)==4) y=@13a5;else y=@0035;
  $  008.乘客门锁状态                               $    $           $    $  ANS001.BYTE004  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@016d;else if(((x&0xC0)>>6)==2) y=@0035;else if(((x&0xC0)>>6)==3) y=@01df;else y=@0035;
  $  009.驾驶室车门锁状态                           $    $           $    $  ANS001.BYTE004  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@016d;else if(((x&0x30)>>4)==2) y=@0035;else if(((x&0x30)>>4)==3) y=@01df;else y=@0035;
  $  010.右转灯状态                                 $    $           $    $  ANS001.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  011.左转灯状态                                 $    $           $    $  ANS001.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  012.系统电源模式                               $    $           $    $  ANS001.BYTE004  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@0010;else if((x&0x03)==2) y=@0011;else if((x&0x03)==3) y=@0e4f;else y=@0035;
  $  013.右后方门半开状态                           $    $           $    $  ANS001.BYTE005  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  014.乘客门半开状态                             $    $           $    $  ANS001.BYTE005  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@016d;else y=@0035;
  $  015.驾驶室车门半开状态                         $    $           $    $  ANS001.BYTE005  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  016.后雾灯状态                                 $    $           $    $  ANS001.BYTE005  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  017.前雾灯状态                                 $    $           $    $  ANS001.BYTE005  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  018.主梁状态                                   $    $           $    $  ANS001.BYTE005  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  019.近光灯状态                                 $    $           $    $  ANS001.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  020.位置灯状态                                 $    $           $    $  ANS001.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  021.日间行车灯状态                             $    $           $    $  ANS001.BYTE006  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  022.尾门半开状态                               $    $           $    $  ANS001.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  023.左后方门半开状态                           $    $           $    $  ANS001.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  024.电池电压                                   $    $  V        $    $  ANS002.BYTE004  $  y=x*0.1;
  $  025.全局KL50状态                               $    $           $    $  ANS003.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  026.全局发动机运转状态                         $    $           $    $  ANS003.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@016d;else y=@0035;
  $  027.全局KL15状态                               $    $           $    $  ANS003.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  028.全局ACC/KLR状态                            $    $           $    $  ANS003.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  029.系统KL50状态                               $    $           $    $  ANS003.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  030.系统发动机运转状态                         $    $           $    $  ANS003.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  031.系统KL15状态                               $    $           $    $  ANS003.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  032.系统ACC/KLR状态                            $    $           $    $  ANS003.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  033.超速报警状态                               $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  034.法规项固定超速报警                         $    $  km/h     $    $  ANS004.BYTE005  $  y=x;
  $  035.车道保持系统报警灵敏度                     $    $           $    $  ANS004.BYTE007  $  if(((x&0xF0)>>4)==0) y=@06c7;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@06cb;else y=@0035;
  $  036.车道保持系统                               $    $           $    $  ANS004.BYTE007  $  if((x&0x0F)==0) y=@0aff;else if((x&0x0F)==1) y=@1326;else if((x&0x0F)==2) y=@122d;else y=@0035;
  $  037.盲点监测报警                               $    $           $    $  ANS005.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  038.驾驶员疲劳提示                             $    $           $    $  ANS005.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  039.360度全景停车(低速开启转向灯)              $    $           $    $  ANS005.BYTE006  $  if(((x&0xF0)>>4)==0) y=@000f;else if(((x&0xF0)>>4)==1) y=@016d;else y=@0035;
  $  040.360度全景停车(车辆启动)                    $    $           $    $  ANS005.BYTE006  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@016d;else y=@0035;
  $  041.前碰撞系统(报警灵敏度)                     $    $           $    $  ANS005.BYTE007  $  if(((x&0xF0)>>4)==0) y=@06c7;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@06cb;else y=@0035;
  $  042.正面碰撞系统(前碰撞警告)                   $    $           $    $  ANS005.BYTE007  $  if((x&0x0F)==0) y=@13a6;else if((x&0x0F)==1) y=@098e;else if((x&0x0F)==2) y=@098f;else y=@0103;
  $  043.限速识别                                   $    $           $    $  ANS006.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  044.前方停车距离控制                           $    $           $    $  ANS006.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  045.伴我回家(让灯亮着)                         $    $           $    $  ANS007.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0035;
  $  046.回家功能状态                               $    $           $    $  ANS007.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  047.寻车反馈                                   $    $           $    $  ANS007.BYTE005  $  if(x==0) y=@131d;else if(x==1) y=@131c;else y=@0035;
  $  048.非钥匙解锁                                 $    $           $    $  ANS007.BYTE006  $  if(((x&0x20)>>5)==0) y=@131a;else if(((x&0x20)>>5)==1) y=@131b;else y=@0035;
  $  049.钥匙开锁                                   $    $           $    $  ANS007.BYTE006  $  if(((x&0x10)>>4)==0) y=@131a;else if(((x&0x10)>>4)==1) y=@131b;else y=@0035;
  $  050.车辆锁反馈                                 $    $           $    $  ANS007.BYTE006  $  if(((x&0x0C)>>2)==1) y=@131c;else if(((x&0x0C)>>2)==2) y=@131d;else if(((x&0x0C)>>2)==3) y=@131e;else y=@0035;
  $  051.自动熄火解锁                               $    $           $    $  ANS007.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  052.行车自动闭锁                               $    $           $    $  ANS007.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  053.座椅自动调节                               $    $           $    $  ANS007.BYTE007  $  if(((x&0xC0)>>6)==0) y=@131f;else if(((x&0xC0)>>6)==1) y=@1320;else y=@0035;
  $  054.擦除所有内存功能                           $    $           $    $  ANS007.BYTE007  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  055.后视镜和座椅钥匙记忆功能                   $    $           $    $  ANS007.BYTE007  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  056.自动倒车后视镜倾斜                         $    $           $    $  ANS007.BYTE007  $  if(((x&0x0E)>>1)==0) y=@1321;else if(((x&0x0E)>>1)==1) y=@1322;else if(((x&0x0E)>>1)==2) y=@1323;else if(((x&0x0E)>>1)==3) y=@1324;else y=@0035;
  $  057.自动折叠/展开                              $    $           $    $  ANS007.BYTE007  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  058.迎宾灯(让灯亮着)                           $    $           $    $  ANS008.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0035;
  $  059.迎宾灯状态                                 $    $           $    $  ANS008.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  060.单色氛围灯                                 $    $           $    $  ANS008.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  061.天窗懒人开                                 $    $           $    $  ANS008.BYTE006  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  062.全地形系统显示效果                         $    $           $    $  ANS008.BYTE007  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  063.空气净化器                                 $    $           $    $  ANS009.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0035;
  $  064.方向盘定制                                 $    $           $    $  ANS010.BYTE004  $  if(x==0) y=@064f;else if(x==1) y=@1325;else y=@0035;
  $  065.语言                                       $    $           $    $  ANS011.BYTE004  $  if(x==0) y=@00d8;else if(x==1) y=@0486;else if(x==2) y=@08bf;else if(x==3) y=@0672;else if(x==4) y=@08b7;else y=@0035;
  $  066.日期格式                                   $    $           $    $  ANS011.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0b11;else if(((x&0xF0)>>4)==1) y=@0b12;else if(((x&0xF0)>>4)==2) y=@0b13;else y=@0035;
  $  067.时间格式                                   $    $           $    $  ANS011.BYTE005  $  if((x&0x01)==0) y=@05ed;else if((x&0x01)==1) y=@05ec;else y=@0035;
  $  068.转向角度                                   $    $           $    $  ANS012.BYTE004  $  y=(((x1*256+x2)&0x7FFF)-((x1*256+x2)&0x8000))*0.1-780;
  $  069.汽车外观颜色类型配置                       $    $           $    $  ANS013.BYTE004  $  if(x==0x00) y=@06e2;else if(x==0x01) y=@06e3;else if(x==0x02) y=@06e4;else if(x==0x03) y=@0997;else if(x==0x04) y=@06e6;else if(x==0x05) y=@06e7;else if(x==0x06) y=@06e8;else if(x==0x07) y=@06e9;else if(x==0x08) y=@06ea;else if(x==0x09) y=@128a;else if(x==0x0A) y=@128b;else if(x==0x0B) y=@128c;else if(x==0x0C) y=@06ee;else if(x==0x0D) y=@06ef;else if(x==0x0E) y=@06f0;else if(x==0x0F) y=@0998;else if(x==0x10) y=@1246;else if(x==0x11) y=@1247;else y=@0035;
  $  070.空调配置                                   $    $           $    $  ANS013.BYTE005  $  if(x==0x00) y=@120d;else if(x==0x01) y=@120e;else if(x==0x02) y=@120f;else if(x==0x03) y=@1210;else if(x==0x04) y=@1211;else if(x==0x05) y=@1212;else if(x==0x06) y=@1213;else if(x==0x07) y=@1214;else if(x==0x08) y=@1215;else if(x==0x09) y=@1216;else if(x==0x10) y=@1217;else if(x==0x11) y=@1218;else y=@0035;
  $  071.第三排座椅通风                             $    $           $    $  ANS013.BYTE006  $  if(((x&0x80)>>7)==0) y=@00c9;else if(((x&0x80)>>7)==1) y=@0100;else y=@0035;
  $  072.第三排座椅加热                             $    $           $    $  ANS013.BYTE006  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@0100;else y=@0035;
  $  073.第二排座椅通风                             $    $           $    $  ANS013.BYTE006  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@0100;else y=@0035;
  $  074.第二排座椅加热                             $    $           $    $  ANS013.BYTE006  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@0100;else y=@0035;
  $  075.副驾驶员座椅通风                           $    $           $    $  ANS013.BYTE006  $  if(((x&0x08)>>3)==0) y=@00c9;else if(((x&0x08)>>3)==1) y=@0100;else y=@0035;
  $  076.副驾座椅加热                               $    $           $    $  ANS013.BYTE006  $  if(((x&0x04)>>2)==0) y=@00c9;else if(((x&0x04)>>2)==1) y=@0100;else y=@0035;
  $  077.驾驶员座椅通风                             $    $           $    $  ANS013.BYTE006  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@0100;else y=@0035;
  $  078.主驾座椅加热                               $    $           $    $  ANS013.BYTE006  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@0100;else y=@0035;
  $  079.轮胎压力监测系统类型配置                   $    $           $    $  ANS013.BYTE007  $  if(x==0) y=@06f3;else if(x==1) y=@139a;else y=@0035;
  $  080.车道偏离报警(LDW)                          $    $           $    $  ANS014.BYTE004  $  if(x==0) y=@1259;else if(x==1) y=@125a;else y=@0035;
  $  081.自动紧急刹车(AEB)                          $    $           $    $  ANS014.BYTE005  $  if(x==0) y=@0692;else if(x==1) y=@1381;else y=@0035;
  $  082.360°全景配置                              $    $           $    $  ANS014.BYTE006  $  if(x==0) y=@0692;else if(x==1) y=@12d4;else if(x==2) y=@12ff;else y=@0035;
  $  083.仪表                                       $    $           $    $  ANS014.BYTE007  $  if(x==0) y=@1261;else if(x==1) y=@1266;else if(x==2) y=@1264;else if(x==3) y=@1262;else if(x==4) y=@1263;else if(x==5) y=@12d7;else if(x==6) y=@1268;else if(x==7) y=@1269;else if(x==8) y=@1265;else y=@0035;
  $  084.驾驶模式                                   $    $           $    $  ANS015.BYTE004  $  if(x==0) y=@1300;else if(x==1) y=@1301;else y=@0035;
  $  085.发动机启停                                 $    $           $    $  ANS015.BYTE005  $  if(x==0) y=@1270;else if(x==1) y=@0692;else y=@0035;
  $  086.后视镜                                     $    $           $    $  ANS015.BYTE006  $  if(x==0) y=@06dd;else if(x==1) y=@0b05;else if(x==2) y=@06df;else y=@0035;
  $  087.变道辅助系统                               $    $           $    $  ANS015.BYTE007  $  if(x==0) y=@0692;else if(x==1) y=@1270;else y=@0035;
  $  088.抬头显示                                   $    $           $    $  ANS016.BYTE004  $  if(x==0) y=@1249;else if(x==1) y=@1396;else if(x==2) y=@124b;else if(x==3) y=@124c;else y=@0035;
  $  089.车外温度传感器                             $    $           $    $  ANS016.BYTE005  $  if(x==0) y=@124d;else if(x==1) y=@124e;else y=@0035;
  $  090.副驾驶员安全气囊                           $    $           $    $  ANS017.BYTE004  $  if(((x&0xF0)>>4)==0) y=@00c9;else if(((x&0xF0)>>4)==1) y=@0100;else y=@0035;
  $  091.驾驶员安全气囊                             $    $           $    $  ANS017.BYTE004  $  if((x&0x0F)==0) y=@00c9;else if((x&0x0F)==1) y=@0100;else y=@0035;
  $  092.双侧安全气帘                               $    $           $    $  ANS017.BYTE005  $  if(((x&0xF0)>>4)==0) y=@00c9;else if(((x&0xF0)>>4)==1) y=@0100;else y=@0035;
  $  093.驾驶员和前排乘客侧气囊                     $    $           $    $  ANS017.BYTE005  $  if((x&0x0F)==0) y=@00c9;else if((x&0x0F)==1) y=@0100;else y=@0035;
  $  094.安全带扣提醒                               $    $           $    $  ANS017.BYTE006  $  if(x==0) y=@1302;else if(x==1) y=@0aed;else if(x==2) y=@0aee;else y=@0035;
  $  095.雨量传感器                                 $    $           $    $  ANS017.BYTE007  $  if(x==1) y=@0100;else if(x==2) y=@00c9;else y=@0035;
  $  096.车联网                                     $    $           $    $  ANS018.BYTE004  $  if(x==0) y=@048c;else if(x==1) y=@1397;else if(x==2) y=@1398;else if(x==3) y=@1399;else y=@0035;
  $  097.手机已连                                   $    $           $    $  ANS018.BYTE005  $  if(x==0) y=@02ac;else if(x==1) y=@139c;else y=@0035;
  $  098.有Carplay                                  $    $           $    $  ANS018.BYTE006  $  if(x==0) y=@139d;else if(x==1) y=@139e;else y=@0035;
  $  099.Carlife车载                                $    $           $    $  ANS018.BYTE007  $  if(x==0) y=@139f;else if(x==1) y=@13a0;else y=@0035;
  $  100.车道保持辅助系统                           $    $           $    $  ANS019.BYTE004  $  if(x==0) y=@09a7;else if(x==1) y=@09a6;else y=@0035;
  $  101.自适应巡航控制                             $    $           $    $  ANS019.BYTE005  $  if(x==0) y=@016c;else if(x==1) y=@11eb;else y=@0035;
  $  102.牌照识别                                   $    $           $    $  ANS019.BYTE006  $  if(x==0) y=@12f6;else if(x==1) y=@12f7;else y=@0035;
  $  103.座椅记忆系统                               $    $           $    $  ANS019.BYTE007  $  if(x==0) y=@094e;else if(x==1) y=@094d;else y=@0035;
  $  104.疲劳提醒                                   $    $           $    $  ANS020.BYTE004  $  if(x==0) y=@12f4;else if(x==1) y=@12f5;else y=@0035;
  $  105.迎宾灯                                     $    $           $    $  ANS020.BYTE005  $  if(x==0) y=@095e;else if(x==1) y=@095f;else y=@0035;
  $  106.氛围灯分区调节                             $    $           $    $  ANS020.BYTE006  $  if(x==0) y=@0967;else if(x==1) y=@139b;else y=@0035;
  $  107.氛围灯                                     $    $           $    $  ANS020.BYTE007  $  if(x==0) y=@0960;else if(x==1) y=@11db;else if(x==2) y=@11dc;else if(x==3) y=@0963;else if(x==4) y=@0964;else if(x==5) y=@0965;else if(x==6) y=@0966;else y=@0035;
  $  108.后排乘客区电动玻璃                         $    $           $    $  ANS021.BYTE004  $  if(((x&0x80)>>7)==0) y=@00db;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0035;
  $  109.后排乘客区电动玻璃一键自动下               $    $           $    $  ANS021.BYTE004  $  if(((x&0x40)>>6)==0) y=@00db;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0035;
  $  110.副驾驶员电动玻璃                           $    $           $    $  ANS021.BYTE004  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  111.副驾驶员电动玻璃                           $    $           $    $  ANS021.BYTE004  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  112.副驾驶员电动玻璃一键自动下                 $    $           $    $  ANS021.BYTE004  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  113.驾驶员电动玻璃                             $    $           $    $  ANS021.BYTE004  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  114.驾驶员电动玻璃一键自动下                   $    $           $    $  ANS021.BYTE004  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  115.驾驶员电动玻璃一键自动上下（带防夹）       $    $           $    $  ANS021.BYTE004  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  116.车联网类型                                 $    $           $    $  ANS021.BYTE005  $  if(x==0) y=@1303;else if(x==1) y=@1304;else if(x==2) y=@1305;else if(x==3) y=@1200;else if(x==4) y=@1306;else if(x==5) y=@1307;else if(x==6) y=@1308;else if(x==7) y=@1204;else y=@0035;
  $  117.导航类型配置                               $    $           $    $  ANS021.BYTE006  $  if(x==0) y=@12eb;else if(x==1) y=@05aa;else y=@0035;
  $  118.蓝牙免提                                   $    $           $    $  ANS021.BYTE007  $  if(x==0) y=@073b;else if(x==1) y=@12a5;else y=@0035;
  $  119.娱乐系统显示屏                             $    $           $    $  ANS022.BYTE004  $  if(x==0) y=@073c;else if(x==1) y=@1205;else if(x==2) y=@1206;else if(x==3) y=@1207;else if(x==4) y=@1208;else if(x==5) y=@1309;else y=@0035;
  $  120.数字收音机                                 $    $           $    $  ANS022.BYTE005  $  if(x==0) y=@0692;else if(x==1) y=@12ec;else y=@0035;
  $  121.驻车辅助系统                               $    $           $    $  ANS022.BYTE006  $  if(x==0) y=@097f;else if(x==1) y=@0980;else if(x==2) y=@0981;else if(x==3) y=@0982;else y=@0035;
  $  122.后视影像                                   $    $           $    $  ANS022.BYTE007  $  if(x==0) y=@12b6;else if(x==1) y=@11f1;else if(x==2) y=@070d;else if(x==3) y=@070f;else if(x==4) y=@11f2;else if(x==5) y=@098a;else if(x==6) y=@132f;else y=@0035;
  $  123.方向盘配置                                 $    $           $    $  ANS023.BYTE004  $  if(x==0) y=@11f3;else if(x==1) y=@0711;else if(x==2) y=@11f4;else y=@0035;
  $  124.音频类型配置                               $    $           $    $  ANS023.BYTE005  $  if(x==0) y=@0714;else if(x==1) y=@1330;else if(x==2) y=@1331;else if(x==3) y=@0717;else y=@0035;
  $  125.音频输入                                   $    $           $    $  ANS023.BYTE006  $  if(x==0) y=@0719;else if(x==1) y=@0718;else y=@0035;
  $  126.视频输入                                   $    $           $    $  ANS023.BYTE007  $  if(x==0) y=@071b;else if(x==1) y=@071a;else y=@0035;
  $  127.USB端口配置                                $    $           $    $  ANS024.BYTE004  $  if(x==0) y=@11f6;else if(x==1) y=@11f7;else if(x==2) y=@071c;else if(x==3) y=@138b;else y=@0035;
  $  128.FM 50kHZ                                   $    $           $    $  ANS024.BYTE005  $  if(((x&0x20)>>5)==0) y=@00db;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0035;
  $  129.FM 100kHZ                                  $    $           $    $  ANS024.BYTE005  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  130.AM 10kHZ                                   $    $           $    $  ANS024.BYTE005  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  131.AM 9kHZ                                    $    $           $    $  ANS024.BYTE005  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  132.FM 87.5~108MHZ                             $    $           $    $  ANS024.BYTE006  $  if(((x&0x10)>>4)==0) y=@00db;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0035;
  $  133.531~1629KHZ                                $    $           $    $  ANS024.BYTE006  $  if(((x&0x08)>>3)==0) y=@00db;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0035;
  $  134.AM 522~1710KHZ                             $    $           $    $  ANS024.BYTE006  $  if(((x&0x04)>>2)==0) y=@00db;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0035;
  $  135.AM 530 ~1710KHZ                            $    $           $    $  ANS024.BYTE006  $  if(((x&0x02)>>1)==0) y=@00db;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0035;
  $  136.AM 531~1602KHZ                             $    $           $    $  ANS024.BYTE006  $  if((x&0x01)==0) y=@00db;else if((x&0x01)==1) y=@00dc;else y=@0035;
  $  137.扬声器配置                                 $    $           $    $  ANS024.BYTE007  $  if(x==0) y=@069d;else if(x==1) y=@069e;else if(x==2) y=@11f8;else if(x==3) y=@11f9;else if(x==4) y=@13b6;else y=@0035;
  $  138.iPod设备配置                               $    $           $    $  ANS025.BYTE004  $  if(x==0) y=@0692;else if(x==1) y=@12c6;else y=@0035;
  $  139.车型年份配置                               $    $           $    $  ANS025.BYTE005  $  if(x==0) y=@13ab;else if(x==1) y=@13ac;else if(x==2) y=@06a5;else if(x==3) y=@06a6;else if(x==4) y=@06a7;else if(x==5) y=@06a8;else if(x==6) y=@06a9;else if(x==7) y=@06aa;else if(x==8) y=@06ab;else y=@0103;
  $  140.汽车系列配置                               $    $           $    $  ANS025.BYTE006  $  if(x==0) y=@13ad;else if(x==1) y=@13ae;else if(x==2) y=@13af;else if(x==3) y=@13b0;else if(x==4) y=@13b1;else if(x==5) y=@13b2;else if(x==6) y=@13b3;else if(x==7) y=@13b4;else if(x==8) y=@13b5;else y=@0103;
  $  141.车身类型配置                               $    $           $    $  ANS025.BYTE007  $  if(x==0x00) y=@1279;else if(x==0x01) y=@12c7;else if(x==0x02) y=@12c8;else if(x==0x03) y=@127c;else if(x==0x04) y=@06b0;else if(x==0x05) y=@12c9;else if(x==0x06) y=@12ca;else if(x==0x07) y=@12cb;else if(x==0x08) y=@00f3;else if(x==0x09) y=@06b4;else if(x==0x0A) y=@06b5;else y=@0035;
  $  142.汽车品牌配置                               $    $           $    $  ANS026.BYTE004  $  if(x==0x00) y=@066a;else if(x==0x01) y=@066b;else if(x==0x02) y=@066c;else y=@0035;
  $  143.汽车国家代码                               $    $           $    $  ANS026.BYTE005  $  if(x==0x00) y=@00d8;else if(x==0x01) y=@066d;else if(x==0x02) y=@066e;else if(x==0x03) y=@066f;else if(x==0x04) y=@0670;else if(x==0x05) y=@0671;else if(x==0x06) y=@0672;else if(x==0x07) y=@0673;else if(x==0x08) y=@0674;else if(x==0x09) y=@0675;else if(x==0x0A) y=@0676;else if(x==0x0B) y=@0677;else if(x==0x0C) y=@0678;else if(x==0x0D) y=@0679;else if(x==0x0E) y=@067a;else if(x==0x0F) y=@067b;else if(x==0x10) y=@067c;else if(x==0x11) y=@1335;else if(x==0x12) y=@08c2;else y=@0035;
  $  144.汽车驾驶方向盘类型配置                     $    $           $    $  ANS026.BYTE006  $  if(x==0) y=@067d;else if(x==1) y=@067e;else y=@0035;
  $  145.引擎类型配置                               $    $           $    $  ANS026.BYTE007  $  if(x==0) y=@1091;else if(x==1) y=@1090;else y=@0035;
  $  146.变速器配置                                 $    $           $    $  ANS027.BYTE004  $  if(x==0) y=@01dd;else if(x==1) y=@01de;else if(x==2) y=@1092;else y=@0035;
  $  147.尾门和尾盖操作类型配置                     $    $           $    $  ANS027.BYTE005  $  if(x==0) y=@0690;else if(x==1) y=@09cd;else if(x==2) y=@09ce;else if(x==3) y=@0b14;else y=@0035;
  $  148.盲区监测配置                               $    $           $    $  ANS027.BYTE006  $  if(x==0) y=@0692;else if(x==1) y=@129a;else y=@0035;
  $  149.行人报警系统配置                           $    $           $    $  ANS027.BYTE007  $  if(x==0) y=@0692;else if(x==1) y=@1328;else y=@0103;
  $  150.速度警报系统配置                           $    $           $    $  ANS028.BYTE004  $  if(x==0) y=@0692;else if(x==1) y=@132a;else y=@0103;
  $  151.自动紧急呼叫配置                           $    $           $    $  ANS028.BYTE005  $  if(x==0) y=@0692;else if(x==1) y=@03de;else y=@0103;
  $  152.天窗类型配置                               $    $           $    $  ANS028.BYTE006  $  if(x==0) y=@0695;else if(x==1) y=@0693;else if(x==2) y=@0694;else y=@0035;
  $  153.动力类型                                   $    $           $    $  ANS028.BYTE007  $  if(x==0) y=@09d0;else if(x==1) y=@06cd;else if(x==2) y=@06ce;else if(x==3) y=@06cf;else y=@0035;
  $  154.生态驱动模式配置                           $    $           $    $  ANS029.BYTE004  $  if(x==0) y=@12c4;else if(x==1) y=@1275;else y=@0035;
  $  155.前向碰撞预警                               $    $           $    $  ANS029.BYTE005  $  if(x==0) y=@094f;else if(x==1) y=@0950;else y=@0103;
  $  156.顶屏显示                                   $    $           $    $  ANS029.BYTE006  $  if(x==0) y=@0692;else if(x==1) y=@13b7;else y=@0103;
  $  157.光传感器配置                               $    $           $    $  ANS029.BYTE007  $  if(x==0) y=@09c0;else if(x==1) y=@09c1;else y=@0035;
  $  158.空气净化系统                               $    $           $    $  ANS030.BYTE004  $  if(x==0) y=@08ea;else if(x==1) y=@08e7;else if(x==2) y=@08e8;else if(x==3) y=@08e9;else y=@0103;
  $  159.车外观模型                                 $    $           $    $  ANS030.BYTE005  $  if(x==127) y=@06d5;else if(x==128) y=@058e;else if(x==129) y=@0162;else y=@0103;
  $  160.液晶仪表盘                                 $    $           $    $  ANS030.BYTE006  $  if(x==160) y=@13b8;else if(x==161) y=@13b9;else if(x==162) y=@13ba;else y=@0103;
  $  161.GPS芯片                                    $    $           $    $  ANS030.BYTE007  $  if(x==0) y=@13bb;else if(x==1) y=@13bc;else y=@0103;
  $  162.语音识别                                   $    $           $    $  ANS031.BYTE004  $  if(x==0) y=@06da;else if(x==1) y=@1287;else y=@0035;
  $  163.电子稳定单元/防抱死制动系统                $    $           $    $  ANS031.BYTE005  $  if(x==0) y=@12c5;else if(x==1) y=@06b6;else if(x==2) y=@06b7;else y=@0035;
  $  164.SAS是否配置                                $    $           $    $  ANS031.BYTE006  $  if(x==0) y=@132c;else if(x==1) y=@06b9;else y=@0035;
  $  165.一键启动                                   $    $           $    $  ANS031.BYTE007  $  if(x==0) y=@13aa;else if(x==1) y=@003c;else y=@0035;
  $  166.WIFI配置                                   $    $           $    $  ANS032.BYTE004  $  if(x==0) y=@132e;else if(x==1) y=@132d;else y=@0103;
  $  167.轴距                                       $    $           $    $  ANS032.BYTE005  $  if(x==0) y=@0bc6;else if(x==1) y=@0bc5;else y=@0103;
  $  168.底盘离地间隙                               $    $           $    $  ANS032.BYTE006  $  if(x==0) y=@06c0;else if(x==1) y=@06c1;else y=@0035;
  $  169.驾驶类型                                   $    $           $    $  ANS032.BYTE007  $  if(x==0) y=@09d5;else if(x==1) y=@12cc;else if(x==2) y=@12cd;else if(x==3) y=@05dd;else y=@0035;
  $  170.外置高清360模块                            $    $           $    $  ANS033.BYTE004  $  if(x==0) y=@12ce;else if(x==1) y=@12cf;else y=@0035;
  $  171.超速报警                                   $    $           $    $  ANS033.BYTE005  $  if(x==0) y=@13a7;else if(x==1) y=@13a8;else y=@0103;
  $  172.车速限制                                   $    $           $    $  ANS033.BYTE006  $  if(x==0) y=@12d0;else if(x==1) y=@12fc;else if(x==2) y=@13a9;else y=@0103;
  $  173.前向PDC                                    $    $           $    $  ANS033.BYTE007  $  if(x==0) y=@1285;else if(x==1) y=@1286;else y=@0035;
  $  174.汽车里程数                                 $    $  km       $    $  ANS034.BYTE004  $  y=(x1*256*256+x2*256+x3);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
