
    车型ID：10dc

    模拟：协议模拟-->10dc

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:761 02 10 01 00 00 00 00 00       $~  ANS000:769 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:761 02 3E 80 00 00 00 00 00       $!  ANS000:769 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:761 03 19 02 09 00 00 00 00       $#  ANS000:769 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/d9000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:761 04 14 FF FF FF 00 00 00       $$  ANS000:769 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:761 03 22 F1 A0 00 00 00 00       $%  ANS000:769 03 22 F1 A0 00 00 00 00
  $%  REQ001:761 03 22 F1 83 00 00 00 00       $%  ANS001:769 03 22 F1 83 00 00 00 00
  $%  REQ002:761 03 22 F1 A1 00 00 00 00       $%  ANS002:769 03 22 F1 A1 00 00 00 00
  $%  REQ003:761 03 22 F1 91 00 00 00 00       $%  ANS003:769 03 22 F1 91 00 00 00 00
  $%  REQ004:761 03 22 F1 A2 00 00 00 00       $%  ANS004:769 03 22 F1 A2 00 00 00 00
  $%  REQ005:761 03 22 F1 87 00 00 00 00       $%  ANS005:769 03 22 F1 87 00 00 00 00
  $%  REQ006:761 03 22 F1 10 00 00 00 00       $%  ANS006:769 03 22 F1 10 00 00 00 00
  $%  REQ007:761 03 22 F1 92 00 00 00 00       $%  ANS007:769 03 22 F1 92 00 00 00 00
  $%  REQ008:761 03 22 F1 8C 00 00 00 00       $%  ANS008:769 03 22 F1 8C 00 00 00 00
  $%  REQ009:761 03 22 F1 94 00 00 00 00       $%  ANS009:769 03 22 F1 94 00 00 00 00
  $%  REQ010:761 03 22 F1 8A 00 00 00 00       $%  ANS010:769 03 22 F1 8A 00 00 00 00
  $%  REQ011:761 03 22 F1 90 00 00 00 00       $%  ANS011:769 03 22 F1 90 00 00 00 00
  $%  REQ012:761 03 22 F1 A8 00 00 00 00       $%  ANS012:769 03 22 F1 A8 00 00 00 00
  $%  REQ013:761 03 22 F1 8B 00 00 00 00       $%  ANS013:769 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元名称:                    $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4);
  $%  002:出厂日期:                        $%    $%  ANS001.BYTE008  $%  HEX(X1,X2,X3);
  $%  003:射频识别版本:                    $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  004:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次):                  $%    $%  ANS006.BYTE015  $%  HEX(X1,X2,X3);
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:车辆零部件的识别代码:            $%    $%  ANS008.BYTE005  $%  ASCII(X1,X2);
  $%  013:组件代码台:                      $%    $%  ANS008.BYTE007  $%  ASCII(X1,X2,X3,X4);
  $%  014:供应商编码:                      $%    $%  ANS008.BYTE011  $%  ASCII(X1);
  $%  015:年:                              $%    $%  ANS008.BYTE012  $%  ASCII(X1);
  $%  016:月:                              $%    $%  ANS008.BYTE013  $%  ASCII(X1);
  $%  017:日:                              $%    $%  ANS008.BYTE014  $%  ASCII(X1,X2);
  $%  018:序号:                            $%    $%  ANS008.BYTE016  $%  ASCII(X1,X2,X3,X4);
  $%  019:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  020:系统供应商标识号:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  021:车辆识别代码:                    $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  022:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  023:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:761 03 22 B0 0A 00 00 00 00       $  ANS000:769 03 22 B0 0A 00 00 00 00
  $  REQ001:761 03 22 B1 06 00 00 00 00       $  ANS001:769 03 22 B1 06 00 00 00 00
  $  REQ002:761 03 22 B1 0C 00 00 00 00       $  ANS002:769 03 22 B1 0C 00 00 00 00
  $  REQ003:761 03 22 B1 01 00 00 00 00       $  ANS003:769 03 22 B1 01 00 00 00 00
  $  REQ004:761 03 22 B1 0B 00 00 00 00       $  ANS004:769 03 22 B1 0B 00 00 00 00
  $  REQ005:761 03 22 B1 04 00 00 00 00       $  ANS005:769 03 22 B1 04 00 00 00 00
  $  REQ006:761 03 22 D0 01 00 00 00 00       $  ANS006:769 03 22 D0 01 00 00 00 00
  $  REQ007:761 03 22 D1 02 00 00 00 00       $  ANS007:769 03 22 D1 02 00 00 00 00
  $  REQ008:761 03 22 C0 0C 00 00 00 00       $  ANS008:769 03 22 C0 0C 00 00 00 00
  $  REQ009:761 03 22 C0 01 00 00 00 00       $  ANS009:769 03 22 C0 01 00 00 00 00
  $  REQ010:761 03 22 C0 10 00 00 00 00       $  ANS010:769 03 22 C0 10 00 00 00 00
  $  REQ011:761 03 22 C0 11 00 00 00 00       $  ANS011:769 03 22 C0 11 00 00 00 00
  $  REQ012:761 03 22 C0 12 00 00 00 00       $  ANS012:769 03 22 C0 12 00 00 00 00
  $  REQ013:761 03 22 C0 13 00 00 00 00       $  ANS013:769 03 22 C0 13 00 00 00 00
  $  REQ014:761 03 22 C0 14 00 00 00 00       $  ANS014:769 03 22 C0 14 00 00 00 00
  $  REQ015:761 03 22 C0 16 00 00 00 00       $  ANS015:769 03 22 C0 16 00 00 00 00
  $  REQ016:761 03 22 C0 17 00 00 00 00       $  ANS016:769 03 22 C0 17 00 00 00 00
  $  REQ017:761 03 22 C0 18 00 00 00 00       $  ANS017:769 03 22 C0 18 00 00 00 00
  $  REQ018:761 03 22 C0 02 00 00 00 00       $  ANS018:769 03 22 C0 02 00 00 00 00
  $  REQ019:761 03 22 C0 20 00 00 00 00       $  ANS019:769 03 22 C0 20 00 00 00 00
  $  REQ020:761 03 22 C0 21 00 00 00 00       $  ANS020:769 03 22 C0 21 00 00 00 00
  $  REQ021:761 03 22 C0 22 00 00 00 00       $  ANS021:769 03 22 C0 22 00 00 00 00
  $  REQ022:761 03 22 C0 23 00 00 00 00       $  ANS022:769 03 22 C0 23 00 00 00 00
  $  REQ023:761 03 22 C0 24 00 00 00 00       $  ANS023:769 03 22 C0 24 00 00 00 00
  $  REQ024:761 03 22 C0 25 00 00 00 00       $  ANS024:769 03 22 C0 25 00 00 00 00
  $  REQ025:761 03 22 C0 26 00 00 00 00       $  ANS025:769 03 22 C0 26 00 00 00 00
  $  REQ026:761 03 22 C0 03 00 00 00 00       $  ANS026:769 03 22 C0 03 00 00 00 00
  $  REQ027:761 03 22 C0 04 00 00 00 00       $  ANS027:769 03 22 C0 04 00 00 00 00
  $  REQ028:761 03 22 C0 05 00 00 00 00       $  ANS028:769 03 22 C0 05 00 00 00 00
  $  REQ029:761 03 22 C0 06 00 00 00 00       $  ANS029:769 03 22 C0 06 00 00 00 00
  $  REQ030:761 03 22 C0 07 00 00 00 00       $  ANS030:769 03 22 C0 07 00 00 00 00
  $  REQ031:761 03 22 C0 08 00 00 00 00       $  ANS031:769 03 22 C0 08 00 00 00 00
  $  REQ032:761 03 22 C0 09 00 00 00 00       $  ANS032:769 03 22 C0 09 00 00 00 00
  $  REQ033:761 03 22 C0 0A 00 00 00 00       $  ANS033:769 03 22 C0 0A 00 00 00 00
  $  REQ034:761 03 22 C0 0B 00 00 00 00       $  ANS034:769 03 22 C0 0B 00 00 00 00
  $  REQ035:761 03 22 C0 0D 00 00 00 00       $  ANS035:769 03 22 C0 0D 00 00 00 00
  $  REQ036:761 03 22 C0 0E 00 00 00 00       $  ANS036:769 03 22 C0 0E 00 00 00 00
  $  REQ037:761 03 22 C0 0F 00 00 00 00       $  ANS037:769 03 22 C0 0F 00 00 00 00

  $  000.电源模式                            $    $           $    $  ANS000.BYTE004  $  if(((x&0xE0)>>5)==0) y=@0137;else if(((x&0xE0)>>5)==1) y=@0011;else if(((x&0xE0)>>5)==2) y=@064d;else if(((x&0xE0)>>5)==3) y=@0474;else if(((x&0xE0)>>5)==4) y=@12d8;else if(((x&0xE0)>>5)==5) y=@12d9;else if(((x&0xE0)>>5)==6) y=@0657;else if(((x&0xE0)>>5)==7) y=@0525;else y=@0035;
  $  001.当前电瓶电压                        $    $  V        $    $  ANS001.BYTE004  $  y=x*0.1;
  $  002.当前MIC电压                         $    $  V        $    $  ANS001.BYTE005  $  y=x*0.1;
  $  003.当前调谐器天线电压                  $    $  V        $    $  ANS001.BYTE006  $  y=x*0.1;
  $  004.当前左方向盘控制电压                $    $  V        $    $  ANS001.BYTE007  $  y=x*0.1;
  $  005.当前右方向盘控制电压                $    $  V        $    $  ANS001.BYTE008  $  y=x*0.1;
  $  006.获取J6软件版本                      $    $           $    $  ANS002.BYTE004  $  y=UINT64(x8,x9,x10,x11,x12,x13,x14,x15);
  $  007.FICM PDSN数                         $    $           $    $  ANS003.BYTE004  $  y=UINT64(x13,x14,x15,x16,x17,x18,x19,x20);
  $  008.时区                                $    $           $    $  ANS004.BYTE004  $  y=x;
  $  009.获得RL78软件版本                    $    $           $    $  ANS005.BYTE004  $  y=UINT64(x3,x4,x5,x6,x7,x8,x9,x10);
  $  010.全局KL50状态                        $    $           $    $  ANS006.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  011.全局发动机运行激活状态              $    $           $    $  ANS006.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@016d;else y=@0035;
  $  012.全局KL15状态                        $    $           $    $  ANS006.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  013.全局ACC/KLR状态                     $    $           $    $  ANS006.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  014.系统KL50状态                        $    $           $    $  ANS006.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  015.系统发动机运行激活状态              $    $           $    $  ANS006.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  016.系统KL15状态                        $    $           $    $  ANS006.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  017.系统ACC/KLR状态                     $    $           $    $  ANS006.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  018.方向盘控制音量增大                  $    $           $    $  ANS007.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  019.方向盘控制音量减小                  $    $           $    $  ANS007.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@016d;else y=@0035;
  $  020.方向盘控制上寻                      $    $           $    $  ANS007.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  021.方向盘控制下寻                      $    $           $    $  ANS007.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  022.方向盘控制静音                      $    $           $    $  ANS007.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@016d;else y=@0035;
  $  023.转向盘控制呼叫拒绝                  $    $           $    $  ANS007.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  024.方向盘控制源                        $    $           $    $  ANS007.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  025.方向盘控制*按钮                     $    $           $    $  ANS007.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  026.方向盘控制语音控制                  $    $           $    $  ANS007.BYTE005  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  027.跛行回家                            $    $           $    $  ANS007.BYTE006  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  028.车型1                               $    $           $    $  ANS008.BYTE004  $  if(x==0) y=@0178;else if(x==1) y=@1235;else if(x==2) y=@12da;else if(x==3) y=@12db;else if(x==4) y=@12dc;else if(x==5) y=@12dd;else if(x==6) y=@12de;else if(x==7) y=@12df;else y=@0103;
  $  029.车型2                               $    $           $    $  ANS008.BYTE005  $  if(x==127) y=@0178;else if(x==128) y=@0179;else if(x==129) y=@017e;else if(x==130) y=@0cc1;else if(x==131) y=@0d75;else if(x==132) y=@0c73;else if(x==133) y=@12e0;else if(x==134) y=@12dc;else if(x==135) y=@12e1;else if(x==136) y=@12e2;else y=@0103;
  $  030.板卡信息                            $    $           $    $  ANS008.BYTE006  $  if(x==136) y=@12e3;else if(x==137) y=@12e4;else if(x==160) y=@123d;else if(x==161) y=@12e5;else if(x==208) y=@123f;else if(x==209) y=@1240;else if(x==211) y=@1241;else if(x==227) y=@12e6;else y=@0103;
  $  031.导航芯片                            $    $           $    $  ANS008.BYTE007  $  if(x==0) y=@13bb;else if(x==1) y=@13bc;else y=@0103;
  $  032.汽车外观颜色类型配置                $    $           $    $  ANS009.BYTE004  $  if(x==0x00) y=@06e2;else if(x==0x01) y=@06e3;else if(x==0x02) y=@06e4;else if(x==0x03) y=@0997;else if(x==0x04) y=@06e6;else if(x==0x05) y=@06e7;else if(x==0x06) y=@06e8;else if(x==0x07) y=@06e9;else if(x==0x08) y=@06ea;else if(x==0x09) y=@128a;else if(x==0x0A) y=@128b;else if(x==0x0B) y=@128c;else if(x==0x0C) y=@06ee;else if(x==0x0D) y=@06ef;else if(x==0x0E) y=@06f0;else if(x==0x0F) y=@0998;else if(x==0x10) y=@1246;else if(x==0x11) y=@1247;else if(x==0x12) y=@0cf5;else if(x==0x13) y=@1248;else if(x==0x14) y=@0cf0;else y=@0103;
  $  033.空调类型配置                        $    $           $    $  ANS009.BYTE005  $  if(x==0x00) y=@120d;else if(x==0x01) y=@120e;else if(x==0x02) y=@120f;else if(x==0x03) y=@1210;else if(x==0x04) y=@1211;else if(x==0x05) y=@1212;else if(x==0x06) y=@1213;else if(x==0x07) y=@1214;else if(x==0x08) y=@1215;else if(x==0x09) y=@1216;else if(x==0x0A) y=@1217;else if(x==0x0B) y=@1218;else y=@0103;
  $  034.第三排座椅加热                      $    $           $    $  ANS009.BYTE006  $  if(((x&0xC0)>>6)==0) y=@1219;else if(((x&0xC0)>>6)==1) y=@121a;else if(((x&0xC0)>>6)==2) y=@121b;else if(((x&0xC0)>>6)==3) y=@121c;else y=@0035;
  $  035.第二排座椅加热                      $    $           $    $  ANS009.BYTE006  $  if(((x&0x30)>>4)==0) y=@121d;else if(((x&0x30)>>4)==1) y=@121e;else if(((x&0x30)>>4)==2) y=@121f;else if(((x&0x30)>>4)==3) y=@1220;else y=@0035;
  $  036.副驾座椅加热                        $    $           $    $  ANS009.BYTE006  $  if(((x&0x0C)>>2)==0) y=@1221;else if(((x&0x0C)>>2)==1) y=@1222;else if(((x&0x0C)>>2)==2) y=@1223;else if(((x&0x0C)>>2)==3) y=@1224;else y=@0035;
  $  037.主驾座椅加热                        $    $           $    $  ANS009.BYTE006  $  if((x&0x03)==0) y=@1225;else if((x&0x03)==1) y=@1226;else if((x&0x03)==2) y=@1227;else if((x&0x03)==3) y=@1228;else y=@0035;
  $  038.轮胎压力监测系统类型配置            $    $           $    $  ANS009.BYTE007  $  if(x==0) y=@06f3;else if(x==1) y=@09a3;else if(x==2) y=@12d2;else y=@0103;
  $  039.超速报警状态                        $    $           $    $  ANS010.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  040.法规项固定超速报警                  $    $  km/h     $    $  ANS010.BYTE005  $  y=x;
  $  041.报警灵敏度                          $    $           $    $  ANS010.BYTE007  $  if(((x&0xF0)>>4)==0) y=@06c7;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@06cb;else y=@0103;
  $  042.车道偏离警告                        $    $           $    $  ANS010.BYTE007  $  if((x&0x0F)==0) y=@0aff;else if((x&0x0F)==1) y=@1326;else if((x&0x0F)==2) y=@122d;else y=@0103;
  $  043.盲点检测报警器                      $    $           $    $  ANS011.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  044.驾驶员疲劳提示                      $    $           $    $  ANS011.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  045.360度全景停车(低速开启转向灯)       $    $           $    $  ANS011.BYTE006  $  if(((x&0xF0)>>4)==0) y=@000f;else if(((x&0xF0)>>4)==1) y=@016d;else y=@0103;
  $  046.360度全景停车(车辆启动)             $    $           $    $  ANS011.BYTE006  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@016d;else y=@0103;
  $  047.前碰撞系统(报警灵敏度)              $    $           $    $  ANS011.BYTE007  $  if(((x&0xF0)>>4)==0) y=@06c7;else if(((x&0xF0)>>4)==1) y=@08ce;else if(((x&0xF0)>>4)==2) y=@06cb;else y=@0103;
  $  048.正面碰撞系统(前碰撞警告)            $    $           $    $  ANS011.BYTE007  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@016d;else if((x&0x0F)==2) y=@1327;else y=@0103;
  $  049.伴我回家(让灯亮着)                  $    $           $    $  ANS012.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0103;
  $  050.回家功能状态                        $    $           $    $  ANS012.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  051.寻车反馈                            $    $           $    $  ANS012.BYTE005  $  if(x==0) y=@131d;else if(x==1) y=@131c;else y=@0103;
  $  052.非钥匙解锁                          $    $           $    $  ANS012.BYTE006  $  if(((x&0x20)>>5)==0) y=@131a;else if(((x&0x20)>>5)==1) y=@131b;else y=@0035;
  $  053.钥匙开锁                            $    $           $    $  ANS012.BYTE006  $  if(((x&0x10)>>4)==0) y=@131a;else if(((x&0x10)>>4)==1) y=@131b;else y=@0035;
  $  054.车辆锁反馈                          $    $           $    $  ANS012.BYTE006  $  if(((x&0x0C)>>2)==1) y=@131c;else if(((x&0x0C)>>2)==2) y=@131d;else if(((x&0x0C)>>2)==3) y=@131e;else y=@0103;
  $  055.自动熄火解锁                        $    $           $    $  ANS012.BYTE006  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  056.行车自动闭锁                        $    $           $    $  ANS012.BYTE006  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  057.座椅自动调节                        $    $           $    $  ANS012.BYTE007  $  if(((x&0xC0)>>6)==0) y=@131f;else if(((x&0xC0)>>6)==1) y=@1320;else y=@0103;
  $  058.擦除所有内存功能                    $    $           $    $  ANS012.BYTE007  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@016d;else y=@0035;
  $  059.后视镜和座椅钥匙记忆功能            $    $           $    $  ANS012.BYTE007  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@016d;else y=@0035;
  $  060.自动倒车后视镜倾斜                  $    $           $    $  ANS012.BYTE007  $  if(((x&0x0E)>>1)==0) y=@1321;else if(((x&0x0E)>>1)==1) y=@1322;else if(((x&0x0E)>>1)==2) y=@1323;else if(((x&0x0E)>>1)==3) y=@1324;else y=@0103;
  $  061.自动折叠/展开                       $    $           $    $  ANS012.BYTE007  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0035;
  $  062.方向盘定制                          $    $           $    $  ANS013.BYTE004  $  if(x==0) y=@064f;else if(x==1) y=@1325;else y=@0103;
  $  063.语言                                $    $           $    $  ANS014.BYTE004  $  if(x==0) y=@00d8;else if(x==1) y=@0486;else if(x==2) y=@08bf;else if(x==3) y=@0672;else if(x==4) y=@08b7;else y=@0103;
  $  064.日期格式                            $    $           $    $  ANS014.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0b11;else if(((x&0xF0)>>4)==1) y=@0b12;else if(((x&0xF0)>>4)==2) y=@0b13;else y=@0103;
  $  065.时间格式                            $    $           $    $  ANS014.BYTE005  $  if((x&0x01)==0) y=@05ed;else if((x&0x01)==1) y=@05ec;else y=@0103;
  $  066.限速识别                            $    $           $    $  ANS015.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  067.前方停车距离控制                    $    $           $    $  ANS015.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  068.迎宾灯(让灯亮着)                    $    $           $    $  ANS016.BYTE004  $  if(((x&0xF0)>>4)==0) y=@0491;else if(((x&0xF0)>>4)==1) y=@0492;else if(((x&0xF0)>>4)==2) y=@0493;else y=@0103;
  $  069.迎宾灯状态                          $    $           $    $  ANS016.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@016d;else y=@0103;
  $  070.单色氛围灯                          $    $           $    $  ANS016.BYTE005  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  071.天窗懒人开                          $    $           $    $  ANS016.BYTE006  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  072.全地形系统显示效果                  $    $           $    $  ANS016.BYTE007  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  073.空气净化器                          $    $           $    $  ANS017.BYTE004  $  if(x==0) y=@000f;else if(x==1) y=@016d;else y=@0103;
  $  074.车道偏离报警                        $    $           $    $  ANS018.BYTE004  $  if(x==0) y=@1259;else if(x==1) y=@125a;else y=@0103;
  $  075.自动紧急刹车                        $    $           $    $  ANS018.BYTE005  $  if(x==0) y=@125b;else if(x==1) y=@12d3;else y=@0103;
  $  076.360°全景配置                       $    $           $    $  ANS018.BYTE006  $  if(x==0) y=@12d4;else if(x==1) y=@125d;else if(x==2) y=@12d5;else if(x==3) y=@125e;else if(x==4) y=@125f;else y=@0103;
  $  077.仪表                                $    $           $    $  ANS018.BYTE007  $  if(x==0x00) y=@1261;else if(x==0x01) y=@0178;else if(x==0x02) y=@1262;else if(x==0x03) y=@1263;else if(x==0x04) y=@0179;else if(x==0x05) y=@1264;else if(x==0x06) y=@017e;else if(x==0x07) y=@0cc1;else if(x==0x08) y=@12d6;else if(x==0x09) y=@0c73;else if(x==0x0A) y=@0c74;else if(x==0x0B) y=@0c75;else if(x==0x0C) y=@0cc5;else if(x==0x0D) y=@0cc6;else if(x==0x0E) y=@0c78;else if(x==0x0F) y=@0c79;else if(x==0x10) y=@1266;else if(x==0x11) y=@12d7;else if(x==0x12) y=@0c7e;else if(x==0x13) y=@0c7f;else if(x==0x14) y=@1268;else if(x==0x15) y=@1269;else y=@0103;
  $  078.驾驶模式                            $    $           $    $  ANS019.BYTE004  $  if(x==0) y=@1300;else if(x==1) y=@1301;else y=@0103;
  $  079.发动机启停                          $    $           $    $  ANS019.BYTE005  $  if(x==0) y=@126c;else if(x==1) y=@126d;else y=@0103;
  $  080.后视镜类型                          $    $           $    $  ANS019.BYTE006  $  if(x==0) y=@12ed;else if(x==1) y=@126e;else if(x==2) y=@12ee;else if(x==3) y=@06de;else y=@0103;
  $  081.有变道辅助系统                      $    $           $    $  ANS019.BYTE007  $  if(x==0) y=@0692;else if(x==1) y=@12ef;else y=@0103;
  $  082.抬头显示                            $    $           $    $  ANS020.BYTE004  $  if(x==0) y=@1249;else if(x==1) y=@124a;else if(x==2) y=@124b;else if(x==3) y=@124c;else if(x==4) y=@0035;else y=@0103;
  $  083.车外温度传感器                      $    $           $    $  ANS020.BYTE005  $  if(x==0) y=@124d;else if(x==1) y=@124e;else y=@0103;
  $  084.副驾驶员安全气囊                    $    $           $    $  ANS021.BYTE004  $  if(((x&0xF0)>>4)==0) y=@1255;else if(((x&0xF0)>>4)==1) y=@12f0;else y=@0103;
  $  085.驾驶员安全气囊                      $    $           $    $  ANS021.BYTE004  $  if((x&0x0F)==0) y=@1257;else if((x&0x0F)==1) y=@1258;else y=@0103;
  $  086.双侧安全气帘                        $    $           $    $  ANS021.BYTE005  $  if(((x&0xF0)>>4)==0) y=@09b6;else if(((x&0xF0)>>4)==1) y=@09b7;else y=@0103;
  $  087.驾驶员和前排乘客侧气囊              $    $           $    $  ANS021.BYTE005  $  if((x&0x0F)==0) y=@09b8;else if((x&0x0F)==1) y=@12f1;else y=@0103;
  $  088.安全带扣提醒                        $    $           $    $  ANS021.BYTE006  $  if(x==0) y=@1302;else if(x==1) y=@0aed;else if(x==2) y=@0aee;else y=@0103;
  $  089.雨量传感器                          $    $           $    $  ANS021.BYTE007  $  if(x==0) y=@0aef;else if(x==1) y=@12f2;else y=@0103;
  $  090.车联网                              $    $           $    $  ANS022.BYTE004  $  if(x==0) y=@048c;else if(x==1) y=@06e0;else if(x==2) y=@06e1;else if(x==3) y=@048e;else y=@0103;
  $  091.手机映射                            $    $           $    $  ANS022.BYTE005  $  if(x==0) y=@12f3;else if(x==1) y=@095d;else y=@0103;
  $  092.有Carplay                           $    $           $    $  ANS022.BYTE006  $  if(x==0) y=@12f3;else if(x==1) y=@095d;else y=@0103;
  $  093.Carlife车载                         $    $           $    $  ANS022.BYTE007  $  if(x==0) y=@12f3;else if(x==1) y=@095d;else y=@0103;
  $  094.车道保持辅助系统                    $    $           $    $  ANS023.BYTE004  $  if(x==0) y=@09a7;else if(x==1) y=@09a6;else y=@0103;
  $  095.自适应巡航控制                      $    $           $    $  ANS023.BYTE005  $  if(x==0) y=@016c;else if(x==1) y=@11eb;else y=@0103;
  $  096.牌照识别                            $    $           $    $  ANS023.BYTE006  $  if(x==0) y=@12f6;else if(x==1) y=@12f7;else y=@0103;
  $  097.座椅记忆系统                        $    $           $    $  ANS023.BYTE007  $  if(x==0) y=@094e;else if(x==1) y=@094d;else y=@0103;
  $  098.疲劳提醒                            $    $           $    $  ANS024.BYTE004  $  if(x==0) y=@12f4;else if(x==1) y=@12f5;else y=@0103;
  $  099.迎宾灯                              $    $           $    $  ANS024.BYTE005  $  if(x==0) y=@095e;else if(x==1) y=@095f;else y=@0103;
  $  100.氛围灯分区调整                      $    $           $    $  ANS024.BYTE006  $  if(x==0) y=@0967;else if(x==1) y=@11ee;else if(x==2) y=@11ef;else if(x==3) y=@11f0;else y=@0103;
  $  101.氛围灯                              $    $           $    $  ANS024.BYTE007  $  if(x==0) y=@0960;else if(x==1) y=@11db;else if(x==2) y=@11dc;else if(x==3) y=@12e7;else if(x==4) y=@12e8;else if(x==5) y=@12e9;else if(x==6) y=@12ea;else y=@0103;
  $  102.ANC                                 $    $           $    $  ANS025.BYTE004  $  if(x==0) y=@11df;else if(x==1) y=@11e0;else y=@0103;
  $  103.支架                                $    $           $    $  ANS025.BYTE005  $  if(x==0) y=@11e1;else if(x==1) y=@11e2;else y=@0103;
  $  104.后排乘客区车窗玻璃升降类型          $    $           $    $  ANS026.BYTE004  $  if(((x&0x30)>>4)==0) y=@11ea;else if(((x&0x30)>>4)==1) y=@072f;else if(((x&0x30)>>4)==2) y=@0730;else if(((x&0x30)>>4)==3) y=@0035;else y=@0035;
  $  105.副驾车窗玻璃升降类型                $    $           $    $  ANS026.BYTE004  $  if(((x&0x0C)>>2)==0) y=@072c;else if(((x&0x0C)>>2)==1) y=@072d;else if(((x&0x0C)>>2)==2) y=@072e;else if(((x&0x0C)>>2)==3) y=@0035;else y=@0035;
  $  106.主驾车窗玻璃升降类型                $    $           $    $  ANS026.BYTE004  $  if((x&0x03)==0) y=@0729;else if((x&0x03)==1) y=@072a;else if((x&0x03)==2) y=@072b;else if((x&0x03)==3) y=@0035;else y=@0035;
  $  107.车联网类型                          $    $           $    $  ANS026.BYTE005  $  if(x==0) y=@1303;else if(x==1) y=@1304;else if(x==2) y=@1305;else if(x==3) y=@1200;else if(x==4) y=@1306;else if(x==5) y=@1307;else if(x==6) y=@1308;else if(x==7) y=@1204;else y=@0103;
  $  108.导航类型配置                        $    $           $    $  ANS026.BYTE006  $  if(x==0) y=@12eb;else if(x==1) y=@05aa;else y=@0103;
  $  109.免提配置                            $    $           $    $  ANS026.BYTE007  $  if(x==0) y=@073b;else if(x==1) y=@073a;else y=@0103;
  $  110.娱乐系统显示屏                      $    $           $    $  ANS027.BYTE004  $  if(x==0) y=@073c;else if(x==1) y=@1205;else if(x==2) y=@1206;else if(x==3) y=@1207;else if(x==4) y=@1208;else if(x==5) y=@1209;else if(x==6) y=@120a;else y=@0103;
  $  111.数字收音机                          $    $           $    $  ANS027.BYTE005  $  if(x==0) y=@0692;else if(x==1) y=@12ec;else y=@0103;
  $  112.驻车辅助系统                        $    $           $    $  ANS027.BYTE006  $  if(x==0) y=@097f;else if(x==1) y=@0980;else if(x==2) y=@0981;else if(x==3) y=@0982;else if(x==4) y=@120c;else y=@0103;
  $  113.后视影像                            $    $           $    $  ANS027.BYTE007  $  if(x==0x00) y=@12b6;else if(x==0x01) y=@11f1;else if(x==0x02) y=@070d;else if(x==0x03) y=@070f;else if(x==0x04) y=@070f;else if(x==0x05) y=@12b7;else if(x==0x06) y=@12b8;else if(x==0x07) y=@12b9;else if(x==0x08) y=@12ba;else if(x==0x09) y=@12bb;else if(x==0x0A) y=@12bc;else if(x==0x0B) y=@12bd;else if(x==0x0C) y=@12be;else y=@0103;
  $  114.方向盘配置                          $    $           $    $  ANS028.BYTE004  $  if(x==0) y=@11f3;else if(x==1) y=@0711;else if(x==2) y=@11f4;else y=@0103;
  $  115.音频类型配置                        $    $           $    $  ANS028.BYTE005  $  if(x==0) y=@0714;else if(x==1) y=@1330;else if(x==2) y=@1331;else if(x==3) y=@0717;else y=@0103;
  $  116.音频输入                            $    $           $    $  ANS028.BYTE006  $  if(x==0) y=@0719;else if(x==1) y=@0718;else y=@0103;
  $  117.视频输入                            $    $           $    $  ANS028.BYTE007  $  if(x==0) y=@071b;else if(x==1) y=@071a;else y=@0103;
  $  118.USB端口配置                         $    $           $    $  ANS029.BYTE004  $  if(x==0) y=@11f6;else if(x==1) y=@11f7;else if(x==2) y=@071c;else if(x==3) y=@138b;else y=@0103;
  $  119.FM收音机步进 50KHz                  $    $           $    $  ANS029.BYTE005  $  if(((x&0x20)>>5)==0) y=@0437;else if(((x&0x20)>>5)==1) y=@0627;else y=@0035;
  $  120.FM收音机步进 100KHz                 $    $           $    $  ANS029.BYTE005  $  if(((x&0x10)>>4)==0) y=@0437;else if(((x&0x10)>>4)==1) y=@0627;else y=@0035;
  $  121.AM收音机步进 10KHz                  $    $           $    $  ANS029.BYTE005  $  if(((x&0x02)>>1)==0) y=@0437;else if(((x&0x02)>>1)==1) y=@0627;else y=@0035;
  $  122.AM收音机步进 9KHz                   $    $           $    $  ANS029.BYTE005  $  if((x&0x01)==0) y=@0437;else if((x&0x01)==1) y=@0627;else y=@0035;
  $  123.收音机频段 FM 87.5~108 MHZ          $    $           $    $  ANS029.BYTE006  $  if(((x&0x10)>>4)==0) y=@0437;else if(((x&0x10)>>4)==1) y=@0627;else y=@0035;
  $  124.收音机频段 AM 531~1629 KHZ          $    $           $    $  ANS029.BYTE006  $  if(((x&0x08)>>3)==0) y=@0437;else if(((x&0x08)>>3)==1) y=@0627;else y=@0035;
  $  125.收音机频段 AM 522~1710 KHZ          $    $           $    $  ANS029.BYTE006  $  if(((x&0x04)>>2)==0) y=@0437;else if(((x&0x04)>>2)==1) y=@0627;else y=@0035;
  $  126.收音机频段 AM 530~1710 KHZ          $    $           $    $  ANS029.BYTE006  $  if(((x&0x02)>>1)==0) y=@0437;else if(((x&0x02)>>1)==1) y=@0627;else y=@0035;
  $  127.收音机频段 AM 531~1602 KHZ          $    $           $    $  ANS029.BYTE006  $  if((x&0x01)==0) y=@0437;else if((x&0x01)==1) y=@0627;else y=@0035;
  $  128.扬声器配置                          $    $           $    $  ANS029.BYTE007  $  if(x==0) y=@069d;else if(x==1) y=@069e;else if(x==2) y=@11f8;else if(x==3) y=@11f9;else if(x==4) y=@11fa;else y=@0103;
  $  129.iPod设备配置                        $    $           $    $  ANS030.BYTE004  $  if(x==0) y=@0692;else if(x==1) y=@12c6;else y=@0103;
  $  130.车型年份配置                        $    $           $    $  ANS030.BYTE005  $  if(x==0) y=@13ab;else if(x==1) y=@13ac;else if(x==2) y=@06a5;else if(x==3) y=@06a6;else if(x==4) y=@06a7;else if(x==5) y=@06a8;else if(x==6) y=@06a9;else if(x==7) y=@06aa;else if(x==8) y=@06ab;else y=@0103;
  $  131.汽车系列配置                        $    $           $    $  ANS030.BYTE006  $  if(x==0) y=@13ad;else if(x==1) y=@13ae;else if(x==2) y=@13af;else if(x==3) y=@13b0;else if(x==4) y=@13b1;else if(x==5) y=@13b2;else if(x==6) y=@13b3;else if(x==7) y=@13b4;else if(x==8) y=@13b5;else y=@0103;
  $  132.车身类型配置                        $    $           $    $  ANS030.BYTE007  $  if(x==0x00) y=@1279;else if(x==0x01) y=@12c7;else if(x==0x02) y=@12c8;else if(x==0x03) y=@127c;else if(x==0x04) y=@06b0;else if(x==0x05) y=@12c9;else if(x==0x06) y=@12ca;else if(x==0x07) y=@12cb;else if(x==0x08) y=@00f3;else if(x==0x09) y=@06b4;else if(x==0x0A) y=@06b5;else y=@0103;
  $  133.汽车品牌配置                        $    $           $    $  ANS031.BYTE004  $  if(x==0x00) y=@066a;else if(x==0x01) y=@066b;else if(x==0x02) y=@066c;else if(x==0x03) y=@0cea;else y=@0103;
  $  134.汽车国家代码                        $    $           $    $  ANS031.BYTE005  $  if(x==0x00) y=@00d8;else if(x==0x01) y=@066d;else if(x==0x02) y=@066e;else if(x==0x03) y=@066f;else if(x==0x04) y=@0670;else if(x==0x05) y=@0671;else if(x==0x06) y=@0672;else if(x==0x07) y=@0673;else if(x==0x08) y=@0674;else if(x==0x09) y=@0675;else if(x==0x0A) y=@0676;else if(x==0x0B) y=@0677;else if(x==0x0C) y=@0678;else if(x==0x0D) y=@0679;else if(x==0x0E) y=@067a;else if(x==0x0F) y=@067b;else if(x==0x10) y=@067c;else if(x==0x11) y=@09c9;else if(x==0x12) y=@08c2;else y=@0103;
  $  135.汽车驾驶方向盘类型配置              $    $           $    $  ANS031.BYTE006  $  if(x==0) y=@067d;else if(x==1) y=@067e;else y=@0103;
  $  136.引擎类型配置                        $    $           $    $  ANS031.BYTE007  $  if(x==0) y=@1091;else if(x==1) y=@1090;else y=@0103;
  $  137.变速器配置                          $    $           $    $  ANS032.BYTE004  $  if(x==0) y=@1297;else if(x==1) y=@1298;else if(x==2) y=@00fa;else if(x==3) y=@1299;else if(x==4) y=@12c3;else y=@0103;
  $  138.尾门和尾盖操作类型配置              $    $           $    $  ANS032.BYTE005  $  if(x==0) y=@0690;else if(x==1) y=@09cd;else if(x==2) y=@09ce;else if(x==3) y=@0b14;else y=@0103;
  $  139.盲区监测配置                        $    $           $    $  ANS032.BYTE006  $  if(x==0) y=@0692;else if(x==1) y=@09ab;else y=@0103;
  $  140.行人报警系统配置                    $    $           $    $  ANS032.BYTE007  $  if(x==0) y=@0692;else if(x==1) y=@1271;else y=@0103;
  $  141.速度警报系统配置                    $    $           $    $  ANS033.BYTE004  $  if(x==0) y=@0692;else if(x==1) y=@09cf;else y=@0103;
  $  142.自动紧急呼叫配置                    $    $           $    $  ANS033.BYTE005  $  if(x==0) y=@0692;else if(x==1) y=@03de;else y=@0103;
  $  143.天窗类型配置                        $    $           $    $  ANS033.BYTE006  $  if(x==0) y=@0693;else if(x==1) y=@0694;else if(x==2) y=@0695;else y=@0103;
  $  144.动力类型                            $    $           $    $  ANS033.BYTE007  $  if(x==0) y=@09d0;else if(x==1) y=@06cd;else if(x==2) y=@06ce;else if(x==3) y=@06cf;else y=@0103;
  $  145.生态驱动模式配置                    $    $           $    $  ANS034.BYTE004  $  if(x==0) y=@12c4;else if(x==1) y=@1275;else y=@0103;
  $  146.前向碰撞预警                        $    $           $    $  ANS034.BYTE005  $  if(x==0) y=@094f;else if(x==1) y=@0950;else y=@0103;
  $  147.带吸顶屏                            $    $           $    $  ANS034.BYTE006  $  if(x==0) y=@0692;else if(x==1) y=@13b7;else y=@0103;
  $  148.光传感器配置                        $    $           $    $  ANS034.BYTE007  $  if(x==0) y=@09c0;else if(x==1) y=@09c1;else y=@0103;
  $  149.语音识别                            $    $           $    $  ANS035.BYTE004  $  if(x==0) y=@06da;else if(x==1) y=@1287;else y=@0103;
  $  150.ABS/ESP                             $    $           $    $  ANS035.BYTE005  $  if(x==0) y=@12c5;else if(x==1) y=@06b6;else if(x==2) y=@06b7;else y=@0103;
  $  151.方向盘转角信号                      $    $           $    $  ANS035.BYTE006  $  if(x==0) y=@06ba;else if(x==1) y=@06b9;else y=@0103;
  $  152.有PEPS                              $    $           $    $  ANS035.BYTE007  $  if(x==0) y=@003d;else if(x==1) y=@06bb;else y=@0103;
  $  153.无线功能                            $    $           $    $  ANS036.BYTE004  $  if(x==0) y=@132e;else if(x==1) y=@132d;else y=@0103;
  $  154.轴距                                $    $           $    $  ANS036.BYTE005  $  if(x==0) y=@0bc6;else if(x==1) y=@0bc5;else y=@0103;
  $  155.底盘离地间隙                        $    $           $    $  ANS036.BYTE006  $  if(x==0) y=@06c0;else if(x==1) y=@06c1;else y=@0103;
  $  156.驾驶类型                            $    $           $    $  ANS036.BYTE007  $  if(x==0) y=@09d5;else if(x==1) y=@12cc;else if(x==2) y=@12cd;else if(x==3) y=@05dd;else y=@0103;
  $  157.外置高清360模块                     $    $           $    $  ANS037.BYTE004  $  if(x==0) y=@12ce;else if(x==1) y=@12cf;else y=@0103;
  $  158.超速报警                            $    $           $    $  ANS037.BYTE005  $  if(x==0) y=@13a7;else if(x==1) y=@13a8;else y=@0103;
  $  159.车速限制                            $    $           $    $  ANS037.BYTE006  $  if(x==0) y=@12d0;else if(x==1) y=@128d;else if(x==2) y=@12d1;else y=@0103;
  $  160.前向PDC                             $    $           $    $  ANS037.BYTE007  $  if(x==0) y=@1285;else if(x==1) y=@1286;else y=@0103;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:761 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
