
    车型ID：10f8

    模拟：协议模拟-->10f8

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:700 02 10 01 00 00 00 00 00       $~  ANS000:780 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:700 02 3E 80 00 00 00 00 00       $!  ANS000:780 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:700 03 19 02 09 00 00 00 00       $#  ANS000:780 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/f5000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:700 04 14 FF FF FF 00 00 00       $$  ANS000:780 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:700 03 22 F1 A1 00 00 00 00       $%  ANS000:780 03 22 F1 A1 00 00 00 00
  $%  REQ001:700 03 22 F1 83 00 00 00 00       $%  ANS001:780 03 22 F1 83 00 00 00 00
  $%  REQ002:700 03 22 F1 91 00 00 00 00       $%  ANS002:780 03 22 F1 91 00 00 00 00
  $%  REQ003:700 03 22 F1 8B 00 00 00 00       $%  ANS003:780 03 22 F1 8B 00 00 00 00
  $%  REQ004:700 03 22 F1 A2 00 00 00 00       $%  ANS004:780 03 22 F1 A2 00 00 00 00
  $%  REQ005:700 03 22 F1 87 00 00 00 00       $%  ANS005:780 03 22 F1 87 00 00 00 00
  $%  REQ006:700 03 22 F1 10 00 00 00 00       $%  ANS006:780 03 22 F1 10 00 00 00 00
  $%  REQ007:700 03 22 F1 A0 00 00 00 00       $%  ANS007:780 03 22 F1 A0 00 00 00 00
  $%  REQ008:700 03 22 F1 92 00 00 00 00       $%  ANS008:780 03 22 F1 92 00 00 00 00
  $%  REQ009:700 03 22 F1 8C 00 00 00 00       $%  ANS009:780 03 22 F1 8C 00 00 00 00
  $%  REQ010:700 03 22 F1 94 00 00 00 00       $%  ANS010:780 03 22 F1 94 00 00 00 00
  $%  REQ011:700 03 22 F1 8A 00 00 00 00       $%  ANS011:780 03 22 F1 8A 00 00 00 00
  $%  REQ012:700 03 22 F1 90 00 00 00 00       $%  ANS012:780 03 22 F1 90 00 00 00 00
  $%  REQ013:700 03 22 F1 A8 00 00 00 00       $%  ANS013:780 03 22 F1 A8 00 00 00 00

  $%  000:电控单元标定软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  002:电控单元硬件号:                  $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元制造日期:                $%    $%  ANS003.BYTE004  $%  HEX(X1,X2,X3);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号（上次）:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号（上次）:          $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数（上次）:                $%    $%  ANS006.BYTE015  $%  HEX(X1,X2,X3);
  $%  009:电控单元应用软件号:              $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  010:供应商电控单元硬件参考号:        $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  011:供应商电控单元序列号:            $%    $%  ANS009.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  012:供应商电控单元产线号:            $%    $%  ANS009.BYTE009  $%  ASCII(X1,X2);
  $%  013:年/月/日:                        $%    $%  ANS009.BYTE011  $%  HEX(X1,X2,X3);
  $%  014:电控单元内部软件编号:            $%    $%  ANS010.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  015:系统供应商识别号:                $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  016:VIN:                             $%    $%  ANS012.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  017:车辆特征信息:                    $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:700 03 22 B1 01 00 00 00 00       $  ANS000:780 03 22 B1 01 00 00 00 00
  $  REQ001:700 03 22 B1 02 00 00 00 00       $  ANS001:780 03 22 B1 02 00 00 00 00
  $  REQ002:700 03 22 D4 03 00 00 00 00       $  ANS002:780 03 22 D4 03 00 00 00 00
  $  REQ003:700 03 22 E1 03 00 00 00 00       $  ANS003:780 03 22 E1 03 00 00 00 00
  $  REQ004:700 03 22 B1 04 00 00 00 00       $  ANS004:780 03 22 B1 04 00 00 00 00
  $  REQ005:700 03 22 E1 05 00 00 00 00       $  ANS005:780 03 22 E1 05 00 00 00 00
  $  REQ006:700 03 22 B1 07 00 00 00 00       $  ANS006:780 03 22 B1 07 00 00 00 00
  $  REQ007:700 03 22 E1 04 00 00 00 00       $  ANS007:780 03 22 E1 04 00 00 00 00
  $  REQ008:700 03 22 C1 12 00 00 00 00       $  ANS008:780 03 22 C1 12 00 00 00 00
  $  REQ009:700 03 22 C1 11 00 00 00 00       $  ANS009:780 03 22 C1 11 00 00 00 00
  $  REQ010:700 03 22 D1 1B 00 00 00 00       $  ANS010:780 03 22 D1 1B 00 00 00 00
  $  REQ011:700 03 22 D1 1C 00 00 00 00       $  ANS011:780 03 22 D1 1C 00 00 00 00
  $  REQ012:700 03 22 D1 1D 00 00 00 00       $  ANS012:780 03 22 D1 1D 00 00 00 00
  $  REQ013:700 03 22 D1 1E 00 00 00 00       $  ANS013:780 03 22 D1 1E 00 00 00 00
  $  REQ014:700 03 22 B1 10 00 00 00 00       $  ANS014:780 03 22 B1 10 00 00 00 00
  $  REQ015:700 03 22 B1 13 00 00 00 00       $  ANS015:780 03 22 B1 13 00 00 00 00
  $  REQ016:700 03 22 C1 13 00 00 00 00       $  ANS016:780 03 22 C1 13 00 00 00 00
  $  REQ017:700 03 22 B1 08 00 00 00 00       $  ANS017:780 03 22 B1 08 00 00 00 00
  $  REQ018:700 03 22 B1 12 00 00 00 00       $  ANS018:780 03 22 B1 12 00 00 00 00
  $  REQ019:700 03 22 B1 11 00 00 00 00       $  ANS019:780 03 22 B1 11 00 00 00 00
  $  REQ020:700 03 22 C1 14 00 00 00 00       $  ANS020:780 03 22 C1 14 00 00 00 00
  $  REQ021:700 03 22 D4 01 00 00 00 00       $  ANS021:780 03 22 D4 01 00 00 00 00
  $  REQ022:700 03 22 B1 09 00 00 00 00       $  ANS022:780 03 22 B1 09 00 00 00 00
  $  REQ023:700 03 22 E1 02 00 00 00 00       $  ANS023:780 03 22 E1 02 00 00 00 00
  $  REQ024:700 03 22 B1 06 00 00 00 00       $  ANS024:780 03 22 B1 06 00 00 00 00

  $  000.实际的里程数                           $    $  km          $    $  ANS000.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  001.电池电压                               $    $  V           $    $  ANS001.BYTE004  $  y=x*0.1;
  $  002.位置灯未关提醒                         $    $              $    $  ANS002.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0004;
  $  003.钥匙进入警告                           $    $              $    $  ANS002.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0004;
  $  004.超速报警                               $    $              $    $  ANS002.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  005.手刹未释放提醒                         $    $              $    $  ANS002.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0004;
  $  006.DCT(双离合变速器)报警                  $    $              $    $  ANS002.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0004;
  $  007.门未关提示音                           $    $              $    $  ANS002.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0004;
  $  008.安全带未系报警                         $    $              $    $  ANS002.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  009.PDC(倒车雷达)                          $    $              $    $  ANS002.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  010.危险警告报警（双闪）                   $    $              $    $  ANS002.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  011.弹出报警提示音                         $    $              $    $  ANS002.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  012.发动机冷却液温度                       $    $              $    $  ANS003.BYTE004  $  y=x-40;
  $  013.发动机冷却液温度                       $    $              $    $  ANS004.BYTE004  $  y=x-40;
  $  014.发动机转速                             $    $  rpm         $    $  ANS005.BYTE004  $  y=(x1*256+x2);
  $  015.发动机转速                             $    $  rpm         $    $  ANS006.BYTE004  $  y=(x1*256+x2);
  $  016.燃油箱                                 $    $  L           $    $  ANS007.BYTE004  $  y=(x1*256+x2)*0.01;
  $  017.瞬时油耗范围L/h                        $    $  L/h         $    $  ANS008.BYTE004  $  y=(((x1*256+x2)&0xFFC0)>>6)*0.1;
  $  018.瞬时油耗范围L/100km                    $    $  L/h         $    $  ANS008.BYTE005  $  y=(((x1*256+x2)&0x3FF0)>>4)*0.1;
  $  019.当前油耗怠速计算参数                   $    $              $    $  ANS008.BYTE006  $  if(((x&0x08)>>3)==0) y=@1001;else if(((x&0x08)>>3)==1) y=@1002;else y=@0004;
  $  020.续航里程显示方向                       $    $              $    $  ANS008.BYTE006  $  if(((x&0x04)>>2)==0) y=@1003;else if(((x&0x04)>>2)==1) y=@1004;else y=@0004;
  $  021.平均油耗初始值L/100km                  $    $  L/100km     $    $  ANS008.BYTE007  $  y=x*0.1;
  $  022.平均油耗范围L/100km                    $    $  L/100km     $    $  ANS008.BYTE008  $  y=(((x1*256+x2)&0xFFC0)>>6)*0.1;
  $  023.剩余燃油计算阈值                       $    $  L           $    $  ANS008.BYTE009  $  y=(x&0x3F);
  $  024.计算当前油耗的最近公里值               $    $  km          $    $  ANS008.BYTE010  $  y=x;
  $  025.ESP模块                                $    $              $    $  ANS009.BYTE004  $  if(((x&0x80)>>7)==0) y=@0112;else if(((x&0x80)>>7)==1) y=@0445;else y=@0004;
  $  026.PEPS模块                               $    $              $    $  ANS009.BYTE004  $  if(((x&0x40)>>6)==0) y=@0112;else if(((x&0x40)>>6)==1) y=@0445;else y=@0004;
  $  027.发动机类型                             $    $              $    $  ANS009.BYTE004  $  if(((x&0x38)>>3)==0x00) y=@0f80;else if(((x&0x38)>>3)==0x01) y=@0f7f;else if(((x&0x38)>>3)==0x02) y=@0f81;else y=@012b;
  $  028.TPMS模块                               $    $              $    $  ANS009.BYTE004  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0004;
  $  029.EPB模块                                $    $              $    $  ANS009.BYTE004  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0004;
  $  030.变速箱类型                             $    $              $    $  ANS009.BYTE004  $  if((x&0x01)==0) y=@0594;else if((x&0x01)==1) y=@00e3;else y=@0004;
  $  031.后雾灯模块                             $    $              $    $  ANS009.BYTE005  $  if(((x&0x80)>>7)==0) y=@0112;else if(((x&0x80)>>7)==1) y=@0445;else y=@0004;
  $  032.前雾灯模块                             $    $              $    $  ANS009.BYTE005  $  if(((x&0x40)>>6)==0) y=@0112;else if(((x&0x40)>>6)==1) y=@0445;else y=@0004;
  $  033.多媒体模块                             $    $              $    $  ANS009.BYTE005  $  if(((x&0x30)>>4)==0) y=@0feb;else if(((x&0x30)>>4)==1) y=@10c8;else if(((x&0x30)>>4)==2) y=@0fb0;else if(((x&0x30)>>4)==3) y=@0fee;else y=@012b;
  $  034.电压显示模块（保留）                   $    $              $    $  ANS009.BYTE005  $  if(((x&0x08)>>3)==0) y=@0112;else if(((x&0x08)>>3)==1) y=@0445;else y=@0004;
  $  035.巡航模块                               $    $              $    $  ANS009.BYTE005  $  if(((x&0x06)>>1)==0) y=@0fef;else if(((x&0x06)>>1)==1) y=@05ef;else if(((x&0x06)>>1)==2) y=@0ff0;else if(((x&0x06)>>1)==3) y=@0004;else y=@0004;
  $  036.司机位置模块                           $    $              $    $  ANS009.BYTE005  $  if((x&0x01)==0) y=@0510;else if((x&0x01)==1) y=@050f;else y=@0004;
  $  037.油箱模块                               $    $              $    $  ANS009.BYTE006  $  if(((x&0x80)>>7)==0) y=@1063;else if(((x&0x80)>>7)==1) y=@1064;else y=@0004;
  $  038.时钟模块                               $    $              $    $  ANS009.BYTE006  $  if(((x&0x60)>>5)==0) y=@0ff1;else if(((x&0x60)>>5)==1) y=@0ff2;else if(((x&0x60)>>5)==2) y=@0ff3;else if(((x&0x60)>>5)==3) y=@0004;else y=@0004;
  $  039.超速模块                               $    $              $    $  ANS009.BYTE006  $  if(((x&0x18)>>3)==0) y=@0ff4;else if(((x&0x18)>>3)==1) y=@0ff5;else if(((x&0x18)>>3)==2) y=@0ff6;else if(((x&0x18)>>3)==3) y=@0ff7;else y=@0004;
  $  040.IMMO模块                               $    $              $    $  ANS009.BYTE006  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0004;
  $  041.Boot开机动画                           $    $              $    $  ANS009.BYTE006  $  if((x&0x03)==0) y=@10c6;else if((x&0x03)==1) y=@0ff9;else if((x&0x03)==2) y=@0ffa;else if((x&0x03)==3) y=@0ffb;else y=@0004;
  $  042.语言设置                               $    $              $    $  ANS009.BYTE007  $  if(((x&0xF8)>>3)==0x00) y=@074a;else if(((x&0xF8)>>3)==0x01) y=@10c1;else if(((x&0xF8)>>3)==0x02) y=@1065;else if(((x&0xF8)>>3)==0x03) y=@08b5;else if(((x&0xF8)>>3)==0x04) y=@08b6;else if(((x&0xF8)>>3)==0x05) y=@08b7;else if(((x&0xF8)>>3)==0x06) y=@08b8;else if(((x&0xF8)>>3)==0x07) y=@08b9;else if(((x&0xF8)>>3)==0x08) y=@08ba;else if(((x&0xF8)>>3)==0x09) y=@08bb;else if(((x&0xF8)>>3)==0x0A) y=@08bc;else if(((x&0xF8)>>3)==0x0B) y=@08bd;else if(((x&0xF8)>>3)==0x0C) y=@08be;else if(((x&0xF8)>>3)==0x0D) y=@08bf;else if(((x&0xF8)>>3)==0x0E) y=@08c0;else if(((x&0xF8)>>3)==0x0F) y=@08c1;else if(((x&0xF8)>>3)==0x10) y=@08c8;else if(((x&0xF8)>>3)==0x11) y=@08c9;else if(((x&0xF8)>>3)==0x12) y=@08ca;else y=@0004;
  $  043.语言菜单                               $    $              $    $  ANS009.BYTE007  $  if(((x&0x04)>>2)==0) y=@101c;else if(((x&0x04)>>2)==1) y=@1000;else y=@0004;
  $  044.保养配置                               $    $              $    $  ANS009.BYTE007  $  if(((x&0x02)>>1)==0) y=@1010;else if(((x&0x02)>>1)==1) y=@1011;else y=@0004;
  $  045.自动车灯模块                           $    $              $    $  ANS009.BYTE007  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0004;
  $  046.里程单位                               $    $              $    $  ANS009.BYTE008  $  if(((x&0x80)>>7)==0) y=@1012;else if(((x&0x80)>>7)==1) y=@0ad3;else y=@0004;
  $  047.GPF(汽油车颗粒捕集器)配置              $    $              $    $  ANS009.BYTE008  $  if(((x&0x40)>>6)==0) y=@0112;else if(((x&0x40)>>6)==1) y=@0445;else y=@0004;
  $  048.启动后信息显示（保留）                 $    $              $    $  ANS009.BYTE008  $  if(((x&0x20)>>5)==0) y=@101c;else if(((x&0x20)>>5)==1) y=@1000;else y=@0004;
  $  049.重启后信息显示                         $    $              $    $  ANS009.BYTE008  $  if(((x&0x10)>>4)==0) y=@101c;else if(((x&0x10)>>4)==1) y=@1000;else y=@0004;
  $  050.超速报警开关                           $    $              $    $  ANS009.BYTE008  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0004;
  $  051.时钟格式                               $    $              $    $  ANS009.BYTE008  $  if(((x&0x04)>>2)==0) y=@05ed;else if(((x&0x04)>>2)==1) y=@05ec;else y=@0004;
  $  052.疲劳驾驶模式                           $    $              $    $  ANS009.BYTE008  $  if(((x&0x02)>>1)==0) y=@0112;else if(((x&0x02)>>1)==1) y=@0445;else y=@0004;
  $  053.空气囊                                 $    $              $    $  ANS009.BYTE008  $  if((x&0x01)==0) y=@0112;else if((x&0x01)==1) y=@0445;else y=@0004;
  $  054.超速设定                               $    $  km/h        $    $  ANS009.BYTE009  $  y=x;
  $  055.变道辅助                               $    $              $    $  ANS009.BYTE010  $  if(((x&0x04)>>2)==0) y=@0112;else if(((x&0x04)>>2)==1) y=@0445;else y=@0004;
  $  056.雷达类型                               $    $              $    $  ANS009.BYTE010  $  if((x&0x03)==0) y=@097f;else if((x&0x03)==1) y=@1013;else if((x&0x03)==2) y=@1014;else if((x&0x03)==3) y=@0004;else y=@0004;
  $  057.巡航速度显示                           $    $              $    $  ANS009.BYTE011  $  if(((x&0x80)>>7)==0) y=@1015;else if(((x&0x80)>>7)==1) y=@1016;else y=@0004;
  $  058.电动尾门                               $    $              $    $  ANS009.BYTE011  $  if(((x&0x40)>>6)==0) y=@1017;else if(((x&0x40)>>6)==1) y=@1018;else y=@0004;
  $  059.安全带模块                             $    $              $    $  ANS009.BYTE011  $  if((x&0x07)==0) y=@1008;else if((x&0x07)==1) y=@1009;else if((x&0x07)==2) y=@100a;else if((x&0x07)==3) y=@100b;else if((x&0x07)==4) y=@100c;else if((x&0x07)==5) y=@100d;else if((x&0x07)==6) y=@0004;else if((x&0x07)==7) y=@0004;else y=@012b;
  $  060.外部气温模块                           $    $              $    $  ANS009.BYTE012  $  if(((x&0x08)>>3)==0) y=@101c;else if(((x&0x08)>>3)==1) y=@1000;else y=@0004;
  $  061.远光灯状态                             $    $              $    $  ANS010.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0004;
  $  062.后雾灯状态                             $    $              $    $  ANS010.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  063.前雾灯状态                             $    $              $    $  ANS010.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0004;
  $  064.ABS 故障                               $    $              $    $  ANS010.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0004;
  $  065.位置灯状态                             $    $              $    $  ANS010.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0004;
  $  066.右转向灯状态                           $    $              $    $  ANS010.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  067.左转向灯状态                           $    $              $    $  ANS010.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  068.发动机故障                             $    $              $    $  ANS010.BYTE005  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0004;
  $  069.机油压力低指示灯                       $    $              $    $  ANS010.BYTE005  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0004;
  $  070.低燃油指示灯状态                       $    $              $    $  ANS010.BYTE005  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0028;else if(((x&0x30)>>4)==2) y=@0fe4;else if(((x&0x30)>>4)==3) y=@0004;else y=@0004;
  $  071.发动机冷却液灯状态                     $    $              $    $  ANS010.BYTE005  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0004;
  $  072.发动机MIL开启                          $    $              $    $  ANS010.BYTE005  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0004;
  $  073.EBD(电子制动力分配) 故障               $    $              $    $  ANS010.BYTE005  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  074.ESP(电子稳定系统) 关闭指示灯状态       $    $              $    $  ANS010.BYTE005  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  075.胎压灯状态                             $    $              $    $  ANS011.BYTE004  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@0fe4;else if(((x&0xC0)>>6)==2) y=@0028;else if(((x&0xC0)>>6)==3) y=@0004;else y=@0004;
  $  076.巡航指示灯状态                         $    $              $    $  ANS011.BYTE004  $  if(((x&0x30)>>4)==0) y=@074d;else if(((x&0x30)>>4)==1) y=@074e;else if(((x&0x30)>>4)==2) y=@101f;else if(((x&0x30)>>4)==3) y=@0004;else y=@0004;
  $  077.ECO(经济模式) 指示灯                   $    $              $    $  ANS011.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0004;
  $  078.制动系统故障或驻车制动灯状态           $    $              $    $  ANS011.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@0028;else y=@0004;
  $  079.充放电指示灯状态                       $    $              $    $  ANS011.BYTE004  $  if((x&0x01)==0) y=@000f;else if((x&0x01)==1) y=@0028;else y=@0004;
  $  080.EPB(电子手刹) 工作指示灯               $    $              $    $  ANS011.BYTE005  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@0028;else if(((x&0xC0)>>6)==2) y=@0fe4;else if(((x&0xC0)>>6)==3) y=@0004;else y=@0004;
  $  081.驾驶员安全带                           $    $              $    $  ANS011.BYTE005  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0028;else if(((x&0x30)>>4)==2) y=@0fe4;else y=@0103;
  $  082.EPS(电动助力转向) 指示灯               $    $              $    $  ANS011.BYTE005  $  if(((x&0x0C)>>2)==0) y=@000f;else if(((x&0x0C)>>2)==1) y=@0fe5;else if(((x&0x0C)>>2)==2) y=@0fdd;else if(((x&0x0C)>>2)==3) y=@0004;else y=@0004;
  $  083.发动机防盗指示灯                       $    $              $    $  ANS011.BYTE005  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@0fe6;else if((x&0x03)==2) y=@0fe7;else if((x&0x03)==3) y=@0028;else y=@0004;
  $  084.ESP(电子稳定系统) 指示灯               $    $              $    $  ANS012.BYTE004  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@0028;else if(((x&0xC0)>>6)==2) y=@0fe4;else if(((x&0xC0)>>6)==3) y=@0004;else y=@0004;
  $  085.GPF(汽油车颗粒捕集器) 指示灯           $    $              $    $  ANS012.BYTE004  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0fe5;else if(((x&0x30)>>4)==2) y=@0fe8;else if(((x&0x30)>>4)==3) y=@0fdd;else y=@0004;
  $  086.电子手刹指示灯                         $    $              $    $  ANS012.BYTE004  $  if(((x&0x0C)>>2)==0) y=@000f;else if(((x&0x0C)>>2)==1) y=@0fe5;else if(((x&0x0C)>>2)==2) y=@0fe9;else if(((x&0x0C)>>2)==3) y=@0fea;else y=@0004;
  $  087.EPB(电子手刹) 故障指示灯               $    $              $    $  ANS012.BYTE004  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@0028;else if((x&0x03)==2) y=@0fe4;else if((x&0x03)==3) y=@0004;else y=@0004;
  $  088.安全气囊故障                           $    $              $    $  ANS013.BYTE004  $  if(((x&0x0C)>>2)==0) y=@000f;else if(((x&0x0C)>>2)==1) y=@0fdd;else if(((x&0x0C)>>2)==2) y=@0fde;else if(((x&0x0C)>>2)==3) y=@0004;else y=@0004;
  $  089.左前胎压力                             $    $  kPa         $    $  ANS014.BYTE004  $  y=(x1*256+x2)*2.75;
  $  090.左后胎压力                             $    $  kPa         $    $  ANS015.BYTE004  $  y=(x1*256+x2)*2.75;
  $  091.保养间隔里程                           $    $  km          $    $  ANS016.BYTE004  $  y=(x1*256+x2);
  $  092.超速来自CAN信号                        $    $  km/h        $    $  ANS017.BYTE004  $  y=x;
  $  093.右后压力                               $    $  kPa         $    $  ANS018.BYTE004  $  y=(x1*256+x2)*2.75;
  $  094.右前压力                               $    $  kPa         $    $  ANS019.BYTE004  $  y=(x1*256+x2)*2.75;
  $  095.上一次保养行驶里程                     $    $  km          $    $  ANS020.BYTE004  $  y=(x1*256*256+x2*256+x3);
  $  096.档位                                   $    $              $    $  ANS021.BYTE004  $  if(((x&0x1E)>>1)==0x00) y=@0fe2;else if(((x&0x1E)>>1)==0x01) y=@04d3;else if(((x&0x1E)>>1)==0x02) y=@0169;else if(((x&0x1E)>>1)==0x03) y=@016a;else if(((x&0x1E)>>1)==0x04) y=@016b;else if(((x&0x1E)>>1)==0x05) y=@054a;else if(((x&0x1E)>>1)==0x06) y=@054b;else if(((x&0x1E)>>1)==0x07) y=@054c;else if(((x&0x1E)>>1)==0x08) y=@0187;else if(((x&0x1E)>>1)==0x09) y=@0263;else if(((x&0x1E)>>1)==0x0A) y=@0262;else if(((x&0x1E)>>1)==0x0B) y=@0261;else if(((x&0x1E)>>1)==0x0C) y=@0fcf;else if(((x&0x1E)>>1)==0x0F) y=@0fff;else y=@012b;
  $  097.变速器类型                             $    $              $    $  ANS021.BYTE004  $  if((x&0x01)==0) y=@0fe3;else if((x&0x01)==1) y=@00e3;else y=@0004;
  $  098.车辆当前燃油消耗量                     $    $  mL          $    $  ANS022.BYTE004  $  y=(x1*256+x2)*0.016;
  $  099.车辆速度                               $    $  km/h        $    $  ANS023.BYTE004  $  y=x;
  $  100.车辆速度                               $    $  km/h        $    $  ANS024.BYTE004  $  y=x;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:700 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
