
    车型ID：1111

    模拟：协议模拟-->1111

;******************************************************************************************************************************************************

    通讯线: $~03$~11$~500k

进入命令:

  $~  REQ000:742 02 10 01 00 00 00 00 00       $~  ANS000:7C2 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:742 02 3E 80 00 00 00 00 00       $!  ANS000:7C2 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:742 03 19 02 09 00 00 00 00       $#  ANS000:7C2 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/0f000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:742 04 14 FF FF FF 00 00 00       $$  ANS000:7C2 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:742 03 22 F1 86 00 00 00 00       $%  ANS000:7C2 03 22 F1 86 00 00 00 00
  $%  REQ001:742 03 22 F1 A0 00 00 00 00       $%  ANS001:7C2 03 22 F1 A0 00 00 00 00
  $%  REQ002:742 03 22 F1 83 00 00 00 00       $%  ANS002:7C2 03 22 F1 83 00 00 00 00
  $%  REQ003:742 03 22 F1 91 00 00 00 00       $%  ANS003:7C2 03 22 F1 91 00 00 00 00
  $%  REQ004:742 03 22 F1 8B 00 00 00 00       $%  ANS004:7C2 03 22 F1 8B 00 00 00 00
  $%  REQ005:742 03 22 F1 A2 00 00 00 00       $%  ANS005:7C2 03 22 F1 A2 00 00 00 00
  $%  REQ006:742 03 22 F1 87 00 00 00 00       $%  ANS006:7C2 03 22 F1 87 00 00 00 00
  $%  REQ007:742 03 22 F1 A1 00 00 00 00       $%  ANS007:7C2 03 22 F1 A1 00 00 00 00
  $%  REQ008:742 03 22 F1 10 00 00 00 00       $%  ANS008:7C2 03 22 F1 10 00 00 00 00
  $%  REQ009:742 03 22 F1 92 00 00 00 00       $%  ANS009:7C2 03 22 F1 92 00 00 00 00
  $%  REQ010:742 03 22 F1 8C 00 00 00 00       $%  ANS010:7C2 03 22 F1 8C 00 00 00 00
  $%  REQ011:742 03 22 F1 94 00 00 00 00       $%  ANS011:7C2 03 22 F1 94 00 00 00 00
  $%  REQ012:742 03 22 F1 8A 00 00 00 00       $%  ANS012:7C2 03 22 F1 8A 00 00 00 00
  $%  REQ013:742 03 22 F1 90 00 00 00 00       $%  ANS013:7C2 03 22 F1 90 00 00 00 00
  $%  REQ014:742 03 22 F1 A8 00 00 00 00       $%  ANS014:7C2 03 22 F1 A8 00 00 00 00

  $%  000:当前诊断模式:                    $%    $%  ANS000.BYTE004  $%  HEX(X1);
  $%  001:电控单元应用软件号:              $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  002:电控单元刷写软件参考号:          $%    $%  ANS002.BYTE011  $%  ASCII(X1,X2,X3);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元制造日期:                $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3);
  $%  005:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元标定软件号:              $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号（上次）:          $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号（上次）:          $%    $%  ANS008.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数（上次）:                $%    $%  ANS008.BYTE015  $%  HEX(X1,X2,X3);
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:供应商电控单元序列号:            $%    $%  ANS010.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  013:供应商电控单元产线号:            $%    $%  ANS010.BYTE009  $%  ASCII(X1,X2);
  $%  014:年/月/日:                        $%    $%  ANS010.BYTE011  $%  HEX(X1,X2,X3);
  $%  015:供应商电控单元软件参考号:        $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  016:系统供应商识别号:                $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  017:VIN:                             $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  018:车辆特征信息:                    $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:742 03 22 C0 02 00 00 00 00       $  ANS000:7C2 03 22 C0 02 00 00 00 00
  $  REQ001:742 03 22 B0 03 00 00 00 00       $  ANS001:7C2 03 22 B0 03 00 00 00 00
  $  REQ002:742 03 22 B0 02 00 00 00 00       $  ANS002:7C2 03 22 B0 02 00 00 00 00
  $  REQ003:742 03 22 B0 01 00 00 00 00       $  ANS003:7C2 03 22 B0 01 00 00 00 00
  $  REQ004:742 03 22 C0 01 00 00 00 00       $  ANS004:7C2 03 22 C0 01 00 00 00 00
  $  REQ005:742 03 22 B0 04 00 00 00 00       $  ANS005:7C2 03 22 B0 04 00 00 00 00
  $  REQ006:742 03 22 D0 02 00 00 00 00       $  ANS006:7C2 03 22 D0 02 00 00 00 00
  $  REQ007:742 03 22 C0 03 00 00 00 00       $  ANS007:7C2 03 22 C0 03 00 00 00 00
  $  REQ008:742 03 22 B0 05 00 00 00 00       $  ANS008:7C2 03 22 B0 05 00 00 00 00

  $  000.第二排右乘客扣开关输入BS2R                           $    $           $    $  ANS000.BYTE004  $  if(((x&0x40)>>6)==0) y=@00c9;else if(((x&0x40)>>6)==1) y=@00ca;else y=@0004;
  $  001.第二排中间乘客扣开关输入BS2M                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@00ca;else y=@0004;
  $  002.第二排左乘客扣开关输入BS2L                           $    $           $    $  ANS000.BYTE004  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0004;
  $  003.乘客扣开关输入BSP                                    $    $           $    $  ANS000.BYTE004  $  if(((x&0x08)>>3)==0) y=@00c9;else if(((x&0x08)>>3)==1) y=@00ca;else y=@0004;
  $  004.驾驶员扣开关                                         $    $           $    $  ANS000.BYTE004  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  005.乘客气囊禁用开关(PADS)                               $    $           $    $  ANS000.BYTE004  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  006.第三排右乘客扣开关输入                               $    $           $    $  ANS000.BYTE005  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@00ca;else y=@0004;
  $  007.第三排左乘客扣开关输入                               $    $           $    $  ANS000.BYTE005  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0004;
  $  008.硬件碰撞输出                                         $    $           $    $  ANS000.BYTE006  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  009.SBR策略                                              $    $           $    $  ANS000.BYTE007  $  if(((x&0x80)>>7)==0) y=@0113;else if(((x&0x80)>>7)==1) y=@0114;else y=@0004;
  $  010.网络碰撞信号                                         $    $           $    $  ANS000.BYTE007  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  011.安全气囊控制单元在单次点火循环内的使用时间           $    $  s        $    $  ANS001.BYTE004  $  y=(x1*256+x2);
  $  012.安全气囊控制单元使用时间                             $    $  s        $    $  ANS002.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  013.ACU 操作状态                                         $    $           $    $  ANS003.BYTE004  $  if(x==0) y=@0115;else if(x==1) y=@0116;else y=@0004;
  $  014.副驾驶乘员探测传感器状态(预留)                       $    $           $    $  ANS003.BYTE005  $  if(((x&0xF0)>>4)==0) y=@0117;else if(((x&0xF0)>>4)==1) y=@0118;else if(((x&0xF0)>>4)==2) y=@0119;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0004;
  $  015.副驾驶气囊禁用开关状态                               $    $           $    $  ANS003.BYTE005  $  if((x&0x0F)==0) y=@011a;else if((x&0x0F)==2) y=@011b;else if((x&0x0F)==4) y=@0119;else if((x&0x0F)==7) y=@0112;else y=@0004;
  $  016.前排副驾驶安全带插锁(占位传感器)状态                 $    $           $    $  ANS003.BYTE006  $  if(((x&0xF0)>>4)==0) y=@0108;else if(((x&0xF0)>>4)==1) y=@0109;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0004;
  $  017.前排驾驶员安全带插锁状态                             $    $           $    $  ANS003.BYTE006  $  if((x&0x0F)==0) y=@010b;else if((x&0x0F)==1) y=@010c;else if((x&0x0F)==3) y=@010a;else y=@0004;
  $  018.ACU(安全气囊控制器) 激活状态                         $    $           $    $  ANS003.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00b2;else y=@0004;
  $  019.VIN码锁定状态                                        $    $           $    $  ANS003.BYTE007  $  if(((x&0x08)>>3)==0) y=@010d;else if(((x&0x08)>>3)==1) y=@010e;else y=@0004;
  $  020.碰撞发生与否                                         $    $           $    $  ANS003.BYTE007  $  if(((x&0x04)>>2)==0) y=@010f;else if(((x&0x04)>>2)==1) y=@0110;else y=@0004;
  $  021.气囊警告灯状态                                       $    $           $    $  ANS003.BYTE007  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@0028;else if((x&0x03)==2) y=@0111;else y=@0004;
  $  022.副驾驶安全带提醒输出状态                             $    $           $    $  ANS003.BYTE008  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@0028;else if(((x&0xC0)>>6)==2) y=@0111;else if(((x&0xC0)>>6)==3) y=@0112;else y=@0004;
  $  023.驾驶员安全带提醒输出状态                             $    $           $    $  ANS003.BYTE008  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0028;else if(((x&0x30)>>4)==2) y=@0111;else if(((x&0x30)>>4)==3) y=@0112;else y=@0004;
  $  024.副驾驶气囊 OFF 指示灯状态                            $    $           $    $  ANS003.BYTE008  $  if(((x&0x0C)>>2)==0) y=@000f;else if(((x&0x0C)>>2)==1) y=@0028;else if(((x&0x0C)>>2)==2) y=@0119;else if(((x&0x0C)>>2)==3) y=@011c;else y=@0004;
  $  025.副驾驶气囊 ON 指示灯状态                             $    $           $    $  ANS003.BYTE008  $  if((x&0x03)==0) y=@000f;else if((x&0x03)==1) y=@0028;else if((x&0x03)==2) y=@0119;else if((x&0x03)==3) y=@011c;else y=@0004;
  $  026.第二排左侧乘员探测传感器状态(预留)                   $    $           $    $  ANS003.BYTE009  $  if(((x&0xF0)>>4)==0) y=@0117;else if(((x&0xF0)>>4)==1) y=@0118;else if(((x&0xF0)>>4)==2) y=@0119;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0004;
  $  027.第二排中间乘 员探测传感器状态(预留)                  $    $           $    $  ANS003.BYTE009  $  if((x&0x0F)==0) y=@0117;else if((x&0x0F)==1) y=@0118;else if((x&0x0F)==2) y=@0119;else if((x&0x0F)==3) y=@010a;else y=@0004;
  $  028.第二排右侧乘员探测传感器状态(预留)                   $    $           $    $  ANS003.BYTE010  $  if(((x&0xF0)>>4)==0) y=@0117;else if(((x&0xF0)>>4)==1) y=@0118;else if(((x&0xF0)>>4)==2) y=@0119;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0004;
  $  029.第三排左侧乘员安全带插锁(+乘员占位传感器)状 态       $    $           $    $  ANS003.BYTE010  $  if((x&0x0F)==0) y=@0108;else if((x&0x0F)==1) y=@0109;else if((x&0x0F)==2) y=@0004;else if((x&0x0F)==3) y=@010a;else y=@0004;
  $  030.第二排左侧乘员安全带插锁(+乘员占位传感器)状态        $    $           $    $  ANS003.BYTE011  $  if(((x&0xF0)>>4)==0) y=@0108;else if(((x&0xF0)>>4)==1) y=@0109;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0004;
  $  031.第二排中间乘员安全带插锁(+乘员占位传感器)状态        $    $           $    $  ANS003.BYTE011  $  if((x&0x0F)==0) y=@0108;else if((x&0x0F)==1) y=@0109;else if((x&0x0F)==3) y=@010a;else y=@0004;
  $  032.第二排右侧乘员安全带插锁(+乘员占位传感器)状态        $    $           $    $  ANS003.BYTE012  $  if(((x&0xF0)>>4)==0) y=@0108;else if(((x&0xF0)>>4)==1) y=@0109;else if(((x&0xF0)>>4)==3) y=@010a;else y=@0004;
  $  033.第三排右侧乘员安全带插锁(+乘员占位传感器)状态        $    $           $    $  ANS003.BYTE012  $  if((x&0x0F)==0) y=@0108;else if((x&0x0F)==1) y=@0109;else if((x&0x0F)==2) y=@0004;else if((x&0x0F)==3) y=@010a;else y=@0004;
  $  034.第二排左侧安全带提醒输出状态                         $    $           $    $  ANS003.BYTE013  $  if(((x&0xC0)>>6)==0) y=@000f;else if(((x&0xC0)>>6)==1) y=@0028;else if(((x&0xC0)>>6)==2) y=@0111;else if(((x&0xC0)>>6)==3) y=@0112;else y=@0004;
  $  035.第二排中间安全带提醒输出状态                         $    $           $    $  ANS003.BYTE013  $  if(((x&0x30)>>4)==0) y=@000f;else if(((x&0x30)>>4)==1) y=@0028;else if(((x&0x30)>>4)==2) y=@0111;else if(((x&0x30)>>4)==3) y=@0112;else y=@0004;
  $  036.第二排右侧安全带提醒输出状态                         $    $           $    $  ANS003.BYTE013  $  if(((x&0x0C)>>2)==0) y=@000f;else if(((x&0x0C)>>2)==1) y=@0028;else if(((x&0x0C)>>2)==2) y=@0111;else if(((x&0x0C)>>2)==3) y=@0112;else y=@0004;
  $  037.乘客安全气囊(PAB)正面爆裂(第1阶段)FAP                $    $           $    $  ANS004.BYTE004  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  038.驾驶员安全气囊(DAB)正面爆裂(第1阶段)FAD              $    $           $    $  ANS004.BYTE005  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  039.第一排右帘安全气囊爆裂                               $    $           $    $  ANS004.BYTE006  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  040.第一排右侧安全气囊爆裂                               $    $           $    $  ANS004.BYTE006  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  041.第一排左帘安全气囊爆裂                               $    $           $    $  ANS004.BYTE007  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  042.第一排左侧安全气囊爆裂                               $    $           $    $  ANS004.BYTE007  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  043.第二排左侧预紧器牵引器BP2L                           $    $           $    $  ANS004.BYTE008  $  if(((x&0x20)>>5)==0) y=@00c9;else if(((x&0x20)>>5)==1) y=@00ca;else y=@0004;
  $  044.第二排右侧预紧器牵引器BP2L                           $    $           $    $  ANS004.BYTE008  $  if(((x&0x10)>>4)==0) y=@00c9;else if(((x&0x10)>>4)==1) y=@00ca;else y=@0004;
  $  045.带式预紧器乘客BLP                                    $    $           $    $  ANS004.BYTE008  $  if(((x&0x08)>>3)==0) y=@00c9;else if(((x&0x08)>>3)==1) y=@00ca;else y=@0004;
  $  046.带式预紧器驾驶员BLD                                  $    $           $    $  ANS004.BYTE008  $  if(((x&0x04)>>2)==0) y=@00c9;else if(((x&0x04)>>2)==1) y=@00ca;else y=@0004;
  $  047.第一排乘客座椅安全带预紧器牵引器BRP                  $    $           $    $  ANS004.BYTE008  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  048.第一排驾驶员座椅安全带预紧器拉钩BRD                  $    $           $    $  ANS004.BYTE008  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  049.FIS                                                  $    $           $    $  ANS004.BYTE009  $  if(((x&0x04)>>2)==0) y=@00c9;else if(((x&0x04)>>2)==1) y=@00ca;else y=@0004;
  $  050.右侧B支柱                                            $    $           $    $  ANS004.BYTE009  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@00ca;else y=@0004;
  $  051.左侧B支柱                                            $    $           $    $  ANS004.BYTE009  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@00ca;else y=@0004;
  $  052.一级驾驶员气囊(DAB)点火回路电阻值                    $    $           $    $  ANS005.BYTE004  $  y=x*0.1;
  $  053.第二排左侧安全带预拉紧点火回路电阻值                 $    $           $    $  ANS005.BYTE005  $  y=x*0.1;
  $  054.一级副驾驶气囊(PAB)点火回路电阻值                    $    $           $    $  ANS005.BYTE006  $  y=x*0.1;
  $  055.第二排右侧安全带预拉紧点火回路电阻值                 $    $           $    $  ANS005.BYTE007  $  y=x*0.1;
  $  056.驾驶员二级预拉紧安全带点火回路电阻值                 $    $           $    $  ANS005.BYTE008  $  y=x*0.1;
  $  057.副驾驶二级预拉紧安全带点火回路电阻值                 $    $           $    $  ANS005.BYTE009  $  y=x*0.1;
  $  058.左侧侧气帘点火回路电阻值                             $    $           $    $  ANS005.BYTE010  $  y=x*0.1;
  $  059.右侧侧气帘点火回路电阻值                             $    $           $    $  ANS005.BYTE011  $  y=x*0.1;
  $  060.驾驶员预拉紧安全带点火回路电阻值                     $    $           $    $  ANS005.BYTE012  $  y=x*0.1;
  $  061.副驶预拉紧安全带点火回路电阻值                       $    $           $    $  ANS005.BYTE013  $  y=x*0.1;
  $  062.右侧侧气囊点火回路电阻值                             $    $           $    $  ANS005.BYTE014  $  y=x*0.1;
  $  063.左侧侧气囊点火回路电阻值                             $    $           $    $  ANS005.BYTE015  $  y=x*0.1;
  $  064.第二排左侧侧气帘点火回路电阻值                       $    $           $    $  ANS005.BYTE016  $  y=x*0.1;
  $  065.第二排右侧侧气帘点火回路电阻值                       $    $           $    $  ANS005.BYTE017  $  y=x*0.1;
  $  066.PAB关闭                                              $    $           $    $  ANS006.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0004;
  $  067.PAB打开                                              $    $           $    $  ANS006.BYTE004  $  if(((x&0x08)>>3)==0) y=@000f;else if(((x&0x08)>>3)==1) y=@0028;else y=@0004;
  $  068.碰撞输出                                             $    $           $    $  ANS006.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@0028;else y=@0004;
  $  069.第一行SBR车辆速度阈值V1                              $    $  km/h     $    $  ANS007.BYTE004  $  y=x;
  $  070.第一行SBR车辆速度阈值V2                              $    $  km/h     $    $  ANS007.BYTE005  $  y=x;
  $  071.前SBR定时器阈值T                                     $    $  s        $    $  ANS007.BYTE006  $  y=x;
  $  072.第二和第三排SBR车辆速度阈值V1                        $    $           $    $  ANS007.BYTE007  $  y=x;
  $  073.第二和第三排SBR车辆速度阈值V2                        $    $           $    $  ANS007.BYTE008  $  y=x;
  $  074.第二和第三SBR定时器阈值T1                            $    $           $    $  ANS007.BYTE009  $  y=x;
  $  075.第二和第三SBR定时器阈值T2                            $    $           $    $  ANS007.BYTE010  $  y=x;
  $  076.车速信号读取(通过 CAN)                               $    $  km/h     $    $  ANS008.BYTE004  $  y=(x1*256+x2)*0.015625;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:742 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
