
    车型ID：1115

    模拟：协议模拟-->1115

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:711 02 10 01 00 00 00 00 00       $~  ANS000:719 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:711 02 3E 80 00 00 00 00 00       $!  ANS000:719 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:711 03 19 02 09 00 00 00 00       $#  ANS000:719 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/13000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:711 04 14 FF FF FF 00 00 00       $$  ANS000:719 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:711 03 22 F1 A0 00 00 00 00       $%  ANS000:719 03 22 F1 A0 00 00 00 00
  $%  REQ001:711 03 22 F1 83 00 00 00 00       $%  ANS001:719 03 22 F1 83 00 00 00 00
  $%  REQ002:711 03 22 F1 A1 00 00 00 00       $%  ANS002:719 03 22 F1 A1 00 00 00 00
  $%  REQ003:711 03 22 F1 91 00 00 00 00       $%  ANS003:719 03 22 F1 91 00 00 00 00
  $%  REQ004:711 03 22 F1 A2 00 00 00 00       $%  ANS004:719 03 22 F1 A2 00 00 00 00
  $%  REQ005:711 03 22 F1 87 00 00 00 00       $%  ANS005:719 03 22 F1 87 00 00 00 00
  $%  REQ006:711 03 22 F1 10 00 00 00 00       $%  ANS006:719 03 22 F1 10 00 00 00 00
  $%  REQ007:711 03 22 F1 92 00 00 00 00       $%  ANS007:719 03 22 F1 92 00 00 00 00
  $%  REQ008:711 03 22 F1 8C 00 00 00 00       $%  ANS008:719 03 22 F1 8C 00 00 00 00
  $%  REQ009:711 03 22 F1 94 00 00 00 00       $%  ANS009:719 03 22 F1 94 00 00 00 00
  $%  REQ010:711 03 22 F1 8A 00 00 00 00       $%  ANS010:719 03 22 F1 8A 00 00 00 00
  $%  REQ011:711 03 22 F1 90 00 00 00 00       $%  ANS011:719 03 22 F1 90 00 00 00 00
  $%  REQ012:711 03 22 F1 A8 00 00 00 00       $%  ANS012:719 03 22 F1 A8 00 00 00 00
  $%  REQ013:711 03 22 F1 8B 00 00 00 00       $%  ANS013:719 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:ECU校准软件编号:                 $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络参考号:              $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号(上次):            $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试参考号（上次）:              $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数（上次）KM:              $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商识别号:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:VIN:                             $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  015:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  y=SPRINTF([20%02X.%02X.%02X],X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:711 03 22 C0 04 00 00 00 00       $  ANS000:719 03 22 C0 04 00 00 00 00
  $  REQ001:711 03 22 C0 06 00 00 00 00       $  ANS001:719 03 22 C0 06 00 00 00 00
  $  REQ002:711 03 22 C0 05 00 00 00 00       $  ANS002:719 03 22 C0 05 00 00 00 00
  $  REQ003:711 03 22 B2 00 00 00 00 00       $  ANS003:719 03 22 B2 00 00 00 00 00
  $  REQ004:711 03 22 B2 50 00 00 00 00       $  ANS004:719 03 22 B2 50 00 00 00 00
  $  REQ005:711 03 22 B0 03 00 00 00 00       $  ANS005:719 03 22 B0 03 00 00 00 00
  $  REQ006:711 03 22 B2 10 00 00 00 00       $  ANS006:719 03 22 B2 10 00 00 00 00
  $  REQ007:711 03 22 CA 01 00 00 00 00       $  ANS007:719 03 22 CA 01 00 00 00 00
  $  REQ008:711 03 22 CA 0A 00 00 00 00       $  ANS008:719 03 22 CA 0A 00 00 00 00
  $  REQ009:711 03 22 CA 02 00 00 00 00       $  ANS009:719 03 22 CA 02 00 00 00 00
  $  REQ010:711 03 22 CA 03 00 00 00 00       $  ANS010:719 03 22 CA 03 00 00 00 00
  $  REQ011:711 03 22 CA 04 00 00 00 00       $  ANS011:719 03 22 CA 04 00 00 00 00
  $  REQ012:711 03 22 CA 05 00 00 00 00       $  ANS012:719 03 22 CA 05 00 00 00 00
  $  REQ013:711 03 22 CA 06 00 00 00 00       $  ANS013:719 03 22 CA 06 00 00 00 00
  $  REQ014:711 03 22 CA 07 00 00 00 00       $  ANS014:719 03 22 CA 07 00 00 00 00
  $  REQ015:711 03 22 CA 08 00 00 00 00       $  ANS015:719 03 22 CA 08 00 00 00 00
  $  REQ016:711 03 22 CA 09 00 00 00 00       $  ANS016:719 03 22 CA 09 00 00 00 00
  $  REQ017:711 03 22 CA 81 00 00 00 00       $  ANS017:719 03 22 CA 81 00 00 00 00
  $  REQ018:711 03 22 CF 01 00 00 00 00       $  ANS018:719 03 22 CF 01 00 00 00 00
  $  REQ019:711 03 22 B1 00 00 00 00 00       $  ANS019:719 03 22 B1 00 00 00 00 00
  $  REQ020:711 03 22 B1 01 00 00 00 00       $  ANS020:719 03 22 B1 01 00 00 00 00
  $  REQ021:711 03 22 B1 02 00 00 00 00       $  ANS021:719 03 22 B1 02 00 00 00 00
  $  REQ022:711 03 22 B0 01 00 00 00 00       $  ANS022:719 03 22 B0 01 00 00 00 00
  $  REQ023:711 03 22 CA 12 00 00 00 00       $  ANS023:719 03 22 CA 12 00 00 00 00
  $  REQ024:711 03 22 B1 82 00 00 00 00       $  ANS024:719 03 22 B1 82 00 00 00 00
  $  REQ025:711 03 22 B1 83 00 00 00 00       $  ANS025:719 03 22 B1 83 00 00 00 00
  $  REQ026:711 03 22 B2 15 00 00 00 00       $  ANS026:719 03 22 B2 15 00 00 00 00
  $  REQ027:711 03 22 CF 10 00 00 00 00       $  ANS027:719 03 22 CF 10 00 00 00 00
  $  REQ028:711 03 22 CA 80 00 00 00 00       $  ANS028:719 03 22 CA 80 00 00 00 00
  $  REQ029:711 03 22 B0 08 00 00 00 00       $  ANS029:719 03 22 B0 08 00 00 00 00
  $  REQ030:711 03 22 B0 00 00 00 00 00       $  ANS030:719 03 22 B0 00 00 00 00 00
  $  REQ031:711 03 22 B1 84 00 00 00 00       $  ANS031:719 03 22 B1 84 00 00 00 00
  $  REQ032:711 03 22 B0 04 00 00 00 00       $  ANS032:719 03 22 B0 04 00 00 00 00
  $  REQ033:711 03 22 B0 06 00 00 00 00       $  ANS033:719 03 22 B0 06 00 00 00 00
  $  REQ034:711 03 22 B0 05 00 00 00 00       $  ANS034:719 03 22 B0 05 00 00 00 00
  $  REQ035:711 03 22 B1 80 00 00 00 00       $  ANS035:719 03 22 B1 80 00 00 00 00
  $  REQ036:711 03 22 B1 81 00 00 00 00       $  ANS036:719 03 22 B1 81 00 00 00 00
  $  REQ037:711 03 22 B1 85 00 00 00 00       $  ANS037:719 03 22 B1 85 00 00 00 00
  $  REQ038:711 03 22 B0 84 00 00 00 00       $  ANS038:719 03 22 B0 84 00 00 00 00
  $  REQ039:711 03 22 B2 90 00 00 00 00       $  ANS039:719 03 22 B2 90 00 00 00 00
  $  REQ040:711 03 22 B0 83 00 00 00 00       $  ANS040:719 03 22 B0 83 00 00 00 00
  $  REQ041:711 03 22 B0 82 00 00 00 00       $  ANS041:719 03 22 B0 82 00 00 00 00
  $  REQ042:711 03 22 B0 07 00 00 00 00       $  ANS042:719 03 22 B0 07 00 00 00 00
  $  REQ043:711 03 22 C1 06 00 00 00 00       $  ANS043:719 03 22 C1 06 00 00 00 00
  $  REQ044:711 03 22 B0 81 00 00 00 00       $  ANS044:719 03 22 B0 81 00 00 00 00
  $  REQ045:711 03 22 C0 01 00 00 00 00       $  ANS045:719 03 22 C0 01 00 00 00 00
  $  REQ046:711 03 22 C0 03 00 00 00 00       $  ANS046:719 03 22 C0 03 00 00 00 00
  $  REQ047:711 03 22 C0 02 00 00 00 00       $  ANS047:719 03 22 C0 02 00 00 00 00
  $  REQ048:711 03 22 C0 07 00 00 00 00       $  ANS048:719 03 22 C0 07 00 00 00 00
  $  REQ049:711 03 22 C0 09 00 00 00 00       $  ANS049:719 03 22 C0 09 00 00 00 00
  $  REQ050:711 03 22 C0 08 00 00 00 00       $  ANS050:719 03 22 C0 08 00 00 00 00
  $  REQ051:711 03 22 CA 22 00 00 00 00       $  ANS051:719 03 22 CA 22 00 00 00 00

  $  000.APN(接入点名称)2名称                $    $          $    $  ANS000.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  001.APN(接入点名称)2密码                $    $          $    $  ANS001.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  002.APN(接入点名称)2用户名              $    $          $    $  ANS002.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  003.APP(应用软件)激活状态               $    $          $    $  ANS003.BYTE004  $  if((x&0x03)==0) y=@0035;else if((x&0x03)==1) y=@03fc;else if((x&0x03)==2) y=@034e;else if((x&0x03)==3) y=@034f;else y=@0035;
  $  004.Ecall已启用                         $    $          $    $  ANS003.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  005.启用BCAL                            $    $          $    $  ANS003.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  006.启用ICALL                           $    $          $    $  ANS003.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  007.启用车辆状态                        $    $          $    $  ANS003.BYTE005  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  008.启用了旅程                          $    $          $    $  ANS003.BYTE005  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  009.在线娱乐功能开关                    $    $          $    $  ANS003.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  010.车辆被盗追踪功能开关                $    $          $    $  ANS003.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  011.启用远程控制                        $    $          $    $  ANS003.BYTE005  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  012.蓝牙键输入已启用                    $    $          $    $  ANS003.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  013.远程故障码检测功能开关              $    $          $    $  ANS003.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  014.数据采集功能开关                    $    $          $    $  ANS003.BYTE006  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  015.预订密钥总数                        $    $          $    $  ANS004.BYTE004  $  y=x;
  $  016.当前钥匙的预订值                    $    $          $    $  ANS004.BYTE005  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  017.当前使用的钥匙开始时间              $    $  s       $    $  ANS004.BYTE009  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  018.当前使用的钥匙结束时间              $    $  s       $    $  ANS004.BYTE013  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  019.蓝牙模块软件版本                    $    $          $    $  ANS005.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  020.最后的关键交换结果                  $    $          $    $  ANS006.BYTE004  $  if(((x&0xFE)>>1)==0x00) y=@033c;else if(((x&0xFE)>>1)==0x01) y=@03ed;else if(((x&0xFE)>>1)==0x02) y=@03ee;else if(((x&0xFE)>>1)==0x03) y=@03ef;else if(((x&0xFE)>>1)==0x04) y=@0340;else if(((x&0xFE)>>1)==0x05) y=@03f0;else if(((x&0xFE)>>1)==0x06) y=@03f1;else if(((x&0xFE)>>1)==0x07) y=@002f;else if(((x&0xFE)>>1)==0x08) y=@040e;else if(((x&0xFE)>>1)==0x09) y=@0344;else if(((x&0xFE)>>1)==0x0A) y=@0345;else if(((x&0xFE)>>1)==0x0B) y=@0346;else if(((x&0xFE)>>1)==0x0C) y=@0347;else if(((x&0xFE)>>1)==0x0D) y=@0348;else if(((x&0xFE)>>1)==0x0E) y=@0438;else y=@0035;
  $  021.完成初始密钥交换                    $    $          $    $  ANS006.BYTE004  $  if((x&0x01)==0) y=@028e;else if((x&0x01)==1) y=@043a;else y=@0035;
  $  022.配置检查状态                        $    $          $    $  ANS006.BYTE005  $  if((x&0x01)==0) y=@0412;else if((x&0x01)==1) y=@03ed;else y=@0035;
  $  023.MCC1移动国家码1                     $    $          $    $  ANS007.BYTE004  $  ASCII(X1,X2,X3);
  $  024.MNC1移动网络码1                     $    $          $    $  ANS007.BYTE007  $  ASCII(X1,X2,X3);
  $  025.默认电话号码                        $    $          $    $  ANS007.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  026.默认公共服务号码1                   $    $          $    $  ANS007.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  027.Call类型                            $    $          $    $  ANS007.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  028.是否云端获取号码1                   $    $          $    $  ANS007.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  029.MCC10                               $    $          $    $  ANS008.BYTE004  $  ASCII(X1,X2,X3);
  $  030.MNC10                               $    $          $    $  ANS008.BYTE007  $  ASCII(X1,X2,X3);
  $  031.默认电话号码10                      $    $          $    $  ANS008.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  032.默认公共服务号码10                  $    $          $    $  ANS008.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  033.呼叫类型10                          $    $          $    $  ANS008.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  034.是否云端获取号码10                  $    $          $    $  ANS008.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  035.MCC2                                $    $          $    $  ANS009.BYTE004  $  ASCII(X1,X2,X3);
  $  036.MNC2                                $    $          $    $  ANS009.BYTE007  $  ASCII(X1,X2,X3);
  $  037.默认电话号码2                       $    $          $    $  ANS009.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  038.默认公共服务号码2                   $    $          $    $  ANS009.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  039.Call类型2                           $    $          $    $  ANS009.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  040.是否云端获取号码2                   $    $          $    $  ANS009.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  041.MCC3                                $    $          $    $  ANS010.BYTE004  $  ASCII(X1,X2,X3);
  $  042.MNC3                                $    $          $    $  ANS010.BYTE007  $  ASCII(X1,X2,X3);
  $  043.默认电话号码3                       $    $          $    $  ANS010.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  044.默认公共服务号码3                   $    $          $    $  ANS010.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  045.Call类型3                           $    $          $    $  ANS010.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  046.是否云端获取号码3                   $    $          $    $  ANS010.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  047.MCC4移动国家码4                     $    $          $    $  ANS011.BYTE004  $  ASCII(X1,X2,X3);
  $  048.MNC4移动网络码4                     $    $          $    $  ANS011.BYTE007  $  ASCII(X1,X2,X3);
  $  049.默认电话号码4                       $    $          $    $  ANS011.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  050.默认公共服务号码4                   $    $          $    $  ANS011.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  051.Call类型4                           $    $          $    $  ANS011.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  052.是否云端获取号码4                   $    $          $    $  ANS011.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  053.MCC5移动国家码5                     $    $          $    $  ANS012.BYTE004  $  ASCII(X1,X2,X3);
  $  054.MNC5移动网络码5                     $    $          $    $  ANS012.BYTE007  $  ASCII(X1,X2,X3);
  $  055.默认电话号码5                       $    $          $    $  ANS012.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  056.默认公共服务号码5                   $    $          $    $  ANS012.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  057.Call类型5                           $    $          $    $  ANS012.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  058.是否云端获取号码5                   $    $          $    $  ANS012.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  059.MCC6                                $    $          $    $  ANS013.BYTE004  $  ASCII(X1,X2,X3);
  $  060.MNC6移动网络码6                     $    $          $    $  ANS013.BYTE007  $  ASCII(X1,X2,X3);
  $  061.默认电话号码6                       $    $          $    $  ANS013.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  062.默认公共服务号码6                   $    $          $    $  ANS013.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  063.Call类型6                           $    $          $    $  ANS013.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  064.是否云端获取号码6                   $    $          $    $  ANS013.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  065.MCC7                                $    $          $    $  ANS014.BYTE004  $  ASCII(X1,X2,X3);
  $  066.MNC7                                $    $          $    $  ANS014.BYTE007  $  ASCII(X1,X2,X3);
  $  067.默认电话号码7                       $    $          $    $  ANS014.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  068.默认公共服务号码7                   $    $          $    $  ANS014.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  069.呼叫类型7                           $    $          $    $  ANS014.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  070.是否云端获取号码7                   $    $          $    $  ANS014.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  071.MCC8                                $    $          $    $  ANS015.BYTE004  $  ASCII(X1,X2,X3);
  $  072.MNC8                                $    $          $    $  ANS015.BYTE007  $  ASCII(X1,X2,X3);
  $  073.默认电话号码8                       $    $          $    $  ANS015.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  074.默认公共服务号码8                   $    $          $    $  ANS015.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  075.呼叫类型8                           $    $          $    $  ANS015.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  076.是否云端获取号码8                   $    $          $    $  ANS015.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  077.MCC9移动国家码9                     $    $          $    $  ANS016.BYTE004  $  ASCII(X1,X2,X3);
  $  078.MNC9                                $    $          $    $  ANS016.BYTE007  $  ASCII(X1,X2,X3);
  $  079.默认电话号码9                       $    $          $    $  ANS016.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  080.默认公共服务号码9                   $    $          $    $  ANS016.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  081.呼叫类型9                           $    $          $    $  ANS016.BYTE040  $  if(((x&0xF0)>>4)==0) y=@043b;else if(((x&0xF0)>>4)==1) y=@03df;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  082.是否云端获取号码9                   $    $          $    $  ANS016.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  083.大数据通道 8                        $    $          $    $  ANS017.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  084.大数据通道 7                        $    $          $    $  ANS017.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  085.数据通道6                           $    $          $    $  ANS017.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  086.数据通道5                           $    $          $    $  ANS017.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  087.数据通道4                           $    $          $    $  ANS017.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  088.数据通道3                           $    $          $    $  ANS017.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  089.数据通道2                           $    $          $    $  ANS017.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  090.大数据通道 1                        $    $          $    $  ANS017.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  091.大数据通道 16                       $    $          $    $  ANS017.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  092.数据通道15                          $    $          $    $  ANS017.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  093.数据通道14                          $    $          $    $  ANS017.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  094.数据通道13                          $    $          $    $  ANS017.BYTE005  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  095.大数据通道 12                       $    $          $    $  ANS017.BYTE005  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  096.数据通道11                          $    $          $    $  ANS017.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  097.数据通道10                          $    $          $    $  ANS017.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  098.大数据通道 9                        $    $          $    $  ANS017.BYTE005  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  099.大数据通道开关24                    $    $          $    $  ANS017.BYTE006  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  100.大数据通道 23                       $    $          $    $  ANS017.BYTE006  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  101.大数据通道 22                       $    $          $    $  ANS017.BYTE006  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  102.大数据通道开关21                    $    $          $    $  ANS017.BYTE006  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  103.大数据通道开关20                    $    $          $    $  ANS017.BYTE006  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  104.数据通道19                          $    $          $    $  ANS017.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  105.数据通道18                          $    $          $    $  ANS017.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  106.大数据通道 17                       $    $          $    $  ANS017.BYTE006  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  107.数据通道32                          $    $          $    $  ANS017.BYTE007  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  108.大数据通道 31                       $    $          $    $  ANS017.BYTE007  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  109.大数据通道开关30                    $    $          $    $  ANS017.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  110.大数据通道 29                       $    $          $    $  ANS017.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  111.数据通道28                          $    $          $    $  ANS017.BYTE007  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  112.大数据通道 27                       $    $          $    $  ANS017.BYTE007  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  113.大数据通道 26                       $    $          $    $  ANS017.BYTE007  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  114.大数据通道开关25                    $    $          $    $  ANS017.BYTE007  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  115.大数据通道 40                       $    $          $    $  ANS017.BYTE008  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  116.数据通道39                          $    $          $    $  ANS017.BYTE008  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  117.大数据通道开关38                    $    $          $    $  ANS017.BYTE008  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  118.大数据通道 37                       $    $          $    $  ANS017.BYTE008  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  119.大数据通道 36                       $    $          $    $  ANS017.BYTE008  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  120.大数据通道开关35                    $    $          $    $  ANS017.BYTE008  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  121.大数据通道开关34                    $    $          $    $  ANS017.BYTE008  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  122.大数据通道 33                       $    $          $    $  ANS017.BYTE008  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  123.触发事件 8                          $    $          $    $  ANS018.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  124.触发事件 7                          $    $          $    $  ANS018.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  125.触发事件 6                          $    $          $    $  ANS018.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  126.触发事件 5                          $    $          $    $  ANS018.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  127.触发事件 4                          $    $          $    $  ANS018.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  128.触发事件 3                          $    $          $    $  ANS018.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  129.触发事件 2                          $    $          $    $  ANS018.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  130.触发事件 1                          $    $          $    $  ANS018.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  131.触发事件 16                         $    $          $    $  ANS018.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  132.触发事件 15                         $    $          $    $  ANS018.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  133.触发事件 14                         $    $          $    $  ANS018.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  134.触发事件 13                         $    $          $    $  ANS018.BYTE005  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  135.触发事件 12                         $    $          $    $  ANS018.BYTE005  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  136.触发事件 11                         $    $          $    $  ANS018.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  137.触发事件 10                         $    $          $    $  ANS018.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  138.触发事件 9                          $    $          $    $  ANS018.BYTE005  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  139.触发事件开关24                      $    $          $    $  ANS018.BYTE006  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  140.触发事件开关23                      $    $          $    $  ANS018.BYTE006  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  141.触发事件开关22                      $    $          $    $  ANS018.BYTE006  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  142.触发事件开关21                      $    $          $    $  ANS018.BYTE006  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  143.触发事件 20                         $    $          $    $  ANS018.BYTE006  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  144.触发事件 19                         $    $          $    $  ANS018.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  145.触发事件 18                         $    $          $    $  ANS018.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  146.触发事件 17                         $    $          $    $  ANS018.BYTE006  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  147.触发事件开关32                      $    $          $    $  ANS018.BYTE007  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  148.触发事件 31                         $    $          $    $  ANS018.BYTE007  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  149.触发事件开关30                      $    $          $    $  ANS018.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  150.触发事件 29                         $    $          $    $  ANS018.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  151.触发事件 28                         $    $          $    $  ANS018.BYTE007  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  152.触发事件开关27                      $    $          $    $  ANS018.BYTE007  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  153.触发事件开关26                      $    $          $    $  ANS018.BYTE007  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  154.触发事件开关25                      $    $          $    $  ANS018.BYTE007  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  155.触发事件开关40                      $    $          $    $  ANS018.BYTE008  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@0439;else y=@0035;
  $  156.触发事件开关39                      $    $          $    $  ANS018.BYTE008  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@0439;else y=@0035;
  $  157.触发事件开关38                      $    $          $    $  ANS018.BYTE008  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@0439;else y=@0035;
  $  158.触发事件 37                         $    $          $    $  ANS018.BYTE008  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@0439;else y=@0035;
  $  159.触发事件开关36                      $    $          $    $  ANS018.BYTE008  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@0439;else y=@0035;
  $  160.触发事件 35                         $    $          $    $  ANS018.BYTE008  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@0439;else y=@0035;
  $  161.触发事件开关34                      $    $          $    $  ANS018.BYTE008  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@0439;else y=@0035;
  $  162.触发事件 33                         $    $          $    $  ANS018.BYTE008  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@0439;else y=@0035;
  $  163.GPS(全球定位系统)天线状态           $    $          $    $  ANS019.BYTE004  $  if((x&0x01)==0) y=@0339;else if((x&0x01)==1) y=@033a;else y=@0035;
  $  164.经度                                $    $          $    $  ANS020.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*1*0.000001;
  $  165.维度                                $    $          $    $  ANS020.BYTE008  $  y=(x1*256*256*256+x2*256*256+x3*256+x4)*1*0.000001;
  $  166.GPS时间                             $    $  s       $    $  ANS021.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  167.GPS精度                             $    $          $    $  ANS021.BYTE008  $  y=x*0.1;
  $  168.GPS速度                             $    $  kph     $    $  ANS021.BYTE009  $  y=x;
  $  169.GPS方向                             $    $          $    $  ANS021.BYTE010  $  y=x*2;
  $  170.GPS状态                             $    $          $    $  ANS021.BYTE011  $  if(((x&0x70)>>4)==0) y=@034a;else if(((x&0x70)>>4)==1) y=@03f3;else if(((x&0x70)>>4)==2) y=@034c;else y=@0103;
  $  171.GPS搜星个数                         $    $          $    $  ANS021.BYTE011  $  y=(x&0x0F);
  $  172.内部SIM IC的ICCID代码               $    $          $    $  ANS022.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  173.信息呼叫回拨时间                    $    $  H       $    $  ANS023.BYTE004  $  y=x*0.1;
  $  174.APN1 IP地址                         $    $          $    $  ANS024.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  175.APN2 IP地址                         $    $          $    $  ANS025.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  176.防盗状态                            $    $          $    $  ANS026.BYTE004  $  if(x==0) y=@03f4;else if(x==1) y=@03f5;else y=@0103;
  $  177.防盗PIN码                           $    $          $    $  ANS027.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  178.采集数据间隔                        $    $  s       $    $  ANS028.BYTE004  $  y=x;
  $  179.采集数据数量                        $    $          $    $  ANS028.BYTE005  $  y=x;
  $  180.采集数据结束时间                    $    $  s       $    $  ANS028.BYTE006  $  y=x;
  $  181.蓝牙MAC地址                         $    $          $    $  ANS029.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  182.MPU软件版本                         $    $          $    $  ANS030.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48);
  $  183.正在使用的天线                      $    $          $    $  ANS031.BYTE004  $  if(((x&0xC0)>>6)==0) y=@033b;else if(((x&0xC0)>>6)==1) y=@033b;else y=@0103;
  $  184.内部天线连接                        $    $          $    $  ANS031.BYTE004  $  if(((x&0x30)>>4)==0) y=@0339;else if(((x&0x30)>>4)==1) y=@033a;else y=@0103;
  $  185.二级天线连接                        $    $          $    $  ANS031.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0339;else if(((x&0x0C)>>2)==1) y=@033a;else y=@0103;
  $  186.主天线连接                          $    $          $    $  ANS031.BYTE004  $  if((x&0x03)==0) y=@0339;else if((x&0x03)==1) y=@033a;else y=@0103;
  $  187.SIM卡IMEI                           $    $          $    $  ANS032.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  188.Modem硬件版本                       $    $          $    $  ANS033.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  189.Modem软件版本                       $    $          $    $  ANS034.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  190.SIM卡MCC移动国家码                  $    $          $    $  ANS035.BYTE004  $  ASCII(X1,X2,X3);
  $  191.MNC移动网络码                       $    $          $    $  ANS035.BYTE007  $  ASCII(X1,X2,X3);
  $  192.信号强度                            $    $          $    $  ANS036.BYTE004  $  y=(x1*256+x2)*0.1-150;
  $  193.使用SIM卡种类                       $    $          $    $  ANS036.BYTE006  $  if(((x&0x40)>>6)==0) y=@033b;else if(((x&0x40)>>6)==1) y=@033b;else y=@0035;
  $  194.网络制式                            $    $          $    $  ANS036.BYTE006  $  if(((x&0x38)>>3)==0) y=@03e1;else if(((x&0x38)>>3)==1) y=@03e2;else if(((x&0x38)>>3)==2) y=@03e3;else if(((x&0x38)>>3)==3) y=@03e4;else if(((x&0x38)>>3)==4) y=@03e5;else if(((x&0x38)>>3)==5) y=@03e6;else if(((x&0x38)>>3)==6) y=@03e7;else y=@0103;
  $  195.接收到的信号强度显示                $    $          $    $  ANS036.BYTE006  $  y=(x&0x07);
  $  196.网络状态                            $    $          $    $  ANS036.BYTE007  $  if((x&0x07)==0) y=@03e8;else if((x&0x07)==1) y=@03e9;else if((x&0x07)==2) y=@03ea;else if((x&0x07)==3) y=@03eb;else if((x&0x07)==4) y=@01e5;else if((x&0x07)==5) y=@03ec;else y=@0103;
  $  197.NAD调制解调器温度                   $    $          $    $  ANS037.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  198.PDP(分组数据协议)连接成功次数       $    $          $    $  ANS038.BYTE004  $  y=(x1*256+x2);
  $  199.PDP(分组数据协议)连接失败次数       $    $          $    $  ANS038.BYTE006  $  y=(x1*256+x2);
  $  200.PDP(分组数据协议)断掉次数           $    $          $    $  ANS038.BYTE008  $  y=(x1*256+x2);
  $  201.识别无效的PIN时间                   $    $          $    $  ANS039.BYTE004  $  y=((x&0xF0)>>4);
  $  202.标识PIN的标志被锁定                 $    $          $    $  ANS039.BYTE004  $  if((x&0x01)==0) y=@0404;else if((x&0x01)==1) y=@0436;else y=@0035;
  $  203.PIN码剩余锁定时间                   $    $  min     $    $  ANS039.BYTE005  $  y=(x1*256+x2);
  $  204.Modem唤醒                           $    $          $    $  ANS040.BYTE004  $  if(((x&0x04)>>2)==0) y=@0437;else if(((x&0x04)>>2)==1) y=@011f;else y=@0035;
  $  205.CAN2唤醒                            $    $          $    $  ANS040.BYTE004  $  if(((x&0x02)>>1)==0) y=@0437;else if(((x&0x02)>>1)==1) y=@011f;else y=@0035;
  $  206.CAN1唤醒                            $    $          $    $  ANS040.BYTE004  $  if((x&0x01)==0) y=@0437;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  207.周期性唤醒                          $    $          $    $  ANS040.BYTE005  $  if((x&0x01)==0) y=@0437;else if((x&0x01)==1) y=@011f;else y=@0035;
  $  208.TBOX系统时间                        $    $  s       $    $  ANS041.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  209.TBOX通讯ID                          $    $          $    $  ANS042.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  210.进入休眠模式时间                    $    $  d       $    $  ANS043.BYTE004  $  y=x;
  $  211.允许周期唤醒时间                    $    $  d       $    $  ANS043.BYTE005  $  y=x;
  $  212.允许周期唤醒时间                    $    $  min     $    $  ANS043.BYTE006  $  y=x*10;
  $  213.TBOX(远程监控模块)温度              $    $          $    $  ANS044.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  214.APN(接入点名称)1名称                $    $          $    $  ANS045.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  215.APN(接入点名称)1密码                $    $          $    $  ANS046.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  216.APN(接入点名称)1用户名              $    $          $    $  ANS047.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  217.后台IP地址                          $    $          $    $  ANS048.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  218.后台IP端口                          $    $          $    $  ANS049.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6);
  $  219.短信服务号码                        $    $          $    $  ANS050.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  220.道路救援呼叫回拨时间                $    $  H       $    $  ANS051.BYTE004  $  y=x*0.1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:711 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
