
    车型ID：111a

    模拟：协议模拟-->111a

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:711 02 10 01 00 00 00 00 00       $~  ANS000:719 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:711 02 3E 80 00 00 00 00 00       $!  ANS000:719 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:711 03 19 02 09 00 00 00 00       $#  ANS000:719 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/18000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:711 04 14 FF FF FF 00 00 00       $$  ANS000:719 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:711 03 22 F1 A0 00 00 00 00       $%  ANS000:719 03 22 F1 A0 00 00 00 00
  $%  REQ001:711 03 22 F1 83 00 00 00 00       $%  ANS001:719 03 22 F1 83 00 00 00 00
  $%  REQ002:711 03 22 F1 A1 00 00 00 00       $%  ANS002:719 03 22 F1 A1 00 00 00 00
  $%  REQ003:711 03 22 F1 91 00 00 00 00       $%  ANS003:719 03 22 F1 91 00 00 00 00
  $%  REQ004:711 03 22 F1 A2 00 00 00 00       $%  ANS004:719 03 22 F1 A2 00 00 00 00
  $%  REQ005:711 03 22 F1 87 00 00 00 00       $%  ANS005:719 03 22 F1 87 00 00 00 00
  $%  REQ006:711 03 22 F1 10 00 00 00 00       $%  ANS006:719 03 22 F1 10 00 00 00 00
  $%  REQ007:711 03 22 F1 92 00 00 00 00       $%  ANS007:719 03 22 F1 92 00 00 00 00
  $%  REQ008:711 03 22 F1 8C 00 00 00 00       $%  ANS008:719 03 22 F1 8C 00 00 00 00
  $%  REQ009:711 03 22 F1 94 00 00 00 00       $%  ANS009:719 03 22 F1 94 00 00 00 00
  $%  REQ010:711 03 22 F1 8A 00 00 00 00       $%  ANS010:719 03 22 F1 8A 00 00 00 00
  $%  REQ011:711 03 22 F1 90 00 00 00 00       $%  ANS011:719 03 22 F1 90 00 00 00 00
  $%  REQ012:711 03 22 F1 A8 00 00 00 00       $%  ANS012:719 03 22 F1 A8 00 00 00 00
  $%  REQ013:711 03 22 F1 8B 00 00 00 00       $%  ANS013:719 03 22 F1 8B 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元标定软件号:              $%    $%  ANS002.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  003:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元网络文件参考号:          $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  005:电控单元零件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元零件号（上次）:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  007:测试工具参考号（上次）:          $%    $%  ANS006.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  008:里程读数（上次）KM:              $%    $%  ANS006.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  009:供应商电控单元硬件参考号:        $%    $%  ANS007.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  010:供应商电控单元序列号:            $%    $%  ANS008.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  011:供应商电控单元软件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:系统供应商识别号:                $%    $%  ANS010.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  013:VIN:                             $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  014:车辆特征信息:                    $%    $%  ANS012.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $%  015:电控单元制造日期:                $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3);
  $%  016:电控单元制造日期 1:              $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:711 03 22 C0 01 00 00 00 00       $  ANS000:719 03 22 C0 01 00 00 00 00
  $  REQ001:711 03 22 C0 04 00 00 00 00       $  ANS001:719 03 22 C0 04 00 00 00 00
  $  REQ002:711 03 22 C0 03 00 00 00 00       $  ANS002:719 03 22 C0 03 00 00 00 00
  $  REQ003:711 03 22 C0 06 00 00 00 00       $  ANS003:719 03 22 C0 06 00 00 00 00
  $  REQ004:711 03 22 C0 02 00 00 00 00       $  ANS004:719 03 22 C0 02 00 00 00 00
  $  REQ005:711 03 22 C0 05 00 00 00 00       $  ANS005:719 03 22 C0 05 00 00 00 00
  $  REQ006:711 03 22 B2 00 00 00 00 00       $  ANS006:719 03 22 B2 00 00 00 00 00
  $  REQ007:711 03 22 B2 50 00 00 00 00       $  ANS007:719 03 22 B2 50 00 00 00 00
  $  REQ008:711 03 22 B0 03 00 00 00 00       $  ANS008:719 03 22 B0 03 00 00 00 00
  $  REQ009:711 03 22 B2 10 00 00 00 00       $  ANS009:719 03 22 B2 10 00 00 00 00
  $  REQ010:711 03 22 CA 01 00 00 00 00       $  ANS010:719 03 22 CA 01 00 00 00 00
  $  REQ011:711 03 22 CA 0A 00 00 00 00       $  ANS011:719 03 22 CA 0A 00 00 00 00
  $  REQ012:711 03 22 CA 02 00 00 00 00       $  ANS012:719 03 22 CA 02 00 00 00 00
  $  REQ013:711 03 22 CA 03 00 00 00 00       $  ANS013:719 03 22 CA 03 00 00 00 00
  $  REQ014:711 03 22 CA 04 00 00 00 00       $  ANS014:719 03 22 CA 04 00 00 00 00
  $  REQ015:711 03 22 CA 05 00 00 00 00       $  ANS015:719 03 22 CA 05 00 00 00 00
  $  REQ016:711 03 22 CA 06 00 00 00 00       $  ANS016:719 03 22 CA 06 00 00 00 00
  $  REQ017:711 03 22 CA 07 00 00 00 00       $  ANS017:719 03 22 CA 07 00 00 00 00
  $  REQ018:711 03 22 CA 08 00 00 00 00       $  ANS018:719 03 22 CA 08 00 00 00 00
  $  REQ019:711 03 22 CA 09 00 00 00 00       $  ANS019:719 03 22 CA 09 00 00 00 00
  $  REQ020:711 03 22 CA 81 00 00 00 00       $  ANS020:719 03 22 CA 81 00 00 00 00
  $  REQ021:711 03 22 CF 01 00 00 00 00       $  ANS021:719 03 22 CF 01 00 00 00 00
  $  REQ022:711 03 22 B1 00 00 00 00 00       $  ANS022:719 03 22 B1 00 00 00 00 00
  $  REQ023:711 03 22 B1 01 00 00 00 00       $  ANS023:719 03 22 B1 01 00 00 00 00
  $  REQ024:711 03 22 B1 02 00 00 00 00       $  ANS024:719 03 22 B1 02 00 00 00 00
  $  REQ025:711 03 22 B0 01 00 00 00 00       $  ANS025:719 03 22 B0 01 00 00 00 00
  $  REQ026:711 03 22 CA 12 00 00 00 00       $  ANS026:719 03 22 CA 12 00 00 00 00
  $  REQ027:711 03 22 B1 82 00 00 00 00       $  ANS027:719 03 22 B1 82 00 00 00 00
  $  REQ028:711 03 22 B1 83 00 00 00 00       $  ANS028:719 03 22 B1 83 00 00 00 00
  $  REQ029:711 03 22 B2 15 00 00 00 00       $  ANS029:719 03 22 B2 15 00 00 00 00
  $  REQ030:711 03 22 CF 10 00 00 00 00       $  ANS030:719 03 22 CF 10 00 00 00 00
  $  REQ031:711 03 22 CA 80 00 00 00 00       $  ANS031:719 03 22 CA 80 00 00 00 00
  $  REQ032:711 03 22 B0 08 00 00 00 00       $  ANS032:719 03 22 B0 08 00 00 00 00
  $  REQ033:711 03 22 B0 00 00 00 00 00       $  ANS033:719 03 22 B0 00 00 00 00 00
  $  REQ034:711 03 22 B1 84 00 00 00 00       $  ANS034:719 03 22 B1 84 00 00 00 00
  $  REQ035:711 03 22 B0 04 00 00 00 00       $  ANS035:719 03 22 B0 04 00 00 00 00
  $  REQ036:711 03 22 B0 06 00 00 00 00       $  ANS036:719 03 22 B0 06 00 00 00 00
  $  REQ037:711 03 22 B0 05 00 00 00 00       $  ANS037:719 03 22 B0 05 00 00 00 00
  $  REQ038:711 03 22 B1 80 00 00 00 00       $  ANS038:719 03 22 B1 80 00 00 00 00
  $  REQ039:711 03 22 B1 81 00 00 00 00       $  ANS039:719 03 22 B1 81 00 00 00 00
  $  REQ040:711 03 22 B1 85 00 00 00 00       $  ANS040:719 03 22 B1 85 00 00 00 00
  $  REQ041:711 03 22 B0 84 00 00 00 00       $  ANS041:719 03 22 B0 84 00 00 00 00
  $  REQ042:711 03 22 B2 90 00 00 00 00       $  ANS042:719 03 22 B2 90 00 00 00 00
  $  REQ043:711 03 22 B0 83 00 00 00 00       $  ANS043:719 03 22 B0 83 00 00 00 00
  $  REQ044:711 03 22 B0 82 00 00 00 00       $  ANS044:719 03 22 B0 82 00 00 00 00
  $  REQ045:711 03 22 B0 07 00 00 00 00       $  ANS045:719 03 22 B0 07 00 00 00 00
  $  REQ046:711 03 22 C1 06 00 00 00 00       $  ANS046:719 03 22 C1 06 00 00 00 00
  $  REQ047:711 03 22 B0 81 00 00 00 00       $  ANS047:719 03 22 B0 81 00 00 00 00
  $  REQ048:711 03 22 C0 07 00 00 00 00       $  ANS048:719 03 22 C0 07 00 00 00 00
  $  REQ049:711 03 22 C0 09 00 00 00 00       $  ANS049:719 03 22 C0 09 00 00 00 00
  $  REQ050:711 03 22 C0 08 00 00 00 00       $  ANS050:719 03 22 C0 08 00 00 00 00
  $  REQ051:711 03 22 CA 22 00 00 00 00       $  ANS051:719 03 22 CA 22 00 00 00 00

  $  000.APN1名称                             $    $          $    $  ANS000.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  001.APN2名称                             $    $          $    $  ANS001.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32,X33,X34,X35,X36,X37,X38,X39,X40,X41,X42,X43,X44,X45,X46,X47,X48,X49,X50,X51,X52,X53,X54,X55,X56,X57,X58,X59,X60,X61,X62,X63,X64);
  $  002.APN(接入点名称)1密码                 $    $          $    $  ANS002.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  003.APN2密码                             $    $          $    $  ANS003.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  004.APN(接入点名称)1用户名               $    $          $    $  ANS004.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  005.APN(接入点名称)2用户名               $    $          $    $  ANS005.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  006.APP(应用软件)激活状态                $    $          $    $  ANS006.BYTE004  $  if((x&0x03)==0) y=@0004;else if((x&0x03)==1) y=@034d;else if((x&0x03)==2) y=@034e;else if((x&0x03)==3) y=@034f;else y=@0004;
  $  007.Ecall功能开关                        $    $          $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  008.启用BCAL                             $    $          $    $  ANS006.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  009.启用ICALL                            $    $          $    $  ANS006.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  010.启用车辆状态                         $    $          $    $  ANS006.BYTE005  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  011.行程日志功能开关                     $    $          $    $  ANS006.BYTE005  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  012.启用在线信息娱乐功能                 $    $          $    $  ANS006.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  013.车辆被盗追踪功能开关                 $    $          $    $  ANS006.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  014.启用远程控制                         $    $          $    $  ANS006.BYTE005  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  015.启用蓝牙密钥登录                     $    $          $    $  ANS006.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  016.远程故障码检测功能开关               $    $          $    $  ANS006.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  017.数据采集功能开关                     $    $          $    $  ANS006.BYTE006  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  018.当前保存钥匙总数(包括备用钥匙)       $    $          $    $  ANS007.BYTE004  $  y=x;
  $  019.当前钥匙的预订值                     $    $          $    $  ANS007.BYTE005  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  020.当前钥匙开始时间                     $    $  s       $    $  ANS007.BYTE009  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  021.当前使用的钥匙结束时间               $    $  s       $    $  ANS007.BYTE013  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  022.蓝牙模块软件版本                     $    $          $    $  ANS008.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  023.密钥交换反馈                         $    $          $    $  ANS009.BYTE004  $  if(((x&0xFE)>>1)==0x00) y=@033c;else if(((x&0xFE)>>1)==0x01) y=@03ed;else if(((x&0xFE)>>1)==0x02) y=@033e;else if(((x&0xFE)>>1)==0x03) y=@033f;else if(((x&0xFE)>>1)==0x04) y=@0340;else if(((x&0xFE)>>1)==0x05) y=@0341;else if(((x&0xFE)>>1)==0x06) y=@0342;else if(((x&0xFE)>>1)==0x07) y=@002f;else if(((x&0xFE)>>1)==0x08) y=@040e;else if(((x&0xFE)>>1)==0x09) y=@040f;else if(((x&0xFE)>>1)==0x0A) y=@0410;else if(((x&0xFE)>>1)==0x0B) y=@0346;else if(((x&0xFE)>>1)==0x0C) y=@0411;else if(((x&0xFE)>>1)==0x0D) y=@0348;else y=@0004;
  $  024.密钥交换完成状态                     $    $          $    $  ANS009.BYTE004  $  if((x&0x01)==0) y=@028e;else if((x&0x01)==1) y=@028d;else y=@0004;
  $  025.配置检查状态                         $    $          $    $  ANS009.BYTE005  $  if((x&0x01)==0) y=@0412;else if((x&0x01)==1) y=@03ed;else y=@0004;
  $  026.MCC1移动国家码1                      $    $          $    $  ANS010.BYTE004  $  ASCII(X1,X2,X3);
  $  027.MNC1移动网络码1                      $    $          $    $  ANS010.BYTE007  $  ASCII(X1,X2,X3);
  $  028.默认电话号码1                        $    $          $    $  ANS010.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  029.默认公共服务号码1                    $    $          $    $  ANS010.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  030.呼叫类型1                            $    $          $    $  ANS010.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  031.是否云端获取号码1                    $    $          $    $  ANS010.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  032.MCC10移动国家码10                    $    $          $    $  ANS011.BYTE004  $  ASCII(X1,X2,X3);
  $  033.MNC10移动网络码10                    $    $          $    $  ANS011.BYTE007  $  ASCII(X1,X2,X3);
  $  034.默认电话号码10                       $    $          $    $  ANS011.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  035.默认公共服务号码10                   $    $          $    $  ANS011.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  036.呼叫类型10                           $    $          $    $  ANS011.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  037.是否云端获取号码10                   $    $          $    $  ANS011.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  038.MCC2移动国家码2                      $    $          $    $  ANS012.BYTE004  $  ASCII(X1,X2,X3);
  $  039.MNC2移动网络码2                      $    $          $    $  ANS012.BYTE007  $  ASCII(X1,X2,X3);
  $  040.默认电话号码2                        $    $          $    $  ANS012.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  041.默认公共服务号码2                    $    $          $    $  ANS012.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  042.呼叫类型2                            $    $          $    $  ANS012.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  043.是否云端获取号码2                    $    $          $    $  ANS012.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  044.MCC3移动国家码3                      $    $          $    $  ANS013.BYTE004  $  ASCII(X1,X2,X3);
  $  045.MNC3移动网络码3                      $    $          $    $  ANS013.BYTE007  $  ASCII(X1,X2,X3);
  $  046.默认电话号码3                        $    $          $    $  ANS013.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  047.默认公共服务号码3                    $    $          $    $  ANS013.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  048.呼叫类型3                            $    $          $    $  ANS013.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  049.是否云端获取号码3                    $    $          $    $  ANS013.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  050.MCC4                                 $    $          $    $  ANS014.BYTE004  $  ASCII(X1,X2,X3);
  $  051.MNC4                                 $    $          $    $  ANS014.BYTE007  $  ASCII(X1,X2,X3);
  $  052.默认电话号码4                        $    $          $    $  ANS014.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  053.默认公共服务号码4                    $    $          $    $  ANS014.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  054.呼叫类型4                            $    $          $    $  ANS014.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  055.是否云端获取号码4                    $    $          $    $  ANS014.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  056.MCC5                                 $    $          $    $  ANS015.BYTE004  $  ASCII(X1,X2,X3);
  $  057.MNC5                                 $    $          $    $  ANS015.BYTE007  $  ASCII(X1,X2,X3);
  $  058.默认电话号码5                        $    $          $    $  ANS015.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  059.默认公共服务号码5                    $    $          $    $  ANS015.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  060.呼叫类型5                            $    $          $    $  ANS015.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  061.是否云端获取号码5                    $    $          $    $  ANS015.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  062.MCC6移动国家码6                      $    $          $    $  ANS016.BYTE004  $  ASCII(X1,X2,X3);
  $  063.MNC6                                 $    $          $    $  ANS016.BYTE007  $  ASCII(X1,X2,X3);
  $  064.默认电话号码6                        $    $          $    $  ANS016.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  065.默认公共服务号码6                    $    $          $    $  ANS016.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  066.呼叫类型6                            $    $          $    $  ANS016.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  067.是否云端获取号码6                    $    $          $    $  ANS016.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  068.MCC7移动国家码7                      $    $          $    $  ANS017.BYTE004  $  ASCII(X1,X2,X3);
  $  069.MNC7移动网络码7                      $    $          $    $  ANS017.BYTE007  $  ASCII(X1,X2,X3);
  $  070.默认电话号码7                        $    $          $    $  ANS017.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  071.默认公共服务号码7                    $    $          $    $  ANS017.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  072.呼叫类型7                            $    $          $    $  ANS017.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  073.是否云端获取号码7                    $    $          $    $  ANS017.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  074.MCC8移动国家码8                      $    $          $    $  ANS018.BYTE004  $  ASCII(X1,X2,X3);
  $  075.MNC8移动网络码8                      $    $          $    $  ANS018.BYTE007  $  ASCII(X1,X2,X3);
  $  076.默认电话号码8                        $    $          $    $  ANS018.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  077.默认公共服务号码8                    $    $          $    $  ANS018.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  078.呼叫类型8                            $    $          $    $  ANS018.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  079.是否云端获取号码8                    $    $          $    $  ANS018.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  080.MCC9移动国家码9                      $    $          $    $  ANS019.BYTE004  $  ASCII(X1,X2,X3);
  $  081.MNC9移动网络码9                      $    $          $    $  ANS019.BYTE007  $  ASCII(X1,X2,X3);
  $  082.默认电话号码9                        $    $          $    $  ANS019.BYTE010  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  083.默认公共服务号码9                    $    $          $    $  ANS019.BYTE025  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $  084.呼叫类型9                            $    $          $    $  ANS019.BYTE040  $  if(((x&0xF0)>>4)==0) y=@03de;else if(((x&0xF0)>>4)==1) y=@03f2;else if(((x&0xF0)>>4)==2) y=@03e0;else y=@0103;
  $  085.是否云端获取号码9                    $    $          $    $  ANS019.BYTE040  $  if((x&0x0F)==0) y=@000f;else if((x&0x0F)==1) y=@0028;else y=@0103;
  $  086.数据通道8                            $    $          $    $  ANS020.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  087.数据通道7                            $    $          $    $  ANS020.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  088.数据通道6                            $    $          $    $  ANS020.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  089.数据通道5                            $    $          $    $  ANS020.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  090.数据通道4                            $    $          $    $  ANS020.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  091.数据通道3                            $    $          $    $  ANS020.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  092.数据通道2                            $    $          $    $  ANS020.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  093.数据通道1                            $    $          $    $  ANS020.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  094.数据通道16                           $    $          $    $  ANS020.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  095.数据通道15                           $    $          $    $  ANS020.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  096.数据通道14                           $    $          $    $  ANS020.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  097.数据通道13                           $    $          $    $  ANS020.BYTE005  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  098.数据通道12                           $    $          $    $  ANS020.BYTE005  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  099.数据通道11                           $    $          $    $  ANS020.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  100.数据通道10                           $    $          $    $  ANS020.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  101.数据通道9                            $    $          $    $  ANS020.BYTE005  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  102.数据通道24                           $    $          $    $  ANS020.BYTE006  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  103.数据通道23                           $    $          $    $  ANS020.BYTE006  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  104.数据通道22                           $    $          $    $  ANS020.BYTE006  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  105.数据通道21                           $    $          $    $  ANS020.BYTE006  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  106.数据通道20                           $    $          $    $  ANS020.BYTE006  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  107.数据通道19                           $    $          $    $  ANS020.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  108.数据通道18                           $    $          $    $  ANS020.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  109.数据通道17                           $    $          $    $  ANS020.BYTE006  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  110.数据通道32                           $    $          $    $  ANS020.BYTE007  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  111.数据通道31                           $    $          $    $  ANS020.BYTE007  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  112.数据通道30                           $    $          $    $  ANS020.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  113.数据通道29                           $    $          $    $  ANS020.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  114.数据通道28                           $    $          $    $  ANS020.BYTE007  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  115.数据通道27                           $    $          $    $  ANS020.BYTE007  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  116.数据通道26                           $    $          $    $  ANS020.BYTE007  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  117.数据通道25                           $    $          $    $  ANS020.BYTE007  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  118.数据通道40                           $    $          $    $  ANS020.BYTE008  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  119.数据通道39                           $    $          $    $  ANS020.BYTE008  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  120.数据通道38                           $    $          $    $  ANS020.BYTE008  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  121.数据通道37                           $    $          $    $  ANS020.BYTE008  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  122.数据通道36                           $    $          $    $  ANS020.BYTE008  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  123.数据通道35                           $    $          $    $  ANS020.BYTE008  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  124.数据通道34                           $    $          $    $  ANS020.BYTE008  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  125.数据通道33                           $    $          $    $  ANS020.BYTE008  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  126.触发事件 8                           $    $          $    $  ANS021.BYTE004  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  127.触发事件 7                           $    $          $    $  ANS021.BYTE004  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  128.触发事件 6                           $    $          $    $  ANS021.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  129.触发事件 5                           $    $          $    $  ANS021.BYTE004  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  130.触发事件 4                           $    $          $    $  ANS021.BYTE004  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  131.触发事件 3                           $    $          $    $  ANS021.BYTE004  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  132.触发事件 2                           $    $          $    $  ANS021.BYTE004  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  133.触发事件 1                           $    $          $    $  ANS021.BYTE004  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  134.触发事件 16                          $    $          $    $  ANS021.BYTE005  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  135.触发事件 15                          $    $          $    $  ANS021.BYTE005  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  136.触发事件 14                          $    $          $    $  ANS021.BYTE005  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  137.触发事件 13                          $    $          $    $  ANS021.BYTE005  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  138.触发事件 12                          $    $          $    $  ANS021.BYTE005  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  139.触发事件 11                          $    $          $    $  ANS021.BYTE005  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  140.触发事件 10                          $    $          $    $  ANS021.BYTE005  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  141.触发事件 9                           $    $          $    $  ANS021.BYTE005  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  142.触发事件 24                          $    $          $    $  ANS021.BYTE006  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  143.触发事件 23                          $    $          $    $  ANS021.BYTE006  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  144.触发事件 22                          $    $          $    $  ANS021.BYTE006  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  145.触发事件 21                          $    $          $    $  ANS021.BYTE006  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  146.触发事件 20                          $    $          $    $  ANS021.BYTE006  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  147.触发事件 19                          $    $          $    $  ANS021.BYTE006  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  148.触发事件 18                          $    $          $    $  ANS021.BYTE006  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  149.触发事件 17                          $    $          $    $  ANS021.BYTE006  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  150.触发事件 32                          $    $          $    $  ANS021.BYTE007  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  151.触发事件 31                          $    $          $    $  ANS021.BYTE007  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  152.触发事件 30                          $    $          $    $  ANS021.BYTE007  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  153.触发事件 29                          $    $          $    $  ANS021.BYTE007  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  154.触发事件 28                          $    $          $    $  ANS021.BYTE007  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  155.触发事件 27                          $    $          $    $  ANS021.BYTE007  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  156.触发事件 26                          $    $          $    $  ANS021.BYTE007  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  157.触发事件 25                          $    $          $    $  ANS021.BYTE007  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  158.触发事件 40                          $    $          $    $  ANS021.BYTE008  $  if(((x&0x80)>>7)==0) y=@00b1;else if(((x&0x80)>>7)==1) y=@00dc;else y=@0004;
  $  159.触发事件 39                          $    $          $    $  ANS021.BYTE008  $  if(((x&0x40)>>6)==0) y=@00b1;else if(((x&0x40)>>6)==1) y=@00dc;else y=@0004;
  $  160.触发事件 38                          $    $          $    $  ANS021.BYTE008  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00dc;else y=@0004;
  $  161.触发事件 37                          $    $          $    $  ANS021.BYTE008  $  if(((x&0x10)>>4)==0) y=@00b1;else if(((x&0x10)>>4)==1) y=@00dc;else y=@0004;
  $  162.触发事件 36                          $    $          $    $  ANS021.BYTE008  $  if(((x&0x08)>>3)==0) y=@00b1;else if(((x&0x08)>>3)==1) y=@00dc;else y=@0004;
  $  163.触发事件 35                          $    $          $    $  ANS021.BYTE008  $  if(((x&0x04)>>2)==0) y=@00b1;else if(((x&0x04)>>2)==1) y=@00dc;else y=@0004;
  $  164.触发事件 34                          $    $          $    $  ANS021.BYTE008  $  if(((x&0x02)>>1)==0) y=@00b1;else if(((x&0x02)>>1)==1) y=@00dc;else y=@0004;
  $  165.触发事件 33                          $    $          $    $  ANS021.BYTE008  $  if((x&0x01)==0) y=@00b1;else if((x&0x01)==1) y=@00dc;else y=@0004;
  $  166.预留值                               $    $          $    $  ANS021.BYTE009  $  y=UINT64(x8,x9,x10,x11,x12,x13,x14,x15);
  $  167.GPS(全球定位系统)天线状态            $    $          $    $  ANS022.BYTE004  $  if((x&0x01)==0) y=@0339;else if((x&0x01)==1) y=@033a;else y=@0004;
  $  168.经度                                 $    $          $    $  ANS023.BYTE004  $  if(x1<0x80) y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.000001;else y=((x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000)*0.000001;
  $  169.维度                                 $    $          $    $  ANS023.BYTE008  $  if(x1<0x80) y=(x1*256*256*256+x2*256*256+x3*256+x4)*0.000001;else y=((x1-0x80)*256*256*256+x2*256*256+x3*256+x4-0x80000000)*0.000001;
  $  170.GPS时间                              $    $  s       $    $  ANS024.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  171.GPS精度                              $    $          $    $  ANS024.BYTE008  $  y=x*0.1;
  $  172.GPS速度                              $    $  kph     $    $  ANS024.BYTE009  $  y=x;
  $  173.GPS方向                              $    $          $    $  ANS024.BYTE010  $  y=x*2;
  $  174.GPS状态                              $    $          $    $  ANS024.BYTE011  $  if(((x&0x70)>>4)==0) y=@034a;else if(((x&0x70)>>4)==1) y=@034b;else if(((x&0x70)>>4)==2) y=@034c;else y=@0103;
  $  175.GPS搜星个数                          $    $          $    $  ANS024.BYTE011  $  y=(x&0x0F);
  $  176.SIM卡ICCID                           $    $          $    $  ANS025.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);
  $  177.信息呼叫回调定时器                   $    $  H       $    $  ANS026.BYTE004  $  y=x*0.1;
  $  178.APN(接入点名称)1 IP地址              $    $          $    $  ANS027.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  179.APN(接入点名称)2 IP地址              $    $          $    $  ANS028.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $  180.防盗状态                             $    $          $    $  ANS029.BYTE004  $  if(x==0) y=@03f4;else if(x==1) y=@03f5;else y=@0103;
  $  181.防盗PIN码                            $    $          $    $  ANS030.BYTE004  $  y=x1*256*256*256+x2*256*256+x3*256+x4;
  $  182.采集数据间隔                         $    $  s       $    $  ANS031.BYTE004  $  y=x;
  $  183.采集数据数量                         $    $          $    $  ANS031.BYTE005  $  y=x;
  $  184.采集数据结束时间                     $    $  s       $    $  ANS031.BYTE006  $  y=x;
  $  185.蓝牙MAC地址                          $    $          $    $  ANS032.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  186.MPU软件版本                          $    $          $    $  ANS033.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  187.天线使用种类                         $    $          $    $  ANS034.BYTE004  $  if(((x&0xC0)>>6)==0) y=@033b;else if(((x&0xC0)>>6)==1) y=@03fe;else y=@0103;
  $  188.内置天线状态                         $    $          $    $  ANS034.BYTE004  $  if(((x&0x30)>>4)==0) y=@0339;else if(((x&0x30)>>4)==1) y=@033a;else y=@0103;
  $  189.副天线连接状态                       $    $          $    $  ANS034.BYTE004  $  if(((x&0x0C)>>2)==0) y=@0339;else if(((x&0x0C)>>2)==1) y=@033a;else y=@0103;
  $  190.通讯主天线连接状态                   $    $          $    $  ANS034.BYTE004  $  if((x&0x03)==0) y=@0339;else if((x&0x03)==1) y=@033a;else y=@0103;
  $  191.SIM卡IMEI                            $    $          $    $  ANS035.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  192.Modem硬件版本                        $    $          $    $  ANS036.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  193.Modem软件版本                        $    $          $    $  ANS037.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24);
  $  194.SIM卡MCC移动国家码                   $    $          $    $  ANS038.BYTE004  $  ASCII(X1,X2,X3);
  $  195.MNC移动网络码                        $    $          $    $  ANS038.BYTE007  $  ASCII(X1,X2,X3);
  $  196.信号强度                             $    $          $    $  ANS039.BYTE004  $  y=(x1*256+x2)*0.1-150;
  $  197.使用SIM卡种类                        $    $          $    $  ANS039.BYTE006  $  if(((x&0x40)>>6)==0) y=@03fe;else if(((x&0x40)>>6)==1) y=@033b;else y=@0004;
  $  198.网络制式                             $    $          $    $  ANS039.BYTE006  $  if(((x&0x38)>>3)==0) y=@03e1;else if(((x&0x38)>>3)==1) y=@03e2;else if(((x&0x38)>>3)==2) y=@0400;else if(((x&0x38)>>3)==3) y=@03e4;else if(((x&0x38)>>3)==4) y=@03e5;else if(((x&0x38)>>3)==5) y=@03e6;else if(((x&0x38)>>3)==6) y=@03e7;else y=@0103;
  $  199.接收到的信号强度显示                 $    $          $    $  ANS039.BYTE006  $  y=(x&0x07);
  $  200.网络状态                             $    $          $    $  ANS039.BYTE007  $  if((x&0x07)==0) y=@03e8;else if((x&0x07)==1) y=@03e9;else if((x&0x07)==2) y=@03ea;else if((x&0x07)==3) y=@03eb;else if((x&0x07)==4) y=@01e5;else if((x&0x07)==5) y=@03ec;else y=@0103;
  $  201.NAD调制解调器温度                    $    $          $    $  ANS040.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  202.PDP(分组数据协议)连接成功次数        $    $          $    $  ANS041.BYTE004  $  y=(x1*256+x2);
  $  203.分组数据协议连接失败次数             $    $          $    $  ANS041.BYTE006  $  y=(x1*256+x2);
  $  204.PDP(分组数据协议)断掉次数            $    $          $    $  ANS041.BYTE008  $  y=(x1*256+x2);
  $  205.无效次数限值                         $    $          $    $  ANS042.BYTE004  $  y=((x&0xF0)>>4);
  $  206.PIN码锁定状态                        $    $          $    $  ANS042.BYTE004  $  if((x&0x01)==0) y=@00eb;else if((x&0x01)==1) y=@0055;else y=@0004;
  $  207.PIN码剩余锁定时间                    $    $  min     $    $  ANS042.BYTE005  $  y=(x1*256+x2);
  $  208.Modem唤醒                            $    $          $    $  ANS043.BYTE004  $  if(((x&0x04)>>2)==0) y=@00c9;else if(((x&0x04)>>2)==1) y=@011f;else y=@0004;
  $  209.CAN2唤醒                             $    $          $    $  ANS043.BYTE004  $  if(((x&0x02)>>1)==0) y=@00c9;else if(((x&0x02)>>1)==1) y=@011f;else y=@0004;
  $  210.CAN1唤醒                             $    $          $    $  ANS043.BYTE004  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@011f;else y=@0004;
  $  211.周期性唤醒                           $    $          $    $  ANS043.BYTE005  $  if((x&0x01)==0) y=@00c9;else if((x&0x01)==1) y=@011f;else y=@0004;
  $  212.TBOX系统时间                         $    $  s       $    $  ANS044.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  213.TBOX通讯ID                           $    $          $    $  ANS045.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12);
  $  214.进入休眠模式时间                     $    $  d       $    $  ANS046.BYTE004  $  y=x;
  $  215.允许周期唤醒时间                     $    $  d       $    $  ANS046.BYTE005  $  y=x;
  $  216.允许周期唤醒时间                     $    $  min     $    $  ANS046.BYTE006  $  y=x*10;
  $  217.TBOX(远程监控模块)温度               $    $          $    $  ANS047.BYTE004  $  y=((x&0x7F)-(x&0x80))-127;
  $  218.后台IP地址                           $    $          $    $  ANS048.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  219.后台IP端口                           $    $          $    $  ANS049.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6);
  $  220.短信服务号码                         $    $          $    $  ANS050.BYTE004  $  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20,X21,X22,X23,X24,X25,X26,X27,X28,X29,X30,X31,X32);
  $  221.道路救援呼叫回拨时间                 $    $  H       $    $  ANS051.BYTE004  $  y=x*0.1;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:711 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
