
    车型ID：111d

    模拟：协议模拟-->111d

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/1b000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 98 00 00 00 00       $%  ANS000:7E9 03 22 F1 98 00 00 00 00
  $%  REQ001:7E1 03 22 F1 A0 00 00 00 00       $%  ANS001:7E9 03 22 F1 A0 00 00 00 00
  $%  REQ002:7E1 03 22 F1 83 00 00 00 00       $%  ANS002:7E9 03 22 F1 83 00 00 00 00
  $%  REQ003:7E1 03 22 F1 A1 00 00 00 00       $%  ANS003:7E9 03 22 F1 A1 00 00 00 00
  $%  REQ004:7E1 03 22 F1 A9 00 00 00 00       $%  ANS004:7E9 03 22 F1 A9 00 00 00 00
  $%  REQ005:7E1 03 22 F1 91 00 00 00 00       $%  ANS005:7E9 03 22 F1 91 00 00 00 00
  $%  REQ006:7E1 03 22 F1 A5 00 00 00 00       $%  ANS006:7E9 03 22 F1 A5 00 00 00 00
  $%  REQ007:7E1 03 22 F1 8B 00 00 00 00       $%  ANS007:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ008:7E1 03 22 F1 A2 00 00 00 00       $%  ANS008:7E9 03 22 F1 A2 00 00 00 00
  $%  REQ009:7E1 03 22 F1 87 00 00 00 00       $%  ANS009:7E9 03 22 F1 87 00 00 00 00
  $%  REQ010:7E1 03 22 F1 AA 00 00 00 00       $%  ANS010:7E9 03 22 F1 AA 00 00 00 00
  $%  REQ011:7E1 03 22 F1 10 00 00 00 00       $%  ANS011:7E9 03 22 F1 10 00 00 00 00
  $%  REQ012:7E1 03 22 AF FC 00 00 00 00       $%  ANS012:7E9 03 22 AF FC 00 00 00 00
  $%  REQ013:7E1 03 22 F1 B0 00 00 00 00       $%  ANS013:7E9 03 22 F1 B0 00 00 00 00
  $%  REQ014:7E1 03 22 F1 BA 00 00 00 00       $%  ANS014:7E9 03 22 F1 BA 00 00 00 00
  $%  REQ015:7E1 03 22 F1 B5 00 00 00 00       $%  ANS015:7E9 03 22 F1 B5 00 00 00 00
  $%  REQ016:7E1 03 22 AF FE 00 00 00 00       $%  ANS016:7E9 03 22 AF FE 00 00 00 00
  $%  REQ017:7E1 03 22 AF FD 00 00 00 00       $%  ANS017:7E9 03 22 AF FD 00 00 00 00
  $%  REQ018:7E1 03 22 AF FF 00 00 00 00       $%  ANS018:7E9 03 22 AF FF 00 00 00 00
  $%  REQ019:7E1 03 22 F1 92 00 00 00 00       $%  ANS019:7E9 03 22 F1 92 00 00 00 00
  $%  REQ020:7E1 03 22 F1 8C 00 00 00 00       $%  ANS020:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ021:7E1 03 22 F1 94 00 00 00 00       $%  ANS021:7E9 03 22 F1 94 00 00 00 00
  $%  REQ022:7E1 03 22 F1 8A 00 00 00 00       $%  ANS022:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ023:7E1 03 22 F1 90 00 00 00 00       $%  ANS023:7E9 03 22 F1 90 00 00 00 00
  $%  REQ024:7E1 03 22 F1 A8 00 00 00 00       $%  ANS024:7E9 03 22 F1 A8 00 00 00 00

  $%  000:配置跟踪区:                      $%    $%  ANS000.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11);
  $%  001:电控单元应用软件号:              $%    $%  ANS001.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  002:电控单元刷写软件参考号:          $%    $%  ANS002.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  003:电控单元标定软件号:              $%    $%  ANS003.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  004:电控单元配置文件号:              $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  005:电控单元硬件号:                  $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元索引信息:                $%    $%  ANS006.BYTE004  $%  HEX(X1,X2,X3);
  $%  007:电控单元制造日期:                $%    $%  ANS007.BYTE004  $%  HEX(X1,X2,X3);
  $%  008:电控单元网络参考号:              $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8);
  $%  009:电控单元零件号:                  $%    $%  ANS009.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  010:电控单元编程流程文件号:          $%    $%  ANS010.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  011:电控单元零件号（上次）:          $%    $%  ANS011.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  012:测试工具参考号（上次）:          $%    $%  ANS011.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  013:里程读数（上次）KM:              $%    $%  ANS011.BYTE015  $%  y=x1*256*256+x2*256+x3;
  $%  014:刷写次数:                        $%    $%  ANS012.BYTE004  $%  HEX(X1,X2);
  $%  015:辅助刷写软件参考号:              $%    $%  ANS013.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  016:辅助校验软件号:                  $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  017:辅助应用软件号:                  $%    $%  ANS015.BYTE004  $%  HEX(X1,X2,X3,X4,X5);
  $%  018:软件兼容状态:                    $%    $%  ANS016.BYTE004  $%  HEX(X1);
  $%  019:软件完整性状态:                  $%    $%  ANS017.BYTE004  $%  HEX(X1);
  $%  020:软件有效标志位:                  $%    $%  ANS018.BYTE004  $%  HEX(X1);
  $%  021:供应商电控单元硬件参考号:        $%    $%  ANS019.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  022:供应商电控单元序列号:            $%    $%  ANS020.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15);
  $%  023:供应商电控单元软件参考号:        $%    $%  ANS021.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  024:系统供应商识别号:                $%    $%  ANS022.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  025:VIN码:                           $%    $%  ANS023.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  026:车辆特征信息:                    $%    $%  ANS024.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 B1 72 00 00 00 00       $  ANS000:7E9 03 22 B1 72 00 00 00 00
  $  REQ001:7E1 03 22 B1 27 00 00 00 00       $  ANS001:7E9 03 22 B1 27 00 00 00 00
  $  REQ002:7E1 03 22 B1 28 00 00 00 00       $  ANS002:7E9 03 22 B1 28 00 00 00 00
  $  REQ003:7E1 03 22 B1 73 00 00 00 00       $  ANS003:7E9 03 22 B1 73 00 00 00 00
  $  REQ004:7E1 03 22 B1 25 00 00 00 00       $  ANS004:7E9 03 22 B1 25 00 00 00 00
  $  REQ005:7E1 03 22 B1 26 00 00 00 00       $  ANS005:7E9 03 22 B1 26 00 00 00 00
  $  REQ006:7E1 03 22 B1 60 00 00 00 00       $  ANS006:7E9 03 22 B1 60 00 00 00 00
  $  REQ007:7E1 03 22 B1 1D 00 00 00 00       $  ANS007:7E9 03 22 B1 1D 00 00 00 00
  $  REQ008:7E1 03 22 B1 3C 00 00 00 00       $  ANS008:7E9 03 22 B1 3C 00 00 00 00
  $  REQ009:7E1 03 22 28 10 00 00 00 00       $  ANS009:7E9 03 22 28 10 00 00 00 00
  $  REQ010:7E1 03 22 B1 35 00 00 00 00       $  ANS010:7E9 03 22 B1 35 00 00 00 00
  $  REQ011:7E1 03 22 B1 5E 00 00 00 00       $  ANS011:7E9 03 22 B1 5E 00 00 00 00
  $  REQ012:7E1 03 22 B1 52 00 00 00 00       $  ANS012:7E9 03 22 B1 52 00 00 00 00
  $  REQ013:7E1 03 22 B1 07 00 00 00 00       $  ANS013:7E9 03 22 B1 07 00 00 00 00
  $  REQ014:7E1 03 22 B1 BD 00 00 00 00       $  ANS014:7E9 03 22 B1 BD 00 00 00 00
  $  REQ015:7E1 03 22 BC 6E 00 00 00 00       $  ANS015:7E9 03 22 BC 6E 00 00 00 00
  $  REQ016:7E1 03 22 BC 6F 00 00 00 00       $  ANS016:7E9 03 22 BC 6F 00 00 00 00
  $  REQ017:7E1 03 22 BC 0E 00 00 00 00       $  ANS017:7E9 03 22 BC 0E 00 00 00 00
  $  REQ018:7E1 03 22 BC 0F 00 00 00 00       $  ANS018:7E9 03 22 BC 0F 00 00 00 00
  $  REQ019:7E1 03 22 BC 10 00 00 00 00       $  ANS019:7E9 03 22 BC 10 00 00 00 00
  $  REQ020:7E1 03 22 BC 11 00 00 00 00       $  ANS020:7E9 03 22 BC 11 00 00 00 00
  $  REQ021:7E1 03 22 BC 19 00 00 00 00       $  ANS021:7E9 03 22 BC 19 00 00 00 00
  $  REQ022:7E1 03 22 BC 1C 00 00 00 00       $  ANS022:7E9 03 22 BC 1C 00 00 00 00
  $  REQ023:7E1 03 22 BC 02 00 00 00 00       $  ANS023:7E9 03 22 BC 02 00 00 00 00
  $  REQ024:7E1 03 22 BC 1F 00 00 00 00       $  ANS024:7E9 03 22 BC 1F 00 00 00 00
  $  REQ025:7E1 03 22 BC 22 00 00 00 00       $  ANS025:7E9 03 22 BC 22 00 00 00 00
  $  REQ026:7E1 03 22 BC 23 00 00 00 00       $  ANS026:7E9 03 22 BC 23 00 00 00 00
  $  REQ027:7E1 03 22 B1 31 00 00 00 00       $  ANS027:7E9 03 22 B1 31 00 00 00 00
  $  REQ028:7E1 03 22 B1 3D 00 00 00 00       $  ANS028:7E9 03 22 B1 3D 00 00 00 00
  $  REQ029:7E1 03 22 3D 30 00 00 00 00       $  ANS029:7E9 03 22 3D 30 00 00 00 00
  $  REQ030:7E1 03 22 3D 45 00 00 00 00       $  ANS030:7E9 03 22 3D 45 00 00 00 00
  $  REQ031:7E1 03 22 3D 4D 00 00 00 00       $  ANS031:7E9 03 22 3D 4D 00 00 00 00
  $  REQ032:7E1 03 22 B1 AF 00 00 00 00       $  ANS032:7E9 03 22 B1 AF 00 00 00 00
  $  REQ033:7E1 03 22 B2 1E 00 00 00 00       $  ANS033:7E9 03 22 B2 1E 00 00 00 00
  $  REQ034:7E1 03 22 B1 47 00 00 00 00       $  ANS034:7E9 03 22 B1 47 00 00 00 00
  $  REQ035:7E1 03 22 B1 75 00 00 00 00       $  ANS035:7E9 03 22 B1 75 00 00 00 00
  $  REQ036:7E1 03 22 B1 D4 00 00 00 00       $  ANS036:7E9 03 22 B1 D4 00 00 00 00
  $  REQ037:7E1 03 22 B1 03 00 00 00 00       $  ANS037:7E9 03 22 B1 03 00 00 00 00
  $  REQ038:7E1 03 22 B1 5F 00 00 00 00       $  ANS038:7E9 03 22 B1 5F 00 00 00 00
  $  REQ039:7E1 03 22 B1 63 00 00 00 00       $  ANS039:7E9 03 22 B1 63 00 00 00 00
  $  REQ040:7E1 03 22 B1 A6 00 00 00 00       $  ANS040:7E9 03 22 B1 A6 00 00 00 00
  $  REQ041:7E1 03 22 B1 64 00 00 00 00       $  ANS041:7E9 03 22 B1 64 00 00 00 00
  $  REQ042:7E1 03 22 B1 A7 00 00 00 00       $  ANS042:7E9 03 22 B1 A7 00 00 00 00
  $  REQ043:7E1 03 22 34 A6 00 00 00 00       $  ANS043:7E9 03 22 34 A6 00 00 00 00
  $  REQ044:7E1 03 22 34 A7 00 00 00 00       $  ANS044:7E9 03 22 34 A7 00 00 00 00
  $  REQ045:7E1 03 22 B1 AD 00 00 00 00       $  ANS045:7E9 03 22 B1 AD 00 00 00 00
  $  REQ046:7E1 03 22 B1 AE 00 00 00 00       $  ANS046:7E9 03 22 B1 AE 00 00 00 00
  $  REQ047:7E1 03 22 00 42 00 00 00 00       $  ANS047:7E9 03 22 00 42 00 00 00 00
  $  REQ048:7E1 03 22 B1 57 00 00 00 00       $  ANS048:7E9 03 22 B1 57 00 00 00 00
  $  REQ049:7E1 03 22 B1 48 00 00 00 00       $  ANS049:7E9 03 22 B1 48 00 00 00 00
  $  REQ050:7E1 03 22 3D 28 00 00 00 00       $  ANS050:7E9 03 22 3D 28 00 00 00 00
  $  REQ051:7E1 03 22 14 21 00 00 00 00       $  ANS051:7E9 03 22 14 21 00 00 00 00
  $  REQ052:7E1 03 22 B1 8D 00 00 00 00       $  ANS052:7E9 03 22 B1 8D 00 00 00 00
  $  REQ053:7E1 03 22 B1 5A 00 00 00 00       $  ANS053:7E9 03 22 B1 5A 00 00 00 00
  $  REQ054:7E1 03 22 34 A8 00 00 00 00       $  ANS054:7E9 03 22 34 A8 00 00 00 00
  $  REQ055:7E1 03 22 23 A9 00 00 00 00       $  ANS055:7E9 03 22 23 A9 00 00 00 00
  $  REQ056:7E1 03 22 B1 19 00 00 00 00       $  ANS056:7E9 03 22 B1 19 00 00 00 00
  $  REQ057:7E1 03 22 23 E8 00 00 00 00       $  ANS057:7E9 03 22 23 E8 00 00 00 00
  $  REQ058:7E1 03 22 23 E6 00 00 00 00       $  ANS058:7E9 03 22 23 E6 00 00 00 00
  $  REQ059:7E1 03 22 23 E4 00 00 00 00       $  ANS059:7E9 03 22 23 E4 00 00 00 00
  $  REQ060:7E1 03 22 23 E2 00 00 00 00       $  ANS060:7E9 03 22 23 E2 00 00 00 00
  $  REQ061:7E1 03 22 25 30 00 00 00 00       $  ANS061:7E9 03 22 25 30 00 00 00 00
  $  REQ062:7E1 03 22 23 F6 00 00 00 00       $  ANS062:7E9 03 22 23 F6 00 00 00 00
  $  REQ063:7E1 03 22 34 A9 00 00 00 00       $  ANS063:7E9 03 22 34 A9 00 00 00 00
  $  REQ064:7E1 03 22 23 AA 00 00 00 00       $  ANS064:7E9 03 22 23 AA 00 00 00 00
  $  REQ065:7E1 03 22 B1 1A 00 00 00 00       $  ANS065:7E9 03 22 B1 1A 00 00 00 00
  $  REQ066:7E1 03 22 23 E9 00 00 00 00       $  ANS066:7E9 03 22 23 E9 00 00 00 00
  $  REQ067:7E1 03 22 23 E7 00 00 00 00       $  ANS067:7E9 03 22 23 E7 00 00 00 00
  $  REQ068:7E1 03 22 23 E5 00 00 00 00       $  ANS068:7E9 03 22 23 E5 00 00 00 00
  $  REQ069:7E1 03 22 23 E3 00 00 00 00       $  ANS069:7E9 03 22 23 E3 00 00 00 00
  $  REQ070:7E1 03 22 25 31 00 00 00 00       $  ANS070:7E9 03 22 25 31 00 00 00 00
  $  REQ071:7E1 03 22 23 F7 00 00 00 00       $  ANS071:7E9 03 22 23 F7 00 00 00 00
  $  REQ072:7E1 03 22 B1 99 00 00 00 00       $  ANS072:7E9 03 22 B1 99 00 00 00 00
  $  REQ073:7E1 03 22 B1 9A 00 00 00 00       $  ANS073:7E9 03 22 B1 9A 00 00 00 00
  $  REQ074:7E1 03 22 B1 9D 00 00 00 00       $  ANS074:7E9 03 22 B1 9D 00 00 00 00
  $  REQ075:7E1 03 22 B1 9E 00 00 00 00       $  ANS075:7E9 03 22 B1 9E 00 00 00 00
  $  REQ076:7E1 03 22 B1 9B 00 00 00 00       $  ANS076:7E9 03 22 B1 9B 00 00 00 00
  $  REQ077:7E1 03 22 B1 9C 00 00 00 00       $  ANS077:7E9 03 22 B1 9C 00 00 00 00
  $  REQ078:7E1 03 22 B1 97 00 00 00 00       $  ANS078:7E9 03 22 B1 97 00 00 00 00
  $  REQ079:7E1 03 22 B1 98 00 00 00 00       $  ANS079:7E9 03 22 B1 98 00 00 00 00
  $  REQ080:7E1 03 22 23 F9 00 00 00 00       $  ANS080:7E9 03 22 23 F9 00 00 00 00
  $  REQ081:7E1 03 22 23 F8 00 00 00 00       $  ANS081:7E9 03 22 23 F8 00 00 00 00
  $  REQ082:7E1 03 22 23 C6 00 00 00 00       $  ANS082:7E9 03 22 23 C6 00 00 00 00
  $  REQ083:7E1 03 22 F1 3D 00 00 00 00       $  ANS083:7E9 03 22 F1 3D 00 00 00 00
  $  REQ084:7E1 03 22 F1 3B 00 00 00 00       $  ANS084:7E9 03 22 F1 3B 00 00 00 00
  $  REQ085:7E1 03 22 F1 3C 00 00 00 00       $  ANS085:7E9 03 22 F1 3C 00 00 00 00
  $  REQ086:7E1 03 22 F1 3A 00 00 00 00       $  ANS086:7E9 03 22 F1 3A 00 00 00 00
  $  REQ087:7E1 03 22 33 CE 00 00 00 00       $  ANS087:7E9 03 22 33 CE 00 00 00 00
  $  REQ088:7E1 03 22 33 BB 00 00 00 00       $  ANS088:7E9 03 22 33 BB 00 00 00 00
  $  REQ089:7E1 03 22 3D 4A 00 00 00 00       $  ANS089:7E9 03 22 3D 4A 00 00 00 00
  $  REQ090:7E1 03 22 23 AB 00 00 00 00       $  ANS090:7E9 03 22 23 AB 00 00 00 00
  $  REQ091:7E1 03 22 B1 18 00 00 00 00       $  ANS091:7E9 03 22 B1 18 00 00 00 00
  $  REQ092:7E1 03 22 B1 69 00 00 00 00       $  ANS092:7E9 03 22 B1 69 00 00 00 00
  $  REQ093:7E1 03 22 3A 85 00 00 00 00       $  ANS093:7E9 03 22 3A 85 00 00 00 00
  $  REQ094:7E1 03 22 3A 86 00 00 00 00       $  ANS094:7E9 03 22 3A 86 00 00 00 00
  $  REQ095:7E1 03 22 B1 4C 00 00 00 00       $  ANS095:7E9 03 22 B1 4C 00 00 00 00
  $  REQ096:7E1 03 22 B1 09 00 00 00 00       $  ANS096:7E9 03 22 B1 09 00 00 00 00
  $  REQ097:7E1 03 22 B1 08 00 00 00 00       $  ANS097:7E9 03 22 B1 08 00 00 00 00
  $  REQ098:7E1 03 22 B1 0B 00 00 00 00       $  ANS098:7E9 03 22 B1 0B 00 00 00 00
  $  REQ099:7E1 03 22 B1 05 00 00 00 00       $  ANS099:7E9 03 22 B1 05 00 00 00 00
  $  REQ100:7E1 03 22 B2 02 00 00 00 00       $  ANS100:7E9 03 22 B2 02 00 00 00 00
  $  REQ101:7E1 03 22 1C 26 00 00 00 00       $  ANS101:7E9 03 22 1C 26 00 00 00 00

  $  000.5VA电路高故障状态                                                       $    $          $    $  ANS000.BYTE004  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@002e;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@02b2;else if((((x&0xC0)>>6)>=0x02)&&(((x&0xC0)>>6)<=2))y=@0035;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@00ad;else y=@0035;
  $  001.5V电压1                                                                 $    $          $    $  ANS001.BYTE004  $  y=x*100;
  $  002.5V电压2                                                                 $    $          $    $  ANS002.BYTE004  $  y=x*100;
  $  003.9VA电路高故障状态                                                       $    $          $    $  ANS003.BYTE004  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@002e;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@02b2;else if((((x&0xC0)>>6)>=0x02)&&(((x&0xC0)>>6)<=2))y=@0035;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@00ad;else y=@0035;
  $  004.9V电压1                                                                 $    $          $    $  ANS004.BYTE004  $  y=x*100;
  $  005.9V电压2                                                                 $    $          $    $  ANS005.BYTE004  $  y=x*100;
  $  006.绝对电流预充压力                                                        $    $          $    $  ANS006.BYTE004  $  y=(x1*256+x2)*0.111111;
  $  007.变速器所需的净发动机扭矩的绝对值                                        $    $  Nm      $    $  ANS007.BYTE004  $  y=(x1*256+x2)*0.25;
  $  008.加速踏板位置                                                            $    $  %       $    $  ANS008.BYTE004  $  y=x*0.392156;
  $  009.加速器有效位置                                                          $    $          $    $  ANS009.BYTE004  $  y=x*0.392157;
  $  010.附件电压                                                                $    $  V       $    $  ANS010.BYTE004  $  y=(x1*256+x2)*0.001;
  $  011.蓄电池充电阈值量                                                        $    $  L       $    $  ANS011.BYTE004  $  y=(((x1*256+x2)&0x7FC)>>2)*0.001;
  $  012.蓄能器容积模型中使用的总泵输出                                          $    $  L       $    $  ANS011.BYTE005  $  y=(((x1*256+x2)&0x3FE)>>1)*0.001;
  $  013.累加器体积模型中使用的系统泄漏总量                                      $    $  L       $    $  ANS011.BYTE006  $  y=((x1*256+x2)&0x1FF)*0.001;
  $  014.活动轴                                                                  $    $          $    $  ANS012.BYTE004  $  if((((x&0x30)>>4)>=0x00)&&(((x&0x30)>>4)<=0))y=@0378;else if((((x&0x30)>>4)>=0x01)&&(((x&0x30)>>4)<=1))y=@0379;else if((((x&0x30)>>4)>=0x02)&&(((x&0x30)>>4)<=2))y=@037a;else if((((x&0x30)>>4)>=0x03)&&(((x&0x30)>>4)<=3))y=@037b;else y=@0035;
  $  015.离合器1状态                                                             $    $          $    $  ANS012.BYTE004  $  if((((x&0x0C)>>2)>=0x00)&&(((x&0x0C)>>2)<=0))y=@037c;else if((((x&0x0C)>>2)>=0x01)&&(((x&0x0C)>>2)<=1))y=@037d;else if((((x&0x0C)>>2)>=0x02)&&(((x&0x0C)>>2)<=2))y=@037e;else y=@0035;
  $  016.离合器2状态                                                             $    $          $    $  ANS012.BYTE004  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@037c;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@037d;else if(((x&0x03)>=0x02)&&((x&0x03)<=2))y=@037e;else y=@0035;
  $  017.奇数轴上的实际齿轮                                                      $    $          $    $  ANS013.BYTE004  $  if((((x&0xF0)>>4)>=0x00)&&(((x&0xF0)>>4)<=0))y=@0001;else if((((x&0xF0)>>4)>=0x01)&&(((x&0xF0)>>4)<=1))y=@0269;else if((((x&0xF0)>>4)>=0x02)&&(((x&0xF0)>>4)<=2))y=@026a;else if((((x&0xF0)>>4)>=0x03)&&(((x&0xF0)>>4)<=3))y=@026b;else if((((x&0xF0)>>4)>=0x04)&&(((x&0xF0)>>4)<=4))y=@026c;else if((((x&0xF0)>>4)>=0x05)&&(((x&0xF0)>>4)<=5))y=@026d;else if((((x&0xF0)>>4)>=0x06)&&(((x&0xF0)>>4)<=6))y=@026e;else if((((x&0xF0)>>4)>=0x07)&&(((x&0xF0)>>4)<=7))y=@0387;else if((((x&0xF0)>>4)>=0x0C)&&(((x&0xF0)>>4)<=12))y=@0388;else y=@0035;
  $  018.偶数轴上的实际齿轮                                                      $    $          $    $  ANS013.BYTE004  $  if(((x&0x0F)>=0x00)&&((x&0x0F)<=0))y=@0001;else if(((x&0x0F)>=0x01)&&((x&0x0F)<=1))y=@0269;else if(((x&0x0F)>=0x02)&&((x&0x0F)<=2))y=@026a;else if(((x&0x0F)>=0x03)&&((x&0x0F)<=3))y=@026b;else if(((x&0x0F)>=0x04)&&((x&0x0F)<=4))y=@026c;else if(((x&0x0F)>=0x05)&&((x&0x0F)<=5))y=@026d;else if(((x&0x0F)>=0x06)&&((x&0x0F)<=6))y=@026e;else if(((x&0x0F)>=0x07)&&((x&0x0F)<=7))y=@0387;else if(((x&0x0F)>=0x0C)&&((x&0x0F)<=12))y=@0388;else y=@0035;
  $  019.自动学习奇数离合器Q VFS流量请求                                         $    $  L/m     $    $  ANS014.BYTE004  $  y=x*0.046875;
  $  020.ATF温度                                                                 $    $          $    $  ANS015.BYTE004  $  y=(x1*256+x2)*0.0625;
  $  021.OPS模式的当前状态                                                       $    $          $    $  ANS016.BYTE004  $  if((x>=0x00)&&(x<=0))y=@0389;else if((x>=0x01)&&(x<=1))y=@038a;else if((x>=0x02)&&(x<=2))y=@038b;else if((x>=0x04)&&(x<=4))y=@038c;else if((x>=0x08)&&(x<=8))y=@038d;else if((x>=0x17)&&(x<=23))y=@038e;else if((x>=0x19)&&(x<=25))y=@038f;else if((x>=0x53)&&(x<=83))y=@0390;else if((x>=0x65)&&(x<=101))y=@0391;else if(x==0xFF) y=@0392;else y=@0035;
  $  022.OPS测试状态的位编码信息                                                 $    $          $    $  ANS016.BYTE005  $  y=x;
  $  023.测量W相线电压                                                           $    $  V       $    $  ANS017.BYTE004  $  y=(x1*256+x2)*0.001;
  $  024.测量U相线电压                                                           $    $  V       $    $  ANS017.BYTE006  $  y=(x1*256+x2)*0.001;
  $  025.测量V相线电压                                                           $    $  V       $    $  ANS017.BYTE008  $  y=(x1*256+x2)*0.001;
  $  026.电机相位SCG滤波时间                                                     $    $          $    $  ANS017.BYTE010  $  y=(x1*256+x2);
  $  027.实际应用的电机负荷                                                      $    $  %       $    $  ANS017.BYTE012  $  y=(x1*256+x2)*0.1;
  $  028.测量实际电机电流                                                        $    $  A       $    $  ANS017.BYTE014  $  y=(x1*256+x2)*0.01;
  $  029.电机开路故障滤波时间                                                    $    $          $    $  ANS017.BYTE016  $  y=(x1*256+x2);
  $  030.应用电机负载模式                                                        $    $          $    $  ANS017.BYTE018  $  y=x;
  $  031.电机相稳态过滤时间                                                      $    $          $    $  ANS017.BYTE019  $  y=(x1*256+x2);
  $  032.按频率电机速度                                                          $    $  Hz      $    $  ANS017.BYTE021  $  y=(x1*256+x2)*0.25;
  $  033.电机仍处于状态滤波时间                                                  $    $          $    $  ANS017.BYTE023  $  y=(x1*256+x2);
  $  034.电池电机上提供的HP电压                                                  $    $  V       $    $  ANS018.BYTE004  $  y=(x1*256+x2)*0.001;
  $  035.硬件关闭电流的当前计数器                                                $    $          $    $  ANS019.BYTE004  $  y=(x1*256+x2);
  $  036.由硬件关闭当前指标                                                      $    $          $    $  ANS019.BYTE006  $  y=x;
  $  037.测量PCB温度                                                             $    $          $    $  ANS020.BYTE004  $  y=(x1*256+x2)*0.1;
  $  038.测量NTC温度                                                             $    $          $    $  ANS020.BYTE006  $  y=(x1*256+x2)*0.1;
  $  039.奇数输入轴转速的诊断电压1                                               $    $  V       $    $  ANS021.BYTE004  $  y=(x1*256+x2)*0.001;
  $  040.奇数输入轴转速的诊断电压2                                               $    $  V       $    $  ANS022.BYTE004  $  y=(x1*256+x2)*0.001;
  $  041.KL30 HP诊断电容前的电压                                                 $    $  V       $    $  ANS023.BYTE004  $  y=(x1*256+x2)*0.001;
  $  042.奇数输入轴转速的诊断电压3                                               $    $  V       $    $  ANS024.BYTE004  $  y=(x1*256+x2)*0.001;
  $  043.HSD1电压                                                                $    $  V       $    $  ANS025.BYTE004  $  y=(x1*256+x2)*0.001;
  $  044.HSD2电压                                                                $    $  V       $    $  ANS026.BYTE004  $  y=(x1*256+x2)*0.001;
  $  045.电瓶电压                                                                $    $  V       $    $  ANS027.BYTE004  $  y=(x1*256+x2)*0.001;
  $  046.制动踏板位置                                                            $    $  %       $    $  ANS028.BYTE004  $  y=x*0.392156;
  $  047.变速器齿轮                                                              $    $          $    $  ANS029.BYTE004  $  if((x>=0x00)&&(x<=0))y=@023f;else if((x>=0x02)&&(x<=2))y=@0001;else if((x>=0x10)&&(x<=16))y=@0002;else if((x>=0x11)&&(x<=17))y=@0269;else if((x>=0x1A)&&(x<=26))y=@026a;else if((x>=0x1B)&&(x<=27))y=@02b6;else if((x>=0x1C)&&(x<=28))y=@02b7;else if((x>=0x1D)&&(x<=29))y=@026d;else if((x>=0x1E)&&(x<=30))y=@026e;else if((x>=0x1F)&&(x<=31))y=@0387;else y=@0035;
  $  048.变速箱高位驱动器1打开                                                   $    $          $    $  ANS029.BYTE005  $  if((((x&0x80)>>7)>=0x00)&&(((x&0x80)>>7)<=0))y=@00c9;else if((((x&0x80)>>7)>=0x01)&&(((x&0x80)>>7)<=1))y=@00ca;else y=@0035;
  $  049.变速箱高位驱动器2打开                                                   $    $          $    $  ANS029.BYTE005  $  if((((x&0x40)>>6)>=0x00)&&(((x&0x40)>>6)<=0))y=@00c9;else if((((x&0x40)>>6)>=0x01)&&(((x&0x40)>>6)<=1))y=@00ca;else y=@0035;
  $  050.DCT离合器扭矩接合位置（咬合点）学习状态                                 $    $          $    $  ANS029.BYTE005  $  if((((x&0x20)>>5)>=0x00)&&(((x&0x20)>>5)<=0))y=@028e;else if((((x&0x20)>>5)>=0x01)&&(((x&0x20)>>5)<=1))y=@02cf;else y=@0035;
  $  051.传输EOL与服务快速学习状态                                               $    $          $    $  ANS029.BYTE006  $  if((x>=0x00)&&(x<=0))y=@037f;else if((x>=0x01)&&(x<=1))y=@02e1;else if((x>=0x02)&&(x<=2))y=@02e2;else if((x>=0x03)&&(x<=3))y=@02e3;else if((x>=0x04)&&(x<=4))y=@02e4;else if((x>=0x05)&&(x<=5))y=@02e5;else if((x>=0x06)&&(x<=6))y=@02e6;else if((x>=0x07)&&(x<=7))y=@02e7;else if((x>=0x08)&&(x<=8))y=@02e8;else if((x>=0x09)&&(x<=9))y=@02e9;else if((x>=0x0A)&&(x<=10))y=@02ea;else if((x>=0x0B)&&(x<=11))y=@0380;else if((x>=0x0C)&&(x<=12))y=@02ec;else if((x>=0x0D)&&(x<=13))y=@02ed;else if((x>=0x0E)&&(x<=14))y=@02ee;else if((x>=0x0F)&&(x<=15))y=@02ef;else if((x>=0x10)&&(x<=16))y=@02f6;else if((x>=0x11)&&(x<=17))y=@02f7;else if((x>=0x12)&&(x<=18))y=@0381;else if((x>=0x13)&&(x<=19))y=@0382;else if((x>=0x14)&&(x<=20))y=@0300;else if((x>=0x15)&&(x<=21))y=@0301;else if((x>=0x16)&&(x<=22))y=@0383;else if((x>=0x17)&&(x<=23))y=@0384;else if((x>=0x18)&&(x<=24))y=@0304;else if((x>=0x19)&&(x<=25))y=@0385;else if((x>=0x1A)&&(x<=26))y=@02fa;else if((x>=0x1B)&&(x<=27))y=@02fb;else if((x>=0x1C)&&(x<=28))y=@02fc;else if((x>=0x1D)&&(x<=29))y=@02fd;else if((x>=0x1E)&&(x<=30))y=@02fe;else if((x>=0x1F)&&(x<=31))y=@02ff;else y=@0035;
  $  052.DCT离合器1扭矩                                                          $    $          $    $  ANS030.BYTE004  $  y=(x1*256+x2)*0.25;
  $  053.DCT离合器2扭矩                                                          $    $          $    $  ANS030.BYTE006  $  y=(x1*256+x2)*0.25;
  $  054.DCT温度柱状图数据重置触发器                                             $    $          $    $  ANS030.BYTE008  $  if(((x&0x20)>>5)==0) y=@00c9;else y=@00ca;
  $  055.变速箱温度计数器复位触发器                                              $    $          $    $  ANS030.BYTE008  $  if(((x&0x08)>>3)==0) y=@00c9;else y=@00ca;
  $  056.变速器蓄能器压力恢复触发器                                              $    $          $    $  ANS030.BYTE008  $  if(((x&0x04)>>2)==0) y=@00c9;else y=@00ca;
  $  057.变速器空气净化状态                                                      $    $          $    $  ANS030.BYTE004  $  if((x>=0x00)&&(x<=0))y=@0386;else if((x>=0x01)&&(x<=1))y=@00b2;else if((x>=0x02)&&(x<=2))y=@028d;else if((x>=0x03)&&(x<=3))y=@002e;else y=@0035;
  $  058.变速箱蓄能器泄压状态                                                    $    $          $    $  ANS030.BYTE008  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@02ce;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@00b2;else if(((x&0x03)>=0x02)&&((x&0x03)<=2))y=@028d;else if(((x&0x03)>=0x03)&&((x&0x03)<=3))y=@002e;else y=@0035;
  $  059.DCT离合器1位置                                                          $    $  mm      $    $  ANS031.BYTE004  $  y=x*0.0784;
  $  060.DCT离合器2位置                                                          $    $  mm      $    $  ANS031.BYTE005  $  y=x*0.0784;
  $  061.电池接触器状态                                                          $    $          $    $  ANS031.BYTE006  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@0028;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@0355;else if((((x&0xC0)>>6)>=0x02)&&(((x&0xC0)>>6)<=2))y=@000f;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@023f;else y=@0035;
  $  062.DCT离合器1实际状态                                                      $    $          $    $  ANS031.BYTE007  $  if((x>=0x00)&&(x<=0))y=@0339;else if((x>=0x01)&&(x<=1))y=@031a;else if((x>=0x02)&&(x<=2))y=@0356;else if((x>=0x03)&&(x<=3))y=@01e9;else if((x>=0x04)&&(x<=4))y=@0357;else y=@0035;
  $  063.DCT离合器2实际状态                                                      $    $          $    $  ANS031.BYTE008  $  if((x>=0x00)&&(x<=0))y=@0339;else if((x>=0x01)&&(x<=1))y=@031a;else if((x>=0x02)&&(x<=2))y=@0356;else if((x>=0x03)&&(x<=3))y=@01e9;else if((x>=0x04)&&(x<=4))y=@0357;else y=@0035;
  $  064.离合器1根据FFD + PID流量控制计算计算离合器流量                          $    $  L/m     $    $  ANS032.BYTE004  $  y=x*0.046875;
  $  065.离合器咬合点学习会聚状态离合器1                                         $    $          $    $  ANS033.BYTE004  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@0358;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@0359;else if(((x&0x03)>=0x02)&&((x&0x03)<=2))y=@035a;else if(((x&0x03)>=0x03)&&((x&0x03)<=3))y=@035b;else y=@0035;
  $  066.离合器咬合点学习会聚状态离合器2                                         $    $          $    $  ANS033.BYTE005  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@0358;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@0359;else if(((x&0x03)>=0x02)&&((x&0x03)<=2))y=@035a;else if(((x&0x03)>=0x03)&&((x&0x03)<=3))y=@035b;else y=@0035;
  $  067.基于流量的命令变化计算的奇数离合器速度                                  $    $          $    $  ANS034.BYTE004  $  y=(((x1*256+x2)&0x7FF0)>>4)*0.1;
  $  068.基于流量的命令变化计算均偶数离合器速度                                  $    $          $    $  ANS034.BYTE005  $  y=((x1*256+x2)&0x7FF)*0.1;
  $  069.离合器位置传感器高压电气故障状态标志                                    $    $          $    $  ANS035.BYTE004  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@002e;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@02b2;else if((((x&0xC0)>>6)>=0x02)&&(((x&0xC0)>>6)<=2))y=@0035;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@00ad;else y=@0035;
  $  070.离合器2压力以保持最大离合器扭矩                                         $    $  kPa     $    $  ANS036.BYTE004  $  y=(x1*256+x2)*0.125;
  $  071.离合器1压力以保持最大离合器扭矩                                         $    $  kPa     $    $  ANS036.BYTE006  $  y=(x1*256+x2)*0.125;
  $  072.离合器协调器的当前状态                                                  $    $          $    $  ANS037.BYTE004  $  if((((x&0xF0)>>4)>=0x01)&&(((x&0xF0)>>4)<=1))y=@035c;else if((((x&0xF0)>>4)>=0x02)&&(((x&0xF0)>>4)<=2))y=@035d;else if((((x&0xF0)>>4)>=0x03)&&(((x&0xF0)>>4)<=3))y=@035e;else if((((x&0xF0)>>4)>=0x04)&&(((x&0xF0)>>4)<=4))y=@035f;else if((((x&0xF0)>>4)>=0x05)&&(((x&0xF0)>>4)<=5))y=@0360;else if((((x&0xF0)>>4)>=0x06)&&(((x&0xF0)>>4)<=6))y=@0361;else if((((x&0xF0)>>4)>=0x07)&&(((x&0xF0)>>4)<=7))y=@0362;else if((((x&0xF0)>>4)>=0x08)&&(((x&0xF0)>>4)<=8))y=@0363;else y=@0035;
  $  073.线路控制状态                                                            $    $          $    $  ANS037.BYTE004  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@0350;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@0351;else if(((x&0x03)>=0x02)&&((x&0x03)<=2))y=@0352;else if(((x&0x03)>=0x03)&&((x&0x03)<=3))y=@0353;else y=@0035;
  $  074.离合器压力保持最大离合器扭矩并且这一点是蓄能器容积/压力方案中的P2       $    $          $    $  ANS038.BYTE004  $  y=(x1*256+x2)*0.111111;
  $  075.离合器1通过离合器位置估计压力增加                                       $    $  kPa     $    $  ANS039.BYTE004  $  y=(x1*256+x2)*0.125;
  $  076.离合器1行程量                                                           $    $          $    $  ANS040.BYTE004  $  y=(x1*256+x2)*9*0.000001;
  $  077.离合器2通过离合器位置估计压力增加                                       $    $  kPa     $    $  ANS041.BYTE006  $  y=(x1*256+x2)*0.125;
  $  078.离合器2行程量                                                           $    $          $    $  ANS042.BYTE004  $  y=(x1*256+x2)*9*0.000001;
  $  079.DCT离合器1位置指令                                                      $    $  Nm      $    $  ANS043.BYTE004  $  y=x*0.0784;
  $  080.DCT离合器2位置指令                                                      $    $  Nm      $    $  ANS044.BYTE004  $  y=x*0.0784;
  $  081.超过离合器1的最大和最小极限后来自前馈PID流量控制的指令流量              $    $  L/m     $    $  ANS045.BYTE004  $  y=x*0.046875;
  $  082.超过离合器2的最大和最小极限后来自前馈PID流量控制的指令流量              $    $  L/m     $    $  ANS046.BYTE004  $  y=x*0.046875;
  $  083.控制模块电压                                                            $    $  V       $    $  ANS047.BYTE004  $  y=(x1*256+x2)*0.001;
  $  084.控制叉速度                                                              $    $          $    $  ANS048.BYTE004  $  y=((x1*256+x2)&0x7FFF)*0.1;
  $  085.在逻辑阀滞留故障检测中控制叉初始位置                                    $    $  mm      $    $  ANS049.BYTE004  $  y=x*0.09375;
  $  086.点火关闭控制器关闭触发器                                                $    $          $    $  ANS050.BYTE004  $  if(((x&0x80)>>7)==0) y=@00c9;else y=@00ca;
  $  087.立即控制器关闭触发器                                                    $    $          $    $  ANS050.BYTE004  $  if(((x&0x40)>>6)==0) y=@00c9;else y=@00ca;
  $  088.曲柄位置传感器中等解析度发动机转速                                      $    $          $    $  ANS051.BYTE004  $  y=(x1*256+x2);
  $  089.当SS适应更新时当前离合器扭矩位置增量                                    $    $          $    $  ANS052.BYTE004  $  y=x*0.04;
  $  090.离中性位置的当前距离                                                    $    $  mm      $    $  ANS053.BYTE004  $  y=x*0.09375;
  $  091.DCT离合器1指令状态                                                      $    $          $    $  ANS054.BYTE004  $  if((x>=0x00)&&(x<=0))y=@0339;else if((x>=0x01)&&(x<=1))y=@0354;else y=@0035;
  $  092.DCT离合器1指令转矩                                                      $    $  Nm      $    $  ANS055.BYTE004  $  y=(x1*256+x2)*0.25;
  $  093.基于期望位置的双存储估计扭矩命令                                        $    $  Nm      $    $  ANS056.BYTE004  $  y=(x1*256+x2)*0.25;
  $  094.DCT离合器1初始应用位置                                                  $    $          $    $  ANS057.BYTE004  $  y=x*0.078431;
  $  095.DCT离合器1位置                                                          $    $  mm      $    $  ANS058.BYTE004  $  y=x*0.0784;
  $  096.DCT离合器1位置传感器占空比                                              $    $          $    $  ANS059.BYTE004  $  y=x*0.392;
  $  097.DCT离合器1滑动                                                          $    $          $    $  ANS060.BYTE004  $  y=(x1*256+x2)*0.125;
  $  098.离合器1中等扭矩应用时的最小线性位置                                     $    $          $    $  ANS061.BYTE004  $  y=x*0.078431;
  $  099.离合器1高扭矩应用时的最小线性位置                                       $    $          $    $  ANS061.BYTE005  $  y=x*0.078431;
  $  100.DCT离合器1扭矩接合位置                                                  $    $  mm      $    $  ANS062.BYTE004  $  y=x*0.08;
  $  101.DCT离合器2指令状态                                                      $    $          $    $  ANS063.BYTE004  $  if((x>=0x00)&&(x<=0))y=@0339;else if((x>=0x01)&&(x<=1))y=@0354;else y=@0035;
  $  102.DCT离合器2指令转矩                                                      $    $  Nm      $    $  ANS064.BYTE004  $  y=(x1*256+x2)*0.25;
  $  103.基于期望位置的双存储估计扭矩命令                                        $    $  Nm      $    $  ANS065.BYTE004  $  y=(x1*256+x2)*0.25;
  $  104.DCT离合器2初始应用位置                                                  $    $          $    $  ANS066.BYTE004  $  y=x*0.078431;
  $  105.DCT离合器2位置                                                          $    $  mm      $    $  ANS067.BYTE005  $  y=x*0.0784;
  $  106.DCT离合器2位置传感器占空比                                              $    $          $    $  ANS068.BYTE004  $  y=x*0.392;
  $  107.DCT离合器2滑动                                                          $    $          $    $  ANS069.BYTE004  $  y=(x1*256+x2)*0.125;
  $  108.离合器2中等扭矩应用时的最小线性位置                                     $    $          $    $  ANS070.BYTE004  $  y=x*0.078431;
  $  109.离合器2高扭矩应用时的最小线性位置                                       $    $          $    $  ANS070.BYTE005  $  y=x*0.078431;
  $  110.DCT离合器2扭矩接合位置                                                  $    $  mm      $    $  ANS071.BYTE004  $  y=x*0.08;
  $  111.DCT离合器适应AEC环路值                                                  $    $          $    $  ANS072.BYTE004  $  y=(x&0x0F)-8;
  $  112.DCT离合器适应AEC环路价值指数                                            $    $          $    $  ANS073.BYTE004  $  y=x;
  $  113.DCT离合器适应聚合开关回路值                                             $    $          $    $  ANS074.BYTE004  $  y=(x&0x01);
  $  114.DCT离合器适应聚合开关回路值指数                                         $    $          $    $  ANS075.BYTE004  $  y=x;
  $  115.DCT离合器适应限制计数器循环值                                           $    $          $    $  ANS076.BYTE004  $  y=(x&0x07)-3;
  $  116.DCT离合器适应极限计数器循环值指数                                       $    $          $    $  ANS077.BYTE004  $  y=x;
  $  117.DCT离合器适应位置循环显示                                               $    $          $    $  ANS078.BYTE004  $  y=x*0.078431;
  $  118.DCT离合器适应位置循环显示索引                                           $    $          $    $  ANS079.BYTE004  $  y=x;
  $  119.DCT离合器扭矩接合位置（咬合点）学习抑制原因                             $    $          $    $  ANS080.BYTE004  $  if((x>=0x00)&&(x<=0))y=@031c;else if((x>=0x01)&&(x<=1))y=@031d;else if((x>=0x02)&&(x<=2))y=@031e;else if((x>=0x03)&&(x<=3))y=@031f;else if((x>=0x04)&&(x<=4))y=@0320;else if((x>=0x05)&&(x<=5))y=@0321;else if((x>=0x06)&&(x<=6))y=@0322;else if((x>=0x07)&&(x<=7))y=@0323;else if((x>=0x08)&&(x<=8))y=@0324;else if((x>=0x09)&&(x<=9))y=@0325;else y=@0035;
  $  120.DCT离合器扭矩接合位置（咬合点）学习状态                                 $    $          $    $  ANS081.BYTE004  $  if(x==0x00)y=@028e;else if(x==0x01)y=@03ce;else if(x==0x02)y=@03cf;else if(x==0x03)y=@03d0;else if(x==0x04)y=@03d1;else if(x==0x05)y=@03d2;else if(x==0x06)y=@03d3;else if(x==0x07)y=@03d4;else if(x==0x08)y=@03d5;else if(x==0x09)y=@03d6;else y=@01a9;
  $  121.启用条件中止原因                                                        $    $          $    $  ANS082.BYTE004  $  if((((x&0xF0)>>4)>=0x00)&&(((x&0xF0)>>4)<=0))y=@0309;else if((((x&0xF0)>>4)>=0x01)&&(((x&0xF0)>>4)<=1))y=@0326;else if((((x&0xF0)>>4)>=0x02)&&(((x&0xF0)>>4)<=2))y=@0327;else if((((x&0xF0)>>4)>=0x03)&&(((x&0xF0)>>4)<=3))y=@0328;else if((((x&0xF0)>>4)>=0x04)&&(((x&0xF0)>>4)<=4))y=@0329;else if((((x&0xF0)>>4)>=0x05)&&(((x&0xF0)>>4)<=5))y=@032a;else if((((x&0xF0)>>4)>=0x06)&&(((x&0xF0)>>4)<=6))y=@032b;else if((((x&0xF0)>>4)>=0x07)&&(((x&0xF0)>>4)<=7))y=@032c;else if((((x&0xF0)>>4)>=0x08)&&(((x&0xF0)>>4)<=8))y=@032d;else if((((x&0xF0)>>4)>=0x09)&&(((x&0xF0)>>4)<=9))y=@0373;else y=@0035;
  $  122.换档拨叉空挡和参与的位置学习中止原因                                    $    $          $    $  ANS082.BYTE004  $  if(((x&0x0F)>=0x00)&&((x&0x0F)<=0))y=@0309;else if(((x&0x0F)>=0x01)&&((x&0x0F)<=1))y=@0374;else if(((x&0x0F)>=0x02)&&((x&0x0F)<=2))y=@0375;else if(((x&0x0F)>=0x03)&&((x&0x0F)<=3))y=@0376;else if(((x&0x0F)>=0x04)&&((x&0x0F)<=4))y=@0377;else y=@0035;
  $  123.换档拨叉非空档时离合器学习中止原因                                      $    $          $    $  ANS082.BYTE005  $  if((((x&0x80)>>7)>=0x00)&&(((x&0x80)>>7)<=0))y=@0309;else if((((x&0x80)>>7)>=0x01)&&(((x&0x80)>>7)<=1))y=@0364;else y=@0035;
  $  124.离合器脱离位置学习中止原因                                              $    $          $    $  ANS082.BYTE005  $  if((((x&0x60)>>5)>=0x00)&&(((x&0x60)>>5)<=0))y=@0309;else if((((x&0x60)>>5)>=0x01)&&(((x&0x60)>>5)<=1))y=@0334;else y=@0035;
  $  125.离合器咬合点学习中止原因                                                $    $          $    $  ANS082.BYTE005  $  if(((x&0x1F)>=0x00)&&((x&0x1F)<=0))y=@0309;else if(((x&0x1F)>=0x01)&&((x&0x1F)<=1))y=@0365;else if(((x&0x1F)>=0x02)&&((x&0x1F)<=2))y=@0366;else if(((x&0x1F)>=0x03)&&((x&0x1F)<=3))y=@0367;else if(((x&0x1F)>=0x04)&&((x&0x1F)<=4))y=@0325;else if(((x&0x1F)>=0x05)&&((x&0x1F)<=5))y=@0368;else if(((x&0x1F)>=0x06)&&((x&0x1F)<=6))y=@0369;else if(((x&0x1F)>=0x07)&&((x&0x1F)<=7))y=@036a;else y=@0035;
  $  126.离合器空点学习中止原因                                                  $    $          $    $  ANS082.BYTE006  $  if((((x&0xF0)>>4)>=0x00)&&(((x&0xF0)>>4)<=0))y=@0309;else if((((x&0xF0)>>4)>=0x01)&&(((x&0xF0)>>4)<=1))y=@036b;else if((((x&0xF0)>>4)>=0x02)&&(((x&0xF0)>>4)<=2))y=@0336;else if((((x&0xF0)>>4)>=0x03)&&(((x&0xF0)>>4)<=3))y=@0337;else if((((x&0xF0)>>4)>=0x04)&&(((x&0xF0)>>4)<=4))y=@0338;else y=@0035;
  $  127.离合器初始应用位置（吻点）和换档叉同步位置学习中止原因                  $    $          $    $  ANS082.BYTE006  $  if(((x&0x0F)>=0x00)&&((x&0x0F)<=0))y=@0309;else if(((x&0x0F)>=0x01)&&((x&0x0F)<=1))y=@036c;else if(((x&0x0F)>=0x02)&&((x&0x0F)<=2))y=@036d;else if(((x&0x0F)>=0x03)&&((x&0x0F)<=3))y=@036e;else if(((x&0x0F)>=0x04)&&((x&0x0F)<=4))y=@036f;else if(((x&0x0F)>=0x05)&&((x&0x0F)<=5))y=@0370;else y=@0035;
  $  128.离合器流动点学习中止原因                                                $    $          $    $  ANS082.BYTE007  $  if((((x&0xF0)>>4)>=0x00)&&(((x&0xF0)>>4)<=0))y=@0309;else if((((x&0xF0)>>4)>=0x01)&&(((x&0xF0)>>4)<=1))y=@030f;else if((((x&0xF0)>>4)>=0x02)&&(((x&0xF0)>>4)<=2))y=@0310;else if((((x&0xF0)>>4)>=0x03)&&(((x&0xF0)>>4)<=3))y=@0311;else y=@0035;
  $  129.蓄能器预充压力学习中止原因                                              $    $          $    $  ANS082.BYTE007  $  if(((x&0x0F)>=0x00)&&((x&0x0F)<=0))y=@0309;else if(((x&0x0F)>=0x01)&&((x&0x0F)<=1))y=@0371;else if(((x&0x0F)>=0x02)&&((x&0x0F)<=2))y=@0313;else if(((x&0x0F)>=0x03)&&((x&0x0F)<=3))y=@0372;else y=@0035;
  $  130.蓄能器预充电压力学习结果                                                $    $          $    $  ANS083.BYTE004  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@004c;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@028d;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@002e;else y=@0035;
  $  131.DCT EOL和服务快速学习结果-累加器预充电压力                              $    $  kPa     $    $  ANS083.BYTE005  $  y=(x1*256+x2)*0.137;
  $  132.离合器1分离位置学习结果                                                 $    $          $    $  ANS084.BYTE004  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@004c;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@028d;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@002e;else y=@0035;
  $  133.离合器1初始位置（吻合点）学习结果                                       $    $          $    $  ANS084.BYTE004  $  if((((x&0x30)>>4)>=0x00)&&(((x&0x30)>>4)<=0))y=@004c;else if((((x&0x30)>>4)>=0x01)&&(((x&0x30)>>4)<=1))y=@028d;else if((((x&0x30)>>4)>=0x03)&&(((x&0x30)>>4)<=3))y=@002e;else y=@0035;
  $  134.离合器1扭矩接合位置（咬合点）学习结果                                   $    $          $    $  ANS084.BYTE004  $  if((((x&0x0C)>>2)>=0x00)&&(((x&0x0C)>>2)<=0))y=@004c;else if((((x&0x0C)>>2)>=0x01)&&(((x&0x0C)>>2)<=1))y=@028d;else if((((x&0x0C)>>2)>=0x03)&&(((x&0x0C)>>2)<=3))y=@002e;else y=@0035;
  $  135.离合器1流量螺线管零点学习结果                                           $    $          $    $  ANS084.BYTE004  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@004c;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@028d;else if(((x&0x03)>=0x03)&&((x&0x03)<=3))y=@002e;else y=@0035;
  $  136.离合器1压力位置学习结果                                                 $    $          $    $  ANS084.BYTE005  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@004c;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@028d;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@002e;else y=@0035;
  $  137.离合器1流量点学习结果                                                   $    $          $    $  ANS084.BYTE005  $  if((((x&0x30)>>4)>=0x00)&&(((x&0x30)>>4)<=0))y=@004c;else if((((x&0x30)>>4)>=0x01)&&(((x&0x30)>>4)<=1))y=@028d;else if((((x&0x30)>>4)>=0x03)&&(((x&0x30)>>4)<=3))y=@002e;else y=@0035;
  $  138.离合器1流量点学习温度范围                                               $    $          $    $  ANS084.BYTE005  $  if((((x&0x0C)>>2)>=0x00)&&(((x&0x0C)>>2)<=0))y=@03a6;else if((((x&0x0C)>>2)>=0x01)&&(((x&0x0C)>>2)<=1))y=@03a7;else if((((x&0x0C)>>2)>=0x02)&&(((x&0x0C)>>2)<=2))y=@03a8;else if((((x&0x0C)>>2)>=0x03)&&(((x&0x0C)>>2)<=3))y=@03a9;else if((((x&0x0C)>>2)>=0x04)&&(((x&0x0C)>>2)<=4))y=@03aa;else if((((x&0x0C)>>2)>=0x05)&&(((x&0x0C)>>2)<=5))y=@03ab;else if((((x&0x0C)>>2)>=0x06)&&(((x&0x0C)>>2)<=6))y=@03ac;else y=@0035;
  $  139.离合器1分离位置                                                         $    $  mm      $    $  ANS084.BYTE006  $  y=x*0.15625;
  $  140.离合器1初始位置（吻合点）                                               $    $  mm      $    $  ANS084.BYTE007  $  y=x*0.0784;
  $  141.离合器1扭矩接合位置（咬合点）                                           $    $  mm      $    $  ANS084.BYTE008  $  y=x*0.0784;
  $  142.离合器2分离位置学习结果                                                 $    $          $    $  ANS085.BYTE004  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@004c;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@028d;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@002e;else y=@0035;
  $  143.离合器2初始位置（吻合点）学习结果                                       $    $          $    $  ANS085.BYTE004  $  if((((x&0x30)>>4)>=0x00)&&(((x&0x30)>>4)<=0))y=@004c;else if((((x&0x30)>>4)>=0x01)&&(((x&0x30)>>4)<=1))y=@028d;else if((((x&0x30)>>4)>=0x03)&&(((x&0x30)>>4)<=3))y=@002e;else y=@0035;
  $  144.离合器2扭矩接合位置（咬合点）学习结果                                   $    $          $    $  ANS085.BYTE004  $  if((((x&0x0C)>>2)>=0x00)&&(((x&0x0C)>>2)<=0))y=@004c;else if((((x&0x0C)>>2)>=0x01)&&(((x&0x0C)>>2)<=1))y=@028d;else if((((x&0x0C)>>2)>=0x03)&&(((x&0x0C)>>2)<=3))y=@002e;else y=@0035;
  $  145.离合器2流量螺线管零点-学习结果                                          $    $          $    $  ANS085.BYTE004  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@004c;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@028d;else if(((x&0x03)>=0x03)&&((x&0x03)<=3))y=@002e;else y=@0035;
  $  146.离合器2压力位置学习结果                                                 $    $          $    $  ANS085.BYTE005  $  if((((x&0xC0)>>6)>=0x00)&&(((x&0xC0)>>6)<=0))y=@004c;else if((((x&0xC0)>>6)>=0x01)&&(((x&0xC0)>>6)<=1))y=@028d;else if((((x&0xC0)>>6)>=0x03)&&(((x&0xC0)>>6)<=3))y=@002e;else y=@0035;
  $  147.离合器2流量点学习结果                                                   $    $          $    $  ANS085.BYTE005  $  if((((x&0x30)>>4)>=0x00)&&(((x&0x30)>>4)<=0))y=@004c;else if((((x&0x30)>>4)>=0x01)&&(((x&0x30)>>4)<=1))y=@028d;else if((((x&0x30)>>4)>=0x03)&&(((x&0x30)>>4)<=3))y=@002e;else y=@0035;
  $  148.离合器2流量点学习温度范围                                               $    $          $    $  ANS085.BYTE005  $  if((((x&0x0C)>>2)>=0x00)&&(((x&0x0C)>>2)<=0))y=@03a6;else if((((x&0x0C)>>2)>=0x01)&&(((x&0x0C)>>2)<=1))y=@03a7;else if((((x&0x0C)>>2)>=0x02)&&(((x&0x0C)>>2)<=2))y=@03a8;else if((((x&0x0C)>>2)>=0x03)&&(((x&0x0C)>>2)<=3))y=@03a9;else if((((x&0x0C)>>2)>=0x04)&&(((x&0x0C)>>2)<=4))y=@03aa;else if((((x&0x0C)>>2)>=0x05)&&(((x&0x0C)>>2)<=5))y=@03ab;else if((((x&0x0C)>>2)>=0x06)&&(((x&0x0C)>>2)<=6))y=@03ac;else y=@0035;
  $  149.离合器2分离位置                                                         $    $  mm      $    $  ANS085.BYTE006  $  y=x*0.15625;
  $  150.离合器2初始位置（吻合点）                                               $    $  mm      $    $  ANS085.BYTE007  $  y=x*0.0784;
  $  151.离合器2扭矩接合位置（咬合点）                                           $    $  mm      $    $  ANS085.BYTE008  $  y=x*0.0784;
  $  152.拨叉中立和占线位置学习结果                                              $    $          $    $  ANS086.BYTE004  $  if(((x&0xC0)>>6)==0) y=@004c;else if(((x&0xC0)>>6)==1) y=@028d;else if(((x&0xC0)>>6)==3) y=@002e;else y=@0035;
  $  153.拨叉同步位置学习结果                                                    $    $          $    $  ANS086.BYTE004  $  if(((x&0x30)>>4)==0) y=@004c;else if(((x&0x30)>>4)==1) y=@028d;else if(((x&0x30)>>4)==3) y=@002e;else y=@0035;
  $  154.拨叉1前啮合位置                                                         $    $  mm      $    $  ANS086.BYTE005  $  y=x*0.09375-12;
  $  155.换档拨叉1向前同步位置                                                   $    $  mm      $    $  ANS086.BYTE006  $  y=x*0.09375-12;
  $  156.换档拨叉1中立位置                                                       $    $  mm      $    $  ANS086.BYTE007  $  y=x*0.09375-12;
  $  157.换档拨叉1向后同步位置                                                   $    $  mm      $    $  ANS086.BYTE008  $  y=x*0.09375-12;
  $  158.换档拨叉1向后接合位置                                                   $    $  mm      $    $  ANS086.BYTE009  $  y=x*0.09375-12;
  $  159.拨叉2前啮合位置                                                         $    $  mm      $    $  ANS086.BYTE010  $  y=x*0.09375-12;
  $  160.换档拨叉2向前同步位置                                                   $    $  mm      $    $  ANS086.BYTE011  $  y=x*0.09375-12;
  $  161.换档拨叉2中立位置                                                       $    $  mm      $    $  ANS086.BYTE012  $  y=x*0.09375-12;
  $  162.换档拨叉2向后同步位置                                                   $    $  mm      $    $  ANS086.BYTE013  $  y=x*0.09375-12;
  $  163.换档拨叉2向后接合位置                                                   $    $  mm      $    $  ANS086.BYTE014  $  y=x*0.09375-12;
  $  164.拨叉3前啮合位置                                                         $    $  mm      $    $  ANS086.BYTE015  $  y=x*0.09375-12;
  $  165.换档拨叉3向前同步位置                                                   $    $  mm      $    $  ANS086.BYTE016  $  y=x*0.09375-12;
  $  166.换档拨叉3中立位置                                                       $    $  mm      $    $  ANS086.BYTE017  $  y=x*0.09375-12;
  $  167.换档拨叉3向后同步位置                                                   $    $  mm      $    $  ANS086.BYTE018  $  y=x*0.09375-12;
  $  168.换档拨叉3向后接合位置                                                   $    $  mm      $    $  ANS086.BYTE019  $  y=x*0.09375-12;
  $  169.拨叉4前啮合位置                                                         $    $  mm      $    $  ANS086.BYTE020  $  y=x*0.09375-12;
  $  170.换档拨叉4向前同步位置                                                   $    $  mm      $    $  ANS086.BYTE021  $  y=x*0.09375-12;
  $  171.换档拨叉4中立位置                                                       $    $  mm      $    $  ANS086.BYTE022  $  y=x*0.09375-12;
  $  172.换档拨叉4向后同步位置                                                   $    $  mm      $    $  ANS086.BYTE023  $  y=x*0.09375-12;
  $  173.换档拨叉4向后接合位置                                                   $    $  mm      $    $  ANS086.BYTE024  $  y=x*0.09375-12;
  $  174.DCT估算离合器1温度                                                      $    $          $    $  ANS087.BYTE004  $  y=x*4-40;
  $  175.DCT估算离合器2温度                                                      $    $          $    $  ANS088.BYTE004  $  y=((x&0x7F)-(x&0x80))*4-40;
  $  176.换档拨叉1位置传感器状态                                                 $    $          $    $  ANS089.BYTE004  $  if((x>=0x00)&&(x<=0))y=@0393;else if((x>=0x01)&&(x<=1))y=@0394;else if((x>=0x02)&&(x<=2))y=@0001;else if((x>=0x03)&&(x<=3))y=@0395;else if((x>=0x04)&&(x<=4))y=@0396;else if((x>=0x05)&&(x<=5))y=@01e9;else if((x>=0x06)&&(x<=6))y=@0318;else y=@0035;
  $  177.换档拨叉2位置传感器状态                                                 $    $          $    $  ANS089.BYTE005  $  if((x>=0x00)&&(x<=0))y=@0393;else if((x>=0x01)&&(x<=1))y=@0394;else if((x>=0x02)&&(x<=2))y=@0001;else if((x>=0x03)&&(x<=3))y=@0395;else if((x>=0x04)&&(x<=4))y=@0396;else if((x>=0x05)&&(x<=5))y=@01e9;else if((x>=0x06)&&(x<=6))y=@0318;else y=@0035;
  $  178.换档拨叉3位置传感器状态                                                 $    $          $    $  ANS089.BYTE006  $  if((x>=0x00)&&(x<=0))y=@0393;else if((x>=0x01)&&(x<=1))y=@0394;else if((x>=0x02)&&(x<=2))y=@0001;else if((x>=0x03)&&(x<=3))y=@0395;else if((x>=0x04)&&(x<=4))y=@0396;else if((x>=0x05)&&(x<=5))y=@01e9;else if((x>=0x06)&&(x<=6))y=@0318;else y=@0035;
  $  179.换档拨叉4位置传感器状态                                                 $    $          $    $  ANS089.BYTE007  $  if((x>=0x00)&&(x<=0))y=@0393;else if((x>=0x01)&&(x<=1))y=@0394;else if((x>=0x02)&&(x<=2))y=@0001;else if((x>=0x03)&&(x<=3))y=@0395;else if((x>=0x04)&&(x<=4))y=@0396;else if((x>=0x05)&&(x<=5))y=@01e9;else if((x>=0x06)&&(x<=6))y=@0318;else y=@0035;
  $  180.主导离合器控制                                                          $    $          $    $  ANS090.BYTE004  $  if((x>=0x00)&&(x<=0))y=@0397;else if((x>=0x01)&&(x<=1))y=@0398;else if((x>=0x02)&&(x<=2))y=@0399;else if((x>=0x03)&&(x<=3))y=@039a;else y=@0035;
  $  181.微控制状态                                                              $    $          $    $  ANS091.BYTE004  $  if((((x&0x70)>>4)>=0x01)&&(((x&0x70)>>4)<=1))y=@039b;else if((((x&0x70)>>4)>=0x02)&&(((x&0x70)>>4)<=2))y=@039c;else if((((x&0x70)>>4)>=0x03)&&(((x&0x70)>>4)<=3))y=@039d;else if((((x&0x70)>>4)>=0x04)&&(((x&0x70)>>4)<=4))y=@039e;else y=@0035;
  $  182.Trkng控制状态                                                           $    $          $    $  ANS091.BYTE004  $  if((((x&0x0C)>>2)>=0x01)&&(((x&0x0C)>>2)<=1))y=@039f;else if((((x&0x0C)>>2)>=0x02)&&(((x&0x0C)>>2)<=2))y=@03a0;else if((((x&0x0C)>>2)>=0x03)&&(((x&0x0C)>>2)<=3))y=@03a1;else y=@0035;
  $  183.耀斑控制状态                                                            $    $          $    $  ANS091.BYTE004  $  if(((x&0x03)>=0x00)&&((x&0x03)<=0))y=@03a2;else if(((x&0x03)>=0x01)&&((x&0x03)<=1))y=@03a3;else if(((x&0x03)>=0x02)&&((x&0x03)<=2))y=@03a4;else if(((x&0x03)>=0x03)&&((x&0x03)<=3))y=@03a5;else y=@0035;
  $  184.发动机控制状态                                                          $    $          $    $  ANS092.BYTE004  $  if((((x&0xF0)>>4)>=0x00)&&(((x&0xF0)>>4)<=0))y=@03ad;else if((((x&0xF0)>>4)>=0x01)&&(((x&0xF0)>>4)<=1))y=@03ae;else if((((x&0xF0)>>4)>=0x02)&&(((x&0xF0)>>4)<=2))y=@03af;else if((((x&0xF0)>>4)>=0x03)&&(((x&0xF0)>>4)<=3))y=@03b0;else if((((x&0xF0)>>4)>=0x04)&&(((x&0xF0)>>4)<=4))y=@03b1;else if((((x&0xF0)>>4)>=0x05)&&(((x&0xF0)>>4)<=5))y=@03b2;else if((((x&0xF0)>>4)>=0x06)&&(((x&0xF0)>>4)<=6))y=@03b3;else if((((x&0xF0)>>4)>=0x07)&&(((x&0xF0)>>4)<=7))y=@03b4;else if((((x&0xF0)>>4)>=0x08)&&(((x&0xF0)>>4)<=8))y=@03b5;else if((((x&0xF0)>>4)>=0x09)&&(((x&0xF0)>>4)<=9))y=@03b6;else if((((x&0xF0)>>4)>=0x0A)&&(((x&0xF0)>>4)<=10))y=@03b7;else y=@0035;
  $  185.BathTub控制状态                                                         $    $          $    $  ANS092.BYTE004  $  if(((x&0x0F)>=0x03)&&((x&0x0F)<=3))y=@03b8;else if(((x&0x0F)>=0x04)&&((x&0x0F)<=4))y=@03b9;else if(((x&0x0F)>=0x05)&&((x&0x0F)<=5))y=@03ba;else if(((x&0x0F)>=0x06)&&((x&0x0F)<=6))y=@03bb;else if(((x&0x0F)>=0x07)&&((x&0x0F)<=7))y=@03bc;else if(((x&0x0F)>=0x08)&&((x&0x0F)<=8))y=@03bd;else if(((x&0x0F)>=0x09)&&((x&0x0F)<=9))y=@03be;else if(((x&0x0F)>=0x0A)&&((x&0x0F)<=10))y=@03bf;else if(((x&0x0F)>=0x0B)&&((x&0x0F)<=11))y=@03c0;else if(((x&0x0F)>=0x0C)&&((x&0x0F)<=12))y=@03c1;else y=@0035;
  $  186.故障记录失效计数器                                                      $    $          $    $  ANS093.BYTE004  $  y=x;
  $  187.失败记录未失败计数                                                      $    $          $    $  ANS094.BYTE004  $  y=x;
  $  188.无速度叉位传感器故障检测的故障延迟档位                                  $    $          $    $  ANS095.BYTE004  $  if(((x&0x1F)>=0x00)&&((x&0x1F)<=0))y=@0001;else if(((x&0x1F)>=0x01)&&((x&0x1F)<=1))y=@0269;else if(((x&0x1F)>=0x02)&&((x&0x1F)<=2))y=@026a;else if(((x&0x1F)>=0x03)&&((x&0x1F)<=3))y=@026b;else if(((x&0x1F)>=0x04)&&((x&0x1F)<=4))y=@026c;else if(((x&0x1F)>=0x05)&&((x&0x1F)<=5))y=@026d;else if(((x&0x1F)>=0x06)&&((x&0x1F)<=6))y=@026e;else if(((x&0x1F)>=0x07)&&((x&0x1F)<=7))y=@0387;else if(((x&0x1F)>=0x0B)&&((x&0x1F)<=11))y=@03c2;else if(((x&0x1F)>=0x0C)&&((x&0x1F)<=12))y=@0388;else if(((x&0x1F)>=0x0D)&&((x&0x1F)<=13))y=@03c3;else if(((x&0x1F)>=0x0E)&&((x&0x1F)<=14))y=@03c4;else if(((x&0x1F)>=0x0F)&&((x&0x1F)<=15))y=@03c5;else if(((x&0x1F)>=0x10)&&((x&0x1F)<=16))y=@03c6;else if(((x&0x1F)>=0x11)&&((x&0x1F)<=17))y=@03c7;else if(((x&0x1F)>=0x12)&&((x&0x1F)<=18))y=@03c8;else if(((x&0x1F)>=0x13)&&((x&0x1F)<=19))y=@03c9;else if(((x&0x1F)>=0x17)&&((x&0x1F)<=23))y=@03ca;else if(((x&0x1F)>=0x18)&&((x&0x1F)<=24))y=@03cb;else if(((x&0x1F)>=0x19)&&((x&0x1F)<=25))y=@03cc;else if(((x&0x1F)>=0x1A)&&((x&0x1F)<=26))y=@03cd;else y=@0035;
  $  189.过滤偶数传感的内部速度                                                  $    $  rpm     $    $  ANS096.BYTE004  $  y=(x1*256+x2)*0.125;
  $  190.过滤奇数传感的内部速度                                                  $    $  rpm     $    $  ANS097.BYTE004  $  y=(x1*256+x2)*0.125;
  $  191.RLC的滤波传感输出速度                                                   $    $  rpm     $    $  ANS098.BYTE004  $  y=(x1*256+x2)*0.25;
  $  192.最后订婚的装备                                                          $    $          $    $  ANS099.BYTE004  $  if((((x&0xF0)>>4)>=0x00)&&(((x&0xF0)>>4)<=0))y=@0001;else if((((x&0xF0)>>4)>=0x01)&&(((x&0xF0)>>4)<=1))y=@0269;else if((((x&0xF0)>>4)>=0x02)&&(((x&0xF0)>>4)<=2))y=@026a;else if((((x&0xF0)>>4)>=0x03)&&(((x&0xF0)>>4)<=3))y=@026b;else if((((x&0xF0)>>4)>=0x04)&&(((x&0xF0)>>4)<=4))y=@026c;else if((((x&0xF0)>>4)>=0x05)&&(((x&0xF0)>>4)<=5))y=@026d;else if((((x&0xF0)>>4)>=0x06)&&(((x&0xF0)>>4)<=6))y=@026e;else if((((x&0xF0)>>4)>=0x07)&&(((x&0xF0)>>4)<=7))y=@0387;else if((((x&0xF0)>>4)>=0x0C)&&(((x&0xF0)>>4)<=12))y=@0388;else y=@0035;
  $  193.最终中和齿轮                                                            $    $          $    $  ANS099.BYTE004  $  if(((x&0x0F)>=0x00)&&((x&0x0F)<=0))y=@0001;else if(((x&0x0F)>=0x01)&&((x&0x0F)<=1))y=@0269;else if(((x&0x0F)>=0x02)&&((x&0x0F)<=2))y=@026a;else if(((x&0x0F)>=0x03)&&((x&0x0F)<=3))y=@026b;else if(((x&0x0F)>=0x04)&&((x&0x0F)<=4))y=@026c;else if(((x&0x0F)>=0x05)&&((x&0x0F)<=5))y=@026d;else if(((x&0x0F)>=0x06)&&((x&0x0F)<=6))y=@026e;else if(((x&0x0F)>=0x07)&&((x&0x0F)<=7))y=@0387;else if(((x&0x0F)>=0x0C)&&((x&0x0F)<=12))y=@0388;else y=@0035;
  $  194.进气温度1                                                               $    $          $    $  ANS100.BYTE004  $  y=x-40;
  $  195.进气温度2                                                               $    $          $    $  ANS101.BYTE004  $  y=x-40;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
