
    车型ID：111f

    模拟：协议模拟-->111f

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:7E1 02 10 01 00 00 00 00 00       $~  ANS000:7E9 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:7E1 02 3E 80 00 00 00 00 00       $!  ANS000:7E9 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:7E1 03 19 02 09 00 00 00 00       $#  ANS000:7E9 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/1d000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E1 04 14 FF FF FF 00 00 00       $$  ANS000:7E9 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E1 03 22 F1 86 00 00 00 00       $%  ANS000:7E9 03 22 F1 86 00 00 00 00
  $%  REQ001:7E1 03 22 F1 A0 00 00 00 00       $%  ANS001:7E9 03 22 F1 A0 00 00 00 00
  $%  REQ002:7E1 03 22 F1 83 00 00 00 00       $%  ANS002:7E9 03 22 F1 83 00 00 00 00
  $%  REQ003:7E1 03 22 F1 A1 00 00 00 00       $%  ANS003:7E9 03 22 F1 A1 00 00 00 00
  $%  REQ004:7E1 03 22 F1 91 00 00 00 00       $%  ANS004:7E9 03 22 F1 91 00 00 00 00
  $%  REQ005:7E1 03 22 F1 8B 00 00 00 00       $%  ANS005:7E9 03 22 F1 8B 00 00 00 00
  $%  REQ006:7E1 03 22 F1 A2 00 00 00 00       $%  ANS006:7E9 03 22 F1 A2 00 00 00 00
  $%  REQ007:7E1 03 22 F1 87 00 00 00 00       $%  ANS007:7E9 03 22 F1 87 00 00 00 00
  $%  REQ008:7E1 03 22 F1 10 00 00 00 00       $%  ANS008:7E9 03 22 F1 10 00 00 00 00
  $%  REQ009:7E1 03 22 F1 92 00 00 00 00       $%  ANS009:7E9 03 22 F1 92 00 00 00 00
  $%  REQ010:7E1 03 22 F1 8C 00 00 00 00       $%  ANS010:7E9 03 22 F1 8C 00 00 00 00
  $%  REQ011:7E1 03 22 F1 94 00 00 00 00       $%  ANS011:7E9 03 22 F1 94 00 00 00 00
  $%  REQ012:7E1 03 22 F1 8A 00 00 00 00       $%  ANS012:7E9 03 22 F1 8A 00 00 00 00
  $%  REQ013:7E1 03 22 F1 90 00 00 00 00       $%  ANS013:7E9 03 22 F1 90 00 00 00 00
  $%  REQ014:7E1 03 22 F1 A8 00 00 00 00       $%  ANS014:7E9 03 22 F1 A8 00 00 00 00

  $%  000:主动诊断会话数据标识符:          $%    $%  ANS000.BYTE004  $%  HEX(X1);
  $%  001:电控单元应用软件号:              $%    $%  ANS001.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  002:电控单元刷写软件参考号:          $%    $%  ANS002.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16);
  $%  003:电控单元标定软件号:              $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  004:电控单元硬件号:                  $%    $%  ANS004.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  005:电控单元制造日期:                $%    $%  ANS005.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  006:电控单元网络文件参考号:          $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  007:电控单元零件号:                  $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号(上次):            $%    $%  ANS008.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  009:测试工具参考号(上次):            $%    $%  ANS008.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  010:里程读数(上次):                  $%    $%  ANS008.BYTE015  $%  HEX(X1,X2,X3);
  $%  011:供应商电控单元硬件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  012:产品序列号:                      $%    $%  ANS010.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  013:生产线号码:                      $%    $%  ANS010.BYTE009  $%  ASCII(X1,X2);
  $%  014:年/月/日:                        $%    $%  ANS010.BYTE011  $%  HEX(X1,X2,X3);
  $%  015:供应商电控单元软件参考号:        $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  016:系统供应商标识号:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  017:车辆识别代码:                    $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  018:车辆特征信息:                    $%    $%  ANS014.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:7E1 03 22 01 09 00 00 00 00       $  ANS000:7E9 03 22 01 09 00 00 00 00
  $  REQ001:7E1 03 22 01 14 00 00 00 00       $  ANS001:7E9 03 22 01 14 00 00 00 00
  $  REQ002:7E1 03 22 01 08 00 00 00 00       $  ANS002:7E9 03 22 01 08 00 00 00 00
  $  REQ003:7E1 03 22 01 12 00 00 00 00       $  ANS003:7E9 03 22 01 12 00 00 00 00
  $  REQ004:7E1 03 22 01 0E 00 00 00 00       $  ANS004:7E9 03 22 01 0E 00 00 00 00
  $  REQ005:7E1 03 22 01 11 00 00 00 00       $  ANS005:7E9 03 22 01 11 00 00 00 00
  $  REQ006:7E1 03 22 01 0B 00 00 00 00       $  ANS006:7E9 03 22 01 0B 00 00 00 00
  $  REQ007:7E1 03 22 01 2E 00 00 00 00       $  ANS007:7E9 03 22 01 2E 00 00 00 00
  $  REQ008:7E1 03 22 01 20 00 00 00 00       $  ANS008:7E9 03 22 01 20 00 00 00 00
  $  REQ009:7E1 03 22 01 1F 00 00 00 00       $  ANS009:7E9 03 22 01 1F 00 00 00 00
  $  REQ010:7E1 03 22 01 07 00 00 00 00       $  ANS010:7E9 03 22 01 07 00 00 00 00
  $  REQ011:7E1 03 22 01 04 00 00 00 00       $  ANS011:7E9 03 22 01 04 00 00 00 00
  $  REQ012:7E1 03 22 01 0C 00 00 00 00       $  ANS012:7E9 03 22 01 0C 00 00 00 00
  $  REQ013:7E1 03 22 01 1D 00 00 00 00       $  ANS013:7E9 03 22 01 1D 00 00 00 00
  $  REQ014:7E1 03 22 01 0F 00 00 00 00       $  ANS014:7E9 03 22 01 0F 00 00 00 00
  $  REQ015:7E1 03 22 01 15 00 00 00 00       $  ANS015:7E9 03 22 01 15 00 00 00 00
  $  REQ016:7E1 03 22 01 17 00 00 00 00       $  ANS016:7E9 03 22 01 17 00 00 00 00
  $  REQ017:7E1 03 22 01 01 00 00 00 00       $  ANS017:7E9 03 22 01 01 00 00 00 00
  $  REQ018:7E1 03 22 01 03 00 00 00 00       $  ANS018:7E9 03 22 01 03 00 00 00 00
  $  REQ019:7E1 03 22 01 19 00 00 00 00       $  ANS019:7E9 03 22 01 19 00 00 00 00
  $  REQ020:7E1 03 22 01 0D 00 00 00 00       $  ANS020:7E9 03 22 01 0D 00 00 00 00
  $  REQ021:7E1 03 22 01 05 00 00 00 00       $  ANS021:7E9 03 22 01 05 00 00 00 00
  $  REQ022:7E1 03 22 01 16 00 00 00 00       $  ANS022:7E9 03 22 01 16 00 00 00 00
  $  REQ023:7E1 03 22 13 89 00 00 00 00       $  ANS023:7E9 03 22 13 89 00 00 00 00
  $  REQ024:7E1 03 22 01 13 00 00 00 00       $  ANS024:7E9 03 22 01 13 00 00 00 00
  $  REQ025:7E1 03 22 D0 01 00 00 00 00       $  ANS025:7E9 03 22 D0 01 00 00 00 00
  $  REQ026:7E1 03 22 01 21 00 00 00 00       $  ANS026:7E9 03 22 01 21 00 00 00 00
  $  REQ027:7E1 03 22 01 00 00 00 00 00       $  ANS027:7E9 03 22 01 00 00 00 00 00
  $  REQ028:7E1 03 22 01 1E 00 00 00 00       $  ANS028:7E9 03 22 01 1E 00 00 00 00
  $  REQ029:7E1 03 22 01 1B 00 00 00 00       $  ANS029:7E9 03 22 01 1B 00 00 00 00
  $  REQ030:7E1 03 22 01 1A 00 00 00 00       $  ANS030:7E9 03 22 01 1A 00 00 00 00
  $  REQ031:7E1 03 22 E1 01 00 00 00 00       $  ANS031:7E9 03 22 E1 01 00 00 00 00
  $  REQ032:7E1 03 22 01 22 00 00 00 00       $  ANS032:7E9 03 22 01 22 00 00 00 00
  $  REQ033:7E1 03 22 01 02 00 00 00 00       $  ANS033:7E9 03 22 01 02 00 00 00 00
  $  REQ034:7E1 03 22 13 8F 00 00 00 00       $  ANS034:7E9 03 22 13 8F 00 00 00 00
  $  REQ035:7E1 03 22 13 90 00 00 00 00       $  ANS035:7E9 03 22 13 90 00 00 00 00
  $  REQ036:7E1 03 22 01 30 00 00 00 00       $  ANS036:7E9 03 22 01 30 00 00 00 00
  $  REQ037:7E1 03 22 01 34 00 00 00 00       $  ANS037:7E9 03 22 01 34 00 00 00 00
  $  REQ038:7E1 03 22 01 18 00 00 00 00       $  ANS038:7E9 03 22 01 18 00 00 00 00
  $  REQ039:7E1 03 22 01 33 00 00 00 00       $  ANS039:7E9 03 22 01 33 00 00 00 00
  $  REQ040:7E1 03 22 01 32 00 00 00 00       $  ANS040:7E9 03 22 01 32 00 00 00 00
  $  REQ041:7E1 03 22 01 31 00 00 00 00       $  ANS041:7E9 03 22 01 31 00 00 00 00
  $  REQ042:7E1 03 22 01 06 00 00 00 00       $  ANS042:7E9 03 22 01 06 00 00 00 00
  $  REQ043:7E1 03 22 01 10 00 00 00 00       $  ANS043:7E9 03 22 01 10 00 00 00 00
  $  REQ044:7E1 03 22 C0 01 00 00 00 00       $  ANS044:7E9 03 22 C0 01 00 00 00 00
  $  REQ045:7E1 03 22 01 0A 00 00 00 00       $  ANS045:7E9 03 22 01 0A 00 00 00 00
  $  REQ046:7E1 03 22 01 26 00 00 00 00       $  ANS046:7E9 03 22 01 26 00 00 00 00
  $  REQ047:7E1 03 22 01 27 00 00 00 00       $  ANS047:7E9 03 22 01 27 00 00 00 00
  $  REQ048:7E1 03 22 01 28 00 00 00 00       $  ANS048:7E9 03 22 01 28 00 00 00 00
  $  REQ049:7E1 03 22 01 29 00 00 00 00       $  ANS049:7E9 03 22 01 29 00 00 00 00
  $  REQ050:7E1 03 22 01 2A 00 00 00 00       $  ANS050:7E9 03 22 01 2A 00 00 00 00
  $  REQ051:7E1 03 22 01 2B 00 00 00 00       $  ANS051:7E9 03 22 01 2B 00 00 00 00
  $  REQ052:7E1 03 22 01 2C 00 00 00 00       $  ANS052:7E9 03 22 01 2C 00 00 00 00
  $  REQ053:7E1 03 22 01 2D 00 00 00 00       $  ANS053:7E9 03 22 01 2D 00 00 00 00
  $  REQ054:7E1 03 22 01 3F 00 00 00 00       $  ANS054:7E9 03 22 01 3F 00 00 00 00
  $  REQ055:7E1 03 22 01 40 00 00 00 00       $  ANS055:7E9 03 22 01 40 00 00 00 00
  $  REQ056:7E1 03 22 01 47 00 00 00 00       $  ANS056:7E9 03 22 01 47 00 00 00 00
  $  REQ057:7E1 03 22 01 48 00 00 00 00       $  ANS057:7E9 03 22 01 48 00 00 00 00
  $  REQ058:7E1 03 22 01 41 00 00 00 00       $  ANS058:7E9 03 22 01 41 00 00 00 00
  $  REQ059:7E1 03 22 01 42 00 00 00 00       $  ANS059:7E9 03 22 01 42 00 00 00 00
  $  REQ060:7E1 03 22 01 43 00 00 00 00       $  ANS060:7E9 03 22 01 43 00 00 00 00
  $  REQ061:7E1 03 22 01 44 00 00 00 00       $  ANS061:7E9 03 22 01 44 00 00 00 00
  $  REQ062:7E1 03 22 01 45 00 00 00 00       $  ANS062:7E9 03 22 01 45 00 00 00 00
  $  REQ063:7E1 03 22 01 46 00 00 00 00       $  ANS063:7E9 03 22 01 46 00 00 00 00
  $  REQ064:7E1 03 22 01 38 00 00 00 00       $  ANS064:7E9 03 22 01 38 00 00 00 00
  $  REQ065:7E1 03 22 03 EE 00 00 00 00       $  ANS065:7E9 03 22 03 EE 00 00 00 00
  $  REQ066:7E1 03 22 13 8A 00 00 00 00       $  ANS066:7E9 03 22 13 8A 00 00 00 00
  $  REQ067:7E1 03 22 13 8B 00 00 00 00       $  ANS067:7E9 03 22 13 8B 00 00 00 00
  $  REQ068:7E1 03 22 03 EA 00 00 00 00       $  ANS068:7E9 03 22 03 EA 00 00 00 00
  $  REQ069:7E1 03 22 03 E9 00 00 00 00       $  ANS069:7E9 03 22 03 E9 00 00 00 00
  $  REQ070:7E1 03 22 03 EB 00 00 00 00       $  ANS070:7E9 03 22 03 EB 00 00 00 00
  $  REQ071:7E1 03 22 03 F2 00 00 00 00       $  ANS071:7E9 03 22 03 F2 00 00 00 00
  $  REQ072:7E1 03 22 03 F3 00 00 00 00       $  ANS072:7E9 03 22 03 F3 00 00 00 00
  $  REQ073:7E1 03 22 03 F0 00 00 00 00       $  ANS073:7E9 03 22 03 F0 00 00 00 00
  $  REQ074:7E1 03 22 03 F1 00 00 00 00       $  ANS074:7E9 03 22 03 F1 00 00 00 00
  $  REQ075:7E1 03 22 13 A4 00 00 00 00       $  ANS075:7E9 03 22 13 A4 00 00 00 00
  $  REQ076:7E1 03 22 01 35 00 00 00 00       $  ANS076:7E9 03 22 01 35 00 00 00 00
  $  REQ077:7E1 03 22 03 ED 00 00 00 00       $  ANS077:7E9 03 22 03 ED 00 00 00 00
  $  REQ078:7E1 03 22 01 24 00 00 00 00       $  ANS078:7E9 03 22 01 24 00 00 00 00
  $  REQ079:7E1 03 22 03 EF 00 00 00 00       $  ANS079:7E9 03 22 03 EF 00 00 00 00
  $  REQ080:7E1 03 22 01 23 00 00 00 00       $  ANS080:7E9 03 22 01 23 00 00 00 00
  $  REQ081:7E1 03 22 03 EC 00 00 00 00       $  ANS081:7E9 03 22 03 EC 00 00 00 00
  $  REQ082:7E1 03 22 01 2F 00 00 00 00       $  ANS082:7E9 03 22 01 2F 00 00 00 00
  $  REQ083:7E1 03 22 01 36 00 00 00 00       $  ANS083:7E9 03 22 01 36 00 00 00 00
  $  REQ084:7E1 03 22 01 37 00 00 00 00       $  ANS084:7E9 03 22 01 37 00 00 00 00
  $  REQ085:7E1 03 22 01 39 00 00 00 00       $  ANS085:7E9 03 22 01 39 00 00 00 00
  $  REQ086:7E1 03 22 01 25 00 00 00 00       $  ANS086:7E9 03 22 01 25 00 00 00 00

  $  000.变速箱油温                                   $    $           $    $  ANS000.BYTE004  $  y=x-40;
  $  001.加速踏板位置信号(通过CAN)                    $    $  %        $    $  ANS001.BYTE004  $  y=x*0.3937;
  $  002.实际发动机扭矩(通过CAN)                      $    $  Nm       $    $  ANS002.BYTE004  $  y=x*4-200;
  $  003.电池电压(原始值)                             $    $  V        $    $  ANS003.BYTE004  $  y=x*0.1;
  $  004.控制模块电压(点火电压原始值)                 $    $  V        $    $  ANS004.BYTE004  $  y=x*0.1;
  $  005.当前档位                                     $    $           $    $  ANS005.BYTE004  $  if(x==0x00) y=@01ea;else if(x==0x01) y=@0248;else if(x==0x02) y=@0249;else if(x==0x03) y=@024a;else if(x==0x04) y=@024b;else if(x==0x05) y=@024c;else if(x==0x06) y=@024d;else if(x==0x07) y=@024e;else if(x==0x08) y=@024f;else if(x==0x09) y=@0250;else y=@0035;
  $  006.年                                           $    $           $    $  ANS006.BYTE004  $  y=((x&0xFC)>>2)+2000;
  $  007.月                                           $    $           $    $  ANS006.BYTE004  $  y=(((x1*256+x2)&0x3C0)>>6);
  $  008.日                                           $    $           $    $  ANS006.BYTE005  $  y=((x&0x3E)>>1);
  $  009.时                                           $    $           $    $  ANS006.BYTE005  $  y=(((x1*256+x2)&0x1F0)>>4);
  $  010.分                                           $    $           $    $  ANS006.BYTE006  $  y=(((x1*256+x2)&0xFC0)>>6);
  $  011.秒                                           $    $           $    $  ANS006.BYTE007  $  y=(x&0x3F);
  $  012.EEPROM存储器检查故障状态                     $    $           $    $  ANS007.BYTE004  $  if(x==0) y=@0241;else if(x==1) y=@0242;else if(x==2) y=@0243;else y=@0035;
  $  013.紧急模式                                     $    $           $    $  ANS008.BYTE004  $  if(x==0) y=@0197;else if(x==1) y=@0244;else if(x==2) y=@0245;else if(x==3) y=@0246;else y=@0035;
  $  014.MIL灯                                        $    $           $    $  ANS009.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  015.历史故障数量                                 $    $           $    $  ANS009.BYTE004  $  y=(x&0x7F);
  $  016.发动机输出扭矩(通过CAN)                      $    $  Nm       $    $  ANS010.BYTE004  $  y=x*4-200;
  $  017.发动机转速(来自CAN)                          $    $  rpm      $    $  ANS011.BYTE004  $  y=x*32;
  $  018.发动机冷却液温度(通过CAN)                    $    $           $    $  ANS012.BYTE004  $  y=x-40;
  $  019.驾驶循环                                     $    $           $    $  ANS013.BYTE004  $  if(((x&0x80)>>7)==0) y=@0136;else if(((x&0x80)>>7)==1) y=@0247;else y=@0035;
  $  020.暖机循环                                     $    $           $    $  ANS013.BYTE004  $  if(((x&0x40)>>6)==0) y=@0136;else if(((x&0x40)>>6)==1) y=@0247;else y=@0035;
  $  021.AT油温状态                                   $    $           $    $  ANS014.BYTE004  $  if(x==0) y=@0096;else if(x==1) y=@025f;else if(x==2) y=@0119;else y=@0035;
  $  022.加速踏板位置信号状态(通过CAN)                $    $           $    $  ANS015.BYTE004  $  if(x==0) y=@0096;else if(x==1) y=@025f;else if(x==2) y=@0119;else y=@0035;
  $  023.换档杆位置状态                               $    $           $    $  ANS016.BYTE004  $  if(x==0) y=@0096;else if(x==1) y=@0119;else y=@0035;
  $  024.输入轴速度状态                               $    $           $    $  ANS017.BYTE004  $  if(x==0) y=@0096;else if(x==1) y=@025f;else if(x==2) y=@0119;else y=@0035;
  $  025.输出轴速度状态                               $    $           $    $  ANS018.BYTE004  $  if(x==0) y=@0096;else if(x==1) y=@025f;else if(x==2) y=@0119;else y=@0035;
  $  026.制动踏板开关信号状态(通过CAN)                $    $           $    $  ANS019.BYTE004  $  if(x==0) y=@0096;else if(x==2) y=@0119;else y=@0035;
  $  027.发动机冷却液温度信号状态(通过CAN)            $    $           $    $  ANS020.BYTE004  $  if(x==0) y=@0096;else if(x==1) y=@025f;else if(x==2) y=@0119;else y=@0035;
  $  028.发动机转速信号状态(来自CAN)                  $    $           $    $  ANS021.BYTE004  $  if(x==0) y=@0096;else if(x==2) y=@0260;else y=@0035;
  $  029.换档杆位置信号                               $    $           $    $  ANS022.BYTE004  $  if(x==5) y=@0261;else if(x==6) y=@0262;else if(x==7) y=@0263;else if(x==8) y=@0187;else y=@0035;
  $  030.换档杆位置信号                               $    $           $    $  ANS023.BYTE004  $  if(x==5) y=@0261;else if(x==6) y=@0262;else if(x==7) y=@0263;else if(x==8) y=@0187;else y=@0035;
  $  031.档位速比                                     $    $           $    $  ANS024.BYTE004  $  y=x*0.1;
  $  032.CAN 信号                                     $    $           $    $  ANS025.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  033.系统KL15状态                                 $    $           $    $  ANS025.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  034.CAN 信号                                     $    $           $    $  ANS026.BYTE004  $  if(((x&0x04)>>2)==0) y=@000f;else if(((x&0x04)>>2)==1) y=@016d;else y=@0035;
  $  035.点火开关KL15                                 $    $           $    $  ANS026.BYTE004  $  if(((x&0x02)>>1)==0) y=@000f;else if(((x&0x02)>>1)==1) y=@016d;else y=@0035;
  $  036.涡轮机速度传感器计算出的输入轴速度信号       $    $  rpm      $    $  ANS027.BYTE004  $  y=x*32;
  $  037.综合监控准备状态                             $    $           $    $  ANS028.BYTE004  $  if(((x&0x40)>>6)==0) y=@0136;else if(((x&0x40)>>6)==1) y=@0247;else y=@0035;
  $  038.燃油系统监控状态                             $    $           $    $  ANS028.BYTE004  $  if(((x&0x20)>>5)==0) y=@0136;else if(((x&0x20)>>5)==1) y=@0247;else y=@0035;
  $  039.不点火监控状态                               $    $           $    $  ANS028.BYTE004  $  if(((x&0x10)>>4)==0) y=@0136;else if(((x&0x10)>>4)==1) y=@0247;else y=@0035;
  $  040.综合监控状态                                 $    $           $    $  ANS028.BYTE004  $  if(((x&0x04)>>2)==0) y=@0136;else if(((x&0x04)>>2)==1) y=@0247;else y=@0035;
  $  041.不点火监控支持                               $    $           $    $  ANS028.BYTE004  $  if((x&0x01)==0) y=@0136;else if((x&0x01)==1) y=@0247;else y=@0035;
  $  042.MIL灯                                        $    $           $    $  ANS029.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@016d;else y=@0035;
  $  043.驾驶模式切换                                 $    $           $    $  ANS030.BYTE004  $  if(x==0x00) y=@0251;else if(x==0x01) y=@0252;else if(x==0x02) y=@0253;else if(x==0x04) y=@0254;else if(x==0x08) y=@0255;else if(x==0x10) y=@0256;else y=@0035;
  $  044.里程表读取TCU内部计算                        $    $  km       $    $  ANS031.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  045.里程表读取TCU内部计算                        $    $  km       $    $  ANS032.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  046.输出速度传感器计算出的输出轴速度信号         $    $  rpm      $    $  ANS033.BYTE004  $  y=x*32;
  $  047.驻车锁状态                                   $    $           $    $  ANS034.BYTE004  $  if(x==0) y=@0257;else if(x==1) y=@0258;else if(x==2) y=@0259;else if(x==3) y=@01a9;else y=@0035;
  $  048.驻车锁状态2                                  $    $           $    $  ANS035.BYTE004  $  if(x==0) y=@023f;else if(x==1) y=@025a;else if(x==2) y=@025b;else if(x==3) y=@025c;else if(x==4) y=@0258;else y=@0035;
  $  049.锁止离合器状态                               $    $           $    $  ANS036.BYTE004  $  if(((x&0x40)>>6)==0) y=@025d;else if(((x&0x40)>>6)==1) y=@025e;else y=@0035;
  $  050.TCU芯片温度传感器状态                        $    $           $    $  ANS036.BYTE004  $  if(((x&0x10)>>4)==0) y=@01e8;else if(((x&0x10)>>4)==1) y=@01e9;else y=@0035;
  $  051.变速箱油温传感器状态                         $    $           $    $  ANS036.BYTE004  $  if(((x&0x08)>>3)==0) y=@01e8;else if(((x&0x08)>>3)==1) y=@01e9;else y=@0035;
  $  052.P档传感器状态                                $    $           $    $  ANS036.BYTE004  $  if(((x&0x04)>>2)==0) y=@01e8;else if(((x&0x04)>>2)==1) y=@01e9;else y=@0035;
  $  053.飞轮端转速传感器状态                         $    $           $    $  ANS036.BYTE004  $  if(((x&0x02)>>1)==0) y=@01e8;else if(((x&0x02)>>1)==1) y=@01e9;else y=@0035;
  $  054.输出端转速传感器状态                         $    $           $    $  ANS036.BYTE004  $  if((x&0x01)==0) y=@01e8;else if((x&0x01)==1) y=@01e9;else y=@0035;
  $  055.L1状态                                       $    $           $    $  ANS037.BYTE004  $  if(((x&0x80)>>7)==0) y=@01f6;else if(((x&0x80)>>7)==1) y=@01f7;else y=@0035;
  $  056.L2状态                                       $    $           $    $  ANS037.BYTE004  $  if(((x&0x40)>>6)==0) y=@01f8;else if(((x&0x40)>>6)==1) y=@01f9;else y=@0035;
  $  057.L3状态                                       $    $           $    $  ANS037.BYTE004  $  if(((x&0x20)>>5)==0) y=@01fa;else if(((x&0x20)>>5)==1) y=@01fb;else y=@0035;
  $  058.L4状态                                       $    $           $    $  ANS037.BYTE004  $  if(((x&0x10)>>4)==0) y=@01fc;else if(((x&0x10)>>4)==1) y=@01fd;else y=@0035;
  $  059.L1电气状态                                   $    $           $    $  ANS037.BYTE004  $  if(((x&0x08)>>3)==0) y=@01e8;else if(((x&0x08)>>3)==1) y=@01e9;else y=@0035;
  $  060.L2电气状态                                   $    $           $    $  ANS037.BYTE004  $  if(((x&0x04)>>2)==0) y=@01e8;else if(((x&0x04)>>2)==1) y=@01e9;else y=@0035;
  $  061.L3电气状态                                   $    $           $    $  ANS037.BYTE004  $  if(((x&0x02)>>1)==0) y=@01e8;else if(((x&0x02)>>1)==1) y=@01e9;else y=@0035;
  $  062.L4电气状态                                   $    $           $    $  ANS037.BYTE004  $  if((x&0x01)==0) y=@01e8;else if((x&0x01)==1) y=@01e9;else y=@0035;
  $  063.正在换档状态                                 $    $           $    $  ANS038.BYTE004  $  if(((x&0x80)>>7)==0) y=@01e0;else if(((x&0x80)>>7)==1) y=@01e1;else y=@0035;
  $  064.锁止离合器状态                               $    $           $    $  ANS038.BYTE004  $  if(((x&0x60)>>5)==0) y=@01e2;else if(((x&0x60)>>5)==1) y=@01e3;else if(((x&0x60)>>5)==2) y=@01e4;else if(((x&0x60)>>5)==3) y=@01e5;else y=@0035;
  $  065.制动踏板                                     $    $           $    $  ANS038.BYTE004  $  if(((x&0x18)>>3)==0) y=@01e6;else if(((x&0x18)>>3)==1) y=@01e7;else y=@0035;
  $  066.环境温度信号状态                             $    $           $    $  ANS039.BYTE004  $  if(((x&0x80)>>7)==0) y=@01e8;else if(((x&0x80)>>7)==1) y=@01e9;else y=@0035;
  $  067.转向系统信号状态                             $    $           $    $  ANS039.BYTE004  $  if(((x&0x40)>>6)==0) y=@01e8;else if(((x&0x40)>>6)==1) y=@01e9;else y=@0035;
  $  068.AWD信号状态                                  $    $           $    $  ANS039.BYTE004  $  if(((x&0x20)>>5)==0) y=@01e8;else if(((x&0x20)>>5)==1) y=@01e9;else y=@0035;
  $  069.点火开关信号状态                             $    $           $    $  ANS039.BYTE004  $  if(((x&0x10)>>4)==0) y=@01e8;else if(((x&0x10)>>4)==1) y=@01e9;else y=@0035;
  $  070.换档锁信号状态                               $    $           $    $  ANS039.BYTE004  $  if(((x&0x08)>>3)==0) y=@01e8;else if(((x&0x08)>>3)==1) y=@01e9;else y=@0035;
  $  071.换档器信号状态                               $    $           $    $  ANS039.BYTE004  $  if(((x&0x04)>>2)==0) y=@01e8;else if(((x&0x04)>>2)==1) y=@01e9;else y=@0035;
  $  072.门信号状态                                   $    $           $    $  ANS039.BYTE004  $  if(((x&0x02)>>1)==0) y=@01e8;else if(((x&0x02)>>1)==1) y=@01e9;else y=@0035;
  $  073.安全带信号状态                               $    $           $    $  ANS039.BYTE004  $  if((x&0x01)==0) y=@01e8;else if((x&0x01)==1) y=@01e9;else y=@0035;
  $  074.DAS刹车信号状态                              $    $           $    $  ANS040.BYTE004  $  if(((x&0x80)>>7)==0) y=@01e8;else if(((x&0x80)>>7)==1) y=@01e9;else y=@0035;
  $  075.驻车锁信号状态                               $    $           $    $  ANS040.BYTE004  $  if(((x&0x40)>>6)==0) y=@01e8;else if(((x&0x40)>>6)==1) y=@01e9;else y=@0035;
  $  076.ABS失效信号状态                              $    $           $    $  ANS040.BYTE004  $  if(((x&0x20)>>5)==0) y=@01e8;else if(((x&0x20)>>5)==1) y=@01e9;else y=@0035;
  $  077.ASC控制器信号状态                            $    $           $    $  ANS040.BYTE004  $  if(((x&0x10)>>4)==0) y=@01e8;else if(((x&0x10)>>4)==1) y=@01e9;else y=@0035;
  $  078.制动踏板信号状态                             $    $           $    $  ANS040.BYTE004  $  if(((x&0x08)>>3)==0) y=@01e8;else if(((x&0x08)>>3)==1) y=@01e9;else y=@0035;
  $  079.刹车压力信号状态                             $    $           $    $  ANS040.BYTE004  $  if(((x&0x04)>>2)==0) y=@01e8;else if(((x&0x04)>>2)==1) y=@01e9;else y=@0035;
  $  080.后轮速度信号状态                             $    $           $    $  ANS040.BYTE004  $  if(((x&0x02)>>1)==0) y=@01e8;else if(((x&0x02)>>1)==1) y=@01e9;else y=@0035;
  $  081.前轮速度信号状态                             $    $           $    $  ANS040.BYTE004  $  if((x&0x01)==0) y=@01e8;else if((x&0x01)==1) y=@01e9;else y=@0035;
  $  082.发动机转速信号状态                           $    $           $    $  ANS041.BYTE004  $  if(((x&0x80)>>7)==0) y=@01e8;else if(((x&0x80)>>7)==1) y=@01e9;else y=@0035;
  $  083.油门踏板信号状态                             $    $           $    $  ANS041.BYTE004  $  if(((x&0x40)>>6)==0) y=@01e8;else if(((x&0x40)>>6)==1) y=@01e9;else y=@0035;
  $  084.发动机输出端扭距信号状态                     $    $           $    $  ANS041.BYTE004  $  if(((x&0x20)>>5)==0) y=@01e8;else if(((x&0x20)>>5)==1) y=@01e9;else y=@0035;
  $  085.驾驶员需求扭距信号状态                       $    $           $    $  ANS041.BYTE004  $  if(((x&0x10)>>4)==0) y=@01e8;else if(((x&0x10)>>4)==1) y=@01e9;else y=@0035;
  $  086.飞轮端扭距信号状态                           $    $           $    $  ANS041.BYTE004  $  if(((x&0x08)>>3)==0) y=@01e8;else if(((x&0x08)>>3)==1) y=@01e9;else y=@0035;
  $  087.发动机水温信号状态                           $    $           $    $  ANS041.BYTE004  $  if(((x&0x04)>>2)==0) y=@01e8;else if(((x&0x04)>>2)==1) y=@01e9;else y=@0035;
  $  088.制动踏板信号状态                             $    $           $    $  ANS041.BYTE004  $  if(((x&0x08)>>3)==0) y=@01e8;else if(((x&0x08)>>3)==1) y=@01e9;else y=@0035;
  $  089.大气压力信号状态                             $    $           $    $  ANS041.BYTE004  $  if((x&0x01)==0) y=@01e8;else if((x&0x01)==1) y=@01e9;else y=@0035;
  $  090.目标发动机输出扭矩(通过CAN)                  $    $  Nm       $    $  ANS042.BYTE004  $  y=x*4-200;
  $  091.目标档位                                     $    $           $    $  ANS043.BYTE004  $  if(x==0x00) y=@01ea;else if(x==0x01) y=@01eb;else if(x==0x02) y=@01ec;else if(x==0x03) y=@01ed;else if(x==0x04) y=@01ee;else if(x==0x05) y=@01ef;else if(x==0x06) y=@01f0;else if(x==0x07) y=@01f1;else if(x==0x08) y=@01f2;else if(x==0x09) y=@01f3;else y=@0035;
  $  092.启动停止功能                                 $    $           $    $  ANS044.BYTE004  $  if(((x&0x80)>>7)==0) y=@01f4;else if(((x&0x80)>>7)==1) y=@01f5;else y=@0035;
  $  093.PEPS是否配置                                 $    $           $    $  ANS044.BYTE004  $  if(((x&0x40)>>6)==0) y=@01f4;else if(((x&0x40)>>6)==1) y=@01f5;else y=@0035;
  $  094.APA配置                                      $    $           $    $  ANS044.BYTE004  $  if(((x&0x20)>>5)==0) y=@01f4;else if(((x&0x20)>>5)==1) y=@01f5;else y=@0035;
  $  095.2WD/4WD                                      $    $           $    $  ANS044.BYTE004  $  if(((x&0x10)>>4)==0) y=@023b;else if(((x&0x10)>>4)==1) y=@023c;else y=@0035;
  $  096.左右驾驶                                     $    $           $    $  ANS044.BYTE004  $  if(((x&0x08)>>3)==0) y=@023d;else if(((x&0x08)>>3)==1) y=@023e;else y=@0035;
  $  097.ATS配置                                      $    $           $    $  ANS044.BYTE004  $  if(((x&0x04)>>2)==0) y=@01f4;else if(((x&0x04)>>2)==1) y=@01f5;else y=@0035;
  $  098.EPB配置                                      $    $           $    $  ANS044.BYTE004  $  if(((x&0x02)>>1)==0) y=@01f4;else if(((x&0x02)>>1)==1) y=@01f5;else y=@0035;
  $  099.ACC配置                                      $    $           $    $  ANS044.BYTE004  $  if((x&0x01)==0) y=@01f4;else if((x&0x01)==1) y=@01f5;else y=@0035;
  $  100.输出速度传感器计算出的汽车速度               $    $  km/h     $    $  ANS045.BYTE004  $  y=x;
  $  101.替代函数1激活                                $    $           $    $  ANS046.BYTE004  $  y=x;
  $  102.替代函数2激活                                $    $           $    $  ANS047.BYTE004  $  y=x;
  $  103.替代函数3激活                                $    $           $    $  ANS048.BYTE004  $  y=x;
  $  104.替代函数4激活                                $    $           $    $  ANS049.BYTE004  $  y=x;
  $  105.替代函数5激活                                $    $           $    $  ANS050.BYTE004  $  y=x;
  $  106.替代函数6激活                                $    $           $    $  ANS051.BYTE004  $  y=x;
  $  107.替代函数7激活                                $    $           $    $  ANS052.BYTE004  $  y=x;
  $  108.替代函数8激活                                $    $           $    $  ANS053.BYTE004  $  y=x;
  $  109.输出OUT0处的测量电流                         $    $  mA       $    $  ANS054.BYTE004  $  y=(x1*256+x2)*0.1;
  $  110.输出OUT1处的测量电流                         $    $  mA       $    $  ANS055.BYTE004  $  y=(x1*256+x2)*0.1;
  $  111.输出OUT10处的测量电流                        $    $  mA       $    $  ANS056.BYTE004  $  y=(x1*256+x2)*0.1;
  $  112.输出OUT11处的测量电流                        $    $  mA       $    $  ANS057.BYTE004  $  y=(x1*256+x2)*0.1;
  $  113.输出OUT2处的测量电流                         $    $  mA       $    $  ANS058.BYTE004  $  y=(x1*256+x2)*0.1;
  $  114.输出OUT3处的测量电流                         $    $  mA       $    $  ANS059.BYTE004  $  y=(x1*256+x2)*0.1;
  $  115.输出OUT4处的测量电流                         $    $  mA       $    $  ANS060.BYTE004  $  y=(x1*256+x2)*0.1;
  $  116.输出OUT5处的测量电流                         $    $  mA       $    $  ANS061.BYTE004  $  y=(x1*256+x2)*0.1;
  $  117.输出OUT6处的测量电流                         $    $  mA       $    $  ANS062.BYTE004  $  y=(x1*256+x2)*0.1;
  $  118.输出OUT7处的测量电流                         $    $  mA       $    $  ANS063.BYTE004  $  y=(x1*256+x2)*0.1;
  $  119.室外温度过滤                                 $    $           $    $  ANS064.BYTE004  $  y=x-40;
  $  120.bit位校验故障                                $    $           $    $  ANS065.BYTE004  $  y=(x1*256+x2);
  $  121.缓冲的变速箱档位信息                         $    $           $    $  ANS066.BYTE004  $  if(x==5) y=@0261;else if(x==6) y=@0262;else if(x==7) y=@0263;else if(x==8) y=@0187;else y=@0035;
  $  122.缓冲的驾驶方向                               $    $           $    $  ANS067.BYTE004  $  if(x==0) y=@023f;else if(x==1) y=@00df;else if(x==2) y=@0240;else y=@0035;
  $  123.CG130芯片传感器温度                          $    $           $    $  ANS068.BYTE004  $  y=x-40;
  $  124.LM71芯片传感器温度                           $    $           $    $  ANS069.BYTE004  $  y=x-40;
  $  125.CG130温度传感器                              $    $           $    $  ANS070.BYTE004  $  if(((x&0x0C)>>2)==0) y=@01fe;else if(((x&0x0C)>>2)==1) y=@01ff;else if(((x&0x0C)>>2)==2) y=@0119;else if(((x&0x0C)>>2)==3) y=@01e5;else y=@0035;
  $  126.LM71温度传感器                               $    $           $    $  ANS070.BYTE004  $  if((x&0x03)==0) y=@01fe;else if((x&0x03)==1) y=@01ff;else if((x&0x03)==2) y=@0119;else if((x&0x03)==3) y=@01e5;else y=@0035;
  $  127.微型计算器错误1环境变量                      $    $           $    $  ANS071.BYTE004  $  y=x;
  $  128.微型计算器错误2环境变量                      $    $           $    $  ANS072.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  129.WD错误1环境变量                              $    $           $    $  ANS073.BYTE004  $  y=(x1*256+x2);
  $  130.WD错误2环境变量                              $    $           $    $  ANS074.BYTE004  $  y=(x1*256+x2);
  $  131.移位器的故障类型                             $    $           $    $  ANS075.BYTE004  $  y=(x1*256+x2);
  $  132.锁止离合器的真实状态                         $    $           $    $  ANS076.BYTE004  $  if(((x&0xC0)>>6)==0) y=@0200;else if(((x&0xC0)>>6)==1) y=@0201;else if(((x&0xC0)>>6)==2) y=@0202;else if(((x&0xC0)>>6)==3) y=@0035;else y=@0035;
  $  133.档位信息                                     $    $           $    $  ANS076.BYTE004  $  if((x&0x3F)==0x00) y=@0203;else if((x&0x3F)==0x01) y=@0204;else if((x&0x3F)==0x02) y=@0205;else if((x&0x3F)==0x03) y=@0071;else if((x&0x3F)==0x04) y=@0072;else if((x&0x3F)==0x05) y=@0206;else if((x&0x3F)==0x06) y=@0207;else if((x&0x3F)==0x07) y=@0208;else if((x&0x3F)==0x08) y=@0209;else if((x&0x3F)==0x09) y=@020a;else if((x&0x3F)==0x0A) y=@020b;else if((x&0x3F)==0x0B) y=@020c;else if((x&0x3F)==0x0C) y=@020d;else if((x&0x3F)==0x0D) y=@020e;else if((x&0x3F)==0x0E) y=@020f;else if((x&0x3F)==0x0F) y=@0210;else if((x&0x3F)==0x10) y=@0211;else if((x&0x3F)==0x11) y=@0212;else if((x&0x3F)==0x12) y=@0213;else if((x&0x3F)==0x13) y=@0214;else if((x&0x3F)==0x14) y=@0215;else if((x&0x3F)==0x15) y=@0216;else if((x&0x3F)==0x16) y=@0217;else if((x&0x3F)==0x17) y=@0218;else if((x&0x3F)==0x1A) y=@0219;else if((x&0x3F)==0x1B) y=@021a;else if((x&0x3F)==0x1C) y=@021b;else if((x&0x3F)==0x1D) y=@021c;else if((x&0x3F)==0x1E) y=@021d;else if((x&0x3F)==0x1F) y=@021e;else if((x&0x3F)==0x20) y=@021f;else if((x&0x3F)==0x21) y=@0220;else if((x&0x3F)==0x22) y=@0221;else if((x&0x3F)==0x23) y=@0222;else if((x&0x3F)==0x24) y=@0223;else if((x&0x3F)==0x25) y=@0224;else if((x&0x3F)==0x26) y=@0225;else if((x&0x3F)==0x27) y=@0226;else if((x&0x3F)==0x28) y=@0227;else if((x&0x3F)==0x29) y=@0228;else if((x&0x3F)==0x2A) y=@0229;else if((x&0x3F)==0x2B) y=@022a;else if((x&0x3F)==0x2C) y=@022b;else if((x&0x3F)==0x2D) y=@022c;else if((x&0x3F)==0x2E) y=@022d;else if((x&0x3F)==0x2F) y=@022e;else if((x&0x3F)==0x30) y=@022f;else if((x&0x3F)==0x31) y=@0230;else if((x&0x3F)==0x32) y=@0231;else if((x&0x3F)==0x34) y=@0232;else if((x&0x3F)==0x35) y=@0233;else if((x&0x3F)==0x36) y=@0234;else if((x&0x3F)==0x37) y=@0235;else if((x&0x3F)==0x39) y=@0236;else if((x&0x3F)==0x3A) y=@0237;else y=@0103;
  $  134.环境条件大小信息                             $    $           $    $  ANS077.BYTE004  $  y=(x1*256+x2);
  $  135.电磁阀供应电压                               $    $  V        $    $  ANS078.BYTE004  $  y=x*0.1;
  $  136.关机前最终量                                 $    $           $    $  ANS079.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  137.速度传感器和压力传感器                       $    $  V        $    $  ANS080.BYTE004  $  y=x*0.1;
  $  138.温度过热关机的限值                           $    $           $    $  ANS081.BYTE004  $  y=x-40;
  $  139.系统1ms计数器                                $    $  ms       $    $  ANS082.BYTE004  $  y=(x1*256*256*256+x2*256*256+x3*256+x4);
  $  140.接口提供计算的实际转换器温度                 $    $           $    $  ANS083.BYTE004  $  y=(x1*256+x2)-40;
  $  141.点火快速引擎干预请求                         $    $  Nm       $    $  ANS084.BYTE004  $  y=x*4-200;
  $  142.点火引擎干预的干预方式                       $    $           $    $  ANS085.BYTE004  $  if(x==0) y=@0238;else if(x==1) y=@0239;else if(x==2) y=@023a;else y=@0035;
  $  143.最大允许发动机扭矩                           $    $  Nm       $    $  ANS086.BYTE004  $  y=x*4-200;

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:7E1 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
