
    车型ID：1124

    模拟：协议模拟-->1124

;******************************************************************************************************************************************************

    通讯线: $~06$~14$~500k

进入命令:

  $~  REQ000:720 02 10 01 00 00 00 00 00       $~  ANS000:7A0 02 10 01 00 00 00 00 00

空闲命令:

  $!  REQ000:720 02 3E 80 00 00 00 00 00       $!  ANS000:7A0 02 3E 80 00 00 00 00 00

退出命令:



;******************************************************************************************************************************************************

读取故障码:

  $#  REQ000:720 03 19 02 09 00 00 00 00       $#  ANS000:7A0 03 19 02 09 00 00 00 00

  帧长控制故障码个数，从$#ANS000.BYTE4$#开始每$#4$#个字节表示一个故障码，前$#3$#表示码号。

  码库:

  $*$*DTC/22000000


;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:720 04 14 FF FF FF 00 00 00       $$  ANS000:7A0 04 14 FF FF FF 00 00 00

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:720 03 22 F1 A0 00 00 00 00       $%  ANS000:7A0 03 22 F1 A0 00 00 00 00
  $%  REQ001:720 03 22 F1 83 00 00 00 00       $%  ANS001:7A0 03 22 F1 83 00 00 00 00
  $%  REQ002:720 03 22 F1 A1 00 00 00 00       $%  ANS002:7A0 03 22 F1 A1 00 00 00 00
  $%  REQ003:720 03 22 F1 91 00 00 00 00       $%  ANS003:7A0 03 22 F1 91 00 00 00 00
  $%  REQ004:720 03 22 F1 8B 00 00 00 00       $%  ANS004:7A0 03 22 F1 8B 00 00 00 00
  $%  REQ005:720 03 22 F1 A2 00 00 00 00       $%  ANS005:7A0 03 22 F1 A2 00 00 00 00
  $%  REQ006:720 03 22 F1 87 00 00 00 00       $%  ANS006:7A0 03 22 F1 87 00 00 00 00
  $%  REQ007:720 03 22 F1 10 00 00 00 00       $%  ANS007:7A0 03 22 F1 10 00 00 00 00
  $%  REQ008:720 03 22 DA DA 00 00 00 00       $%  ANS008:7A0 03 22 DA DA 00 00 00 00
  $%  REQ009:720 03 22 F1 92 00 00 00 00       $%  ANS009:7A0 03 22 F1 92 00 00 00 00
  $%  REQ010:720 03 22 F1 8C 00 00 00 00       $%  ANS010:7A0 03 22 F1 8C 00 00 00 00
  $%  REQ011:720 03 22 F1 94 00 00 00 00       $%  ANS011:7A0 03 22 F1 94 00 00 00 00
  $%  REQ012:720 03 22 F1 8A 00 00 00 00       $%  ANS012:7A0 03 22 F1 8A 00 00 00 00
  $%  REQ013:720 03 22 F0 1D 00 00 00 00       $%  ANS013:7A0 03 22 F0 1D 00 00 00 00
  $%  REQ014:720 03 22 F1 90 00 00 00 00       $%  ANS014:7A0 03 22 F1 90 00 00 00 00
  $%  REQ015:720 03 22 F1 A8 00 00 00 00       $%  ANS015:7A0 03 22 F1 A8 00 00 00 00

  $%  000:电控单元应用软件号:              $%    $%  ANS000.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  001:电控单元刷写软件参考号:          $%    $%  ANS001.BYTE011  $%  ASCII(X1,X2,X3);
  $%  002:电控单元校准软件编号3:           $%    $%  ANS002.BYTE004  $%  ASCII(X1);
  $%  003:电控单元校准软件编号2:           $%    $%  ANS002.BYTE005  $%  HEX(X1,X2,X3,X4,X5);
  $%  004:电控单元校准软件编号1:           $%    $%  ANS002.BYTE010  $%  ASCII(X1,X2);
  $%  005:电控单元硬件号:                  $%    $%  ANS003.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  006:电控单元制造日期 1:              $%    $%  ANS004.BYTE004  $%  HEX(X1,X2,X3);
  $%  007:电控单元网络文件参考号:          $%    $%  ANS005.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  008:电控单元零件号:                  $%    $%  ANS006.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  009:电控单元零件号（上次）:          $%    $%  ANS007.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5);
  $%  010:测试工具参考号（上次）:          $%    $%  ANS007.BYTE009  $%  HEX(X1,X2,X3,X4,X5,X6);
  $%  011:里程读数（上次）:                $%    $%  ANS007.BYTE015  $%  HEX(X1,X2,X3);
  $%  012:软件释放日期:                    $%    $%  ANS008.BYTE004  $%  HEX(X1,X2,X3,X4);
  $%  013:供应商电控单元硬件参考号:        $%    $%  ANS009.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  014:供应商电控单元序列号:            $%    $%  ANS010.BYTE004  $%  y=UINT40(x1,x2,x3,x4,x5);
  $%  015:供应商电控单元产线号:            $%    $%  ANS010.BYTE009  $%  ASCII(X1,X2);
  $%  016:年:                              $%    $%  ANS010.BYTE011  $%  HEX(X1,X2,X3);
  $%  017:供应商电控单元软件参考号:        $%    $%  ANS011.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10);
  $%  018:系统供应商识别号:                $%    $%  ANS012.BYTE004  $%  y=SPRINTF([%c%02X%02X%02X%02X%02X],X1,X2,X3,X4,X5,X6);
  $%  019:UAES电子标签:                    $%    $%  ANS013.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6);
  $%  020:UAES电子标签2:                   $%    $%  ANS013.BYTE010  $%  HEX(X1,X2,X3,X4,X5);
  $%  021:UAES电子标签3:                   $%    $%  ANS013.BYTE015  $%  ASCII(X1,X2,X3,X4,X5);
  $%  022:UAES电子标签4:                   $%    $%  ANS013.BYTE020  $%  HEX(X1,X2,X3,X4);
  $%  023:VIN:                             $%    $%  ANS014.BYTE004  $%  ASCII(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17);
  $%  024:车辆特征信息:                    $%    $%  ANS015.BYTE004  $%  HEX(X1,X2,X3,X4,X5,X6,X7,X8,X9,X10,X11,X12,X13,X14,X15,X16,X17,X18,X19,X20);

;******************************************************************************************************************************************************

读数据流: 

  $  REQ000:720 03 22 D1 01 00 00 00 00       $  ANS000:7A0 03 22 D1 01 00 00 00 00
  $  REQ001:720 03 22 D1 02 00 00 00 00       $  ANS001:7A0 03 22 D1 02 00 00 00 00
  $  REQ002:720 03 22 D1 11 00 00 00 00       $  ANS002:7A0 03 22 D1 11 00 00 00 00
  $  REQ003:720 03 22 E1 01 00 00 00 00       $  ANS003:7A0 03 22 E1 01 00 00 00 00
  $  REQ004:720 03 22 E1 02 00 00 00 00       $  ANS004:7A0 03 22 E1 02 00 00 00 00
  $  REQ005:720 03 22 D1 12 00 00 00 00       $  ANS005:7A0 03 22 D1 12 00 00 00 00
  $  REQ006:720 03 22 E1 11 00 00 00 00       $  ANS006:7A0 03 22 E1 11 00 00 00 00
  $  REQ007:720 03 22 E1 12 00 00 00 00       $  ANS007:7A0 03 22 E1 12 00 00 00 00
  $  REQ008:720 03 22 C1 00 00 00 00 00       $  ANS008:7A0 03 22 C1 00 00 00 00 00
  $  REQ009:720 03 22 C1 01 00 00 00 00       $  ANS009:7A0 03 22 C1 01 00 00 00 00
  $  REQ010:720 03 22 C1 02 00 00 00 00       $  ANS010:7A0 03 22 C1 02 00 00 00 00
  $  REQ011:720 03 22 C1 22 00 00 00 00       $  ANS011:7A0 03 22 C1 22 00 00 00 00
  $  REQ012:720 03 22 C1 23 00 00 00 00       $  ANS012:7A0 03 22 C1 23 00 00 00 00
  $  REQ013:720 03 22 C1 24 00 00 00 00       $  ANS013:7A0 03 22 C1 24 00 00 00 00

  $  000.尾门后背板开关                                          $    $        $    $  ANS000.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0004;
  $  001.尾门开度模式选择开关                                    $    $        $    $  ANS000.BYTE004  $  if(((x&0x40)>>6)==0) y=@00e5;else if(((x&0x40)>>6)==1) y=@0045;else y=@0004;
  $  002.驾驶舱尾门操作开关                                      $    $        $    $  ANS000.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  003.基本锁锁体的门微开开关                                  $    $        $    $  ANS001.BYTE004  $  if(((x&0x80)>>7)==0) y=@000f;else if(((x&0x80)>>7)==1) y=@0028;else y=@0004;
  $  004.基本锁锁体的棘爪开关                                    $    $        $    $  ANS001.BYTE004  $  if(((x&0x40)>>6)==0) y=@000f;else if(((x&0x40)>>6)==1) y=@0028;else y=@0004;
  $  005.自吸锁的释放开关                                        $    $        $    $  ANS001.BYTE004  $  if(((x&0x20)>>5)==0) y=@000f;else if(((x&0x20)>>5)==1) y=@0028;else y=@0004;
  $  006.自吸锁的吸合开关                                        $    $        $    $  ANS001.BYTE004  $  if(((x&0x10)>>4)==0) y=@000f;else if(((x&0x10)>>4)==1) y=@0028;else y=@0004;
  $  007.自吸锁端子A继电器驱动输出                               $    $        $    $  ANS002.BYTE004  $  if(((x&0x80)>>7)==0) y=@00e6;else if(((x&0x80)>>7)==1) y=@00e1;else y=@0004;
  $  008.自吸锁端子B继电器驱动输出                               $    $        $    $  ANS002.BYTE004  $  if(((x&0x40)>>6)==0) y=@00e6;else if(((x&0x40)>>6)==1) y=@00e1;else y=@0004;
  $  009.基本锁继电器驱动输出                                    $    $        $    $  ANS002.BYTE004  $  if(((x&0x20)>>5)==0) y=@00e6;else if(((x&0x20)>>5)==1) y=@00e1;else y=@0004;
  $  010.左侧防夹条分压AD值                                      $    $        $    $  ANS003.BYTE004  $  y=(((x1*256+x2)&0xFFC0)>>6);
  $  011.右侧防夹条分压AD值                                      $    $        $    $  ANS003.BYTE006  $  y=(((x1*256+x2)&0xFFC0)>>6);
  $  012.左侧霍尔主信号100ms内脉冲数                             $    $        $    $  ANS004.BYTE004  $  y=x;
  $  013.左侧霍尔传感器信号方向                                  $    $        $    $  ANS004.BYTE005  $  y=(x&0x03);
  $  014.右侧霍尔主信号100ms内脉冲数                             $    $        $    $  ANS004.BYTE006  $  y=x;
  $  015.右侧霍尔传感器信号方向                                  $    $        $    $  ANS004.BYTE007  $  y=(x&0x03);
  $  016.左侧霍尔副信号高低值                                    $    $        $    $  ANS004.BYTE008  $  y=(x&0x01);
  $  017.右侧霍尔副信号高低值                                    $    $        $    $  ANS004.BYTE009  $  y=(x&0x01);
  $  018.给电撑杆供电的KL30继电器控制                            $    $        $    $  ANS005.BYTE004  $  if(((x&0x80)>>7)==0) y=@00e6;else if(((x&0x80)>>7)==1) y=@00e1;else y=@0004;
  $  019.Break继电器的控制                                       $    $        $    $  ANS005.BYTE004  $  if(((x&0x40)>>6)==0) y=@00df;else if(((x&0x40)>>6)==1) y=@00b5;else y=@0004;
  $  020.分流控制                                                $    $        $    $  ANS005.BYTE004  $  if(((x&0x20)>>5)==0) y=@00b1;else if(((x&0x20)>>5)==1) y=@00bb;else y=@0004;
  $  021.左侧电撑杆PWM占空比                                     $    $  %     $    $  ANS006.BYTE004  $  y=x;
  $  022.左侧撑杆端子A继电器驱动输出                             $    $        $    $  ANS006.BYTE005  $  if(((x&0x80)>>7)==0) y=@00e0;else y=@00e1;
  $  023.左侧撑杆端子B继电器驱动输出                             $    $        $    $  ANS006.BYTE005  $  if(((x&0x40)>>6)==0) y=@00e1;else y=@00e0;
  $  024.右侧电撑杆PWM占空比                                     $    $  %     $    $  ANS007.BYTE004  $  y=x;
  $  025.右侧撑杆端子A继电器驱动输出                             $    $        $    $  ANS007.BYTE005  $  if(((x&0x80)>>7)==0) y=@00e0;else y=@00e1;
  $  026.右侧撑杆端子B继电器驱动输出                             $    $        $    $  ANS007.BYTE005  $  if(((x&0x40)>>6)==0) y=@00e1;else y=@00e0;
  $  027.变速器配置                                              $    $        $    $  ANS008.BYTE004  $  if(((x&0x20)>>5)==0) y=@00e2;else if(((x&0x20)>>5)==1) y=@00e3;else y=@0004;
  $  028.PEPS配置                                                $    $        $    $  ANS008.BYTE004  $  if(((x&0x10)>>4)==0) y=@00e4;else if(((x&0x10)>>4)==1) y=@003d;else y=@0004;
  $  029.随动关门使能                                            $    $        $    $  ANS008.BYTE004  $  if((x&0x01)==0) y=@00f1;else if((x&0x01)==1) y=@00f0;else y=@0004;
  $  030.无网络环境配置                                          $    $        $    $  ANS009.BYTE004  $  if(((x&0x80)>>7)==0) y=@0040;else if(((x&0x80)>>7)==1) y=@0041;else y=@0004;
  $  031.调试报文配置                                            $    $        $    $  ANS009.BYTE004  $  if(((x&0x40)>>6)==0) y=@0042;else if(((x&0x40)>>6)==1) y=@0043;else y=@0004;
  $  032.禁止电撑杆热保护                                        $    $        $    $  ANS009.BYTE004  $  if(((x&0x20)>>5)==0) y=@00f0;else if(((x&0x20)>>5)==1) y=@00f1;else y=@0004;
  $  033.禁止自吸锁热保护                                        $    $        $    $  ANS009.BYTE004  $  if(((x&0x10)>>4)==0) y=@00f0;else if(((x&0x10)>>4)==1) y=@00f1;else y=@0004;
  $  034.手动/电动（主开关）使能                                 $    $        $    $  ANS009.BYTE004  $  if(((x&0x02)>>1)==0) y=@00f1;else if(((x&0x02)>>1)==1) y=@00f0;else y=@0004;
  $  035.故障码配置 B1611：电动尾门控制器电压低                  $    $        $    $  ANS010.BYTE004  $  if(((x&0x80)>>7)==0) y=@00f1;else if(((x&0x80)>>7)==1) y=@00f0;else y=@0004;
  $  036.故障码配置B1612：电动尾门控制器电压高                   $    $        $    $  ANS010.BYTE004  $  if(((x&0x40)>>6)==0) y=@00f1;else if(((x&0x40)>>6)==1) y=@00f0;else y=@0004;
  $  037.故障码配置 U1021:电动尾门控制器总线关闭                 $    $        $    $  ANS010.BYTE004  $  if(((x&0x20)>>5)==0) y=@00f1;else if(((x&0x20)>>5)==1) y=@00f0;else y=@0004;
  $  038.故障码配置 U1122:与BCM通讯丢失                          $    $        $    $  ANS010.BYTE004  $  if(((x&0x10)>>4)==0) y=@00f1;else if(((x&0x10)>>4)==1) y=@00f0;else y=@0004;
  $  039.故障码配置 U1123:与PEPS通讯丢失                         $    $        $    $  ANS010.BYTE004  $  if(((x&0x08)>>3)==0) y=@00f1;else if(((x&0x08)>>3)==1) y=@00f0;else y=@0004;
  $  040.故障码配置 U1124:与GW_ABS_ESP通讯丢失                   $    $        $    $  ANS010.BYTE004  $  if(((x&0x04)>>2)==0) y=@00f1;else if(((x&0x04)>>2)==1) y=@00f0;else y=@0004;
  $  041.故障码配置 U1125:与GW_TCU通讯丢失（仅适用AT车型）       $    $        $    $  ANS010.BYTE004  $  if(((x&0x02)>>1)==0) y=@00f1;else if(((x&0x02)>>1)==1) y=@00f0;else y=@0004;
  $  042.故障码配置 U1126:与HVAC通讯丢失                         $    $        $    $  ANS010.BYTE004  $  if((x&0x01)==0) y=@00f1;else if((x&0x01)==1) y=@00f0;else y=@0004;
  $  043.故障码配置U1127：与GW_IPK通讯丢失                       $    $        $    $  ANS010.BYTE005  $  if(((x&0x80)>>7)==0) y=@00f1;else if(((x&0x80)>>7)==1) y=@00f0;else y=@0004;
  $  044.故障码配置 B1631:撑杆电机对电源短路                     $    $        $    $  ANS010.BYTE005  $  if(((x&0x40)>>6)==0) y=@00f1;else if(((x&0x40)>>6)==1) y=@00f0;else y=@0004;
  $  045.故障码配置 B1632:撑杆电机对地短路                       $    $        $    $  ANS010.BYTE005  $  if(((x&0x20)>>5)==0) y=@00f1;else if(((x&0x20)>>5)==1) y=@00f0;else y=@0004;
  $  046.故障码配置 B1633:撑杆电机开路                           $    $        $    $  ANS010.BYTE005  $  if(((x&0x10)>>4)==0) y=@00f1;else if(((x&0x10)>>4)==1) y=@00f0;else y=@0004;
  $  047.故障码配置 B1641:自吸锁对电源短路                       $    $        $    $  ANS010.BYTE005  $  if(((x&0x08)>>3)==0) y=@00f1;else if(((x&0x08)>>3)==1) y=@00f0;else y=@0004;
  $  048.故障码配置 B1647：基本锁解锁失败                        $    $        $    $  ANS010.BYTE005  $  if(((x&0x04)>>2)==0) y=@00f1;else if(((x&0x04)>>2)==1) y=@00f0;else y=@0004;
  $  049.故障码配置B1648：基本锁上锁故障                         $    $        $    $  ANS010.BYTE005  $  if(((x&0x02)>>1)==0) y=@00f1;else if(((x&0x02)>>1)==1) y=@00f0;else y=@0004;
  $  050.故障码配置 B1649:自吸锁锁紧失败                         $    $        $    $  ANS010.BYTE005  $  if((x&0x01)==0) y=@00f1;else if((x&0x01)==1) y=@00f0;else y=@0004;
  $  051.故障码配置 B164A:自吸锁释放失败                         $    $        $    $  ANS010.BYTE006  $  if(((x&0x80)>>7)==0) y=@00f1;else if(((x&0x80)>>7)==1) y=@00f0;else y=@0004;
  $  052.故障码配置B164B:锁微开错误组合                          $    $        $    $  ANS010.BYTE006  $  if(((x&0x40)>>6)==0) y=@00f1;else if(((x&0x40)>>6)==1) y=@00f0;else y=@0004;
  $  053.故障码配置 B1651:防夹信号错误（左侧）                   $    $        $    $  ANS010.BYTE006  $  if(((x&0x20)>>5)==0) y=@00f1;else if(((x&0x20)>>5)==1) y=@00f0;else y=@0004;
  $  054.故障码配置 B1652:防挤条挤压（左侧）                     $    $        $    $  ANS010.BYTE006  $  if(((x&0x10)>>4)==0) y=@00f1;else if(((x&0x10)>>4)==1) y=@00f0;else y=@0004;
  $  055.故障码配置 B1653:防夹信号错误（右侧）                   $    $        $    $  ANS010.BYTE006  $  if(((x&0x08)>>3)==0) y=@00f1;else if(((x&0x08)>>3)==1) y=@00f0;else y=@0004;
  $  056.故障码配置 B1654:防挤条挤压（右侧）                     $    $        $    $  ANS010.BYTE006  $  if(((x&0x04)>>2)==0) y=@00f1;else if(((x&0x04)>>2)==1) y=@00f0;else y=@0004;
  $  057.故障码配置 B1655:防夹条开启负载（左侧）                 $    $        $    $  ANS010.BYTE006  $  if(((x&0x02)>>1)==0) y=@00f1;else if(((x&0x02)>>1)==1) y=@00f0;else y=@0004;
  $  058.故障码配置 B1656:防夹条开启负载（右侧）                 $    $        $    $  ANS010.BYTE006  $  if((x&0x01)==0) y=@00f1;else if((x&0x01)==1) y=@00f0;else y=@0004;
  $  059.故障码配置 B1661:霍尔信号对电源短路（霍尔1）            $    $        $    $  ANS010.BYTE007  $  if(((x&0x80)>>7)==0) y=@00f1;else if(((x&0x80)>>7)==1) y=@00f0;else y=@0004;
  $  060.故障码配置 B1662:霍尔信号对电源短路（霍尔2）            $    $        $    $  ANS010.BYTE007  $  if(((x&0x40)>>6)==0) y=@00f1;else if(((x&0x40)>>6)==1) y=@00f0;else y=@0004;
  $  061.故障码配置 B1663:霍尔信号对地短路（霍尔1）              $    $        $    $  ANS010.BYTE007  $  if(((x&0x20)>>5)==0) y=@00f1;else if(((x&0x20)>>5)==1) y=@00f0;else y=@0004;
  $  062.故障码配置 B1664:霍尔信号对地短路（霍尔2）              $    $        $    $  ANS010.BYTE007  $  if(((x&0x10)>>4)==0) y=@00f1;else if(((x&0x10)>>4)==1) y=@00f0;else y=@0004;
  $  063.故障码配置B1665：霍尔信号开路（霍尔1）                  $    $        $    $  ANS010.BYTE007  $  if(((x&0x08)>>3)==0) y=@00f1;else if(((x&0x08)>>3)==1) y=@00f0;else y=@0004;
  $  064.故障码配置 B1666:霍尔信号开路（霍尔2）                  $    $        $    $  ANS010.BYTE007  $  if(((x&0x04)>>2)==0) y=@00f1;else if(((x&0x04)>>2)==1) y=@00f0;else y=@0004;
  $  065.标定完成标识                                            $    $        $    $  ANS011.BYTE004  $  if(((x&0x80)>>7)==0) y=@004a;else if(((x&0x80)>>7)==1) y=@00e7;else y=@0004;
  $  066.自学习完成标识                                          $    $        $    $  ANS011.BYTE004  $  if(((x&0x40)>>6)==0) y=@004c;else if(((x&0x40)>>6)==1) y=@004d;else y=@0004;
  $  067.手动学习零点完成标识                                    $    $        $    $  ANS011.BYTE004  $  if(((x&0x20)>>5)==0) y=@004c;else if(((x&0x20)>>5)==1) y=@004d;else y=@0004;
  $  068.手动学习最大开度完成标识                                $    $        $    $  ANS011.BYTE004  $  if(((x&0x10)>>4)==0) y=@004c;else if(((x&0x10)>>4)==1) y=@004d;else y=@0004;
  $  069.车库模式学习标识                                        $    $        $    $  ANS011.BYTE004  $  if(((x&0x08)>>3)==0) y=@004c;else if(((x&0x08)>>3)==1) y=@004d;else y=@0004;
  $  070.尾门当前状态                                            $    $        $    $  ANS011.BYTE005  $  if(x==0) y=@004e;else if(x==1) y=@004f;else if(x==2) y=@00e8;else if(x==3) y=@00e9;else if(x==4) y=@00ea;else if(x==5) y=@0051;else y=@0004;
  $  071.锁当前状态                                              $    $        $    $  ANS011.BYTE006  $  if(x==0) y=@004e;else if(x==1) y=@00eb;else if(x==2) y=@00ec;else if(x==3) y=@00ed;else if(x==4) y=@000f;else if(x==5) y=@00ee;else if(x==6) y=@00ef;else y=@0004;
  $  072.当前系统滥用及保护状态                                  $    $        $    $  ANS011.BYTE007  $  if(x==0) y=@0030;else if(x==1) y=@0031;else if(x==2) y=@0032;else if(x==3) y=@0033;else if(x==4) y=@0034;else y=@0004;
  $  073.尾门自学习后的最大开度                                  $    $        $    $  ANS012.BYTE004  $  y=(x1*256+x2);
  $  074.当前设定的车库模式最大开度                              $    $        $    $  ANS012.BYTE006  $  y=(x1*256+x2);
  $  075.当前尾门开度                                            $    $        $    $  ANS013.BYTE004  $  y=(x1*256+x2);

;******************************************************************************************************************************************************

30帧:

  $FC REQ000:720 30 00 00 00 00 00 00 00  $FC 

;******************************************************************************************************************************************************
