
     系统名称:ECM (发动机控制模块)

     系统ID:000044AC

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 03 00 00 00 00 00       $~ ANS000:7E8 02 10 03 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 01 00 00 00 00 00       $~ ANS000:7E8 02 10 01 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10233496&quot;: &quot;000044AC&quot;, &quot;10594009&quot;: &quot;000044AC&quot;, &quot;10740521&quot;: &quot;000044AC&quot;, &quot;10456881&quot;: &quot;000044AD&quot;, &quot;10122527&quot;: &quot;000044AE&quot;, &quot;10425930&quot;: &quot;000044AF&quot;, &quot;10385653&quot;: &quot;000044B0&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10233496&quot;: &quot;000044AC&quot;, &quot;10594009&quot;: &quot;000044AC&quot;, &quot;10740521&quot;: &quot;000044AC&quot;, &quot;10456881&quot;: &quot;000044AD&quot;, &quot;10122527&quot;: &quot;000044AE&quot;, &quot;10425930&quot;: &quot;000044AF&quot;, &quot;10385653&quot;: &quot;000044B0&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E0 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/000044AC

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E0 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ002:7E0 03 22 F1 87 00 00 00 00            $%  
  $%  REQ003:7E0 03 22 F1 91 00 00 00 00            $%  
  $%  REQ004:7E0 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ005:7E0 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ006:7E0 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ007:7E0 03 22 F1 10 00 00 00 00            $%  
  $%  REQ008:7E0 03 22 F1 20 00 00 00 00            $%  
  $%  REQ009:7E0 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ010:7E0 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ011:7E0 03 22 F1 00 00 00 00 00            $%  

  $%  000:车辆识别代码(VIN)               $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:车辆特征信息 (FK)               $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  002:电控单元零件号                  $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元硬件号                  $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元应用软件号              $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元标定软件号              $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元制造日期                $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:刷新里程读数                    $%    $%  ANS007.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 
  $%  008:网络配置文件零件号出厂值        $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  009:电控单元索引信息                $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3); 
  $%  010:电控单元序列号                  $%    $%  ANS010.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  011:刷新工具参考号记录              $%    $%  ANS007.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  012:ECU软件校验号                   $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E0 03 22 B0 00 00 00 00 00            $  
  $  REQ001:7E0 03 22 B0 01 00 00 00 00            $  
  $  REQ002:7E0 03 22 B0 02 00 00 00 00            $  
  $  REQ003:7E0 03 22 B0 03 00 00 00 00            $  
  $  REQ004:7E0 03 22 B0 04 00 00 00 00            $  
  $  REQ005:7E0 03 22 B0 17 00 00 00 00            $  
  $  REQ006:7E0 03 22 B0 18 00 00 00 00            $  
  $  REQ007:7E0 03 22 B0 19 00 00 00 00            $  
  $  REQ008:7E0 03 22 B0 20 00 00 00 00            $  
  $  REQ009:7E0 03 22 B0 22 00 00 00 00            $  
  $  REQ010:7E0 03 22 B0 25 00 00 00 00            $  
  $  REQ011:7E0 03 22 B0 26 00 00 00 00            $  
  $  REQ012:7E0 03 22 B0 27 00 00 00 00            $  
  $  REQ013:7E0 03 22 B0 28 00 00 00 00            $  
  $  REQ014:7E0 03 22 B0 29 00 00 00 00            $  
  $  REQ015:7E0 03 22 B0 30 00 00 00 00            $  
  $  REQ016:7E0 03 22 B0 32 00 00 00 00            $  
  $  REQ017:7E0 03 22 B0 33 00 00 00 00            $  
  $  REQ018:7E0 03 22 B0 34 00 00 00 00            $  
  $  REQ019:7E0 03 22 B0 35 00 00 00 00            $  
  $  REQ020:7E0 03 22 B0 38 00 00 00 00            $  
  $  REQ021:7E0 03 22 B0 43 00 00 00 00            $  
  $  REQ022:7E0 03 22 B0 47 00 00 00 00            $  
  $  REQ023:7E0 03 22 B0 48 00 00 00 00            $  
  $  REQ024:7E0 03 22 B0 49 00 00 00 00            $  
  $  REQ025:7E0 03 22 B0 50 00 00 00 00            $  
  $  REQ026:7E0 03 22 B0 51 00 00 00 00            $  
  $  REQ027:7E0 03 22 B0 52 00 00 00 00            $  
  $  REQ028:7E0 03 22 B0 53 00 00 00 00            $  
  $  REQ029:7E0 03 22 B0 54 00 00 00 00            $  
  $  REQ030:7E0 03 22 B0 55 00 00 00 00            $  
  $  REQ031:7E0 03 22 B0 56 00 00 00 00            $  
  $  REQ032:7E0 03 22 B0 57 00 00 00 00            $  
  $  REQ033:7E0 03 22 B0 58 00 00 00 00            $  
  $  REQ034:7E0 03 22 B0 61 00 00 00 00            $  
  $  REQ035:7E0 03 22 B0 68 00 00 00 00            $  
  $  REQ036:7E0 03 22 B0 73 00 00 00 00            $  
  $  REQ037:7E0 03 22 B0 74 00 00 00 00            $  
  $  REQ038:7E0 03 22 B1 01 00 00 00 00            $  
  $  REQ039:7E0 03 22 B1 02 00 00 00 00            $  
  $  REQ040:7E0 03 22 B1 03 00 00 00 00            $  
  $  REQ041:7E0 03 22 B1 15 00 00 00 00            $  
  $  REQ042:7E0 03 22 B1 19 00 00 00 00            $  
  $  REQ043:7E0 03 22 B1 20 00 00 00 00            $  
  $  REQ044:7E0 03 22 B1 21 00 00 00 00            $  
  $  REQ045:7E0 03 22 B1 22 00 00 00 00            $  
  $  REQ046:7E0 03 22 B1 23 00 00 00 00            $  
  $  REQ047:7E0 03 22 B1 24 00 00 00 00            $  
  $  REQ048:7E0 03 22 B1 25 00 00 00 00            $  
  $  REQ049:7E0 03 22 B1 26 00 00 00 00            $  
  $  REQ050:7E0 03 22 B1 27 00 00 00 00            $  
  $  REQ051:7E0 03 22 B1 30 00 00 00 00            $  
  $  REQ052:7E0 03 22 B1 33 00 00 00 00            $  
  $  REQ053:7E0 03 22 B1 34 00 00 00 00            $  
  $  REQ054:7E0 03 22 B1 35 00 00 00 00            $  
  $  REQ055:7E0 03 22 B1 36 00 00 00 00            $  
  $  REQ056:7E0 03 22 B1 40 00 00 00 00            $  
  $  REQ057:7E0 03 22 B1 41 00 00 00 00            $  
  $  REQ058:7E0 03 22 B1 43 00 00 00 00            $  
  $  REQ059:7E0 03 22 B1 44 00 00 00 00            $  
  $  REQ060:7E0 03 22 B1 45 00 00 00 00            $  
  $  REQ061:7E0 03 22 B1 46 00 00 00 00            $  
  $  REQ062:7E0 03 22 B1 50 00 00 00 00            $  
  $  REQ063:7E0 03 22 B1 51 00 00 00 00            $  
  $  REQ064:7E0 03 22 B1 52 00 00 00 00            $  
  $  REQ065:7E0 03 22 B1 56 00 00 00 00            $  
  $  REQ066:7E0 03 22 B1 57 00 00 00 00            $  
  $  REQ067:7E0 03 22 B1 58 00 00 00 00            $  
  $  REQ068:7E0 03 22 B1 59 00 00 00 00            $  
  $  REQ069:7E0 03 22 B1 60 00 00 00 00            $  
  $  REQ070:7E0 03 22 B1 61 00 00 00 00            $  
  $  REQ071:7E0 03 22 B1 62 00 00 00 00            $  
  $  REQ072:7E0 03 22 B1 63 00 00 00 00            $  
  $  REQ073:7E0 03 22 B1 64 00 00 00 00            $  
  $  REQ074:7E0 03 22 B1 65 00 00 00 00            $  
  $  REQ075:7E0 03 22 B1 74 00 00 00 00            $  
  $  REQ076:7E0 03 22 B1 75 00 00 00 00            $  
  $  REQ077:7E0 03 22 B1 76 00 00 00 00            $  
  $  REQ078:7E0 03 22 B1 77 00 00 00 00            $  
  $  REQ079:7E0 03 22 B1 79 00 00 00 00            $  
  $  REQ080:7E0 03 22 B2 00 00 00 00 00            $  
  $  REQ081:7E0 03 22 B2 01 00 00 00 00            $  
  $  REQ082:7E0 03 22 B2 02 00 00 00 00            $  
  $  REQ083:7E0 03 22 B2 03 00 00 00 00            $  
  $  REQ084:7E0 03 22 B2 04 00 00 00 00            $  
  $  REQ085:7E0 03 22 B2 05 00 00 00 00            $  
  $  REQ086:7E0 03 22 B2 12 00 00 00 00            $  
  $  REQ087:7E0 03 22 B3 00 00 00 00 00            $  
  $  REQ088:7E0 03 22 B3 01 00 00 00 00            $  
  $  REQ089:7E0 03 22 B3 02 00 00 00 00            $  
  $  REQ090:7E0 03 22 B3 03 00 00 00 00            $  
  $  REQ091:7E0 03 22 B3 04 00 00 00 00            $  
  $  REQ092:7E0 03 22 B3 05 00 00 00 00            $  
  $  REQ093:7E0 03 22 B3 06 00 00 00 00            $  
  $  REQ094:7E0 03 22 B3 07 00 00 00 00            $  
  $  REQ095:7E0 03 22 B3 08 00 00 00 00            $  
  $  REQ096:7E0 03 22 B3 09 00 00 00 00            $  
  $  REQ097:7E0 03 22 B3 11 00 00 00 00            $  
  $  REQ098:7E0 03 22 B3 12 00 00 00 00            $  
  $  REQ099:7E0 03 22 B3 13 00 00 00 00            $  
  $  REQ100:7E0 03 22 B3 14 00 00 00 00            $  
  $  REQ101:7E0 03 22 B3 15 00 00 00 00            $  
  $  REQ102:7E0 03 22 B3 16 00 00 00 00            $  
  $  REQ103:7E0 03 22 B3 17 00 00 00 00            $  
  $  REQ104:7E0 03 22 B4 01 00 00 00 00            $  
  $  REQ105:7E0 03 22 B4 02 00 00 00 00            $  
  $  REQ106:7E0 03 22 B4 03 00 00 00 00            $  
  $  REQ107:7E0 03 22 B4 04 00 00 00 00            $  
  $  REQ108:7E0 03 22 B4 05 00 00 00 00            $  
  $  REQ109:7E0 03 22 B4 06 00 00 00 00            $  
  $  REQ110:7E0 03 22 B4 11 00 00 00 00            $  
  $  REQ111:7E0 03 22 B4 12 00 00 00 00            $  
  $  REQ112:7E0 03 22 B4 13 00 00 00 00            $  
  $  REQ113:7E0 03 22 B4 14 00 00 00 00            $  
  $  REQ114:7E0 03 22 B4 15 00 00 00 00            $  
  $  REQ115:7E0 03 22 B4 17 00 00 00 00            $  

  $  000.周围空气压力                                        $    $  千帕           $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.0039; 
  $  001.空调压力                                            $    $  千帕           $    $  ANS001.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0916;elsey=(x1*256+x2-0xFFFF)*0.0916; 
  $  002.空调压力原始值                                      $    $  伏             $    $  ANS002.BYTE003  $  y=(x1*256+x2)*0.0049; 
  $  003.ECM供电电压(KL87)                                   $    $  伏             $    $  ANS003.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  004.点火开关供电电压                                    $    $  伏             $    $  ANS004.BYTE003  $  y=(x)*0.068; 
  $  005.进气凸轮轴相位(VVT)                                 $    $  度             $    $  ANS005.BYTE003  $  if(0x80>x)y=(x)*2;elsey=(x-0xFF)*2; 
  $  006.排气凸轮轴相位(VVT)                                 $    $  度             $    $  ANS006.BYTE003  $  if(0x80>x)y=(x)*2;elsey=(x-0xFF)*2; 
  $  007.气门重叠角(VVT)                                     $    $  度             $    $  ANS007.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0078125;elsey=(x1*256+x2-0xFFFF)*0.0078125; 
  $  008.碳罐PWM占空比                                       $    $  百分比         $    $  ANS008.BYTE003  $  y=(x)*0.392; 
  $  009.冷却风扇输出占空比                                  $    $  百分比         $    $  ANS009.BYTE003  $  y=(x)*0.390625; 
  $  010.巡航开关电压                                        $    $  伏             $    $  ANS010.BYTE003  $  y=(x)*0.0195; 
  $  011.油门踏板需求                                        $    $  百分比         $    $  ANS011.BYTE003  $  y=(x)*0.392; 
  $  012.油门踏板需求 1                                      $    $  伏特           $    $  ANS012.BYTE003  $  y=(x)*0.0195; 
  $  013.油门踏板需求 2                                      $    $  伏特           $    $  ANS013.BYTE003  $  y=(x)*0.0195; 
  $  014.加速踏板位置1传感器电压                             $    $  伏             $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  015.加速踏板位置2传感器电压                             $    $  伏             $    $  ANS015.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  016.发动机冷却液温度                                    $    $  摄氏度         $    $  ANS016.BYTE003  $  y=(x)*1-40; 
  $  017.发动机冷却液温度传感器电压                          $    $  伏             $    $  ANS017.BYTE003  $  y=(x)*0.0195; 
  $  018.发动机油温度                                        $    $  摄氏度         $    $  ANS018.BYTE003  $  y=(x)*1-60; 
  $  019.机油温度传感器电压                                  $    $  伏             $    $  ANS019.BYTE003  $  y=(x)*0.0195; 
  $  020.发动机转速                                          $    $  转/分          $    $  ANS020.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  021.油箱油位                                            $    $  升             $    $  ANS021.BYTE003  $  y=(x)*0.4; 
  $  022.空调蒸发器温度加工值                                $    $  摄氏度         $    $  ANS022.BYTE003  $  y=(x)*0.75-48; 
  $  023.空调蒸发器温度传感器电压值                          $    $  伏             $    $  ANS023.BYTE003  $  y=(x)*0.0195; 
  $  024.进气歧管空气温度                                    $    $  摄氏度         $    $  ANS024.BYTE003  $  y=(x)*1-40; 
  $  025.进气歧管空气温度传感器电压                          $    $  伏             $    $  ANS025.BYTE003  $  y=(x)*0.0195; 
  $  026.进气歧管绝对压力                                    $    $  千帕           $    $  ANS026.BYTE003  $  y=(x)*0.0078125; 
  $  027.进气歧管绝对压力电压原始值                          $    $  伏             $    $  ANS027.BYTE003  $  y=(x)*0.0195; 
  $  028.后氧传感器电压                                      $    $  伏特           $    $  ANS028.BYTE003  $  y=(x)*0.0195; 
  $  029.下游氧传感器电压                                    $    $  伏特           $    $  ANS029.BYTE003  $  y=(x1*256+x2)*0.0049-1; 
  $  030.前氧传感器电压                                      $    $  伏特           $    $  ANS030.BYTE003  $  y=(x)*0.0195; 
  $  031.上游氧传感器电压                                    $    $  伏特           $    $  ANS031.BYTE003  $  y=(x1*256+x2)*0.0049-1; 
  $  032.上游氧传感器加热器PWM占空比                         $    $  秒             $    $  ANS032.BYTE003  $  y=(x)*0.01; 
  $  033.下游氧传感器加热器PWM占空比                         $    $  秒             $    $  ANS033.BYTE003  $  y=(x)*0.01; 
  $  034.车速                                                $    $  千米/时        $    $  ANS034.BYTE003  $  y=(x)*1; 
  $  035.空气质量流量 （每小时）                             $    $  千克每小时     $    $  ANS035.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  036.传动链得到的制动踏板位置信号                        $    $  百分比         $    $  ANS036.BYTE003  $  y=(x1*256+x2)*0.39; 
  $  037.动力总成检测制动踏板位置电压原始值                  $    $  伏             $    $  ANS037.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*1; 
  $  038.环境压力修正系数                                    $    $                 $    $  ANS038.BYTE003  $  y=6.1e-05*(x1*256+x2); 
  $  039.发动机DBW灯亮后行驶里程值                           $    $  千米           $    $  ANS039.BYTE003  $  y=(x1*256+x2)*1; 
  $  040.发动机MIL灯亮后行驶里程值                           $    $  公里           $    $  ANS040.BYTE003  $  y=(x1*256+x2)*1; 
  $  041.发动机转速限制错误                                  $    $                 $    $  ANS041.BYTE003  $  y=(x&0x01)*1; 
  $  042.短期油量修正平均值                                  $    $                 $    $  ANS042.BYTE003  $  y=(x)*0.0078; 
  $  043.燃油修正长期加法值                                  $    $                 $    $  ANS043.BYTE003  $  y=(x1*256+x2)*0.0469; 
  $  044.长期乘法燃油修正                                    $    $                 $    $  ANS044.BYTE003  $  y=(x)*0.0078; 
  $  045.供油修正值                                          $    $                 $    $  ANS045.BYTE003  $  y=3e-05*(x1*256+x2); 
  $  046.点火平均角                                          $    $  千瓦*时        $    $  ANS046.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  047.1缸点火角                                           $    $  千瓦*时        $    $  ANS047.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  048.2缸点火角                                           $    $  千瓦*时        $    $  ANS048.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  049.3缸点火角                                           $    $  千瓦*时        $    $  ANS049.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  050.4缸点火角                                           $    $  千瓦*时        $    $  ANS050.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  051.喷射时间                                            $    $  毫秒           $    $  ANS051.BYTE003  $  y=(x)*0.1; 
  $  052.空调长期怠速调节值                                  $    $  转/分          $    $  ANS052.BYTE003  $  y=(x)*0.390625; 
  $  053.怠速长期调节                                        $    $  百分比         $    $  ANS053.BYTE003  $  y=(x1*256+x2)*0.001526; 
  $  054.怠速速度设定值                                      $    $  转/分          $    $  ANS054.BYTE003  $  y=(x)*10; 
  $  055.爆震点火角纠正值                                    $    $  度             $    $  ANS055.BYTE003  $  y=(x)*0.75; 
  $  056.爆震传感器电压                                      $    $  伏特           $    $  ANS056.BYTE003  $  y=7.63e-05*(x1*256+x2); 
  $  057.Lambda 设置点                                       $    $                 $    $  ANS057.BYTE003  $  y=(x1*256+x2)*0.000244; 
  $  058.1缸超过200转/分钟的失火数                           $    $  计数器         $    $  ANS058.BYTE003  $  y=(x1*256+x2)*1; 
  $  059.2缸失火数                                           $    $  计数器         $    $  ANS059.BYTE003  $  y=(x1*256+x2)*1; 
  $  060.3缸失火数                                           $    $  计数器         $    $  ANS060.BYTE003  $  y=(x1*256+x2)*1; 
  $  061.4缸失火数                                           $    $  次             $    $  ANS061.BYTE003  $  y=(x1*256+x2)*1; 
  $  062.上游氧传感器加热器状态-最大功率加热条件已达到       $    $                 $    $  ANS062.BYTE003  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  063.上游氧传感器加热器状态-上游氧传感器准备运行         $    $                 $    $  ANS062.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  064.上游氧传感器加热器状态-催化器超过露点标志位         $    $                 $    $  ANS062.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  065.上游氧传感器加热器状态-非全功率加热标志位           $    $                 $    $  ANS062.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  066.下游氧传感器加热器状态-下游氧传感器准备运行         $    $                 $    $  ANS063.BYTE003  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  067.下游氧传感器加热器状态-全功率加热标志位             $    $                 $    $  ANS063.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  068.下游氧传感器加热器状态-催化器超过露点标志位         $    $                 $    $  ANS063.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  069.下游氧传感器加热器状态-非全功率加热标志位           $    $                 $    $  ANS063.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  070.碳罐负载水平                                        $    $  千克/时        $    $  ANS064.BYTE003  $  y=(x1*256+x2)*0.001953125; 
  $  071.节气门控制-节气门开度1                              $    $  百分比         $    $  ANS065.BYTE003  $  y=(x)*0.392; 
  $  072.节气门控制-节气门开度2                              $    $  百分比         $    $  ANS066.BYTE003  $  y=(x)*0.392; 
  $  073.节气门控制-节气门开度                               $    $  百分比         $    $  ANS067.BYTE003  $  y=(x)*0.392; 
  $  074.节气门控制-节气门位置1传感器电压                    $    $  伏             $    $  ANS068.BYTE003  $  y=(x)*0.0195; 
  $  075.节气门控制-节气门位置2传感器电压                    $    $  伏             $    $  ANS069.BYTE003  $  y=(x)*0.0195; 
  $  076.电子节气门控制(ETC)-节气门相对角度                  $    $  开度           $    $  ANS070.BYTE003  $  y=(x1*256+x2)*0.0244; 
  $  077.电子节气门控制(ETC)-跛行回家时节气门位置            $    $  开度           $    $  ANS071.BYTE003  $  y=(x1*256+x2)*0.001526; 
  $  078.电子节气门控制(ETC)-节气门自适应设置点              $    $  开度           $    $  ANS072.BYTE003  $  y=(x1*256+x2)*0.001526; 
  $  079.节气门控制机械下止点自适应1传感器电压               $    $  伏             $    $  ANS073.BYTE003  $  y=(x)*0.01953125; 
  $  080.节气门控制机械下止点自适应2传感器电压               $    $  伏             $    $  ANS074.BYTE003  $  y=(x)*0.01953125; 
  $  081.开关式水泵带轮-驱动循环总计数                       $    $  次             $    $  ANS075.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*1; 
  $  082.开关式水泵带轮-SWP堵转发生计数                      $    $  次             $    $  ANS076.BYTE003  $  y=(x1*256+x2)*1; 
  $  083.开关式水泵带轮-SWP堵转解除计数                      $    $  次             $    $  ANS077.BYTE003  $  y=(x1*256+x2)*1; 
  $  084.开关式水泵带轮-开关式水泵占空比                     $    $  百分比         $    $  ANS078.BYTE003  $  y=(x1*256+x2)*10; 
  $  085.混合气自学习值                                      $    $                 $    $  ANS079.BYTE003  $  y=3e-05*(x1*256+x2); 
  $  086.自动变速器挡位                                      $    $                 $    $  ANS080.BYTE003  $  switxh(x)4294967295:@04cd;0x00:@092b;0x01:@0044;0x02:@0045;0x03:@0046;0x04:@0047;0x05:@0067;0x06:@0068;0x07:@0069;0x08:@04fa; 
  $  087.手动变速器变速器速比                                $    $                 $    $  ANS081.BYTE003  $  y=(x)*0.1; 
  $  088.手动变速器齿数比                                    $    $                 $    $  ANS082.BYTE003  $  y=(x)*1; 
  $  089.主动限速系统目标速度                                $    $  千米/时        $    $  ANS083.BYTE003  $  y=(x1*256+x2)*0.0078; 
  $  090.巡航控制目标速度                                    $    $  千米/时        $    $  ANS084.BYTE003  $  y=(x1*256+x2)*0.0078; 
  $  091.巡航加速度                                          $    $  米/秒平方      $    $  ANS085.BYTE003  $  y=(x1*256+x2)*0.00042-13.89; 
  $  092.外部环境温度(动力总成估计)                          $    $  度             $    $  ANS086.BYTE003  $  y=(x)*0.75-48; 
  $  093.发动机扭矩结构-附件设备请求的扭矩                   $    $  百分比         $    $  ANS087.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.003;elsey=(x1*256+x2-0xFFFF)*0.003; 
  $  094.发动机扭矩结构-发动机内部阻力扭矩                   $    $  百分比         $    $  ANS088.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  095.发动机扭矩结构-ESP扭矩减少慢速请求计数              $    $  百分比         $    $  ANS089.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  096.发动机扭矩结构-ESP扭矩减少快速请求计数              $    $  百分比         $    $  ANS090.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  097.发动机扭矩结构-摩擦扭矩自适应偏差值                 $    $  百分比         $    $  ANS091.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001526;elsey=(x1*256+x2-0xFFFF)*0.001526; 
  $  098.发动机扭矩结构-最大可得到的指示扭矩                 $    $  百分比         $    $  ANS092.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001526;elsey=(x1*256+x2-0xFFFF)*0.001526; 
  $  099.发动机扭矩结构-最小可得到的指示扭矩                 $    $  百分比         $    $  ANS093.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001526;elsey=(x1*256+x2-0xFFFF)*0.001526; 
  $  100.发动机扭矩结构-空调压缩机请求的扭矩                 $    $  牛米           $    $  ANS094.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  101.发动机扭矩结构-冷却风扇请求的扭矩                   $    $  百分比         $    $  ANS095.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  102.发动机扭矩结构-额外电器部件请求的扭矩               $    $  百分比         $    $  ANS096.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  103.发动机扭矩结构-动力转向请求的扭矩                   $    $  百分比         $    $  ANS097.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  104.发动机扭矩结构-TCU扭矩减少请求计数                  $    $  百分比         $    $  ANS098.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  105.发动机扭矩结构-TCU扭矩减少请求计数-变速箱保护       $    $  百分比         $    $  ANS099.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  106.发动机扭矩结构-指示扭矩实际值                       $    $  百分比         $    $  ANS100.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  107.发动机扭矩结构-指示扭矩基本值                       $    $  百分比         $    $  ANS101.BYTE003  $  if(0x80>x)y=(x)*0.3906;elsey=(x-0xFF)*0.3906; 
  $  108.发动机扭矩结构-发动机输出有效扭矩                   $    $  百分比         $    $  ANS102.BYTE003  $  y=(x1*256+x2)*0.003-100; 
  $  109.发动机扭矩结构-最大速度控制扭矩                     $    $  百分比         $    $  ANS103.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001526;elsey=(x1*256+x2-0xFFFF)*0.001526; 
  $  110.中压开关状态                                        $    $                 $    $  ANS104.BYTE003  $  switxh(x&0x40)0x00:@093d;0x40:@0208; 
  $  111.冷却风扇 2 继电器状态                               $    $                 $    $  ANS104.BYTE003  $  switxh(x&0x20)0x00:@093d;0x20:@0206; 
  $  112.冷却风扇 1 继电器状态                               $    $                 $    $  ANS104.BYTE003  $  switxh(x&0x10)0x00:@093d;0x10:@0206; 
  $  113.冷却风扇配置                                        $    $                 $    $  ANS104.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  114.空调压缩机请求状态                                  $    $                 $    $  ANS104.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  115.空调离合器继电器状态                                $    $                 $    $  ANS104.BYTE003  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  116.空调配置                                            $    $                 $    $  ANS104.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  117.空调高低压开关状态                                  $    $                 $    $  ANS104.BYTE004  $  switxh(x&0x02)0x00:@093d;0x02:@0208; 
  $  118.来自CAN的空调压缩机请求(ETC)                        $    $                 $    $  ANS104.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  119.错误存在-驾驶员请求命令 2                           $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  120.错误存在-驾驶员请求命令1                            $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  121.机动化节气门控制器故障发生                          $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  122.机动化节气门故障发生                                $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  123.故障发生-节气门位置2传感器                          $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  124.故障发生-节气门位置1传感器                          $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  125.错误发生-曲轴信号                                   $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  126.故障现象-凸轮轴信号                                 $    $                 $    $  ANS105.BYTE003  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  127.燃油泵继电器故障发生                                $    $                 $    $  ANS105.BYTE004  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  128.喷油器4故障发生                                     $    $                 $    $  ANS105.BYTE004  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  129.喷油器3故障发生                                     $    $                 $    $  ANS105.BYTE004  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  130.喷油器2故障发生                                     $    $                 $    $  ANS105.BYTE004  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  131.喷油器1故障发生                                     $    $                 $    $  ANS105.BYTE004  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  132.错误发生-进气温度信号                               $    $                 $    $  ANS105.BYTE005  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  133.错误发生-歧管压力传感器                             $    $                 $    $  ANS105.BYTE005  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  134.错误发生-空气流量信号                               $    $                 $    $  ANS105.BYTE005  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  135.故障发生-发动机冷却液温度传感器                     $    $                 $    $  ANS105.BYTE005  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  136.故障现象-下游氧传感器                               $    $                 $    $  ANS105.BYTE006  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  137.错误发生-上游氧传感器                               $    $                 $    $  ANS105.BYTE006  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  138.错误发生-爆震传感器                                 $    $                 $    $  ANS105.BYTE006  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  139.故障发生-排气相位控制阀                             $    $                 $    $  ANS105.BYTE006  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  140.故障发生-进气相位控制阀                             $    $                 $    $  ANS105.BYTE006  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  141.错误发生-点火线圈                                   $    $                 $    $  ANS105.BYTE006  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  142.引入的车身控制模块（BCM） CAN帧故障                 $    $                 $    $  ANS105.BYTE007  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  143.故障发生-输入的TCM CAN信号                          $    $                 $    $  ANS105.BYTE007  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  144.引入的ABS CAN帧故障发生                             $    $                 $    $  ANS105.BYTE007  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  145.故障发生-CAN总线关闭                                $    $                 $    $  ANS105.BYTE007  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  146.错误发生-制动踏板位置传感器                         $    $                 $    $  ANS105.BYTE008  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  147.故障发生-空调压力传感器                             $    $                 $    $  ANS105.BYTE008  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  148.错误发生-冷却风扇控制                               $    $                 $    $  ANS105.BYTE008  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  149.错误发生-制动真空度传感器                           $    $                 $    $  ANS105.BYTE009  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  150.错误发生-巡航电路                                   $    $                 $    $  ANS105.BYTE009  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  151.碳罐电磁阀故障发生                                  $    $                 $    $  ANS105.BYTE009  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  152.故障发生-驻车挡/空挡硬线输入                        $    $                 $    $  ANS105.BYTE009  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  153.错误发生-倒档开关                                   $    $                 $    $  ANS105.BYTE009  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  154.错误发生-离合器开关                                 $    $                 $    $  ANS105.BYTE009  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  155.故障发生-制动灯开关或制动位置传感器                 $    $                 $    $  ANS105.BYTE009  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  156.错误发生-起动继电器1                                $    $                 $    $  ANS105.BYTE010  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  157.飞轮自适应学习过程完成状态                          $    $                 $    $  ANS106.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  158.飞轮自适应学习过程完成状态                          $    $                 $    $  ANS106.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  159.发动机正在运行                                      $    $                 $    $  ANS106.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  160.发动机喷油点火信号同步完成                          $    $                 $    $  ANS106.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  161.发动机停止                                          $    $                 $    $  ANS106.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  162.点火状态-起动                                       $    $                 $    $  ANS106.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  163.点火状态-运行                                       $    $                 $    $  ANS106.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  164.节气门跛行回家激活                                  $    $                 $    $  ANS106.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  165.发动机满负荷阶段                                    $    $                 $    $  ANS106.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  166.发动机倒拖断油阶段                                  $    $                 $    $  ANS106.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  167.发动机倒拖阶段                                      $    $                 $    $  ANS106.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  168.发动机怠速阶段                                      $    $                 $    $  ANS106.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  169.发动机起动阶段                                      $    $                 $    $  ANS106.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  170.下游氧传感器加热器状态-全功率加热标志位             $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x80)0x00:@09b4;0x80:@0365; 
  $  171.上游氧传感器加热器状态-最大功率加热条件已达到       $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x40)0x00:@09b4;0x40:@0365; 
  $  172.下游氧传感器加热器状态-催化器超过露点标志位         $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x20)0x00:@09b4;0x20:@0365; 
  $  173.上游氧传感器加热器状态-催化器超过露点标志位         $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x10)0x00:@09b4;0x10:@0365; 
  $  174.下游氧传感器准备运行                                $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  175.上游氧传感器准备运行                                $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  176.闭环控制激活                                        $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  177.前氧传感器检测混合气浓                              $    $                 $    $  ANS106.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  178.倒档开关状态                                        $    $                 $    $  ANS107.BYTE003  $  switxh(x&0x80)0x00:@093d;0x80:@0208; 
  $  179.离合器开关状态                                      $    $                 $    $  ANS107.BYTE003  $  switxh(x&0x40)0x00:@093d;0x40:@0208; 
  $  180.制动开关 2 状态                                     $    $                 $    $  ANS107.BYTE003  $  switxh(x&0x20)0x00:@093d;0x20:@0208; 
  $  181.制动开关 1 状态                                     $    $                 $    $  ANS107.BYTE003  $  switxh(x&0x10)0x00:@093d;0x10:@0208; 
  $  182.燃油泵继电器状态                                    $    $                 $    $  ANS107.BYTE003  $  switxh(x&0x08)0x00:@093d;0x08:@0206; 
  $  183.VCT排气执行器已就绪(VVT)                            $    $                 $    $  ANS107.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  184.VCT排气执行器状态                                   $    $                 $    $  ANS107.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  185.VCT进气执行器已就绪(VVT)                            $    $                 $    $  ANS107.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  186.VCT进气执行器状态                                   $    $                 $    $  ANS107.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  187.碰撞CAN信号输入状态                                 $    $                 $    $  ANS107.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  188.炭罐状态                                            $    $                 $    $  ANS107.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  189.驻车挡/空挡开关状态                                 $    $                 $    $  ANS107.BYTE005  $  switxh(x&0x01)0x00:@093d;0x01:@0208; 
  $  190.后氧传感器加热器状态                                $    $                 $    $  ANS107.BYTE006  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  191.前氧传感器加热状态                                  $    $                 $    $  ANS107.BYTE006  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  192.发动机DBW灯状态                                     $    $                 $    $  ANS107.BYTE006  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  193.发动机MIL灯状态                                     $    $                 $    $  ANS107.BYTE006  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  194.防盗状态-数据传输已存储并锁定                       $    $                 $    $  ANS108.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  195.防盗状态-数据传输已完成                             $    $                 $    $  ANS108.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  196.防盗状态-数据传输超时                               $    $                 $    $  ANS108.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  197.防盗状态-数据传输已开始                             $    $                 $    $  ANS108.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  198.防盗状态-密钥和PIN码未存储                          $    $                 $    $  ANS108.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  199.防盗状态-防盗功能激活状态                           $    $                 $    $  ANS108.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  200.防盗状态-ECU状态                                    $    $                 $    $  ANS108.BYTE004  $  switxh(x&0x10)0x00:@001f;0x10:@06fb; 
  $  201.防盗状态-响应有效-正确的格式                        $    $                 $    $  ANS108.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  202.防盗状态-响应无效-正确的格式                        $    $                 $    $  ANS108.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  203.防盗状态-响应无效-错误的格式                        $    $                 $    $  ANS108.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  204.防盗状态-报文发送                                   $    $                 $    $  ANS108.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  205.跛行回家-可变凸轮轴正时(VCT)请求                    $    $                 $    $  ANS109.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  206.跛行回家-节气门电机故障                             $    $                 $    $  ANS109.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  207.跛行回家-TCM请求                                    $    $                 $    $  ANS109.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  208.跛行回家-节气门自适应故障                           $    $                 $    $  ANS109.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  209.跛行回家-凸轮轴传感器信号异常                       $    $                 $    $  ANS109.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  210.跛行回家-曲轴传感器信号异常                         $    $                 $    $  ANS109.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  211.变速器状态-起动允许状态                             $    $                 $    $  ANS110.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  212.变速器状态-换挡过程中                               $    $                 $    $  ANS110.BYTE003  $  switxh(x&0x10)0x00:@00e7;0x10:@008b; 
  $  213.变速器状态-蠕行控制功能激活                         $    $                 $    $  ANS110.BYTE003  $  switxh(x&0x08)0x00:@00e7;0x08:@008b; 
  $  214.变速器状态-非排放相关故障激活                       $    $                 $    $  ANS110.BYTE003  $  switxh(x&0x04)0x00:@00e7;0x04:@008b; 
  $  215.变速器状态-排放相关故障激活                         $    $                 $    $  ANS110.BYTE003  $  switxh(x&0x02)0x00:@00e7;0x02:@008b; 
  $  216.变速器状态-变速器配置                               $    $                 $    $  ANS110.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  217.主动限速控制状态                                    $    $                 $    $  ANS111.BYTE003  $  switxh(x&0xE0)0x00:@002e;0x20:@0030;0x40:@07e4;0x60:@07e5;0x80:@0452;0xA0:@0084; 
  $  218.巡航控制状态                                        $    $                 $    $  ANS111.BYTE003  $  switxh(x&0x1C)0x00:@002e;0x04:@091c;0x08:@091d;0x0C:@091e;0x10:@0370;0x14:@0920;0x18:@0004; 
  $  219.车速控制-车速单位                                   $    $                 $    $  ANS111.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  220.车速控制-驾驶员加速踏板优先                         $    $                 $    $  ANS111.BYTE003  $  switxh(x&0x01)0x00:@06e3;0x01:@08d5; 
  $  221.巡航控制-车速控制输入暂停请求                       $    $                 $    $  ANS111.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  222.巡航控制-车速控制输入恢复请求                       $    $                 $    $  ANS111.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  223.巡航控制-车速控制输入减速请求(按下并保持)           $    $                 $    $  ANS111.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  224.巡航控制-车速控制输入减速请求(轻按)                 $    $                 $    $  ANS111.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  225.巡航控制-车速控制输入加速请求(按下并保持)           $    $                 $    $  ANS111.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  226.巡航控制-车速控制输入加速请求(轻按)                 $    $                 $    $  ANS111.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  227.巡航控制-巡航主开关输入                             $    $                 $    $  ANS111.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  228.巡航控制-巡航激活指示灯可用                         $    $                 $    $  ANS111.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  229.巡航控制-巡航待命指示灯可用                         $    $                 $    $  ANS111.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  230.巡航控制-制动踏板踩下                               $    $                 $    $  ANS111.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  231.巡航控制-离合器踏板踩下                             $    $                 $    $  ANS111.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  232.巡航禁用-开关信号一致性                             $    $                 $    $  ANS112.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  233.巡航禁用-安全监控中                                 $    $                 $    $  ANS112.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  234.巡航禁用-一般故障状态                               $    $                 $    $  ANS112.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  235.巡航禁用-安全气囊点爆                               $    $                 $    $  ANS112.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  236.巡航禁用-错误备份                                   $    $                 $    $  ANS112.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  237.巡航禁用-巡航主开关按下                             $    $                 $    $  ANS112.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  238.巡航禁用-车速未达到进入阀值                         $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  239.巡航禁用-远高于巡航目标速度                         $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  240.巡航禁用-远低于巡航目标速度                         $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  241.巡航禁用-制动踏板踩下                               $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  242.巡航禁用-离合器踏板踩下或挡位改变                   $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  243.巡航禁用-挡位超限                                   $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  244.巡航禁用-发动机转速超限                             $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  245.巡航禁用-扭矩干预                                   $    $                 $    $  ANS112.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  246.巡航禁用-变速器故障                                 $    $                 $    $  ANS112.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  247.巡航禁用-加速度太大                                 $    $                 $    $  ANS112.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  248.巡航禁用-加速度太小                                 $    $                 $    $  ANS112.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  249.巡航禁用-强制降挡                                   $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  250.巡航禁用-蓄电池电压低                               $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  251.巡航禁用-发动机故障警告指示(DBW)灯亮                $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  252.巡航禁用-加速踏板                                   $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  253.巡航禁用-车速信号异常                               $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  254.巡航禁用-电子节气门控制故障                         $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  255.巡航禁用-驾驶员操作异常                             $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  256.巡航禁用-发动机转速超限                             $    $                 $    $  ANS112.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  257.催化就绪标志                                        $    $                 $    $  ANS113.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  258.下游氧传感器准备就绪                                $    $                 $    $  ANS113.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  259.上游氧传感器准备就绪                                $    $                 $    $  ANS113.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  260.燃油系统的就绪标志                                  $    $                 $    $  ANS113.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  261.B4 类失火就绪标志                                   $    $                 $    $  ANS113.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  262.B1 类失火就绪标志                                   $    $                 $    $  ANS113.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  263.A类失火就绪标志                                     $    $                 $    $  ANS113.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  264.综合零件监视状态                                    $    $                 $    $  ANS113.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  265.燃油系统监控状态                                    $    $                 $    $  ANS113.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  266.失火监控状态                                        $    $                 $    $  ANS113.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  267.支持综合零件监视                                    $    $                 $    $  ANS113.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  268.支持燃油系统监控                                    $    $                 $    $  ANS113.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  269.支持失火监控                                        $    $                 $    $  ANS113.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  270.氧传感器加热器监控                                  $    $                 $    $  ANS113.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  271.氧传感器监控                                        $    $                 $    $  ANS113.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  272.催化器监控                                          $    $                 $    $  ANS113.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  273.扭矩型号状态                                        $    $                 $    $  ANS114.BYTE004  $  switxh(x&0xC0)0x00:@00b1;0x40:@07b8;0x80:@0824;0xC0:@099f; 
  $  274.动态稳定控制系统(DSC)状态                           $    $                 $    $  ANS114.BYTE004  $  switxh(x&0x30)0x00:@002e;0x10:@052e;0x20:@0070;0x30:@001a; 
  $  275.牵引力控制系统(TCS)状态                             $    $                 $    $  ANS114.BYTE004  $  switxh(x&0x0C)0x00:@002e;0x04:@052e;0x08:@0070;0x0C:@001a; 
  $  276.ASR发出的钮矩减少激活                               $    $                 $    $  ANS114.BYTE004  $  switxh(x&0x02)0x00:@00e7;0x02:@008b; 
  $  277.MSR扭矩需求激活                                     $    $                 $    $  ANS114.BYTE004  $  switxh(x&0x01)0x00:@00e7;0x01:@008b; 
  $  278.开关式水泵带轮-控制请求状态                         $    $                 $    $  ANS115.BYTE003  $  switxh(x&0x20)0x00:@0c09;0x20:@0c0a; 
  $  279.开关式水泵带轮-运行状态                             $    $                 $    $  ANS115.BYTE003  $  switxh(x&0x10)0x00:@0c0b;0x10:@0c0c; 
  $  280.开关式水泵带轮-故障状态                             $    $                 $    $  ANS115.BYTE003  $  switxh(x&0x0F)0x00:@00c8;0x01:@0c0d;0x02:@0c0e;0x03:@0c0f; 

;******************************************************************************************************************************************************

