
     系统名称:ECM (发动机控制模块)

     系统ID:000044AD

;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 03 00 00 00 00 00       $~ ANS000:7E8 02 10 03 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

     通讯线:$~#6$~#14$~500K$~7E8,718,748

进入命令:

  $~ REQ000:7E0 02 10 01 00 00 00 00 00       $~ ANS000:7E8 02 10 01 00 00 00 00 00
  $~ REQ001:7E0 03 22 F1 91 00 00 00 00       $~ ANS001:7E8 03 22 F1 91 00 00 00 00

		提示:版本号由ANS001.BYTE03-BYTE06,4个字节的十六进制控制,或BYTE03-BYTE10,8个字节的ASCII控制.

空闲命令:

  $! REQ000:7E0 02 3E 00 00 00 00 00 00       $! ANS000:7E8 02 3E 00 00 00 00 00 00


;******************************************************************************************************************************************************

退出命令:


;******************************************************************************************************************************************************

  $~~ REQ000:710 02 10 01 00 00 00 00 00       $~~ 
  $~~ REQ001:710 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ002:710 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ003:710 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ004:710 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ005:710 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ006:710 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ007:710 05 31 03 AA FF 00 00 00       $~~ 
  $~~ REQ008:740 02 10 03 00 00 00 00 00       $~~ 
  $~~ REQ009:740 06 27 41 3E AB 00 0D 00       $~~ 
  $~~ REQ010:740 06 27 42 00 00 00 00 00       $~~ 
  $~~ REQ011:740 02 27 01 00 00 00 00 00       $~~ 
  $~~ REQ012:740 06 27 02 00 00 00 00 00       $~~ 
  $~~ REQ013:740 04 31 01 AA FF 00 00 00       $~~ 
  $~~ REQ014:740 05 31 03 AA FF 00 00 00       $~~ 

<VCI>
	<ACTIVE_ADDNODE type="0" num="0">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_00_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<ACTIVE_ADDNODE type="0" num="1">
		<!--荣威/名爵特殊激活-->
		<param type="string" value="-2"/>
		<!--设置引脚和波特率-->
		<param type="string" value="6,14,500000"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_000,KEY_CMD_00_001,KEY_CMD_00_008"/>
		<!--加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_002,KEY_CMD_00_003"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--网关安全算法种cass-->
		<param type="string" value="79"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_004,KEY_CMD_00_005,KEY_CMD_00_006,KEY_CMD_00_007"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数--> 
		<param type="string" value="0,2,4,1,5,4"/>
		<!--车身加密算法case-->
		<param type="string" value="200"/>
		<!--第一层加密命令-->
		<param type="command" value="KEY_CMD_00_009,KEY_CMD_00_010"/>
		<!--读命令偏移,读字节偏移,读取字节个数,写命令偏移,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--安全算法种cass-->
		<param type="string" value="100"/>
		<!--读命令,写命令-->
		<param type="command" value="KEY_CMD_00_011,KEY_CMD_00_012,KEY_CMD_00_013,KEY_CMD_00_014"/>
		<!--读字节偏移,读取字节个数,写字节偏移+3，修改字节个数-->
		<param type="string" value="0,2,4,1,5,4"/>
		<!--重新激活-->
		<param type="command" value="ENTER_CMD_01_000,ENTER_CMD_00_001"/>
	</ACTIVE_ADDNODE>
	<VERSION num="0">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10233496&quot;: &quot;000044AC&quot;, &quot;10594009&quot;: &quot;000044AC&quot;, &quot;10740521&quot;: &quot;000044AC&quot;, &quot;10456881&quot;: &quot;000044AD&quot;, &quot;10122527&quot;: &quot;000044AE&quot;, &quot;10425930&quot;: &quot;000044AF&quot;, &quot;10385653&quot;: &quot;000044B0&quot;}"/>
		</call_protocol>
	</VERSION>
	<VERSION num="1">
		<call_protocol label="reload_path" function="get_info_scanf_version">
		<!-- 用于表示版本号所在存储区域 对应命令表中的 buffer_offset --> 
		<param type="string" value="1"/>
		<!-- 用于表示版本号开始字节在帧中的位置 -->
		<param type="string" value="3"/>
		<!-- 用于表示版本号字节长度 -->
		<param type="string" value="4,8"/>
		<!-- 用于表示扫版本号类型 -->
		<param type="string" value="2,0"/>
		<param type="string" value="{&quot;10233496&quot;: &quot;000044AC&quot;, &quot;10594009&quot;: &quot;000044AC&quot;, &quot;10740521&quot;: &quot;000044AC&quot;, &quot;10456881&quot;: &quot;000044AD&quot;, &quot;10122527&quot;: &quot;000044AE&quot;, &quot;10425930&quot;: &quot;000044AF&quot;, &quot;10385653&quot;: &quot;000044B0&quot;}"/>
		</call_protocol>
	</VERSION>
</VCI>

;******************************************************************************************************************************************************

读取故障码:

<RDTC>
	<FUNCTION type="0" num="0">
		<param type="system_path" value=""/>
	</FUNCTION>
</RDTC>

  $#  REQ000:7E0 03 19 02 2C 00 00 00 00            $#  

			故障码表示:帧长决定故障个数,$#BYTE03$#开始表示故障码,每$#4$#个字节表示一个故障码,前$#3$#个字节表示码号.

			码库: $*$*DTC/000044AD

			读码方式:case 13

;******************************************************************************************************************************************************

清除故障码:

  $$  REQ000:7E0 04 14 FF FF FF 00 00 00            $$  

;******************************************************************************************************************************************************

版本信息:

  $%  REQ000:7E0 03 22 F1 90 00 00 00 00            $%  
  $%  REQ001:7E0 03 22 F1 A8 00 00 00 00            $%  
  $%  REQ002:7E0 03 22 F1 87 00 00 00 00            $%  
  $%  REQ003:7E0 03 22 F1 91 00 00 00 00            $%  
  $%  REQ004:7E0 03 22 F1 A0 00 00 00 00            $%  
  $%  REQ005:7E0 03 22 F1 A1 00 00 00 00            $%  
  $%  REQ006:7E0 03 22 F1 8B 00 00 00 00            $%  
  $%  REQ007:7E0 03 22 F1 10 00 00 00 00            $%  
  $%  REQ008:7E0 03 22 F1 20 00 00 00 00            $%  
  $%  REQ009:7E0 03 22 F1 A5 00 00 00 00            $%  
  $%  REQ010:7E0 03 22 F1 8C 00 00 00 00            $%  
  $%  REQ011:7E0 03 22 F1 00 00 00 00 00            $%  

  $%  000:车辆识别代码(VIN)               $%    $%  ANS000.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17); 
  $%  001:车辆特征信息 (FK)               $%    $%  ANS001.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16,x17,x18,x19,x20); 
  $%  002:电控单元零件号                  $%    $%  ANS002.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  003:电控单元硬件号                  $%    $%  ANS003.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  004:电控单元应用软件号              $%    $%  ANS004.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  005:电控单元标定软件号              $%    $%  ANS005.BYTE003  $%  HEX(x1,x2,x3,x4,x5); 
  $%  006:电控单元制造日期                $%    $%  ANS006.BYTE003  $%  HEX(x1,x2,x3); 
  $%  007:刷新里程读数                    $%    $%  ANS007.BYTE014  $%  y=(x1*65536+x2*256+x3)*1; 
  $%  008:网络配置文件零件号出厂值        $%    $%  ANS008.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15,x16); 
  $%  009:电控单元索引信息                $%    $%  ANS009.BYTE003  $%  HEX(x1,x2,x3); 
  $%  010:电控单元序列号                  $%    $%  ANS010.BYTE003  $%  ASCII(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11,x12,x13,x14,x15); 
  $%  011:刷新工具参考号记录              $%    $%  ANS007.BYTE008  $%  HEX(x1,x2,x3,x4,x5,x6); 
  $%  012:ECU软件校验号                   $%    $%  ANS011.BYTE003  $%  HEX(x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x11); 

;******************************************************************************************************************************************************

数据流:

  $  REQ000:7E0 03 22 B0 00 00 00 00 00            $  
  $  REQ001:7E0 03 22 B0 03 00 00 00 00            $  
  $  REQ002:7E0 03 22 B0 04 00 00 00 00            $  
  $  REQ003:7E0 03 22 B0 17 00 00 00 00            $  
  $  REQ004:7E0 03 22 B0 18 00 00 00 00            $  
  $  REQ005:7E0 03 22 B0 19 00 00 00 00            $  
  $  REQ006:7E0 03 22 B0 20 00 00 00 00            $  
  $  REQ007:7E0 03 22 B0 26 00 00 00 00            $  
  $  REQ008:7E0 03 22 B0 29 00 00 00 00            $  
  $  REQ009:7E0 03 22 B0 30 00 00 00 00            $  
  $  REQ010:7E0 03 22 B0 32 00 00 00 00            $  
  $  REQ011:7E0 03 22 B0 33 00 00 00 00            $  
  $  REQ012:7E0 03 22 B0 34 00 00 00 00            $  
  $  REQ013:7E0 03 22 B0 35 00 00 00 00            $  
  $  REQ014:7E0 03 22 B0 38 00 00 00 00            $  
  $  REQ015:7E0 03 22 B0 43 00 00 00 00            $  
  $  REQ016:7E0 03 22 B0 49 00 00 00 00            $  
  $  REQ017:7E0 03 22 B0 50 00 00 00 00            $  
  $  REQ018:7E0 03 22 B0 51 00 00 00 00            $  
  $  REQ019:7E0 03 22 B0 52 00 00 00 00            $  
  $  REQ020:7E0 03 22 B0 53 00 00 00 00            $  
  $  REQ021:7E0 03 22 B0 54 00 00 00 00            $  
  $  REQ022:7E0 03 22 B0 55 00 00 00 00            $  
  $  REQ023:7E0 03 22 B0 56 00 00 00 00            $  
  $  REQ024:7E0 03 22 B0 57 00 00 00 00            $  
  $  REQ025:7E0 03 22 B0 58 00 00 00 00            $  
  $  REQ026:7E0 03 22 B0 61 00 00 00 00            $  
  $  REQ027:7E0 03 22 B0 68 00 00 00 00            $  
  $  REQ028:7E0 03 22 B1 03 00 00 00 00            $  
  $  REQ029:7E0 03 22 B1 15 00 00 00 00            $  
  $  REQ030:7E0 03 22 B1 19 00 00 00 00            $  
  $  REQ031:7E0 03 22 B1 20 00 00 00 00            $  
  $  REQ032:7E0 03 22 B1 21 00 00 00 00            $  
  $  REQ033:7E0 03 22 B1 22 00 00 00 00            $  
  $  REQ034:7E0 03 22 B1 23 00 00 00 00            $  
  $  REQ035:7E0 03 22 B1 24 00 00 00 00            $  
  $  REQ036:7E0 03 22 B1 25 00 00 00 00            $  
  $  REQ037:7E0 03 22 B1 26 00 00 00 00            $  
  $  REQ038:7E0 03 22 B1 27 00 00 00 00            $  
  $  REQ039:7E0 03 22 B1 30 00 00 00 00            $  
  $  REQ040:7E0 03 22 B1 33 00 00 00 00            $  
  $  REQ041:7E0 03 22 B1 34 00 00 00 00            $  
  $  REQ042:7E0 03 22 B1 35 00 00 00 00            $  
  $  REQ043:7E0 03 22 B1 36 00 00 00 00            $  
  $  REQ044:7E0 03 22 B1 40 00 00 00 00            $  
  $  REQ045:7E0 03 22 B1 41 00 00 00 00            $  
  $  REQ046:7E0 03 22 B1 43 00 00 00 00            $  
  $  REQ047:7E0 03 22 B1 44 00 00 00 00            $  
  $  REQ048:7E0 03 22 B1 45 00 00 00 00            $  
  $  REQ049:7E0 03 22 B1 46 00 00 00 00            $  
  $  REQ050:7E0 03 22 B1 50 00 00 00 00            $  
  $  REQ051:7E0 03 22 B1 51 00 00 00 00            $  
  $  REQ052:7E0 03 22 B1 52 00 00 00 00            $  
  $  REQ053:7E0 03 22 B1 56 00 00 00 00            $  
  $  REQ054:7E0 03 22 B1 57 00 00 00 00            $  
  $  REQ055:7E0 03 22 B1 58 00 00 00 00            $  
  $  REQ056:7E0 03 22 B1 59 00 00 00 00            $  
  $  REQ057:7E0 03 22 B1 60 00 00 00 00            $  
  $  REQ058:7E0 03 22 B1 61 00 00 00 00            $  
  $  REQ059:7E0 03 22 B1 62 00 00 00 00            $  
  $  REQ060:7E0 03 22 B1 63 00 00 00 00            $  
  $  REQ061:7E0 03 22 B1 64 00 00 00 00            $  
  $  REQ062:7E0 03 22 B1 65 00 00 00 00            $  
  $  REQ063:7E0 03 22 B1 79 00 00 00 00            $  
  $  REQ064:7E0 03 22 B2 00 00 00 00 00            $  
  $  REQ065:7E0 03 22 B2 01 00 00 00 00            $  
  $  REQ066:7E0 03 22 B2 02 00 00 00 00            $  
  $  REQ067:7E0 03 22 B2 03 00 00 00 00            $  
  $  REQ068:7E0 03 22 B2 04 00 00 00 00            $  
  $  REQ069:7E0 03 22 B2 05 00 00 00 00            $  
  $  REQ070:7E0 03 22 B2 12 00 00 00 00            $  
  $  REQ071:7E0 03 22 B3 00 00 00 00 00            $  
  $  REQ072:7E0 03 22 B3 01 00 00 00 00            $  
  $  REQ073:7E0 03 22 B3 04 00 00 00 00            $  
  $  REQ074:7E0 03 22 B3 05 00 00 00 00            $  
  $  REQ075:7E0 03 22 B3 06 00 00 00 00            $  
  $  REQ076:7E0 03 22 B3 07 00 00 00 00            $  
  $  REQ077:7E0 03 22 B3 08 00 00 00 00            $  
  $  REQ078:7E0 03 22 B3 14 00 00 00 00            $  
  $  REQ079:7E0 03 22 B3 16 00 00 00 00            $  
  $  REQ080:7E0 03 22 B3 17 00 00 00 00            $  
  $  REQ081:7E0 03 22 B4 01 00 00 00 00            $  
  $  REQ082:7E0 03 22 B4 02 00 00 00 00            $  
  $  REQ083:7E0 03 22 B4 03 00 00 00 00            $  
  $  REQ084:7E0 03 22 B4 04 00 00 00 00            $  
  $  REQ085:7E0 03 22 B4 05 00 00 00 00            $  
  $  REQ086:7E0 03 22 B4 12 00 00 00 00            $  
  $  REQ087:7E0 03 22 B4 13 00 00 00 00            $  
  $  REQ088:7E0 03 22 B4 14 00 00 00 00            $  
  $  REQ089:7E0 03 22 B0 05 00 00 00 00            $  
  $  REQ090:7E0 03 22 B0 12 00 00 00 00            $  
  $  REQ091:7E0 03 22 B0 70 00 00 00 00            $  
  $  REQ092:7E0 03 22 B0 71 00 00 00 00            $  
  $  REQ093:7E0 03 22 B1 01 00 00 00 00            $  
  $  REQ094:7E0 03 22 B1 02 00 00 00 00            $  
  $  REQ095:7E0 03 22 B2 23 00 00 00 00            $  
  $  REQ096:7E0 03 22 B2 24 00 00 00 00            $  
  $  REQ097:7E0 03 22 B4 20 00 00 00 00            $  
  $  REQ098:7E0 03 22 B4 21 00 00 00 00            $  
  $  REQ099:7E0 03 22 B4 22 00 00 00 00            $  
  $  REQ100:7E0 03 22 B0 0A 00 00 00 00            $  
  $  REQ101:7E0 03 22 B0 0B 00 00 00 00            $  
  $  REQ102:7E0 03 22 B0 0E 00 00 00 00            $  
  $  REQ103:7E0 03 22 B0 0F 00 00 00 00            $  
  $  REQ104:7E0 03 22 B0 3B 00 00 00 00            $  
  $  REQ105:7E0 03 22 B0 13 00 00 00 00            $  
  $  REQ106:7E0 03 22 B0 14 00 00 00 00            $  
  $  REQ107:7E0 03 22 B0 24 00 00 00 00            $  
  $  REQ108:7E0 03 22 B0 44 00 00 00 00            $  
  $  REQ109:7E0 03 22 B0 45 00 00 00 00            $  
  $  REQ110:7E0 03 22 B0 60 00 00 00 00            $  
  $  REQ111:7E0 03 22 B0 67 00 00 00 00            $  
  $  REQ112:7E0 03 22 B0 69 00 00 00 00            $  
  $  REQ113:7E0 03 22 B1 07 00 00 00 00            $  
  $  REQ114:7E0 03 22 B1 08 00 00 00 00            $  
  $  REQ115:7E0 03 22 B1 09 00 00 00 00            $  
  $  REQ116:7E0 03 22 B1 10 00 00 00 00            $  
  $  REQ117:7E0 03 22 B1 11 00 00 00 00            $  
  $  REQ118:7E0 03 22 B1 16 00 00 00 00            $  
  $  REQ119:7E0 03 22 B1 18 00 00 00 00            $  
  $  REQ120:7E0 03 22 B1 31 00 00 00 00            $  
  $  REQ121:7E0 03 22 B1 37 00 00 00 00            $  
  $  REQ122:7E0 03 22 B1 38 00 00 00 00            $  
  $  REQ123:7E0 03 22 B1 39 00 00 00 00            $  
  $  REQ124:7E0 03 22 B1 49 00 00 00 00            $  
  $  REQ125:7E0 03 22 B2 07 00 00 00 00            $  
  $  REQ126:7E0 03 22 B2 18 00 00 00 00            $  
  $  REQ127:7E0 03 22 B2 19 00 00 00 00            $  
  $  REQ128:7E0 03 22 B2 20 00 00 00 00            $  
  $  REQ129:7E0 03 22 B2 21 00 00 00 00            $  
  $  REQ130:7E0 03 22 B3 10 00 00 00 00            $  
  $  REQ131:7E0 03 22 B3 18 00 00 00 00            $  
  $  REQ132:7E0 03 22 B3 19 00 00 00 00            $  
  $  REQ133:7E0 03 22 B3 20 00 00 00 00            $  
  $  REQ134:7E0 03 22 B3 21 00 00 00 00            $  
  $  REQ135:7E0 03 22 B3 22 00 00 00 00            $  
  $  REQ136:7E0 03 22 B3 23 00 00 00 00            $  
  $  REQ137:7E0 03 22 B3 24 00 00 00 00            $  
  $  REQ138:7E0 03 22 B3 25 00 00 00 00            $  
  $  REQ139:7E0 03 22 B3 26 00 00 00 00            $  
  $  REQ140:7E0 03 22 B3 27 00 00 00 00            $  
  $  REQ141:7E0 03 22 B3 28 00 00 00 00            $  
  $  REQ142:7E0 03 22 B3 29 00 00 00 00            $  
  $  REQ143:7E0 03 22 B3 30 00 00 00 00            $  
  $  REQ144:7E0 03 22 B3 31 00 00 00 00            $  
  $  REQ145:7E0 03 22 B3 35 00 00 00 00            $  
  $  REQ146:7E0 03 22 B3 36 00 00 00 00            $  
  $  REQ147:7E0 03 22 B3 37 00 00 00 00            $  
  $  REQ148:7E0 03 22 B3 38 00 00 00 00            $  
  $  REQ149:7E0 03 22 B4 15 00 00 00 00            $  

  $  000.周围空气压力                                                   $    $  千帕             $    $  ANS000.BYTE003  $  y=(x1*256+x2)*0.0039; 
  $  001.ECM供电电压(KL87)                                              $    $  伏               $    $  ANS001.BYTE003  $  y=(x1*256+x2)*0.0236; 
  $  002.钥匙开启后电压                                                 $    $  伏               $    $  ANS002.BYTE003  $  y=(x)*0.094; 
  $  003.进气凸轮轴相位(VVT)                                            $    $  度               $    $  ANS003.BYTE003  $  if(0x80>x)y=(x)*0.0078125;elsey=(x-0xFF)*0.0078125; 
  $  004.排气凸轮轴相位(VVT)                                            $    $  度               $    $  ANS004.BYTE003  $  if(0x80>x)y=(x)*0.0078125;elsey=(x-0xFF)*0.0078125; 
  $  005.气门重叠角(VVT)                                                $    $  度               $    $  ANS005.BYTE003  $  y=(x1*256+x2)*0.0078125; 
  $  006.碳罐PWM占空比                                                  $    $  百分比           $    $  ANS006.BYTE003  $  y=(x1*256+x2)*0.0015; 
  $  007.油门踏板需求                                                   $    $  百分比           $    $  ANS007.BYTE003  $  y=(x)*0.392; 
  $  008.加速踏板位置1传感器电压                                        $    $  伏               $    $  ANS008.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  009.加速踏板位置2传感器电压                                        $    $  伏               $    $  ANS009.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  010.发动机冷却液温度                                               $    $  摄氏度           $    $  ANS010.BYTE003  $  y=(x)*0.75-48; 
  $  011.发动机冷却液温度传感器电压                                     $    $  伏               $    $  ANS011.BYTE003  $  y=(x)*0.00488; 
  $  012.发动机油温度                                                   $    $  摄氏度           $    $  ANS012.BYTE003  $  y=(x)*0.75-48; 
  $  013.机油温度传感器电压                                             $    $  伏               $    $  ANS013.BYTE003  $  y=(x1*256+x2)*0.0234-273.15; 
  $  014.发动机转速                                                     $    $  转/分            $    $  ANS014.BYTE003  $  y=(x1*256+x2)*0.25; 
  $  015.油箱油位                                                       $    $  升               $    $  ANS015.BYTE003  $  y=(x)*0.1; 
  $  016.进气歧管空气温度                                               $    $  摄氏度           $    $  ANS016.BYTE003  $  y=(x)*0.75-48; 
  $  017.进气歧管空气温度传感器电压                                     $    $  伏               $    $  ANS017.BYTE003  $  y=(x)*0.00488; 
  $  018.进气歧管绝对压力                                               $    $  千帕             $    $  ANS018.BYTE003  $  y=(x)*0.0078125; 
  $  019.进气歧管绝对压力电压原始值                                     $    $  伏               $    $  ANS019.BYTE003  $  y=(x)*0.00488; 
  $  020.后氧传感器电压                                                 $    $  伏特             $    $  ANS020.BYTE003  $  y=(x)*0.0052-0.2; 
  $  021.下游氧传感器电压                                               $    $  伏特             $    $  ANS021.BYTE003  $  y=(x1*256+x2)*0.0049-1; 
  $  022.前氧传感器电压                                                 $    $  伏特             $    $  ANS022.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  023.上游氧传感器电压                                               $    $  伏特             $    $  ANS023.BYTE003  $  y=(x1*256+x2)*0.00488-1; 
  $  024.上游氧传感器加热器PWM占空比                                    $    $  秒               $    $  ANS024.BYTE003  $  y=3.89e-05*(x1*256+x2); 
  $  025.下游氧传感器加热器PWM占空比                                    $    $  秒               $    $  ANS025.BYTE003  $  y=(x)*0.01; 
  $  026.车速                                                           $    $  千米/时          $    $  ANS026.BYTE003  $  y=(x)*1.25; 
  $  027.空气质量流量 （每小时）                                        $    $  千克每小时       $    $  ANS027.BYTE003  $  y=(x1*256+x2)*0.1; 
  $  028.发动机MIL灯亮后行驶里程值                                      $    $  公里             $    $  ANS028.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.01; 
  $  029.发动机转速限制错误                                             $    $                   $    $  ANS029.BYTE003  $  y=(x&0x01)*1; 
  $  030.短期油量修正平均值                                             $    $                   $    $  ANS030.BYTE003  $  y=(x)*1; 
  $  031.燃油修正长期加法值                                             $    $                   $    $  ANS031.BYTE003  $  y=(x)*1; 
  $  032.长期乘法燃油修正                                               $    $                   $    $  ANS032.BYTE003  $  y=3e-05*(x1*256+x2); 
  $  033.供油修正值                                                     $    $                   $    $  ANS033.BYTE003  $  y=3e-05*(x1*256+x2); 
  $  034.点火平均角                                                     $    $  千瓦*时          $    $  ANS034.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  035.1缸点火角                                                      $    $  千瓦*时          $    $  ANS035.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  036.2缸点火角                                                      $    $  千瓦*时          $    $  ANS036.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  037.3缸点火角                                                      $    $  千瓦*时          $    $  ANS037.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  038.4缸点火角                                                      $    $  千瓦*时          $    $  ANS038.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  039.喷射时间                                                       $    $  毫秒             $    $  ANS039.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*0.001; 
  $  040.空调长期怠速调节值                                             $    $  转/分            $    $  ANS040.BYTE003  $  y=(x)*10; 
  $  041.怠速长期调节                                                   $    $  百分比           $    $  ANS041.BYTE003  $  y=(x1*256+x2)*0.001526; 
  $  042.怠速速度设定值                                                 $    $  转/分            $    $  ANS042.BYTE003  $  y=(x)*10; 
  $  043.爆震点火角纠正值                                               $    $  度               $    $  ANS043.BYTE003  $  if(0x80>x)y=(x)*0.75;elsey=(x-0xFF)*0.75; 
  $  044.爆震传感器电压                                                 $    $  伏特             $    $  ANS044.BYTE003  $  y=7.63e-05*(x1*256+x2); 
  $  045.Lambda 设置点                                                  $    $                   $    $  ANS045.BYTE003  $  y=(x1*256+x2)*0.000244; 
  $  046.1缸超过200转/分钟的失火数                                      $    $  计数器           $    $  ANS046.BYTE003  $  y=(x1*256+x2)*1; 
  $  047.2缸失火数                                                      $    $  计数器           $    $  ANS047.BYTE003  $  y=(x1*256+x2)*1; 
  $  048.3缸失火数                                                      $    $  计数器           $    $  ANS048.BYTE003  $  y=(x1*256+x2)*1; 
  $  049.4缸失火数                                                      $    $  次               $    $  ANS049.BYTE003  $  y=(x1*256+x2)*1; 
  $  050.上游氧传感器加热器状态-上游氧传感器准备运行                    $    $                   $    $  ANS050.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  051.上游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS050.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  052.上游氧传感器加热器状态-非全功率加热标志位                      $    $                   $    $  ANS050.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  053.下游氧传感器加热器状态-下游氧传感器准备运行                    $    $                   $    $  ANS051.BYTE003  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  054.下游氧传感器加热器状态-全功率加热标志位                        $    $                   $    $  ANS051.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  055.下游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS051.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  056.下游氧传感器加热器状态-非全功率加热标志位                      $    $                   $    $  ANS051.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  057.碳罐负载水平                                                   $    $  千克/时          $    $  ANS052.BYTE003  $  y=(x1*256+x2)*0.00039; 
  $  058.节气门控制-节气门开度1                                         $    $  百分比           $    $  ANS053.BYTE003  $  y=(x)*0.392; 
  $  059.节气门控制-节气门开度2                                         $    $  百分比           $    $  ANS054.BYTE003  $  y=(x)*0.392; 
  $  060.节气门控制-节气门开度                                          $    $  百分比           $    $  ANS055.BYTE003  $  y=(x)*0.392; 
  $  061.节气门控制-节气门位置1传感器电压                               $    $  伏               $    $  ANS056.BYTE003  $  y=(x)*0.00122; 
  $  062.节气门控制-节气门位置2传感器电压                               $    $  伏               $    $  ANS057.BYTE003  $  y=(x)*0.00122; 
  $  063.电子节气门控制(ETC)-节气门相对角度                             $    $  开度             $    $  ANS058.BYTE003  $  y=(x)*0.392; 
  $  064.电子节气门控制(ETC)-跛行回家时节气门位置                       $    $  开度             $    $  ANS059.BYTE003  $  y=(x1*256+x2)*0.001526; 
  $  065.电子节气门控制(ETC)-节气门自适应设置点                         $    $  开度             $    $  ANS060.BYTE003  $  y=(x1*256+x2)*0.001526; 
  $  066.节气门控制机械下止点自适应1传感器电压                          $    $  伏               $    $  ANS061.BYTE003  $  y=(x)*0.01953125; 
  $  067.节气门控制机械下止点自适应2传感器电压                          $    $  伏               $    $  ANS062.BYTE003  $  y=(x)*0.01953125; 
  $  068.混合气自学习值                                                 $    $                   $    $  ANS063.BYTE003  $  y=3e-05*(x1*256+x2); 
  $  069.自动变速器挡位                                                 $    $                   $    $  ANS064.BYTE003  $  switxh(x)4294967295:@04cd;0x00:@092b;0x01:@0044;0x02:@0045;0x03:@0046;0x04:@0047;0x05:@0067;0x06:@0068;0x07:@0069;0x08:@04fa; 
  $  070.手动变速器变速器速比                                           $    $                   $    $  ANS065.BYTE003  $  if(0x80>x)y=(x)*0.01;elsey=(x-0xFF)*0.01; 
  $  071.手动变速器齿数比                                               $    $                   $    $  ANS066.BYTE003  $  y=(x)*1; 
  $  072.主动限速系统目标速度                                           $    $  千米/时          $    $  ANS067.BYTE003  $  y=(x1*256+x2)*0.0078; 
  $  073.巡航控制目标速度                                               $    $  千米/时          $    $  ANS068.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.01;elsey=(x1*256+x2-0xFFFF)*0.01; 
  $  074.巡航加速度                                                     $    $  米/秒平方        $    $  ANS069.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.001;elsey=(x1*256+x2-0xFFFF)*0.001; 
  $  075.外部环境温度(动力总成估计)                                     $    $  度               $    $  ANS070.BYTE003  $  y=(x)*0.5-40; 
  $  076.发动机扭矩结构-附件设备请求的扭矩                              $    $  牛米             $    $  ANS071.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  077.发动机扭矩结构-发动机内部阻力扭矩                              $    $  牛米             $    $  ANS072.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  078.发动机扭矩结构-摩擦扭矩自适应偏差值                            $    $  牛米             $    $  ANS073.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  079.发动机扭矩结构-最大可得到的指示扭矩                            $    $  牛米             $    $  ANS074.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  080.发动机扭矩结构-最小可得到的指示扭矩                            $    $  牛米             $    $  ANS075.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  081.发动机扭矩结构-空调压缩机请求的扭矩                            $    $  牛米             $    $  ANS076.BYTE003  $  if(0x80>x)y=(x)*0.1;elsey=(x-0xFF)*0.1; 
  $  082.发动机扭矩结构-冷却风扇请求的扭矩                              $    $  牛米             $    $  ANS077.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  083.发动机扭矩结构-指示扭矩实际值                                  $    $  百分比           $    $  ANS078.BYTE003  $  y=(x1*256+x2)*0.0015; 
  $  084.发动机扭矩结构-发动机输出有效扭矩                              $    $  牛米             $    $  ANS079.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  085.发动机扭矩结构-最大速度控制扭矩                                $    $  牛米             $    $  ANS080.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  086.中压开关状态                                                   $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x40)0x00:@093d;0x40:@0208; 
  $  087.冷却风扇 2 继电器状态                                          $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x20)0x00:@093d;0x20:@0206; 
  $  088.冷却风扇 1 继电器状态                                          $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x10)0x00:@093d;0x10:@0206; 
  $  089.冷却风扇配置                                                   $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  090.空调压缩机请求状态                                             $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  091.空调离合器继电器状态                                           $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x02)0x00:@093d;0x02:@0206; 
  $  092.空调配置                                                       $    $                   $    $  ANS081.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  093.空调高低压开关状态                                             $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x02)0x00:@093d;0x02:@0208; 
  $  094.来自CAN的空调压缩机请求(ETC)                                   $    $                   $    $  ANS081.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  095.错误存在-驾驶员请求命令 2                                      $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  096.错误存在-驾驶员请求命令1                                       $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  097.机动化节气门控制器故障发生                                     $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  098.机动化节气门故障发生                                           $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  099.故障发生-节气门位置2传感器                                     $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  100.故障发生-节气门位置1传感器                                     $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  101.错误发生-曲轴信号                                              $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  102.故障现象-凸轮轴信号                                            $    $                   $    $  ANS082.BYTE003  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  103.燃油泵继电器故障发生                                           $    $                   $    $  ANS082.BYTE004  $  switxh(x&0x40)0x00:@06e1;0x40:@06e2; 
  $  104.喷油器4故障发生                                                $    $                   $    $  ANS082.BYTE004  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  105.喷油器3故障发生                                                $    $                   $    $  ANS082.BYTE004  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  106.喷油器2故障发生                                                $    $                   $    $  ANS082.BYTE004  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  107.喷油器1故障发生                                                $    $                   $    $  ANS082.BYTE004  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  108.错误发生-进气温度信号                                          $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  109.错误发生-歧管压力传感器                                        $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  110.错误发生-空气流量信号                                          $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  111.故障发生-发动机冷却液温度传感器                                $    $                   $    $  ANS082.BYTE005  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  112.故障现象-下游氧传感器                                          $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  113.错误发生-上游氧传感器                                          $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x10)0x00:@06e1;0x10:@06e2; 
  $  114.错误发生-爆震传感器                                            $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  115.故障发生-排气相位控制阀                                        $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  116.故障发生-进气相位控制阀                                        $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  117.错误发生-点火线圈                                              $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  118.引入的车身控制模块（BCM） CAN帧故障                            $    $                   $    $  ANS082.BYTE007  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  119.故障发生-输入的TCM CAN信号                                     $    $                   $    $  ANS082.BYTE007  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  120.引入的ABS CAN帧故障发生                                        $    $                   $    $  ANS082.BYTE007  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  121.故障发生-CAN总线关闭                                           $    $                   $    $  ANS082.BYTE007  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  122.错误发生-冷却风扇控制                                          $    $                   $    $  ANS082.BYTE008  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  123.错误发生-制动真空度传感器                                      $    $                   $    $  ANS082.BYTE009  $  switxh(x&0x80)0x00:@06e1;0x80:@06e2; 
  $  124.碳罐电磁阀故障发生                                             $    $                   $    $  ANS082.BYTE009  $  switxh(x&0x20)0x00:@06e1;0x20:@06e2; 
  $  125.故障发生-驻车挡/空挡硬线输入                                   $    $                   $    $  ANS082.BYTE009  $  switxh(x&0x08)0x00:@06e1;0x08:@06e2; 
  $  126.错误发生-倒档开关                                              $    $                   $    $  ANS082.BYTE009  $  switxh(x&0x04)0x00:@06e1;0x04:@06e2; 
  $  127.错误发生-离合器开关                                            $    $                   $    $  ANS082.BYTE009  $  switxh(x&0x02)0x00:@06e1;0x02:@06e2; 
  $  128.故障发生-制动灯开关或制动位置传感器                            $    $                   $    $  ANS082.BYTE009  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  129.错误发生-起动继电器1                                           $    $                   $    $  ANS082.BYTE010  $  switxh(x&0x01)0x00:@06e1;0x01:@06e2; 
  $  130.飞轮自适应学习过程完成状态                                     $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  131.飞轮自适应学习错误标志                                         $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  132.发动机正在运行                                                 $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  133.发动机喷油点火信号同步完成                                     $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  134.发动机停止                                                     $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  135.点火状态-起动                                                  $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  136.点火状态-运行                                                  $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  137.节气门跛行回家激活                                             $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  138.发动机满负荷阶段                                               $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  139.发动机倒拖断油阶段                                             $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  140.发动机倒拖阶段                                                 $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  141.发动机怠速阶段                                                 $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  142.发动机起动阶段                                                 $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  143.下游氧传感器加热器状态-全功率加热标志位                        $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x80)0x00:@09b4;0x80:@0365; 
  $  144.上游氧传感器加热器状态-最大功率加热条件已达到                  $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x40)0x00:@09b4;0x40:@0365; 
  $  145.下游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x20)0x00:@09b4;0x20:@0365; 
  $  146.上游氧传感器加热器状态-催化器超过露点标志位                    $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x10)0x00:@09b4;0x10:@0365; 
  $  147.下游氧传感器准备运行                                           $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  148.上游氧传感器准备运行                                           $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  149.闭环控制激活                                                   $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  150.前氧传感器检测混合气浓                                         $    $                   $    $  ANS083.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  151.倒档开关状态                                                   $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x80)0x00:@093d;0x80:@0208; 
  $  152.离合器开关状态                                                 $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x40)0x00:@093d;0x40:@0208; 
  $  153.制动开关 2 状态                                                $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x20)0x00:@093d;0x20:@0208; 
  $  154.制动开关 1 状态                                                $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x10)0x00:@093d;0x10:@0208; 
  $  155.燃油泵继电器状态                                               $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x08)0x00:@093d;0x08:@0206; 
  $  156.VCT排气执行器已就绪(VVT)                                       $    $                   $    $  ANS084.BYTE005  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  157.VCT排气执行器状态                                              $    $                   $    $  ANS084.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  158.VCT进气执行器已就绪(VVT)                                       $    $                   $    $  ANS084.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  159.VCT进气执行器状态                                              $    $                   $    $  ANS084.BYTE005  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  160.碰撞CAN信号输入状态                                            $    $                   $    $  ANS084.BYTE005  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  161.炭罐状态                                                       $    $                   $    $  ANS084.BYTE005  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  162.驻车挡/空挡开关状态                                            $    $                   $    $  ANS084.BYTE005  $  switxh(x&0x01)0x00:@093d;0x01:@0208; 
  $  163.后氧传感器加热器状态                                           $    $                   $    $  ANS084.BYTE006  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  164.前氧传感器加热状态                                             $    $                   $    $  ANS084.BYTE006  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  165.发动机DBW灯状态                                                $    $                   $    $  ANS084.BYTE006  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  166.发动机MIL灯状态                                                $    $                   $    $  ANS084.BYTE006  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  167.防盗状态-数据传输已存储并锁定                                  $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  168.防盗状态-数据传输已完成                                        $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  169.防盗状态-数据传输超时                                          $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  170.防盗状态-数据传输已开始                                        $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  171.防盗状态-密钥和PIN码未存储                                     $    $                   $    $  ANS085.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  172.防盗状态-防盗功能激活状态                                      $    $                   $    $  ANS085.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  173.防盗状态-ECU状态                                               $    $                   $    $  ANS085.BYTE004  $  switxh(x&0x10)0x00:@001f;0x10:@06fb; 
  $  174.防盗状态-响应有效-正确的格式                                   $    $                   $    $  ANS085.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  175.防盗状态-响应无效-正确的格式                                   $    $                   $    $  ANS085.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  176.防盗状态-响应无效-错误的格式                                   $    $                   $    $  ANS085.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  177.防盗状态-报文发送                                              $    $                   $    $  ANS085.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  178.主动限速控制状态                                               $    $                   $    $  ANS086.BYTE003  $  switxh(x&0xE0)0x00:@002e;0x20:@0030;0x40:@07e4;0x60:@07e5;0x80:@0452;0xA0:@0084; 
  $  179.巡航控制状态                                                   $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x1C)0x00:@002e;0x04:@091c;0x08:@091d;0x0C:@091e;0x10:@0370;0x14:@0920;0x18:@0004; 
  $  180.车速控制-车速单位                                              $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x02)0x00:@06e3;0x02:@08d5; 
  $  181.车速控制-驾驶员加速踏板优先                                    $    $                   $    $  ANS086.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  182.巡航控制-车速控制输入暂停请求                                  $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  183.巡航控制-车速控制输入恢复请求                                  $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  184.巡航控制-车速控制输入减速请求(按下并保持)                      $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  185.巡航控制-车速控制输入减速请求(轻按)                            $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  186.巡航控制-车速控制输入加速请求(按下并保持)                      $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  187.巡航控制-车速控制输入加速请求(轻按)                            $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  188.巡航控制-巡航主开关输入                                        $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  189.巡航控制-巡航激活指示灯可用                                    $    $                   $    $  ANS086.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  190.巡航控制-巡航待命指示灯可用                                    $    $                   $    $  ANS086.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  191.巡航控制-制动踏板踩下                                          $    $                   $    $  ANS086.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  192.巡航控制-离合器踏板踩下                                        $    $                   $    $  ANS086.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  193.巡航禁用-开关信号一致性                                        $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  194.巡航禁用-安全监控中                                            $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  195.巡航禁用-一般故障状态                                          $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  196.巡航禁用-安全气囊点爆                                          $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  197.巡航禁用-巡航主开关按下                                        $    $                   $    $  ANS087.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  198.巡航禁用-车速未达到进入阀值                                    $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  199.巡航禁用-远高于巡航目标速度                                    $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  200.巡航禁用-远低于巡航目标速度                                    $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  201.巡航禁用-制动踏板踩下                                          $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  202.巡航禁用-离合器踏板踩下或挡位改变                              $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  203.巡航禁用-挡位超限                                              $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  204.巡航禁用-发动机转速超限                                        $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  205.巡航禁用-扭矩干预                                              $    $                   $    $  ANS087.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  206.巡航禁用-强制降挡                                              $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  207.巡航禁用-蓄电池电压低                                          $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  208.巡航禁用-发动机故障警告指示(DBW)灯亮                           $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  209.巡航禁用-加速踏板                                              $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  210.巡航禁用-车速信号异常                                          $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  211.巡航禁用-电子节气门控制故障                                    $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  212.巡航禁用-驾驶员操作异常                                        $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  213.巡航禁用-发动机转速超限                                        $    $                   $    $  ANS087.BYTE006  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  214.催化就绪标志                                                   $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  215.下游氧传感器准备就绪                                           $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  216.上游氧传感器准备就绪                                           $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  217.燃油系统的就绪标志                                             $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  218.B4 类失火就绪标志                                              $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  219.B1 类失火就绪标志                                              $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  220.A类失火就绪标志                                                $    $                   $    $  ANS088.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  221.综合零件监视状态                                               $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  222.燃油系统监控状态                                               $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  223.失火监控状态                                                   $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  224.支持综合零件监视                                               $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  225.支持燃油系统监控                                               $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  226.支持失火监控                                                   $    $                   $    $  ANS088.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  227.氧传感器加热器监控                                             $    $                   $    $  ANS088.BYTE005  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  228.氧传感器监控                                                   $    $                   $    $  ANS088.BYTE005  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  229.催化器监控                                                     $    $                   $    $  ANS088.BYTE005  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  230.启停-下次起动后蓄电池电压                                      $    $  伏               $    $  ANS089.BYTE003  $  y=(x)*0.1; 
  $  231.启停-制动真空压力                                              $    $  百帕             $    $  ANS090.BYTE003  $  y=(x1*256+x2)*0.0039; 
  $  232.进气凸轮轴目标相位                                             $    $  曲轴转角         $    $  ANS091.BYTE003  $  if(0x80>x)y=(x)*0.0078125;elsey=(x-0xFF)*0.0078125; 
  $  233.排气凸轮轴目标相位                                             $    $  曲轴转角         $    $  ANS092.BYTE003  $  if(0x80>x)y=(x)*0.0078125;elsey=(x-0xFF)*0.0078125; 
  $  234.环境压力修正系数                                               $    $                   $    $  ANS093.BYTE003  $  y=(x1*256+x2)*0.00006; 
  $  235.发动机DBW灯亮后行驶里程值                                      $    $  千米             $    $  ANS094.BYTE003  $  y=(x1*256+x2)*1; 
  $  236.EVP工作频率                                                    $    $  赫兹             $    $  ANS095.BYTE003  $  y=(x1*16777216+x2*65536+x3*256+x4)*1; 
  $  237.EVP工作时间                                                    $    $  秒               $    $  ANS096.BYTE003  $  y=(x1*256+x2)*40.96; 
  $  238.远程起动-系统状态-动力总成运行退出                             $    $                   $    $  ANS097.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  239.远程起动-系统状态-动力总成起动退出                             $    $                   $    $  ANS097.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  240.远程起动-系统状态-发动机运行                                   $    $                   $    $  ANS097.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  241.远程起动-系统状态-系统状态                                     $    $                   $    $  ANS097.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  242.远程起动-系统状态-系统请求                                     $    $                   $    $  ANS097.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  243.远程起动-动力总成起动退出原因-车速超过限值                     $    $                   $    $  ANS098.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  244.远程起动-动力总成起动退出原因-换挡杆不在驻车挡位置             $    $                   $    $  ANS098.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  245.远程起动-动力总成起动退出原因-车辆发生碰撞                     $    $                   $    $  ANS098.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  246.远程起动-动力总成起动退出原因-动力总成状态禁用                 $    $                   $    $  ANS098.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  247.远程起动-动力总成起动退出原因-变速器状态禁用                   $    $                   $    $  ANS098.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  248.远程起动-动力总成起动退出原因-起动机达到最大起动时间           $    $                   $    $  ANS098.BYTE004  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  249.远程起动-动力总成起动退出原因-发动机故障灯亮                   $    $                   $    $  ANS098.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  250.远程起动-动力总成起动退出原因-与GW或SCS/ABS或TCM失去通讯       $    $                   $    $  ANS098.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  251.远程起动-动力总成起动退出原因-燃油油量太低                     $    $                   $    $  ANS098.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  252.远程起动-动力总成起动退出原因-KL15硬线被断开                   $    $                   $    $  ANS098.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  253.远程起动-动力总成运行退出原因-与GW或SCS/ABS或TCM失去通讯       $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x80)0x00:@0022;0x80:@0021; 
  $  254.远程起动-动力总成运行退出原因-加速踏板踩下                     $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x40)0x00:@0022;0x40:@0021; 
  $  255.远程起动-动力总成运行退出原因-发动机转速超过限值               $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x20)0x00:@0022;0x20:@0021; 
  $  256.远程起动-动力总成运行退出原因-车速超过限值                     $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x10)0x00:@0022;0x10:@0021; 
  $  257.远程起动-动力总成运行退出原因-换挡杆不在驻车挡位置             $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  258.远程起动-动力总成运行退出原因-超过最大允许运行时间             $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  259.远程起动-动力总成运行退出原因-机油压力低                       $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  260.远程起动-动力总成运行退出原因-发动机过热                       $    $                   $    $  ANS099.BYTE003  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  261.远程起动-动力总成运行退出原因-KL15硬线被断开                   $    $                   $    $  ANS099.BYTE004  $  switxh(x&0x08)0x00:@0022;0x08:@0021; 
  $  262.远程起动-动力总成运行退出原因-未知原因                         $    $                   $    $  ANS099.BYTE004  $  switxh(x&0x04)0x00:@0022;0x04:@0021; 
  $  263.远程起动-动力总成运行退出原因-发动机故障灯亮                   $    $                   $    $  ANS099.BYTE004  $  switxh(x&0x02)0x00:@0022;0x02:@0021; 
  $  264.远程起动-动力总成运行退出原因-车辆发生碰撞                     $    $                   $    $  ANS099.BYTE004  $  switxh(x&0x01)0x00:@0022;0x01:@0021; 
  $  265.发动机冷却液温度散热器                                         $    $  摄氏度           $    $  ANS100.BYTE003  $  y=(x1*256+x2)*0.1-273.14; 
  $  266.发动机冷却液温度散热器电压值                                   $    $  伏               $    $  ANS101.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0002;elsey=(x1*256+x2-0xFFFF)*0.0002; 
  $  267.周围空气温度                                                   $    $  摄氏度           $    $  ANS102.BYTE003  $  y=(x)*0.75-48; 
  $  268.环境空气温度电压值                                             $    $  伏               $    $  ANS103.BYTE003  $  y=(x)*0.01953125; 
  $  269.燃油箱压力电压值                                               $    $  伏               $    $  ANS104.BYTE003  $  y=(x1*256+x2)*0.0048828125; 
  $  270.制动真空电压原始值                                             $    $  伏               $    $  ANS105.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  271.驾驶员施加的制动踏板压力                                       $    $  千帕             $    $  ANS106.BYTE003  $  y=(x)*75; 
  $  272.ECM内部碰撞检测计数                                            $    $  计数             $    $  ANS107.BYTE003  $  y=(x)*1; 
  $  273.启停-发电机目标电压                                            $    $  伏               $    $  ANS108.BYTE003  $  y=(x)*0.1+10.6; 
  $  274.启停-发电机负载循环反馈                                        $    $  百分比           $    $  ANS109.BYTE003  $  y=(x)*3; 
  $  275.车轮路噪                                                       $    $  米每平方秒       $    $  ANS110.BYTE003  $  y=(x)*0.217; 
  $  276.Lambda读取值                                                   $    $                   $    $  ANS111.BYTE003  $  y=(x1*256+x2)*0.000244; 
  $  277.空气质量流量原始值                                             $    $  伏               $    $  ANS112.BYTE003  $  y=(x1*256+x2)*0.00488; 
  $  278.开环                                                           $    $                   $    $  ANS113.BYTE003  $  switxh(x&0x20)0x00:@002e;0x20:@0037; 
  $  279.发动机控制状态-空燃比闭环控制置位                              $    $                   $    $  ANS113.BYTE003  $  switxh(x&0x10)0x00:@002e;0x10:@0037; 
  $  280.发动机控制状态-怠速控制置位                                    $    $                   $    $  ANS113.BYTE003  $  switxh(x&0x08)0x00:@002e;0x08:@0037; 
  $  281.发动机控制状态-发动机怠速中                                    $    $                   $    $  ANS113.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  282.发动机控制状态-发动机起动完成                                  $    $                   $    $  ANS113.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  283.发动机控制状态-发动机起动中                                    $    $                   $    $  ANS113.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  284.1缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS114.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0071;elsey=(x1*256+x2-0xFFFF)*0.0071; 
  $  285.2缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS115.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0071;elsey=(x1*256+x2-0xFFFF)*0.0071; 
  $  286.3缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS116.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0071;elsey=(x1*256+x2-0xFFFF)*0.0071; 
  $  287.4缸发动机粗糙度值                                              $    $  (Umdr/sec)^2     $    $  ANS117.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.0071;elsey=(x1*256+x2-0xFFFF)*0.0071; 
  $  288.发动机关闭时间                                                 $    $  秒               $    $  ANS118.BYTE003  $  if(128>x1)y=(x1*16777216+x2*65536+x3*256+x4)*0.5;elsey=(x1*16777216+x2*65536+x3*256+x4)*0.5-2147483648; 
  $  289.发动机起动后燃油消耗量(GDI)                                    $    $  毫升             $    $  ANS119.BYTE003  $  y=(x1*256+x2)*16; 
  $  290.怠速积分器I部分                                                $    $  百分比           $    $  ANS120.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.00305;elsey=(x1*256+x2-0xFFFF)*0.00305; 
  $  291.爆震窗口角度初始值                                             $    $  度               $    $  ANS121.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.02197;elsey=(x1*256+x2-0xFFFF)*0.02197; 
  $  292.爆震窗口角度                                                   $    $  秒               $    $  ANS122.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.02197;elsey=(x1*256+x2-0xFFFF)*0.02197; 
  $  293.爆震能量                                                       $    $  伏特             $    $  ANS123.BYTE003  $  y=7.63e-05*(x1*256+x2); 
  $  294.上游氧传感器循环时间                                           $    $  秒               $    $  ANS124.BYTE003  $  y=(x1*256+x2)*0.01; 
  $  295.压缩机请求                                                     $    $                   $    $  ANS125.BYTE003  $  switxh(x)0x00:@0204;0x01:@0205;0x02:@0206; 
  $  296.速度辅助系统模式                                               $    $                   $    $  ANS126.BYTE003  $  switxh(x)0x00:@002e;0x01:@0c95;0x02:@0c96;0x03:@0c97; 
  $  297.速度辅助系统状态                                               $    $                   $    $  ANS127.BYTE003  $  switxh(x)0x00:@002e;0x01:@002f;0x02:@0030;0x03:@0031;0x04:@07e4;0x05:@0070;0x06:@0c94; 
  $  298.速度辅助系统目标速度                                           $    $  千米/时          $    $  ANS128.BYTE003  $  y=(x1*256+x2)*0.0625; 
  $  299.速度辅助系统目标速度来源状态                                   $    $                   $    $  ANS129.BYTE003  $  switxh(x)0x00:@00e8;0x01:@0af1;0x02:@0af2;0x03:@0070; 
  $  300.发电机负载                                                     $    $  牛米             $    $  ANS130.BYTE003  $  if(0x8000>(x1*256+x2))y=(x1*256+x2)*0.1;elsey=(x1*256+x2-0xFFFF)*0.1; 
  $  301.底盘系统发动机扭矩请求扩展范围-扭矩干预类型                    $    $                   $    $  ANS131.BYTE003  $  switxh(x)0x00:@0022;0xFF:@0021; 
  $  302.底盘系统发动机扭矩请求扩展范围-扭矩请求值                      $    $  牛米             $    $  ANS132.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  303.发动机扭矩结构-发动机稳态实际扭矩(GDI)                         $    $  牛米             $    $  ANS133.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  304.发动机扭矩结构-发动机无变速器稳态扭矩                          $    $  牛米             $    $  ANS134.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  305.驾驶需要的发动机扭矩                                           $    $  牛米             $    $  ANS135.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  306.发动机扭矩结构-发动机预测稳态扭矩                              $    $  牛米             $    $  ANS136.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  307.动力传输得到的曲轴扭矩请求反馈类型                             $    $                   $    $  ANS137.BYTE003  $  switxh(x)0x00:@00e7;0x01:@0c98;0x02:@0c99;0x03:@0c9a; 
  $  308.动力传输得到的的曲轴扭矩请求值                                 $    $  牛米             $    $  ANS138.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  309.动力传输预期的曲轴扭矩请求干涉类型                             $    $                   $    $  ANS139.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0c8d;0x02:@0c8e; 
  $  310.变速器预测曲轴扭矩-请求值                                      $    $  牛米             $    $  ANS140.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  311.动力传输发动机速度请求控制响应                                 $    $                   $    $  ANS141.BYTE003  $  switxh(x)0x00:@0bee;0x01:string();0x02:@0bef;0x03:@0bf0; 
  $  312.动力传输发动机速度请求干涉类型                                 $    $                   $    $  ANS142.BYTE003  $  switxh(x)0x00:@0bee;0x01:@0c8d;0x02:@0c8e;0x03:@0c8f; 
  $  313.动力传输发动机速度请求速度值                                   $    $  转/分钟          $    $  ANS143.BYTE003  $  y=(x1*256+x2)*8; 
  $  314.动力传输曲轴扭矩负荷                                           $    $  牛米             $    $  ANS144.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  315.自适应巡航-主动紧急制动-扭矩请求状态                           $    $                   $    $  ANS145.BYTE003  $  switxh(x)0x00:@0022;0xFF:@0021; 
  $  316.自适应巡航-主动紧急制动-扭矩请求值                             $    $  牛米             $    $  ANS146.BYTE003  $  y=(x1*256+x2)*0.5-848; 
  $  317.自适应巡航-主动紧急制动-减速请求状态                           $    $                   $    $  ANS147.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0c1f;0x02:@0c20;0x03:@0c21; 
  $  318.自适应巡航-扭矩请求响应-动力总成                               $    $                   $    $  ANS148.BYTE003  $  switxh(x)0x00:@00e2;0x01:@0b8c;0x02:@0b8d;0x03:@0c21; 
  $  319.故障发生-起动挡硬线信号                                        $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  320.故障发生-附件挡硬线信号                                        $    $                   $    $  ANS082.BYTE006  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  321.错误发生-输入的SDM CAN信号                                     $    $                   $    $  ANS082.BYTE007  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  322.错误发生-输入的SAS CAN信号                                     $    $                   $    $  ANS082.BYTE007  $  switxh(x&0x20)0x00:@002e;0x20:@0037; 
  $  323.故障发生-车辆发生碰撞或碰撞信号不合理                          $    $                   $    $  ANS082.BYTE008  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  324.故障发生-起动机继电器反馈(启停)                                $    $                   $    $  ANS082.BYTE010  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  325.错误发生-离合器位置传感器                                      $    $                   $    $  ANS082.BYTE010  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  326.点火状态-附件                                                  $    $                   $    $  ANS083.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  327.节气门关闭                                                     $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x40)0x00:@002e;0x40:@0037; 
  $  328.启动阶段后的发动机                                             $    $                   $    $  ANS083.BYTE005  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  329.主继电器状态                                                   $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  330.起动继电器状态                                                 $    $                   $    $  ANS084.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  331.经济驾驶模式激活指示灯点亮                                     $    $                   $    $  ANS084.BYTE008  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  332.巡航控制-车速控制输入设置请求                                  $    $                   $    $  ANS086.BYTE004  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 
  $  333.扭矩信号-发动机扭矩减少失效状态                                $    $                   $    $  ANS149.BYTE003  $  switxh(x&0xE0)0x00:@009b;0x20:@009d;0x40:@009d;0x60:@009e;0x80:@009f; 
  $  334.扭矩信号-电子稳定程序(ESP)请求发动机扭矩减少激活               $    $                   $    $  ANS149.BYTE003  $  switxh(x&0x04)0x00:@002e;0x04:@0037; 
  $  335.扭矩信号-动态稳定控制系统(SCS)激活                             $    $                   $    $  ANS149.BYTE003  $  switxh(x&0x02)0x00:@002e;0x02:@0037; 
  $  336.扭矩信号-牵引控制系统(TCS)激活                                 $    $                   $    $  ANS149.BYTE003  $  switxh(x&0x01)0x00:@002e;0x01:@0037; 
  $  337.错误发生-高压油泵控制阀                                        $    $                   $    $  ANS082.BYTE004  $  switxh(x&0x80)0x00:@002e;0x80:@0037; 

;******************************************************************************************************************************************************

